{
    "id": 1177,
    "video_id": "Fahb1rQ69Mk",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "How the Video Game Industry Has Evolved - Kinda Funny Gamescast Ep. 35 (Pt. 1)",
    "description": "We've been around a long time; what's changed and what does it mean?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nSubscriber to Kristine: https://www.youtube.com/user/kristinesteimer?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441630801,
    "duration": 2545,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to the Kinda Funny Gamescast episode 35, the first and last ever. I'm your host Greg Miller alongside the coolest couple in video games, touch each other sexy like, yeah, one and only Nick Scarpino from Kinda Funny Games. Hi. And then of course, Christine S. Daniel to **** off from SteimerSays.com. Tell Daniel to **** off, Danielle. Oh, you're, yeah, tell your wife to **** up. I'll, I, I'm your boyfriend and I'm right here. I know, but you already know I established that's what's happening. Um, we're here without Tim and without Colin because they are sick with the Pax plague. They call it this was actually my doing. I was like, they're never going to invite me on any of their podcasts. So what I have to do is while they're at PAX, I have to just make sure that they eat something with this strain, this virus. If I can infect them, so three-fifths Kevin's sick too. If three of the Kinda Funny crew goes down, they'll have to use me desperate enough to ask it.",
            "start": 0.31
        },
        {
            "text": "that they eat something with this strain, this virus. If I can infect them, so three-fifths Kevin's sick too. If three of the Kinda Funny crew goes down, they'll have to use me desperate enough to ask it was perfectly calculated. And here's why, because had it been one more person, we would, right? One less person, one fewer person, which I should say, we'd have been screwed. We couldn't have set it up at all. So you, you, you, you calculated the perfect amount of people to knock out. Yeah, good move on her part. And it's great. Yeah. And then, but I honestly believe they would have had you rather than me on this. I'll be honest with you right there, because I am when, when you hit me, you're at below the bottom of the barrel as far. No, Nikki, we love you. I get a lot of nice comments online, people supporting. I should play games more. I should talk about games more. But my, my knowledge of games compared to you guys is so thin. Then, yeah, that's Colin say, does he say it that way? Yeah, he says anything with a 'th' is 'then' does.",
            "start": 53.48
        },
        {
            "text": "games more. I should talk about games more. But my, my knowledge of games compared to you guys is so thin. Then, yeah, that's Colin say, does he say it that way? Yeah, he says anything with a 'th' is 'then' does. Interesting. You never noticed that? Really? No. Ask him to say thoroughly. Okay, say thoroughly. See, I can't. But I'm in such a glass house on that one, because I'm the guy who says roof and I just can't. And I don't even know what wrong. Fun at some point. Roof, roof. I think Colin calls dogs 'woofs'. Colin, that's funny. I think actually enjoys saying it differently. Yeah, because he emphasizes it. You know what I mean? Guess he'll put the extra emphasis on it for no reason. So he'll go, I read that book thoroughly, which I guess is actually sounds nor. What are you talking about? S, th, Thor, thorough. You don't say thoroughfare. It's like Cool Whip. He says anything with an 'at'. I can't do it very well. Cool Whip. Cool Whip. Yeah. How do they do it on the show? Is Cool Whip. It's like that. Yeah, yeah. But with thorough, but with thorough.",
            "start": 92.44
        },
        {
            "text": "like Cool Whip. He says anything with an 'at'. I can't do it very well. Cool Whip. Cool Whip. Yeah. How do they do it on the show? Is Cool Whip. It's like that. Yeah, yeah. But with thorough, but with thorough. Thorough, thorough. Like if you didn't know everybody, this is the Kinda Funny Gamescast. Each and every day we come at you with a brand new video game topic. If you want the whole show early, head over to Patreon.com/KindaFunnyGames. Give us a few bucks and there you go. You get it early exclusively each and every Friday. Enjoy it before everybody else. If you have no bucks to throw our way, wait until the next week when we put it up Monday through Thursday, topic by topic until we post the entire show all on YouTube.com/KindaFunnyGames, leading up to putting it on MP3 services and all sorts of stuff. Nick's already looked at. I already did. So to be fair, and so I said, I said, don't put them because since Kevin's not here to monitor anything, we have to have this monitor over here that we can see.",
            "start": 145.52
        },
        {
            "text": "Nick's already looked at. I already did. So to be fair, and so I said, I said, don't put them because since Kevin's not here to monitor anything, we have to have this monitor over here that we can see. And I knew that we were going to lose Nick immediately because if there's one thing Nick loves watching on TV, it's himself. That's true. Uh, but the, the other reason why I'm watching the monitor is to check the audio levels and to make sure they look pretty recording. Well, I realized that the ISO is completely set to a ridiculously high level. There's all sorts of things I'm looking at right now. It's just the camera's gain is, is set to a level that is, is that why Christine looks so much tanner than me? Or she just really that much tanner than me in real life? No, you're just really pale. Okay, good. As long as I knew that. Uh, so it's going to be a normal garbage truck on fire kind of episode where we talk about video games. Also, Portillo is going to come home from uh, Pet Day Camp or whatever in the middle of.",
            "start": 184.8
        },
        {
            "text": "I knew that. Uh, so it's going to be a normal garbage truck on fire kind of episode where we talk about video games. Also, Portillo is going to come home from uh, Pet Day Camp or whatever in the middle of it. So be prepared for that to be a huge break. But now Nick, you kind of stumbled a little bit upon where I want to start this episode. Um, because I think we have some interesting things. What I want to talk about and it's going to be a big question that I'll start giving you examples from so you can all get your little bite-size mandibles around it here. I want to talk about how the video game industry has changed while we've been inside it. Oh, wow. And now I asked this because we just did PAX outside of the PAX Rumble being awesome and you know, evacuating outside of everybody getting sick, all this different stuff. For me, it was this very telling system of like, man, this is like my, I mean, in the industry as far as like, you know, it would have been, this would have been eight years at IGN, right? So I.",
            "start": 217.68
        },
        {
            "text": "different stuff. For me, it was this very telling system of like, man, this is like my, I mean, in the industry as far as like, you know, it would have been, this would have been eight years at IGN, right? So I probably, this is probably my sixth PAX and I didn't go to the first one and then I got six somewhere in the middle, right? Yep. Um, being there and seeing how much it has changed and just in, you know, the microcosm of my own video game career, right? And the fact of like, you know, it was our, it's two years of doing the PAX Rumble now or whatever, right? And the fact that it's when we first started, it was, it was, I remember it was Tim Schafer and it was a couple other guys from Double Fine and it was me and it was Mitch from IGN and there was all the, it was developers and press and this was the one where there was so many indie developers, people I had never met before. And then Smosh Games was part of it too. And it was just like the way this is block, not that event, but PAX itself into being.",
            "start": 254.72
        },
        {
            "text": "one where there was so many indie developers, people I had never met before. And then Smosh Games was part of it too. And it was just like the way this is block, not that event, but PAX itself into being something that everyone has a part in. It got me getting real nostalgic for what's happened in the timeline we've been here. And so like my career is well journaled here on Kinda Funny, right? Like, you know, I've been, I started here to write reviews and then ended up now being this video game host, right? Christine, you worked at Edelman. That was your first everywhere. Literally worked at like every single, almost every job you can have in this ind. Well, you were Edelman PR. Yep. When that, that was the PR arm for Microsoft at the time. Are they still? I think so. I think I get a lot of emails from people who Joe works there. Joe was my boss once upon a time. Um, so yeah, they still do work for Microsoft Game Studios. Then you went to IGN, then you went to BioWare, then you went to PlayStation. Let's clarify that.",
            "start": 291.68
        },
        {
            "text": "Joe works there. Joe was my boss once upon a time. Um, so yeah, they still do work for Microsoft Game Studios. Then you went to IGN, then you went to BioWare, then you went to PlayStation. Let's clarify that. Okay. I was just going to say, I didn't move to Edmonton. She made the ending for Mass Effect 3. Oh my God. Send all your comments here. Casey Hudson's been taking it on the chin for a long time for her. No big deal. No, no. And the meanwhile, Nick, you started in this. You fell ass backwards into it, knowing nothing about games. Well, you thought you were going to get a free pack of cigarettes if you came to this interview. Yeah, no, I, I honestly assumed I would be at IGN for just a couple years and just uh, get my resume padded a little bit and learn some stuff about production, then move on. Um, and I stayed there nine years. Were you thinking it would go more Hollywood? Yeah, I mean, I wanted to work in TV and film. Um, but I just didn't have any ends to that. And I was tired of like freelancing. Freelancing is really.",
            "start": 327.68
        },
        {
            "text": "years. Were you thinking it would go more Hollywood? Yeah, I mean, I wanted to work in TV and film. Um, but I just didn't have any ends to that. And I was tired of like freelancing. Freelancing is really hard when you first start off. It gets a little bit easier as you get older because you make the connections and then you're always kind of working and then you're, you're turning down jobs, which is what you want. And that's kind of how people grow in the industry, right? Is you kind of, when you first start off doing anything, you kind of have to take whatever you want. The same with, right? You write for whoever you can write for. You build your resume. You get your foot in the door and you start, you start, you know, learning the skills that you need to actually start, um, to, to be successful. And so I did that with IGN. Came in and it wasn't that I'd never played games before. It was just there was a period in college from freshman year to senior year where I just, I fell out of it. I just, I didn't have any.",
            "start": 367.04
        },
        {
            "text": "with IGN came in and it wasn't that I'd never played games before. It was just there was a period in college from freshman year to senior year where I just, I fell out of it. I just, I didn't have any money, didn't have a console. People did like, I didn't play. I call it my gaming dark years. Like I just during college, I was trying to graduate. So I was studying. Was playing video games. Yeah, exactly. And for me, it started because, you know, video games, I, I didn't even know to be honest, it didn't occur to me that there was video production jobs in the video game industry, right? Right. That just to me, it didn't occur to me that there were even jobs in the video game industry. Yeah, yeah, exactly. Like that's one of those things where you're like, oh, people like people make these. They disappear at the sort. Yeah, it's, it's the same to make. Yeah, exactly. Um, it's very much the same if you're not really into film, right? I mean, you understand that there's celebrities that work on movies, but you don't know that.",
            "start": 398.92
        },
        {
            "text": "yeah, it's, it's the same to make. Yeah, exactly. Um, it's very much the same if you're not really into film, right? I mean, you understand that there's celebrities that work on movies, but you don't know that there's a thousand people working on the film. Yeah, exactly. Uh, so yeah, for me, when I was fortunate enough, my friend worked at GameSpy at the time. Um, which I don't even know if that's an existing brand anymore. GameSpy, GameSpy. They still do spy like the server. No, that's done too. Yeah. So I mean, at the time, IGN, um, which I had never heard of. Isn't that crazy? I'd never heard of IGN before I took the interview. Uh, my friend worked at GameSpy, which was down in Costa Mesa. And they, uh, he worked on their backend tech. And if you'll remember, GameSpy also had an editorial side. Um, I believe Will Tuttle wrote for them. Um, Ryan Scott wrote a bunch of people. We're not doing history. Get to your point. Long story short, as I was like, oh, these people have an editorial staff.",
            "start": 435.68
        },
        {
            "text": "um, I believe Will Tuttle wrote for them. Um, Ryan Scott wrote a bunch of people. We're not doing history. Get to your point. Long story short, as I was like, oh, these people have an editorial staff. Um, they're looking for someone to help them produce some video. And it was down in Costa Mesa. What I didn't realize was that that position wasn't in Costa Mesa. It was supposed to be up in San Francisco. So that's when I took the job there. I was like, ah, there are worst places to live in San Francisco. I thought I'd do it for a couple years and network a little bit and see if I could get move my way back to LA. And, and now you'll never leave. Um, I that was happened a couple times too. There was, there were some folks down in LA that used to run a reputable show down there on TV that uh, no longer exists unfortunately. That I talked to a couple times. I'm sure everyone did. That's the funny thing about games media specifically is there's so, there were so few of them in 2005, 2006 to outlets that it was like you'd.",
            "start": 474.44
        },
        {
            "text": "that I talked to a couple times. I'm sure everyone did. That's the funny thing about games media specifically is there's so, there were so few of them in 2005, 2006 to outlets that it was like you'd go to a party and it would be the same 50 people, right? And of course you talk, you'd have fun and people wouldn't recognize your work and you'd recognize their work and you talk a little bit. Well, see now twice now you've stumbled upon what I'm driving at here in, in the beginning before I introduced the topic. You talked about the fact that you went home last night or that you don't play video games all that often. Told you to play more video games last night. You went home and played Limbo. I did. Which I think is an awesome, awesome game obviously, but an awesome step for you. Was it you who were talking to me about Limbo or is that Tim? That's probably Tim, because I actually Tim was also playing Limbo for some reason. And I think he was like, I think I ran into a game-breaking bug or something. I was like.",
            "start": 512.48
        },
        {
            "text": "to me about Limbo or is that Tim? That's probably Tim, because I actually Tim was also playing Limbo for some reason. And I think he was like, I think I ran into a game-breaking bug or something. I was like, what's that? He's like, well, sometimes we walk along, a little worm falls on my head and makes me go the opposite direction. I was like, that's not a bug. That's a feature of the game. That is like one of the puzzles you need to solve. I was like, no, there's, there's ways. I'm like, I can't remember what those, how to solve it right now. Uncharted. But there's, um, the light changes the direction. Yeah, yeah. So if you, if you hit a light spot, it's actually pretty, it was beautifully done because the first time you see it, you're like, oh ****, I don't know what to do. So you, you're forced to go, to go one direction, right? Not the band. You have to go in a direction, left or right. Um, and it doesn't occur to you until the second or third time that it happens that when you hit the light, because I was like, why, why did I just turn.",
            "start": 546.64
        },
        {
            "text": "the band. You have to go in a direction, left or right. Um, and it doesn't occur to you until the second or third time that it happens that when you hit the light, because I was like, why, why did I just turn around? I just assumed the bug like just wanted me to turn around. Right, right. It's actually become part of the puzzle is when, when you hit a ray of light, like, oh, come on. No, Nick, every now and then I get, he's finally on a point. Christine, you can't do that to him. Yeah. Uh, anyway, so that, that mechanic is awesome. Yeah. So I mean, I came home last night and I was just like, I kind of just, which is such a huge change for you. Usually you go home and you watch Netflix and eat a burrito. I, okay, so to be fair, Portillo's here. Go get Portillo. And you taking a break? Are we stopping this? Am I just, I don't know. Christine, you decide what we do. You played it. Yeah, but I played it a long time ago. I played it when it came out on Xbox. Oh, okay. Yeah. I mean, obviously I'm a little late to the game on this one too. But you know.",
            "start": 584.04
        },
        {
            "text": "you decide what we do. You played it. Yeah, but I played it a long time ago. I played it when it came out on Xbox. Oh, okay. Yeah. I mean, obviously I'm a little late to the game on this one too. But you know, this is, this shows how still how little I know about, um, uh, just PlayStation and gaming in general is that Greg was like, yeah, you know, if you're a PlayStation uh, Gold Member, I guess it's Gold Plus member, excuse me, not Xbox Gold. Yeah, PlayStation Plus. He was like, you know, you get a free game download there. Like free games to download every month. And I was like, oh, cool. I didn't know that. Same with Xbox too. Now they, they just did that this, this year, last year. I, they've done it recently. They started doing. So I went on to look for them. Couldn't find them. And I think I realized I downloaded Limbo a long time ago. So I was like, oh, I already have Limbo. Watch that. Yeah, the store isn't laid out super great. Um, point, point of clarification from my obviously layman's perspective. And I'm sure there are a.",
            "start": 622.92
        },
        {
            "text": "time ago. So I was like, oh, I already have Limbo. Watch that. Yeah, the store isn't laid out super great. Um, point, point of clarification from my obviously layman's perspective. And I'm sure there are a lot of people out there that understand the nuance of it because they've, they've lived with the, with PlayStation for the last two generations. Yeah. Um, well, at least the online portion for last two generations. Yeah, they figured it out. But to me, I'm like, this store is terrible. It doesn't make any sense. The way you search for things is, is cute at first. But then after a while, you're like, I don't really want to type this in like this. Like got to do, which is stupid and shitty is to go to the blog and find out what's new and then go on the store and look for the game and download it. Got it. Okay, that makes sense. Yeah. So, so there was that. And I was also yearning for a little uh, I've been watching Colin play Mega Man for the last like six months. Like since we started this, listen to Colin play Mega Man.",
            "start": 659.92
        },
        {
            "text": "sense. Yeah. So, so there was that. And I was also yearning for a little uh, I've been watching Colin play Mega Man for the last like six months. Like since we started this, listen to Colin play Mega Man. When I go to sleep at night, I still hear the music from the other room. And I'm like, have to text, can you turn it down? Yeah, you're like, I want to get up. So I just text. I was like, well, I never get up. I'm like, I'm already in bed. You sound exactly like my, literally my wife the other day text me two things. She was like, can you turn the TV down and bring me some water? Sure. I'll do both those things. Uh, so yeah, so Colin's been, Colin obviously played through all. Um, is he back? Yeah, he's back. Hey, Buddy. Buddy. He didn't pee when I got. I tried to get him excited out there. He didn't. So even though I really want to touch him, I think I just felt him glaze my leg with a little. God, he's so excited. Man juice. He's so excited. So where, where, where are we at now about the fact that you've changed that this is I'm talking.",
            "start": 695.8
        },
        {
            "text": "to touch him. I think I just felt him glaze my leg with a little. God, he's so excited. Man juice. He's so excited. So where, where, where are we at now about the fact that you've changed that this is I'm talking about the evolution of the industry, but let alone you as a person. Well, there's been a couple different reasons why that's been happening, me too. Um, partially because obviously you guys are a huge influence in my life now. We're all, we all are around each other more than anyone else. Um, and so it's, look at him. He's so cute. Did you miss us? He missed me specifically. He doesn't care about you guys. He needs a little Nick, little boy. Um, oh, okay. Is he peeing? No, he's not. Okay. He's just excited to see everybody right now. Everybody's brand new again. This is now a BarkBox video as well. What? Okay, okay. Decided to be home. He's got to touch everybody. Careful tail. Careful. Okay, wait. Is the tail wagging? He's going to, they could, we don't know. We don't know what's about to happen right now. He gets very excited.",
            "start": 735.52
        },
        {
            "text": "to be home. He's got to touch everybody. Careful tail. Careful. Okay, wait. Is the tail wagging? He's going to, they could, we don't know. We don't know what's about to happen right now. He gets very excited. Um, I think here's, here's, there's a number of factors for me. One is obviously you guys are rubbing off on me. And two is that more and more as I turn to traditional media, there's nothing there anymore for me except for a lot of they good experiences. And don't get me wrong, there's like, for instance, Fear the Walking Dead. I actually particularly like. I like episode one. Having said that though, that is still a variation on a very common theme if you look at it, right? To me specifically, because I've been so immersed in television and film for my entire life. So I watched Fear the Walking Dead. I'm like, oh, this is good because it's more of the same, but it's more of the same, right? Great cast. I could be wrong. Love the, I forget the actress's name who was uh, the, she played the detective in uh, Gone Girl.",
            "start": 776.96
        },
        {
            "text": "oh, this is good because it's more of the same, but it's more of the same, right? Great cast. I could be wrong. Love the, I forget the actress's name who was uh, the, she played the detective in uh, Gone Girl. But she's awesome. The lead guy's awesome from Training Day too. Um, but I'm like, I don't, my wife's like, do you want, no, he was in Training Day as well. Um, also no, there was no Training Day actually. I think there might have been a Training Day too. But I could be. Um, so my wife's like, do you want to watch that? Do you want to watch Ray Donovan? I was like, no, I kind of want to just sit here and like just interact with something in a different way. So I realized that I had Limbo. Then I also went online because I've been watching Colin play Mega Man for the last like eight years. Um, I decided to just go ahead and purchase the, the Legacy Collection, right? Um, and I'm like, cool. So I'm going to just play. I'm thinking I'm just going to play this Limbo game for like five minutes while this Legacy Collection downloads, right? I.",
            "start": 817.52
        },
        {
            "text": "the, the Legacy Collection, right? Um, and I'm like, cool. So I'm going to just play. I'm thinking I'm just going to play this Limbo game for like five minutes while this Legacy Collection downloads, right? I get you. And I'm like, two hours later, I'm like, I have to see how this ends. This is like we were talking about this early on, Colin and Greg Live. But I'm like, this is really good storytelling. Like you, my wife's like, that kid's so cute. What's going on with him? And what's happening? And I'm like, you don't really know. You make it up. Yeah, you really don't. You do make the story up. And you get that. And there's, there's a power to it because there is some imagery and there, there's some juxtaposition of, of, of different elements. I don't want to spoil anything for people. If you haven't played it, go play it. It's really play Limbo, man. **** you. Come on. That was great on Xbox, on PC. Now it's on the Vita. It's on the PlayStation. And it's beautiful. And it's very artistic. And it reminds me of a lot of different things. So, so.",
            "start": 853.32
        },
        {
            "text": "I started playing that. And then like three hours later, I was like, I got to beat this game. And meanwhile, Mega Man Collection, I mean, it's got to only be like 50 megabytes. It'd been downloaded by like two and a half hours ago. Already downloaded. Um, that was, that reminded me of our stream that I just did last week, um, with Britt. And you have to lean in as much. I'm bring. Uh, but we were playing Until Dawn. And it was kind of just like, well, we'll just, we're, you know, maybe, maybe we're almost done. We, we'll just go a little bit more, a little bit more. And then it was 2:30 in the morning and we, we beat the game. But it was a seven hour stream or something. It beat you as well. Yeah, it was, it was fascinating because like, I know if I don't finish this now, I'm probably not going to come back to it. And so I'm ashamed to say, and I know.",
            "start": 887.0
        },
        {
            "text": "seven hour stream or something. It beat you as well. Yeah, it was, it was fascinating because like, I know if I don't finish this now, I'm probably not going to come back to it. And so I'm ashamed to say, and I know this is sacrilege for this channel because we, we, uh, we like to uphold the letter of the law here and never use guides. But I turn, I, I looked at a couple guides just because I was like, I'm a little stuck. And I don't really, and I'm like, I'm having such a good time in this game too. I don't want that, that frustration that comes with every game. I'm just like beyond that in my, our lives are, I don't know if you know this or not, Greg, a little stressful. They're a little stressful and a little busy. A little bit of free time you have, you don't want to spend. I pissed off. So I was like, I got it. I tried it three times. Never. I think the game is designed as you die anyway. Like you're supposed to die over and over and over again. It's kind of, that's the kind of point of it. Yeah. Um, but I got through it. And then.",
            "start": 924.16
        },
        {
            "text": "times never I think the game is designed as you die anyway like you're supposed to die over and over and over again it's kind of that's the kind of point of it yeah um but I got through it and then I'm like oh that was cool and then I ended up playing one level I played Cutman stage and Mega Man and I'm like whoa this game's way harder and little bit a little bit I was like no I'm sorry but but yeah so to to your to your original Point Greg um I think the industry's changed in a lot of ways one I think it's uh he's fine he's fine he's he's a professional at this he hasn't killed himself just yet unlike Kevin um I think it's a lot bigger and I think it's a lot more Broad broader now yes than when I started you have to also remember when I started before I started I started before the iPhone came out and so too the yeah Greg and I started IGN before the I think were you at IGN before the yeah you were um I remember when Craig Harris got his it was a big deal what year did it come out",
            "start": 958.56
        },
        {
            "text": "came out and so too the yeah Greg and I started IGN before the I think were you at IGN before the yeah you were um I remember when Craig Harris got his it was a big deal what year did it come out probably 2006 2007 I want 2007 because I started in 07 yeah okay I graduated college that year I remember distinctly because uh one of our one of our old editors brought it over yeah and we had moved desk remember like you kind of my my my landmarks for where I was in my career was based on where was sitting at the desk like I remember those time period so I remember I'd moved from away from uh over where the PC guys were sitting and then all the way across the office doesn't matter this is completely contextless for everyone um but yeah that was that was before Mobile gaming was I had BlackBerry oh yeah so console gaming was the thing there was Snake there was uh Snake um well remember when we were there Levi Buchanan was the IGN portable guy or whatever and I remember not mobile",
            "start": 992.64
        },
        {
            "text": "BlackBerry oh yeah so console gaming was the thing there was Snake there was uh Snake um well remember when we were there Levi Buchanan was the IGN portable guy or whatever and I remember not mobile P I remember him telling well yeah was so heavy on GBA and everything else and 3DS or well DS you know what I mean yeah all the DS all the DS's uh I remember him talking to me about the fact of like yeah you know like something crazy is happening in Japan like people aren't playing handhelds as much not how it is now they aren't as much and the phone games are going to be there and we're like two or three years behind them and I was like whatever and then yeah the iPhone came and changed everything and the iPhone came and then social media games came and I really think that like uh you know like Facebook games came like Farmville um and those what I saw was I went I saw gaming go from a really really not Niche thing but seen as a niche thing to now um I think people play games in the",
            "start": 1034.08
        },
        {
            "text": "like Facebook games came like Farmville um and those what I saw was I went I saw gaming go from a really really not Niche thing but seen as a niche thing to now um I think people play games in the mainstream without even realize they're playing of course yeah and that's always the argument are they really Gamers 90% of people play games but they're I mean to you know you guys are obviously a lot more into it than I am but from a very from a very casual perspective my qu my answer to that is who cares as long as there's a game being played exactly and money is being put into that market we can we all have jobs we all have something talk about we just need to be able to say we're the biggest industry and slap our dick around exactly I we are continue to be able to say that so fractioning it up break I don't know if this is true at all but I'd like to think that maybe someone I don't know if this fact I'm about to say it's true I'm not saying it's a fact I'm just thinking like you know",
            "start": 1073.12
        },
        {
            "text": "up break I don't know if this is true at all but I'd like to think that maybe someone I don't know if this fact I'm about to say it's true I'm not saying it's a fact I'm just thinking like you know Mobile gaming for some people could be like a gateway drug to oh it is like more you know it's it was for me and that's the problem where like you know like we cuz it makes it okay to not do and that's the thing is like for me it's not about I don't enjoy it it's about it needs to be okay for me to do it right otherwise I feel like I'm wasting time I I'm not an adult I feel like I'm not being you know this was the argument I was having the other day with Colin when it was a one-on-one Gamescast where he was he started going in on on mobile games on opposite side of the day we like that we like that I think that's a good look ridiculous uh where he went it's like Vicki B and say exactly you Pass the Salt what say can you P never mind uh no like uh the fact that he was going in on it and like",
            "start": 1114.92
        },
        {
            "text": "that I think that's a good look ridiculous uh where he went it's like Vicki B and say exactly you Pass the Salt what say can you P never mind uh no like uh the fact that he was going in on it and like you know basically de demonizing they're terrible ruin and I was like no they aren't I understand there's a lot of crap but I think there is good stuff that does bring people in and that's the whole point like the example in our world right now and I mean like what we're doing right now Kinda Funny Games right we just had this week of uh Metal Gear exclusives right and obviously that brought in a huge audience that weren't the best friends the people who watch every video and are super supportive and a lot of them were the normal YouTubers who just went in the comments like these guys **** suck that guy sucks sure sure sure sure sure shut up **** and it was like I was call like yeah this sucks and I you know I don't know if this was a good call for us to do and I'm like it was a great",
            "start": 1155.6
        },
        {
            "text": "that guy sucks sure sure sure sure sure shut up **** and it was like I was call like yeah this sucks and I you know I don't know if this was a good call for us to do and I'm like it was a great call for us to do cuz look at the numbers we're getting in then the growth and he's like yeah but I don't want these people I'm like you're not getting those people you know what I mean like we each one of those videos did a little over 100,000 or right around 100,000 right and we went up in the in a week 10,000 Subs we didn't go up 100,000 Subs we went up 10,000 people who had never heard of us they were like oh these guys are fun to like click this button I want to try them out and see what's going on and that's the that's how this works that's the same thing with mobile where you cast this wide net and you get a whole bunch of crabby games but you get a whole bunch of good stuff and yeah you know my mom's playing games on her I think she's she was one of the people playing Candy Crush or",
            "start": 1193.36
        },
        {
            "text": "net and you get a whole bunch of crabby games but you get a whole bunch of good stuff and yeah you know my mom's playing games on her I think she's she was one of the people playing Candy Crush or something to that effect right and she's not going to go buy a PlayStation for but there are people who would like the Wii was a gateway to my mom getting her first she bought a DS after the Wii and that was I was like what did play it no she had a horse game she couldn't figure out how to feed the horse so the horse kept dying now to her credit I played the game one Christmas for her and I'm like I'll get couldn't figure it out either really just a bad game a shitty ass game well you just walk around there's no way to feed this **** horse it's not like Harvest Moon or anything no it's not no it's not a that's the whole point it's not a good game what was it I want to know some shitty ass horse game so do you think it's too much of a leap to assume and I'm sure there I mean maybe I'm",
            "start": 1224.12
        },
        {
            "text": "no it's not a that's the whole point it's not a good game what was it I want to know some shitty ass horse game so do you think it's too much of a leap to assume and I'm sure there I mean maybe I'm drawing parallels just because of my my experience is just the PAX but but you looking at a game like Lara Croft Go yeah is it it's I don't think it's that big of a leap for someone who is a very Casual Gamer who has an iPhone 6 who's like I just want to download something cool it's four bucks or whatever is five bucks yeah to download that and go oh this is kind of cool there's puzzle elements to this and then see that there's a bigger um experience on a cons waiting for them or on a PC waiting for them and then think huh there's something else out there and I'm not saying that they're that's a huge leap for them going then spending $500 figing out HDMI Works understanding what online is you're doing it and honestly what you're you've done it again tripped on to another one of my points",
            "start": 1258.32
        },
        {
            "text": "a huge leap for them going then spending $500 figing out HDMI Works understanding what online is you're doing it and honestly what you're you've done it again tripped on to another one of my points here of the industry changing in the fact and I think I said this during the panel I hosted the Lara Croft Go panel right and I talked about how the fact of it's a the 10-man team who's working on Lara Croft Go right and they're putting out because they love it and they think it's a cool idea to these mobile games that the guys who did Hitman they found like a calling with it like a freed to do there and what's fascinating is I've talked a lot on this show and every other podcast I've ever been on about the Spectrum and how THQ fell out there is no more middle you have to be AAA or you're Indie right and what you're seeing with them is Square Enix saying that's correct let's make that for us right so Square Enix is like we have AAA and we have people making these mobile games middle area that you",
            "start": 1292.08
        },
        {
            "text": "and what you're seeing with them is Square Enix saying that's correct let's make that for us right so Square Enix is like we have AAA and we have people making these mobile games middle area that you because they shipped it in a year and that's not a a negative thing that's not a bad thing to say you know what I mean like Madden oh God they're on a 9-month cycle they oh they never get to innovate blah these Hitman guys did that with Lara but it's a different game and so you get to bring that in in internal right where you see what's happening in the industry and rather than fight it or or rather than fight it or put all your money into or eggs into one basket right you're trying to accept that new world I'm sorry go ahead I was going to say I'm wondering though what audience you are hitting because I feel like there's there's still Crossover with people who are for lack of a better term hardcore Gamers core Gamers um core Gamers and then but they also play some mobile games I.E. Fallout",
            "start": 1329.84
        },
        {
            "text": "because I feel like there's there's still Crossover with people who are for lack of a better term hardcore Gamers core Gamers um core Gamers and then but they also play some mobile games I.E. Fallout Shelter like the people who grabbed Fallout Shelter probably aren't your mom or dad right so like what Market are you penetrating there with these games I think Lara Croft Go has a great example of Lara Croft Go might do better because it's Lara Croft people know that and they kept it retro you know what I mean so I think it is you're talking about you know that it's not Beyond Reason but not it's not going to be the overwhelming majority of players who go out and toss down $500 and get it but there are going to be those people who are like oh man I played Lara Croft on my PS1 like this thing I have this device it's number one in the App Store I heard it's doing really well cuz it's doing really well critically right you get in there you try it you have fun with you're like oh man I did like Lara I I remember Tomb",
            "start": 1369.48
        },
        {
            "text": "one in the App Store I heard it's doing really well cuz it's doing really well critically right you get in there you try it you have fun with you're like oh man I did like Lara I I remember Tomb Raider maybe I want to look into what's happening with sure sure there's a nostal factor and obviously they're playing on it and I think it obviously works really well for the opposite direction where if you are a console gamer and you're like I really need something fun to play on my my uh uh my phone I'm on fight the PAX or whatever on my train then there's not I don't think that's actually not AAL logic at all cuz now I'm considering doing it I'm like oh **** I got to flight to Vegas like I should download that and just play on my phone and that's the thing and I think you see them I think these games do lay ground work for young people to become core Gamers you know what I mean like that was you know I feel like young people are already core Gamers sure but I mean in this in this",
            "start": 1413.12
        },
        {
            "text": "these games do lay ground work for young people to become core Gamers you know what I mean like that was you know I feel like young people are already core Gamers sure but I mean in this in this respect right cuz like I for me touchscreen and everything else is so foreign you know I mean I played I played Lara Croft Go for the panel and I was like oh these are this is fun and this is relaxing puzzle game and stuff but it's like I'd play Persona 4: Dancing All Night and have buttons and imprints D And So It Goes the opposite where when Ryan Payton originally pitched me République and I was like Jen Hale and David Hayter and it's going to be stealth and I was like this sounds awesome and I got on the plane and played episode one I was like it's cool but I just can't get into this and then it PAX this year I got to go to their Booth which was they had such a huge presence I don't know if you saw this it was over in the G the GungHo GungHo GungHo you know what I'm talking about the",
            "start": 1445.4
        },
        {
            "text": "it PAX this year I got to go to their Booth which was they had such a huge presence I don't know if you saw this it was over in the G the GungHo GungHo GungHo you know what I'm talking about the one that looks like the you that looks like a vibrator uh it was over there that Giant Bomb had an expose once got uh went over there and played it with the PS4 and I mean immediately clicked and I was like **** this is perfect I can't wait to play this game and it's not that it was bad on mobile but that wasn't what I was we grew up with controllers like you know with the Super Nintendo or anything like that but now kids are playing more things on their iPad like literally babies know how to use an iPad which is mindboggling to me so yeah I do wonder if they'll be more inclined to play things on mobile or play things on their iPad and that kind of Stu I think I think it's the same argu arent we're making of like can mobile can we I guess it's it's two sides of the same coin is what I'm",
            "start": 1486.0
        },
        {
            "text": "on mobile or play things on their iPad and that kind of Stu I think I think it's the same argu arent we're making of like can mobile can we I guess it's it's two sides of the same coin is what I'm saying I don't think everybody who's raised on an iPad right now is then looking at a PS4 like man I got to get one of those but you're getting percentages of people who are like maybe it does work the other way where I Loved Lara Croft Go now what's this other Tomb what's Rise of the Tomb Raider let me look into that oh this is something totally different but interesting you get those small percentages those small wins Like Us on YouTube sorry I keep it I keep finding another sentence to make my point even more Ironclad it was Ironclad um you know and for me again as as as someone who views himself as a relative Outsider I think there's a lot of entry points and a lot of roads that lead to that right for me again the idea of where video is at where where um uh specifically uh video services like Hulu",
            "start": 1522.44
        },
        {
            "text": "Outsider I think there's a lot of entry points and a lot of roads that lead to that right for me again the idea of where video is at where where um uh specifically uh video services like Hulu or like Netflix or that is that they require an additional piece of Hardware to be in your living room if you don't have a TV that's you know new newer so my TV um was a quote unquote Smart TV that had the Netflix app but they stopped supporting it and literally there was a thing that popped up it was like this app will not be supported after like August whatever and luckily by then I had a PS4 but I'm like oh **** now I have to acclimate myself to using the PS4 as my media console for my entire living room and my wife has do two and my wife now knows how to turn it on she and now she probably knows more to be perfectly honest she probably knows more about it than I do because that's how my wife rolls cuz she know because my wife has patience like I don't understand why this stupid store has to",
            "start": 1561.68
        },
        {
            "text": "more to be perfectly honest she probably knows more about it than I do because that's how my wife rolls cuz she know because my wife has patience like I don't understand why this stupid store has to like why am I scrolling through letters is for this one thing they have turn off she be like Nick it doesn't power off it just just Powers down and it still keeps work in the background I was like oh oh tell me more about it well on standby mode yes yeah it's on standby mode um I don't like standby mode no one likes standby mode there's there's a lot of weird it's there's a lot of nuances lot great ideas that just don't pan out never panned out well I just don't like it cuz it's in our bedroom and I don't like like it's still makes a sound your PS4 is broken your PS4 needs to be repaired all of my PlayStations have been broken the one in the living room okay all of mine yeah yeah I was going to say the mine in the living room quiet yours is always making noise it just makes like a and well",
            "start": 1603.04
        },
        {
            "text": "my PlayStations have been broken the one in the living room okay all of mine yeah yeah I was going to say the mine in the living room quiet yours is always making noise it just makes like a and well the thing is I just don't feel like we really sit there and notice it in the living room it's a bigger space but when you're everything's quiet and you're trying to go to sleep it's like a white noise machine you like should love it oh God damn it there's a there's a fan but it's not it's not like a soothing fan because I've slept with fans before were they better than me they were they were much more soothing better they bigger but then also the Xbox is a lot of **** we have to leave that unplug yeah the Xbox for sure makes noise we have to un pull the power out my biggest problem with the suspend mode and this is now totally off the topic where we've gone but one of my big complaints and now and I tweeted about this and most people like that never happens for me the amount of times I",
            "start": 1638.24
        },
        {
            "text": "suspend mode and this is now totally off the topic where we've gone but one of my big complaints and now and I tweeted about this and most people like that never happens for me the amount of times I turn on a PS4 in this house your PS4 is broken yeah that but yours does it too like the yours did it last night yeah just like because what we're do we move PS4s around this house so much that if they're in suspend mode and you hold down the button to send them in power off mode you stand back you give it a minute you unplug it you do whatever you do with the other PS4 you plug it back in in nine times out of 10 I always shut down improperly I'm rebuilding the data it's like mother **** like I put you into hard off like what else do I need to do yeah yeah and I'm sure have to sing it yeah lullab you just like hold it with you bring it with you all the time make it feel really just like you're pay make it feel loved um one of the other things you had stumbled on yeah about how the",
            "start": 1676.28
        },
        {
            "text": "yeah lullab you just like hold it with you bring it with you all the time make it feel really just like you're pay make it feel loved um one of the other things you had stumbled on yeah about how the industry has change that I thought was very OB and very obvious because you're getting beaten over the head with it this year round right is you talked about you know oh you're talking to other people flirting with this St you're talking about G4 you're talking about when G4 was a thing was it was doing stuff and I remember going to Comic-Cons and PAXes and my mom or Aunt my aunt really cuz my aunt doesn't pay too super close attention but mean like hey I saw E3 on the TV like are you going to be I'm like no that's a competitor they don't really do that kind of thing and now the fact of course that they are gone and like everyone is either on Twitch or on you now YouTube and the YouTube Gaming's presence obviously was huge at PAX this year because it was you know day one pretty much they",
            "start": 1712.84
        },
        {
            "text": "that they are gone and like everyone is either on Twitch or on you now YouTube and the YouTube Gaming's presence obviously was huge at PAX this year because it was you know day one pretty much they wanted to get out there the fact that but the fact of like like I saying Smosh was there and they had you know on the GameSpot in IGN when they'd be doing it right they'd have these other YouTubers I didn't even know about that are just popular with let's play Community or Rooster Teeth themselves running it you know what I mean Rooster Teeth there was like a let's play panel yeah yeah yeah and that's the thing of just like I remember when I first found out about Rooster Teeth or like not found out about but like actually had Tim explain to me what this is like I've heard of Rooster Teeth I never went super into it okay they make Red vs. Blue but then when Tim was like well yeah but they're this insane community that can you know millions of views on every video die hard fans",
            "start": 1748.56
        },
        {
            "text": "Teeth I never went super into it okay they make Red vs. Blue but then when Tim was like well yeah but they're this insane community that can you know millions of views on every video die hard fans like oh I didn't even know about it and now you know having flipped that script I go to RTX or I'm on the gauntlet or I do whatever and have to explain to people like oh I'm going to go shoot this thing with Roy like I don't know who that is and I'm like your PR like that's crazy that you don't know who these people are you know what I mean and now you see them you know I mean for lack of a better term they're one of the big three right cuz it's GameSpot IGN and them on the YouTube Gaming what you're saying those panels made me think of it's PAX this year was a little bit of a mini VidCon but just for the gaming stuff whereas I mean I I went to VidCon last year not this year so you'll have to tell me if that's changed too but when I went last year there was like almost nothing on gaming there was",
            "start": 1783.52
        },
        {
            "text": "the gaming stuff whereas I mean I I went to VidCon last year not this year so you'll have to tell me if that's changed too but when I went last year there was like almost nothing on gaming there was one I think one panel um and just a bunch of teenage girls screaming after like all the beauty YouTubers or all the more like comedy you know whatever like Jenna Marbles like those kind of people um but there weren't a lot of gaming YouTubers that I saw there um and so kind wondering if it's like G to like maybe that stuff's going to start morphing more into the gaming convention that's a good point I guess yeah yeah it's or they'll go to everything I don't know cuz there's a thousand cons and everybody has to go to all of them oh bye Party by always he's a million degrees I'm sure no hey where you going okay he's walking in Colin's bathroom it's cold he's gonna set his little belly on there um did he do it no but I'm just imagining him doing that it's cute it's a cute image I love that 11 L I",
            "start": 1817.28
        },
        {
            "text": "wish I wish it were okay for a 35-year-old man to do that because I would just lay down on that tile too I'm so hot right now uh interesting you you touched on another thing that I want to talk about a little bit which was the idea of the concept of Let's Plays um and those were something that if you had talked to me about five years ago or six years ago when the when that idea started being generated I'm like that's dumb no one's going to watch someone else play a game Flash Forward is now it's it's a main state it actually is uh you know it's something that people and you talked a little bit about will those mobile Gamers ever or those the younger kids ever translate over to console Gamers I think absolutely yes they will because as they're watching Let's Plays on Minecraft or they're",
            "start": 1860.88
        },
        {
            "text": "about will those mobile gamers ever or those the younger kids ever translate over to console gamers? I think absolutely yes, they will, because as they're watching Let's Plays on Minecraft or they're watching their friends do that, and it's natural if their friends start progressing that they're going to start watching those kinds of videos as well. Um, what's what's crazy to me and what's what what I have to rectify in my brain is I love the passive experience. I love the experience of a film or TV show, someone choosing what to show me, um, rather than me having to interact with a game and and figure that out for myself. And again, it's shifting a little bit, but that's why I think the power of the Let's Play is so awesome because it is that passive experience and that active experience at the same time. You're sharing it, but you don't really have the burden or the stress level of having to go through the process. Yeah, um, and I think it's super powerful. Sorry, when we come home and we're tired and",
            "start": 1901.4
        },
        {
            "text": "time you're sharing it, but you don't really have the burden or the stress level of having to go through the process. Yeah, um, and I think it's super powerful. Sorry, when we come home and we're tired and we're like, \"I don't want to play anything,\" right? I'm just I need to I need to sit here and not have to think. So yeah, in those cases it's it's great if some streaming and then you can kind of be like, \"Well, cool, I get to still experiencing.\" You're still in that world, getting you're still getting that kind of uh entertainment or that quality or that conversation that you had you wanted before, right? Because that's my thing. Yeah, when I come home and I'm exhausted, I I don't feel like I have it in me to play a game. I I would say I want something inactive. Games are inactive entertainment experience. I want someone to talk at me, whereas that's what Let's Plays do feel that void for, right? And it's interesting too because that's why I feel like a lot of people will turn on a news show or like ESPN or",
            "start": 1932.88
        },
        {
            "text": "want someone to talk at me, whereas that's what Let's Plays do feel that void for, right? And it's interesting too because that's why I feel like a lot of people will turn on a news show or like ESPN or SportsCenter, even if it's something you don't really care about, even if they're on a block of hockey for instance. Like you talk to like it's on the world kind of around it. I feel like I'm still kind of being productive and still indulging in that passion while at the same time I don't have to necessarily put in 90% of the effort that I normally would. And this is the same thing when I first did my first first first Twitch stream when I was still just GameOverGreggy, right? Was the fact of like, I told the chat like, \"I don't know why you'd come here. Like, why would you want to ruin the game for yourself?\" Right? And they were all universally like, \"We're not here for the game. We're here to hang out with you.\" You know what I mean? Hang out with the the streamer as well as just the community, make new",
            "start": 1967.44
        },
        {
            "text": "right? And they were all universally like, \"We're not here for the game. We're here to hang out with you.\" You know what I mean? Hang out with the the streamer as well as just the community, make new friends and find common interest. Exactly. And that's why it was it was crazy 'cause now, I mean, it's different for us. Obviously, we are knee deep in this. This is our business now. We have to understand all aspects of or at least be up on. And I don't know if you saw this, Jimmy Kimmel put up a thing basically being like, \"I have no idea why YouTube, why would any YouTube Gaming?\" It's his first time hearing about Let's Plays. Oh, really? In live streams. And he's just like, \"I don't know why anybody...\" There's a quote out from him to the line, \"I don't know. I don't know.\" He broke up with Sarah Silverman not too long ago. Was married before that though, I think so. I don't know if he has kids. Did the kids break up the marriage? Did they not love the mom and dad enough? That's what happened to my parents anyway. They like 'cause they like",
            "start": 2001.16
        },
        {
            "text": "before that though, I think so. I don't know if he has kids. Did the kids break up the marriage? Did they not love the mom and dad enough? That's what happened to my parents anyway. They like 'cause they like Let's Plays more than they like their dad. But it was yeah, the fact that he didn't understand. He said it would be like going to a nice restaurant and watching someone else eat your meal. No. And it's just like, man, like it's weird that people still don't get it to that degree that like YouTube Gaming for so many people now is going to be their first time hearing about Let's Plays and understanding what's happening. Weird. Not to mention that, you know, like I remember when I, you know, years ago when Scott Lowe was like, \"Hey, do you the Epic Meal Time guys are coming to San Francisco. Do you want to hang out with them? They they're fans.\" And I was like, \"Sure, who Epic Meal Time?\" And then like Harley's now walking around PAX and, you know, Kevin Smith movie, taking photos with Cliff Bleszinski at you talking about",
            "start": 2038.16
        },
        {
            "text": "them they they're fans. And I was like, \"Sure, who Epic Meal Time?\" And then like Harley's now walking around PAX and, you know, Kevin Smith movie, taking photos with Cliff Bleszinski at you talking about LawBreakers and stuff. And it's just like that never would have happened. I think back to when PAX, you know, when I first heard about PAX, it was the small show. And Andre Segers from IGN at the time, who's now of uh crap, what's the Nintendo Channel? He does GameXplain, I think. Yep, GameXplain. Thank you. He was going to PAX to play Mario Kart in the Mario Kart tournament. And I was like, \"What is PAX?\" You know what I mean? Like, yeah, but that's the thing. Like again, you're you're talking about it and and and don't get confused because it was smaller back then. Everything was smaller. Everything was slower back then. And I think that's one of the most that's the biggest change in the industry for me is that we have gone from, and I'm oversimplifying this obviously, but we've gone from uh people's attention being",
            "start": 2067.76
        },
        {
            "text": "and I think that's one of the most that's the biggest change in the industry for me is that we have gone from, and I'm oversimplifying this obviously, but we've gone from uh people's attention being focused on traditional mainstream media outlets with IGN and GameSpot and GameTrailers, um, a you go to as a .com destination being that was the cool new thing, right? That that's where real gamers went, right? You didn't you like people watched G4, but that was an antiquated traditional experience at the time because you had to wait for a programming block, whereas IGN was where you went when you wanted that experience, right? Now, and that's what we can get now. What we're seeing is it's it's going from a shift of you have your allegiance to that major media outlet to individual contributors are starting to that that's starting to be more and more common because we have the power to build that audience ourselves, right? And what you were talking about earlier is very very salient point with with Metal Gear",
            "start": 2104.4
        },
        {
            "text": "that that's starting to be more and more common because we have the power to build that audience ourselves, right? And what you were talking about earlier is very very salient point with with Metal Gear. Uh, was that yes, a certain percentage of those people stuck around, but there even is a percentage of those people that still might not like us. It's our job now to tell to prove to them why they should, right? We're not a resource site. We're not a site where you have to like people would go on IGN and be like, \"I have to come to IGN because they have the exclusive on this. How to beat this, how to beat this?\" They're the walkthrough or maybe they got the doing a tips and tricks. I'm like, \"No, I'm not. No, no, because get for this and I yell at each other for two Let's Plays next week. That's good enough for you.\" But again, it's not a knock toward tips and tricks. We're not what we do. That's just not what we do. I think it also requires a much larger team to be it requires a much larger team. It requires",
            "start": 2147.16
        },
        {
            "text": "for you. But again, it's not a knock toward tips and tricks. We're not what we do. That's just not what we do. I think it also requires a much larger team to be it requires a much larger team. It requires a certain type of person that none of us are. Colin is, but is but but he hates people. He doesn't want to talk to anybody about games. Um, so I think that to me is the most single most important factor of what's happened in the last few years is that, you know, as a as a content creator, you go out there and you build your audience and you can do that. And it's really powerful because whereas an IGN or a GameSpot might have a 50/50, you know, like to dislike ratio on what people are saying comments or there're just those people that want to come out. You have the ability to have a much smaller, focused, awesomer audience that will just support what you want to do. And you don't and I think that was that's been one of the most fascinating things about watching you and Colin is that instead of having to",
            "start": 2183.76
        },
        {
            "text": "audience that will just support what you want to do. And you don't and I think that was that's been one of the most fascinating things about watching you and Colin is that instead of having to like when Colin was on PlayStation, when you guys first started, you had to play everything. And now you get to just play the things you love and just show people why you love them. Um, and of course there's always going to be one or two people that are like, \"You can't **** play Metal Gear. You're so stupid.\" But uh, whatever. That's P.O.V. between between something like an IGN or a GameSpot or anything versus what you guys are doing is that IGN and GameSpot, they're big. So like it's a little bit disjointed. They don't really have an a solid opinion on anything. So like there'll be an article that goes up that's, \"I love Metal Gear,\" and it's by Greg. And then there's another article like the next week that's, \"I hate Metal Gear,\" and it's by so and so. However, to a viewer who is not looking at bylines or anything like that, sure,",
            "start": 2222.16
        },
        {
            "text": "Metal Gear and it's by Greg. And then there's another article like the next week that's, \"I hate Metal Gear,\" and it's by so and so. However, to a viewer who is not looking at bylines or anything like that, sure, they're like, \"What the **** is this site? Like, why? Like, you don't have a standard opinion on anything.\" And um, so I think it's easier. Yeah, yeah, but so now people can be like, \"Well, I like Greg because he likes Metal Gear and I like Metal Gear. Therefore, I kind of know what I'm getting with you.\" Whereas the IGN is kind of a mixed bag. You're not sure who's reviewing the game, whether they liked it, what they're you. He wasn't even a real fan of GameXplain. Yeah, yeah. So there, I mean, I just think that that's probably why people are starting to break out and look at more individual contributors versus the bigger sites. I mean, yeah, talking about like, you know, the changes this industry has seen for sure, that is one of them. And it's the now the understanding of the audience that we everyone's a content creator.",
            "start": 2266.24
        },
        {
            "text": "sites. I mean, yeah, talking about like, you know, the changes this industry has seen for sure, that is one of them. And it's the now the understanding of the audience that we everyone's a content creator and that you if you like people's content, you need to support them. We see it all the time obviously with Patreon subs, tips or whatever. But like everyone is waking up to that fact of the fact, you know what I mean, of like, yeah, people can, \"Well, I can I don't need to listen to everyone. I can listen to the people I care about and get there. I can go listen to the Jimquisition and see what he's saying about this and feel like I understand. I'm my money's being put where I want.\" And it's and it's true. And that's that's very powerful too. Like when I would read reviews, I would purposely remember obviously, and you have people that did this too. They would trust you. They would be like, \"I like Greg Miller's opinion on this because when I played the game that he played, I saw very similar things to what",
            "start": 2304.8
        },
        {
            "text": "and you have people that did this too. They would trust you. They would be like, \"I like Greg Miller's opinion on this because when I played the game that he played, I saw very similar things to what he saw in it and I got a very similar experience to him that he had with it. So I trust him now. I will go and look for his reviews and if he doesn't review a game that I like, I'm a little disappointed.\" Right? And so that naturally reifies this, right? And so that's that's naturally sort of transferred over to, \"Well, people kind of followed us so over here and they're watching what we like on this channel.\" Um, but instead of looking for like, \"Hey, I'm look, I'm going to play this game. I wonder what they think of it.\" They're just watching us play games and go, \"Oh, I think I'm going to play that game. Looks fun in action.\" The reviews exactly as it goes. It's not and and you know, I think that's been one of the fun things for me about this whole thing is that we don't need to necessarily um, we don't have that pressure.",
            "start": 2342.4
        },
        {
            "text": "the reviews exactly as it goes. It's not and and you know, I think that's been one of the fun things for me about this whole thing is that we don't need to necessarily um, we don't have that pressure. There's no pressure anymore, right? We have a pressure in that we want to come through for people that are watching our content and give them a fun um, an entertaining and well-informed experience. Uh, but you know, like this morning, you know, I had to show up 'cause Colin was sick and so I came a little earlier and made sure we were okay. And that's a pressure that I put on myself just because I really want to make what we're doing as cool as possible for the audience. But in reality, had I not read a couple of those stories, it would have been okay. I mean, it's just fine. Like I could have relied on you or we could have talked about something else and we we always had that luxury, which is nice. Um, but I don't know. I mean, it's it's it's it's weird and what's crazy is it's it's ever changing. Like it's so",
            "start": 2378.28
        },
        {
            "text": "we could have talked about something else and we we always had that luxury, which is nice. Um, but I don't know. I mean, it's it's it's it's weird and what's crazy is it's it's ever changing. Like it's so fast now. We'll look back at this conversation and this won't even we won't even we be we've been seeing the trends here, whether it's virtual reality, whether it is I Like You, the rise of YouTube Gaming. Did you use I tried it again. I tried it again at PAX. I tried Oculus. I haven't I still haven't tried Morpheus, even though I've used to work for the company. I just never got around to trying it. Sony wouldn't let you come on. I know they were like, \"You're not allowed.\" Um, but I put I tried Oculus. I've tried Oculus twice. Once was I think a year and a half, two years ago at IndieCade. And then I just tried it at PAX again. And I was just like, \"Nope, this no, not my thing.\" No, because it's too heavy on your face. Like it just I'm like, \"I feel like I have 10 lbs on my face.\" That's not that's not something that I can",
            "start": 2410.6
        },
        {
            "text": "PAX again. And I was just like, \"Nope, this no, not my thing.\" No, because it's too heavy on your face. Like it just I'm like, \"I feel like I have 10 lbs on my face.\" That's not that's not something that I can sustain for longer than this 10-minute demo. I so I'm not going to sit there for seven hours playing Fallout with a thing on my face. Like, no. Um, and then still made me sick. Yeah, see, I had that problem too. We did uh we did Morpheus at we did Morpheus, man. We did Morpheus, man, your life uh at Comic-Con. And I was like, \"This was awesome.\" And then I walked to the bathroom. I was like, \"What the **** is happening to my face right now?\" As soon as he put it on my head, I was like, \"God damn it. Nope.\" It's hard. I got a little cobic too. Um, that's going to be fascinating. It is going to be fascinating to see even a year from now or two years from now what's what's what what what are the trends, what's going on? 'Cause it's not like it was, you know, everything was so predictable in the 80s and 90s, especially specifically",
            "start": 2449.72
        },
        {
            "text": "now or two years from now what's what's what what what are the trends, what's going on? 'Cause it's not like it was, you know, everything was so predictable in the 80s and 90s, especially specifically the 90s, right? When everyone was like, \"Okay, games are thing. We know that consoles are going to be next system. We have more horsepower.\" Exactly. \"It's four years and then we're going to start seeing another one,\" right? And then PlayStation 3 was like and Xbox 360 was like seven years happening. Um, so yeah, it's going to be fascinating 'cause everything's getting exponentially faster out there. So we'll see. We'll see where it goes. Here we go. I can't get mad when you... it must be something. I see. I jumped to the good part.",
            "start": 2494.84
        }
    ]
}