{
    "id": 1222,
    "video_id": "HB49HxxMCMc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Characters Would You Wanna See Fight?  - The GameOverGreggy Show Ep. 94 (Pt. 2)",
    "description": "Tim Gettys asks what fictional characters we would want to see fight to the death on http://www.youtube.com/ismahawk.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1442905201,
    "duration": 1160,
    "transcript_chunks": [
        {
            "text": "Tim, what's your topic? All right, so in the spirit of Danny being on the show, I'm a big fan of his one-minute matchup videos that are, you know, as he described earlier, two different characters fighting out with each other. It's a quick little, quick little Battle of the Death, and uh, it's a fun little video, and then there there's a winner and people get to you tease out what's happening next or whatever. There's a bunch of other series like this on the internet. There's ScrewAttack has Death Battle, Bat in the Sun does their Super Power Beat Down. Yes, and back at IGN on Start Gak Rip, um, The Ultimate Fan Fights. G attack, yeah, he would do those and those are always a lot of fun, but it's essentially just taking two characters, matching them up against each other and making them fight. There's something about that that's very appealing, such a really like just awesome cool thing. I mean, I remember even back in like the um, Newgrounds days, yeah, of just like animation stuff like Scorpion versus Ryu from",
            "start": 2.85
        },
        {
            "text": "about that that's very appealing, such a really like just awesome cool thing. I mean, I remember even back in like the um, Newgrounds days, yeah, of just like animation stuff like Scorpion versus Ryu from Street Fighter and it's like this sh's **** awesome, you know? And there's something thrilling about it where you want to see two characters fight. So my question to you guys, what would be some **** awesome matchups? Kate Bosworth and a motorcycle. Jesus, what? Just saying, put him out there, see who wins, see what happens. Yeah, I'm going to be honest with you, I got like, uh, I got my money on the motorcycle on this one. You're thinking of it already being emot? No, I just think of it sitting there. I don't think Kate Bosworth know what to do. I think Bosworth, she was okay, or she was also in that one Blue Crush. Oh, Blue Crush, you're right. Yeah, she's so so looking. The reason I say that is because I feel like she weighs five pounds, so she gets anywhere near the motor motorcycle, it's just going to like fall on",
            "start": 53.32
        },
        {
            "text": "oh, Blue Crush, you're right. Yeah, she's so so looking. The reason I say that is because I feel like she weighs five pounds, so she gets anywhere near the motor motorcycle, it's just going to like fall on. I think it's I think it's it's either this month or last month's Everyday Cooking with Rachael Ray. She's got a thing at the back, I'll show you about how what she's cooking. Oh, fun. There you go. Also, thank you to everybody who supports us on Patreon. Here, names I want to see them fight. All of them, all of them. It's like The Matrix battle. They're they want though because Dr. Kicking Amy Gills F, all all these people are so cool, they wouldn't fight each other. What they would do is they'd get together, they go out front night there and they go see a movie. They would, yeah, but like that's the thing with these things is these the fights don't necessarily need to be people that fight. Your characters are, but like, so when are you doing a Superman one versus Goku? Yeah, that's the one everybody always wants.",
            "start": 97.96
        },
        {
            "text": "things is these the fights don't necessarily need to be people that fight. Your characters are, but like, so when are you doing a Superman one versus Goku? Yeah, that's the one everybody always wants. Right, Superman versus Goku. Uh, I don't know, I can't really say anything about that one. Uh, we do happening, it's in. I can't really say anything about that one, but there is a Superman one that is being planned and I don't want to reveal what it is just yet. I'll tell you, I'll tell you off the and it's going to be a movie coming out next. Yeah, I'm I fun fact, I'm actually making that movie. Yeah, uh, Zack Snyder is actually consulting with me about who would win in that fight. So for you, when you're thinking about this, is it the biggest name or is it the funnest matchup or where do you start? Where I mean, do cuz obviously Arrow's been hitting, obviously Flash is the same deal, he's been in, obviously the X-Men movie. I want to do uh, fights that people are are actually going to be invested in, win. So a",
            "start": 136.96
        },
        {
            "text": "cuz obviously Arrow's been hitting, obviously Flash is the same deal, he's been in, obviously the X-Men movie. I want to do uh, fights that people are are actually going to be invested in, win. So a lot of people are asking who would win in a fight like Flash versus Quicksilver is by far the most requested video that we had. Uh, so I guess when people found out we were actually doing it, they freaked out. Like Nick was uh, Nick was telling me earlier, I'm insane for wanting to do that because of all the visual effects. Because the last time I talked to you, you were like, I'm like, how's it going, man? I'm good, man. I'm just like, I'm on hour like 18 of putting in arrows like into the for the. You're like, cuz I guess you just have the bow pull back, but you actually comp in the arrows that are going everywhere. He's like, yeah, I just got like, you know, two, four, six more weeks to that and then we're be good, we're going to launch this new video. You're out of your mind. Green Arrow versus Hawkeye, take some",
            "start": 178.04
        },
        {
            "text": "he's like, yeah, I just got like, you know, two, four, six more weeks to that and then we're be good, we're going to launch this new video. You're out of your mind. Green Arrow versus Hawkeye, take some time off of my day job for Flash versus Quicksilver, but uh, we're actually I'm I'm interested in actually trying something new. What we did with the Deadpool video, I thought was really fun. It's very different than what a lot of the other channels who are doing the same thing are, uh, where it's not really a character fighting another character, it's a character kind of fighting another version of himself. For the people who are just joining this topic, that was Deadpool the comic character versus Deadpool from X-Men Origins: Wolverine. Yeah, Origins: Wolverine. X-Men Wolverine Origins, thank you. No, X-Men Origins: Wolverine. X-Men Origins: Wolverine. Yes, that movie was not great. They they they did so many more of those origin movies though, which that that was the important thing that was was that they made that a great",
            "start": 220.6
        },
        {
            "text": "X-Men Origins: Wolverine. Yes, that movie was not great. They they they did so many more of those origin movies though, which that that was the important thing that was was that they made that a great series. Are do you then are build? I mean, Spider-Man's got to be a requested one, right? Are you thinking of doing like Tobey Maguire versus Andrew Garfield? That was an idea that was legitimately a thought about the new guy, the new guy in there. We really wanted to do something with uh, Miles Morales and throw him in there. I think he's an awesome character and I was kind of stoked when they were rumoring that he would be be awesome. I thought that was going to be so cool. I really wanted to see Donald Glover like I've been him so **** awesome. A little old for the the character, but whatever, it's it'd be worth it. Cool about that though, Garfield versus Maguire. I mean, as funny as that is in concept, I don't think that the the video could be that entertaining because they're both just Spider-Man, exactly.",
            "start": 259.12
        },
        {
            "text": "worth it. Cool about that though, Garfield versus Maguire. I mean, as funny as that is in concept, I don't think that the the video could be that entertaining because they're both just Spider-Man. Exactly. Visually it doesn't and it would just be Andrew Garfield actually being Spider-Man and Tobey Maguire not. So it wouldn't be entertaining at all. Shots fired. Shot. But I like the idea of Miles Morales because his Spider-Man is different from Spider-Man. He has different powers and yeah, so that's ****. I would like that. You should do that. And uh, well, let's just say there's uh, there's some other characters where there's quite a few versions of that, you know, pretty Batman, Solid Snake, Big Boss. Think Kiefer Sutherland versus David Hayter. Well, so this is funny, uh, with Ultimate Fan Fights, I was like an associate producer on that. So I didn't have like, I I I had to **** make all the **** happen like the planning stuff, but like I didn't actually have to do any of the content because uh, the other guys",
            "start": 296.2
        },
        {
            "text": "producer on that. So I didn't have like, I I I had to **** make all the **** happen like the planning stuff, but like I didn't actually have to do any of the content because uh, the other guys did that. But we'd have phone calls where they're asking me because I was like the strategist of like the headlines and stuff. So I kind of gave them ideas of I think you should do these two characters. They very rarely went with what I said said. Um, they did Cap versus Batman once. That's one they started with and that was cool. But I mean, that's like a weird match up. It's different than what you do. You it's from the classic '90s face off of DC versus Marvel, of course, where we had to fight for the universe. People univ. We had access from two red robots who won at the end. They shake hands and say, you've done well. They didn't give a **** at all. They just like did whatever they wanted. Um, including the the hit Link versus Peter Pan. Yeah, which did that really hit? No, no, well, it did okay, actually did okay.",
            "start": 340.52
        },
        {
            "text": "well, they didn't give a **** at all. They just like did whatever they wanted. Um, including the the hit Link versus Peter Pan. Yeah, which did that really hit? No, no, well, it did okay, actually did okay. Everyone gave me so much. Should have just stabbed him and that would have been the end of it. No, here's my thing. People hating that video, I think it was really entertaining and Peter Pan was **** hilarious. He just sitting around like doing his little **** Peter Pan like taunting. For one thing, it was well done. It and it was also one of those fil like to to be fair, we didn't request that. That was one they had worked on already and had in the hopper and they were like, hey, can we do this cuz we're halfway like we're basically halfway done with it. And we were all like, who in God's name would think Peter Pan versus? And they were like, we just thought'd be funny. And I watched it. I was like, this is pretty. It's funny. **** coolar. It was that video that sold us on the the series, the concept. But I'll",
            "start": 378.4
        },
        {
            "text": "Peter Pan versus. And they were like, we just thought'd be funny. And I watched it. I was like, this is pretty. It's funny. **** coolar. It was that video that sold us on the the series, the concept. But I'll never forget having to ask for promotion for. I was asking all the IGN guys, hey, can you promote this and stuff? Like, I'm not putting **** Peter Pan on the front of IGN. I was like, you talking to Colin about it? No, but then there was other ones like Chun-Li versus Tifa and that was like, all right, we have two like kicking characters that makes sense, you know? Um, and then what else? What other ones? We did one that was really cool was Iio versus Solid Snake and they're both sneaking around and doing stuff and they got David Hayter to be the voice of Snake. Oh, **** really? Yeah, what? That should have watched this show. Yeah, so that was **** cool. I only saw the Cap versus Batman. I didn't realize there were so many other. We six of them. Oh, Scorpion versus Ryu was one. I okay, I saw that one too. And",
            "start": 415.88
        },
        {
            "text": "watched this show. Yeah, so that was **** cool. I only saw the Cap versus Batman. I didn't realize there were so many other. We six of them. Oh, Scorpion versus Ryu was one. I okay, I saw that one too. And then I think that was it. Uh, of all the ones that we did. Yeah, yeah. I need to see this Link versus Peter Pan. It's pretty funny. Sounds amazing. Yeah, the only the only uh, thing that they did, which I thought was very interesting, was I think they composited all the backgrounds in which that episode was a little strange. They did it all in on green screen. So a whole background cuz that was they had a different direction for it. But because that was what sold us on the series, so it was kind of their pilot, right? And um, it it looked more like a video game than the rest of them, like a Smash Bros. stage basically. It was very Smash Bros. Um, but anyway, it was it was really cool and I remember talking to them about like the methodology behind the characters and stuff cuz we were trying to get Goku versus Superman.",
            "start": 457.56
        },
        {
            "text": "it was very Smash Bros. Um, but anyway, it was it was really cool and I remember talking to them about like the methodology behind the characters and stuff cuz we were trying to get Goku versus Superman. Yeah, yeah. And uh, they were like, well, we can't because like Guhard and and all that stuff. Yeah, dude, that's almost as stupid as doing Flash versus Quicksilver. But at the very least though, at least they're, you know, they're standing on the ground, right? Although if depending on how hard you want to do, yeah, if they're going to go up a wall or over water or something, that's going to be hardcore. They're doing all those things guaranteed. I mean, if there isn't an overwater scene, you're **** it up. She it's one of my favorite my favorite episodes of uh, I think it was Justice League was when Flash races Superman. It's the race, remember that episode? Yeah, yeah, that might actually mean Superman the and they have to like stop to help the tanker and they keep going. It was fun. It was cool. Um, I always wanted to see",
            "start": 495.32
        },
        {
            "text": "it's the race, remember that episode? Yeah, yeah, that might actually mean Superman the and they have to like stop to help the tanker and they keep going. It was fun. It was cool. Um, I always wanted to see and I'm sure someone's done it multiple times. In fact, I I'm pretty positive, but back in the day, the debate was always who would win the Terminator or RoboCop? And that was always that is a good one. Yeah, that was always one. Now it's hard to do obviously if you're going to do it from a fanm because you need the the RoboCop costume, but the Terminator would be easy, an easy one in a lot of views for you coming up here. Uh, Lara Croft, Nathan Drake. Uh, Bat in the Sun did that. It was their first episode. Well, everybody's done this **** before. Fair, fair enough, fair enough. See, they get **** crazy though. Didn't they do Darth Vader versus Wolverine? Darth Vader versus Batman? Oh, that was them. That one was **** dope. And they also did Green Ranger, Green Ranger versus Scorpion. Yeah, yeah, yeah. And they",
            "start": 538.04
        },
        {
            "text": "didn't they do Darth Vader versus Wolverine? Darth Vader versus Batman? Oh, that was them. That one was **** dope. And they also did Green Ranger, Green Ranger versus Scorpion. Yeah, yeah, yeah. And they actually had the Green Ranger Tommy. Yeah, they had a Jason David Frank. Yeah, yeah. Uh, super cool guys at Super Power Beat Down. I love those guys. They're nice. Uh, it's just such a timeless concept. It's so **** awesome. Mario versus Sonic. I want to see that make it happen in real life. Oh, man. See, we use a real hedgehog and a real plumber. My stomping on the hedgehog. We we had thought we had a thought for a while, uh, Mickey Mouse versus versus Mario. But then we were like, I don't know if Disney is going to let that happen, let that fly. That's actually awesome. Well, how would you do that? But that's **** awesome. Yeah, I like that. Well, so we were talking about like Disney Princesses and I'm all about that. I love this so much. Yeah, the problem is there's not too many of them would. Well, Elsa would be ****",
            "start": 576.32
        },
        {
            "text": "Yeah, I like that. Well, so we were talking about like Disney Princesses and I'm all about that. I love this so much. Yeah, the problem is there's not too many of them would. Well, Elsa would be **** sick. I want to see Elsa fighting zero. No, it was too icy, too cold. I don't know if they can do that. Human Torch. Yeah, Elsa versus Human Torch. Invisible Woman. Wait, what other princess has like superpowers? Well, they don't. That's the thing. Thinking why we came up with Mulan isn't technically doesn't Disney have like a deep roster of princesses now? Yeah, but that's like Princess Leia. Princess Leia versus Elsa. I that's dope. Oh, that's hot. She got blasters, bro. Blaster. She has to start in the uh, wish column. We're here. What was the the Bounty Hunter? Oh, Medoran. Oh, Jesus Christ. IG-88. Yeah, got one more for me. BB-88 is right. BB-88. Uh, the fight that I've wanted to do and it's on the roster of whenever I'm able to do it is uh, Voltron versus the Megazord. Dude, wait, how the **** would you do that? It would have to CG and",
            "start": 620.96
        },
        {
            "text": "BB-88. Uh, the fight that I've wanted to do and it's on the roster of whenever I'm able to do it is uh, Voltron versus the Megazord. Dude, wait, how the **** would you do that? It would have to CG and then cut into like the inside the cockpits and we're all like, yeah, like doing our thing. Let's do it. Is **** hilarious and that's such a good idea. But **** the CG. Do it like they did the original show where it was just like cardboard outfits fighting. That's **** with the the buildings that are just like cardboard and they like just explode for no **** reason. Sparks everywhere out of nowhere. That'd be awesome. Now here's Aladdin. Voltron has to win. The most important one that you need to do specifically, you. Yeah, yeah. Is Aladdin versus I don't give a **** who. I was thinking, um, uh, Aladdin versus uh, versus like Shang uh, from Mulan. Oh, yeah, yeah. You have a like uh, Shang's a more skilled warrior, but like Aladdin's like really scrappy and he's he's uh, he's used to dodging like, you know, soldiers and",
            "start": 674.56
        },
        {
            "text": "versus like Shang uh, from Mulan. Oh, yeah, yeah. You have a like uh, Shang's a more skilled warrior, but like Aladdin's like really scrappy and he's he's uh, he's used to dodging like, you know, soldiers and stuff like that. So yeah, maybe it's it's a good fight. Yeah, you it should be you and Alfredo. Aladdin versus Prince of Persia. All right, all right, that'd be dope. Which one is gets to be the prince of? Well, that's thing is cuz I've always my entire life I've been trying to get Alfredo to be Aladdin in something. Yeah, and he just he just won't. I don't know why. It's racist. How is that racist? He's not you justo. You want to see the Filipino guy dress up like. All right, anyways. I also think he'd do a killer Dhalsim from Street Fighter. That's racist. How is that racist? Saying that's racist is racist anyway. But then I met this mother fuing. I'm like, damn, he's a better Aladdin. Sorry, Alfredo. Dude, uh, I I wish I could just pull out a picture and show you guys uh, me when I was in 10th grade. I had like really long",
            "start": 726.4
        },
        {
            "text": "then I met this mother fuing. I'm like, damn, he's a better Aladdin. Sorry, Alfredo. Dude, uh, I I wish I could just pull out a picture and show you guys uh, me when I was in 10th grade. I had like really long hair and people called me Aladdin cuz I it's a pretty it's a pretty spitting image. Walked around with stolen bread all the time. Yeah, yeah, dude. Always the monkey just following you. Never wore a shirt for any reason. Only only purple vest. Yeah, well, see that's why Alfredo was such an Aladdin me because he just never had a shirt on. So I was like, oh ****, that was me in high school. Good. You guys would have got along. You should do original Ghostbusters versus new Ghostbusters. All right, then the new movies Ghostbusters, the girls. Yeah, yeah, yeah. You should do Ghostbusters versus Ghost. Just have Bill Murray fighting Patrick Swayze. It's that. But then Patrick Swayze calls in the subway guy who pushes him off that pushes the other Ghostbuster down. Get off my tr. I would totally watch that actually. Yeah, if the four",
            "start": 778.2
        },
        {
            "text": "Murray fighting Patrick Swayze. It's that. But then Patrick Swayze calls in the subway guy who pushes him off that pushes the other Ghostbuster down. Get off my tr. I would totally watch that actually. Yeah, if the four Ghostbusters were try to capture Patrick Swayze from Ghost, that'd be awesome. Think about that. That's a good one. He's trying to push a quarter and they're **** blasting him with the Proton Pack. What do they call the power wands? The genie wands? Well, it's a Proton Pack and it's a Neutron Wand. Neutron, neutrona, neutrona wand. That's what's thrown up. That's what's happening. That's what's throwing up. That's that's barfing up the magic. What other other ideas have you had? Like what are things that you've talked about but for whatever reason you couldn't have done for the legit stuff? I don't want to talk about it cuz I don't want to give away our ideas. Uh, like the ones that we have uh, on the roster. Uh, there is one that if there are any CG artists out there who wanna who wanna, you know, who can do",
            "start": 821.28
        },
        {
            "text": "talk about it cuz I don't want to give away our ideas. Uh, like the ones that we have uh, on the roster. Uh, there is one that if there are any CG artists out there who wanna who wanna, you know, who can do some like cool 3D stuff. Uh, I was I wanted to do Digimon versus Pokémon. **** you. **** you. That would be so cool, dude. I want to do it so bad, but I'm just not good at 3D. I'm good at like VFX and stuff, but 3D is just out of my realm. Oh my God, that could be the coolest video in the entire world, dude. I got so many dope ideas on how to make that like so fun. If you ever do that, I want to be in that. I don't know who. I don't care who, but I made it. You got to be the you got to be Ash. You got to be the Pokémon. I don't look like Ash though. I don't know if I can pull out. That's racism. You're right. It's it's confirmed right here. Tim Gettys versus I'll I'm sure I'll be the other one. I like that. I like that. I'll be Digimon. I want to rip the Digimon. Oh, yeah, okay. All right, all right. You could be Tai or",
            "start": 858.96
        },
        {
            "text": "it's confirmed right here. Tim Gettys versus I'll I'm sure I'll be the other one. I like that. I like that. I'll be Digimon. I want to rip the Digimon. Oh, yeah, okay. All right, all right. You could be Tai or whatever or Matt. I could do Matt. All right, all right. My hair up, make it blonde. Yeah, this little green tank top like adult Matt and adult Ash Ketchum. And the new Digimon's coming out at the end of the year, dude. Season three or whatever. That's going to be amazing. It's only took like 10 years. 10 years. No, wait, it's more than that. It's like the 15th anniversary since the the second season. Mhm. Wow. Crazy. That was a great show. I you're talking about sorry, nerd nerdy stuff. Well, the nerd stuff, anime stuff. Well, the other Ultimate Fan Fights we did was Ichigo versus Sasuke from Bleach. And AUD. That's a good one. Yeah, that's a great one. That one did really, really, really well. I can I can imagine there's definitely an audience for that. Yeah, who wants to see those fights? Yeah, we get asked for anime fights",
            "start": 899.76
        },
        {
            "text": "one. Yeah, that's a great one. That one did really, really, really well. I can I can imagine there's definitely an audience for that. Yeah, who wants to see those fights? Yeah, we get asked for anime fights all the time. Someone said uh, said characters from Attack on Titan versus Spider-Man. I was like, I don't know if that's a fair fight, guys. No, that's **** cool. Spider-Man would wreck that ****. Spider-Man super. Can you imagine them just like swinging around and just **** fighting? That'd be cool. Awesome. That is harder than Superman versus Goku. That is way harder. Swinging around. They're they're just like kind of hitting each other and flying really, really far. Attack on Titan and Spider-Man. You need to get the swing right. You need to like do all this. There physics involved. That that I down for that. Plus you have to have the shot where he like jumps up and does the **** dual like between the legs. Oh, yeah, dude. Crazy. Like cut him with the weird long sword things. Oh, man. Giant razor blades. Joel and",
            "start": 943.16
        },
        {
            "text": "you have to have the shot where he like jumps up and does the **** dual like between the legs. Oh, yeah, dude. Crazy. Like cut him with the weird long sword things. Oh, man. Giant razor blades. Joel and Ellie from The Last of Us versus Lee and Clementine from The Walking Dead. Oh, there you go. That's good. That's a free one. I like that. Crash Bandicoot versus anybody. Spyro versus Spyro. Yeah, cuz anybody could beat him. And that's one where **** hopefully a meteor hits them both. Crushes Crash Bandicoot versus a salami sandwich. Salami sandwich win. Crash. Keeping in the uh, with the emotion of the same character fighting himself. Han Solo versus Indiana Jones. Right? Damn. See, that's **** awesome. That'd be hard to do. You get twins. Okay, good. You're right. You get twins. Nailed it. They look at each other and they're like, and they're kind of doing that whole like, you know, any twins? Yeah, good. Yeah, two my best friends are twins. Wres itself. That'd be awesome. Yeah, cuz they they similar uh, I guess fighting styles because one has",
            "start": 984.8
        },
        {
            "text": "kind of doing that whole like, you know, any twins? Yeah, good. Yeah, two my best friends are twins. Wres itself. That'd be awesome. Yeah, cuz they they similar uh, I guess fighting styles because one has a heavy blaster. Then one has he does have the gun that he uses only once, I think. I don't think he ever uses it other spin his sword. The whip versus the blaster, dude. I I would watch that. And they're both uh, really crafty. H, it's similar personalities. Both great characters. Can uh, somehow you have to have Indiana Jones win though by like triggering a trap, a series of traps that like smashes Han Solo. Or Han Solo just calls in the Millennium Falcon. Just starts heavy blasting. It's just like, this is not fair. You're from the future. I'm from like the 40s. Shff comes in on a motor. My God, can we dress Greg up as Chewbacca the wi and can he be in that? Yes. Okay, thank. Can you give me your Wie? Yo, actually, yo, fun fact, spoilers for The Flash versus Quicksilver video. Uh, Greg's going to have a little cameo in that.",
            "start": 1039.0
        },
        {
            "text": "the Wii and can he be in that yes okay thank can you give me your Wii yo actually yo fun fact spoilers for The Flash versus Quicksilver video uh Greg's going to have a little cameo in that right just like I was in Nightwing yeah I'm the seal of approval yeah I like that once you get it that's a million views I hear oh yeah on your channel not ours put Greg in anything not on this channel it'll get a million views guaranteed dang right now I can't stop thinking about Digimon, Pokémon dude I actually want to we should talk later let's make that happen dude have you ever seen the Pokémon Apocalypse video made by MegaStakman is that the one where it's the uh it's is it live action yeah it's live action where it's a really dark future yeah and he's like I want I wanted to be the very best yeah exactly that one uh I know that dude and he's **** awesome so we should all make this happen you guys want to talk offline on this one a meeting we we collabed good what's happening everybody",
            "start": 1087.6
        },
        {
            "text": "yeah exactly that one uh I know that dude and he's **** awesome so we should all make this happen you guys want to talk offline on this one a meeting we we collabed good what's happening everybody go to Danny's Channel please Ismahawk yeah Kevin put it up below yeah you did",
            "start": 1134.88
        }
    ]
}