{
    "id": 1168,
    "video_id": "jJwy3NSNNDk",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Kristine Steimer"
    ],
    "title": "Huge Metal Gear Solid V: The Phantom Pain Spoilers!!!!! - Kinda Funny Plays",
    "description": "Don't watch this unless you're down for a fairly large spoiler that isn't about the main story but is a spoiler! There's also a zoo.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nSubscribe to Kristine! https://www.youtube.com/user/kristinesteimer?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441306801,
    "duration": 2430,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to another Metal Gear Solid V let's play here on youtube.com/KindaFunnyGames. I'm Greg, this is Kristine from Steimer says, and this of course is Metal Gear Solid V. Kristine, we did a let's play yesterday, it was your first time getting to see my obsession here. Yes, so like now we're back in the helicopter. We, I know, let's not get ahead of ourselves. I just serious the franchise. I don't know if that's true yet. Really? Yeah, I mean, you mean you obsessed about Metal Gear? I don't feel like I see you get this way. Infamous is another contender. Oh, oh, oh, oh, oh, I'm sorry. You said this was my favorite, uh, my favorite game in the franchise is what I thought. I the franch totally fine. I apologize. I apologize. Yes, Metal Gear Solid, probably overall my favorite franchise, definitely the one that's changed my life a few times. So we ran around, we captured some guys, we killed a bunch more guys, because you wanted to see that. Now I promise you to go to Mother Base and show you my Zoo, so that's",
            "start": 0.12
        },
        {
            "text": "that's changed my life a few times. So we ran around, we captured some guys, we killed a bunch more guys, because you wanted to see that. Now I promise you to go to Mother Base and show you my Zoo, so that's where we're going to go right now. Now this is an animal conversation, con, conver, now you're got me, conservation platform on Mother Base. Are you familiar with Mother Base? No. I have to your live and you build it out and your mother lives there and you're doing all these things. Mother's not living there. Why not? Because we're, we're Diamond Dogs. We have no time for love or family or anything. That's what, what dogs all about family. Yeah, well, we are a pack of dogs now that roam doing what we got to do. Okay, taking care of bad guys. Now funny story, I haven't been to my conservation platform in my game yet, because I'd done it during the preview event when I originally got it. So this will be interesting. When I capture the animals out there in the wild, they get dropped here. Oh, you have a T-Rex? No T-Rex yet, no.",
            "start": 44.44
        },
        {
            "text": "because I'd done it during the preview event when I originally got it. So this will be interesting. When I capture the animals out there in the wild, they get dropped here. Oh, you have a T-Rex? No T-Rex yet, no. Raptors. I should have some cool bears for you to look at. A few coyotes. They dance there. You can see right there. I got, look at that, donkeys. Oh boy, we got some asses up in here to. Ah, okay, that's pretty rad that that music plays. Yeah, you can set whatever you, whatever song selection. Miller, thank you. Wait, so you can just hop in the thing and with there and they don't attack you? I don't know if you can hop in there. Why not? What is that? What do you mean why not? I don't know, because I don't know. Oh, look, I guess I can't hop in there. Can, but is there anything in there? I don't know. That's the thing is like you got to, you know, you have to collect them all. They're like Pokémon. Oh, there you go. This is a bird, a bird Aviary. Got some vultures up in this piece. A really ugly bird. Well, you know what, Kristine,",
            "start": 90.76
        },
        {
            "text": "you got to, you know, you have to collect them all. They're like Pokémon. Oh, there you go. This is a bird, a bird Aviary. Got some vultures up in this piece. A really ugly bird. Well, you know what, Kristine, they can't all be winners. It's true. Door is open if any of them want to leave apparently. Yeah, they can fly out if they figure it out, but they're not that smart, so I don't think they will. Aren't you, wait, look around, just look around for a second, just all the way around. So this is on in the ocean. Yeah, that's where Mother Base is out there, so that's why they don't fly. Oh, there you go. Oh, hi Bears. Now that there is a po, it'd be a polar bear. That's a legendary bear I captured. Granted, I captured all these things, but that's, but the brown bear can suck it, because the white bear is way better. Idiot. Yeah, that's weird. I feel like I should be able to read these. Well, Ursa Major is the bear constellation. You, that's a coincidence. So maybe it's the, maybe this thing something. Yeah, what's that? No, same thing. I could",
            "start": 140.52
        },
        {
            "text": "weird. I feel like I should be able to read these. Well, Ursa Major is the bear constellation. You, that's a coincidence. So maybe it's the, maybe this thing something. Yeah, what's that? No, same thing. I could have sworn I thought in the past I could. Oh, wait, what's in there? Little doggies, coyotes maybe. Hello. Yeah, okay, so yeah, Canines. Oh, poster Pokémon, Pokémon poster. Antip. That looked more like Pokémon than an idol girl. Well, it had some Pokémon behind it, but I think they're definitely, definitely had the go. So this is the animal sanctuary where, okay, so we got more dogs. Yeah, worse than the other cage. Hyenas. What does it say they are? Oh, still dogs. All right, well, fair enough. I was wondering if they would be consistent on that. I mean, technically that's what they are, right? Yeah, they're, they're, they're a form of dog, dog family, K-9 family. Yeah, yeah. Oh, oh, yes, bear growls. Play it. Everybody look away. You don't want spoilers. Try find it. No, don't look at that. Nobody look at that. If you don't want spoilers, don't",
            "start": 191.84
        },
        {
            "text": "of dog, dog family, K-9 family. Yeah, yeah. Oh, oh, yes, bear growls. Play it. Everybody look away. You don't want spoilers. Try find it. No, don't look at that. Nobody look at that. If you don't want spoilers, don't look at the screen. We're going to find you the bear growls. Uh, maybe a whole bunch of spoilers. Is it not alphabetized? No, that's the thing. They put it in a weird thing. So I guess it'd be at Mother Base. Are you sure it's, yeah, I was about to say no. Where's the search function? Animal search, bear. There's bear. Oh, because it's under quired. Interesting. Okay, that's weird. There you go. Hope you enjoyed it. That's the thing I haven't done with Mother Base, Kristine, is run around and explored it. And there's like things like that in here that I know I'm going to have to do if I probably, I assume there's a trophy for getting all the cassettes. I haven't connected online, you know, to live since trh. I don't know. There's still a lot of questions, believe it or not, 60 some hours into this game right now. The question",
            "start": 252.64
        },
        {
            "text": "for getting all the cassettes. I haven't connected online, you know, to live since trh. I don't know. There's still a lot of questions, believe it or not, 60 some hours into this game right now. The question is, how do you lad, turn around, turn around, turn around. There's a ladder. Nope, that wasn't a ladder. I thought it was a ladder. I lied. I apologize for the lie. It's okay. It looked like a ladder. Maybe you're just in here with the bears now. This is where you live now. We got bears and a Snake. It's the world's greatest Zoo. Can you breed them? None of them to be multiply. I've only taken out two bears. There's a bear, but I know for a fact that, yeah, I've taken out a bunch of the jackals over there. So like that's why I have a whole bunch of jackals in there. You know what I mean? I need to add mating into this game. Like you a piñata sty. Yeah, or just straight Big Boss **** both. Now here's what I want to talk about, and this is a spoiler, spoiler. I want to know, spoiler, spoiler, spoiler, who do you **** in",
            "start": 319.64
        },
        {
            "text": "game like you a piñata sty. Yeah, or just straight Big Boss **** both. Now here's what I want to talk about, and this is a spoiler, spoiler. I want to know, spoiler, spoiler, spoiler, who do you **** in this game? Can you **** people in this game? Nobody. God damn it. Now that's, but that's interesting, because usually, not usually I guess, but there's usually some kind of love interest. Well, well, that's always thing. I'm sure I'm to list or is it just somebody that you as a player love and Snake doesn't really give a ****? No, well, I mean, it could go either way, but no, like what'll be, oh, Colin's here. Colin, a wild Colin was here. I didn't know he was here either. Um, so like, yeah, to my knowledge, you know, there's been no knocking of boots with like Quiet, right? Well, sure, well, is for sure you say, but like I might find a cassette tape later on that would hint at it. It wouldn't surprise me. Okay, that they hint at some kind of relationship. Um, but as far as they're being a cut scene, no. Now here's where I want to",
            "start": 370.96
        },
        {
            "text": "find a cassette later on that would hint at it. It wouldn't surprise me. Okay, that they hint at some kind of relationship. Um, but as far as they're being a cut scene, no. Now here's where I want to get really, really spoilery. Okay, like incredibly spoilery. Like this has probably been, it's already over the internet, obviously, because people are already playing the game right now and this won't be up for another. It's all over the internet about bananas. Is that an inside joke? Is that a joke for the internet from my mom? Oh, yeah, your mom did say that. Yeah. What is your mom's problem? I don't know. She doesn't like bananas anymore, that's for sure. Why does she like bananas? Because what the inter sugar. That's every fruit. I know, but that's true that my sister and I were talking about bananas and how they thought that they were really good for them and then but they're really high in sugar. And so my mom was like, it's all over the internet about bananas. Like jigs up, bananas. I know everybody knows about you.",
            "start": 418.8
        },
        {
            "text": "that they were really good for them and then but they're really high in sugar. And so my mom was like, it's all over the internet about bananas. Like jigs up, bananas. I know everybody knows about you bananas. Sorry. So what's the actual spoiler? Because now we said spoiler alert and then they just fast forwarded through us talking about. I mean, if you for this spoiler alert, if you don't want to know anything about Metal Gear and the story and how everything wraps up, because I've never been able to freely talk about it, but now I can because of when this let's play comes out. You need to cut it off right now. Okay, wait, so you're doing endgame spoilers? Yeah. Okay, so, okay, bye bye everyone. When you, we're going to try to progress to one of the final cut scenes I haven't seen in this game, because what happens is you beat, you beat the Skullface main storyline, right? Sure. And then the credits roll and then it runs a montage that says coming in Chapter, and you're like, I, I just beat this in it's 30 hours in. Uh, I'm",
            "start": 459.28
        },
        {
            "text": "beat, you beat the Skullface main storyline, right? Sure. And then the credits roll and then it runs a montage that says coming in Chapter. And you're like, I, I just beat this in it's 30 hours in. Uh, I'm getting a cut scene right now already. Hold up. R, r. Oh, well, maybe this is just, oh, whoever. Let's see what hap, let's see what happens. Stop. Oh, he's so happy to see you. That would explain. Sorry. Guess I've been away a while. Str. That's a bad example for the men. **** you. I haven't been gone that he gets pretty lonely too. Hi, Troy. Let Troy, right? Yeah, that is Troy. I feel like he's exaggerating how long I've been gone. I know, but I mean, maybe it's taking, we just went to go steal some dudes. Maybe it's taking in real time like pack stuff. I don't know. Maybe, maybe. All right, so 30 hours in, right? Which base is this? What the **** are you doing? This is the Medical Platform. That's you. They like that them getting beat up by me. They go, thanks, boss. And then that raise this morale. It doesn't make any sense, but",
            "start": 498.2
        },
        {
            "text": "this what the **** are you doing? This is the Medical Platform. That's you. They like that them getting beat up by me. They go, thanks, boss. And then that raise this morale. It doesn't make any sense, but neither does kidnapping it. So just let's go. So here's what I know. There's just a shower pod. Yeah, that's weird too. Do you know what I mean? Like that it looks like a porta-potty. Okay, so here's the spoiler. I'm playing this game. Yeah, Chapter. Get the poster. I'm coming in for it. 30 hours in. They're like, oh yeah, Chapter. Right? Uh, in one of they show all these cut scenes of these amazing things that you're going to do and see and like the story elements that'll be explained. And then they do this one random one. Here's the big spoiler everybody. One random one that pops up and it's Paz. The girl who blew up, the girl who blew up in Ground Zeroes is walking at you looking like she looked in Peace Walker. And Snake going, Paz. And you get for like two seconds. And so that happened. And then I played for another",
            "start": 560.08
        },
        {
            "text": "the girl who blew up in Ground Zeroes is walking at you looking like she looked in Peace Walker. And Snake going, Paz. And you get for like two seconds. And so that happened. And then I played for another 30 hours and never found that scene. And so I asked a friend, hey, have you seen it? How do you do that? And his answer was, you got to go wander around the Medical Platform. So we're on the Medical Platform. We got to try to find open doors. That's all I know. I have no idea what's happening, but you'll get to see Mother Base a bit. You get to wander around here with me on the base, by the base. Got to look for doors, Kristine. That's what you for doors. It might actually help too if I put what it's in a bin like that. Is that like an ice box? Can you open that? Can you c in there? Can you hide what B the red thing? No, that's, that's nothing. That's just a thing. I don't know. I don't know what you can interact with with this game. How detailed this world is. Just **** lying around you can't touch. Maybe we'll find",
            "start": 608.36
        },
        {
            "text": "no, that's, that's nothing. That's just a thing. I don't know. I don't know what you can interact with with this game. How detailed this world is. Just **** lying around you can't touch. Maybe we'll find some cassette tapes too. All these stairs, so many freaking stairs. Oh my God, there's even more stairs. We're going straight to the top. It's where they all the bananas are. Stop talking about bananas. Everybody likes bananas. I've heard the jigs up about bananas. We know the sh. I still like bananas. See, okay, that's the door. I can't. Oh, look at this though. That got a blueprint or something. Open that door, because or how do you open that door? You don't probably ever. I, I would, I don't know. I don't, I, I don't know how this game works. Do things unlock? Is it like if that, I mean, it might be like in a story it would have. Look at my Team Fat, fat flag. Yeah, Team Fat flag. Theoretically, he's not fat though, so I think he's not really a part of Team Fat. It's me. I did it, babe. I know, but looking at him, he's not fat. What do",
            "start": 650.84
        },
        {
            "text": "look at my Team Fat, fat flag. Yeah, Team Fat flag. Theoretically, he's not fat though, so I think he's not really a part of Team Fat. It's me. I did it, babe. I know, but looking at him, he's not fat. What do you do about it? I can't do anything about it. You, you want me to make, can you, is there a fat Snake? Jesus Christ. They like it. You are literally the worst boss, but they like it. So you steal them and then you enslave them and then you beat the **** out of them, but they like that. Some of that. No one likes that. Spoiler alert. They might like it. You don't know. I'll bet you the actual end of this game, it's going to be all of them turning on you and just killing you like it took away from Caesar-style. Like, oh, oh, Jesus. I don't know. That that was a long fall. That's going to, that's how I'm going to die in these, these let's plays today. **** falling off. I die a lot due to fall damage. Fall damage kind of in Guild Wars 2. I have died more from falling than from other things. That was one of the things I really I",
            "start": 705.32
        },
        {
            "text": "let's plays today. **** falling off. I die a lot due to fall damage. Fall damage kind of in Guild Wars 2. I have died more from falling than from other things. That was one of the things I really I liked to when they did Borderlands and you talk to Randy about it and he would be like, well, we wanted the game to be fun. We put everything in there fun. We'd say if it, if question about something, we'd say, is it, you know, is it or isn't it fun? And I remember during a demo somebody's like, is there fall damage? And he's like, does that sound fun? And we're like, no. He's like, no, there's no fall damage. But then he did the oxygen mechanic and that wasn't fun. But like the oxygen, okay, but first off, did he really do that? I don't know if he, yeah, exactly, specifically did it, but he allowed it to happen. I was it. I, you were a robot, weren't you? You didn't, so I never heard. I was a robot. I was the best class, because I didn't need oxygen, but you did and you was annoying. It was not annoying. It was not annoying. It was",
            "start": 755.68
        },
        {
            "text": "were a robot, weren't you? You didn't, so I never heard. I was a robot. I was the best class, because I didn't need oxygen, but you did and you was annoying. It was not annoying. It was not annoying. It was annoying. It was not. Just say it's annoying. I'm not going to, because I didn't think it was annoying. **** admit it. I no, there were definitely times where you were annoyed by it, but whatever you want to, you want to say it's perfect, world's greatest mechanic, go ahead. Why are you doing, why is this happening? So this happens a lot actually. I don't know why you got sass hands all a sudden. I always have sass hands. Assassin jump off. Can you swim? Are you a swimmer? You die. You die. Wait, am I on the Command Platform? You're on the wrong **** platform, you doof. Mother Base, I told it to drop. You don't even know your own platforms. I told they get dropped over here. Why can't you run there? Can you not get there from? You want me to, you want it? I mean, yeah, take a long walk. Take a long walk and think about that oxygen",
            "start": 796.64
        },
        {
            "text": "own platforms. I told they get dropped over here. Why can't you run there? Can you not get there from? You want me to, you want it? I mean, yeah, take a long walk. Take a long walk and think about that oxygen mechanic and how much it sucked. Okay, the literally the only time that the oxygen mechanic came in handy was when it killed you, because you were stuck in a wall or not in a wall, but you were stuck in a place you couldn't get out of and you were just like, well, this where I die. Uh, and then it took 5 minutes and then you finally my oxygen I had by the way, which really doesn't sound like it's that big of a deal. It was annoying. It's just unnecessary. It's unnecessary. If it's, if it's something that doesn't get annoying, then why is it even in the game? Why is it there? Because it can help you do the double, the double boosts. They just give you a double boost. Just make the game fun. The game was fun. We enjoyed that game. It was mostly fun. You're revisionist history right now. That's what you're doing. I had the",
            "start": 846.04
        },
        {
            "text": "double boosts. They just give you a double boost. Just make the game fun. The game was fun. We enjoyed that game. It was mostly fun. You're revisionist history right now. That's what you're doing. I had the best time, because I was Claptrap getting like weird itches on my arm, so I got to look down there. You're getting weird itches on your arm. You got some ants on you? No, that's the problem though. You think there's ants, then you get in your head and then, oh yeah, you can scratch my arms. That sounds good. You to come going to take a walk outside today. Want to see what we can find today? I don't know what that is. What's your song? Milo and Otis. Oh, the world's greatest movie about a cat and a dog. I like Homeward Bound more. That was, that was about a cat and a dog and a dog. Yeah, remember the golden retriever sounded all like noble and stuff. Yeah. Oh, Peter. Oh, and then Chance was Michael J. Fox, I think. Yes, that's true. I don't remember who cat was. She was, uh, Sally, no, yeah, Sally Field. No, yeah, I think it was Sally",
            "start": 888.32
        },
        {
            "text": "all like noble and stuff. Yeah. Oh, Peter. Oh, and then Chance was Michael J. Fox, I think. Yes, that's true. I don't remember who cat was. She was, uh, Sally, no, yeah, Sally Field. No, yeah, I think it was Sally Field. No, yeah, there was something. No, yeah, well, you could, you could Google it while I try to find. I have no phone, so you can give me your phone and I can Google it. I'm going to block Nick Scarpino from your phone. Ah, that cool. Why is he even calling or texting? No, I'm just going to block him. He was up there. Homeward Bound. I almost cried in home Homeward Bound. That last scene where they come up the hill by the, yeah, see that's another girl right there. And that's not Raging Buffalo or whoever the hell she was. Raging Buffalo. Nope, we're not, we're not doing that. Please. We not doing that. Molly's father. Don't care. Forest ranger. Don't care. Please just give us the animals. The only thing that anybody cares about in this movie. Damn Peter grew up. Oh, damond Sally Field was good job. Yes, well, you said it and",
            "start": 945.96
        },
        {
            "text": "Care. Forest ranger. Don't care. Please just give us the animals. The only thing that anybody cares about in this movie. Damn Peter grew up. Oh, damond Sally Field was good job. Yes, well, you said it and then you doubted yourself. And I was like, no, no, no, no, that was absolutely it, because then I could hear the cat's voice in my head and I knew it was Sally Field. I see. I can't remember that cat voice. For me, Shadow is Don Ameche. Same here. See, I was thinking about, uh, there was like Suzanne Struthers, I think, was in my, is who I was thinking of. Remember her? She's the one used to be like, do the Feed the Children commercials for some Feed the Children. Yeah, feed them what? Remember she was like one of the first people to be like, for 13 cents a day, you could save this. Oh, sh my be. Oh, look at that cute little person. Let's see what goes through. There's a door I can go through. Oh, ****, it's happening, Kristine. Are you sure? No, but I'm pretty sure. Fig. Shut, shut, shut the **** up. Spoilers. Snake. It's right. It's her.",
            "start": 1012.08
        },
        {
            "text": "let's see what goes through. There's a door I can go through. Oh, ****, it's happening, Kristine. Are you sure? No, but I'm pretty sure. Fig. Shut, shut, shut the **** up. Spoilers. Snake. It's right. It's her. What about the bomb? We were able to remove the explosives, both of them. Bomb. No, no, no, no, it's okay. There's another. It's all right. We got it out. The guided will be wrapped up by the time you get home. Make me proud. By the time they, I'll have Thea praising us as the poster for world peace out. Something's not right. Check her again, boss. Very. It's all right. We got it out. It's, it's okay. The other bomb. We, she hit the water hard, but somehow she managed to survive anyway. The shot triggered some kind of amnesia. Snake, where is Professor Gálvez? You mean him? Yeah, she still thinks it's 1974. She's got no memory of anything before that either. Cipher, the KGB. Nothing. It looks to be a kind of dissociative disorder, dissociative amnesia, where memories are blocked out to protect the mind and",
            "start": 1072.88
        },
        {
            "text": "she's got no memory of anything before that either. Cipher, the KGB. Nothing. It looks to be a kind of dissociative disorder, dissociative amnesia, where memories are blocked out to protect the mind and associative identity disorder changes what we're seeing seems to be a combination of the two. She truly believes she's nothing more than a student living in 1974. Peace Day was a lot of fun. I hope we can do it again. She doesn't respond to anything that conflicts with her internal timeline. Doctor's pretty sure she's not faking it. If she had her memory, just think what you can tell us about Cipher. The photo was from that guy you brought back the other day from the old crew. I thought it might jog her memory, but no luck. Like a Snake's dumb eye. Anything else you can show her? Do you have something to show me, Snake? I got thousands of ****. Why is no one told me she's been living here this whole time? Because they're **** me. Me. I give up. She's all yours. Maybe they were trying to fix her before they",
            "start": 1270.12
        },
        {
            "text": "show me, Snake. I got thousands of ****. Why is no one told me she's been living here this whole time? Because they're **** me. Me. I give up. She's all yours. Maybe they were trying to fix her before they brought her to you. That's some ****. This the kind of **** I need to know about. I'm goddamn Snake over. I was just going to say it was a little bit funny to have all that seriousness and then the Team Fat. Stick your Team Fat. Okay, so you met her when she was a student. How would she remember you if she thinks it's 1974? So like now you've right there. You just stepped on a landmine of Metal Gear stuff. Okay, we, we met her in Peace Walker when she came in. What year is it? It would have been, I guess, 74 or whatever. Oh, okay. She came in with the professor that book she's reading when she asked her where the guy is. But she was a double agent. She was work that was, she was already a double agent. I think she was. Yeah, yeah, she was playing as like a fiddle as Miller would say. But then remember in Peace",
            "start": 1338.4
        },
        {
            "text": "Walker, I wrote a hit story on IGN about how it didn't make any sense that, uh, Snake was having sex with her in the box, because she's a minor or whatever. But like different times. And then it was like, well, no, she's and she's much older than she lets on. So the whole thing's ****. Wait, she had, he had sex with her? You could, can I show her other things like your dick? Whoa. Maybe that'll bring back her memory. Also, no **** way she survived any of that. Here we go. That big ass scar. I know it looks fresh from the other day, right? I like it a lot. I look kind of silly, but it's got a peaceful feel to it. Peace Day was a lot of fun. Everyone cheered at the end, even though I missed a few high notes. We should have more events like that. Snake, where does she think the giant scar is from? I am so tired. Peace Day has gone.",
            "start": 1389.8
        },
        {
            "text": "was a lot of fun everyone cheered at the end even though I missed a few high notes we should have more events like that Snake where does she think the giant scar is from I am so tired pde has gone wrong I guess so I will just lie here a while you **** with her head she didn't like it this is weird welcome Metal Gear come back around can I give you more things why have we not given you a sheet you've been living here for well come on now she doesn't need them but for no Snake she's dreaming of you you're going to oh yeah take some creeper shots these aren't I'm I want they aren't cuz they kind of look like they are oh look at those eyelashes look at this eyelash technology what does that mean okay her eyebrows are amazing I'm jealous of her eyebrows holy **** what is special about them you they're just really nice what's I mean's I'm looking at your eyebrows though well cuz I had to actually do things to them whereas she's like sleeping but living in this **** room for how God knows",
            "start": 1444.8
        },
        {
            "text": "they're just really nice what's I mean's I'm looking at your eyebrows though well cuz I had to actually do things to them whereas she's like sleeping but living in this **** room for how God knows how long fell off a boat well see you know it's been a long time cuz her hair is long yeah but it's a weird I feel like that's a weird thing that would at least take it took me at least a year to get it like here oh no it's been I mean I was in a coma for 9 years oh like shit's happened she popped up wa what yeah you the the thing blows up there and then you're in a coma for 9 years and then you wake up the game starts why would she what no no no what that doesn't make any sense which part her her sitting in a room for 9 years with a scar that still looks fresh that **** would have healed by now yeah that doesn't make any sense to her hair well her hair could be whatever like love deterrence see I guess in her at Mother Base maybe there's a pause captured her for 9 years maybe she was in",
            "start": 1517.72
        },
        {
            "text": "yeah that doesn't make any sense to her hair well her hair could be whatever like Love Deterrence see I guess in her at Mother Base maybe there's a pause captured her for 9 years maybe she was in a com no they didn't capture her I know that capture that's the wrong word kept her in there confined her I'm doing this thing here what stop making that noise I hate it when they do this oh is that an acquire tape no what Love Deterrence what are you looking for I just got a tape called Love Deterrence so it's got something to do you just search with what's your face we're like newly acquired yeah I know right no it's just a strange spoilers for everything in the world right now by the way but you already knew that it's not my problem this Huey Lewis and the News yes good I'm glad that he made it in this game say something you got to talk watch I don't I'm I don't know say something I'm giving up on you we just sing a lot that's kind of what we do together we usually sing songs and we",
            "start": 1565.72
        },
        {
            "text": "made it in this game say something you got to talk watch I don't I'm I don't know say something I'm giving up on you we just sing a lot that's kind of what we do together we usually sing songs and we insert Portillo's name into it somewhere we also bang the dog no gross I know I don't know why you're saying that right after I talked about Portillo and being nice to him and singing him nice songs that he would like to hear because he likes to think of himself as a movie star it's true facts about Portillo P is humming there you go you got it I no that we heard it already Love Deterrence see damn it oh **** you that's what this was who knows Metal Gear you do know Metal Gear babe good job she think she's awake yet is that that can't be it for her right no it better not be you better wake the **** up woman how dare you sleep um I can't use anything in here either why not it doesn't let you yeah like I can't I thought maybe it 63 hours May I was thinking maybe I could come in here and",
            "start": 1630.2
        },
        {
            "text": "**** up woman how dare you sleep um I can't use anything in here either why not it doesn't let you yeah like I can't I thought maybe it 63 hours May I was thinking maybe I could come in here and turn on my I can't even use those can you bring the dog in maybe or the dog I don't think she ever met the dog pinto beans Pinto beans Pinto beans are delicious I love the tacos I love pinto beans pick up our medical record read more about her Bypass I'll figure you out pass enjoy your cell convalescing work in progress ah so a big deal about doing that when you come in and out of stuff well we figured that out okay well you got your you got your wish yeah but I know I only have more questions now well that's kind of way it goes doesn't it Metal Gear answer one question four pop up are you close to your thing to your record to your whatever to getting your wrench up you got your wrench up yet well let me deploy another group here and then we'll go look at that I bet no we are at 5% at the",
            "start": 1690.32
        },
        {
            "text": "to your thing to your record to your whatever to getting your wrench up you got your wrench up yet well let me deploy another group here and then we'll go look at that I bet no we are at 5% at the beginning of the thing oh those are percentages yeah I have 33 it's going that'll be the big one cuz once that happens then I can go and do chip away the rest of the stuff I want I was looking at the EV thing there there was a different number and it was 34 out of 40 oh okay maybe that was the number of people that you had 34 dudes well no I have way more than that cuz I got the 85 and all stuff I don't know then I don't know where I saw that 34 number I me there's a lot of stats and figures to go through yeah there's a oh wait there okay I'm just accept my rewards sorry no I'm now we're going to see you 34 what's now I think I was looking at the level and thinking that it was what you needed to be no R&D team has to get they're all they're all locked up right now who's in nobody's in the",
            "start": 1758.84
        },
        {
            "text": "to see you 34 what's now I think I was looking at the level and thinking that it was what you needed to be no R&D team has to get they're all they're all locked up right now who's in nobody's in the Sick Bay **** Pass is in the Sick Bay develop project has been added one person there see the brig's like jail right yeah who have you arrested oh you bring arrest Green Tarantula probably it's when you bring aboard somebody who doesn't want to work with you and you're like oh they want to work with me too **** bad like get in there get in the brig get in the goddamn brig we'll convince you to work and then I'll use my robot arm to squeeze the life out of you just like that just like that um okay oh my God what what happened it's having a seizure there just so much to do babe so much to do so much look at the map it's just freaking crazy as **** all right let's do an extraction end the let's play save P how about that that sounds like a good good Mission so these are guys that are",
            "start": 1807.32
        },
        {
            "text": "do so much look at the map it's just freaking crazy as **** all right let's do an extraction end the let's play save P how about that that sounds like a good good Mission so these are guys that are your dudes that got captured no I think I mean you have to do that occasionally but I usually these are just like dudes who need help good guys who got captured that I want to go get from the bad guys they don't have to be my good guys if that makes sense it does but I'm going to need you to do a video of you in real life trying to do these Snake moves where you just I'm not Big Boss on the ground and reverse crawl and you can train Portillo to stab a guy and uh could do these things yeah you a nice sneaking suit like this with a knife or a stun rod on it I think you can do it you'd have to go the only place that they would sell it in a doxd though would be Japan we have to go back to Japan oh what a what a shame to we back get him a little salty suit you're totally getting a copyright",
            "start": 1866.56
        },
        {
            "text": "go the only place that they would sell it in a doxd though would be Japan we have to go back to Japan oh what a what a shame to we back get him a little salty suit you're totally getting a copyright strike for this music watching and waiting it sounds like it's in the background YouTube's not that smart they can't figure it out it's pretty smart actually it's I know they're really smart it's a good robot they got some good robots over there whoa here she comes I don't like the teeth on the dog that's why you got to buy the Diamond Dogs shirt from us Wish by the time this goes live it'll be too late for anybody to get it but whatever really isn't this going live on Tuesday no this go live in probably Thursday I think oh well then yeah you're **** sorry should have been following more closely bruh br oh okay see it's interesting it says danger low here I'll do it but I'm pretty sure that's that that seems like that's going to get me shot at right away yeah you would think coming in",
            "start": 1921.32
        },
        {
            "text": "bruh br oh okay see it's interesting it says danger low here I'll do it but I'm pretty sure that's that that seems like that's going to get me shot at right away yeah you would think coming in with the self stuff make sure you get the dog all all good call geared up actually put the eye patch on him now okay so that you can match oh my God he's seriously so cute oh we have to jump out do a different menu to do that ah **** it then who cares deploying let's go get this P or whatever his name is his name is Dave we're coming for you Dave Dave Thomas of Wendy's also Thomas of Thomas muffins Kevin's cat Thomas no oh yeah he what they did name him after muffins didn't they yeah **** you don't like that stupid why is that stupid why would you name him after her muffins he's white he looks like an English muffin he's not white he's orange well okay oh he's he's orange tipped he well he's got the learn your cats people he got his Brown on top like an English muffin cuz you know they're",
            "start": 1967.16
        },
        {
            "text": "like an English muffin he's not white he's orange well okay oh he's he's orange tipped he well he's got the learn your cats people he got his Brown on top like an English muffin cuz you know they're white and then they get like cooked and they get brown on top I just feel like there are better names for a cat well sure do your English muffins hide under your couch I don't I hope not you might have ants then if that's you definitely have ants if you have English muffins stored underneath your couch Kevin refuses to bring the cat to this house with a good reason I don't want that **** cat around the house I do I don't want him staying forever I just want him to stay for like a minute so I can pet him I want Colin to get a cat and then or a k okay well that's the other alternative is that Colin needs to get a cat look at him cuz we were just at PAX and the game the card game Exploding Kittens um they had a cute little setup with uh an adoption center basically so they brought actual",
            "start": 2026.92
        },
        {
            "text": "Colin needs to get a cat look at him cuz we were just at PAX and the game the card game Exploding Kittens um they had a cute little setup with uh an adoption center basically so they brought actual kittens to the show and holy **** how does that work then telling me I'm totally fine here oh and there's snipers left and right I was talking about kittens so sorry I just got a little caught up oh someone got you good yeah there's a sniper over there too run into the ruins and then they'll forget all about you oh no they're going to they're going to get it anyways there were really cute kittens there and I wanted to play with them but there was a long line so instead I took pictures of them outside of the tents and they were very cute and they were very fluffy looking there were a bunch of gray and black kittens and then there were a bunch of calico kittens and uh I'm pretty sure all calicos are female is this true I think that is true there might be like the occasional rare male",
            "start": 2065.48
        },
        {
            "text": "of gray and black kittens and then there were a bunch of calico kittens and uh I'm pretty sure all calicos are female is this true I think that is true there might be like the occasional rare male Calico but for the majority it's like they're all female but I'm actually going to Google that now oh **** there's a **** ton of messages on your phone they're talking about calico cats too they're saying I oh it's the other thumb that has the are they talking about Big Chris Calico from Strange Music what up Strange Calico female Calico cats are are almost always female nailed it babe you're a **** expert takes one to no one oh stop **** running dude because of genetic determination of some coat colors and cats is linked to the X chromosome calicos are nearly always female because of the genetics involved Calico males are rare and generally have impaired vitality and are almost always sterile so that's your cat fact for the day just in case you didn't know that about cats I can go get",
            "start": 2115.44
        },
        {
            "text": "involved Calico males are rare and generally have impaired vitality and are almost always sterile so that's your cat fact for the day just in case you didn't know that about cats I can go get them he's got like laser eye oh no that was the taser just ran by in a funny way peace Jesus Christ that dog's so cool he's like half Portillo coolness but yeah he's cool Portillo doesn't even know how to lie down I'm just going to say that he's kind of worthless but he's cute as hell he knows how to sit he he sort of knows how to sit he knows how to sit he knows how to sit he just said whoo who whoa whoa whoa instant replay action Big Boss in an endless loop of trying to **** jump a little bit now I got two snipers out of the deal that's pretty good ni not a bad day at work so oh Jesus Christ who's still out there there's another sniper oh I see this whole thing was a goddamn set up sneak past enemies what can what enables you to sneak past enemies your Snake sneaking suit oh did you get him",
            "start": 2178.76
        },
        {
            "text": "still out there there's another sniper oh I see this whole thing was a goddamn set up sneak past enemies what can what enables you to sneak past enemies your Snake sneaking suit oh did you get him really no you didn't get him oh he was in a he's in one of the **** helmet pieces apparently oh protecting that KN can you send the dog after someone this far away or no no no no the dog won't know what I'm doing oh battery **** there's another one too oh Jesus Christ dude no I did oh you got him but where there's someone else oh he's over there I see him I see him uhoh he's got you he's got you yeah but he's stupid that was a good sound I like that sound effect little ping yeah another clear oh is that what that is like you got everybody is that what that sound is thank you no problem lady see you back at home oh right cuz she's the prison okay okay okay I'll never forget this I have a severe whiplash now boss you you brought her back but you broke her spine in the please support",
            "start": 2239.6
        },
        {
            "text": "lady see you back at home oh right cuz she's the prison okay okay okay I'll never forget this I have a severe whiplash now boss you you brought her back but you broke her spine in the please support requested look at that dog he's being dumb what you doing over there what are you doing over there oh you silly goose oh he's so happy we plays it himself look at him oh he's like this dirt smells real good God damn it D.D. what's wrong come here come here boy here boy I love **** like this in games he doesn't know how to climb the stairs he's just a dumb dog see he's a lot like P he's lot like he's he just lost all IQ I don't know what happened to him but LZ is the LZ see this part pisses me off there's an obstruction the LZ which is the is the car you brought the car that you just dropped me off in front of it's like come on come on guys plan ahead plan ahead maybe pick another extraction site maybe they do that so you don't forget your car so that no cuz the car",
            "start": 2293.6
        },
        {
            "text": "that you just dropped me off in front of it's like come on come on guys plan ahead plan ahead maybe pick another extraction site maybe they do that so you don't forget your car so that no cuz the car automatically EVACs itself out oh it it it'll drop a balloon you I don't lose the car unless it gets like blown up or some **** Smart Car ladies and gentlemen this has been another Metal Gear Solid let's play here on YouTube.com/KindaFunnyGames will there be more of course Tomorrow there's one more it's the GI spoiler of mission one Robert and I playing through back at Konami doing all these different things there'll be Twitch streams of course over Twitch.tv/KindaFunnyGames uh I'm Greg this is Kristine from Ses.com uh are you going to play Metal Gear are you sold not sold but the dog I mean I'm going to play part of it I want to see the puppy basically okay I'll play up until the puppy point and then we'll see if I like it or not okay good enough yeah for a let's play each and every",
            "start": 2368.32
        },
        {
            "text": "I'm going to play part of it I want to see the puppy basically okay I'll play up until the puppy point and then we'll see if I like it or not okay good enough yeah for a let's play each and every day keep coming back here to YouTube.com/KindaFunnyGames",
            "start": 2409.84
        }
    ]
}