{
    "id": 1163,
    "video_id": "jyx7lzUnhqI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How to Use Snapchat - The GameOverGreggy Show Ep. 91 (Pt. 2)",
    "description": "Snapchat doesn't make any sense.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1441090800,
    "duration": 1853,
    "transcript_chunks": [
        {
            "text": "Today's sponsor is Loot Crate. For less than $0 a month, Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with $4 worth of geek, gamer, and pop culture gear. Collectibles, apparel, comics, et cetera, delivered to your mailbox every month. This month they're celebrating all the monsters you can fit in your pocket and the ones you need some crazy circle drawing skills to bring to the Mortal Realm, whatever the hell that means. This month's crate features an exclusive collectible they're told is quote, \"the most important object in pretty much the whole universe,\" end quote, plus awesome items from Blizzard, Kid Robot, and more. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it, it's over. So go to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on your new subscription today. If you didn't know, this is The GameOverGreggy Show. Each and every week, four",
            "start": 0.04
        },
        {
            "text": "go to LootCrate.com/KindaFunny and enter the offer code Kinda Funny to save $3 on your new subscription today. If you didn't know, this is The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny. You can get the show early by tossing us a few bucks. But if you don't have any bucks to toss us, no big deal. Head over to YouTube.com/KindaFunny where we post it topic by topic, day by day, until we post the entire show on Friday for free as a video and MP3. Tim, yes, you were the second topic. Second topic of the day is Snapchat. So here's the deal, guys. I figured it out. Oh, you did? Finally. Only none of us knew what Snapchat was or how to use it. Here's the biggest thing. Still don't. I say I figured it out, didn't. That's what I figured out. You can't figure it out. It doesn't make sense. Nobody understands how Snapchat works, but that is how you",
            "start": 41.04
        },
        {
            "text": "it. Here's the biggest thing, still don't. I say I figured it out, didn't. That's what I figured out. You can't figure it out. It doesn't make sense. Nobody understands how Snapchat works, but that is how you know how to use Snapchat is when you realize this more than anyone else, because then you can just say you do, then everyone **** believes you. Gotcha. It's this magical trick that people play. See, see, I'm torn on this whole Snapchat thing because part of me, of course, has a huge ego and just wants to be big, um, so that I can destroy you all. The other part of me thinks that I've been through that revolution where like all of a sudden people were selling things that didn't weren't necessarily backed up by hard analytics and it never leads to something good. You know, where like people are making a lot of money on Snapchat right now, right? But there's no way to track that, that engagement. And so you don't really know as a brand if you're actually doing anything, if that money you're spending is doing",
            "start": 94.12
        },
        {
            "text": "of money on Snapchat right now, right? But there's no way to track that, that engagement. And so you don't really know as a brand if you're actually doing anything, if that money you're spending is doing anything. And that's what used to happen. Like I've seen that happen at, um, or you would hear that happen rather, like websites for instance, like, oh, we doing this, this, this, like that. I don't think you're tracking those views correctly. It's like, doesn't matter, we're charging millions of dollars for it. Like, what the ****? All right, um, I, it just worries me that a piece of tech like that is out there and being monetized because like Twitter for instance, you can see how many followers you have. There are actual metrics. You can see how many people retweet your stuff. You can see how many people are being driven from Twitter to the various links that you're sending them out to. So you can actually judge social engagement, whereas with Snapchat, people, I mean, people are like, oh, you got to be big on",
            "start": 137.36
        },
        {
            "text": "being driven from Twitter to the various links that you're sending them out to. So you can actually judge social engagement, whereas with Snapchat, people, I mean, people are like, oh, you got to be big on Snapchat. You're like, what does that mean? There's no, here's the thing, this is what I figured out. There's way, there is, okay, there is just the right amount of analytics to make all this make sense. Now, for the people out there that don't know what the hell we're all talking about here, this is all we're talking about like being able to monetize this. Wow. Greg's, Greg's, Greg's getting on Snapchat. I already Snapchat. No, this is Kinda Funny Vids. Kinda Funny Vids has been on Snapchat pretty big for a while. Okay, so don't worry about it. Yeah, see, there, I mean, again, Kinda Funny Vids, one of the biggest Snapchat accounts in the world. Oh, it's huge, actually. It goes The Rock and then Kinda Funny Vids and then the rest of the WWE. We have two friends. We have Harley Plays and Team Snapchat. That's all you need. I",
            "start": 172.92
        },
        {
            "text": "accounts in the world. Oh, it's huge, actually. It goes The Rock and then Kinda Funny Vids and then the rest of the WWE. We have two friends. We have Harley Plays and Team Snapchat. That's all you need. I mean, that's great. So what's interesting about Snapchat is the fact that publicly you don't see all the numbers and the stats and the analytics and all this stuff. And so to people like us that have been doing the social media thing for a while, we're like, this, I need numbers. I need numbers. I don't understand this, whatever. But you need to throw all that out the window. The reason that I'm like jumping on the Snapchat thing now, which granted, I'm late, but I'm early compared to most of the other **** like, like us doing this ****, because they're all like, I don't get it. I haven't been out with my friends or my friends' friends or my girlfriend's friends or whatever in like months without constantly whenever I look over, they're on Snapchat. Like this is what people are using now. And it's one of those",
            "start": 207.76
        },
        {
            "text": "or my friends' friends or my girlfriend's friends or whatever in like months without constantly whenever I look over, they're on Snapchat. Like this is what people are using now. And it's one of those things where we're on Twitter, we're doing Instagram, we're doing all that stuff, but it's like the people are on Snapchat. This is the people's platform. Yeah, so it's like we got to go where they are, you know what I mean? I'm not leaving what else we're doing, but it's like seeing how engaged they are and they actually are engaged in what they're doing and they're constantly doing it and using it as a messaging app to their friends. And that's, I think, the power of it. It's like Facebook where you get your friends involved in it. Twitter's a little bit more like you have conversations that, but so that's, so that's what, that's what gets me this. So what you're basically saying is this is more of a, uh, an app for one-to-one relationships or small group relationships, right? Like there's, this is not an app for",
            "start": 250.4
        },
        {
            "text": "that's what, that's what gets me this. So what you're basically saying is this is more of a, uh, an app for one-to-one relationships or small group relationships, right? Like there's, this is not an app for business to like we are to market to an audience. But they've now changed that. So I don't know when this happened. I'm coming in way late and I've gotten an education from the youth. Oh, I went to them, the two youth. We need to just hire a bunch of 10-year-olds to run this company. And that's pretty much what's happening. So I talked to all of them, all of the 10-year-olds. I, I conducted surveys and I figured stuff out. And I was like, I asked all of them, how do you use Snapchat? And they all told me. And I took all that information and I tried to figure it all out to try to make sense. Of course, everyone uses it differently, but the thing is, they all use it the same in some key ways. And what it comes down to, I educate you guys here. Thank you. Please let everyone out there know how to use Snapchat. I want them",
            "start": 287.8
        },
        {
            "text": "uses it differently, but the thing is, they all use it the same in some key ways. And what it comes down to, I educate you guys here. Thank you. Please let everyone out there know how to use Snapchat. I want them all to know how to use Snapchat because I'm sure a lot of you are question. I've seen a lot of people tweeting at me like, you cracked Instagram a long time ago. You helped Nick understand it. Exactly. If you want to know how to use Instagram, tweet at Tim Gettys and ask him how to use Instagram. He won't tell any of us, but he might tell you, especially Snapchat. I'm telling you all right now. So the, what it comes down to, the core thing of it is, it's a messaging app. You can Snap at people. Just take a picture. What a Snap is, it's either, it's a video that's up to 10 seconds long or a picture. Both of them, they have to be vertical. So it's a, you know, 16 by 9 aspect ratio. It's 9 by 16. Dumb. They're getting crazy. But what makes it interesting is there's all types of filters and **** you can use on it. Just",
            "start": 330.92
        },
        {
            "text": "they have to be vertical. So it's a, you know, 16 by 9 aspect ratio. It's 9 by 16. Dumb. They're getting crazy. But what makes it interesting is there's all types of filters and **** you can use on it. Just like any other photo app, but this one has geolocation filters. So depending on where you're at, it has custom filters where you're at. So you can like show off to your friends like, oh cool, look, I'm in Golden Gate Park or I'm freaking doing whatever the hell, whatever. That doesn't matter. But these kids tell me yet. No, no, no, the kids love it. The kids love it. Yeah, that's for them to message back and forth to each other. I have no interest in that. People message me and I once in a while I look at and reply and stuff. But there's another thing called Stories. Yeah, Stories is where things get real interesting. And by interesting, I mean then it just functions like anything we normally do. Okay, you post it, people see it, right? You can have your Stories. Your Story is up to 24 hours. So everything you post",
            "start": 368.08
        },
        {
            "text": "and by interesting, I mean then it just functions like anything we normally do. Okay, you post it, people see it, right? You can have your Stories. Your Story is up to 24 hours. So everything you post within 24 hours stays on your Story. Sure. And then it, it eventually just goes away. You can see the numbers of how many people are looking at your Stories. So the only analytics we don't get that I wish we got was how many people are following us or are friends with us. Sure. You can see all the people that do follow you, but there's no number. Gotcha. Count them. You count them one by one. Yeah, but I mean, I'm so big on Snapchat that I wouldn't be able to do. Oh, no, it's impossible. Yeah, so that's, that's the big deal. Got. If you want to, you know, join the army and make it even bigger, follow me on Snapchat, Kinda Funny Vids. Yeah, and Kinda Funny Vids. So you do that, right? But the thing is, the Stories, they're actually fun when you look at them in the day because at the end of the day, if you watch it, if people",
            "start": 412.64
        },
        {
            "text": "Kinda Funny Vids. Yeah, and Kinda Funny Vids. So you do that, right? But the thing is, the Stories, they're actually fun when you look at them in the day because at the end of the day, if you watch it, if people are posting four or five, six times a day, you get to kind of see what their day looked like. And what I like about Snapchat is you don't need to put as much thought into it as the Instagram post or the Twitter post. It's not supposed to be clever. I like to try to make them clever every once in a while, because I'm that type of guy. Yeah, but it's just kind of like watching things happen. So earlier today, Kevin was asleep on the floor. Yeah, Snap. They call Snap. They call it Snapchat. I don't know about, I'm not, the 10-year-olds haven't told me that. They haven't told Snapchatting this right now. This is what's happening. This is being Snapchatted. So you got to figure all that. Start Snapchatting. But there's the, um, the My Stories, right? And then you start following other people's Stories and it gets in",
            "start": 453.24
        },
        {
            "text": "what's happening. This is being Snapchatted. So you got to figure all that. Start Snapchatting. But there's the, um, the My Stories, right? And then you start following other people's Stories and it gets addicting. I've been checking my Snapchat constantly, just following my friends, seeing what they're up to and all that stuff. So you can follow people. Yes. Okay, so that's where the Stories come into play because you follow how I follow you right now. I'm going to follow you right now. You can search by username and type in Tim Gettys. Okay. Now there's another thing you do. There's this weird little ghost thing with the QR code. Yeah. If you screenshot that QR code, you can automatically follow the people. You can send, I, we can tweet that out, right? Yes. You tweet out your little, your little thing and they do it. Mhm. And so it's fun, you know, there's this whole like virtual reality thing to it. It's cool. Can you have virtual sex in it? Of course. Yes. And so that's when the messaging comes in. You go back, back to",
            "start": 494.04
        },
        {
            "text": "it. Mhm. And so it's fun, you know, there's this whole like virtual reality thing to it. It's cool. Can you have virtual sex in it? Of course. Yes. And so that's when the messaging comes in. You go back, back to that, Nick. That's, that's, so you send, I screen cap that. Yes. And if I tweet that out, people can just, they screen cap it. What do they do? They'll just, if they, uh, download the picture or whatever or screen cap it, you can just add, there's a thing that says add by QR code or whatever. And you can just, it automatically add you. Just Tim Gettys, is that what you are? Yes. Kinda Funny Vids has a score three. What does that mean? So the score, that's where things get really interesting. It, you said it's gotten really interesting four times or something. The score means absolutely nothing. I don't understand. Now here's the thing, to be fair, guys, honestly, I don't get this. I don't get this at all. This makes anert. But this number thing, this number, this score, I think that's the amount of people that have sent you",
            "start": 529.04
        },
        {
            "text": "Snapchats. Oh, so as far as I'm concerned, that number means nothing. Like, who cares, right? Yeah, no, I'm with you. So that's dumb. That number's dumb. What? Kevin's got it. Something. Kevin's chiming in. Kinda Funny Vids, you're stupid. Just letting you know, it's officially stupid. Kevin is stupid. But, um, now there's another level to this that is my personal favorite thing about Snapchat and what I actually have been using the app a lot to engage with myself in terms of content that I like. There's this thing called the Discover tab. The Discover tab is a bunch of brands. There's only like 10 brands at a time and they're always like the top brands in the whatever given sector they're in. So BuzzFeed, uh, ESPN's one of them, whatever. Cosmo Magazine's one of them. And every day there's 10 new Snaps that you can",
            "start": 569.72
        },
        {
            "text": "and they're always like the top brands in the whatever given sector they're in. So BuzzFeed, uh, ESPN's one of them, whatever. Cosmo Magazine's one of them. And every day there's 10 new Snaps that you can go through and it's custom content that's premium made just for Snapchat that you can watch there. And all it is is just like, it's essentially animated headlines and thumbnails. Okay, so it's awesome. You can kind of just skip through it real fast. Some of them have like videos they can play, um, that are up to a minute long feed. So there's a lot going on. And BuzzFeed's killing it. BuzzFeed is, it's, here's what BuzzFeed is. BuzzFeed is like the junk food of the internet, right? You're just like, I don't need any of this, but it's fun while it's lasting. This guy, there's an article I'm reading right now called, \"A Man Is Creating Miniature Art for Every Day of the Year.\" And it's amazing. And you know what? It is amazing. Yeah. Goddammit, BuzzFeed, you got, they got it. They got it. So I mean, this, this is cool to me",
            "start": 616.64
        },
        {
            "text": "\"A Man Is Creating Miniature Art for Every Day of the Year.\" And it's amazing. And you know what? It is amazing. Yeah. Goddammit, BuzzFeed, you got, they got it. They got it. So I mean, this, this is cool to me though, because then this is just for sheer entertainment, right? Like I'm just, I'm just blading through BuzzFeed. But then do they have to make this every day? Yes. So they have to make 18. There's somebody who's just Snapchatting. So, well, the people that are on the Discover tab, like that is such a lucrative position. Like you're not going to get there unless you're making real, real deals, right? They probably have teams working Snapchat. You ****. Oh, interesting. Did you see the one? It says, \"You suck.\" It says, \"Kevin sucks.\" And it's a photo of you and I put little feet on your balls. So they just, they just added a new feature where you can put emojis on your Snapchat. So you can kind of like put emoji faces over Nick's face and do all this. Yeah, I did it to you stuff. It's great. And then also the, the oldest thing",
            "start": 657.6
        },
        {
            "text": "new feature where you can put emojis on your Snapchat. So you can kind of like put emoji faces over Nick's face and do all this. Yeah, I did it to you stuff. It's great. And then also the, the oldest thing for Snapchat is that you can draw on your pictures. So that's when things get real fun. A couple days ago, there's a picture of Kevin. I drew ack on it. And great. Um, but how do I follow these people? You just search for them and then you add as a friend. This sounds like, I got to be honest with you, this sounds like the stupidest **** thing. I was just, I was just reading about, about them because I want, I want to know more about them as a company. And it, this, this, this, it's huge. It's, it's huge. I mean, their numbers are huge. They make no money. They have, which is every **** company in Silicon Valley. They have through Series C funding. So they've gotten funding like four times at this point, uh, rounds of funding. So they have money. Doesn't seem like they're making any profit. Uh, it doesn't seem like",
            "start": 701.92
        },
        {
            "text": "they have through Series C funding. So they've gotten funding like four times at this point, uh, rounds of funding. So they have money. Doesn't seem like they're making any profit. Uh, it doesn't seem like this can be have any profit. This is really **** fun. No, it's stupid. I don't like it. This, this is stuff. No, Snapchat. I don't like. I've tried before to get on the train and I just can't do it. Stupid and fleeting. My answer to Snapchat is no. Like Colin, to be fair, your answer to everything is no. That's not true at all. There are social networks with utility and those are the ones that last, right? Facebook has been around for 10 years, which is, which is ancient. And it's not going anywhere. It's not going anywhere. You know, Instagram is relevant only because it's, it's obviously its own thing, but also Facebook owns it. So it's not going anywhere. Twitter is going to probably truncate at some point. They're, their stock is in the toilet. But Twitter has utility. Twitter out of all of them has the most",
            "start": 740.92
        },
        {
            "text": "Facebook owns it. So it's not going anywhere. Twitter is going to probably truncate at some point. They're, their stock is in the toilet. But Twitter has utility. Twitter out of all of them has the most utility. And so I think that that's why it's useful at some point. Like what's funny about all these different things, whether it's Vine, which are kind of, you know, or or Periscope or all these things that are either tangent or intimately related to another social network or something like Snapchat, which is just like **** nonsense, but something that could theoretically be done on something that already exists. Is like, there's all of these existing platforms that, that already are dominating and they should try to fold each other in so that there's more, there's more utility. Like this sounds **** stupid until Tim just described it to me. I would have agreed with you, but now I kind of get it. Not, not from the personal standpoint, but from the Story standpoint. I can understand like from a place",
            "start": 781.28
        },
        {
            "text": "stupid until Tim just described it to me. I would have agreed with you, but now I kind of get it. Not, not from the personal standpoint, but from the Story standpoint. I can understand like from a place like BuzzFeed where you're just basically taking your content and you're just delivering it to the audience in a different manner. Like if you go through BuzzFeed, it's pretty cool. It's just, it's each article, but it's done in a vertical scale and you can just sort of, you're basically through top Stories. Well, that's, that's, so those aren't Stories. Those are the, that's the Discover tab, right? And the Discover tab, I mean, that's just like premium content like you'd be searching on anything. Sure. But for you, I just looked through yours and I was like, oh, I get it. It's, I just seeing what Tim's doing today. Yeah. And it's pictures and fun and it's for the sheer entertainment. And so what you're saying about like, why don't we just fold this into something else? I, I totally get you. I mean, I'm right there with",
            "start": 818.52
        },
        {
            "text": "and it's pictures and fun and it's for the sheer entertainment. And so what you're saying about like, why don't we just fold this into something else? I, I totally get you. I mean, I'm right there with you. And like, I agree that like this is dumb, but the difference is people are engaging with it. And like people like dumb things. No, I, I know they do. But I just, and it's such a commercially, you know, predictably for me thing to say, but it's just like, we like, we need like Greg's just been on his phone the entire segment messing around with this thing. It's like, do we need more examples of people like just needing to be on their phone all the time? Like put your **** phones down and like, like to me, it's just like, I, I think Twitter, when I sell people on Twitter, I still think Twitter is exceptional in, in what it is because they're going to have a hard, they're still having a hard time monetizing it. And who knows what the company's going to look like? I, I assume that they're going to be sold at some point.",
            "start": 852.04
        },
        {
            "text": "what it is because they're going to have a hard, they're still having a hard time monetizing it. And who knows what the company's going to look like? I, I assume that they're going to be sold at some point. But you know, it's a news feed. It is what you want it to be. And everyone's like, oh, I like Instagram. And I'm like, you can put a picture on Twitter. And people are like, people like, oh, I like, you know, Vine. I'm like, you can put video on Twitter. Like, like all of this stuff can already be done, right? You know, and we're already there. And it's just like, what is the point? They're not already there though. And that's the thing. I saw some stat about Twitter where it's like, um, there was a survey of like hella adult males. And there's something like 90% of them are on Facebook and like 13% are on Twitter. Mhm. So it's like, they're not, you know what I'm saying? We as social as media consumers, I, I would assume most of our people are on one of these networks or whatever. Mhm. I just don't understand. Like, I feel like",
            "start": 888.08
        },
        {
            "text": "it's like, they're not, you know what I'm saying? We as social as media consumers, I, I would assume most of our people are on one of these networks or whatever. Mhm. I just don't understand. Like, I feel like there's too much, I guess what it comes down to is this. There's way too much vanity in all this ****. You know, like people are just **** obsessed with themselves. And I'm sick of it. I really am. Like, I'm so **** sick of it. You know, like it's not, it's not all like, it just bothers me so much that like none of these things have utility. Like none of them are useful. It's just a way for you to be about yourself. That's it. You know, and interact with other people that are about themselves. Like I like Twitter because it's like, oh, I'm thinking this and here's a picture. And oh, I look at my thing. And Politico said this and The New York Times says this. And all these kind of, at least it's useful and it's enlightening. You know, it can be as enlightening or not as enlightening as you want it to be. But",
            "start": 928.24
        },
        {
            "text": "Politico said this and The New York Times says this. And all these kind of, at least it's useful and it's enlightening. You know, it can be as enlightening or not as enlightening as you want it to be. But there, there's a possibility. I don't know how you, how, how valuable a picture or a 10-second video. But look at the Discover tab. Like that's the thing is like, it is that, but it's curated that and it's like really like well presented information. Yeah, but I feel like that's shoving a square peg in a round hole. You know what I mean? Like I feel like looking at this, like the fact that everything disappears is just showing you thatting it doesn't matter. That's really weird to me too because I remember when we were in Atlanta, someone recorded a video of me on this for their friend. And I'm like, oh, you should send it to me later. He like, oh, it gets deleted after 24 hours. I'm like, what the **** is the point of this? That's all stupid. But that's why they're so engaged. And here's the thing I'm seeing a lot is",
            "start": 964.12
        },
        {
            "text": "it to me later he like oh it gets deleted after 4 hours I'm like what the **** is the point of this that's all stupid but that's why they're so engaged and here's the thing I'm seeing a lot is like I put stuff out on other stuff and I I know the numbers that I get I put stuff out there the numbers are like five times as much and that's just because the people are like they want to see it and they they're finding a reason to come back every day and see what's going on and and look at it and I it's entertainment at the end of the day these people are being entertained I'm being entertained looking at the stuff you know and it's like this ESPN I'm on the Discover for ESPN it's actually pretty sweet like you know what I mean just Discover that's actually something that so here's the reason I am starting to support Snapchat is one day Discover is going to be for everybody one day I'm going to be able to do that you know what I mean like that's going to be an option that people can do I",
            "start": 1000.48
        },
        {
            "text": "I am starting to support Snapchat is one day Discover is going to be for everybody one day I'm going to be able to do that you know what I mean like that's going to be an option that people can do I guarantee they going profiles I mean these companies have to be paying to be in this cover tab I have to imagine because there's no ads being run that I'm seeing it's just so it's so this society is getting boiled down in the smaller and smaller bits and the smaller and smaller pieces of information it's just infuriating like we've got to the point we just looking at Greg going through the ESPN stuff like we can't even sit down and watch a **** full highlight anymore you know now we just need like this one home run and that's it and that's the that's the news of the day is the home run in the in the game the N9 game I know man it's just I'm frustrated for two different reasons about this is is one like there's too many of these things they can't all buy that's my big problem there way",
            "start": 1035.16
        },
        {
            "text": "the in the game the N9 game I know man it's just I'm frustrated for two different reasons about this is is one like there's too many of these things they can't all buy that's my big problem there way too much **** and I was reading on I was when I was on my phone I was just reading about them about their valuation they're value between 10 and 0 billion in what **** Universe you know is is this thing worth 10 to 0 billion dollar this is why everyone looks at Silicon Valley sometimes and they're like is anyone making anything like does anyone have anything you can hold and touch you know like even when Apple is is going down and and I mean they're fine but like they're their stock today like really took a huge tumble uh Twitter which is a ubiquitous platform that people respect is going down Facebook obviously got **** pummeled when their IPO came out and like these are real companies you know that like existed for a long time and I just look at these new companies coming up and",
            "start": 1075.12
        },
        {
            "text": "down Facebook obviously got **** pummeled when their IPO came out and like these are real companies you know that like existed for a long time and I just look at these new companies coming up and I'm like the reason U is so fasting and Uber is the ultimate unicorn company because it's worth $50 billion and it's still private is that that's a service they're not going anywhere you know they're going to take over they're going to have their own autonomous cars one day and something like that and then I look at something like Snapchat worth between 1th and two fths is much as Uber and that's it it's pictures and videos that are deleted after 4 hours the people the targeted demographic is engaging with constantly here you have to think about this though it's like it's essentially and this is what I see more and more of Right Where five years ago I used to see everyone looking at their phone and I'd be like they're probably playing a game right they're playing no I was going to say like",
            "start": 1115.36
        },
        {
            "text": "is what I see more and more of Right Where five years ago I used to see everyone looking at their phone and I'd be like they're probably playing a game right they're playing no I was going to say like Words With Friends or something like that right we like they're playing an app they're playing a game on their on their phone that's just to waste time right it's the entertainment value of it now people I think think have transitioned over to the Snapchat of this isn't necessarily where they're getting their news from it's just fun it's just it's just a a distraction while I'm waiting in line at Starbucks and that's that's the scariest thing for me is the thing for me is I feel like I have enough of the distractions yeah but you are also uh 35-year-old man sure very sure um I'm ingrained with Twitter I like Instagram fine you like yeah you like you like all those things you like to be able to to message this is a very from what I can glean kind of more of a passive experience where",
            "start": 1151.48
        },
        {
            "text": "with Twitter I like Instagram fine you like yeah you like you like all those things you like to be able to to message this is a very from what I can glean kind of more of a passive experience where you're just kind of following people it's similar to Facebook right where you're going down your Facebook feed and just seeing what's going on in your friends lives um I I kind of get it now but it's not I I mean it's like any other social media you can use it for information are you going to try to use it now yeah I think I'm going to try to use it now I mean what's crazy is I just I would not recommend you guys using it and I I say that **** you man po want to be big on SN no cuz here's the you specifically because you you need to do it a lot like this isn't like Instagram or Twitter where it's like a couple posts a day or or like like a post or two a day are fine with Snapchat it's about six a day it's about throughout the day Nick I just did three sitting here yeah yeah I know I look",
            "start": 1187.16
        },
        {
            "text": "it's like a couple posts a day or or like like a post or two a day are fine with Snapchat it's about six a day it's about throughout the day Nick I just did three sitting here yeah yeah I know I look your Twitter feed and I wrote all your tweets so you might you might want you might want thing you need to tweet and what makes Snapchat different just like all of them suck every social media sucks unless you make it good and I think that's the thing with this is it's like you need to curate make content specifically for it and then it's good it feels like Snapchat is like a step away or two steps away from evolving to a form that's like awesome for everybody and that's what I see when you're talking about like the Discover tab will one day be for everybody and stuff like that it's like that's exciting but then why would you want to get in now and lay on the groundwork right it's like when you didn't I didn't do it with Twitter or YouTube or Instagram you know what I mean like I got on",
            "start": 1224.76
        },
        {
            "text": "exciting but then why would you want to get in now and lay on the groundwork right it's like when you didn't I didn't do it with Twitter or YouTube or Instagram you know what I mean like I got on all those platforms late yeah that kind of thing I just to me it's it's I I get you know we all we all succumb in social media to our own vanity right it's really it's about your brand or whatever you know I hate that word but it's about what whatever whatever it is and so I try to use these platforms to be at at least somewhat interesting if not informative at times too where it's like I I'm really uncomfortable at the end of the day with things being about me I don't like it you know and I want it to be about more than me or more than what I say so I try to link out you know a political story or say something meaningful and and sometimes I'll say awful and stupid things too to be funny or whatever because everyone has that and that's that's when you to come to kind of the vanity of like",
            "start": 1263.04
        },
        {
            "text": "or say something meaningful and and sometimes I'll say awful and stupid things too to be funny or whatever because everyone has that and that's that's when you to come to kind of the vanity of like well this is funny and I'm going to share with my friends or whatever but I feel like if social media social media really began with things like Friendster LiveJournal and stuff but if you if you really if you really identify is starting in some sort of embryonic state with Facebook what's happened is what Facebook is today is the broadest of of social media platforms and everything's just it's a upside down pyramid everything's just gotten **** funnel funnel funneled down into just **** incomprehensible nonsense at this point like Instagram to me I I I respect it and I know people love it and that's fine and I'm happy about it I'm like what is the point it's Twitter but you can't say anything on it you know what I mean like like on Twitter you can post pict but you can say more than",
            "start": 1301.84
        },
        {
            "text": "and that's fine and I'm happy about it I'm like what is the point it's Twitter but you can't say anything on it you know what I mean like like on Twitter you can post pict but you can say more than 140 characters on Instagram sure but you have to make pictures or people like type on their notepad and then take pictures of it and put it up or something like that like I see a lot of athletes do that kind of stuff if you want that's Twitter yeah on Instagram you can **** write an essay in your well I know on the comment but I see like I see a lot of like people like Amy Schumer like released something a while ago and and did something like that when she got in trouble the the Instagram to me is just like okay so like we took Facebook and then Twitter's like okay we're a small say what you need to say Facebook right and then Instagram's like we're taking out all the text basically it's pictures only and then Snapchat's like okay we're taking out we're going to have pictures and videos",
            "start": 1338.04
        },
        {
            "text": "need to say Facebook right and then Instagram's like we're taking out all the text basically it's pictures only and then Snapchat's like okay we're taking out we're going to have pictures and videos and we're deleting them and so it's like what the like to me I I know it's the thing where I'm like I'm just getting old and I don't I and I just I don't understand but like to me I want these things to have utility if I'm going to have this everyone's obsessed with these **** things you know and at least I want if I'm on there and I'm on Twitter I'm like phone for everyone listening my phone actually maybe don't lie be a journalist maybe I'm maybe I'm learning something or I don't know it's just to me I'm like I just feel like it's just too why don't we like and and it's not up to us it's really up to the companies maybe it's a failing of these companies you know clearly there's a market for Snapchat it's just like when I see like okay are they going to be around in five years are do they",
            "start": 1374.0
        },
        {
            "text": "up to the companies maybe it's a failing of these companies you know clearly there's a market for Snapchat it's just like when I see like okay are they going to be around in five years are do they have any money like Twitter has never made a **** cent you know so like how and they're worth way more than money so it's like how much how much can you possibly make at this point you know before you need to start showing returns like what is your burn rate and all these kinds of things I in other words I feel like people have these great ideas and but they're becoming more and more reductive and I really I I it's the same reason I hate **** cell phone games I like utility and depth yeah you know and like we're getting further and further away from that that salient point where things were being used for good and now they're just being used like this this new technology this Snapchat for instance is just like okay now it's clearly I don't use it I don't understand I'm not judging it in",
            "start": 1409.04
        },
        {
            "text": "being used for good and now they're just being used like this this new technology this Snapchat for instance is just like okay now it's clearly I don't use it I don't understand I'm not judging it in a way like where people shouldn't use it whatever I'm just saying like I it doesn't resonate with me and it's sad to see something like that's so promising like Twitter for in my opinion have to compete with something that doesn't match it on utility basis you know and for me competition though I think it's just there's just different **** to do what you're saying about it being the pyramid it's like I just think that it's less that and it's more there's a bunch of **** do whatever you want we've hit that point where it's just like there's hell of **** yeah what your friends audiences are all fragmented there's not there is no longer when everybody was on Facebook and that's I think Myspace was the the real thing that was the the first one of where it really became a who who you",
            "start": 1444.92
        },
        {
            "text": "are all fragmented there's not there is no longer when everybody was on Facebook and that's I think Myspace was the the real thing that was the the first one of where it really became a who who you friends with and commenting and being public about who you're friends with essentially you know there's all that stuff but it was different it's so funny Myspace man if you and I think this is what I react to too Colin cuz I'm I'm I'm I'm a both worlds on this one too is that part of me is like yeah we are just being old and that younger kids are just going to be picking up these these apps as they roll out and there's going to be something after Snapchat that even those kids aren't going to get in like three months in three or four months or maybe a year something else is going to be big and the people that are on Snapchat are like that's dumb I don't know what the hell that thing is and then all the new kids are going to be like uh Snapchat's stupid that's for old that's for like",
            "start": 1483.28
        },
        {
            "text": "and the people that are on Snapchat are like that's dumb I don't know what the hell that thing is and then all the new kids are going to be like uh Snapchat's stupid that's for old that's for like 18-year-olds that's dumb I'm 13 I use Googy gooo you know it's it's not even going to be like a word you can say words that you can say aren't cool okay this word has to be inaudible you can't even pronounce the **** thing um but at the same time uh you know these I think I lost my goddamn train of thought again I'm dying here I'm dying um Facebook for me has had sort of resurgence where I I moved away from that platform for a very long time because like you're talking about I still look at that platform as people use it the exact same way that use Snapchat right where it's just a bunch of people posting a bunch of stuff about their lives and sometimes people care and sometimes people don't and it's more for entertainment value than it is for anything else really but some people use it for",
            "start": 1521.16
        },
        {
            "text": "posting a bunch of stuff about their lives and sometimes people care and sometimes people don't and it's more for entertainment value than it is for anything else really but some people use it for news and some people use it for entertainment recently though I've been caught every single time I open my **** Facebook app I'm there for like 0 minutes and it's because of Facebook video it's because of these **** and I'm like and I started looking at the view counts cuz they're smart they put just the view count no like dislike **** it's just views 1 million views on the last one I watched 13 million views on the next one and I'm watching these whole I'm watching half the videos before I realize there's **** sound I can click on the thing and I can actually hear what they're saying I'm like oh that's pretty fascina well it's again that's about knowing the where you're putting stuff because so many of these videos they're designed the content around not needing sound because it",
            "start": 1562.36
        },
        {
            "text": "I'm like oh that's pretty fascina well it's again that's about knowing the where you're putting stuff because so many of these videos they're designed the content around not needing sound because it auto plays without the sound in the beginning so they catch you and then it's like oh cool so that's why there's a lot of subtitles and there's a lot of like things going on I'm telling you right now I think Facebook is is I think they've got something with Facebook video I think they know they have something with Facebook video and they're being smart right now like getting everyone addicted to it before they try to heavily monetize it but I think that's going to be huge money a lot to need to figure out with that **** but yeah but how hard is it right you click on the video you get an ad bum no but they need to figure out the whole they need a Content ID system they need a Content ID and they need to I don't can you search Facebook video no I mean that's they need a hub and they need a",
            "start": 1596.04
        },
        {
            "text": "bum no but they need to figure out the whole they need a Content ID system they need a Content ID and they need to I don't can you search Facebook video no I mean that's they need a hub and they need a Content ID system because right now all those 1 million view videos are stolen things from other people oh that was a big that was a big uh uh that's a big issue right now especially on on other platforms any platform really that's not YouTube yeah uh there was a famously there was a a week and a half ago this guy Nam this is his name Fat Jew yeah The Fat Jewish or The Fat Jew I think is his name he's The Fat Jewish on on Instagram got pinched for stealing all of his stuff I actually he's been getting yelled at about that forever and that guy **** Jerry too uh yeah I mean that's and and that's one of those things where I follow those guys and I know you're part of the problem I know better than to do that but I just didn't realized that he I assumed he just had a small team of people",
            "start": 1625.88
        },
        {
            "text": "one of those things where I follow those guys and I know you're part of the problem I know better than to do that but I just didn't realized that he I assumed he just had a small team of people working for him that were going out and and doing these memes every day really I mean it didn't it didn't occur to me Tim got a very old school sense of thinking over here he got a Content creation it doesn't it wouldn't occur to me that someone would form a lucrative business stealing other people's images wow and it didn't occur to me because I would have thought that that person would have been caught a long time ago with the way the Internet polices itself cuz the Internet's like if you do something wrong you're found out immediately right and I heard about that a long time ago and it wasn't until like 6 months later where I heard about it again but this time on like big podcasts and big news media outlets um that's that's shocking to me uh what what are you doing over there you kissing the",
            "start": 1665.2
        },
        {
            "text": "like 6 months later where I heard about it again but this time on like big podcasts and big news media outlets um that's that's shocking to me uh what what are you doing over there you kissing the dog no I having to stare down with him um yeah I don't know I mean to me that that's a huge deal but Facebook I think is still going to be it's going to remain a pretty dominant platform Snapchat I'm sure it'll it'll be around I'm surprised that Instagram's still around to be honest I'm surprised that Vine's still a thing I'm surprised that any of these things are we're all surprised their things because we don't use Twitter we are the Twitter and YouTube generation right cuz the people that are into Instagram it's like oh my God they're getting so many views so much engagement so much money to be made there there's so much happening there you know so it's quality too for if they're doing that you know but that's the thing like just looking through that Discover tab and I'm like I I get this",
            "start": 1702.08
        },
        {
            "text": "made there there's so much happening there you know so it's quality too for if they're doing that you know but that's the thing like just looking through that Discover tab and I'm like I I get this now this is just a different way to view content right for for ESPN for the the 5 Seconds I spent with BuzzFeed looking at it it is and it's not right it is it is actually if you look through that St if you look through the story those articles are actually a phenomenal that's actually a pretty cool way to display an article so instead of blading this way you're just going up and you're just reading the article like this which is I agree with you that it's reductive but I think it's it's a great entry point I don't watch ESPN like you do on a daily basis right I go there for shows I want to see for certain things right but I would sit there and like oh these are great highlights that are short and like I'm on the bus I'm waiting for the train yeah I'd page through it when I'm done if I",
            "start": 1740.56
        },
        {
            "text": "see for certain things right but I would sit there and like oh these are great highlights that are short and like I'm on the bus I'm waiting for the train yeah I'd page through it when I'm done if I could get into my rotation of Reddit and Twitter and Instagram and Facebook and see what's happening on the page and then over the Kinda Funny forums and then you know what I mean it's just the add isation of the Internet that's that's a big deal and it's like it's it's just it's as a as someone who creates content and used to write and and do all this kind and still you know writes and we do all I just I just hate that you know we were talking about Twitter's character character count I always thought that that was actually really novel because it's like say what you need to say you know like and I was I was like exactly and I always love that when someone takes a picture on Instagram and then I go on their F Twitter and they and it's on their Twitter and then I go to Facebook and it's",
            "start": 1775.6
        },
        {
            "text": "and I was I was like exactly and I always love that when someone takes a picture on Instagram and then I go on their F Twitter and they and it's on their Twitter and then I go to Facebook and it's on their Facebook it's like what is the point of all like what is what is the point of this you know uh at the end of the day it's you know again these are vanity things and we all have them out there as our personal Brands but I just feel like we have to kind of Dig Down and think about the things that are most useful to us as people and also the most useful to to our audience out there and I just feel like yeah it's just getting so reductive now that it's it's actually these kinds of things are actually actually annoy me you know like where I'm like I'm like this like it's it's this is this is too much for old man Colin to handle I was going to say I can't imagine Colin being annoyed bying the kids",
            "start": 1808.84
        }
    ]
}