{
    "id": 1217,
    "video_id": "re6peFYMT34",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Will Pokemon Go Actually Be Good? - Kinda Funny Gamescast Ep. 37 (Pt. 3)",
    "description": "The newly announced Pokemon Go sounds quite intriguing.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1443013201,
    "duration": 934,
    "transcript_chunks": [
        {
            "text": "Topic three of the day is Pokemon Go. Yes. Is everyone familiar with Pokémon Go Nick? I'm familiar with uh like Tomb Raider and Hitman Go. Okay this is not that. This but they did similarish. Is it a lightning mobile version? Pokemon, isn't it? Ring ring. Let me check the phone. Yeah it's truth calling for you Tim. You better take good. All right, so um what's funny about that though is the uh Square Enix Montreal Nick Nick Verge who's the **** homie he made a image of Laura versus like Pokemon and like in the Pokemon Go stuff and it funny. So obviously Pokemon's not made by Square. No. Okay, so Pokemon Go is a new game that they announced to kind of uh I mean it's not the it's not for the 0th anniversary of Pokemon but it will release during the 0th anniversary of Pokemon. I have a feeling they're going to do something as well to celebrate that. But it is a augmented reality game for mobile phones. So this is Nintendo's like real big first step into mobile games",
            "start": 0.31
        },
        {
            "text": "I have a feeling they're going to do something as well to celebrate that. But it is a augmented reality game for mobile phones. So this is Nintendo's like real big first step into mobile games, but not one of the five DNA games. Yeah, this is not DNA. This is made by I might be messing up some of these names. Um, it's a company called Niantic. N I A N T I C. They were owned by Google for a while and now they're not. They're here in San Francisco. Yes. And so they're doing stuff like with Nintendo. They're making this Pokemon game and it is a it's a mobile game where you catch Pokemon in real life. So it's one of those that uses your camera and you kind of look around the environment. Oh, there's Pikachu and Pikachu's out there trying to score on the side. Okay. So, not much is known about this. Right now, there's been one trailer for it and it blew the internet the **** up. Like, the trailer has something ridiculous. Has like 15 million views, which for for video game trailers. Suck",
            "start": 59.76
        },
        {
            "text": "this. Right now, there's been one trailer for it and it blew the internet the **** up. Like, the trailer has something ridiculous. Has like 15 million views, which for for video game trailers. Suck at night with the series, right? Why don't you make a Pokemon series? I know, man. Pokemon the series coming out of the ball. Starring me as Pikachu. I like that. Pikachu Pikachu doesn't go in the ball. But so the thing with this though is that the trailer they released is is really like 14 million views on on a a video game trailer thing is like that's big for a mobile game like that doesn't have Kate Upton on a horse. Exactly. Right. So the trailer it was like 3 minutes long and it was so amazing. It's just it started very stylized. A lot of like big white text on the screen and it's like imagine if Pokemon was in real life. It almost made it look like like a heads up display or something. I was actually very confused when I was watching. I was like like obviously the game's not going",
            "start": 104.08
        },
        {
            "text": "imagine if Pokemon was in real life. It almost made it look like like a heads up display or something. I was actually very confused when I was watching. I was like like obviously the game's not going to be like this. What's the game actually going to be like at the very end of the show and it's just like the two guys on the screen. Okay, so that's the thing is like you look at this and as gamers we all are instantly like, \"All right, what's the gameplay?\" You know, cuz this this is the equivalent of something even worse than a CG cut scene trailer. You know, this is people in real life doing **** Like you see people like throwing balls and **** It's like you're not really going to be **** doing that. Um, but you see the trailer is just like adults walking around and they'll like pull out their phone and like there'll be like a map of where they're at and you see there's a Pikachu nearby and you look and then he uses his camera and he's all like doing his thing and then like in",
            "start": 149.92
        },
        {
            "text": "out their phone and like there'll be like a map of where they're at and you see there's a Pikachu nearby and you look and then he uses his camera and he's all like doing his thing and then like in you see the Pikachu running around and stuff and like they throw the ball and catch him and stuff and then there's like it cuts to like families and they see a Charizard in the field and like there's all this **** going on and then it the climax of the video is they go to Time where I'm like I can't believe nothing happened there. I I was waiting for him to catch it, but he's two climax and usually that at least get you looking at Kevin. I'm trying to decipher all the words that are coming out of your mouth cuz I know it's English, but I just can't figure out you know everything I just said. Stringing them all together. I don't understand. You know these things. All right. So, it climaxes with them in Time Square and all the people in the trailer kind of come together and there's just a",
            "start": 186.0
        },
        {
            "text": "Stringing them all together. I don't understand. You know these things. All right. So, it climaxes with them in Time Square and all the people in the trailer kind of come together and there's just a ton of people around. They all have their phones. are all holding him up looking at the sky and there's like a Mewtwo in the sky and Mew Mewtwo is a very important badass Pokemon Nick and you see all these other Pokemon fighting it and it's like there's like a timer like counting down and the health bar is going down so it's like will they beat him in time who knows and then like last second they beat him and then everyone's like ah going crazy and **** I assume they all caught they all get to catch him if they beat him maybe catch him or maybe just defeat him he might have been I don't I don't know whatever they show the stuff and and that pretty much it. They showed gameplay which just was an image of of a Pikachu standing in a grassy **** field in Charizard and it's just like it",
            "start": 227.84
        },
        {
            "text": "don't know whatever they show the stuff and and that pretty much it. They showed gameplay which just was an image of of a Pikachu standing in a grassy **** field in Charizard and it's just like it looks nothing like you want it to. There's like it seems like there's three parts to it, right? There's the collecting on your own where you go around the world, find these guys. There's the fighting other players. So, you and I are on a train. Our our before we blow Nick's mind, our phones let us know that we're close and we're like, \"Oh, we accept battle. We battle.\" Then the third part is yeah there's these like events like MMO events raid party kind of things that happens. Now this is all happening on your phone of course. Yeah. But let's say you don't want to carry your phone out of your pocket with you at all times looking for these things. What if I told you they were releasing alongside this mobile game, a peripheral that you wear on your wrist that looks like a Pokeball and it",
            "start": 266.16
        },
        {
            "text": "pocket with you at all times looking for these things. What if I told you they were releasing alongside this mobile game, a peripheral that you wear on your wrist that looks like a Pokeball and it looks like a Pokeball **** one of the Google Map pins and it has a little friendship race friendship bracelet band that goes around it and you could just wear this and tap it to do things in this game. Would you wear this? Would I wear that? Uh, can we do a video where we wear it for a week and we talk about it? Assuredly, no. I will not be wearing that or that thing that comes with Fallout 4. Okay. Now, first off, let's not throw stones at the Fallout 4 Pip Boy. I'm not going to be happening. I'm going to wear it around this house all day long naked. Okay, so going going back to it, here's the thing. You can wear clothes with it. This is like the the announcement that people have been waiting for forever. It's a Pokemon MMO. Like, this is amazing. And the fact that it's real life and all",
            "start": 305.2
        },
        {
            "text": "thing. You can wear clothes with it. This is like the the announcement that people have been waiting for forever. It's a Pokemon MMO. Like, this is amazing. And the fact that it's real life and all this stuff, it's like, holy **** this is the coolest thing ever. Except it's totally not going to be. It's not going to be what we want to. And it's going to be disappointing. That looks kind of cool. Great attitude about No, but but here's the thing though is like Portillo looks like a dog leash. It could be awesome. And I feel like even though it's not going to be what we think it's going to be, it could still be awesome. And if it links to a Pokemon game, which they said they're going to try to do and have that do stuff, if there's an actual game that I'm really playing and then this is all just extra stuff on top of it, that could be cool. But I don't want that. I want this to be a standalone awesome thing. Now, a little backstory on this. Niantic, the company that is making it or",
            "start": 348.72
        },
        {
            "text": "all just extra stuff on top of it, that could be cool. But I don't want that. I want this to be a standalone awesome thing. Now, a little backstory on this. Niantic, the company that is making it or with with Nintendo, they already made a game called Ingress, which we all remember. Game of the Year. I mean, do you know anything about No idea what the **** Ingress is? Have you ever heard of it? No. Okay. I've heard of it before. It's a huge thing that like millions of people were playing. I don't They're still playing on the Vita. It was like No no no no no. Uh, it was like 2013. It originally was on Android devices, so like Kevin was playing it with like his friends. **** nerd. Um, but the game has this really really really complex science fiction like backstory thing. And if you watch the trailers for that, it's very similar to the trailer for this Pokemon thing where it's like people are doing all this type of crazy **** It's like, all right, but what's really going on?",
            "start": 383.92
        },
        {
            "text": "watch the trailers for that, it's very similar to the trailer for this Pokemon thing where it's like people are doing all this type of crazy **** It's like, all right, but what's really going on? Now, the story of that game, whatever, I don't really know, but the gameplay of it is there's portals that come up and there's different factions that fight over control of the portals. So you kind of become people that you take this side or this side and you go to the portals and like it's like king of the hill but in real life. Now the portals are all based around real world locations. So like the ferry building in in one of the videos is one of the portals. So people will go and like if they check in there then **** happens and you look at your phone like there's like augmented reality **** and all that stuff, right? But what ended up happening here is it's this multi- uh it's an MMO. So people started doing metagames within that game. So **** got **** real. And there's portals",
            "start": 424.8
        },
        {
            "text": "and all that stuff, right? But what ended up happening here is it's this multi- uh it's an MMO. So people started doing metagames within that game. So **** got **** real. And there's portals in the middle of like fields and stuff that people were trespassing and doing stuff they're not supposed to be doing. And like people in real life were like fighting over this **** and like they'd meet up and beat the **** out of each other. There was arrest that happened over this. like this became like a real thing where there's like real money being put into it and like people get obsessed with it and started creating this whole culture where they just created their own ecosystem of like this crazy storyline and it became characters where it's like real life role playing. That's awesome. So that sounds crazy, right? Yeah. Now let's take Pokemon and add that to it. Let's make it a little safer for kids. That sounds awesome. Yeah. You know, and that's why the Poke Walker thingy is the",
            "start": 467.28
        },
        {
            "text": "So that sounds crazy, right? Yeah. Now let's take Pokemon and add that to it. Let's make it a little safer for kids. That sounds awesome. Yeah. You know, and that's why the Poke Walker thingy is the kid version. Like that thing's fun. It's because so that way there's not kids using their phones walking into the middle of the street looking at Google Maps and **** dying. This thing will just **** tell them what to do. They're still gonna walk. They're still gonna walk in the middle. Well, that's because they're kids in the dumb. I can't wait for it to get monetized is what I keep saying is I can't wait for it to be monet McDonald's which wouldn't. But let's unless a Del Taco buys into it, right? And they just like now you get a **** special Pokemon every time you come in Del Taco kids. Yeah. So Ingress did that. Um but it wasn't so much like buy a thing, it was just go there. Yeah. Go there. So it's like like um Del Taco would do an ad buy with the game and so it's like that",
            "start": 508.0
        },
        {
            "text": "kids. Yeah. So Ingress did that. Um but it wasn't so much like buy a thing, it was just go there. Yeah. Go there. So it's like like um Del Taco would do an ad buy with the game and so it's like that would become a portal. So then people would go there. I'm already here. Yeah. Exactly. But what's cool is the idea would be depending on where you live there's different Pokemon. So you can't catch them all just where you're at. So that creates it's just like there's so many ideas with this that could be super cool. I believe the first game to do this was Mod Nation Racers on Vita which also gave you unique items if you went in and used near around like the Statue of Liberty or the Eiffel Tower. I never did it cuz nobody understood near but that could happen. Also, Mod Nation Racers on Vita was a disappointment and really hurt my feelings. But this is one of those cool things where there was a huge spike in Ingress downloads when this Pokemon thing was announced. People just want to try it",
            "start": 540.32
        },
        {
            "text": "a disappointment and really hurt my feelings. But this is one of those cool things where there was a huge spike in Ingress downloads when this Pokemon thing was announced. People just want to try it out. They're interested. They want to see what it is. Now, I I watched a couple YouTube reviews of like pretty detailed reviews of this game. Kevin. Hey everybody, Kayman here to tell you what Ingress is all about. No, it wasn't that. Um, but it's one of those things where I mean I'm not super into it, but I can understand people getting lost in this. And I think Pokemon might be that gateway drug that I'm like, this is this is **** cool. Makes us all crazy. The role playing of oh, I'm this like secret espionage person and I'm part of this team that that needs to beat this other team. Totally not down with. Oh, Team Rocket's out there and I need to stop them. There's gym leaders and I need to go beat them cuz I'm a Pokemon **** master. Yeah. Hell yes. It's when I saw it I like, you",
            "start": 583.04
        },
        {
            "text": "not down with. Oh, Team Rocket's out there and I need to stop them. There's gym leaders and I need to go beat them cuz I'm a Pokemon **** master. Yeah. Hell yes. It's when I saw it I like, you know, we were talking about this earlier uh in the year where I was like, I should play a Pokemon. I actually give it a shot. And you're like, try this one. And I hunted it down and it turned out was on my bookshelf and it turned out I've already played it and fell out of it. I'm like, well, not the best one to start with, but one of definitely the best one to start, but the one on a mobile phone like maybe it's just my my first Pokemon, you know what I mean? Kind of thing. And I mean that like in the like my first whatever, you know what I mean? Where I'm just doing it, I'm screwing around. We're all going to I'm sure you're going to be screwing around with it. So yeah, we we'll go on trips and see stuff and pick stuff up. The interesting thing about this is it seems like it's going to appeal",
            "start": 623.44
        },
        {
            "text": "all going to I'm sure you're going to be screwing around with it. So yeah, we we'll go on trips and see stuff and pick stuff up. The interesting thing about this is it seems like it's going to appeal to gamers who've never picked up Pokemon before is what I kind of got from this, especially you look at the YouTube views. Uh 15 million or whatever. Well, that those are the people playing Pokemon. I mean, no. No. Yeah, I mean that's totally true, but like uh just think about, you know, everybody has a mobile phone. You're like, \"Oh, hey uh hey random person I work with. Uh there is uh who's not in the games industry. Uh, there's this new game I'm playing, Pokemon game. Oh, isn't that for kids? No, it's hella dope. It's like geocaching except you uh except you catch fictional monsters. Now, so a cool thing that you're kind of bringing up here is the way that this game is being marketed. I just looking at it, it is being marketed at adults. It is being marketed at people that grew up with",
            "start": 651.44
        },
        {
            "text": "a cool thing that you're kind of bringing up here is the way that this game is being marketed. I just looking at it, it is being marketed at adults. It is being marketed at people that grew up with Pokemon. And the two dead giveaways to that are the fact that everyone in the trailer is an adult. There's no kids. And if there's a kid, they're not the one playing it. They're just with their dad playing. and only the original 150 Pokémon are being featured. And but that's one of those things where it's like I'm not such a purist in the way that I feel like those are the only ones that matter, but I know there's a lot of people my age that do feel that way. Well, those are the only ones that uh that those people grew up with. Yeah. I mean, they played that and they didn't really play. They didn't play the other ones. Like I didn't play Ruby or Sapphire. Uh so I know all the ones from the original, but I don't really know any of them from that era. Yeah. Uh, so I mean like that's what I'm",
            "start": 690.32
        },
        {
            "text": "play the other ones. Like I didn't play Ruby or Sapphire. Uh so I know all the ones from the original, but I don't really know any of them from that era. Yeah. Uh, so I mean like that's what I'm saying though. It's like the marketing of that like only seeing the Pikachu and Charizard and Mewtwo and um there's a whole bunch of other ones that were in it, but they were all OG ones. So it's like I think that that's definitely saying something and who knows if that's how it's going to end up, but this is very much a this is not necessarily a kids game. Now the little device thing says otherwise, but that's awesome. A more adult Pokemon game or like it's not for adults, but yeah. Does it say does it say you does it say you have to have that little accessory? No, you don't. That's just like that's just a different way to bonus or whatever. I mean, seriously, they say microtransactions. I want to know what that's going to look like. No. Well, that's a disaster. I mean, that that's obvious",
            "start": 729.6
        },
        {
            "text": "just a different way to bonus or whatever. I mean, seriously, they say microtransactions. I want to know what that's going to look like. No. Well, that's a disaster. I mean, that that's obvious, right? Like you're not near the Rocky Mountains, so you're not getting Geodudes. I want a Geodude, you know? Okay. Does that mean since I live in Las Vegas, we're only getting Sandshrews? We're only getting Sandshrews. Maybe if you find a cave, there'll be a **** ton of Zubat. Damn it. But this is I mean I love this. But I also don't like the idea of going outside. You're thinking too hard. I mean there's going to be the random hard to find things. Yeah. In the middle of the desert or whatever. There'll be to it's going to be otherwise it'll be like uh **** invisals on VA and P or mainly on PSP was where they made a million invisible games where it was like oh you can use your same office every day and I mean I mean really every 15 minutes and something's",
            "start": 771.52
        },
        {
            "text": "on VA and P or mainly on PSP was where they made a million invisible games where it was like oh you can use your same office every day and I mean I mean really every 15 minutes and something's going to pop and oh you know we know you've been playing long enough that you need to see something so here you go. Yeah. And I just like it cuz we travel so much. Yeah. So it's like oh we're going to see all the cool **** And that's why I think we'll play it'll be something a dumb distraction while we wait in the airport. I can't wait to have to convince Nick to take me places. I'm I'm going to play this. This sounds fun. Articuno, take me to Antarctica. I'll go to Antarctica. That'll be good. What's in Mexico? That's what I want to know. Yeah. What Pokemon would be in Mexico? Is there a tequila zard? There's no tequila zard. Blue agave zard. No, we're going we're going to find out. All right. Yeah, we'll at least we'll be able to clean up in the in the United States. Yeah, for sure. Come",
            "start": 809.04
        },
        {
            "text": "zard? There's no tequila zard. Blue agave zard. No, we're going we're going to find out. All right. Yeah, we'll at least we'll be able to clean up in the in the United States. Yeah, for sure. Come convention season, we go to like 18 different states, so we're good to go. That'd be dope if there was like certain reg like maybe there are the ones that pop up frequently throughout everywhere you go. Like you can get a Pikachu no matter where you go. Yeah. Ratta. Uh you can get like Pikachu, Ratta. Uh uh or Rattata. How do you **** say that? I don't even Rattata I think. Uh Zubats and you can find those like anywhere. But then like regionally there are the ones that are just specifically like your legendaries. The ones that you really want. Like that. Yeah. We'll have Magmars in Las Vegas. Oh yeah, definitely. That's awesome Tim. You need to just somehow figure out how to get like a login or do a login that you can share with the community on the forums and just have everyone across",
            "start": 843.52
        },
        {
            "text": "Oh yeah, definitely. That's awesome Tim. You need to just somehow figure out how to get like a login or do a login that you can share with the community on the forums and just have everyone across the trailer gave me **** chills. Like it ends you like it's real life and the camera like zooms out and the earth's like spinning around just says, \"Got to catch them all.\" I'm like, \"Hell yes, I do. I really do. This is the Pokemon movie all over again.\" Oh my god. So good. Fair enough. All right. Uh last topic of the day. Sorry, that might be my first Pokemon game, by the way. No, but see that I'm going to play it. I don't know if it should be. I mean, there's definitely not enough information to make that choice one way or another, but like jump. It's going to be different. Jump in. It's gonna be real different.",
            "start": 885.28
        }
    ]
}