{
  "id": 1170,
  "video_id": "SdzGY3e-NoU",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "What Defined The '90s? - The GameOverGreggy Show Ep. 91 (Pt. 4)",
  "description": "Each of us describe what the '90s meant to us.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1441263601,
  "duration": 2328,
  "transcript_chunks": [
    {
      "text": "Today's sponsor is Loot Crate for less than $0 a month. Loot Crate gives the geek in you a special treat every month. Loot Crate is a subscription box service with $40 worth of geek gamer and pop culture gear, collectibles, apparel, comics, and more delivered to your mailbox every month. This month they're celebrating all the monsters you can fit in your pocket and the ones you need some crazy circle drawing skills to bring to the Mortal realm. This month's crate features an exclusive collectible they're told is quote the most important object in pretty much the whole universe end quote. Plus plus awesome items from Blizzard, Kid Robot, and more. You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate and when the cut off happens that's it it's over. So go to lootcrate.com kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Nick, yes you get to take us home. Yes yes brother yes. Uh my topic comes from the good people",
      "start": 0.04
    },
    {
      "text": "kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Nick, yes you get to take us home. Yes yes brother yes. Uh my topic comes from the good people over on Patreon. Oh patreon.com kindafunny where you get the shows early and of course support us at a tier that then gets your topic read on the show. We should actually probably thank all of them. Oh there it is. Thank you for all your support ladies and gentlemen in the month of J spell. I'm casting a spell on it. Whoa. Kevin wait no they they support in July just sit and look pretty. I got this from here right. I'm going to pee you're being real. Why is everyone got to pee cuz they drank so much water. Whoa what the hell was that that was a weird ass dance can are you going be able to hear Nick's topic for make sure to Snapchat your P Tim you walked you walked right through the special Banner Kevin when he walks through the special Banner please animate it breaking in half and exploding and I want",
      "start": 41.32
    },
    {
      "text": "for make sure to Snapchat your P Tim you walked you walked right through the special Banner Kevin when he walks through the special Banner please animate it breaking in half and exploding and I want the letters and words tumbling out into the screen make anagrams with them no Greg you went through have all the letters floating around us right now in anagram form so make sure that's the case Greg you pulled these topics from from Pat and you let me pick which one that W were they all from Rhonda yeah today was going to be the Rhonda episode but Rhonda you I will use your topic next week and Nick will you because we're going to do two Rhonda topics yeah all great episod all great topics by the way but the one that I picked out of the two was Greg Tim can you hear me I hear a tinkle noise I can hear him pee peeing do you want to spill time while he doesn't you want do no it's fine I'll catch him up when he comes back what what is the topic the topic is what was the 90s like for you what",
      "start": 98.32
    },
    {
      "text": "can hear him pee peeing do you want to spill time while he doesn't you want do no it's fine I'll catch him up when he comes back what what is the topic the topic is what was the 90s like for you what shows were your favorite did you steal a catch for from any show and use it all the time I'll give you an example did I do that yes yes yes uh Circle did you use roller blades instead of a bike uh what was your favorite 90s clothing anything that was uh anything that was you in the 90s period P.S the cold cut episode may be the lowest in numbers but from a person from the East Coast living in Seattle it hit so close to home and it was one of my favorite Rhonda R Rhonda strong Rhonda strong thank you for your topic uh so Tim the topic was what were the '90s like for for you did you steal any catchphrases what shows did you watch you came of age in the 9s that was your time we kind yeah the '90s is an interesting thing for me because I'm definitely you know I feel like I'm a '90s kid quote",
      "start": 134.48
    },
    {
      "text": "what shows did you watch you came of age in the 9s that was your time we kind yeah the '90s is an interesting thing for me because I'm definitely you know I feel like I'm a '90s kid quote unquote but I mean I was born in 1989 so really my time like what I count like my growing up being is and I feel like a lot of people that were born around my time say they're '90s kids but it's really more like 95 to 2005 Jesus cuz when you were like you were like zero to 5 you don't know **** that doesn't mean anything to 2005 that was me you know going from being like kindergarten to Mid high school so cognizant you know yeah when you were cognizant when you when you understood what it was to wipe your own ass and you were doing a good job indulge in all of these different uh things so there's there's a ton of stuff for me that like even if it happened in the '90s I it doesn't count for me so for me life pretty much started with Power Rangers right yeah and reruns of Transformers and",
      "start": 180.24
    },
    {
      "text": "there's a ton of stuff for me that like even if it happened in the '90s I it doesn't count for me so for me life pretty much started with Power Rangers right yeah and reruns of Transformers and Turtles okay you just go forward from there um and then and Nickelodeon what was ever was going on over there Classics such as Space Cases oh we were just talking about Space Cases that was a that is a classic that's one Nickelodeon had a lot of shows in the 90s that around that time period so around 95 through 98 or so this is before their like so their Nick Tunes revolution had been occurring right they released Doug, Rug Rats um a couple of these like Rocco Rocco yeah those shows were happening but it was before they went overboard this is the pre- SpongeBob era where they really started realizing how to make money off of all of their cartoons and **** and um and then when they went off the deep end with live action shows that were more like sitc as opposed to uh their like game yeah Okami",
      "start": 227.72
    },
    {
      "text": "how to make money off of all of their cartoons and **** and um and then when they went off the deep end with live action shows that were more like sitc as opposed to uh their like game yeah Okami or like their game shows like Guts or Legend of the Hidden Temple slime people was that double D dou dare yeah well they slime people also you can't do that on television yeah that's that's where it started which then later turned to Figure It Out and all this other other stuff and Sanders do you remember godamn do you remember or was he too young or he too young stick stickly of course just making sure so that is PO Box whatever sck and then Face on Nick Jor and all this stuff so the 90 of Nickelodeon that's cuz it was more of like a little you were probably at school and stuff during the time that's the thing for me '90s what you're talking about is I was a '90s kid you know what I mean like I I feel cognizant I I come online and remember lots of things starting in '89 cuz that's when I'm",
      "start": 273.64
    },
    {
      "text": "the thing for me '90s what you're talking about is I was a '90s kid you know what I mean like I I feel cognizant I I come online and remember lots of things starting in '89 cuz that's when I'm going to first grade kindergarten or first grade I guess both maybe that's how it worked and then I remember you know going to Ghostbusters 2 in the theater and like having like that's like a crystal clear memory of do that stuff yeah exactly and so then just going on from there like yeah I remember when Power Rangers came around and I was a little too old to be into him but I was super into them all right Portilla they're taking you no don't worry about it Kev I got this everybody say goodbye to Portilla no bye Portillo right in there see you in two weeks okay I'm coming you want um yeah Nickelodeon there was all these shows like like uh my God like My Brother and Me and uh space that had very limited runs yeah My Brother and Me was like episodes or something and they put it out and there would",
      "start": 320.44
    },
    {
      "text": "there was all these shows like like uh my God like My Brother and Me and uh space that had very limited runs yeah My Brother and Me was like episodes or something and they put it out and there would just be rerun after rerun after rerun but we grew up with that **** we could recite those episodes back and forth I always and that was before the we had well I guess I had the internet at that point but we we weren't using it like this where it was like I would sit down and watch you know My Brother and Me every day like or every Saturday whatever it was like waiting for a new episode for like 2 years and it just wasn't going to happen see My Brother and Me it was like a sitcom that just like you know it didn't need it wasn't a story line it was ongoing I mean goo was getting into all his adventures and stuff but I mean no episodes mattered their order or anything you can just see them out of order Space Cases was a like a a Star Trek for kids space was red it was awesome and there was like",
      "start": 360.92
    },
    {
      "text": "and stuff but I mean no episodes mattered their order or anything you can just see them out of order Space Cases was a like a a Star Trek for kids space was red it was awesome and there was like a whole story going that had two seasons and um then all of a sudden it just ended there wasn't a a finale there wasn't like a last episode it just ended but they didn't inform any of us about this and this also went over space and this also goes over to Beetleborgs which was a Power Ranger knockoff and oh good lord there was a lot of Power Ranger Knockouts VR Troopers all these other mother VR Troopers but it's like when I was a little kid the more the mar Mystic Knights of Tiranog they looked oh yeah I remember that there was a whole bunch of **** and um so many of those shows didn't end they just kept going and then stopped so I remember Beetleborgs oh I was so into that they had the first season it was dope second season metallics I'm like oh I'm so sold on this and then all of a sudden",
      "start": 400.4
    },
    {
      "text": "just kept going and then stopped so I remember Beetleborgs oh I was so into that they had the first season it was dope second season metallics I'm like oh I'm so sold on this and then all of a sudden waiting for season 3 all the toys released and Toys R Us I bought them all waiting to see what's going to happen and season 3 just never happened wow it's sad I mean that was the way it was back then this just reminded me real quick about uh Christine and I were watching a few months ago when Greg was like on a trip we were watching Yu-Gi-Oh the sh like the the uh the carton but I think better of the two because there's like a Pokemon show or Garbage poage Yu-Gi-Oh that was yeah that was better then they improved on it with digim oh Digimon Digimon that's what I'm thinking of that's the they put the D in front of it cuz it was definitive damn can I finish my story dropping the mic d uh and I thought it was so funny that we've gotten to the point maybe I'm just old again with the",
      "start": 440.64
    },
    {
      "text": "the they put the D in front of it cuz it was definitive damn can I finish my story dropping the mic d uh and I thought it was so funny that we've gotten to the point maybe I'm just old again with the customizable card games because I played some of these games when I was kid Magic and Star Wars and stuff but where the entire cartoon I think I'm thinking of Yu-Gi-Oh was was consisted of them playing a card game in cartoon form and explaining the rules and what the cards did that was the entire C and and and Christine I was just s like and I was just sitting I'm like he's like I'm going to use this card now it means this this and this and I'm like I'm like can't you just play the game no but call you don't understand like so y Yu-Gi-Oh came at the best time because we grew up with Pokemon that hit us when we were young and they had the cards come out and we didn't give a **** about playing that game nobody played the Pokemon Trading Card Game everyone just collected it put it in a",
      "start": 481.48
    },
    {
      "text": "that hit us when we were young and they had the cards come out and we didn't give a **** about playing that game nobody played the Pokemon Trading Card Game everyone just collected it put it in a binder traded them done right sof it was shiny that was cool Yu-Gi-Oh came at the much more pivotal point of puberty right you could understand so I two options I was like I can go talk to girls or I can play card games because now I understand this now I was still too young for Magic Magic that was the older brothers the older brothers played Magic but Yu-Gi-Oh that show came out I'm like oh I can get behind this they're playing the card game that's kind of cool me and my friends were addicted to that **** we spent so much money and we played the **** out of it so much fun you weren't doing that you're furiously masturbated oh my God I I was masturbating so much everything my sheets were just you break them you can drop them your mom comes in she's like there's no tape on these cards",
      "start": 524.24
    },
    {
      "text": "that you're furiously masturbated oh my God I I was masturbating so much everything my sheets were just you break them you can drop them your mom comes in she's like there's no tape on these cards how are they stuck to the wall um all right so all right so the '90s for me I was born in '84 so I I came of cognizance probably around the same time 80 80 I mean I remember things in the late 80s so I remember bits and pieces but I mean like I think kindergarten is like the solidification of like I something's happening day to day and I remember this so life was um NES every day and then later SNES GI Joe I was **** OBS I was obsessed with GI Joes like it's not even it can't even be understated how obsessed with J as I was just asked anyone in my family just I had **** a million of those things um and then it was hockey and whiffle ball and rollerblading and biking around and barbecues and I had an inground pool and so we would swim a lot and it was a lot of travel my parents had",
      "start": 563.76
    },
    {
      "text": "things um and then it was hockey and whiffle ball and rollerblading and biking around and barbecues and I had an inground pool and so we would swim a lot and it was a lot of travel my parents had gotten divorced at that point my mom worked for Delta uh Delta connector and so we used to be able to fly like around in a limited fashion I used to go to Boston laot and Maine and New Hampshire and Vermont and and all that kind of stuff so uh it was the 90 were a lot of those things '90s were also when I became musically cognizant started playing drums got that's when I got a 311 about 20 years ago which is **** unbelievable um when I first got my first 311 record it was 1995 um actually it was 96 so it was 19 years ago the album came out 95 uh MTV I I I have I have like I have you know like I remember for some reason I remember the the the video for Prodigy uh breathe really well and uh when when the Wallflowers down comes the horse or whatever the **** was called that record with the",
      "start": 601.56
    },
    {
      "text": "remember for some reason I remember the the the video for Prodigy uh breathe really well and uh when when the Wallflowers down comes the horse or whatever the **** was called that record with the stars on it with like one headlight and all that stuff I just remember like a lot of these I remember grunge and I don't know I remember mus videos Man I mean that's big part of yeah whatever music videos You Remember in your head that was what it was and I think for me a big part of it started with Thong Song by Cisco because that was like I was a little kid I'm like oh I'm about this and then I remember seeing all the MTV Spring Break My Life Spring break it was so built around Fu they stillo no they do yeah it's different though it's not nearly asch that was like the that was the raunchiest thing you could see and it just took over everyone's life sh was on your house forever yeah two weeks you just left the TV on and you just see like their TRL it was TRL all day it was just countdown",
      "start": 649.12
    },
    {
      "text": "thing you could see and it just took over everyone's life sh was on your house forever yeah two weeks you just left the TV on and you just see like their TRL it was TRL all day it was just countdown after countdown after Countdown the same videos am I thinking the same thing where they would like they would go from TRL to then there would be a beach with hot girls and they' be like let's climb a thing and then bikini people would like Bill would like we're climbing a thing today and then there's these just hot ass girls like on the beach yelling at you we're doing a live episode of The Grind like somebody's going to come out and Cisco is going to come out and perform and all these girls who are just wasted are going to yeah single that all these drunk college girls on spring break are going to come out and there they karaoke I remember the karaoke was a big thing and then they did uh a bunch of stupid contest where it's like all right you have this little plastic bag the winner is",
      "start": 693.4
    },
    {
      "text": "going to come out and there they karaoke I remember the karaoke was a big thing and then they did uh a bunch of stupid contest where it's like all right you have this little plastic bag the winner is whoever fills it with the most body hair and like there was one contest that I'll never forget it was like three girls and this like like two guys and um the girls were kind of like screwed like they just didn't have much like one of them was like kind of Shaving armpits and it was like like a a moment where every was like oh what the **** but then like um it was just like it was it was so graphic and I'll never forget there was like this this bald dude and he was like **** cuz like one of the other guys started going for his hair the bald guy just looks at the camera turns around and just starts like shaving his balls and put it in back and he won yeah he earn he earned it that bald guy went on to be Michael Chicklas what what else is there I mean again like for me there for me there",
      "start": 729.92
    },
    {
      "text": "starts like shaving his balls and put it in back and he won yeah he earn he earned it that bald guy went on to be Michael Chicklas what what else is there I mean again like for me there for me there was a lot I mean for me like because that you guys are talking about how you were all like roughly five or six I was 10 and so I remember like I don't remember any of the shows you just named because I didn't I was too old to watch by then I had moved on to shows like Beavis and Butthead right which was I remember my my um to go back to our prior conversation about like have things more things change the more they always St the same my mom watched me watch Beavis and Butthead and was like this is it Society is dead this is as stupid as it gets this is is as moronic and like sophomoric as it gets and there is no depth to this at all but for me it was a holy **** this is a cartoon that is not a cartoon like this is a cartoon about two **** losers who are just wasting their life and prior to",
      "start": 768.44
    },
    {
      "text": "there is no depth to this at all but for me it was a holy **** this is a cartoon that is not a cartoon like this is a cartoon about two **** losers who are just wasting their life and prior to that it it remember you remember every cartoon before that had been like Hey we're going to save the day we're g don't kill anyone and Beavis was about to Frying **** rats in the in the in the deep fryer and serving and making fun of music videos right and so to me I was like oh my God this is a revolution to me and then that that to me was it's funny CU you talk about sping that that was always just noise to me I waited for like The Real World I loved that oh my God Real World um all those things to me were like I'm like I just I kind of have to watch this this is this is so weird like the show just about a bunch of people that are like living in a house together that was the thing I was remember how like crazy that was like that was still like that was the the birth of reality television",
      "start": 810.52
    },
    {
      "text": "just about a bunch of people that are like living in a house together that was the thing I was remember how like crazy that was like that was still like that was the the birth of reality television that and like Road Rules and all that stuff but yeah when you started watching that **** you're like what is what is this see I've always been one of those people that like once I find something I'm super loyal to it Ault the like dude you guys stop watching that it's not anymore so like when Road rolles happened I was like I and I I can't remember which one was first I think Real World first but I hit Real World first and I was like I'm into Real World Road Rules is some bastard stupid bastardized version of this where the kid they have to do something yeah I hated that I hated the challenges and **** I mean I think in Real World they still had to work they they all had a job where they were like we're going to do a sustainable they had to start doing that they had to start doing that",
      "start": 853.4
    },
    {
      "text": "and **** I mean I think in Real World they still had to work they they all had a job where they were like we're going to do a sustainable they had to start doing that they had to start doing that cuz it got boring with people sitting around watching TV that's a good point um or like fighting over each other was peanut butter um that that was an epic moment no one will ever forget there wasn't like that was like that's when we talk about like how it is now you know last topic and like how fragmented we are and there's no like Rhyme or Reason you're into all this stuff nobody knows what it is Da d da we're big in these different communities or whatever you think back to **** Puck eating Pedro's peanut butter you think back to yeah what I think that's 1994 Real World San Francisco and like you remember when like you know Pedro died right after that series finale or season finale which was crazy and **** Bill Clinton had video play there you know what I mean he said this like epic",
      "start": 887.0
    },
    {
      "text": "you remember when like you know Pedro died right after that series finale or season finale which was crazy and **** Bill Clinton had video play there you know what I mean he said this like epic thing he's like no one in America can say that they don't and I'm paraphrasing that they haven't known somebody living with AIDS thanks to the thanks to him in The Real World and like that was a big moment for people to realize because at the time like AIDS and HIV was still such a like oh that's a gay problem we have to worry about it was surviv and they're monsters and this and like no you see this you're like this guy's totally normal and awesome and Puck's an **** kick him out the house yes kick him out of the house and he got kicked house that's thing about the '90s that's crazy is like just the way things have changed from the like what was acceptable then to now like recently um Big Daddy was on TV and I've watching it Adam Sandler it's all right classic '90s Sandler whatever",
      "start": 920.76
    },
    {
      "text": "like just the way things have changed from the like what was acceptable then to now like recently um Big Daddy was on TV and I've watching it Adam Sandler it's all right classic '90s Sandler whatever watching it and I'm like oh my God so many of the jokes in that there's so many gay jokes in that that I'm just like how did this fly and then I think back I'm like it was funny then like this was like these were jokes these were totally cool that would not make it into something now and that really makes me think about like where are we now in terms of like what jokes cannot be made in movies now like later when we looking down I think a lot of it's just like jokes about like women and stuff like that I think that's going to totally change and like it's just it's really interesting to just think about all of it because the 90s were a different time they really were and it was and you know you had times like just think about all the amazing things that happened everyone always talks about",
      "start": 956.84
    },
    {
      "text": "about all of it because the 90s were a different time they really were and it was and you know you had times like just think about all the amazing things that happened everyone always talks about the 80s and I always say I love the 80s for for various reasons as far as Cinema is concerned but the 90s really there was a lot there's a lot to happen like if I'm not mistaken I'm pretty sure South Park started in the '90s yeah it did 98 and so I remember 97 going on no no I was in high school so yeah I would have been I think it was 90 I want to say it was 98 or 97 it was7 I I went to colleges I was going to to to go like visit college campuses for the first time and my parents and I went on a road trip up to like St Louis bispo to see I I Cate St Louis bispo uh because I was trying to look at everything in California and we were staying in a motel and the like the episode of South Park with the alien anal probes oh first episode it was the first episode and I was like this show I just",
      "start": 996.44
    },
    {
      "text": "at everything in California and we were staying in a motel and the like the episode of South Park with the alien anal probes oh first episode it was the first episode and I was like this show I just just channel surfing and I was like oh this is Kinda Funny it's an animated thing and I was obviously I've always been drawn animated things and I'm like this show is brilliant again another one of those moments where I'm like this is wildly different wildly inappropriate and like this is an animated show about kids in junior high and they're talking about get Elementary School oh that's right elementary school and they're trying to and they're still inary school right talking about getting their asses probed by aliens like that's and like Cartman actually got his ass probed and he's like you guys I'm so you know and so like when you talk about you talk about the number one voice that I probably did in the 90s it was Cartman I think everyone did Cartman remember there was a time in your",
      "start": 1035.92
    },
    {
      "text": "guys I'm so you know and so like when you talk about you talk about the number one voice that I probably did in the 90s it was Cartman I think everyone did Cartman remember there was a time in your life where everything was like oh my God you guys are you kidding me foros or I can't remember is a **** killer Cartman Believe It or Not which is so funny like where are you breaking that out from her best impression is the old man from Family Guy yeah she does the old man from family like the creepy old man from Family Guy yeah she does it you do a good old man too perfect she's just absolutely perfect with that yeah I mean Family Guy is another one but I don't think Family Guy was until the early 2000 no Family Guy was 2000 I think um but yeah I me you had that no it was earlier in that and then remember it got canceled and I remember cuz I remember Family Guy being a big deal that I loved got canceled uh then it came back I canceled again they put out the DVDs while I was in college",
      "start": 1072.16
    },
    {
      "text": "then remember it got cancelled and I remember cuz I remember Family Guy being a big deal that I loved got cancelled uh then it came back I canceled again they put out the DVDs while I was in college and it had already been canceled and everyone bought the DVDs and they were like oh **** and they brought Family Guy back because it got actually kicked off the air Point yeah it got canceled and then I think it came back and got I might be mistaken but I'm pretty sure at one point it got pulled off the air for the there was an episode where um the episode where he was talking about how much he hates New Yorkers or like how much I hate tourists yeah and I think dur at the end of that like ends up getting in a fight with Lois like a physical fight because she was taking karate and like beat the **** out of each other and they're like this is it we got to pull this show really I think I could be wrong correct me in the in the comments below or on the for might be an episode they don't",
      "start": 1105.88
    },
    {
      "text": "the **** out of each other and they're like this is it we got to pull this show really I think I could be wrong correct me in the in the comments below or on the for might be an episode they don't air anymore kind like the Puerto Rican Day Parade episode of Seinfeld that they don't air um part yes I mean Seinfeld's hu I mean that that's what I was going to say was that all right so television was just a huge and pivotal point of that I mean we mentioned before you can't do that on television and Finders Keepers were **** really essential Early N like late 80s early 90s Nickelodeon watching for me Finders Keepers especially I **** love that show and uh Finders Keepers for people that don't know was a was a show where two teams of two kids would be in a house it was like a house set and they would like they would there would be some sort of trivia they'd win and then they'd have to go through the house and like rans sack it to like find certain **** I **** love that do",
      "start": 1141.04
    },
    {
      "text": "set and they would like they would there would be some sort of trivia they'd win and then they'd have to go through the house and like rans sack it to like find certain **** I **** love that do remember I love that show um and when I was and when I was in college Ramon and I used to get **** up and and uh and watch it at night on on Nick gas Nick gas wow which doesn't exist anymore uh and then uh like so welcome back freshman hey dude hey dude you you remember welcome back freshman like that was that's I feel I don't remember it was a Nickelodeon show where like they were just kids in like they were ninth graders or whatever but it was like a comedy and the principal would always talk to them over the loudspeaker and **** like that I that that show was awesome obviously guts and double dare and there was there was Nick arcade Wasing awesome Nick arcade was that thing you saw it and you're like I want that so bad the only thing I wanted more than that was the Toys R Us oh Shing",
      "start": 1177.96
    },
    {
      "text": "dare and there was there was Nick arcade Wasing awesome Nick arcade was that thing you saw it and you're like I want that so bad the only thing I wanted more than that was the Toys R Us oh Shing screen oh **** yeah dude everybody wanted that thing what's funny is you guys are saying these things and I know all of them but I didn't watch any of these shows I think I watched them I had friends that loved Nickelodeon when I would go over to their house they would maybe it's cuz I didn't have cable was it a cable show yeah Nick was C see yeah see I didn't have cable until probably two days ago no I want to say I didn't have cable throughout the entire 80s so Nickelodeon to me was just not a thing I was like I don't understand this and then eventually by the time we got it I was like HBO HBO MTV were my were my thing yeah um I mean the big thing I think as a so if you were a kid from from 85 to 2005 whatever it's in there I think that the biggest things was it's the transition from",
      "start": 1220.76
    },
    {
      "text": "HBO MTV were my were my thing yeah um I mean the big thing I think as a so if you were a kid from from 85 to 2005 whatever it's in there I think that the biggest things was it's the transition from Nickelodeon Disney and Cartoon Network to MTV VH1 whatever then eventually you make it the rise and fall of VH1 the r rise and fall VH1 VH1 Pop of video son awesome oh my God I love the series yeah that was their return I thought right changed me I mean Behind the Music was was like and then cuz here was the the most amazing thing about behind music I swear to God it wasn't every single one of them there was the and then moment yeah big time and then they started doing heroin right it was like the picture with like Spiral and SL like and that was always the beginning of the end and then someone either died redemp now he lives in the beach he walks with his dog right cuz they did the one with Red Hot Chili Peppers and they were like and they were awesome when they did heroin and they stopped",
      "start": 1260.2
    },
    {
      "text": "either died redemp now he lives in the beach he walks with his dog right cuz they did the one with Red Hot Chili Peppers and they were like and they were awesome when they did heroin and they stopped and now they haven't done a really good album since but yeah VH1 was awesome and um that was another another one of those uh instances where you're like what how did I not know that this show was like a thing when when you would see like I saw I love the 80s for the first time and it was like fresh I was like that was only like six seven years ago I remember that hey I remember Star Wars yeah VH1 was VH1 definitely was hitting on all cylinders for a while with with that kind of stuff I I also I mean I can't believe I haven't brought up here but I got to give a big shout out to TGIF of course which was so that was so TGIF for years was just everything that and Snick and Saturday Saturday Nickelodeon are you afraid of that dark and Clarissa and I think roundhouse was one of the shows for a",
      "start": 1310.84
    },
    {
      "text": "which was so that was so TGIF for years was just everything that and Snick and Saturday Saturday Nickelodeon are you afraid of that dark and Clarissa and I think roundhouse was one of the shows for a while I think Alex Mack started on was and I had such a crush on everyone had CR that's why it was so fun to see her like as you gr older uh 10 Things I Hate About You oh right yeah where it's like she like and then like I've always been a little younger than her and now you see her in Mad Men she's she was in Mad um was she oh she she only like 10 epis she was the younger daughter right and 10 I about you she was she was the one that was no wait she was the younger daughter that was The Taming of the shw Remake right with Heath Ledger and and Joseph love it yeah it's a good movie actually yeah is a good movie so I I you know I got to give a shout out to Snick and I got to give a shout out to cuz I I just really like that those were events for me like I would I on Friday nights like after",
      "start": 1351.8
    },
    {
      "text": "is a good movie so I I you know I got to give a shout out to Snick and I got to give a shout out to cuz I I just really like that those were events for me like I would I on Friday nights like after school I'd go play whiffle ball or go play hockey or something and like I'd come home and eight like I'd be home and I'd be ready to go at 8 and the same thing with Snick I'd be ready to go at 8 yeah I remember trying to finish to get ready for Snick yeah it was I just I love I loved Snick like I loved I love are you with FR of the dark was so **** awesome like I loved that show I really really really I thought it was very thought-provoking it was like Twilight Zone for **** kids I me that's basically what it was it was just a horror themed more horror themed Twilight Zone and before you could really understand and watch Twilight Zone and really appreciate it because twilight zone is almost unbeatable it's like that was almost the gateway drug to like to like high storytelling and I was",
      "start": 1409.84
    },
    {
      "text": "really understand and watch Twilight Zone and really appreciate it because twilight zone is almost unbeatable it's like that was almost the gateway drug to like to like high storytelling and I was missing out on this like earlier when I was naming stuff um and when you mentioning Snick I was like what the **** am I missing all that oh rightl for kids oh my God I mean that if anything kind of put me on the path that I'm at today like from an early early state it was that it's like oh I can be a little kid that's funny like that's that's what I want to do and like oh my God that was great and then that turned into Keenan and Cal which classic so good so goddamn good you mentioned you mentioned Twilight or not Twilight excuse me uh uh Twilight Zone to me that was X-Files that was that was one of those where I was that that show hit and I'm like this is cool this is a show that really knows its audience and really understands like fun cool sci-fi horror and how and how to tell that um",
      "start": 1445.96
    },
    {
      "text": "one of those where I was that that show hit and I'm like this is cool this is a show that really knows its audience and really understands like fun cool sci-fi horror and how and how to tell that um I'm going to give a quick shout out to a show that holds a special place in my heart because I never thought I'd like it it was one of those shows that when I was a kid I fought against liking it until one day I was like it was the first instance I remember of thinking **** I like this show that I'm not supposed to like and it was a show called Beverly Hills 90210 all about it all about and I watched way too much of that show to the point where I was like I mean you you have to understand I don't have an older sister it's just me you had no excuse I no excuse that was my excuse I had no I I didn't know Sister it was just on and I was like give it a shot cuz nothing else is on I'm give it a shot and then slowly but surely I had to come to terms with the fact that I in fact liked",
      "start": 1486.64
    },
    {
      "text": "no I I didn't know Sister it was just on and I was like give it a shot cuz nothing else is on I'm give it a shot and then slowly but surely I had to come to terms with the fact that I in fact liked Beverly Hill I got see what's up with the those moments man for me it was Degrassi and One Tree Hill old Degrassi like no no the Next Generation okay which had all the same characters as the parents I love cuz I love the thing I love about the Grassi is that it just never like if you go back it's just been on for **** ever it's been on Canadian High School drama show that was one where Drake came up on Dr came from Next Generation yeah but it was really like I watched on Amazon I don't know if it's still there I started watching the like the original like 85 86 like series and it's dark as **** that's the tagline is it goes there like like in one of the First episodes like the kids both of the kids parents one of the kidss parents just die in like a car accident and he has like a fight",
      "start": 1527.8
    },
    {
      "text": "that's the tagline is it goes there like like in one of the First episodes like the kids both of the kids parents one of the kidss parents just die in like a car accident and he has like a fight with them beforehand and then they go to the movies and they die in a car accident I'm like are you **** serious like so K the Grassi was a uh a uh yeah very popular still popular I think Canadian yeah it it like it kept going kept going kept going it got to like the next next next generation and then they stopped it and now it's like a web show but it's like it's still going so it's basically high school but like every four years they change the cast or what yeah and I mean like the way they have it is like there's this whole Cinematic Universe for it where the the characters from the 80s Show are like the parent and like the principal and all that stuff of it and then it's all the kids but then those kids have little brothers and sisters who had been characters earlier then grow into high",
      "start": 1568.72
    },
    {
      "text": "are like the parent and like the principal and all that stuff of it and then it's all the kids but then those kids have little brothers and sisters who had been characters earlier then grow into high school they have and it just kind of keeps going it's all one Universe it's Jay Bob were in it really yeah they were Kevin Smith directed and wrote uh a three-part episode that was the first time I had ever heard of it yeah it was it was a I mean I I had not been exposed until until I was too old to be watching Degrassi uh but that didn't stop me I want to be clear that didn't stop me um should so yeah I mean I I I I enjoyed like these various like Touchstone shows but I I do unfortunately because we were just talking about with the SnapChat thing you know we were dumb kids or whatever um God I was just like so immersed in teligent it was just it was I was just so so obsessed with that **** and to to the point of the X-Files like the X-Files us to scare the **** out of me like the the",
      "start": 1607.8
    },
    {
      "text": "just like so immersed in teligent it was just it was I was just so so obsessed with that **** and to to the point of the X-Files like the X-Files us to scare the **** out of me like the the intro music oh yeah alone yeah like the intro music that and and Unsolved Mysteries which was like a huge joke in my house like like people like used to blast on SOL Mysteries when I was on to scare the because they knew it would like bother me whatever no one ever knew that the man was living right next door to the child un mystery theme song is it's terrifying it's terrifying and Robert sax just like in some **** Castle he's always in aen yeah he's in a trench coat he's like in a trench just like smoke and like and he's like they should put all Liv under your bed I would love to watch me some goddamn unsolved mystery uh yeah but no I think TV like it's just like we were talking about earlier like you're impressionable and you're young and all this shit's awesome it's like Saved by the",
      "start": 1647.8
    },
    {
      "text": "goddamn Unsolved Mystery uh yeah but no I think TV like it's just like we were talking about earlier like you're impressionable and you're young and all this shit's awesome it's like Saved by the Bell Parker Lewis Can't Lose par can't lose was the jam it's such a I love that **** show man it got canceled way too early it was before it's time another Coming of Age MTV one we didn't bring up undressed I remember unded that was going to that was such a momentous thing of like it's all going to be about they're like kids near our age they're having sex in P yeah exactly panties I used to think that I remember watching on dress me like this is so hot like oh my God like and it wasn't even like you weren't like sitting there at least I wasn't furiously masturbating anything but you're watching it being like this is what because it was all about college and we were in right right we were we were in high school at the time and I was like this is so extraordinary like I I I'm like I can't",
      "start": 1688.64
    },
    {
      "text": "it being like this is what because it was all about college and we were in right right we were we were in high school at the time and I was like this is so extraordinary like I I I'm like I can't wait to go to College college not I want to touch that I can't wait to touch that yeah that was that that's a great examp man Undressed was and and I got to give a shout out to you know speaking on MTV we talked about Beavis and Butthead which was awesome that was the only show my parents wouldn't let me watch ever like right and I used to just go to my friend's house uh but Daria was another really really I really I connected very deeply with man MTV nights MTV closed out every night I remember with some great **** show whether it was real world Road Rules Daria they had like a great **** lineup undress like Andress was on like what three times a week two times a week really late yeah it was on late and it was weird it was weird cuz they'd have like three different story threads for like a month",
      "start": 1728.08
    },
    {
      "text": "like Andress was on like what three times a week two times a week really late yeah it was on late and it was weird it was weird cuz they'd have like three different story threads for like a month and then like sub somebody out and do this and then **** L line was on like when they did the Love T show yeah God damn oh right Jesus yeah so were you guys entirely like does Disney Channel have any resonance with any of you no I mean I remember Disney Channel Growing Up So I'm sorry I remember Kids Incorporated I watched Kids Incorporated that was one I liked but like outside of that no we left that I left that Stratosphere before it became what it became for you yeah Disney Channel to me like what I remember about Disney Channel it existed and people had it but we there was like teers of cable on on Long Island I'm sure it was like that everywhere like we had we had expanded cable but Disney was not included in it like you had to get like another package that that was Cartoon Network so",
      "start": 1767.08
    },
    {
      "text": "on on Long Island I'm sure it was like that everywhere like we had we had expanded cable but Disney was not included in it like you had to get like another package that that was Cartoon Network so I am just I have none of those memories like all these like oh Cartoon Network was the jam for a while dude like Dexter's Lab or Bravo laborator awesome all those were like and I just missed out on all that that was when I to my uncle's house and I like was allowed to you know but see to me those those were great cuz they were the antithesis of the Disney stuff you'd see You'd seen Disney an well like Dexter's Lab was was like you were like this is weird maybe it was just the gendi uh I can never say the guy's last name Taravi the guy that did like Dexter lab and uh and I think he did Powerpuff Girls also yeah huge inspiration of my brother yeah um if you couldn't tell that oh definitely um those were awesome because you'd watch them you like this is kind of like a normal kid show but kind",
      "start": 1802.56
    },
    {
      "text": "Girls also yeah huge inspiration of my brother yeah um if you couldn't tell that oh definitely um those were awesome because you'd watch them you like this is kind of like a normal kid show but kind of Twisted and a little bit like sarcastic just just just to a degree I think you just weren't watching the other stuff cuz it was all the maybe uh I mean maybe cuz at that time I craved those I was like I really want kind of smart animation and then you got to uh what I would think was probably the Pinnacle of Animation in the 90s which was Clone High when you hit Clone High Clone High and then it was the first animated show uh that actually got pulled that one and that's the one that broke my heart that's the one I remembered getting pulled cuz I was so into it and you never knew how to end in year in college Years Later in college I had I had a friend who had the DVDs from Canada and you watch that last episode and it ends on such a horrible Cliffhanger like oh my God it's so weird to",
      "start": 1839.16
    },
    {
      "text": "in year in college Years Later in college I had I had a friend who had the DVDs from Canada and you watch that last episode and it ends on such a horrible Cliffhanger like oh my God it's so weird to me because that is one of the few shows that show and paper boy the game are two things that I'm like how does everybody have the same experience I did with that game or show I would have never expected it to be that much of a hit I thought it was a weird thing that only I watched or only I played but it's like everyone **** did but it's not like it was some huge prime time thing that was promoted all the time but everybody I know loves those because you I mean it a it had a really strong pilot episode and every episode that followed it just hit it just nailed it man it that show was one of the only animated shows that and that in South Park made me guttery laugh out loud where like they're they pretty their their uh impression of John F Kennedy was just I'm like this is so ****",
      "start": 1880.44
    },
    {
      "text": "of the only animated shows that and that in South Park made me guttery laugh out loud where like they're they pretty their their uh impression of John F Kennedy was just I'm like this is so **** hilarious and I can see at the same time and I'm talking I must have like I'm like I'm 16 17 at this point I'm like this I don't know a lot about the world cuz I grew up in nor side of California which very small town our side as they say uh not a bad place just little closed off the rest of the world um but I think that this is offensive to some degree and then Gandhi came out and I was like no no I think that this this portrayal of Gandhi as sort of a nerd who's trying to get laid um instead of like an amazing religious spiritual leader um maybe ConEd as slightly offensive to people and sure **** it was it got pulled and it got pulled fast man it was like I think they only had like aired like six or seven episodes and they hit I guess they did a whole season I think D said did a whole",
      "start": 1917.6
    },
    {
      "text": "**** it was it got pulled and it got pulled fast man it was like I think they only had like aired like six or seven episodes and they hit I guess they did a whole season I think D said did a whole season Canada can R it ran the whole season or the whole season they that **** fast and I was like dude up there yeah man that show H Canada that show was spot-on for me that was one of those where I'm like they **** nailed this show and then it was gone I'm like and that's what sucks and that's a prior conversation where it's like yeah that everything's moving so fast at least because of the internet now like that show would have had a chance of coming back had it gotten canceled it would have immediately gone to Netflix right you know and Netflix would like nope we'll take it you don't want it on network television we'll take it or it would have gone to Hulu or been on the web some someone would have kickstarted it and been like please keep this going and then it would have gone one",
      "start": 1969.12
    },
    {
      "text": "it on network television we'll take it or it would have gone to Hulu or been on the web some someone would have kickstarted it and been like please keep this going and then it would have gone one more season and been terrible and they like okay we're good we don't need it anymore but you know what I mean like that was was so sad about the 90s were so finite the show would just come up and you had no idea if that was the next episode of X-Men or not like I don't know where this is and the timeline of X oh we're in the Age of Apocalypse Now all right dope okay one episode never knew what the **** happened with that you know until I had ended up watching him on Netflix like 10 15 years later you're right Colin we're now going to initiate a crowdfunding thing for us to bring back space cases My Brother and Me crossover we need to know what happened I would love that space space cases was so good har can't believe I can't believe it's taking this long for any of you to bring",
      "start": 2005.88
    },
    {
      "text": "Space Cases My Brother and Me crossover we need to know what happened I would love that Space Cases was so good. How can't believe I can't believe it's taking this long for any of you to bring up Boy Meets World. No, we I mean we don't need to. We I mean I I think we got to good territory we hadn't been we've talked a lot about TJF and Boy Meets World like we we we got out into new territory. I have to give like the last thing I need to say is cuz I brought Disney Channel Disney Channel original movies. I'm I'm just so upset that you guys didn't BR well so at that point BR 98 was when I got Disney Channel and I think 90 spring 98 was when Brink came out was one of the first ones Suzie Q with the Pink Ranger one of the first moments I realized that like women were an important thing in my life. The movie opens up with her going to prom spoilers she dies. Oh, **** it's it's a drunk driving um but wait drunk driving or she kill herself drunk driving. Okay Kevin made she shot Jesus Kevin",
      "start": 2041.4
    },
    {
      "text": "life the movie opens up with her going to prom spoilers she dies. Oh, **** it's it's a drunk driving um but wait drunk driving or she kill herself drunk driving. Okay Kevin made she shot Jesus Kevin it's whole thing but the movie open with her getting dressed for for prom and she's like in her underwear and then like getting into this dress and like that moment changed me like that it was that changed who I was. I remember there was a Disney movie original where it was like Freaky Friday where the Two Sisters switch bodies yeah and one of them was Katherine Heigl and it was her first like thing ever and I remember stopping on that one and watching that and if that was on TV I was watching that as well. Man, I'm blanking on the name of that this doesn't matter. Thank you Rhonda Strong that was a great topic. It was an enjoyable one. Uh we believed in it so much we think it's going to be one of the best performing ones so we sponsored it this is from Squarespace. Squarespace is sponsored this",
      "start": 2080.88
    },
    {
      "text": "a great topic. It was an enjoyable one. Uh we believed in it so much we think it's going to be one of the best performing ones so we sponsored it this is from Squarespace. Squarespace is sponsored this topic as well as Rhonda Strong they're working together in conjunction. Thank you both for your support. Ah Nick yes we use Squarespace. I just used it again yeah what did you use it for now my brother needed a website uh design real quick and he was he was like I'm going to use this other thing and I'm like don't do that because I can help you out real quick and I can do it in like an hour and I did it for him in an hour and he was blown away by how how cool it looks. Oh okay yeah I didn't know that that happened that's every time I I come here I expect you just to tell me about kindafunny.com being built on Squarespace and how no my my brother's doing a fun thing over on on YouTube called Teen Dan Challenge but you can go to Teen Dan challenge.com and you can see that s's been built with",
      "start": 2125.6
    },
    {
      "text": "being built on Squarespace and how no my my brother's doing a fun thing over on on YouTube called Teen Dan Challenge but you can go to Teen Dan challenge.com and you can see that s's been built with Squarespace. I built it in like I think like an hour and a half I probably took a little longer than I needed to because I'm nut about spacing so I'm I'm going to put this little space right here and cool stuff yeah everything's just so it's all it's so easy to use in template a it that you can just go get a Cool website that looks exactly like that and within a few hours have something nice yeah right well if you want to go to Squarespace ladies and gentlemen and get 10% off your first purchase go there and use the offer code Kinda Funny uh you enter you get in there you get 10% off of course Squarespace provides simple powerful and beautiful Squarespace provides simple powerful and beautiful website I'm going to say that they left out tools website tools that look professionally",
      "start": 2162.48
    },
    {
      "text": "course Squarespace provides simple powerful and beautiful Squarespace provides simple powerful and beautiful website I'm going to say that they left out tools website tools that look professionally designed regardless of skill level no coding required not only does Squarespace provide you with intuitive and easy to use tools to create the website with Squarespace also has state-ofthe-art technology powering your site to ensure security and stability we're secure and stable right Nick 100% thank you and you know you can trust in Squarespace for your website needs when millions of people like us and some of the most respected brands in the world like us trusted them too we're respected brand in the world definitely one of the most respected brand huge on everything so everybody go to squarespace.com and under the offer code Kinda Funny get 10% off your first purchase Squarespace build it beautiful as always thank you for your support Squarespace is it build it build it beautiful yes",
      "start": 2194.8
    },
    {
      "text": "and under the offer code Kinda Funny get 10% off your first purchase Squarespace build it beautiful as always thank you for your support Squarespace is it build it build it beautiful yes it is it's build it beautiful build it build it beautiful build it beautiful build it comma beautiful Build It You Beautiful Bastard ladies and gentlemen this has been another episode of the GameOverGreggy Show if you didn't know each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com Kinda Funny where you can toss us a few bucks and get every episode early have you got no bucks to toss no big deal head over to youtube.com slind of funny where we post everything topic by topic day by day until we post the entire show for free on Friday as an MP3 in video gentlemen it's been a pleasure Nick you're always on that **** phone I just had a good ide for top oh like you",
      "start": 2232.32
    },
    {
      "text": "topic day by day until we post the entire show for free on Friday as an MP3 in video gentlemen it's been a pleasure Nick you're always on that **** phone I just had a good ide for top oh like you should talk you're on your phone for **** two topics snap away your phone during that time I'm getting a bunch of text messages here no no no no I wasn't even I wasn't even making fun of that one I've seen your family conversation that's happening when you're looking at the Snapchat information I don't know if you I don't know if you notic this Con and I had an entire conversation with one look did you guys see that earlier no where I looked at him because the phone was going off and I gave him the that buzzing is annoying me and Colin looked back at me and said I realize that's annoying you and now that I know it's annoying you I'm going to let it keep going that whole thing happened and I was like touche she like that's how we do it the Disney Channel movie was called Wish Upon a Star",
      "start": 2272.84
    },
    {
      "text": "and now that I know it's annoying you I'm going to let it keep going that whole thing happened and I was like touche she like that's how we do it the Disney Channel movie was called Wish Upon a Star **** yes that's my boy until next time it's been our pleasure to serve you",
      "start": 2309.76
    }
  ]
}
