{
    "id": 28,
    "video_id": "1tb-x2Zovmo",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Halloween Oreo Cookies Review: Oreo Oration",
    "description": "Just in time for the big day, Oreo Oration reviews the Halloween Oreo.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review. \n\nCheck out the Oreo Oration playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&feature=plcp\n\nLeave your review of today's cookie as a video response.\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nBreaking news audio courtesy of IGN's Podcast Beyond: http://www.ign.com/articles/2012/10/30/podcast-beyond-divided-over-assassins-creed\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1351663913,
    "duration": 354,
    "transcript_chunks": [
        {
            "text": "[ Music] what's up everybody? Welcome to Oreo Oration. I'm Greg Miller, and while you were out living a life and carving those jack-o'-lanterns , the fine people at Oreo were making endless variations to milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, then subscribe to us here on the YouTubes. Today we are reviewing Halloween Ore os. That's right, just in time for the big day. You got, you got, you got the witch over here, another W. I guess it's all witches, but you get it. It's Halloween Oreos. Uh, they make a very bold claim down here. They say orange color cream, same great taste. They say it's the same taste as an Oreo, but as you will find out as you watch Oreo Orations, not every colored cream holds the cookies well. Let's find out what happens with Halloween Oreos. Of course, every Oreo Oration begins with the patented first look. You peel through, whoa, look at that. You peel through and then",
            "start": 0.55
        },
        {
            "text": "holds the cookies well. Let's find out what happens with Halloween Oreos. Of course, every Oreo Oration begins with the patented first look. You peel through, whoa, look at that. You peel through and then what do we got here? We got some cookies in there. Got one, he's, he's, he's hanging a little bit low . I don't like that, but that's the way I was holding it. Oh, we got some broken ones here though. We, we're not all the way up to the top either. It feels like were we shorted on Oreo? I can't believe it. Hold on, hold on, there we go. Oh yeah, I got some smash ones at top. Those were already smashed. I guess we're not shorted. Give us some of the top. Some of them were crunched. You got a crunch down here. Not the best presentation we've seen, but it's Halloween. You're supposed to be a little scared, right? I don't, I don't know. Anyways, uh, let's get the smell test going on here, the bouquet. They smell like regular Oreos. They don't, they're not supposed to, you know, let's see. They're supposed to taste like real Oreos.",
            "start": 45.0
        },
        {
            "text": "don't know. Anyways, uh, let's get the smell test going on here, the bouquet. They smell like regular Oreos. They don't, they're not supposed to, you know, let's see . They're supposed to taste like real Oreos too. Let's see that. H yeah, I guess it tastes the same. The thing I'm noticing is that they're just Halloween Oreos. They're supposed to be normal Halloween. That's a lot of frosting for a normal Oreo . That doesn't seem like the right amount of cream for just a regular old Oreo. Um, it's given off, it's thrown off that delicate balance we talk so much about Oreos, right? You got the two cookies, the little bit of white cream, a little bit too much cream , you're in the double stuff range even though it doesn't say anything about being Double Stuffed. A little too sweet, not too bad though, very sweet aftertaste though. Um, let's see how it pairs with milk. Maybe it'll pair like the real Oreo does. One, two , three. See, here's that weird thing, ladies and gentlemen, is it just a mind game? It's like when you give",
            "start": 89.96
        },
        {
            "text": "though. Um, let's see how it pairs with milk. Maybe it'll pair like the real Oreo does. One, two, three. See, here's that weird thing, ladies and gentlemen, is it just a mind game? It's like when you give somebody pills and you tell them these pills do something, then they say, oh man, these pills did exactly what you said. And then they say, no, those were placebo pills. They didn't screw with your head at all. They were just in your mind. Is the orange frosting just throwing me off? Off it looks like there's too much frosting. It feels a bit too sweet and then the combo with the milk, I'm not getting the normal, you know, not I'm not getting that normal chocolatey milky feel from it. I'm not getting the vibe you get from a regular Oreo in there. I'm getting something different, very sweet, too sweet for my taste, but not like to a detriment. H interesting, interesting. Let's see about twisting. Let's see , let's see, go by twisting. All right, we're going to give it our patented two out of three, a perfect twist again.",
            "start": 142.48
        },
        {
            "text": "but not like to a detriment. H interesting, interesting. Let's see about twisting. Let's see, let's see, go by twisting. All right, we're going to give it our patented two out of three, a perfect twist again. Something we see a lot with these, uh, weird colors, these weird flavors. If few weird another perfect twist, something about them doesn't hold as well, which is always so funky, but it separates one , it makes a double stuffed, no problem, but again, that looks like a quadruple stuff. Am I right, ladies and gentlemen? Come on, Oreo, who are you trying to kid saying these are regular old Oreos? So now it's time for the review. I'm not, I do not think they are regular old Oreos. These are not the basic Oreos even though they are trying to claim to you on the box. Funny you should say that, Greg. That's right, in another Oreo Oration, first we've paused that video to show you. Yeah, indeed, this is not , this is, this is a regular old Oreo right here and this is one of them Halloween Oreos, clearly a double stuff variety.",
            "start": 196.96
        },
        {
            "text": "Oreo Oration, first we've paused that video to show you. Yeah, indeed, this is not, this is, this is a regular old Oreo right here and this is one of them Halloween Oreos, clearly a double stuff variety. Yeah, I mean, you can't look, look at how much more cream is in that. No wonder it doesn't taste right. No wonder tell me the same great taste Oreo, the same great taste, Nabisco. This is what Oreo or , this is what Oreo Oration is here for, ladies and gentlemen. We're not going to let you go to the store and get tricked by big cookie business into telling you what is and isn't an Oreo cookie. Thank you, back to the regular show. I feel like there's too much frosting going on. They're too sweet, but they're Halloween. Kids want candy on Halloween. I oh man, I just keep going down further and further in my head on what to give these. I got to take another bite. This is unprecedented here on Oreo Oration. I'm going to go 7.5. They're fine, they're good. Um, they're sweet, they're like a double stuffed, but still a little",
            "start": 240.44
        },
        {
            "text": "what to give these. I got to take another bite. This is unprecedented here on Oreo Oration. I'm going to go 7.5. They're fine, they're good. Um, they're sweet, they're like a double stuffed, but still a little sweeter than what I'm used to, not as bad as some of the golden cookies. Nothing much you can do about it. 7.5 for Halloween Oreos. If you're excited for Halloween, go get them. You'll drive the kids bonkers. That's the way the cookie crumbles for Halloween Oreos. But what do you think? Leave your review as a video response below, then like the video and subscribe to my channel. Now here's a big question, are there Oreos you haven't seen yet on this show? If so, leave those Oreos in the comments below along with where I can get them so I can continue to make the show. Then share the video with your friends, subscribe to us, yada yada yada. I'll be back every Wednesday and Friday until I run out of cookies to review, but until then, keep on dunking.",
            "start": 288.04
        }
    ]
}