{
    "id": 169,
    "video_id": "PIBl23LhlVE",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "White Fudge Oreo Cookie Review - Oreo Oration",
    "description": "Think nothing can go wrong when you dunk Oreos in fudge? Think again.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1386252002,
    "duration": 300,
    "transcript_chunks": [
        {
            "text": "[ Music] [ Applause] [Music] What's up, everybody? Welcome to Oreo Oration. I'm Greg, and while you are out there trying to decide what tripod to buy, the fine people at Oreo were making endless variations to Milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to my channel, and then please share it with your friends. Today , we are reviewing white fudge covered Oreos. Good Lord, another popular favorite in the YouTube comments. You guys are always telling me that I need to be on top of these. They're limited edition. Why aren't they being reviewed? Apparently on the back, look at that, you really up your Valentine's Day. You could have just bought these and put strawberries on them and be done with it, huh? Stupid idiot with the flowers. Uh, every Oreo Oration begins with the patented first look. This is the first box I think we've ever had to tear through on the first look. Let's see what we get.",
            "start": 0.57
        },
        {
            "text": "with it, huh? Stupid idiot with the flowers. Uh, every Oreo Oration begins with the patented first look. This is the first box I think we've ever had to tear through on the first look. Let's see what we get here. Look at that, super intact. I mean, they got the crazy ass has condom shield on them, so they're all right. You look around, it's all white. You got some gaps in the back there, but these are for sure white fledged Oreos. Not getting that many. I can't complain. They're different. Something's happening here. TR this away. All right. Oh, wow. Yeah, they got a bouquet to them of white fudge, not the traditional Oreo taste, or I'm sorry, the smell, obviously. Um, let's see how they taste though in the next part of the Oreo Oration. H going no right now. First off, let's see what I'm seeing from my perspective. Where's all the cream? What kind of knockoff Oreos are these? You you skimping Nabisco sh some Hydro in there? I don't think so. See if they're all like this. Yeah, they got big old gaps there. Not I guess not well no.",
            "start": 43.8
        },
        {
            "text": "the cream? What kind of knockoff Oreos are these? You you skimping Nabisco sh some Hydro in there? I don't think so. See if they're all like this. Yeah, they got big old gaps there. Not I guess not well no. That's a big old gaps. No, these are not doing well on First Look taste. None of that. How do they pair with milk? Oh, no, I'm not having not not having this. I mean, obviously not be stupid, right? If I dunked it, not broken, nothing's going to happen. We'll do it this way. One, two, three . I don't I don't think on this show I have ever not wanted to bite into an or more. The Oreo is gone. There's no Oreo here. It's just they say white fudge, right? That can't be right because like fudge is like the soft little things, but it's like white chocolate, right? But it doesn't even taste like white chocolate. What the hell is this? Al and the cats back there eating. I was I was like, no, not not a fan. Uh, again, we're all adults here, right? I can't twist it. Try as I might with Superman like, no, you can't. Now I got it all over my",
            "start": 105.96
        },
        {
            "text": "this Al and the cats back there eating. I was I was like, no, not not a fan. Uh, again, we're all adults here, right? I can't twist it . Try as I might with Superman like, no, you can't. Now I got it all over my hands too. Okay, can we just end this? Final score for the white fudge covered Oreo, three. They are bad. I do not recommend this. I I mean, if you are a huge fan, it's that's the thing, right? Like, ladies and gentlemen, it's not me saying, oh, I don't like white chocolate. That's why I you know, people like that. That's fine. You understand that these don't it doesn't even taste like white chocolate. I don't no, it's like a plasticky weird. That's why it's probably not that's why it's white fudge, right? Because I guess fudge could probably be anything. If they said chocolate, they'd have to prove that it's actually chocolate and I ain't seeing no chocolate on this thing. No 3.0. That's the way the cookie crumbles for white fudge covered Oreos. Do not buy them. Don't listen to anybody on the internet who says you",
            "start": 178.4
        },
        {
            "text": "chocolate and I ain't seeing no chocolate on this thing. No 3.0. That's the way the cookie crumbles for white fudge covered Oreos. Do not buy them. Don't listen to anybody on the internet who says you should if they if you delete them from your Twitter feed if that's what happens. Um, but I mean, what do you think? Maybe I'm wrong. Maybe I'm you know, the only sane person left in this world. I got to get this taste out my mou. I'm sorry. Leave your video response as a video review in the comments below. Film yourself with the iPhone. Hey, Greg, I got the white fudge and I don't think they're all that bad. You're crazy. Let me know what you think of them down there. Uh, then like the video, subscribe, share it with your friends, then please call out Oreos that I'm missing in the comments so I can continue the show . We're getting close. We're running out of Oreos to review. So if I'm missing something, you got to let me know. Otherwise, I'm going to go back to my home planet where I'm really needed. Uh, until the next",
            "start": 226.8
        },
        {
            "text": "we're getting close. We're running out of Oreos to review. So if I'm missing something, you got to let me know. Otherwise, I'm going to go back to my home planet where I'm really needed. Uh, until the next Oreo comes around, I will be reviewing them every Wednesday and Friday here on YouTube. Uh, please until then keep on [Music] [Applause] dunking. No, thank you. [Music]",
            "start": 267.32
        }
    ]
}