{
  "id": 181,
  "video_id": "spA3OhI_8H0",
  "show_name": "Announcements",
  "hosts": ["Greg Miller"],
  "title": "We Have T-Shirts! - The GameOverGreggy Store",
  "description": "You asked for it, so we made GameOverGreggy T-shirts. Please buy them. WE DID IT FOR YOU! http:www.districtlines.com/gameovergreggy\n\nSUBSCRIBE/LIKE/SHARE\n\nEach and every day, GameOverGreggy.com uploads a nerdy conversation for your amusement. Some days Greg even reviews Oreos. Here's the rundown...\n\nMONDAY: The GameOverGreggy Show\nFour friends each bring a topic to the table and discuss it in podcast form!\nGameOverGreggy Show Playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVuElrLteyTjRtdQRK-eUkI9\n\nTUESDAY/THURSDAY: A Conversation with Colin\nReaders submit topics, Greg writes them on notecards, and then Colin talks about the random topic. Colin usually says something crazy.\nACWC Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E\n\nWEDNESDAY/FRIDAY: Gregway\nWhat's on Greg's mind? Will he answer your question? Find out.\nGregway Playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVuaj1jfPjoxFWh7vfK29UOe\n\nWHENEVER WE WANT: Oreo Oration\nA fat man reviews Oreo Cookies. Seriously.\nOreo Oration Playlist: http://www.youtube.com/playlist?list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
  "published_at": 1387475817,
  "duration": 121,
  "transcript_chunks": [
    {
      "text": "As I live and breathe. It's me, Greg Miller. The internet's Greg Miller. Gameoverggy.com. And guess what everybody? Thanks to your awesome support over on our YouTube channel, youtube.com/gameovergy, we have started a merch store finally. Nick clap. Thank you everybody . Yeah, a merch store. You can go over there and you can buy some t-shirts. Right now we have two up. We will be adding more once we sell enough of the two we have to justify making more. What shirts can you buy over at districtlines.com/gameoverggy? Well, of course, this GameOverGreggy shirt. You might have seen me wearing it for a while, unlike the Epic Meal Times and stuff. Well, here it is. You go over to districtlines.com/gameoverggy. You can get yourself one. What other shirts do we have? Well, a shirt for Colin. Okay, so we don't have the Colin shirt yet. They're doing this pre-sale thing where we have to sell a certain amount of numbers. So, I don't have a Colin shirt to put on yet cuz they haven't printed them yet.",
      "start": 0.08
    },
    {
      "text": "we don't have the Colin shirt yet. They're doing this pre-sale thing where we have to sell a certain amount of numbers. So, I don't have a Colin shirt to put on yet cuz they haven't printed them yet. But, I'm sure they'll look as cool as the GameOverGreggy shirt. In fact, I think we can we'll digitally we'll digitally put Oh my god, look. I'm in the Colin shirt. Colin shirt is cool. Colin for president 20XX. See, it's a it's a Mega Man reference. Did you know in Japan they called him Rockman? Buy this shirt on districtlines.com/gameoverggy. So yeah, two great shirts. Thank you so much for all your support up until this point. Even if you don't buy a shirt, thank you so much for caring about the YouTube videos . Thank you so much for following us on Twitter. Thank you so much for supporting us in our day jobs. You mean the world to us. But if you want to go a little bit further and show all your friends at PAX East, PAX Prime, whatever other crazy at Rooster Teeth, go show those idiots",
      "start": 42.4
    },
    {
      "text": "us in our day jobs. You mean the world to us. But if you want to go a little bit further and show all your friends at PAX East, PAX Prime, whatever other crazy at Rooster Teeth, go show those idiots at the expo what it's all about, huh? If you want to go show them something cool, go to districtlines.com/gameovergreggy. Until next time, have a Greg way down at the Greg Bay eating your Greg. I almost said Greg Gay. That doesn't even make sense. Why would you eat that? And I'm not gay. Not that there's anything wrong with that, but it's not a real thing. Ben Gay. That's what I was thinking of. Damn. Can we sell Greg Gay the Ben like we repackaged the Ben Gay and stuff? No. Okay.",
      "start": 78.96
    }
  ]
}
