{
    "id": 167,
    "video_id": "UevWoFbd_TI",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Gingerbread Oreo Cookie Review - Oreo Oration",
    "description": "Need more holiday cheer? Let's see if the Gingerbead Oreo is would the calories.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1386079203,
    "duration": 302,
    "transcript_chunks": [
        {
            "text": "[ Music] [ Applause] [Music] What's up, everybody? Welcome to Oreo Oration. I'm Greg, and while you were out trying to figure out what the Vine is, a whole bunch of people over at Oreo are making endless variations to Milk's Favorite Cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to my channel, and please share Oreo Oration with your friends. Means a lot to me. Today, we are reviewing, drum roll please, Gingerbread Oreos, limited edition. There's been a lot of these limited editions. This is how Oreo holds it over your head. It's like they got the Disney Vault that they open up, let a couple flavors out, and they slam it shut on you. Gingerbread Oreos still available for some people out there. Uh, the gingerbread, of course, the cream, not the cookie. They're not making the cookie taste like it. Uh, let's start the oration as we always do with the first look. See we got going here. They don't at first look at",
            "start": 0.57
        },
        {
            "text": "of course, the cream, not the cookie. They're not making the cookie taste like it. Uh, let's start the oration as we always do with the first look. See we got going here. They don't at first look at first glance, you're not super impressed, right? Like, wow, a whole bunch of brown stuff. They smell like, they smell like gingerbread . They, right, py. All right, I like the smell. I do like the good smell in gingerbread, clearly, so does my dog. Let's get a good look at one. Got that. See what I mean? There's no, not much difference there in how they look from cookie to cream to cookie. I personally don't think they're that visually interesting, but of course, Oreos, it's all about the taste. Let's see what we got here. Hold on. I like where this is going. Okay, no, it's good. Okay, you're, you're too excited. Uh, the shortbread and the gingerbread, they work really well together. The gingerbread is not super sweet. It's that gingerbread taste. Get that Starbucks molata, you tell them put some gingerbread in there, tastes like that.",
            "start": 42.6
        },
        {
            "text": "the gingerbread, they work really well together. The gingerbread is not super sweet. It's that gingerbread taste. Get that Starbucks molata, you tell them put some gingerbread in there, tastes like that. It's not super sweet. I like it and it's, I'm gonna do another one. Yeah, that's how much I like it. I think like it takes a second. It's a slow rolling to get to the holiday, especially like, oh man, it's just a, it's just a normal shortbread Oreo. Oh wait, gingerbread's inside. Yay. H yeah, I like it. I like what we're doing here. I like what you're doing. Let's see how they pair with milk. You make that Roy moment. One, two, three. Mhm. It's, it's subduing the gingerbread taste, letting the short breads be. I like them without milk, but I can't hold it against it. Still very, very good. Oh, the twist. Let's see how the twist work out for these guys. One, perfect. Two, another great one. I tell, Oreos figured it out finally. They got the cream consistencies down in these crazy ass Oreos so that you can clearly make double stuffs.",
            "start": 109.88
        },
        {
            "text": "work out for these guys. One, perfect. Two, another great one. I tell, Oreos figured it out finally. They got the cream consistencies down in these crazy ass Oreos so that you can clearly make double stuffs that look awesome. Even though once again, I believe this is a quadruple stuff. Yeah, that's, that's too much. All these, all these different little flavored ones come in like the double stuff variety, but they don't make a big deal about it. Good for them. Maybe not they're line of consumers. If you're on the single stuff diet and you were to look at this box, you think you'd be okay. Don't be fooled, sir. Don't be fooled. Final score for Gingerbread Oreos, huh? I mean, I think it's a nine. I think they're great. If you like gingerbread, you're going to love these guys. They're great. They taste really good. They're amazing. You bite into you're like, it's a short break. Whoa, gingerbread catch you off guard. Your kids will like them. It's like the holidays whenever you have them again. If you figure they made",
            "start": 187.8
        },
        {
            "text": "they're amazing. You bite into you're like, it's a short break. Whoa, gingerbread catch you off guard. Your kids will like them. It's like the holidays whenever you have them again. If you figure they made these things for the Christmas time, right? What's the expiration date on them? Expiration date again, April. So you can buy them in bulk and just have them around for by the time they go bad, you could just go buy the new ones for the next year of Christmas. So that's good. What do you think of Gingerbread Oreos? I'm sure you've had them before. Take out your iPhone, film yourself for a second, leave your video review as a video response below. Then please, ladies and gentlemen, like this video, subscribe to my channel, share it with your friends. I kept, I was trying to say share way early, so I kept starting things with SH that don't really belong that way. Um, what Oreos am I missing? Let me know in the comments below. I'm sure there are some still. Tell me what the Oreo is, where you saw it , what state you're",
            "start": 233.24
        },
        {
            "text": "things with SH that don't really belong that way. Um, what Oreos am I missing? Let me know in the comments below. I'm sure there are some still. Tell me what the Oreo is, where you saw it, what state you're in, country you're in, so I can figure out how to get it. Then check back every Wednesday and Friday for a new review and until then, keep on dunking. [Music] [Applause] [Music] [Applause] O",
            "start": 274.16
        }
    ]
}