{
    "id": 89,
    "video_id": "YJGOr9AAkqQ",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller"
    ],
    "title": "How to Eat a Buffalo Wing in One Bite",
    "description": "Think wings are messy? Let Greg show you how to take one down in one bite in just a few seconds.\n\nSUBSCRIBE/LIKE/SHARE\n\nFollow Greg on Twitter - http://www.twitter.com/gameovergreggy\n\nGet other Greg Vlogs here: http://www.youtube.com/playlist?list=PLOlEpGVXWUVuaj1jfPjoxFWh7vfK29UOe\n\nCatch stuff like this via the #AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1374584412,
    "duration": 103,
    "transcript_chunks": [
        {
            "text": "what's up everybody it's me Greg Miller from the internet, A Conversation With Colin, IGN, and stuff, a whole bunch of internet things you probably see me but a lot of people know me for being the biggest chicken wing enthusiast. They know, uh, I lead Team Bone very proudly. But here's the thing, a lot of people think I eat chicken wings a weird way. They say, you know, eat chicken wings, get your hands all dirty. I can show you how to eat a chicken wing really quickly, at least these little guys, right? The part that you would think are not the chicken wing or are the chicken wing or however you want to do it. Now that one's actually broken at the top so we're going to do it. But what you want to do is get a real good grasp right there at the bottom, right? Now here it is. So I'm trying to show you in slow motion how it would go but you grab down there, you get both pieces of bones in your hand and you go like that just down to bones like a cat in a cartoon eating the fish, you know? I, no, that's it. So",
            "start": 1.52
        },
        {
            "text": "motion how it would go but you grab down there, you get both pieces of bones in your hand and you go like that just down to bones like a cat in a cartoon eating the fish, you know? I, no, that's it. So good. Sorry. Now then you got other stuff there where you're pinching, you do the double pull, just got two bones, that's all it is. That's all the chicken wing is. So in regular motion it would look like this. A lot of people they would probably leave that meat there but not Greg Miller. Greg Miller knows one day chickens are going to be extinct so I better love what I'm up to now. So there you go. It's how Greg Miller eats that chicken wings. How do you eat chicken wings? Let me know in the comments below, leave a video response, watch all the crap I put on the internet. Thanks. You got to get into this is when you don't want to go touching your eyeballs, your butthole. You don't want to get sick. You don't want to get your butthole sick with some chicken juice.",
            "start": 32.64
        }
    ]
}