{
    "id": 2004,
    "video_id": "1Tt4MCyUVxc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Many 5-Year-Olds Could You Fight? - The GameOverGreggy Show Ep. 142 (Pt. 2)",
    "description": "If you had to, how many could you take? \n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1472050036,
    "duration": 785,
    "transcript_chunks": [
        {
            "text": "kinda funny studios is brought to you by\ndeus ex mankind divided now available on pc ps4 and xbox one this new critically\nacclaimed entry to the deus ex universe once again has players taking on the\nrole of Adam Jensen with an all-new Arsenal of state-of-the-art weapons and\naugmentations. see what all the excitement is about a deus ex . com Greg: Tim, what’s your topic?\nTim: That is an excellent story - I think that is your #1 story. G: Thank you very much\nT: My topic is kind of similar — uh — if you wanna —\nG: Oh good, what drink are you making? — to put it that way — No similar to the story you just told. So me and Colin and Kevin were walking — where were we, getting some Ramen? Colin: Yes\nT: We were probably getting some sweet, nasty, Ramen. A couple of days we were walking, and we see these — these tiny little girls — like 5 year olds probably, right?",
            "start": 0.0
        },
        {
            "text": "T: We were probably getting some sweet, nasty, Ramen. A couple of days we were walking, and we see these — these tiny little girls — like 5 year olds probably, right?\nC: Yup. T: Family of -- I don’t know -- 100. There were so many of them. I don’t know why there were so many of them. It sounded like there were even more than there was — but there was a lot. Probably 6 — 6 of ‘em C: Right\nThey’re all running around, and of course the first thought we all have is ‘How many could we fight?’ G: Hmmm…..\nT: If these little shits decided to attack us right now G: Yeah\nC: Uh huh\nT: How many could we hold off? — and we had an interesting conversation. We’re talking 5 year olds\nC: — 5 year olds — so T: A little taller than that\nC: So… G: Oh shit, from the floor!?\nC: Yeah — yeah, definitely — 5?\nT: Yeah, about that  — K?",
            "start": 46.24
        },
        {
            "text": "C: — 5 year olds — so T: A little taller than that\nC: So… G: Oh shit, from the floor!?\nC: Yeah — yeah, definitely — 5?\nT: Yeah, about that  — K?\nG: OK T: My question is: 1 on 1 — how many of those little shits — could we take on and survive and get out of — but ALSO as a group. All of us plus Kevin. We’re there — getting attacked by these little — this swarm of\nNick: This hell unit N: This reminds me of my most popular topic on [the] Game Over Greggy Show G: Oh, you mean the 200,000 view episode of the Game Over Greggy Show?\nN: Which —\nT: REALLY? G: No…\nN: — i dunno\nT: No, that doesn’t sound right C: I don’t think that ever happened\nN: It reminds me of my feral cat topic C: It was ‘you want a medium sized mountain lion or’ — what was it — ‘100? 500 feral cats?’\nN: No, just a sea of feral cats\nG: Oh, ok N: You can’t see the ground. You said 1 on 1, but you meant 1 on X C: What you’re trying say is solo N: Solo. Solo, I feel like I could take on 15 of these little fuckers",
            "start": 76.0
        },
        {
            "text": "G: Oh, ok N: You can’t see the ground. You said 1 on 1, but you meant 1 on X C: What you’re trying say is solo N: Solo. Solo, I feel like I could take on 15 of these little fuckers\nT: FIFTEEN!? N: 100% right, because the first one’s gonna come at you, and he’s gonna come at you hard — N: You gotta make an example out of him\nG: Do they know what’s happening? They’ve been. instructed they have to kill me? — or am I just going into how many of them are there T: You really went far with the kill — but like — fuck it! G: When I fight I’m not there to knock you out, I’m there to paralyze you or end your life T: You are gonna snap that dude’s neck G: 100%\nT: You’re not just gonna grab it G: That’s how I go down — the infamous scene in Batman V. Superman where he breaks the guy’s neck — gets up and they beat him — and then 1 five year old with heat vision comes in and cuts me in half T: Yeah, yeah, yeah — I can imagine that",
            "start": 122.68
        },
        {
            "text": "N: What I was thinking was — you take one of them right off the bat — you remember that last guy he punches in that one scene of Batman vs. Superman G: Yeah\nT: Where he basically punches his head through the ground. That’s what I’d do to the first fucker that came up to me",
            "start": 168.99
        },
        {
            "text": "G: Oh, no way T: We talked about — we talked about the first move we’re doing — grabbing one of them, and trying to swing him at the other one’s C: Yeah, exactly, like — to me it’s all about 2 things: vigor, and dexterity. As long as you can keep them at bay, and you have the dexterity to kind of move around kinda circle around, you could probably go for a while — you could probably go for minutes and minutes at a time. You’d probably do — you know — go through dozens of enemy 5 year olds at that point but the second I feel like one latches onto you or a couple get you— it’s like Kramer in the Karate Dojo in Seinfeld. Like — you gotta keep them at bay. I was saying what an interesting move would be the — Zangief spinning arm move They’re too short is what I thought. But could you also not just kick one of them in the sternum, and then just send him flying into another one T: Give him the sweet chin music",
            "start": 177.31
        },
        {
            "text": "C: In other words you need to buy yourself a few seconds every now and then to breathe G: No, this is definitely like the feral cat argument where my first move — well my first move if I get to just go — I’m power bombing one, just for the hell of it — to start the whole thing — I’m screaming ‘POWERBOMB’ — but then, yeah, I’m just sprinting through them for a little bit T: You’re just running through them\nG: Yeah, yeah\nC: I feel like that’s a bad idea though\nG: I know that they might get me but — C: You’re also losing your energy doing that. You have to conserve your energy\nG: They’re losing something too C: Is this hoard mode",
            "start": 239.52
        },
        {
            "text": "G: I know that they might get me but — C: You’re also losing your energy doing that. You have to conserve your energy\nG: They’re losing something too C: Is this hoard mode\nT: No they’re not. They’re 5 year old Greg N: To sort of evolve your concept — what if you picked one of them up by the feet, and then swung him around, in a helicopter — C: First of all we had talked about it, but I’m afraid of that might also use a lot of energy T: That’s like using a full super meter in Street Fighter IV, you know what I mean. You’re already out of that, you gotta gain that back up, but that’s not how real life works. I don’t think that’s gonna work out too well C: You’re gonna find yourself in hand to hand combat — take some punches. Do some uppercuts —\nN: Is there — G: Uppercuts are gonna be tough because you gotta go low",
            "start": 259.2
        },
        {
            "text": "N: Is there — G: Uppercuts are gonna be tough because you gotta go low\nC: Think how low Ken gets when he — G: Sure but I feel you’re getting low, which is when they latch — they jump on your back — the thing when they got their arms around you T: See, but I feel like that’s the difference between the little children and the cats in which the cats are animals, right. The children — they have minds — (I think) — They know it hurts when you get hit in the balls. They’re going straight for the balls, they’re also right there. Alright, here’s the thing, I think about little kids as — a general idea — when you’re with them, they always seem to fall in the weirdest ways. Just not make any sense when it comes to gravity C: They have weird rag doll physics",
            "start": 297.04
        },
        {
            "text": "T: They do, they do. So, a lot of time I’ve been with — not 5 year olds — usually younger than 5 — where they’re jumping around, and they always fall, and they always hit me in the dick. They’re not trying to, they just always end up there — So I’m worried if they’re trying to get there — even a little kid punch to the dick is gonna really hurt. You know, the cats — they don’t know to get there. Kids no to go there. And all they need is that one little hand. G: How many do you think you can get through?\nT: I dunno. I mean I could definitely take one",
            "start": 336.11
        },
        {
            "text": "T: I dunno. I mean I could definitely take one\nG: Yeah (Pshh) T: Well let’s work backwards, right. I can do 1, could do 2, 3 — yeah, 4 — questionable, 5? I don’t know. 5 might be the number where — G: See, I don’t think you have the killer instinct, where I jump to killing. ‘Oh, I didn’t think of that’, you gotta have that in you. ‘Cause if you’re in there and you’re ‘eh’, I’m going in there and like ‘pow!’. I’m grabbing them by the head and I’m like ‘you’re head still soft?’ (Greg pretends he’s crushing a kids head in) ‘AHHHHHH’. That will scare the other one’s too. C: That’s a good point. What I’m trying to say is, the feral cats are animals, they don’t usually have self awareness — C: You can’t really scare them by doing something to another cat",
            "start": 364.4
        },
        {
            "text": "G: Yeah, totally C: But should the first child come at you, and you literally rips its head off like a fucking top, do the others — do the others get scared G: They’re running — I assume they’re in some room and are clawing at the walls — I’m gonna make the voice — ‘You don’t get it… I’m not trapped in here with you. YOU’RE TRAPPED IN HERE WITH ME’ *evil laugh* I’ll do that laugh you guys think’s scary. There’ll be a few of these guys that think they’re big dick dudley and can stop me, but I’m going right for them next — and that’s the whole thing, picking them up (Greg simulates a power bomb). Like the walls the kids are screaming at T: I got questions: Do you think — you can rip a kids head off\nG: No, [but] I think I could break their neck pretty easily\nKevin: Christ N: See, I feel I would panic. My thing is this: first kids coming — he’s getting that right hook. Come in with a right hook",
            "start": 402.4
        },
        {
            "text": "G: No, [but] I think I could break their neck pretty easily\nKevin: Christ N: See, I feel I would panic. My thing is this: first kids coming — he’s getting that right hook. Come in with a right hook\nC: He’s done N: Next one’s coming this way I assume — they’re in front of us right. I’m going that way with that one (left jab), and then probably at that point though another one is grabbing my leg, right, so this is where we start getting into trouble cause I’m gonna have to start hitting them in the top of the fucking head, right, but while I’m doing that  if I don’t get him in the first hit, another one is grabbing my [other] leg and I’m going down. T: Two kids aren’t gonna take you down\nN: They lock the leg — lock on (Nick makes a hugging motion) like this with their feet as well, you can’t move, and then another comes and runs at you like this — and you just fall down T: Just straight fucking like — dropkicks you — in the dick",
            "start": 439.78
        },
        {
            "text": "N: You’re in Gulliver's Travels territory where they just keep throwing rope on you G: I mean, like, the thing though — is that you (YOUUUU!)  — we have the advantage. We can instill fear in these children. They’re not terminators — they feel pain, right like — the cats — it’s hit or miss if they’re gonna run when we attack them. But yeah, these kids grab you on the legs and — usually a cute kid move, right — what you gotta do instead is — not punch down — but ‘Byah!’ — and when you crack a fucking 5 year old like that, that’s like a skull fracture N: He’s gonna forget his alphabet or something. You just knocked out like A through M\nC: Do your ABC’s. ‘You mean your NOP’s?’ *like 10 seconds of everyone laughing* T: We’re smart. We can outsmart these people. Do you think we can — instead of fighting — use our wit? How clever we are. G: I didn’t know that was an option",
            "start": 488.96
        },
        {
            "text": "T: I don’t know… Can we just make fun of — make fun of their mothers? Just make them cry? G: What I don’t understand is what they understand at this point. Do they know that — 15 enter, only 1? — leave? I guess theoretically 15 of them could leave. Like do they know they have to take me out. Or is it just that I’m walking into a Chuck’E’Cheese — I walk in — look around, turn around — lock the door. I got the batman cowl on N: One kids still eating a piece of pizza with cheese coming out and is like ‘Oh fuck, it’s on. It’s on. Big Boy bring the pain T: Definitely not that! In no scenario are you just going in, unprovoked — the question isn’t how many kids do you think you can take out G: So they know! So they know it’s life or death. That’s an interesting one. That does change things to an extent right. I don’t know we could scare them AS easily. Do 5 year olds understand the concept of death? C: I don’t think so",
            "start": 558.0
        },
        {
            "text": "G: This guy's gonna kill you or you kill him, can we explain that? C: The other thing that’s important to me is where’s the arena? Is it on a street - can I pick up weapons? Can they pick up weapons? N: I think it’s an octagon\nC: It’s an octagon? There’s nothing to do but fight with your fists. N: And there’s a limited amount of room to fight so you have to be strategic about how you circle around this group of children. That’s why I’m saying — it’s dangerous, because if they get behind you — you can barely see them, if you’re looking at them straight, they’re so low T: You’ll be fine\nN: They come behind you — one gets on your neck like a fucking koala bear, and starts choking you right — but it’s just enough to cut off the air — you can’t think — you see stars and boom, you’re done C: I think if it’s an octagon I’m gonna corner myself intentionally, to back up all my angles. If I get surrounded I could probably drop a shoulder and run — hurdle over some G: Climb the octagon",
            "start": 619.37
        },
        {
            "text": "C: I just feel like you’re underselling how many kids you could take out. It comes back to vigor and dexterity. When you run out of Vigor, and your vigor starts to wane. You’re not dextrous anymore. It is all about making that first mistake and being overwhelmed. But I think it’s gonna take 3 or 4 of them to overwhelm you. If you can rectify those mistakes, I feel like you’re underselling yourself. 2-3-4 T: 2-3 — easy, 4 — questionable, 5 is where it starts getting dicey. But I do think I could take 5. That’s the thing — sheer size and sheer fucking -- — before they overwhelm you — I think I could take out 5. So 10? — I dunno. Those little shits. Cause again, I will have used all of my energy. G: There’s fingers gonna be everywhere too\nC: And if they don’t get you, you’re probably going to get sick from them later. They’re gross G: They’re playing the long game",
            "start": 678.32
        },
        {
            "text": "C: And if they don’t get you, you’re probably going to get sick from them later. They’re gross G: They’re playing the long game\nC: You beat 20, you win — the octagon is littered with dead bodies and you celebrate but 2 days later but you feel a little scratch in your throat — you’re like god dammit G: They got me\nT: They got me. The long con",
            "start": 728.88
        }
    ]
}