{
    "id": 2805,
    "video_id": "dqx7y0ODxqA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Fancy Dick Pics - The GameOverGreggy Show Ep. 187 (Pt. 4)",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1499324402,
    "duration": 922,
    "transcript_chunks": [
        {
            "text": "Today's episode of The GameOverGreggy Show is brought to you by Dollar Shave Club. Make the smarter choice and shave with these guys, not your shoe. They let me write this ad once again. Uh, get a great shave at a great price, conveniently delivered right to your door. Doctors call it a life hack and a no-brainer because you get to sit there watching Kinda Funny and some poor schmuck has to bring all your face stuff to your house. World renowned Playboy Tim Gettys uses the DSC executive razor with their Dr. Carver shave butter and the love of his life Gia can't stop saying, dang Tim, that DSC executive razor and Dr. Carver shave butter sure take better care of your face than a shoe. For a limited time new members get their first month of the executive razor with a two of their Dr. Carver shave butter for only $5 with free shipping. After that razors are just a few bucks a month. Dang, that's a $15 value for only five bucks in your first month. In your first month box you get an awesome weighty",
            "start": 0.21
        },
        {
            "text": "butter for only $5 with free shipping. After that razors are just a few bucks a month. Dang, that's a $15 value for only five bucks in your first month. In your first month box you get an awesome weighty handle, a full set of cartridges and a tube of that shaved butter. I have to keep talking about. You can only get this offer exclusively at Dollar Shave club.com Greggy. That's dollarshaveclub.com Greggy. Make the smarter choice for Gia. Uh, Tim what do you got for me? Uh, this is a Nick topic. He Nick had two good topics today so I'm gonna I was intr now I just wanna I just want you guys to experience this. This was introduced to me by a friend of mine over the weekend. Do we need to give the links to Kevin? No, we we really can't. That's not something we could do. We're going to have some fun. Um, this is a website if everyone out there would like to in your of age that you can go visit right now. Oh God, it's called Dicture. Oh, Dicture, d i c t r e.com. Oh, like a picture but with dicks. So this is this is an",
            "start": 52.64
        },
        {
            "text": "website if everyone out there would like to in your of age that you can go visit right now. Oh God, it's called Dicture. Oh, Dicture, d i c t r e.com. Oh, like a picture but with dicks. So this is this is an artist is an artist who specializes in making uh images of that's the picture from Titanic. Are those a bunch P that's all the pictures. Those are you come in wait what he took the took the dick photos and made photos that are mosaics, the Mona Lisa. That's one that's one those are those are the mosaics. The the the ones that I am a little yeah you should are are these these are just pictures of world leaders. This is Saddam um Saddam hus sad Hussein weapon of ass destruction my god. Um, you got uh are these I'm sorry is this his dick? No, they're different dicks. They're different dicks. I can try to make a bigger hold on let me let me Dicky Minaj there's Dicky Minaj show me Dicky oh I see Dicky Minaj from here there's Dicky Minaj Right There okay D West AKA cocky okay so I just hold on is this this",
            "start": 115.96
        },
        {
            "text": "a bigger hold on let me let me Dicky Minaj there's Dicky Minaj show me Dicky oh I see Dicky Minaj from here there's Dicky Minaj Right There okay D West AKA cocky okay so I just hold on is this this is show it to everybody show it to the people let me try to figure out how to Big this is if you if you watched topic 3 and we're doing the day by day here's Nick cartwheeling look at you this is you that's my gorilla St God Eric give me go give me go Nick does the dolphin like shark thing I do the SeaWorld this is my SeaWorld here we go there it is man you've never looked more like a Matt's brother there thank you thank you oh oh gosh um so back to the dicture back to so this is this is dicture I just wanted you guys to exp Dapper so Nick do me a favor yeah go to the website is there an about us page there please please read okay so uh who it says my name is Sera dbaz and I'm an Iranian Canadian Living in New York what my project is called dicture and it's exactly what it sounds like dick",
            "start": 172.76
        },
        {
            "text": "us page there please please read okay so uh who it says my name is Sera dbaz and I'm an Iranian Canadian Living in New York what my project is called dicture and it's exactly what it sounds like dick pictures but these aren't just your regular dick pics these are dick pics with a Twist it's an artistic take on otherwise alluring modern dating tactic which is like a dickpick I guess would that be why I've gotten my fair share of dickpics over the years and most of my single friends have as well we would show them each to each other and compare these dickpics vary in quality depending on the guy in the relationship gay guys really do as she says in parenthesis uh do give the best dickpics I thought it would be funny to treat dickpic like a high fashioned photo shoot so I put clothes on penises and the rest is history of course I feel like Kinda Funny needs one I we do which one of us wants to be the dick the donor dick for this I mean I'm so about you need to recreate this sounds",
            "start": 228.76
        },
        {
            "text": "penises and the rest is history of course I feel like Kinda Funny needs one I we do which one of us wants to be the dick the donor dick for this I mean I'm so about you need to recreate this sounds great the photo in the back photo and then it's P's penis on the little thing not there is a YouTube video all our dicks next to each other's penis photographer and it's her doing it's her at work so I can send out this link warning explicit content **** the New York Post that did this it's their Patreon video she's just wow okay all right so give a little bit more context for the people at home that aren't seeing this these dicks are when you say they're dressed up like what does that mean they have like little felt costumes on like little leather jackets they got mustaches on they got sunglasses on here's my thing cuz I didn't see any of these here and I definitely want is there googly I was about to say I need the googly eyes uh no go to the very very top very very top very very top",
            "start": 273.6
        },
        {
            "text": "on here's my thing cuz I didn't see any of these here and I definitely want is there googly I was about to say I need the googly eyes uh no go to the very very top very very top very very top very very very very top there you go oh no those no these are little gles sorry eyes it looks painful like that one there looks painful the sunglasses I'm not why don't you play here take the take the laptop and and click around there a little bit it's fun for no it's not Bowser man okay so did this inspire you Nick no it doesn't necessarily inspire me but it it's interesting because this is one of those things where you're like this is obviously started as a joke but she's gone so far with it that there are literally like tens of hundreds of dicks on this page dressed up maybe there she uses the same stunt dick over and over again they like different different dick there's different sizes of dicks here this one has a Jerry curl what this reminded me a lot of uh was do you guys remember about a",
            "start": 314.0
        },
        {
            "text": "stunt dick over and over again they like different different dick there's different sizes of dicks here this one has a Jerry curl what this reminded me a lot of uh was do you guys remember about a few years back an artist decided to do really uh really wonderful depictions of celebrities and politicians going down on girls know this I do that's kind of what this reminds me of a little bit um I don't know there's not much it reminds show you guys some dicks thanks for showing me some dicks it reminds me of puppetry of the pan yes I remember that this is a uh comedy standup show it it was a show it was it was two dudes that would do different Arts with their genitalia the wristwatch remember that yeah they would wrap it around there whole thing my favorite move they did there was the loch ness monster where they made it look like it was the Loess monster but then after that did you see this live uh I didn't see it live but I I did buy show of it I bought the DVD course you did um I was",
            "start": 359.16
        },
        {
            "text": "monster where they made it look like it was the Loess monster but then after that did you see this live uh I didn't see it live but I I did buy show of it I bought the DVD course you did um I was really fascinated I tried to do a lot of things couldn't pull them all off as they say you need the right amount make things gift wrap they have dick calendar give me back your birthday gift so I can RP it Donald Trump won the Dick is the best part the best one by far my thing about it and I don't know this doesn't I don't know what this says about me is that it's just I'm I'm uncomfortable not like ew dicks but like it just makes me uh I don't like I don't like the idea of my dick being compressed and putting wigs on it and sunglasses on it and things to this nature me and you are such different people immediately I start thinking what dicks or what what people my dick capable of right so that shortens the list a lot but then I realize that I need to come up with the dick pun and I'm like okay",
            "start": 404.64
        },
        {
            "text": "immediately I start thinking what dicks or what what people my dick capable of right so that shortens the list a lot but then I realize that I need to come up with the dick pun and I'm like okay cool I got enough to work with to at least get Peter Dinklage and then I just call it Peter dickl diage there you go it writes itself there you go that's good that's good I like that a lot I'm so sorry you're about to get some dickl also I just oh my God please with eyes I mean I know this is this penis is just so unattractive yeah so just not a not a pleasing thing to look at a penis if you ask me I mean no one's asking you well I'm just putting it out there I'm just putting it out there a fan sir of Pell's hot dogs and you don't do not like the look of a penis well that's why cuz Sim cuz that's probably the problem with the hot this looks like a a hot dog that's been in the the microwave too long it's exploding out of its casing look it's exploding out of its casing hilarious well yeah",
            "start": 445.56
        },
        {
            "text": "probably the problem with the hot this looks like a a hot dog that's been in the the microwave too long it's exploding out of its casing look it's exploding out of its casing hilarious well yeah they're funny the Vito mus musen is the best **** thing I've ever seen all that what's Kim black and white is inspiring to say the least if I can go back in time to the first topic what inspires me it's it's definitely the dit I'm just a fan of people taking sexuality to the next level turning it into into I don't want to call it art I want to call it content cuz that's what this is and I'm a little upset that there's not enough I feel like this is too little for this website to be I think it keeps where it's at no when you go back to that the first homepage the pictures repeat over and over and over was that bottom one to the right oh Mr. Dickman old Sant here's oh my God it's DJ Khaled but it's a dick that's see but it looks like him a little bit little skinnier than he would be",
            "start": 488.0
        },
        {
            "text": "and over and over was that bottom one to the right oh Mr. Dickman old Sant here's oh my God it's DJ Khaled but it's a dick that's see but it looks like him a little bit little skinnier than he would be but uh some dick like the coloring on the head isn't good either like you need to go to the doctor like this doesn't dick shaming Greg they don't dick shame I'm not dick shaming I'm I'm being an interested party worried about their dick Health okay now let me ask you guys Alexis you could just play along okay okay who would you dress your dick up as Slimer change the name easy exactly imagine we can make this happen little felt arms come off of it and just like make the oh my God I feel like my dick would make a really good current day Bill Murray I don't know why I just feel like you wouldn't have to do much down there you just kind of dress him in a Hawaiian shirt and call it a day okay you know and that's just it we'll call it uh no I don't know what would be a good name for that D fur",
            "start": 533.48
        },
        {
            "text": "have to do much down there you just kind of dress him in a Hawaiian shirt and call it a day okay you know and that's just it we'll call it uh no I don't know what would be a good name for that D fur Mur balls Murray I like that I like that a lot you're your brain's fireing all cylinders today my favorite things in the world it's all I got what would you dress yours up did you already cover it Peter dlish thank you oh I'm sorry you you didn't say it in this context so jumped ahead and Alexis if you had a penis um or you can use your vagina I mean that's the thing is I feel like no shame now that we see this we can iterate on the concept you can launch your own website yeah and Inspire here's what you do you take a picture of your vagina put it next to a dragon egg and call it the mother dragons boom boomo C you could do c well do cago dressed up with a little axe and a horse I don't know who I would Ryan Gosling probably from drive there you go little scorpion so I can get him a cool",
            "start": 582.48
        },
        {
            "text": "boom boomo C you could do c well do cago dressed up with a little axe and a horse I don't know who I would Ryan Gosling probably from drive there you go little scorpion so I can get him a cool jacket jacket hell yeah yeah that is a good accessory that is a good accessory maybe some dinging just some ding gloves who are you going to dress your dick up as to impress paa morph oh man morph did you make who you were be uh slim oh Slimer that's there a dude from Sesame Street that comes in and out of the garbage can Oscar the Grouch yeah cuz I want a little garbage can that I can pop out that's smart that's really smart he taking the props to level that is really good see what I want to do I want to think of something good where I want to get creative with this like a lot of these people they're using the shaft as the body and the head as the head cool I want to do more a more top down view you know right they're not they're they're excluding two of the biggest EXA feel like they're",
            "start": 619.44
        },
        {
            "text": "they're using the shaft as the body and the head as the head cool I want to do more a more top down view you know right they're not they're they're excluding two of the biggest EXA feel like they're missing out on a lot going on down I really feel like this should be your Christmas card this year or just yeah or maybe like hey these are E3 Awards next year diesel put a little tank top on them damn done I'm a big portra with a Min car behind yes oh my is it Vin dixel or or dick diesel it's probably just dick diesel that one just sounds it sounds right I love it but then maybe I can go make the well the I can make the balls if I shave but do the rock where he's got the little fanny pack and he's doing little POS shave both the balls they're both the heads one's the rock one's Vin Diesel or or you pull one ball aside and you got twins Arnold Schwarzenegger and Danny De yes see what I'm saying okay okay I like you pop one ball out put the other one down and you're just there I don't like",
            "start": 668.2
        },
        {
            "text": "or you pull one ball aside and you got twins Arnold Schwarzenegger and Danny De yes see what I'm saying okay okay I like you pop one ball out put the other one down and you're just there I don't like the popping out motion you dress in the same both in the same gray suit same gray suit it's perfect and would also maybe do Catniss Catniss okay I like that a lot how how would you do it though bone arrow little armor thing easy it's fine easy Kevin's already working on the costume it's so simple I mean the the obvious joke is Harry Potter you got to just dress a little hot in a little Gryffindor sweater with a little F and Voldemort he looks more like Voldemort I'm actually disappointed in her that she hasn't done that oh that's that's true you draw a little scar on it yeah in the glasses you're done that's my Harry Potter you have to change the name Harry Potter okay that's something Harry throbber I don't like urethras either I'll put that out there Ure male and no it's just like I",
            "start": 714.44
        },
        {
            "text": "you're done that's my Harry Potter you have to change the name Harry Potter okay that's something Harry throbber I don't like urethras either I'll put that out there Ure male and no it's just like I don't remember remember in uh not Borat I don't think I don't know where like they did talking Ure head on a penis it was Boran I know I just remember that also underexposed as a society to penises so when you do see one you're like speak for yourself you're like oh my God see it's not no I was always that because like I remember watching 28 Days Later in theaters and when s San is that how I say his San Murphy and his dick was out there I remember people in the audience like e cuz like we were a college town I'm fine with that representation of the penis but I don't like the head moving around with the urethra and I don't like I don't like him being constrained I don't like like this neck tie around him that doesn't look comfortable so but you just need to open veratile with your dick rig",
            "start": 759.68
        },
        {
            "text": "with the urethra and I don't like I don't like him being constrained I don't like like this neck tie around him that doesn't look comfortable so but you just need to open veratile with your dick rig again I want all penises to be comfortable and free is what I'm saying they ended puppetry of the penis with one of the dudes getting on a skateboard and it was called the sailboat and he took his balls and he made it so that the the skin made a sail and the other guy had a fan and he put the fan against it and it made him go is that healthy no he made money from it though yeah he made a lot of money made is that healthy for the male genitali I don't know that it's unhealthy it's like stretching your legs you know you're supposed to stretch before and after workout you're fine got it if you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that",
            "start": 806.08
        },
        {
            "text": "you didn't know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that head over to patreon.com kindafunny where you can toss us a couple bucks get each and every episode early so early you can get it while we record it like so many of you $1 sub subscribers are thank you very much for your support uh if you have no bucks to toss our way though no big deal you can head over to con of funny.com get each and every topic day by day broken out just for you until it all goes up as one big MP3 and video the following Friday on youtube.com/ Kinda Funny and podcast services around the globe Alexis thank you for coming in thanks for having me I thought we had really good conversations we had really good convers yeah thank you guys for opening up about it it was really nice always a pleasure we love you we love you everybody go subscribe to her YouTu Channel let's",
            "start": 846.88
        },
        {
            "text": "conversations we had really good convers yeah thank you guys for opening up about it it was really nice always a pleasure we love you we love you everybody go subscribe to her YouTu Channel let's get Lexi support the pus thanks until next time it's been our pleasure to serve you thanks for watching this episode of The GameOverGreggy Show click here to subscribe go support us on Patreon down there check out other episodes up here and then go over toon Funny Games because we got a whole bunch of cool stuff there like party mode but don't forget about the Patreon stuff you can watch us record the show live",
            "start": 891.36
        }
    ]
}