{
    "id": 2790,
    "video_id": "gXAdhqL5e9Y",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Mike Doherty"
    ],
    "title": "Crash Bandicoot N. Sane Trilogy Review - Kinda Funny Gamescast Ep. 125",
    "description": "Patreon supporter Mikey \"Double D\" Doherty joins us to review Crash Bandicoot N. Sane trilogy. (Released first to Patreon Supporters on 06.30.17)\n\nThanks to MVMT Watches for sponsoring this episode. Go to mvmtwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1499107060,
    "duration": 4635,
    "transcript_chunks": [
        {
            "text": "this episode of Gamescast is brought to you by Movement Watches. Movement was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion, offering high quality minimalist products at revolutionary prices. Greg gets all fancy for his fancy dates with Jen St. Don Miller and guess what, he's never late. Why? Movement Watches, MMAN, figured out that by selling online they were able to cut out the middleman and retail markup providing the best possible price. We're talking classic design, quality construction, styled minimalism. Get 15% off today with free shipping and free returns by going to movementwatches.com/kinda. That's mvmtwatches.com/kinda. It's going to be a good time. You're going to want to see these watches. You're going to want them on your wrist. Go to movement.com/kinda. Join the movement. What's up guys, welcome to the first ever episode 125 of the Kinda Funny Gamescast. As always I'm Tim Gettys joined by one",
            "start": 0.09
        },
        {
            "text": "want them on your wrist. Go to movement.com/kinda. Join the movement. What's up guys, welcome to the first ever episode 125 of the Kinda Funny Gamescast. As always I'm Tim Gettys joined by one of the coolest dudes in video games, Greg Miller. Bonejour djo. Take the pizza, shove it up your ass, Tim. Oh, oh Thursday D, you know what I'm saying? That's what I'm talking about. Kinda Funny Jesus and joining us for the first time on this show, Mike Double D dty. What's up players? It's your boy. You might know him from Chipped Tooth Gaming over on YouTube or you might know him as the punk ass **** that called me out in Crash Bandicoot and won. I am and you you did win at Crash Team at a Kinda Funny Life3, but originally you called me out uh just on the internet on Twitter yeah and you were just a normal dude you like you now you know you just you're noral every day Greg Miller knock you should race me you should race me like I think you're you know not that good at Crash Bandon Crush Team Racing",
            "start": 48.48
        },
        {
            "text": "dude you like you now you know you just you're noral every day Greg Miller knock you should race me you should race me like I think you're you know not that good at Crash Bandon Crush Team Racing it's all good and then like a day later lost shum well that is true that is true then you respond the next day with the most up in the an video I've ever seen of you and a in your best Greg Miller cosplay than just talking mad **** and I'm like I like this kid as uh Mike dhy does take it up to level one and then you just jump right just jump to 10 I love it and you did it and I was just like in my mind I'm like I have an idea for Kinda Funny Live don't know it's going to work this is back in January so we were well aware well away from it at that point yeah and I was thinking I was like if we do this Nintendo World Championship thing that I wanted to do we're making it happen when that got confirmed I'm like got to reach out to the kid sure we got to make this sha D and then I I dm'd you",
            "start": 119.0
        },
        {
            "text": "do this Nintendo World Championship thing that I wanted to do we're making it happen when that got confirmed I'm like got to reach out to the kid sure we got to make this sha D and then I I dm'd you on Twitter and you were taking a test at that time so yeah you did funny story about that I almost died literally died uh the day you called me that you sent me this a week before I went on vacation kids with our body type have heart condition got not excitement give me a couple years on that one give me a couple years on that one um no I was actually going home um I am originally from uh the Inland Empire and I was driving back home to go to Disneyland with my family yeah I was going uh to Disneyland with my family uh before my niece's birthday and um I didn't eat anything that day when I started driving and I didn't drink anything that day and I passed like I my body passed out on the road and I went almost under a semi that's not good no it wasn't and then like it was just a crazy like",
            "start": 163.32
        },
        {
            "text": "driving and I didn't drink anything that day and I passed like I my body passed out on the road and I went almost under a semi that's not good no it wasn't and then like it was just a crazy like kind of like come to Jesus moment I get home yeah well that that's usually my answer for things too um but I got back um into Hayward in the Bay Area and um you hit me up on Twitter and I was like God sorry Kevin's yelling at me so you just got to remember it's do this thing just do this thing um but I got back into the bay area and that's when you hit me up I was like this is unbelievable it's a sign yeah cuz your friend was talking **** I watched the podcast I saw there's no way Tim's gy there's no way Tim G's getting back to you no way KB shout out to KB yeah shout out to KB you're a **** idiot I appreciate so no how so we're joining ourselves today to talk about something very special near and dear to both of our real quick we need to point out the fact that he's here because he",
            "start": 206.36
        },
        {
            "text": "idiot I appreciate so no how so we're joining ourselves today to talk about something very special near and dear to both of our real quick we need to point out the fact that he's here because he supported us on patreon.com there's more R I just want to make sure everybody knows it's not just make a video insulting Tim because trust me we'd have hundred people being yeah know you supported us on patreon.com kind of funny games just like so many other people can do and watch live as we record the show for a dollar for just a dollar you supported a lot more than more than dollar to on the show so far as the experience been worth it yes it has this is unbelievable shitty Outback that you didn't get your macaroni chees hey it's not even about that it's the connections I'm making this good my question is how can a 1-year-old like yourself afford enough to come on this show well there's this uh thing called financial aid they just cut you the they don't pay attention to what you do the",
            "start": 250.64
        },
        {
            "text": "my question is how can a 1-year-old like yourself afford enough to come on this show well there's this uh thing called financial aid they just cut you the they don't pay attention to what you do the government I like you dude you're **** making the moves and **** so this is the Kinda Funny Gamescast each and every week get together talk about video games all things we love about them and all of that you can get it early by going to patreon.com kind of funny games and at the dollar or above level you get to watch it live or for5 or $10 you can get the either audio or video version ad free ad free so that's exciting nothing about a shoe in there no no shoes there yeah no shoes at all but if you want the shoes you can go get the shoes if you want the shoes you can just wait till the next week and get them on youtube.com/ Kinda Funny Games what you guys have been playing Greg lot of Friday the 13th yeah and how's how's it going for you are the servers better yet well now that's a",
            "start": 292.64
        },
        {
            "text": "week and get them on youtube.com/ Kinda Funny Games what you guys have been playing Greg lot of Friday the 13th yeah and how's how's it going for you are the servers better yet well now that's a loaded question here we go yes the servers are better but then this weekend of course was the old Double XP you know what I mean cuz the servers had been so bad at launch so when that happened so many people came back the servers went back to being shitty and it was Troublesome for a while just for a little bit on that Friday then then it all rided and it was great and we were all playing except for the fact that if you didn't update your PlayStation 4 with the optional firmware that was crashing if you were joining games that but than that we were fine it was good and the double XP went real well I unlocked some stuff trophies are still garbage still playing it I appreciate you because every once in a while it sounds like you're crying but you're not it's I'm usually out burp and I don't",
            "start": 332.72
        },
        {
            "text": "well I unlocked some stuff trophies are still garbage still playing it I appreciate you because every once in a while it sounds like you're crying but you're not it's I'm usually out burp and I don't want stop but then there's sometimes where you just start crying and I'm just like I thought that was just purp but I don't why yeah I think I Telegraph AC C am I going to cry am I going to cry in the middle of Friday 1 honestly I don't know what you sorry don't not to interrupt you so yeah more Friday 13th serve issues are better I wasn't expecting this you caught me off guard I'm still getting used to the new show in terms of like we're in Deal stuff the new Gamescast the all new Gamescast as I refer to it but we're not calling it that it's just there's there's segments now the first segment is what are we playing sure then eventually there's the this week in gaming history then we got the topic of the show then we got some listener questions there's some other segments on throw in",
            "start": 372.92
        },
        {
            "text": "is what are we playing sure then eventually there's the this week in gaming history then we got the topic of the show then we got some listener questions there's some other segments on throw in there whenever the hell I feel like sure I played more I played Nex Machina since we last talked a big fan enjoy it I want to get back to it it's just arcade you know it's it's Housemarque play through twin stick Shooters all right this is fun it's pretty it's cool uh I it's one I think I could get better at I'm pretty good already but I think I can get a lot better at it I'd like to get back to it at some point uh tried Dead by Daylight during our stream when Friday 13th wouldn't work man did not like that really no just it I was I was having a bad experience I only played one match of it but I played two or three matches at RTX last year or a Australia let's play Live whatever I've played it before it's fine not my kind of game which is weird because Friday 13th it is but this game is doing the",
            "start": 411.6
        },
        {
            "text": "two or three matches at RTX last year or a Australia let's play Live whatever I've played it before it's fine not my kind of game which is weird because Friday 13th it is but this game is doing the problem where it's just too it's too there's too much going on in it whereas Friday 13th is jumping in play you figure out pretty quick there's not that many options in terms of characters and worries do you think that's because you played Friday 13th first well no technically I played Dead by Daylight first but I mean like when you like really playing it not just uh you're in front of an audience now play a game for the first time situation yeah I I don't know if that's the case of more is just the fact that I think Friday 13th walks that uh multiplayer balance I like like Left 4 Dead where it is like just jump in play you're going to have a good time you don't need to worry about am I the Right class what is this character's buff versus that thing blah BL because even like fright 13th has",
            "start": 445.56
        },
        {
            "text": "is like just jump in play you're going to have a good time you don't need to worry about am I the Right class what is this character's buff versus that thing blah BL because even like fright 13th has the consors all have different things but at a glance you figure that out in a a second and then the jasons have different pros and cons but again that's not they're not that drastically different where you're going to **** everything up and screwed up uh I played that crash but I know we're going to talk about that here in a little bit uh started in on Oceanhorn on the PlayStation Vita I of course had I was one of the people as you know Double D waving the flag for the Oceanhorn when it came to PlayStation 4 and caught me off guard and I was like **** there Zelda is on PlayStation 4 now with trophies this is great and then the developers were like oh they saw they saw people talking about it like what if we put on Vita and we're all like yeah and I stopped playing on PlayStation 4",
            "start": 481.12
        },
        {
            "text": "with trophies this is great and then the developers were like oh they saw they saw people talking about it like what if we put on Vita and we're all like yeah and I stopped playing on PlayStation 4 so now going to Missouri for Fourth of July and straight from there to RTX Oceanhorn is going to be on the Vita ready to go over there then I don't know if you've caught on lately there's been a rash there's been a big breakout a flare up in the platinum trophy addiction I got my platinum and Mr. Massagi about 0 minutes 5 minutes something of that effect I started in on the Energy Cycle Platinum which again is like 0 minutes uh I was doing it here through remote play when you guys were doing some video I was waiting for but then you guys finished up too early so I had to come out here I I have to complete that because right now it's embarrassing to see 3% of Energy Cycle trophies you know what I mean I know nobody wants that no want are you one of these trophy people I am but not to",
            "start": 515.8
        },
        {
            "text": "have to complete that because right now it's embarrassing to see 3% of Energy Cycle trophies you know what I mean I know nobody wants that no want are you one of these trophy people I am but not to that extent I um if in similar Greg Miller fashion um that's my highest compliment I could give to a game so if I like him I'm going to PL them it or if it's like easy and I'm enjoying it then I'm going to go for it but okay but I mean would you go out of you not going to go out your way there's an easy Platinum you're not going to go you're not going to spend I'm going get that Taco Master Platinum though oh come on now Taco Master was a good game let's not knock that I I don't know I can't now is is five star 1000 whatever the **** it's a good game no but is it going to be an easy Platinum yes so I'll do it there's YouTube videos that just have the how many ups and downs and rights and lefts I have to do to get it I'm all in I got to do it Jesus now is it part am I part of the problem",
            "start": 551.36
        },
        {
            "text": "yes so I'll do it there's YouTube videos that just have the how many ups and downs and rights and lefts I have to do to get it I'm all in I got to do it Jesus now is it part am I part of the problem no because there is no problem the problem is PlayStation not having clear rules if PlayStation publishes it's fine if they take it down for no reason then I got a problem with them yeah didn't they take down on the game they did this is the one the top rated one five star 1000 top rated I got went down we talked about in The Game's Daily Show today or whatever and just the fact of they took it down and the and the developer says the oh they took it down and asked us to take out references to the platinum trophy on our description and our website which is promoting the the 4K backgrounds we do the name is also clickbait as **** sure of course five star top rated or 1000 top rated yeah you're like what the **** does that even mean oh it's I pay 98 cents and I get a platinum trophy",
            "start": 590.4
        },
        {
            "text": "do the name is also clickbait as **** sure of course five star top rated or 1000 top rated yeah you're like what the **** does that even mean oh it's I pay 98 cents and I get a platinum trophy great is there no gatekeeper do they just let everything fly by into see you see that Black Tiger game yeah of course they do and that's the issue of like what the **** going on over there and this is the long debate we had today of like it's weird that they made them take it down and change it because okay was it did their description violated a terms of service and then like when they resubmit it now it's still just the same game it's still the same problem right just has a different description are they going to put it back up how are they going to play this they we'll see Double D what have you been playing besides the Bandicoot besides the Bandicoot um I've jumped back into Gravity Rush too actually yes okay um because I was a big fan of uh Gravity Rush on the PS VA so why did you",
            "start": 623.92
        },
        {
            "text": "have you been playing besides the Bandicoot besides the Bandicoot um I've jumped back into Gravity Rush too actually yes okay um because I was a big fan of uh Gravity Rush on the PS VA so why did you get why did you get distracted on your Gravity Rush you play through originally um life okay okay happens to me all the time yeah life uh I think it was in the cellophane for like the first month that I had it why did I spend this money and then um jump back into it it's fun more Gravity Rush like you've been saying but um I just like being able to fly around and collect things and uh collect the gems and grind it out just something I could put on a podcast and play um on top of that the Wipeout collection I also I got a big fan of those games I originally played 2048 on the PS Vita it's another game that I could just put in the um yeah the earphones and just kind of tune out and Wipeout just never felt right to me it always feels a little too floaty and it always I don't like how it it",
            "start": 665.0
        },
        {
            "text": "game that I could just put in the um yeah the earphones and just kind of tune out and Wipeout just never felt right to me it always feels a little too floaty and it always I don't like how it it feels like you're controlling with the back of the craft you're like fish tailing yeah it's it's a little weird dude I like Racers but I don't like realistic Racers so if it's a cart racer or like something like a Wipeout I'll play it like I have a ton of fun with those games you know a racer we haven't seen in a while Ridge Racer love racer big fan of Ridge Racer cuz the drift mechanics like it's so ridiculous **** and I'm into it because it's fun to just drift around and like just feel like you're in control even though I know I'm not doing well at all playing Gran Turismo it's like oh no I am a bad driver and it's like at least it's accurate yeah no shout out to C yeah of course what our dude good job on son the be moved at the end of Spiderman Homecoming in the credits I was like oh",
            "start": 705.28
        },
        {
            "text": "I am a bad driver and it's like at least it's accurate yeah no shout out to C yeah of course what our dude good job on son the be moved at the end of Spiderman Homecoming in the credits I was like oh they're still **** doing that all I like that the movie started off with the Sony the little ding like the Sony like chime I hav seen that in a movie before maybe I just haven't paid attention I so put on the movies you know yeah no I guess you're right that's true what else You' been playing um I that's about it um for my channel we do a lot of Let's Plays um oh I've heard of these yeah so we've been uh jumping into a TowerFall um which I haven't played before until then yeah really fun I should have listen to you guys a lot earlier um so like push me pull you you know the typical party games the typical achievement let's play games yeah so other than that uh that's about it cool so let's get right into the real beef of the matter here Bandicoot saved Crash Bandicoot we put him up here",
            "start": 744.36
        },
        {
            "text": "the typical achievement let's play games yeah so other than that uh that's about it cool so let's get right into the real beef of the matter here Bandicoot saved Crash Bandicoot we put him up here timed it perfectly there he is not true not true Crash Bandicoot Insane Trilogy comes out tomorrow for the people watching live right now for everyone else it is out already can you can go buy it you can go save them even more $40 on the PlayStation 4 will it come to other systems eventually who the **** knows it is probably we'll see it is we'll see I put some money on it that it would it doesn't even have the little only on Playstation I know that's the thing that's what's so weird about it but in the credits there's a lot of Sony specific credits but the thing is that happened with Rise of the Tomb Raider as well there's a lot of Microsoft specific credits and those are in the PlayStation one as well so interesting I don't know but all of us have played some level of this game sure",
            "start": 786.08
        },
        {
            "text": "of the Tomb Raider as well there's a lot of Microsoft specific credits and those are in the PlayStation one as well so interesting I don't know but all of us have played some level of this game sure let's go around I'll start off I beat two beat three played through three fifths of the first one the reason I didn't beat the first one is I didn't prioritize it because I had beat the first one two years ago on my birthday uh when we did that stream so I'm familiar enough I got far enough and I knew I was going to run out of time I'm like I want to play through two and three how far did you get um I've beat every single one I'm on the way for a platinum on Crash one and crash two um warped I kind of blew through it because I finished that like like two days ago um but other than that um on Platinum track for all three games hell yeah and Greg Miller Platinum all three of them fuckie of **** always toing me no no no no uh I played uh jezz a few not not not enough I knew you two were",
            "start": 833.08
        },
        {
            "text": "Platinum track for all three games hell yeah and Greg Miller Platinum all three of them fuckie of **** always toing me no no no no uh I played uh jezz a few not not not enough I knew you two were here to carry the load you know that I'm not a crash fan so my story went that this weekend I was playing Friday 13th cuz I can't stop and something's wrong with me I have decided I think one I'm going to have to do a a date to be announced but with enough time before everybody golf before Uncharted and before Patapon whatever the **** that's coming out I need to say I am done playing any other game but Persona 5 until I beat Persona 5 and I'm gonna have to just **** do it you're not going to do it I I have to there's no other way I'll ever get to I'll get through Persona 5 I'll bet you money right now cheeks what's the timeline we're looking at here well I'm saying I I don't know at some point I got to say that I'm going to do it and I'll do it I bet you you don't beat it this year oh",
            "start": 874.28
        },
        {
            "text": "right now cheeks what's the timeline we're looking at here well I'm saying I I don't know at some point I got to say that I'm going to do it and I'll do it I bet you you don't beat it this year oh sure okay let's do a pizza bet Pizza bet all right great cool I like the way you think I like the way you think I will definitely beat Persona 5 before the Ed of the year and my reason being is I started doing the whole thing of like oh man we got to start worrying about Game of the Year and like voting and all that **** and if I don't I got to just **** commit I got to just sit down and **** do it we'll see we will you're a busy man Greg will all right stop trying to get in my head about it Jesus God damn a family he watches too much of our content no so and then I was like I'm either going to play Arizona Sunshine on VR or I'm going to play Crash Bandicoot here and get going on that and I was like all right Jen was next to me playing Arms cuz she's obsessed and know MLG Arms and I",
            "start": 921.76
        },
        {
            "text": "to play Arizona Sunshine on VR or I'm going to play Crash Bandicoot here and get going on that and I was like all right Jen was next to me playing Arms cuz she's obsessed and know MLG Arms and I was like I'm going to I'm going to play this Arizona Sunshine game she's like all right cool I'm like all right I'm going to go get the VR and she was like o VR and I'm like yeah no she's like he's like this is fun we're sitting here playing games together do you have to put it on and go into another world next to me like get that disconnected I'm like n all right fine so I put in Crash played through I'll say seven levels of Crash one in the first world or whatever did you get to the first boss she didn't crash two no the okay well I mean I dude I would have known guess with the the stick then you're running in a circle jumping over it okay no is he is he is he before seven levels I **** that up it's around it's right around there I I did not get to that but here's my here's my thing is I",
            "start": 954.44
        },
        {
            "text": "running in a circle jumping over it okay no is he is he is he before seven levels I **** that up it's around it's right around there I I did not get to that but here's my here's my thing is I played through crash one didn't get frustrated and quit which is what I always happened on PS1 crash one PS1 crash one I'd always play and like why am I running at the camera **** I fell in the hole I I thought I made that jump but I didn't make that jump **** **** **** this one the controls for it I was like oh these are manageable I think the game's boring I'm having a boring time running away from this Boulder yeah I'm having a boring time running away how many **** crates did I miss blah blah blah but I was able to progress and keep going and not feel like I'm just getting **** over then I came into work and I was like yeah it's more crash it's better than I it's definitely making me go oh this isn't as bad as I make fun of Crash one on PS1 always being and I'm like but should I",
            "start": 992.84
        },
        {
            "text": "then I came into work and I was like, yeah, it's more Crash. It's better than I. It's definitely making me go, oh, this isn't as bad as I make fun of Crash 1 on PS1 always being. And I'm like, but should I jump ahead? And you're like, yeah, play Crash. This morning before work, I stopped and played 15 minutes of Crash 2 and I was like, oh, totally should have started here. This is, this is way more fun. This is way more fun, more control over the character. I again, I have better grasp of what to do and what it wants me to do. Like, oh, okay, it didn't even touch Crash 3. Yeah, yes, which I think is the, I think in this Trilogy, three is the worst. So okay, let's what's your history with Crash? Uh, that is the game that got me into gaming. This is why I'm sitting here right now is because uh, a PlayStation kid grew up Spyro and Crash. Um, so I was through all of it like I' I've been I played every game. I was obsessed as a little kid because I have an obsessive personality I guess no um so like um I had like like a",
            "start": 1027.44
        },
        {
            "text": "Spyro and Crash. Um, so I was through all of it like I' I've been I played every game. I was obsessed as a little kid because I have an obsessive personality I guess no um so like um I had like like a shrine of like all the games like I played everything 100% at every Crash game. Uh, on CTR, you can actually unlock Oxide. Yeah, I was one of the kids who did. You're **** crazy. Yeah, that was impossibly hard, but I did it as a kid. Um, so very deep, vast history with the Bandicoot. Um, so I do have like a ranking of everyone. What was your ranking growing up though? The ranking for me always went two, 3, 1. No, three, no, sorry, CTR. Don't get, yeah, exactly. Obviously CTR top god tier **** god tier, but just of the the first three. Oh, okay, so uh it was 2, 3, 1. Okay, cuz growing up for me it always went 3, 1. Warped was my favorite. I loved it so much. I thought it was so cool. I loved all the vehicle stuff and everything about it. I'm just like this is great now being an adult playing back having refined tastes man I",
            "start": 1067.16
        },
        {
            "text": "my favorite. I loved it so much. I thought it was so cool. I loved all the vehicle stuff and everything about it. I'm just like this is great now being an adult playing back having refined tastes man I I honestly say that it goes 2, 1, 3. Yeah, well, I say even before the Trilogy, I was still Warped was ahead of one, but since they went back and fixed a lot of the issues with one, it really changed it for me and I I'd say it's even like like two like one right there. Yeah, I I agree with you there because I well actually no I do think that one is not nearly as good as two. No, I but I'm saying it's like right like snipping out of seal so because the thing is the biggest problem with three is there's way too much gimmicky **** that does not hold up at all. All the stuff that I thought was cool a long time ago because it was was like oh it's changing up the gameplay that was only cool because that was different back then nowadays it's just like we want to stick to what the game is good at right and uh",
            "start": 1124.0
        },
        {
            "text": "ago because it was was like oh it's changing up the gameplay that was only cool because that was different back then nowadays it's just like we want to stick to what the game is good at right and uh with the way that Crash 3 is set up for every five levels two of them are vehicle based or gimmick based and the only ones that are fun to play are the Coco tiger levels. I love those. The jet ski levels frustrating as hell and the **** motorcycle ones for Crash I was about to throw my controller through my godamn yeah impossibly hard the turns are like like yeah they're like 90° angle turns it's dumb it's really stupid and I I don't understand how the rest of the game could feel so good and that feels so bad but it's interesting playing them back to back to back because I've never done that I've never sat and played all three games and one is so poorly paced as a a standalone game where the first seven levels I'd be surprised if you got to the first Closs playing through because some of",
            "start": 1167.44
        },
        {
            "text": "I've never sat and played all three games and one is so poorly paced as a a standalone game where the first seven levels I'd be surprised if you got to the first Closs playing through because some of those levels are very hard some of them are very easy some of them are very short there's just no consistency with it and there's no sense of progression in the game where uh all of the three Crash games jump between doing the run away from the camera run towards the camera or 2D scolling stuff right and then yeah then there's a lot of 2D vertical ones which are most prevalent in one and those suck jumping on the like bouncy crates to like get up not Precision at all and like the third level like makes you do that a lot and that is the point where I feel like a lot of people would give up and that's why I think the insane Trilogy fixed a lot of the issues because um making the save system different you can just need to worry on a level by level basis it's no",
            "start": 1213.08
        },
        {
            "text": "of people would give up and that's why I think the insane Trilogy fixed a lot of the issues because um making the save system different you can just need to worry on a level by level basis it's no longer you have to beat 10 levels to get to the next save point CU that was such **** it was so frustrating when you would lose your lives and off some stuff that you knew wasn't your fault it's because the game was making you miss the jumps yeah and I think they did like a really good job of fixing that first game um because the reason I like one so much now is it is the difficult game and we don't get difficult games anymore like there are times like trying to get every box because that's what in my review I mentioned it over on youtube.com/ chipto gaming he's watched he knows how to do it guys that's how you plug um I mentioned that um it it's good to bring in people and for the hardcore too because you could just run through and get the crystals or you could just run through the level",
            "start": 1257.52
        },
        {
            "text": "that's how you plug um I mentioned that um it it's good to bring in people and for the hardcore too because you could just run through and get the crystals or you could just run through the level and finish but getting the boxes is some of the most challenging platforming um gaming I've done yeah and I agree with that I think that from a very top level thing of do I recommend this game I would say yes for $40 totally worth getting into it if only for the history lesson and to see what Crash Bandicoot is about and two is legitimately a great game amazing game one I'm like it has its pacing issues I feel like there are a lot of really fun levels and a lot of great challenge to it three the good is really good but the bad is bad enough for me to be like oh man there's a lot of problems but for $40 for the amount of content that you're getting because you can just play through and there is the challenge of beating level but then there's the extra thing of getting the all of the crates in",
            "start": 1297.4
        },
        {
            "text": "$40 for the amount of content that you're getting because you can just play through and there is the challenge of beating level but then there's the extra thing of getting the all of the crates in each level that's where the real difficulty and then the death routes in and that's why two is so much better because it has all of it's the best of all the different worlds of of the games where it's like I feel has the best 2D platforming it has the best level design for 3D platforming it has the best vehicle levels it has the best um pacing in terms of difficulty and it has the best challenges and boss fights as well and I mean there's Secrets like playing that game I forgot how deep it was like there's a secret warp room uh on each level there's like hidden Pathways to get to the warp room to unlock the level to go back and then uh get the gem in that warp room like it's deep and then there's like uh one of the favorite like uh troll things that Naughty Dog did was showing you the",
            "start": 1342.36
        },
        {
            "text": "room to unlock the level to go back and then uh get the gem in that warp room like it's deep and then there's like uh one of the favorite like uh troll things that Naughty Dog did was showing you the colored gems as you're progressing through the level so like on Snow Go and Crash Maniko the seeing the red jum the high and you're like how the **** do I get it and I love it because it promotes going back and playing the levels again and what I didn't like about three is when you get the at the end of each uh warp room or whatever the **** I don't even know what they call them world yeah uh in in Crash Warped you get a new ability and I feel like the abilities just made the game broken like you can eventually get the double jump you can get the thing where you can spin once you have the Booka it's like all right this game is simple this now it's just a matter of you versus the controls more than anything else whereas I feel two was really designed around clever um jumps and",
            "start": 1382.24
        },
        {
            "text": "the book Booka it's like all right this game is simple this now it's just a matter of you versus the controls more than anything else whereas I feel two was really designed around clever um jumps and clever uses of the environment to get where you needed to go and if if there was something that you saw and you couldn't get to it it's because at that moment you're not thinking correctly it's not because oh at some point I'm going to come back and I'll have a new ability you know yeah well even in Crash one they uh Naughty Dog did such a good job back in the day of like because you didn't know this stuff unless you read the manual and no one read the manual um so that's why I like vicarious Visions kind of un loading screens putting like oh like a little hints on how to do it but like on Crash one uh there's a couple times where um you just see a trail of WPA fruit going off into the sky and if you just walk toward it a path like little things like that that make the game so much",
            "start": 1422.84
        },
        {
            "text": "on Crash one uh there's a couple times where um you just see a trail of WPA fruit going off into the sky and if you just walk toward it a path like little things like that that make the game so much deeper and then on top of the death routes um getting past the level uh without dying to get on that to get the boxes because before you didn't know that that that's how you unlock them and you get through the level and you're like I missed 30 boxes like I got everything boxes go yeah I also like that in this uh in the remastered version the bonus levels don't count as lives so you can repeat them as many times as you need to cuz those are really challenging and if you miss the boxes there of which you're probably going to do it on your first try because it they purposefully trick you to jump on things that are going to disappear the next time you jump on them and I like that now you can repeat the bonus rounds as many times you need to get all the crates to get the gem in each level yeah",
            "start": 1460.24
        },
        {
            "text": "on things that are going to disappear the next time you jump on them and I like that now you can repeat the bonus rounds as many times you need to get all the crates to get the gem in each level yeah they did a brilliant job of like updating it for like people who don't want to kill themselves playing game yeah no that's really true and honestly I think that's the the biggest credit to the game is the fact that the vicarious Visions really committed to this this was remade from the ground up and we all laughed when they first said that because it was just like there's no way this is going to be just a remaster and they're going to call it a day they put so much care into making sure this felt exactly like the original games did but fixing the things that needed fixing uh the one gripe I have is that visually it looks awesome and I love that it really looks like a Saturday morning cartoon and forever people would talk about games looking like a Pixar movie this looks like a Pixar with",
            "start": 1501.4
        },
        {
            "text": "is that visually it looks awesome and I love that it really looks like a Saturday morning cartoon and forever people would talk about games looking like a Pixar movie this looks like a Pixar with the r clink in exactly which is awesome however I still feel like this game lost a bit of the luster and visual uniqueness that the original games had uh because the original ones had that kind of like gritty dark feel to them and this is super just bright and colorful and Looney Tunes almost even how like uh like when the bosses come up and they talk how they changed like the dialogue just ever so slightly I was like H this it feels it feels wrong like not having his stupid ass laugh that threw me off and then like the scientist gu is not having the willham screen oh yeah but I think that see that's all just licensing stuff like that love how they got as many of the original voice actors as they could I thought the soundtrack was fantastic like it's the original just updated I was worried",
            "start": 1537.72
        },
        {
            "text": "that's all just licensing stuff like that love how they got as many of the original voice actors as they could I thought the soundtrack was fantastic like it's the original just updated I was worried about the voice actors at one point because um if you look through them a lot of them are from Crash of the Titans crash mind of the Moon I was like I don't want anything to be at all yeah I know well he was he was in Twin Sanity which is like underrated Twin Sanity is very underrated underrated that is a good game you that's you laugh out loud T Twin Sanity is arguably better than three than three yeah I I agree with you but that that's a story for a different day um but overall I think that the game is is fun and I'm a little disappoint that the originals aren't unlockable at least I haven't unlocked them and I don't think that they're they're anywhere in there but cuz I feel like that's something that they they should do you know tell me about the Uncharted references uh they're so few",
            "start": 1584.48
        },
        {
            "text": "unlocked them and I don't think that they're they're anywhere in there but cuz I feel like that's something that they they should do you know tell me about the Uncharted references uh they're so few and far between and it's not even a blink and you'll miss it thing it's like if you're not looking you'll miss it there's a when Koko is looking at her laptop and I think it's the beginning of Crash 2 super meta on the the beach she's looking at a video of Elena and Drake playing Crash one gotcha U there's that and then there's a picture of Nathan in um the Bandicoot household yeah just kind of there so just subtle little so then for you guys as I mean you're streaming forward are you how is the Platinum or how are the platinums and then are you thinking about going back for the platinums are a challenge but they're achievable I honestly for me just looking at the trophy list I'm like this is is what Platinum 3 games should be and the fact that it has three I'm not a trophy guy like that",
            "start": 1628.04
        },
        {
            "text": "a challenge but they're achievable I honestly for me just looking at the trophy list I'm like this is is what Platinum 3 games should be and the fact that it has three I'm not a trophy guy like that but it does entice me to play these games more I was never one of those people that went and got all the gems and the relics and all that um but the fact that this that they added relics to Crash one uh definitely makes me want to play it more and the fact that the trophies it's like it's the breadcrumbs that give me extra challenges that I'm like I've played these games a bazillion times but I never played them like this and I I want to and the fact that they put the extra passion in care makes me want to give them more time it's a difficult Platinum yeah um well not difficult it's it's one of those ones where it's like you want to keep going I think it's a fun one to just like I said put in like your phones just kind of out uh the time trials are super fun uh just running through the",
            "start": 1672.52
        },
        {
            "text": "of those ones where it's like you want to keep going I think it's a fun one to just like I said put in like your phones just kind of out uh the time trials are super fun uh just running through the level are times like totally obscene or are they like they're that's it's perfect they're like doable they're like tough okay and that's why I like you're going to take shots at over over you're going to you're going to get mad because you're going to miss them a couple times but once you land it it's probably the most satisfying thing okay it's a fun Platinum it's three fun platinums and that's what I'm excited about one is going to be a little hard just because the controls aren't all the way fixed yeah uh I found myself using the D-pad on Crash one me too which was really weird only on some levels though it wasn't all of them like uh Road to Nowhere and slippery climb the two **** hardest levels see but that's the thing is there's some things about the game especially Crash one there",
            "start": 1711.72
        },
        {
            "text": "levels though it wasn't all of them like uh Road to Nowhere and slippery climb the two **** hardest levels see but that's the thing is there's some things about the game especially Crash one there was a lot of just enemies coming at you over and over where Crash one didn't focus on platforming enough cuz it was back in the early days when they didn't know what a 3D platformer was so they were just like all right cool we're just going to kind of mimic what Mario or Sonic did in 2D my dude Sonic um your dude and we're just GNA like it's just going to be like the three glomas come in Mario that's fun what and then in huh the three Goombas coming Mario mar a lot of the times the goomas coming three coming Mario you see saying like they come they come in threes where it's like you you jump over them like huh he didn't like erotic fiction like coming inside of Mario yeah no you're nasty um but they did that there's a lot of times especially in Crash one you don't see it in Crash two and",
            "start": 1745.68
        },
        {
            "text": "over them like huh he didn't like erotic fiction like coming inside of Mario yeah no you're nasty um but they did that there's a lot of times especially in Crash one you don't see it in Crash two and three where there'll be like the turtles and there's like three that come at you or the skunks and there's three that come at you and they're not fun to to jump around that you just spin hit one of them and hope you kill the rest of them um did you guys feel the updated stuff made it easier like Crash one seemed so much easier 100% but it's still frustrating because there's still a lot of level design issues in Crash one it made it reasonable okay so before on Crash one uh you missed a jump you're like this game is **** stupid like I this jump is off like it just feels floaty and weird they made it to where it's where now it just takes skill like you have to you have to make that jump you have I that was the thing with me in Crash one where yeah the first time I died on a jump running",
            "start": 1786.2
        },
        {
            "text": "made it to where it's where now it just takes skill like you have to you have to make that jump you have I that was the thing with me in Crash one where yeah the first time I died on a jump running away from the boulder or whatever I think it was like or no it must have been earlier than that but you know what I'm talking about running away from anything and jumping over the thing the first time I missed it the second time I just held it longer I was like oh okay whereas in Crash one I never I don't ever think I had that Eureka moment where it was like in Crash one it was always like I don't understand why I'm falling in this **** hole I mean the controls aren't literally just kind of added the analy like that that is the biggest control fix that they did they didn't actually like tweak any the Jump's the same as the jump was the speed the same as the speed was it might be a visual maybe yeah I think it is a visual queue more than anything is just because it everything's brighter",
            "start": 1826.0
        },
        {
            "text": "any the Jump's the same as the jump was the speed the same as the speed was it might be a visual maybe yeah I think it is a visual queue more than anything is just because it everything's brighter yeah so and they they route you a bit more and I think with enemy design uh the one thing that I think that made Crash one a lot easier now is the fact when you look at an enemy you have a better understanding of how to beat him whereas in Crash one it was so and like I'm not is that fire on his head or is that a hat I don't know whereas with this one it's very clear because the graphics are so you know where they're at that it's like all right I understand they are in F on the PlayStation 4 Pro it looks it looks great yeah U the loading very bad in the beginning of G what is up with having to sit through that vicarious Vision screen every time oh see that's **** aesome you sit through it yeah the first time it did I was like okay no big deal and this morning I boot it up I was like what",
            "start": 1862.48
        },
        {
            "text": "sit through that vicarious Vision screen every time oh see that's **** aesome you sit through it yeah the first time it did I was like okay no big deal and this morning I boot it up I was like what the f I can't skip this here's there's there's two things one is the when it goes to the loading screen before the actual menu comes up that's **** **** it takes way too long like for me it's been like 45 seconds each time and I'm like every single time to get into the games that should not be the case it's 2017 these games shouldn't be taking that long no to get to the the screen to choose which game I play that's a problem but loading this game up and having it do the the unskippable unskippable vicarious Visions like and having it be Neo Cor from the studio I'm like this is **** it's a throwback thing which I piss people off but no man that **** is awesome throw you back at **** GameStop is what I say oh it's great it is great I love it U got me so hyped when I turned it on",
            "start": 1907.88
        },
        {
            "text": "a throwback thing which I piss people off but no man that **** is awesome throw you back at **** GameStop is what I say oh it's great it is great I love it U got me so hyped when I turned it on and had that but um overall I do really enjoy and I feel like we're hyping on a lot of the negatives but in my opinion there is a lot of negatives like I think that it's important to realize that these games are relics stuck in a different time but bringing them here I feel like they're worth playing to at least know where things were and I want to say that Crash 2 is a great game from start to finish it is it's super awesome the level design is great and it's totally worth playing and this is one thing I'd say to you I'd say at least yeah Greg Miller get to uh the second warp room in the second one and try to get the gems and see if you have fun yeah and just and just try to get the gems I totally was this morning I was like oh I'd play more of this yeah get the boxes because I actually",
            "start": 1951.64
        },
        {
            "text": "one and try to get the gems and see if you have fun yeah and just and just try to get the gems I totally was this morning I was like oh I'd play more of this yeah get the boxes because I actually think that would be a fun Platinum for you to grind out the only thing that would be annoying is the relics getting all the relics relics are the time trials when you just have to open all the crates the level um so you wouldn't be able to live with yourself if I got all these platinums you didn't would you piece of garbage if you did it I'd do it oh yeah I'd **** do I mean I'm I'm considering it as I'm playing through but it's kind of like what you're saying of like I like the idea of just having something to do to just pop into grind out I wish it was on the switch to do that but then I wouldn't have trophies this is exactly yeah Sophie's Choice Sophie's Choice man a lot of issues here that' be great every PS4 could be a PS not when I'm on the goddamn air anyway let us know what you think",
            "start": 1992.2
        },
        {
            "text": "have trophies this is exactly yeah Sophie's Choice Sophie's Choice man a lot of issues here that' be great every PS4 could be a PS not when I'm on the goddamn air anyway let us know what you think about Crash Bandicoot's insane Trilogy in the comments below we got some questions here about crash this is from Justin Washburn with the upcoming release of Crash insane Trilogy what do you guys think the odds are for a Crash Team Racing remake thanks for reading my question PS by the damn Trilogy damn sa the cot um I I don't know we we've been talking about this a lot on the shows where it's like I do feel like if this game does well we will see either Crash Team Racing a new Crash game or the Spyro Trilogy remastered now I think you're overlooking something here the game is selling well it's sold out on Amazon like it's uh today it just got back in stock it was sold out all of June sold out on Amazon US it was the number two bestselling item on uh Amazon Japan and number three in the UK",
            "start": 2026.8
        },
        {
            "text": "sold out on Amazon like it's uh today it just got back in stock it was sold out all of June sold out on Amazon US it was the number two bestselling item on uh Amazon Japan and number three in the UK hell yeah the thing's selling so we got to keep it selling so that we can get one of these things but do you think we'll get Crash Racing? Yes because I think these are the guys who did Crash Nitro Kart like they've done a Crash CTing game that was it was good I liked it it wasn't Crash Team Racing though no it wasn't but I mean what games are I mean that's true but I don't know about this like they I mean they did such a good job with this no yeah Double Dash guys no Mod Nation Racers the best C racer Mod Nation Racers is good thank you it is good I'll give you that it's not Crash Team Racing I hope it happens cuz that I'm more excited for that than I am this I never played Crash Team Racing and I love **** cart Racers I would love them to remas you'd get down with so I think it is",
            "start": 2074.6
        },
        {
            "text": "I hope it happens cuz that I'm more excited for that than I am this I never played Crash Team Racing and I love **** cart Racers I would love them to remas you'd get down with so I think it is more of a possibility than people are giving it um um credit for but I do think that we' probably see a Spyro collection before um the crash but that's another thing is that coming from Vicarious or are they going to give that to another yeah I really don't know from talking to uh Dan the director of Crash Insane Trilogy anytime I bring up Crash Team Ring with him which is often like he never says no and he like he definitely like leaves it open in a way that I'm like you could have shut me down and you didn't so I'm like all right cool there's definitely that so you're saying there's a chance well honestly um I want to see I before I was very much like you going into this I was like all I want is just these three games just UPR is like this after playing these and seeing how much detail and",
            "start": 2119.28
        },
        {
            "text": "honestly um I want to see I before I was very much like you going into this I was like all I want is just these three games just UPR is like this after playing these and seeing how much detail and how much care they put into these games I think we owe it to them to see them do their own that is and I trust them now I can't believe it because I actually agree with you saying this where I never would have thought I'd want another Crash Bandicoot game like I'm like just give what really we got it's like dude like they they they just don't work now and that was weird the lights in a weird thing come um Crash 1 through three I all I wanted was what they gave me which is this remastered series for me to to kind of have our have our experiences again like the games that we remember it's a very slow Undertaker entrance like things are slowly turning off and then he's going to come out but I agree that I think that they did a good enough job with this and it's like it's obvious that they",
            "start": 2161.68
        },
        {
            "text": "slow Undertaker entrance like things are slowly turning off and then he's going to come out but I agree that I think that they did a good enough job with this and it's like it's obvious that they understand what makes Crash work and it's also obvious that they didn't want to touch what was broken about it because that's what the games are and they want people to play these as remakes and I do think that they could do something interesting where like what they what retro did with Donkey Kong Country Tropical Freeze and returns where it's like all right people had issue with the original D Kong Country games but there was a lot of good there we could make something better and I feel like Crash could be good I think we owe it to them like on how well they treated the series so I'm I'm putting my trust in them that if they were to do one one I would be 100% on board because of how they treated this just don't give me Crash the Titans do the racing game yeah please do the RAC yeah do the",
            "start": 2208.04
        },
        {
            "text": "my trust in them that if they were to do one one I would be 100% on board because of how they treated this just don't give me Crash the Titans do the racing game yeah please do the RAC yeah do the racing game is **** **** all right then the next thing Icy Flames 96 looking at Crash Bandicoot Ratcheting Clank and Shadow of the Colossus doing remakes and remasters of old games that go far beyond your typical AGD remas it's been a recent trend for Sony do you think this trend will continue in the foreseeable future what games do you think Sony will rejuvenate next huh I want more of it I want more do you think it'll happen more do you think I I honestly think that if this game hits some certain level that I don't know what it is but in Activision and Son's mind and I don't know where the Partnerships and all that come in but there is definitely somewhere people are looking and they're like if it hits that bar Spyro hit the Spyro button it's happening yeah what else would you want to see",
            "start": 2245.36
        },
        {
            "text": "and all that come in but there is definitely somewhere people are looking and they're like if it hits that bar Spyro hit the Spyro button it's happening yeah what else would you want to see from PlayStation one catalog cuz I immediately jumped to siphon filter imagine I mean I'm again it's the whole thing of not a HD remaster a game from the ground up let's do siphon filter again one bends off doing Days Gone we do it to these people over here they get to go make it I think there's still something to siphon filter but it needs to either be rebooted super **** hard or just at least come out looking like mle Nostalgia thing for it where it's just kind of like hey if they did that it wouldn't be the trilogy I can see a siphon filter one yeah well at that point it's just might as well just reboot it and I feel like that's probably more likely I think that hey we we know there's a connection to this name you know Splinter Cell's still doing it whatever the **** Splinter Cell is doing",
            "start": 2285.2
        },
        {
            "text": "reboot it and I feel like that's probably more likely I think that hey we we know there's a connection to this name you know Splinter Cell's still doing it whatever the **** Splinter Cell is doing Metal Gear is not Metal Gear anymore there's a there's a whole we could fill with Gabe Logan I feel like I feel like Spyro and Crash are different and that I feel the same way about Spyro it's like I don't necessarily want a new Spyro game I just want the old Spyro games again and I think with siphon filters I don't want the old siphon filter I want a new siphon filter and that's the thing that would make sense right like I think the PSP games were so good because they were their own thing and they were different I they were awesome they were both really good well Bubsy's back so everything's off the table Bubsy all right it's time to get in the next segment this segment brought to you by Patreon producer Tom Bach what up Tom Bach bring back cool spot we got to make that happen um and I to",
            "start": 2328.92
        },
        {
            "text": "the table Bubsy all right it's time to get in the next segment this segment brought to you by Patreon producer Tom Bach what up Tom Bach bring back cool spot we got to make that happen um and I to be real Cool Spot sucks watch our let's play youtube.com/ Kinda Funny Games that sh's bad um weren't you picking up bottles and **** little bottle caps yeah yeah and also shout out to the Patreon thank yous of the month you guys supported us over on there's a lot of Patreon stuff in I know I just like that you do it the one time Kevin's not at his little thing so now you're going have to remember 30 everyone if you're watching live on the YouTube chat is one of the Patreon perks make sure you spam that over and over again rightk 3830 just Spam it over and over and over and over and over and over oh so maybe you're not watching on YouTube the segment is this week in gaming history where I look back at different things that happened on the week of June  0 like 5th to  0 9th okay Tim gy",
            "start": 2364.16
        },
        {
            "text": "over oh so maybe you're not watching on YouTube the segment is this week in gaming history where I look back at different things that happened on the week of June  0 like 5th to  0 9th okay Tim gy was more or to June 30th my birthday 3 years ago on June  6  014 Shovel Knight came out on the 3DS Wii U and PC w wow question about Shovel Knight here's what I'll put out cuz you're a big Shovel Knight fan love Shovel Knight obviously we like Yach Club guys they were always good to us Colin was a huge fan is a huge fan Colin's not dead he's very much laugh uh do you think they did a it was stupid of them to put out these games plague night and the other night as DLC cuz every time I talked to a I was a Shovel Knight fan wrote into games daily when we for a trophy time of like if you want to point out why trophies are broken another reason is the fact that these awesome full-fledged basically sequels of Shovel Knight came out and they get like two trophies because of the way it at works his",
            "start": 2407.64
        },
        {
            "text": "out why trophies are broken another reason is the fact that these awesome full-fledged basically sequels of Shovel Knight came out and they get like two trophies because of the way it at works his DLC yeah I feel like you would have had more of a pop more impact hey we have another game for you if you love Shovel Knight plague the plague Knight DLC was more similar to DLC than the Spectre tournament Spectre tournament sorry Spectre tournament is just a full new game it's a prequel yeah so I think that could have benefited from being marketed that way um whereas the pl wait plague plague of Darkness I think it was called it was the the plague KN DLC um was just good DLC yeah here's a new character there are differences to the game like a lot of differences that actually matter and the gam play is different and we we've changed the level design to to play differently um that but that just shows that Yach Club cares you know I hear you and I agree with you it's awesome to see Developers",
            "start": 2458.44
        },
        {
            "text": "play is different and we we've changed the level design to to play differently um that but that just shows that Yach Club cares you know I hear you and I agree with you it's awesome to see Developers take care of their fan bases and make these things and build on these games and I'm all for that I just feel that with the other one Spectre torment which is a full-fledged game blah blah blah let me dial it back marketing DLC and making the general public care about it and I mean General video gaming public care about it is impossible no one's done it well it just doesn't happen I this is what I talked about this past week already on Games Daily everyone is sleeping on Uncharted the Lost Legacy that is a full-fledged Uncharted are putting on another Uncharted a little bit shorter you know 10 hours they're saying which will mean probably eight or whatever but they're putting on a full-fledged **** Uncharted and nobody gives a rat's ass about it you know what I mean no E3 awards for it",
            "start": 2504.84
        },
        {
            "text": "hours they're saying which will mean probably eight or whatever but they're putting on a full-fledged **** Uncharted and nobody gives a rat's ass about it you know what I mean no E3 awards for it it's not getting it's like whatever it's cool it's more Uncharted whatever oh oh you're doing this now it's like that game's going to come out and it's going to for Uncharted fans people are be like holy **** when I talk to them about it when they tell me stuff that's in this game when I see the demo when they get up there and they spin the camera around I'm like this doesn't look like DLC I'm like oh no well it's coming on a disc it's doing these different things it's got the whole Uncharted Suite I'm like I'm going to jump ahead of bit into our first user question today cuz it relates to this this is from strand Vander Warf why will Uncharted release a standalone DLC and Horizon not what's the benefit of having a non-standalone DLC why the different strategies just don't even call them",
            "start": 2549.6
        },
        {
            "text": "this is from strand Vander Warf why will Uncharted release a standalone DLC and Horizon not what's the benefit of having a non-standalone DLC why the different strategies just don't even call them DLCs Uncharted I think painted themselves in a corner which they talk about every so often kind of in the way of like hey our season pass has story DLC to it then they start working on it and it becomes this monster of a holy **** this is like a real game awesome they're still on honoring it they're selling it for 40 bucks but if you have the season pass you still get it that way it is this question of though what is the scope of that how do you get people excited for it what and I don't know how you deal with that I think it's a little not apples to oranges I guess but I feel like the window and correct me if I'm wrong anybody who's watching the window between Horizon and their DLC announcement was shorter right Horizon comes out in February here we are in what the beginning of June",
            "start": 2584.2
        },
        {
            "text": "and correct me if I'm wrong anybody who's watching the window between Horizon and their DLC announcement was shorter right Horizon comes out in February here we are in what the beginning of June finding out about it Uncharted was what that was a video May came out in May yeah and then it was a VGA or was it PSX well I guess it doesn't matter either way G is when we first saw it yeah so it's not that much of a difference a little bit longer I don't know I feel like the fact that Horizon is more of a mey RPG I think people spent more time in that world and were are hungry for more quests to that world whereas Uncharted is a story based narrative and it's over when I'm done with I close it and I sell it back to GameStop or I don't I just put on my shelf and don't think about it so to get people REM motivated to go back to story DLC is different in the same way Left Behind was different to get people into it I just think that like even even comparing Lost Legacy to Left Behind is at the",
            "start": 2621.64
        },
        {
            "text": "REM motivated to go back to story DLC is different in the same way Left Behind was different to get people into it I just think that like even even comparing Lost Legacy to Left Behind is at the detriment of what Lost Legacy is doing Las Legacy is a full **** game like from everything I've heard maybe I'll get it and it'll be four hours long and I'll be wrong but I don't think that's what Naughty Dog has been selling and I don't think that's what they'll do and so that's the question of like I hear you for Yacht Club games we want to be great to our fans I feel like though it's very similar to how our fans are our audience is right of we want to help you succeed I think if Yach Club was was like and I don't mean I don't know what they're if did they have a season pass I don't know if that well I mean it was if you bought the game you had everything yeah there was it was free I guess that and that's the whole thing I think you should start shooring yourself Y Club games yeah for",
            "start": 2660.84
        },
        {
            "text": "that well I mean it was if you bought the game you had everything yeah there was it was free I guess that and that's the whole thing I think you should start shooring yourself Y Club games yeah for Shovel Knight if you bought Shovel Knight original that's the thing their whole thing was like all the there's going to be a lot of DLC it's going to be real substantial DLC and it's all going to be free then what they ended up doing was they uh and I'm going to get some of the names wrong on this but they came up with something called like Treasure Trove they gave names to each of the games like the even the original one uh the original Quest or whatever and you could buy them as separate games going forward so no longer if you buy the one you get all now there's a package you buy that that has the whole I just feel like some people are taking their games and acting and this isn't an insult I hope acting like their World of Warcraft where oh a Shovel Knight fan is so dialed in and so into",
            "start": 2700.52
        },
        {
            "text": "the whole I just feel like some people are taking their games and acting and this isn't an insult I hope acting like their World of Warcraft where oh a Shovel Knight fan is so dialed in and so into it that they're going to be knowing that this DLC is there no you don't even know I'm assuming you played Shovel Knight right everybody I didn't play there exactly and but you didn't know that you have access to all this DLC or all these different things I think if they would have been and again this is shoting yourself in we want to be good to our community want there's a million different things to do here I do think it would have been a smarter business decision and then again as somebody who likes Yach Club games I I'm fine with it now I'm not the hardcore community of like I want the free stuff I I agree with you completely and I just think that the the difference is there's a a lot of learning going on in game development right now and I think that Naughty Dog is a perfect example of",
            "start": 2734.72
        },
        {
            "text": "stuff I I agree with you completely and I just think that the the difference is there's a a lot of learning going on in game development right now and I think that Naughty Dog is a perfect example of they didn't expect Los Legacy to be what it is and they just now have to deal with the fact that it is I'm sure that if they could have pumped out uh Nathan Drake or whatever some story DLC for Uncharted for and been like well that's what you were getting now this is a full game **** pay for it they would but just development wise and timing wise especially on a talent level that high like you can't just turn something around like that so they're stuck in in the the track that they're going when it comes to Yach Club I think it was different where they just kept going then they had so much fun then eventually when it came to play Down they're like we're just going to make this whole thing and you're right that if they marketed that as just Shovel Knight zero or shovel like like whatever",
            "start": 2770.24
        },
        {
            "text": "then eventually when it came to play Down they're like we're just going to make this whole thing and you're right that if they marketed that as just Shovel Knight zero or shovel like like whatever whatever they were doing um I I feel like there would have had to have been a number in it to to like really set the difference because they did Market it as a separate game that you could get all these different ways but I think but then people like Oh that's oh it's just DLC but that's what I'm saying I feel like you needed the number there to to make it feel like a different game even if the number was Zero uh because it's a prequel but uh what I think Yach Club does where because you're saying the fans that want to support them I would argue that there is no modern game modern that was bought on more systems by the people that really care shelite is the type of game that I own on like three different systems you know and I'm sure there's so many other people that did that especially with",
            "start": 2809.08
        },
        {
            "text": "on more systems by the people that really care shelite is the type of game that I own on like three different systems you know and I'm sure there's so many other people that did that especially with the Nintendo switch now where it's like I I want to play it again again just cuz I can you know and just because that well also the plague night was uh exclusive to early exclusive to switch for a month so there's things like that that I'm sure the Yach Club are going to rethink their strategy for the next thing that do but I also wouldn't be surprised if the reason that the roll out plan was what it was is because they were just working on this and their next thing is going to be different and they didn't think that this was substantial enough to treat as its own relas and hey that's the thing it's your business it's your way to run it I just I just worry about the fact that I feel like it's so hard to get coverage for a game at somebody who you know worked in covered games for so long",
            "start": 2850.44
        },
        {
            "text": "it's your business it's your way to run it I just I just worry about the fact that I feel like it's so hard to get coverage for a game at somebody who you know worked in covered games for so long once your games out interest drops off so radically unless you're a Minecrafter or whatever you know what I mean yeah and I'm I'm talking about beyond the first few weeks Pro proof that you're right about that is the fact that Shovel Knight uh plague of I I'm keep **** up the a like a torment no no Shadow T Spectre of Torment Spectre tourament Spectre tourament came out that's the one that I love um and it came out exclusively on the switch for I think a month and this was within days of the switch launching yeah and it didn't get reviewed on Gamespot didn't get reviewed on IGN until later and I'm like the fact that there was nothing on the switch at that point except Zelda yeah and it still didn't get mainstream press coverage that means that even those guys don't understand this is a and",
            "start": 2890.72
        },
        {
            "text": "I'm like the fact that there was nothing on the switch at that point except Zelda yeah and it still didn't get mainstream press coverage that means that even those guys don't understand this is a and that's the thing I'm trying to wrap your messaging around that and that's what Uncharted is facing too where they have to try to Bang the Drum and express to people like no no no this isn't this is bigger than story DLC you can get it in store blah blah it's just like can of worms five years ago on June  6  01 spec Ops the Line came out Williams what Xbox 360 man what a game see five years ago that sounds right to me for spec ops I would have thought it was even longer ago yeah yeah that felt like whereas uh shovel D 3 years ago I'm like that's getting that's weird that sounds like a long time it feels like a long time ago doesn't it yeah 13 years ago on June  8th  004 Spider-Man   yeah came out on the PlayStation   and that was a game Chang the first time open world Spidey and it felt",
            "start": 2931.96
        },
        {
            "text": "it feels like a long time ago doesn't it yeah 13 years ago on June  8th  004 Spider-Man   yeah came out on the PlayStation   and that was a game Chang the first time open world Spidey and it felt right the first Spider-Man game on PS  no awful garbage on the inside I was a dumb kid though really yeah I was a dumb kid the movie I haven't gone back yeah I haven't gone back yeah you fight Green Goblin in like the the burning house or whatever at the end it's like terrible Spider-Man   man Jesus Spider-Man   so good I bought it played through it loved it got the kid the balloon the million **** times and all that **** sold it uh went out to Maryland for a summer and was like **** I went out and bought Spider-Man   again to play more Spider-Man   was like that good I was like **** that is awesome very special game and I love that the people making Spider-Man on PS4 now are in love with that game as well in love with what made that game it's just so weird that like they had it and",
            "start": 2976.88
        },
        {
            "text": "is awesome very special game and I love that the people making Spider-Man on PS4 now are in love with that game as well in love with what made that game it's just so weird that like they had it and like it was so hard to ever catch that again I remember Spider-Man 3 coming out I was so excited to review it for IGN because I was keev loved it I was like hey man like I'm sure it'll be like Spider-Man   and like the story will be **** but and like but I'm like no this game's just bad all over it's just not good and even Ultimate Spider-Man wasn't Ultimate Spider-Man Ultimate Spider-Man wasn't bad but it wasn't the same either which is the problem you know what I mean it was a smaller yeah it was small it was Canon it was that's cool that's cool 17 years ago on June  6  000 Kirby 64 the Crystal Shards came out on the N64 I remember being so excited for that game this is one of the first games that I like kind of looked at I'm like all right there's a release date I'm counting down the",
            "start": 3023.0
        },
        {
            "text": "Shards came out on the N64 I remember being so excited for that game this is one of the first games that I like kind of looked at I'm like all right there's a release date I'm counting down the days it's going to come and then it it happened and I remember beating it in like one sitting and being like that's it oh man that's when you learned hate ah no I I enjoyed it but that was when I learned what a good game was yeah you know I me I was like oh man this is the one of the I think it might have been the first time I played a new release that I was like oh I don't just love this video games aren't always pure magic there's there's some sometimes it's steing mediocrity in there 17 years ago on June  9th  000 Diablo I came out on PC 17 years David what up yeah man what a long time I remember I never got into the PC game and stuff could course not yeah you do want to play my my neighbor that lived across the street we'd always go to his house and his older brother was obsessed with these",
            "start": 3065.28
        },
        {
            "text": "I never got into the PC game and stuff could course not yeah you do want to play my my neighbor that lived across the street we'd always go to his house and his older brother was obsessed with these things and I remember Diablo I was like the he he didn't he had a little buzz cut but uh he he loved it so much and would try to sell me on Diablo I and like that was when I realized people can get addicted to video games sure sure a lot of realizations man we're going back in time this a little history lesson for you Kev 18 years ago on my birthday June 30th 1999 a lot happened June 30th Driver came out on Playstation Driver I was like I was like I don't even remember Driver Driver Driver on PlayStation that was a good one yeah and then on the Nintendo 64 Pokemon Snap and Mario Golf ooh wow what a **** day God damn I remember that day I rented both games yeah I was lucky enough I was like I must have been just first in line or whatever cuz they never let you do that yeah there always all",
            "start": 3113.52
        },
        {
            "text": "a **** day God damn I remember that day I rented both games yeah I was lucky enough I was like I must have been just first in line or whatever cuz they never let you do that yeah there always all the copies would be out of the new game you have to wait and **** nah Pokemon Snap played the hell out of it not much there if I'm being honest with you but you Lov it I love it I did love it I still do love it but like all the people oh man we want a new Pokemon Snap no you don't they were dumb kids when they played it they were and uh if they went back to it now probably would enjoy it there's a way to make it cool though there is there's a way to make a I mean Pokemon Go should have just been Pokemon 100% but yeah it coming out on the Virtual Console on the Wii U a couple months back I played it for a bit I'm just like man like it's a great game when you when you're trying to 100% it cuz there is a lot of fun to be had there but otherwise it's like man there this isn't really a game",
            "start": 3166.64
        },
        {
            "text": "it for a bit I'm just like man like it's a great game when you when you're trying to 100% it cuz there is a lot of fun to be had there but otherwise it's like man there this isn't really a game yeah uh but then Mario Golf yeah got down on that then you with Mr Toad stool tour yeah one day that'll make it to this here Gamescast I can't wait for to come up there I can't wait for whatever Mario Golf comes to Switch next I can't wait for Everybody's Golf what up August can't wait I booked an all day stream by the way when everybody go Everybody's Golf comes to PlayStation 4 play as Shu yeah they better **** keep that in there and then 19 years ago on June 9th 1998 Banjo Kazooie first came Nintendo 64 little Marty Seve was so excited it still had a beard so that's a a good segue to our topic of the show Dots Dots it wasn't Crash huh well I mean that that's what I'm going to headline as this okay yeah of course yeah that's what the kids want from you the top of the show for this there's a",
            "start": 3204.16
        },
        {
            "text": "of the show Dots Dots it wasn't Crash huh well I mean that that's what I'm going to headline as this okay yeah of course yeah that's what the kids want from you the top of the show for this there's a lot of questions I saw that had a common theme and that theme is Platformers so we had Crash Bandicoot Banjo Kazooie is there Mario Odyssey Sonic Mania Crash Bandicoot and Bubsy Platformers back joke skis wants to know yes honestly with platforms being one of my favorite genres if not my favorite genre agreed this is the best year that I've had in a long time for video games getting all of these like crash exactly what I wanted I knew what it was I didn't expect it to be a 10 out of 10 Mario Odyssey from what we played seems to be Mario Odyssey's dope as F uh the a 3D open world Mario that we haven't gotten since 2001 and that blows my mind uh Bubsy could give a **** L that's trash um but Sonic Mania damn that game is going to be so good so good yeah that game is what we were talking",
            "start": 3248.32
        },
        {
            "text": "we haven't gotten since 2001 and that blows my mind uh Bubsy could give a **** L that's trash um but Sonic Mania damn that game is going to be so good so good yeah that game is what we were talking about earlier with crash about not wanting a new one this Sonic is that new one of the people caring and it's going to be better than any I'm calling it now it's going to be the best Sonic game ever made wow I think that's an easy no good Sonic game yeah do you like any Sonic game uh no none no have you played yes I have oh my God trash and you crash yes they're not the same game don't even put them on the same pedal here I mean you're right like I would I would say that their Sonic games better than the crash no there's no way this is all starting to make sense how could this 1 -year-old afford to come on this show oh my God Colin Moriarty isn't here to talk **** about Sonic anymore and suddenly has money coincidence coincidence hold me back oh my God no honestly I do think that",
            "start": 3291.88
        },
        {
            "text": "afford to come on this show oh my God Colin Moriarty isn't here to talk **** about Sonic anymore and suddenly has money coincidence coincidence hold me back oh my God no honestly I do think that Platformers this year in 2017 are seeing Resurgence that we haven't seen ever had time and uh yeah exactly things like that and Yooka-Laylee as well like even so they're not all hits necessarily even Yooka-Laylee was good like it was a good game but not a great game yeah so that's what I'm saying I think the Sonic is going to be the first good 2D one and then obviously Mario's going to come through in cleanhouse at the end of the year godamn Mario yeah I think we're I think people are realizing that there is space for uh these Platformers in 2017 and the uh they're not there like they just didn't exist like from the PS2 to the PS3 they just went away other than the Mario games Ratchet and Clank but even that's a little bit different cuz that's not a platform platform it's more just like action fun and I'm",
            "start": 3340.4
        },
        {
            "text": "from the PS2 to the PS3 they just went away other than the Mario games Ratchet and Clank but even that's a little bit different cuz that's not a platform platform it's more just like action fun and I'm excited because I'm like you like this is probably my favorite genre of games and because it's something fun that it's not this story based thing it's not like the serious thing it's something you could just kind of turn off your mind and just kind of go and just gameplay and challenge man I'm all about and that's why Shovel Knight was so fun to me is that it did things right and Sonic Mania reminds me of that in a lot of ways where it's just like all the good about it none of the bad and let's just keep moving forward you forgot Super Lucky's Tale on the Xbox One it is super lucky I I'm not even going to touch that it looks it it's on the border it's almost too kid yeah did you play it was it playable on the I don't I don't know if it was it was playable there yeah I think yeah but no I um is",
            "start": 3389.76
        },
        {
            "text": "to touch that it looks it it's on the border it's almost too kid yeah did you play it was it playable on the I don't I don't know if it was it was playable there yeah I think yeah but no I um is this just a you think a byproduct the cycle of everything and like Nostalgia for this is what people have been missing people have been missing a platform where you could l obviously found an audience on Kickstarter Mario is going to be Mario but we're also stoked that a true Mario is back I mean I think that the the Mario thing you just brought up is very important because I feel like there's a a lot of jaded games journalists that have looked at Mario the last couple years and not really had many nice things to say I think people wrote off 3D World that's good way way too hard because it it's great 3D World is **** fantastic however it's not the same style as 64 um or even Galaxy and I think that that turned a lot of people off so a lot they're all jumping back on uh with Odyssey but I",
            "start": 3426.72
        },
        {
            "text": "great 3D World is **** fantastic however it's not the same style as 64 um or even Galaxy and I think that that turned a lot of people off so a lot they're all jumping back on uh with Odyssey but I think that Odyssey is interesting where even for me as someone that loves it having played it I'm totally in I know this is going to be one of my game of the years guarantee it however I feel the same way playing at E3 that I did about Breath of the Wild when I played Breath of the Wild last year D3 I was like I don't know this isn't perfect to me and I feel the same way about Odyssey where it's like the gimmick of this game is being able to control the other things I don't know that that's exactly what I want but I leave that up to Nintendo to tell me I'm **** wrong and slap me in the face wow okay you know with Mario's hat Cappy Cappy you think there's gonna be a Twist is Cappy a bad guy he ghost yeah C definitely you you see those eyes yeah cuz my thing is he has the same eyes as",
            "start": 3471.36
        },
        {
            "text": "wow okay you know with Mario's hat Cappy Cappy you think there's gonna be a Twist is Cappy a bad guy he ghost yeah C definitely you you see those eyes yeah cuz my thing is he has the same eyes as those bunnies those bunnies look like bad guys can't trust those bunnies bunnies in the trailer for Odyssey he's possessing people as a hat yeah I mean that is an interesting thing it just seems like no it won't beend said it was not possessing yeah I'm sure they did I like that I think it was Nick Robinson who put out the thing the fake quotes of just like and like asking like is it is it killing people when it takes over their body Nintendo Yes is it painful incredibly that's so so **** funny uh Carl Zth says after seeing more audio Mario Odyssey at this year's E3 what are your thoughts on the real people to Mario character aesthetic also do you think this game will capture audiences with the same world creativity that Super Mario 64 did or will it fall flat in comparison I've never been",
            "start": 3518.08
        },
        {
            "text": "real people to Mario character aesthetic also do you think this game will capture audiences with the same world creativity that Super Mario 64 did or will it fall flat in comparison I've never been weirded out by the real people we made a lot of jokes about it when the trailer but like running around Newon City and doing it it's like it makes sense cuz they're blending into the background they're not like you know with the exception of like the music guy on top of the **** thing he needed to find like they're just like they're just there they're not the focus Mario's the focus I didn't think it looked weird I think it's a bad taste in a lot of people's mouth because of the 3D Sonic games having that aesthetic and those were trash so it's just like oh that reminds me of Sonic 06 or Sonic Adventure or whatever and it is bad yeah playing through it they do blend in so it's like that's not really the focus and I like that it's super different seeing the T-Rex is like what the ****",
            "start": 3561.8
        },
        {
            "text": "Adventure or whatever and it is bad yeah playing through it they do blend in so it's like that's not really the focus and I like that it's super different seeing the T-Rex is like what the **** this how is this Mario but I feel like it's that type of what the **** questioning that needs to go into a Mario game or else they're not doing it right people said that about Galaxy Sunshine yeah all of them they're right about sunshine somebody should have questioned that early on well Sunshine had a lot of issues but oh man yo why is he hanging out with all these melted ice cream people with a **** water pack on I don't know **** but I'm Miyamoto I don't have any issues with that at all recently on NeoGAF there was a thread that was like what is the worst level in Super Mario history and it turned into a big fight between no between a handful of levels um that the same ones kept getting brought up but it was just funny that like all 10 of the levels being brought up were from sunshine",
            "start": 3597.44
        },
        {
            "text": "turned into a big fight between no between a handful of levels um that the same ones kept getting brought up but it was just funny that like all 10 of the levels being brought up were from sunshine or not 10 that's that's an exaggeration cuz there wasn't even 10 levels in sunshine but um but that's because they're open world games like there's just not that many uh levels in these games cuz it's more about collectons and **** within them that's what I'm interested about Odyssey is that I wonder where it's going to fall because with Galaxy the Galaxy games there were so many levels yeah with fewer challenges in them and then with Mario 64 14 levels across the whole thing sunshine I think there was six or seven levels um with this we've already heard of six levels so that makes me think there is going to be a fair amount more I bet there's more but I think it's going to be Shock full of stuff I what did they said it's something something like 30 to moons per level yeah exactly and so",
            "start": 3636.12
        },
        {
            "text": "is going to be a fair amount more I bet there's more but I think it's going to be Shock full of stuff I what did they said it's something something like 30 to moons per level yeah exactly and so that's the thing of I think you'll get a dozen levels you think I think they got six more up there their sleeve up C I'm loving the creativity going to levels so far like I love that they all look super different and it doesn't all fall back on the normal tropes of here's the underwater world and here's the ice World whatever and even when it is the desert there's still some weird **** going on like where it's like an ice desert you know it's like why is there ice why is he cold that don't make no sense I love the way that they're um integrating the 2D into the 3D this time where it turns you into the Retro static like old school **** because uh the 2D levels in Mario Galaxy 2 were so so good where it played with the the gravity and we even saw this in the demo they showed to Mario Odyssey",
            "start": 3680.08
        },
        {
            "text": "the Retro static like old school **** because uh the 2D levels in Mario Galaxy 2 were so so good where it played with the the gravity and we even saw this in the demo they showed to Mario Odyssey where it does have some of those platforming bits where there's the where it **** with your gravity and I'm like man good keep going doesn't need to make sense just make the gameplay fun um but yeah I worry about some of the character possession stuff of those gimmicks not being fun to control um but I hope that I'm very wrong about that they're usually pretty good about that yeah well yeah and then with all these Platformers coming out going back to the question of uh are they coming back I mean all the these games are going to hit like it seems like they're hitting like especially with crash and the response are getting I think we're just on the tip of the iceberg I mean uh do you think we're going to get another Donkey Kong game from uh retro like is that what they're working on I",
            "start": 3720.8
        },
        {
            "text": "crash and the response are getting I think we're just on the tip of the iceberg I mean uh do you think we're going to get another Donkey Kong game from uh retro like is that what they're working on I don't think they're working on another uh donkey game I think that we will get one just not from retro or another theory I have is that I didn't talk about on Game Spot today uh is that retro is working on two games and if they were working on two games I think it's an easy answer to say yes they're working on a new IP and another 3D Donkey Kong game yeah I think it's also more likely that we'll see Donkey Kong uh Tropical Freeze make its way over to the Switch yeah really yeah I I hope to I missed it and I it looks like a phenomenal dude it's so damn good so and I feel like it'd be right at home on the Switch and I think that more people would enjoy it a lot going back to Odyssey though I like that Captain Toad in it yeah so hopefully we get some more **** yeah bring pour over track F",
            "start": 3762.64
        },
        {
            "text": "home on the Switch and I think that more people would enjoy it a lot going back to Odyssey though I like that Captain Toad in it yeah so hopefully we get some more **** yeah bring pour over track F but to to go off what you're saying it's right will they bring back Donkey Kong I don't think we'll see a Donkey Kong 64 like a a sequel to the 3D ones we don't need one um Sonic Forces I played it and it was a lot of fun at E3 and it reminded me of generations which is my favorite Sonic game in a long time so I don't know that we'll ever see another new 3D platformer make its way into the fry like new character or whatever I don't think that we need it **** that man it's back no no um but the ball is going to get rolling um and especially if that uh new Donkey Kong game uh like we talked about before with the Spyro collection I think we are going to start seeing these things get cranked up more and more and but that's the problem is like is only the first wave going to hit that's true",
            "start": 3800.32
        },
        {
            "text": "before with the Spyro collection I think we are going to start seeing these things get cranked up more and more and but that's the problem is like is only the first wave going to hit that's true cuz it's like all right cool they did they did it with crash they're doing with Sonic Mania and then it's like all right cool but then by the time we get to Spyro will there be the audience I do think there's the audience for Spyro there is I don't think there's an audience for B I don't think there's an audience for when you start getting into like the the more like Tumba or Gex the Gecko although shout out to Gex could come back does need to come back he doesn't need to come back I want him to be like a if Bubsy is back Gex is coming back if anybody needs to come back it's Bonk bring back Bon bring back Bonk I like that alliteration all right now it's time for the audience Q&A section of the show you can go to KindaFunny.com Gamescast and leave your question just like a lot of these beautiful",
            "start": 3845.64
        },
        {
            "text": "back Bonk I like that alliteration all right now it's time for the audience Q&A section of the show you can go to KindaFunny.com Gamescast and leave your question just like a lot of these beautiful people Mark wants to know do you think Microsoft can ever get back to rivaling Sony for first party games and/or console exclusives ever again of course and secondly no sorry do we need some dictionary definitions of all the new types of exclusives yes console time launch Etc yes uh yeah I totally think Xbox can get back in the race and VI for number one I don't think it happens till Xbox 5 whatever whatever the next cycle is that really begins I think that that's what I I'm I after watching you know this E3 After People wondering where this exclusive is what this studio is doing I think that's what they're doing I think that they're pulling a similar Nintendo Wii U Move of like all right cool like everybody bite down we're going to continue to take it on our chin right now as Xbox One/ Xbox One",
            "start": 3882.44
        },
        {
            "text": "they're doing I think that they're pulling a similar Nintendo Wii U Move of like all right cool like everybody bite down we're going to continue to take it on our chin right now as Xbox One/ Xbox One X and while we do that we're going to take Halo we're going to take the Gears games we're to take all these different people and have them start working on what will be the Xbox game what's going to be the next the next gen version of this so that at launch we can come out and be like hey here's all these games you're getting in the first year here's what other people are working on we have a slate we have exclusives we have this and we have the Goodwill of this Xbox community that has stuck it out and enjoyed games pass and enjoyed all these discounts and enjoyed what we have done with Xbox One X what what like what Sony did with the PS3 PS3 area when uh 360 was in the lead coming back and then all of a sudden PS4 is announced and oh yeah every single one of our first party Studios is",
            "start": 3932.12
        },
        {
            "text": "One X what what like what Sony did with the PS3 PS3 area when uh 360 was in the lead coming back and then all of a sudden PS4 is announced and oh yeah every single one of our first party Studios is working on a PS exactly yeah exactly now and now we're seeing them like get cranked out back to back my thing is it's a controversial statement but I don't think Xbox has ever rivaled Sony in its first party offering and I don't think that it ever will but I don't think that's what makes Xbox special I think Xbox and 360 especially worked because it it did have a couple of the first party titles but really it was about the third parties it was about the Partnerships it was about the online infrastructure that they had and that became the go-to system to play with your friends and that was what that era was all about is playing with your friends online and having communities and having the shooters to play which were either Halo but more Call of Duty and that's why I think that they won but",
            "start": 3973.44
        },
        {
            "text": "that era was all about is playing with your friends online and having communities and having the shooters to play which were either Halo but more Call of Duty and that's why I think that they won but leave Xbox the original Xbox Xbox 360 um and then Xbox One I think if you compare them to where PlayStation was at whether it's PS2 PS3 or PS4 I think that they had PlayStation always had a stronger exclusive lineup well it's not so much the lineup of games but the power and the um the force that those games have yeah in terms of sales like when you uh you and Colin were at IGN back in 2011 and remember when Sony did uh every month basically an exclusive game and I forgot who the the BET was but um he said Jim Riley that he's like all those PlayStation exclusives won't sell as much as Gears War gear war and I was like I'll take that cuz there was an Uncharted in there I'm like I'll take that they did and he **** yeah Gears ran away with that and like not even close if I remember like",
            "start": 4012.52
        },
        {
            "text": "War gear war and I was like I'll take that cuz there was an Uncharted in there I'm like I'll take that they did and he **** yeah Gears ran away with that and like not even close if I remember like Jesus yeah no I mean that that is a good point so I just think they have to retool I think um the were're worn out on these franchises they have so I think they're going back to the drawing board and they're retooling to come back with more Heavy Hitters and I think that's and it'll be the same thing where it's funny when we talk about you know PlayStation 3 to PlayStation 4 right like PlayStation reboots itself at that February event for the PlayStation 4 where they come out we're all about Gamers here's the system it'll be easier to develop for here all these Indies blah blah blah right that wasn't groundwork they had laid they hadn't become the PlayStation 4 were all about Gamers people yet until that day whereas with Xbox it can be the thing of they come out and they have a great E3",
            "start": 4062.28
        },
        {
            "text": "wasn't groundwork they had laid they hadn't become the PlayStation 4 were all about Gamers people yet until that day whereas with Xbox it can be the thing of they come out and they have a great E3 we'll say in years when they announc this thing or whatever their Xbox whatever event they announced this thing and suddenly not only are you activating me who's like oh wow that's a great slate of games I'm interested you're then activating all the Xbox faithful who have stuck with it in a very similar fashion to what we did when we did Beyond and stuck with PlayStation through that thing now Grant it was my job to stick with PlayStation but stick with it and be like hey no this is why PlayStation 3 is great here are all these awesome exclusives here's all this different stuff and suddenly you have Evangel and it'll be the same thing here if that's what they're doing where all of a sudden what are you talking about you have x00 uh backwards compatible games right now you have the games",
            "start": 4099.32
        },
        {
            "text": "you have Evangel and it'll be the same thing here if that's what they're doing where all of a sudden what are you talking about you have x00 uh backwards compatible games right now you have the games library that you're able to go do this thing for like there's enough thing here that enough smart decisions they've made that are Pro Gamer that you're going to sit there and go oh **** man that is really interesting maybe next generation's when to switch over it's the pendulum swing back and forth but do you see Xbox buying more Studios like do you see them acquiring or building kind of feel like they have to if if they want to have first party games and console exclusive but do they care about that and that's why I don't think that they do and I don't think they ever have because my thing is when you look at it and this the easiest answer is if Xbox were to make a Smash Bros game who would be in it there's not and it's like even playst struggled with Battle Royale but a lot of that",
            "start": 4133.68
        },
        {
            "text": "is when you look at it and this the easiest answer is if Xbox were to make a Smash Bros game who would be in it there's not and it's like even PlayStation struggled with Battle Royale but a lot of that was licensing issue stuff you know because they couldn't get a lot of things that defin we so close so close we could oh man one day go 100% yeah but that you see what I'm saying though it's just like when it comes to Xbox it's like they have their heavy or had at least their Heavy Hitters that sold Gears and Halo those things are going to sell ridiculous amounts but as the years goes on those sell less and less and less so I don't know next question comes from reverse flash oh no what do you think of Reggie's comments at E3 that Nintendo has plans to support the 3DS Beyond 018 has to sell for 3DS's in the holiday 017 with the most recent announcements of Metroid Samus returns and Mario and Luigi Superstar Saga being remade for the system if if they can keep quality games like this coming",
            "start": 4169.36
        },
        {
            "text": "3DS's in the holiday 017 with the most recent announcements of Metroid Samus returns and Mario and Luigi Superstar Saga being remade for the system if if they can keep quality games like this coming I think it's good news as long as Nintendo keeps a steady flow of both good games coming for both Switch and 3DS I mean Nintendo has done this every generation where they keep putting out games after the last thing ended it Sony does this as well too with God of War I coming out after PlayStation 3 came out it's like it just makes sense because of the install base 3DS has a great install base they are still selling games by the millions didn't and they just announced a new not just but recently announced a new TD yeah so they're going to keep going but uh Beyond beond 018 I don't see I don't see them ending that uh or like going with that in not hard way how hard they're going on 3DS I would have never bet on it going into the January event this year where they're talking about Switch",
            "start": 4215.0
        },
        {
            "text": "see them ending that uh or like going with that in not hard way how hard they're going on 3DS I would have never bet on it going into the January event this year where they're talking about Switch I'm like oh man they're making the shift over and it's like that was a a bad call on my part where it's like no **** they're not giving up on it of course Pokemon Stars just coming through yes it's business they're trying to make the money hopefully to then fund all the Switch games in 019 onward I'd be surprised if we'd see a major 3DS game get announced in 018 I agree well I think it's going to go the way of like the Game Boy Micro when they uh released the Game Boy Micro with the 3DS and uh just to see if like oh this bombs and we have at least our like core thing I think it's going to be the same thing yeah they're going to Dish the 3DS and then our final question of the day comes from Shawn Clarken oh after a month of funding Project R rabbit failed to reach 0% of its Kickstarter",
            "start": 4260.28
        },
        {
            "text": "the same thing yeah they're going to Dish the 3DS and then our final question of the day comes from Shawn Clarken oh after a month of funding Project R rabbit failed to reach 0% of its Kickstarter goal The Syndicate me finds it hard to believe that such a niche title with a lack of any tangible gameplay footage ever had a chance of raising over a million dollars however the latest update from the devs on their Kickstarter States we had a very very busy E3 filled with meetings about our vision and thanks in part to your overwhelming support we know that our vision for project rap rabbit hasn't gone unnoticed do you guys think that Kickstarter is being used by some developers to Simply advertise a project with the intention being to bring a publisher on board once the funding fails I know this might sound like some crazy conspiracy theory **** but hear me out do devs really want the burden of fulfilling sometimes unrealistic promised stretch goals and ultimately **** the bed Mighty",
            "start": 4300.68
        },
        {
            "text": "might sound like some crazy conspiracy theory **** but hear me out do devs really want the burden of fulfilling sometimes unrealistic promised stretch goals and ultimately **** the bed Mighty number N Style This Way project rabbit has had a ton of publicity gained interest from investors if you believe the latest post and most importantly made out of the Kinda Funny Games Daily Show talk I don't remember talking about oh that well I mean are people he's I think over complicating it like he's like you know are they using it as advertising to get picked up by when they fail to get picked up no they're using it as as advertising to get picked up by a publisher when they succeed how many Kickstarters have been launched to say we're this game we're independent oh well we're signing up and we're going to go have be published by Deep Silver whoever because they got a good and it's like no I'm not like Angry well I didn't give you the money so I'm not angry even E's doing with Blood",
            "start": 4347.68
        },
        {
            "text": "and we're going to go have be published by Deep Silver whoever because they got a good and it's like no I'm not like Angry well I didn't give you the money so I'm not angry even E's doing with Blood Stained right and I'm not sure what the wording was on that but it happens all the time where I'm making a game on Kickstarter and oh I'm going to get I thank you for your money and now we're going to go be the publisher da da da I mean that's the business side of it and it's been going on forever so there's case uh by case there I know as being judged differently but there is a proven track record that you can do that and the community doesn't Rebel and go crazy I mean I don't I don't know if I necessarily believe them that a lot of investors are super into it but again there's a Bubsy game who the **** knows whatever is possible in 017 I think these crowdfunded games need to go like I just think that if you make a good like prototype of game or a good game it will get noticed and will",
            "start": 4387.72
        },
        {
            "text": "the **** knows whatever is possible in 017 I think these crowdfunded games need to go like I just think that if you make a good like prototype of game or a good game it will get noticed and will get picked up like funding these games there's a reason they're not getting funded I don't think it's because they're being overlooked I just think because they're not the vision's not all the way there they're not the caliber they need to be to make that kind of Splash right the world has changed since when D devil find did this you know when they were the only people to do you're like what the f I mean how many others have we seen Dennis Dak all these different people come out and do this and just they can't get it together it can't happen but I mean like Friday the 13th happened and that wasn't too long ago like it's definitely it's flooded exactly the the market is flooded with people doing this but yeah if it is thing like the market is what annoys me is that the reason people were",
            "start": 4422.28
        },
        {
            "text": "wasn't too long ago like it's definitely it's flooded exactly the the market is flooded with people doing this but yeah if it is thing like the market is what annoys me is that the reason people were going to Kickstarter was all right well our audience is so small that they'll support this idea right you talked to Tim that was his original idea of it like no no publisher wants to fund a true pointand click adventure game anymore right so I'm we're going to go to the fans who want this and say put up or shut up and the fans put up you're now getting it where our Market is this and it should be this and like the market is so small or the audience is so Discerning they're like we're not going to give you the okay and then they're going back now it's going back channeling the other way right where now I'm taking that well I didn't make it with these kids but you can see that there is an audience interested",
            "start": 4457.32
        },
        {
            "text": "where now I'm taking that well I didn't make it with these kids but you can see that there is an audience interested well yeah it's an audience that wasn't interested enough to give you the million dollars you needed or whatever yeah I mean this is an interesting thing where it is just per of the rapper and what we went we're talking about earlier with the 3D platform or even just Platformers in general it's just like yeah there is an interest but you like Publishers need to gauge other interest based on what's there so them looking at the whatever was funed 50 000 or 00 000 and just being like all right cool that's how much interest is there is there any value to us putting even that much into it like can we get more is going to is our marketing team going to like get this in front of more people and the fact that Sony put out PaRappa the remaster recently and it's just like there's a lot of issues with it yeah it is a Hard Sell and one we're still there like exactly yeah so I",
            "start": 4499.64
        },
        {
            "text": "of more people and the fact that Sony put out PaRappa the remaster recently and it's just like there's a lot of issues with it yeah it is a Hard Sell and one we're still there like exactly yeah so I don't know I support pad up please for the love of God yeah when's that coming out do we have a really summerish they all keep saying at sometime well anyways that has been Kinda Funny Games Cast number 1 5 thank you very much for watching however you are watching and thank you for your support whether you support us financially or not we're just happy that you're there now cheeks Double D Doty what's going on Tim thank you very much for joining us no problem thanks for having thank you for being part of Kinda Funny Live you **** killed it I bombed in rehearsal so I thought that was going to be terrible no you did you like oh God this is going down Greg pulled me aside and he's like don't **** this up like like it's a big night for us please don't **** it up how's just Greg being",
            "start": 4534.72
        },
        {
            "text": "to be terrible no you did you like oh God this is going down Greg pulled me aside and he's like don't **** this up like like it's a big night for us please don't **** it up how's just Greg being Greg though where can find you they can find me over at youtube.com/ chipto gaming and actually since I got the uh Crash Mano early I'm giving away a copy of Crash medu insane Trilogy so go subscribe comment in uh the review of Crash medu insane Trilogy cuz you did a full review of it too yeah I did forie IGN style uh go leave a comment there subscribe and you will be entered win and I'll send it anywhere so it's IGN style how much they pay you off gentl we will see you next week thank you till next time boy I like this guy hey what's up guys you can click right there to subscribe to youtube.com/ ofun you click right there to subscribe to youtube.com ofun games or you can click right there to support us on Patreon you can watch the shows early live it's a fun time do it",
            "start": 4576.64
        }
    ]
}