{
    "id": 2807,
    "video_id": "WoG4PaZNm_Q",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Makes Us Feel Small? -  The GameOverGreggy Show Ep. 187 (Pt. 2)",
    "description": "Thanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1499151603,
    "duration": 1756,
    "transcript_chunks": [
        {
            "text": "Today's episode of The GameOverGreggy Show is brought to you by Dollar Shave Club. Make the smarter choice and shave with these guys, not your shoe. They let me write this ad once again. Uh, get a great shave at a great price, conveniently delivered right to your door. Doctors call it a life hack and a no-brainer because you get to sit there watching Kinda Funny and some poor schmuck has to bring all your face stuff to your house. World-renowned playboy Tim Gettys uses the DSC Executive Razor with their Dr. Carver Shave Butter, and the love of his life, Gia, can't stop saying, \"Dang, Tim, that DSC Executive Razor and Dr. Carver Shave Butter sure take better care of your face than a shoe.\" For a limited time, new members get their first month of the Executive Razor with a tube of their Dr. Carver Shave Butter for only $5 with free shipping. After that, razors are just a few bucks a month. Dang, that's a $15 value for only five bucks in your first month. In your first month box, you get an awesome, weighty",
            "start": 0.21
        },
        {
            "text": "butter for only $5 with free shipping. After that, razors are just a few bucks a month. Dang, that's a $15 value for only five bucks in your first month. In your first month box, you get an awesome, weighty handle, a full set of cartridges, and a tube of that shave butter I have to keep talking about. You can only get this offer exclusively at DollarShaveClub.com/Greggy. That's DollarShaveClub.com/Greggy. Make the smarter choice for Gia. My topic is going to bring you all down because it's actually the complete inverse of hers. I want to know what makes you feel small. Because like, I, as I always do, much like when we tried to pick our name for Kinda Funny, I like to do the bubble, like the old brainstorming things where I write down something and then do the lines off of it. So I started with The Lost Arcade, that movie I watched, which I recommend. And, and not just because IGN was in it. Francis Mirabelli is an executive producer on it, because it was, it was a good movie about the last, he, the third act, I think",
            "start": 52.64
        },
        {
            "text": "that movie I watched, which I recommend. And, and not just because IGN was in it. Francis Mirabelli is an executive producer on it, because it was, it was a good movie about the last, he, the third act, I think he did. I don't know. I sent it to you guys. You're, yeah, you're always on your phone during this, getting your calls. What are you talking, really motivating me to keep talking to you. But let me know your show. I will, I will. Uh, but then it, I was like, where does it go, right? And so then it was, uh, from Lost Arcade, I was like, arcade memories, uh, things, places, things, places you've lost, because the whole thing was about the, the Lost Arcade going away. And it was Last Arcade and these people dealing with that. And I, I have to deal with that with Wing Wings soon if something goes wrong, we don't know. Or if Genevieve buys it, it won't have to. And then I went over to New York City thinking about buying Wing Wings. It, we kick it around as an internet joke once in a while, but everybody's super into it, but it's a terrible idea.",
            "start": 115.88
        },
        {
            "text": "it won't have to. And then I went over to New York City thinking about buying Wing Wings. It, we kick it around as an internet joke once in a while, but everybody's super into it, but it's a terrible idea. We're very busy. Uh, do you know how much they're selling it for? Yeah, how much? 13, third, good. 136,000. Dirt cheap. That's it. Yeah, all the fryers, all the stuff. Why are they selling it? We'll talk about this off. Okay. Uh, then it got me to New York City, which then brought me up to feeling small. Because for me, I think we do, this is actually such a great paired topic, which we think we'd plan these shows out. We do so much cool ****. Uh, you know, I mean, we travel the world. You travel the world. You have an awesome YouTube channel. We have this awesome YouTube channel. We awesome people out there. Everything's amazing for us, right? But it's that thing of like, not that I'm conceited about it, you know, not that I have an ego that like, there likes to be jokes about, but it is like, that's awesome. And we do a lot of",
            "start": 152.32
        },
        {
            "text": "for us, right? But it's that thing of like, not that I'm conceited about it, you know, not that I have an ego that like, there likes to be jokes about, but it is like, that's awesome. And we do a lot of awesome ****. And like, when I, I'm going, you know, uh, to for Fourth of July back to Missouri to see family, right? And like, my world is amazing to them, because, you know, they have great lives too, but very different than I. Like, you know, when's the last time you were on a plane? You'll ask them. I don't know, two, three years ago. And I'm like, cool, I'm on a plane every two weeks or what, you know what I mean? But whenever I go to New York and I walk around New York, that is when I'm like, man, this city and the people in it do not give a **** about me, because there's like 1 million of them on going into the sky on top. It's like, it's New York has the most, I'm walking around in like, yep, I'm a **** ant. Like, don't **** matter in the least. I could get blinked out and right now and none of these people would care. And",
            "start": 194.56
        },
        {
            "text": "like, it's New York has the most, I'm walking around in like, yep, I'm a **** ant. Like, don't **** matter in the least. I could get blinked out and right now and none of these people would care. And it's just, it's both, wow, that's a cool perspective change from, not that we're like in it, but I mean, when our lives are daily, hey, you're doing great on this show and I really like it and I want to contribute. I think that's why travel is so important, right? Exactly. Get you to, you know, kind of balance these out. But go, but I get there and like, when I'm there for a long time for like, New York Comic-Con or whatever, and I'm wandering around doing things, it does weigh on me to an extent of just like, life's meaningless and I don't, we're all just people on this **** rock and it ants and it doesn't matter. It really does. It really, see, it's so weird. It has the opposite effect on me and it's very like, well, depends if you're talking about traveling for work. I don't, well, you're probably not. I mean, you have, you",
            "start": 230.64
        },
        {
            "text": "does it really? See, it's so weird. It has the opposite effect on me and it's very like, well, depends if you're talking about traveling for work. I don't, well, you're probably not. I mean, you have, you have to be talking about traveling for fun, right? I'm talking about either. I mean, for work, you generally get off the plane and there's 15 people that to recognize you on that plane. Not in New York. Yeah, really? If you go to New York Comic-Con, yeah, that's crazy. No, for me, I mean, at New York Comic-Con, sure. But I'm talking about outside of the Javits Center. Um, I, I mean, for me, traveling liberates me from that, because I just think I'm going to go just to a different place and, and just get away from everything and just, yeah, and experience and just meet people and maybe they're going to know who I am and maybe they're not. So what, what then what's the flip for you? What makes you feel small? What makes you feel me is going L.A. So when I go to L.A. and see the pace of that city and see everyone **** grinding out to like",
            "start": 270.96
        },
        {
            "text": "So what, what then what's the flip for you? What makes you feel small? What makes you feel me is going L.A. So when I go to L.A. and see the pace of that city and see everyone **** grinding out to like make a name for themselves in entertainment and like especially just in the world of comedy. Like you see these guys that are doing like even the open micers down there seem to be doing like they ****, they're doing like five or six open mics at night. Like that just that to me is, it's almost, it's daunting to say the least, because you see people that there and then if you're at the Comedy Club, like I, I was at the Comedy Store the other night and Judd Apatow was there doing a set. ****, Judd Apatow was like, I'm just going to go do stand up. I'm like, that does make you feel like it's a bigger hill to climb when you're like, I'll come back. You're up against, yeah, you know. But obviously, I mean, like the Store is another one of those historic places. But like, yeah, like the lineup was like Judd Apatow,",
            "start": 307.12
        },
        {
            "text": "the climb when you're like, I'll come back. You're up against, yeah, you know. But obviously, I mean, like the Store is another one of those historic places. But like, yeah, like the lineup was like Judd Apatow, Anthony Jeselnik, and like four or five other huge comedians. I'm like, Jesus, they're still out there doing it. Like, it's no longer a, hey, we did this and now we're gone away and the new class of people come up here. It's like, you're up against that as far as competition. They're not gone because it's fun as ****. Why would they? And now I just heard interview with Judd Apatow, who was on Rogan's podcast, and he was talking about how for the first time of his life, he's coming back to comedy and he gets to be the guy that walks into the club and bumps people where he's like, I don't have to wait. I don't have to put any to listen anymore or call ahead. I can just walk in and people like, you're **** Judd Apatow. You've made XY, like all these amazing comedies. Like, yeah, you're going on stage for sure. Um, so",
            "start": 345.16
        },
        {
            "text": "have to put any to listen anymore or call ahead. I can just walk in and people like, you're **** Judd Apatow. You've made XY, like all these amazing comedies. Like, yeah, you're going on stage for sure. Um, so that's daunting to me because I'm like, wow, I mean, he started doing comedy when he was 17, finished when he was 40, made, well, I don't know, like five of one of some of the best comedies ever made. And then now he's going back to comedy. Like, ****, that's ****. That makes you feel small to a certain degree. But it's also super inspiring because it's like, I mean, you know, it's just time we get there eventually. Alexa, what makes you feel small? Uh, there's actually a couple of things that make me feel small. Um, Hunter. Yeah, well, yeah, I mean, as far as, but also, I think, you know, a lot of times people approach me and are like, hey, I've got this great new deal for you. Oh, yeah. I think, and also if Hunter can come and it's like, I can only really get, you know, some things because of Hunter. And it's like, okay, well,",
            "start": 379.16
        },
        {
            "text": "me and are like, hey, I've got this great new deal for you. Oh, yeah. I think, and also if Hunter can come and it's like, I can only really get, you know, some things because of Hunter. And it's like, okay, well, thanks. So that definitely makes me feel small. And that's like on the daily regular, you know, so that's like always a something you have to contend with sometimes. Yeah. And but I feel like you're really good about like, understanding that and just kind of doing your own thing. I mean, what can I do? I saw a like ridiculous headline today. Someone's retweeting this and it was like, T.J. Miller. T.J. Miller's wife is really making a name for herself in the New York Fashion scene. And someone retweeted was like, yeah, this is the most, uh, hypocritical, hypocritical headline of all time. She's obviously not making a name for herself. And it also happens with, um, Amal Clooney, right? People don't even call her by her first name. They call her George Clooney's wife had a baby, had twins. Yeah. And it's like, okay, here she is.",
            "start": 421.84
        },
        {
            "text": "name for herself. And it also happens with, um, Amal Clooney, right? People don't even call her by her first name. They call her George Clooney's wife had a baby, had twins. Yeah. And it's like, okay, here she is. She's a lawyer for international human rights lawyer. Yeah, very accomplished. Well, maybe they're trying to get over the Stacy Keibler breakup, because I still am too. All right. How much did you love that? I loved Stacy Keibler so much. I can't believe. I mean, after everything that happened with test, you kidding me? If you were on, if you were on late 90s, early 2000s wrestling, cool Greg and I got you. We're going to follow your career the rest of your life. Yeah. Wow. Stacy Keibler. That's a bit of, um, so that's one of them. And does that happen to you in terms of like, well, you do like YouTube stuff too and you're just Hunter Pence's wife. Like, like when you, like, you, you do your YouTube stuff and you're making your videos and those get shared around. Are you seeing headlines where it's like, Hunter Pence's wife does this? Yeah.",
            "start": 463.52
        },
        {
            "text": "wife. Like, like when you, like, you, you do your YouTube stuff and you're making your videos and those get shared around. Are you seeing headlines where it's like, Hunter Pence's wife does this? Yeah. Yeah, pretty much. Or like, Hunter Pence's a lot was like, fiance or girlfriend or whatever. But yeah, Hunter Pence's wife. Mhm. I feel like that, I mean, to, to a certain degree though, like, I have that with Greg, right? Like, there's Greg's friend. I am Greg Miller's work wife. Um, no, I mean, that's, that's the thing. Like, so I sympathize for that, right? When I came into this, obviously, like, I think when we started doing, uh, Conversations with Colin, like, back in the day, you would, you're at least at 100,000 Twitter followers and I 60, I don't know, whatever it was. It was a hell of a lot more, right? And so I think to some degree, like, that's, that's something that obviously we capitalize off of. But it's like, it's crazy to think that it's like, Greg has like, over a million Twitter followers. I'm coming up on 69,000 million. But",
            "start": 507.8
        },
        {
            "text": "that's, that's something that obviously we capitalize off of. But it's like, it's crazy to think that it's like, Greg has like, over a million Twitter followers. I'm coming up on 69,000 million. But that's a big gap, right? And that's something I can never catch up with you on. So it's something that like, you, well, I could. But cool. Can I have some water? You are on this LaCroix kick. Cool. Greg, can I have some water? Oh, I love it so much. Um, so I sympathize with that, right? It's like, and watching Greg, like, Greg operates on another level for me. And I'm, it's inspiring to me. Like, I'm using it as motivation. So I make you feel small. You also make me feel small in stature as well, because you're, you're, you're a **** Yeti. He's like 19 feet. Jesus Christ. You're so big. Sorry. No, it's not your fault. It's your mom's fault. It's true. See, much shorter man. You know, I'll put out stuff, you know, like our Halloween costumes or stuff like that. And like, Hunter gets not, you know, I'm super happy. We're whatever. But we whatever you",
            "start": 548.56
        },
        {
            "text": "it's true. See, much shorter man. You know, I'll put out stuff, you know, like our Halloween costumes or stuff like that. And like, Hunter gets not, you know, I'm super happy. We're whatever. But we whatever, you know. But sure. But I mean, it reduces you to a co-star or whatever, you know what I mean? Like, yeah, I feel like that's, but, but that's like one way to look at it, right? The other way to look at it is like, life as a team sport. And like, and what I've seen that the people that like, again, not to keep bringing up Rogan, but like, he does a great job of seeing other people around him that are talented and using his celebrity to help elevate them and boost them. And I think that's just the way it has to go. Like, if you, if you're really, if you really love someone or you really respect someone and you're working with them, you owe it to that person to like, give them the leg up. That's just the way. There's no like, in the entertainment industry, especially, like, there is no fair, right? You don't just like, everyone",
            "start": 594.24
        },
        {
            "text": "with them, you owe it to that person to like, give them the leg up. That's just the way. There's no like, in the entertainment industry, especially, like, there is no fair, right? You don't just like, everyone doesn't just start from zero. Everyone has advantages and disadvantages. And so like, it's on you to just be like, this is an advantage. I'm going to accept it totally and be the best at. Sometimes when you're working so hard, you're like, you know, there's nothing wrong with it. Like, I'm not like, oh, at home at night crying about it, you know, can't believe New York Times call me why. Yeah, that's, you know, it's just, it's a daily reminder that like, I have to work that much harder. But like, it's almost feels like I have to work twice as hard, which is fine. But, you know, it's just a reminder. Sure. Um, and then another thing is, I think a lot in our world, like our baseball worlds, there's a lot of jealousy. And so in terms of like, you know, like social media deals, whatever kind of deals. And so I always find that I have",
            "start": 634.0
        },
        {
            "text": "thing is, I think a lot in our world, like our baseball worlds, there's a lot of jealousy. And so in terms of like, you know, like social media deals, whatever kind of deals. And so I always find that I have to like, like cut my wings a little bit. Like, I have to like, dim down and like, not always be so honest and upfront and like, you know, if I get something really cool, I find that it's really hard to like, share it with people. You mean, you mean in person? Like, you're like, hey, we're all talking around at the game and hey, I got this cool thing. You, yeah. Or even like with some friends, like, it's kind of hard to like, share it because I feel like there is like this almost like jealousy that you're like, and I just wish that everyone can just be happy for everyone. Like, there is like so much abundance in the world that like, we can all do it together. But I always sense that like, I get, I get like a lot of just like the evil eye towards me. Like, you can feel it. You can feel the heat. I wrote this down off the a",
            "start": 672.64
        },
        {
            "text": "that like, we can all do it together. But I always sense that like, I get, I get like a lot of just like the evil eye towards me. Like, you can feel it. You can feel the heat. I wrote this down off the a quote some had was getting tweeted around. Someone else's success is not your failure. You know what I mean? I think that's the thing. I, I, I in the not even early days, every so often you wrestle with it where one of somebody that does something similar to us or a friend or a personality or whatever tweet something like, ****, why am I not doing that? Or why didn't like, wait, that's not the way to think about it. You know what I mean? Great idea. Me, how can I make it toward like, more towards me or I don't know, whatever you want to say. But it's, I hate that like, we have, we live in a world now or maybe not, we don't live in a world now. But like, a lot of times you have to dim your light to make other people feel good. Well, unfortunately, that sucks because I feel like, and it's not so much about feeling small,",
            "start": 716.6
        },
        {
            "text": "don't live in a world now. But like, a lot of times you have to dim your light to make other people feel good. Well, unfortunately, that sucks because I feel like, and it's not so much about feeling small, but I feel like I experienced this a lot in my different friend circles where all I do is talk about what we do, because it's like, most people, most people, exactly. That's what everyone does, by the way. That's true. But most people I know live very different lives that can relate in those ways. I mean, tell you, put five lawyers in a room together, holy ****, they're going to talk about the law, talk lawyer all the time. Exactly. Judge Dredd convention. There's, there's a, a fine line. I'm sorry. There's a fine line when it comes to like, name dropping and doing that stuff. And I, I feel like I never want to be the person that's run around name dropping for the sake of, look how **** cool I am. It's more like, dude, this is **** cool. Like, let's talk about how cool this is, you know, not because like, I'm cooler than you.",
            "start": 758.08
        },
        {
            "text": "that's run around name dropping for the sake of, look how **** cool I am. It's more like, dude, this is **** cool. Like, let's talk about how cool this is, you know, not because like, I'm cooler than you. But just in a way of like, no, there's cool stuff happening. And I, it really has made me change the way I think about a lot of people in my life where I'm like, if you're going to like, treat me like ****. And this is something I've seen a lot with, uh, with artists that I like or, or really anything, anyone. The moment they become successful, everyone like, looks at them different. Like, oh, you're mainstream now. Like, oh, you're too big for us. You're too cool for us. Like, Logic. And I'm so not cool with that because it's like, no, man, support the people. And I bring up the Macklemore thing all the time. But it's like, I'm not going to stop supporting Macklemore just because he made it. Like, I'm proud of him for making it. Or I'm proud of whatever YouTube channel that I like for making it. Or all these people. Like, if",
            "start": 796.24
        },
        {
            "text": "I'm not going to stop supporting Macklemore just because he made it. Like, I'm proud of him for making it. Or I'm proud of whatever YouTube channel that I like for making it. Or all these people. Like, if you became a superstar, I'm going to be proud of you for doing it. You know, thank. And it's just like, that always bothers me because I feel like a lot of people will in, again, people that I've known my entire life will look at me and act as if I've changed. And I'm like, no, I am just succeeding. You know, I'm getting the thing that I've been trying to do. It's not just talking about wanting it anymore. Now I'm having it. And that's a hard thing for a lot of people to rectify though, because it's a hard, like, a lot of people that I know just, just do the thing where they're the hopeless dreamer, right? Where they just, for them, dreaming about the thing is enough. And so it can be difficult to see other people out there doing, like, putting the work in, doing the thing and know kind of deep down that you're not. And",
            "start": 831.56
        },
        {
            "text": "just for them, dreaming about the thing is enough. And so it can be difficult to see other people out there doing, like, putting the work in, doing the thing and know kind of deep down that you're not. And that's where I feel like that resentment comes from. Um, also, I think it's, you're changing as a person, right? So it's not like you are growing and you're growing different places. But doesn't mean that you guys still can't. Like, I have to also realize that, you know, especially as like, a lot of my friends start to have kids and, and, you know, more people are getting married, even though I'm married, like, you're growing and people are growing differently. Your lives start to diverge from each other. Yeah. But also, you have to learn. And if you still want to keep that friendship, like, I think people go, just go to jealousy versus how do I grow with this person versus let me just be jealous and over here, here and I hate my kids because you get to do all the cool stuff now. And like, you know, like, I think we",
            "start": 871.44
        },
        {
            "text": "go to jealousy versus how do I grow with this person versus let me just be jealous and over here, here and I hate my kids because you get to do all the cool stuff now. And like, you know, like, I think we just need to learn how to like, change or like, all of us, everyone needs to change. Like, if you're not forever growing, you're, you're stuck. And it's about adapting and like, learning how to create a new relationship based on the relationships that you have. And it's like, I just have no tolerance for this **** anymore, because like, I just don't have time. If you, if you are one of my friends and you're going to give me **** for the person I am, I'm not going to be a different, really a friend. Yeah. It's like, no, okay, I cherish the friendship that we had. But we can either have a new friendship or I'm sorry, relearn almost like, who you are now and like, all this change that you've done. Um, and then the other one is, you know, putting people down. You know, I'm trying to be super aware of like, you know, making",
            "start": 910.44
        },
        {
            "text": "relearn almost like, who you are now and like, all this change that you've done. Um, and then the other one is, you know, putting people down. You know, I'm trying to be super aware of like, you know, making sure that my word is impeccable. And that goes to like, I started reading Four Agreements. That's a book that I always go back to. And what's it called? Four, The Four Agreements. Okay. And it's being impeccable with your words. So making sure I'm not talking smack about so and so or because, you know, I'm upset that they said something about me or like, putting this, you know, they someone gives me an idea about something, you know, like, a lot of people like to give me like the video ideas. I'm sure you guys get that a lot. And you're like, in your head, you're like, oh my God, I would never make that video, right? Like, shut up, Kevin. But like, you know, you don't want to joke, Kevin. It was a, you have great ideas that Kevin and Greggy to Pizza. That was all you. And it was great. It was your idea. Damn it. Well, I make",
            "start": 951.0
        },
        {
            "text": "like, shut up, Kevin. But like, you know, you don't want to joke, Kevin. It was a, you have great ideas that Kevin and Greggy to Pizza. That was all you. And it was great. It was your idea. Damn it. Well, I make great ideas. But even though that one person gave you 10 bad ideas, they might come up with one really good one, right? Or, but also you ask yourself, you, you think to yourself, why am I having this reaction to this person just trying to give me a fun idea? Like, be creative, right? That's something that I've really been trying to pay attention to myself is that that weird self-serving, shitty, negative thought process. It's something actually Kevin and I talk about a lot because he's always the guy I take that **** out on. And it's not fair. And like, literally, I'll pull him aside and be like, I'm just in a bad headspace right now. And you're the person that's the like, the biggest bright shining star that I can see right now. And I'm just going to go straight toward you. Um, but it's not about him. It's about",
            "start": 994.6
        },
        {
            "text": "head space right now and you're the person that's the like the biggest bright shining star that I can see right now and I'm just going to go straight toward you um but it's not about him it's about that maybe I've got things like I've noticed myself too when I get really shitty when like last week I was in a a bad place cause I went up three times on stage and **** bombed three times and I was like what the **** why am I doing this and then of course I I I looked back and I'm like oh I was negative towards some of my co-workers that day because of course the that's where I'm at so just having that level of like like being able to self-evaluate like that on that level I think is important I think that's important for for growing up as well I think realizing too like stopping being self-aware and be like okay even though I want to react like that like even if you do or if someone does put you down like a lot of people love to put me down I don't know why maybe it's me but maybe",
            "start": 1035.24
        },
        {
            "text": "self-aware and be like okay even though I want to react like that like even if you do or if someone does put you down like a lot of people love to put me down I don't know why maybe it's me but maybe you're just a girl on the inter I mean I think a lot of times I have to stop and realize like you know what it has nothing to do with me like I'm happy I'm doing what I'm doing that's something personal with them Taylor Swift who said people throw rocks at things that shine and that's 100% correct and haters are going to hate yeah or it is that thing of like people who see people who are successful and they aren't successful or don't feel like they aren't in a good head space about it want to talk **** for no reason well that's the thing too is like you should not feel bad about celebrating your success it's if you're rubbing it in people's face that's one thing but that's but if you're if you've gotten something cool you want you want to talk about that to people like that's a there's",
            "start": 1070.36
        },
        {
            "text": "your success it's if you're rubbing it in people's face that's one thing but that's but if you're if you've gotten something cool you want you want to talk about that to people like that's a there's something there you should probably explore a little bit and I I mean I I understand it there's a difference between being tactful which sounds like you're doing and then being ashamed of your success which I think that that's that's something that you know is is people grapple with I know that for sure so I don't know I haven't figured out the answer to that one yet about you man the this it's very depressing my answer and I've talked about on the show a couple times and I think this sticks with the theme of everything we've been talking about but the thing that makes me feel small is the emptiness I feel after major successes oh that's a good one postpartum depression and I feel like recently I've I I've never been more proud of what we're doing I've never been more proud of the person I am",
            "start": 1110.24
        },
        {
            "text": "I feel after major successes oh that's a good one postpartum depression and I feel like recently I've I I've never been more proud of what we're doing I've never been more proud of the person I am and the life that I lead and the family that I have and the friends and all this stuff like everything we got going on right now like all aspects of my life are firing on all cylinders business-wise we're killing it and love the shows we're doing my brother has cleaned up his act he's working for us and things are great squeaky clean you know Kevin's getting married two of my other best friends are getting married Alexis is already married like all this stuff is just going going going and it's great E3 never been more proud of how he handled one Kinda Funny Live 3 I am just as happy with it as I won as I was about one and two and like the moment all that stuff H like ended is just like **** like so what you know it's like it's the moment I'm alone with my thoughts when I",
            "start": 1144.56
        },
        {
            "text": "happy with it as I won as I was about one and two and like the moment all that stuff H like ended is just like **** like so what you know it's like it's the moment I'm alone with my thoughts when I finally got to catch up and sleep you did the drug to talk to each other ful huh you did that drug where you talk to yourself no that's but that's exactly what I'm talking about by the way in our prior topic give it to you and you won't even know it your La Croix tastes a little weird one of these days because Daddy needs to have a conversation with himself um no that's exactly what I'm talking about though is that is that concept of like you're you're you're like me like I think you're only happy when there's another big Challenge on the horizon right when you've got something else big to look forward to that's going to like take you to the next level do you think there's something wrong with that like why can't we just be like well if you're if you're never happy unless you're",
            "start": 1187.6
        },
        {
            "text": "big to look forward to that's going to like take you to the next level do you think there's something wrong with that like why can't we just be like well if you're if you're never happy unless you're doing something that's one thing nailed E3 like can't you just like take a moment see I struggle with this too I think the problem with that though is no you can't because it's like every s single thing is a step towards the next step and I think that's the reason that you're moving right you can just be and that's when you stop right right like you're not moving forward if you if you stop and what's weird for me is it's that weird emptiness of nothing makes me happier than what we just did nothing makes me happier than hanging out with everyone after Kinda Funny Live 3 and feeling so proud of what we did but then it's like the moment that ends it's like it's immediately thinking about what's next it's like when you when you've been waiting for a movie for 3 years or two years whatever",
            "start": 1225.88
        },
        {
            "text": "of what we did but then it's like the moment that ends it's like it's immediately thinking about what's next it's like when you when you've been waiting for a movie for 3 years or two years whatever you sit there you watch it you leave and the first thing you think is I can't wait for the next one you know you listen to video game the same way the video game is the same way you listen to a music album that you've been waiting 10 years for and you're like can't wait for what's next and it's just like that's who we are but somewhere in there it's a weird thing where it's like I've realized recently and when I say recently I mean like maybe three years ago that there is no light at the end of the tunnel you just it's just yeah just you just keep going and it's inspiring and it's great and it's the reason that we keep going but it's tiring also it's very tiring but it's like it's a very very weird depressing thing to feel so empty about an accomplishment that you worked so hard to do and so",
            "start": 1263.48
        },
        {
            "text": "the reason that we keep going but it's tiring also it's very tiring but it's like it's a very very weird depressing thing to feel so empty about an accomplishment that you worked so hard to do and so hard to get and then just be like like I I almost feel selfish for saying that's it you know so I love that you brought this up because that question like when we were talking about it earlier like what inspires you and like you know how we talked about getting the goals and always setting a next one like Tim specifically for you like you are like this has been always been your dream like this is it like like what is it something now that you're like okay maybe the next step or thank you the next step or I mean I don't know it's like a weird thing where like how are you going to pinpoint your next goal do you want a next goal I mean I I feel like we're lucky enough that with what we do it's never like oh the goal's done it's always there's like there's like bunch of mini goals within the",
            "start": 1302.12
        },
        {
            "text": "next goal do you want a next goal I mean I I feel like we're lucky enough that with what we do it's never like oh the goal's done it's always there's like there's like bunch of mini goals within the goal so launching new shows launching new like ideas or whatever but I mean Kinda Funny Live in particular that is my goal that was always the the thing that I wanted to do and we've done it three times now and every time bigger and better than tour with it I mean of course there's all these like little modifiers you can put on it but yeah it's like it definitely is would you ever do it in Spanish uh I wouldn't do it in Spanish that doesn't sound appealing to me but um I'm sure it has an audience uh I I don't know I I've never been struggling to find the next goal like there was a line in a in a song by **** Linguist where they say the if you reach for the stars you just might grab them something like that I don't remember the exact quote and that really resonated with me a long time",
            "start": 1349.92
        },
        {
            "text": "in a song by **** Linguist where they say the if you reach for the stars you just might grab them something like that I don't remember the exact quote and that really resonated with me a long time ago where I was like oh **** like you need to have a plan for what you do once you grab the star sure you cuz if you if you try hard enough you're going to get it then once you get it what are you going to do with it right then once you do that what's the next step and I feel like you got to be five steps ahead always totally or you can just be the mom and pop coffee shop that's just like I just like having this one coffee shop I think goes out of business by Starbucks you got nothing or Starbucks buys it from you and they give you a billion dollars that's not how that works that's how business works I think that you just you're missing a a very important component of that which is that you need to give like that progress and rest have to go hand in hand right you get better at one",
            "start": 1396.76
        },
        {
            "text": "works I think that you just you're missing a a very important component of that which is that you need to give like that progress and rest have to go hand in hand right you get better at one when you get better at the other one and so giving yourself a little bit of space to be like I'm just going to like I'm going to chillax today I'm going to relax today I'm going to enjoy this accomplishment I'm not going to think about all that stuff like I did it I'm good today is the day and then on Monday I'll hit a heart again I think that's that's what I do and that's why like when when Dee and I will go away someplace or we'll just go up by a pool for a day or something like that and I I'm constantly thinking about getting on Twitter or I have to work and I just have to remind myself you know what today's the day I recharge I relax I I reflect back on what we did and replay those moments in my life like Kinda Funny Live 3 where I got to do this **** cool Big Show and I got to work",
            "start": 1438.04
        },
        {
            "text": "what today's the day I recharge I relax I I reflect back on what we did and replay those moments in my life like Kinda Funny Live 3 where I got to do this **** cool Big Show and I got to work with my friends and my brother and like all these cool people and see the community for the first time in a while um and just relish in it for a second to process yeah I mean but that's actually like a skill that you can get good at too of being like I'm going to go back and enjoy this and like sit for a couple like a weekend with myself and then on Monday we hit it hard and we reset those goals have you ever done that in different ways have you taken a weekend trip with Gia yet no **** no why I mean well just like that to me that's not something that I I find any interest in doing I'd want to hang out with her have you ever done that no so how do you know just cuz I know what I like I I'm telling you you don't like wine you don't like Napa nice breakfast a pool read some Comics by the",
            "start": 1474.16
        },
        {
            "text": "to hang out with her have you ever done that no so how do you know just cuz I know what I like I I'm telling you you don't like wine you don't like Napa nice breakfast a pool read some Comics by the pool he doesn't like being away from his computer I just don't like got unplug this is part so now we're starting to unpack we're starting to see part of the problem Tony Robbins we're Tony Robbins-ing honestly with all this I feel like it is because I've heard I've heard variations of this so many times and hey not saying you guys are wrong and at some point I'm sure I'm going to have to try it um knowing Gia I'm sure you will have to try that you have a weekend away but I just feel like not everyone has it's not like a one thing solves all type of situation all it's like a baby step thing you know well it's just it's a balance thing that's what that that's what it is to me is it like is that you have to I've you know I've noticed this startling trended myself and I'm sure you guys have never seen",
            "start": 1513.68
        },
        {
            "text": "it's just it's a balance thing that's what that that's what it is to me is it like is that you have to I've you know I've noticed this startling trended myself and I'm sure you guys have never seen this before but when I burn you know burn the **** candle at both ends is that the right one na it great uh I'm probably the worst person say don't even know but you know when when when when I work way too much and I I hit that that point where where my brain's like hey you need to pull back a little bit and do something for yourself and like take care of yourself I push past that that's when I become a broke **** like just a just a **** dick to everyone around me and so that's that you know that that's how that manifests itself in me is it like everything just becomes the **** worst thing on the planet and the guy next to me is the **** in the car next to me is an **** and like yeah then I started thinking to myself oh I need to just like stop I need slow down get some sleep get",
            "start": 1557.96
        },
        {
            "text": "on the planet and the guy next to me is the **** in the car next to me is an **** and like yeah then I started thinking to myself oh I need to just like stop I need slow down get some sleep get a meal relax unplug for a second and like just take a day for myself uh and treat myself nice you know and then inevitably and I'm not **** you I've seen this in like the last 3 days I I can recognize it now and go you're at that point it's almost like someone outside of me is like stop go go go to your corner I'm like cool I'm going to go to my corner which is like in my house and I just shut off and watch stupid car restoration shows and it's awesome yeah that's the thing is recognizing that and taking care of that balance yeah and I think that for me like you know the most helpful thing recently has been Jen obviously moving here and the fact that like yeah like on the weekends especially cause I'm shitty during the week right like I wake up early I gather this is I guess in the last week",
            "start": 1599.28
        },
        {
            "text": "recently has been Jen obviously moving here and the fact that like yeah like on the weekends especially cause I'm shitty during the week right like I wake up early I gather the stuff for Kinda Funny Games Daily have coffee with her go here **** go a million miles an hour come home I'm usually starving so I have no energy I'm dead I can't put sentences together and then I finally get it together but we just chill out so then on the weekend when it rolls around it is like all right cool what do you want to do you know what I mean let's hang out with you let's put everything away a new revelation that I've just hit is like wait a minute and like you guys are right there with me our lives are going a thousand miles per hour a thousand like you don't even realize it like I didn't even get a moment to like realize wait like I'm on my next flight like I'm leaving Sunday you know like we're just we're going a thousand miles per hour and I",
            "start": 1636.8
        },
        {
            "text": "like you don't even realize it like I didn't even get a moment to like realize wait like I'm on my next flight like I'm leaving Sunday you know like we're just we're going a thousand miles per hour and I don't know when that happens like I don't even you don't even realize it's when the time right around the time when you actually forget to pack **** **** there like my life will never it's not going to slow down and so you have to adapt and you have to balance it and like I'm not saying this is what you need to do like I'm sure you're really introspective so like I'm sure you know what you need to do take the drug to talk to yourself yeah I'll do it with you guys let's just **** let me do it just turn the camera on let's just see what happens but it's it's crazy to know that like yeah our lives are going 1 000 miles per hour and we need to adapt to it and we like I like I need those days otherwise like I like you have health problems it'll go like stuff will just start to happen and",
            "start": 1671.4
        },
        {
            "text": "lives are going 1 000 miles per hour and we need to adapt to it and we like I like I need those days otherwise like I like you have health problems it'll go like stuff will just start to happen and you're like oh that's life's way if you don't do it life will do it for you it's very true if you'll learn to say no and stop and do stuff it happens I need a year of no not the year of yes like I need a year of no thanks for watching this episode of The GameOverGreggy Show click here to subscribe go support us on Patreon down there check out other episodes up here and then go over to Kinda Funny Games because we got a whole bunch of cool stuff there like Party Mode but don't forget about the Patreon stuff you can watch us record the show live",
            "start": 1714.68
        }
    ]
}