{
  "id": 2372,
  "video_id": "6l6IHWmvlHE",
  "show_name": "Kinda Funny Live",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Kevin Coello",
    "Mike Howard",
    "Andrea Rene",
    "Adam Kovic",
    "Alfredo Diaz",
    "Anthony Carboni",
    "Barbara Dunkelman",
    "Brandon Jones",
    "Brian Altano",
    "Bruce Greene",
    "Burnie Burns",
    "Colin Moriarty",
    "Curran Wong",
    "Dan Ryckert",
    "Danny Shepherd",
    "Geoff Ramsey",
    "Gia Gettys",
    "Gus Sorola",
    "Jack Tretton",
    "Jamie Kennedy",
    "Mega Ran",
    "Michael Jones",
    "Mike Drucker",
    "Paula Coello",
    "Sean Finnegan",
    "SisQo",
    "Tonedeff",
    "Trisha Hershberger"
  ],
  "title": "Kinda Funny Live 2 2016 (FULL SHOW!)",
  "description": "Thank you all for making this the best night of our lives.\n\nSHARE THIS WITH YOUR FRIENDS!\n\nKinda Funny Live 2 happened on May 28th, 2016 at the Regency Ballroom in San Francisco California.\n\nHosted by: Rooster Teeth's Burnie Burns\n\nSpecial Guests: \nRooster Teeth's Gus Sorola & Barbara Dunkelman\nAchievement Hunter's Geoff Ramsey & Michael Jones\nFunhaus' Bruce Greene & Adam Kovic\nEasy Allies' Brandon Jones\nIGN's Brian Altano and Sean Finnegan\nGiant Bomb's Dan Ryckert\nIsmahawk's Danny Shepherd\nAlfredoPlays' Alfredo Diaz\nAndrea Rene\nMike Drucker\n\nMusical Performances by: Tonedeff, Grimecraft, Mega Ran, & SisQo\n\nVoice Over by: Dave Fennoy\n\nSpecial thanks to: \nJack Tretton\nNo Clip's Danny O'Dwyer\nChloe Dykstra\nLetsGetLexi's Alexis Cozombolidis\nFilthy Casual's Mike Gaboury & Jay Soprovich\nDarshelle Stevens\nGame Attack's Craig Skistimas\nCritical Roles' Liam O'Brien\niJustine's Justine Ezarik\nAnthony Carboni\nTrisha Hershberger\n\nPhotography by: Sean Finnegan and Eric Petralia\n\nDirected by: Midlife Ballers' Matt Scarpino\n\nEdited by: Tim Gettys\n\n\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\nKevin - http://www.twitter.com/KindaFunnyKevin",
  "published_at": 1486364325,
  "duration": 10684,
  "transcript_chunks": [
    {
      "text": "If you're ready for Kinda Funny Live, make some noise! Say it with me. Kinda Funny. Kinda Funny. Kinda Funny. Kinda Funny. Kinda Funny. Kinda Funny. Kinda Funny. 2, 9, 8, 7, 6, 5, 4, 3, 2, 1. What is Kinda Funny? 4, sometimes 5 best friends. But that 5th best friend is you. Kinda Funny is a community. The best community. Kinda Funny is really just 4 dudes sitting around the table talking non-stop while some guy sits there and listens. Kinda Funny is a journey we're all on together. Kinda Funny is a way of life. Kinda Funny is taking the jump even if you're not sure you're going to make it. Kinda Funny is like going to Costco and not buying anything. Kinda Funny is a garbage truck on fire. Kinda Funny is an experience. Kinda Funny is worth a dollar. Kinda Funny is Greg absolutely losing it. Kinda Funny is Colin cleaning his glasses. Kinda Funny is Tim looking at the camera. Kinda Funny is Kevin's lap. Kinda Funny is Nick getting up to pee. Kinda Funny is Portillo's vacant stare. Kinda",
      "start": 0.0
    },
    {
      "text": "Kinda Funny is Colin cleaning his glasses. Kinda Funny is Tim looking at the camera. Kinda Funny is Kevin's lap. Kinda Funny is Nick getting up to pee. Kinda Funny is Portillo's vacant stare. Kinda Funny is 24 hour live streams. Kinda Funny is the GameOverGreggy show. Kinda Funny is PSI Love You XOXO. Kinda Funny is love and sex stuff. Thanks to you, Kinda Funny is anime. Kinda Funny does way, way too much. Kinda Funny is memories. Kinda Funny is the future. Kinda Funny is Team Fat. Kinda Funny is huge announcements. Kinda Funny is Greg's speech. Kinda Funny is an inspiration. Kinda Funny is a love letter. Kinda Funny is a message. Kinda Funny is a symbol. Kinda Funny is a choice. Kinda Funny is a promise. Kinda Funny doesn't stop. Kinda Funny is family. Kinda Funny is an empire. Kinda Funny is passion. Kinda Funny is worldwide. I am Kinda Funny. I am Kinda Funny. I am Kinda Funny. I am Kinda Funny. I. I am Kinda Funny. I am Kinda Funny. I am kind of fun. I. I",
      "start": 89.56
    },
    {
      "text": "Kinda Funny is passion. Kinda Funny is worldwide. I am Kinda Funny. I am Kinda Funny. I am Kinda Funny. I am Kinda Funny. I. I am Kinda Funny. I am Kinda Funny. I am kind of fun. I. I am Kinda Funny. I. Am Kinda Funny. We are Kinda Funny. Welcome to the first ever Kinda Funny Live 2. Hosted by Red vs Blue creator and Rooster Teeth co-founder Bernie Bird. Featuring performances by Rhyme Craft, Art Crepper, Begga Red, and Tone Dead. With special guests Michael Jones, Jack Ramsay, Adam Colvin, Bruce Green, Gus Sarola, Ismael Hart. Alfredo Diaz and more. Starring Greg Miller, Colin Moriarty, Nick Scarpino, Tim Gettys, and Kevin Coelho. Look around you, we built this together. We all share this moment, tonight is ours. We are all Kinda Funny. This is Kinda Funny Live. Ladies and Gentlemen, make some noise for Bernie Birds. Hello everybody. How are y'all doing? I am your host Bernie Birds. Hey guys, what's up? What's up everybody? You guys, you did it. You're here. You",
      "start": 143.42
    },
    {
      "text": "and Gentlemen, make some noise for Bernie Birds. Hello everybody. How are y'all doing? I am your host Bernie Birds. Hey guys, what's up? What's up everybody? You guys, you did it. You're here. You are at the first ever Kinda Funny Live 2. I just have one question. Are you ready? I can't hear you. Are you ready? Alright, you know what? I need to come clean about something. I could hear you the first time. I lied so that you would cheer louder the second time. It's like, it's a hosting thing. Sorry, it's pretty basic. I can't believe that you guys actually fell for that. Because I want our relationship as a host and audience to be different. Because Kinda Funny is different, but you guys know that. Because you came from all over the world to sell out this venue. This is now a sell out crowd. I don't care who knocks on that door, we're not letting them in. Tick tock, the game is locked. You have turned the Kinda Funny guys into huge sell outs. And I'm talking about the good kind of sell",
      "start": 225.56
    },
    {
      "text": "I don't care who knocks on that door, we're not letting them in. Tick tock, the game is locked. You have turned the Kinda Funny guys into huge sell outs. And I'm talking about the good kind of sell out, not the rooster teeth kind of sell out. You were thinking it. You were thinking it. It's okay, I used the money to buy this jacket. It's a pretty sweet jacket. But you guys did it. I gotta ask you a question. When you guys were buying all these tickets at 75 bucks a pop, how much? Wow, you guys are dumber than I thought. Did you realize at any point in that process that all this shit is just free online at any point? Seriously, you could just go like click the thing and the guys start talking like chicken wings, Oreos, conservative agenda. But no. You guys powered through that and you bought every ticket, came from all over the world. I gotta know. I gotta know. Who thinks they came from the furthest away? Shout it out, tell me where you're from. Tell me where you're from. Alright,",
      "start": 320.56
    },
    {
      "text": "every ticket, came from all over the world. I gotta know. I gotta know. Who thinks they came from the furthest away? Shout it out, tell me where you're from. Tell me where you're from. Alright, alright, alright. Who the fuck said Oakland? It's across the bridge. Did you just have like really bad traffic or did you just come all the way around the globe the other way? Because that would be pretty impressive. Okay, what about East Coast? Anybody East Coast? You. Where are you from? South Carolina. That doesn't count as East Coast if it's not New York. How about Europe? Anybody from Europe? Right there, where are you from? London. You're from London. Well, welcome to a land that actually has decent food. And sunlight. Okay, can anybody beat Europe? Okay, now I mean beat Europe in this game, not like in a war because clearly anybody can fucking do that. Where are you from? Perth, Australia. Perth, Australia. Wow. Wow, that is the most remote location on earth, right? So unless anybody",
      "start": 388.56
    },
    {
      "text": "not like in a war because clearly anybody can fucking do that. Where are you from? Perth, Australia. Perth, Australia. Wow. Wow, that is the most remote location on earth, right? So unless anybody else is from the goddamn moon, this guy's our winner. What's your name? Nathan. Nathan wins. There's no prize, but he wins. I guess, Nathan, you won a super expensive plane ticket, but you have to pay for it. So, congrats on that. Alright, guys, I know why you're all here. I want to talk to you for a second. You can't what? I like you a bunch. Let's take things slow, see how it goes. I want to talk to you guys about the first time that I met the Kinda Funny Guys. When I first met them, they were slaving away in the sweatshops of IGN. Is anyone here from IGN, by the way? Because that would be super awkward that I brought that up. Sorry I described your business in that way, you know, accurately. Don't woo, don't make the woo noise. You'll make them very mad. They'll give me a scathing review",
      "start": 460.56
    },
    {
      "text": "awkward that I brought that up. Sorry I described your business in that way, you know, accurately. Don't woo, don't make the woo noise. You'll make them very mad. They'll give me a scathing review of my opening. Let's say, worst monologue ever. Nine and a half out of ten. But when the Kinda Funny Guys, when they went on their own, they worked for what is the biggest name in the video game industry. They worked for IGN. And when they left, it was a huge decision for them. And I think we can all look at that decision now, looking back, and say that was clearly the right thing for them to do because they built this huge empire. They've had all the success. But they didn't know it when they made that decision. They had no idea. But they had the faith that you were out there, that their best friends would be there to support them. And you know what? They took that leap of faith, and you guys were there from day one. You supported them 100%. You made this happen. That is why I am super",
      "start": 532.56
    },
    {
      "text": "friends would be there to support them. And you know what? They took that leap of faith, and you guys were there from day one. You supported them 100%. You made this happen. That is why I am super proud to be a part of this show tonight. The guys have put together an amazing program. It is a three-hour thank you letter, a love note to their best friends. You are going to love it. So what do you say? Do you want to get started? All right, well let's get those guys out here. Introducing our first Kinda Funny host of the evening. A man so smart. He's smarter than everyone in this room combined. And we're super happy that he had the courage to leave his house tonight. Ladies and gentlemen, give it up for the pride of Long Island, Mr. Colin Moriarty! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Colin! Ladies and gentlemen, your second host for the evening. You know him. You're in love with him. But he doesn't want anything serious, so let's take it",
      "start": 583.56
    },
    {
      "text": "Colin! Colin! Colin! Colin! Colin! Colin! Colin! Ladies and gentlemen, your second host for the evening. You know him. You're in love with him. But he doesn't want anything serious, so let's take it slow. Producer slash seducer, Mr. Nick Scarvino! Here we are, born to be kings We're the princes of the old neighborhood Here we are, born to survive We live in the war with the darkest of hearts And now... Our second host of the evening. And now... And now... Our second to last host of the evening, but certainly not second to least. You know him as the head of Team Fat. A man so large, so loud, and so obnoxious that even cancer didn't want to hang out with him. Give it up for the internet's Greg Miller! CHEERING CHEERING CHEERING And finally, a man who spent years... Let him out! Let him out! This is a man that spent years campaigning to host other people's shows. And now, when he has his own show, he hired me to host. I don't really understand the strategy. He may not be the smartest",
      "start": 691.56
    },
    {
      "text": "This is a man that spent years campaigning to host other people's shows. And now, when he has his own show, he hired me to host. I don't really understand the strategy. He may not be the smartest man, but God damn is he handsome! Give it up for Mr. Jim Jennings! Attention! Please push to the front of the stage. I repeat, please push to the front of the stage. In the year 1989, a boy was born with a dream. This dream gave birth to a mantra. Let Tim Host become a way of life. It's truly believing that with the support of those around you, anything is possible. This is the story of Tim Gettys. And tonight, we let Tim Host... CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING CHEERING Let Tim Host! Let Tim Host! Let Tim Host! Let Tim Host! Ladies and gentlemen, welcome to Kinda Funny Live 2! CHEERING It's sunny San Francisco from the sold-out Regency Ballroom. How the fuck are you? CHEERING Colin, there's a lot of",
      "start": 907.56
    },
    {
      "text": "Host! Let Tim Host! Ladies and gentlemen, welcome to Kinda Funny Live 2! CHEERING It's sunny San Francisco from the sold-out Regency Ballroom. How the fuck are you? CHEERING Colin, there's a lot of people here. Sure are, Greg. It fucking worked! CHEERING Round of applause for Tim Gettys. Best mention tonight. I need everyone to turn around and boo Matt Scarpino who said the crowd... He said it wouldn't work. He said surfing wouldn't work. Ooh! Nick, is that the first time Matt Scarpino's ever been wrong about anything? Uh, yeah. I'll be honest, I did not think that was gonna work either. You're a hater. The Scarpinos are a bunch of haters. I believed. Oh, thank you. I appreciate it. Ladies and gentlemen, wow. Wow. CHEERING I'm not gonna cry this early. Thank you all for coming. Thank you all for believing in this. We do this for you and this is... Man, the Kinda Funny Live one was awesome and building this community has been awesome, but, like, this was the one, man. Three days early,",
      "start": 1022.56
    },
    {
      "text": "for believing in this. We do this for you and this is... Man, the Kinda Funny Live one was awesome and building this community has been awesome, but, like, this was the one, man. Three days early, you were all going and doing things together without us needing to tell you what to do. CHEERING I go to the airport to get my mom and a bunch of you are there legitimately arriving. We are so, so proud. We're so, so proud to be a part of this. We have so... I love you too. You know that. CHEERING We have so much dumb shit planned for you tonight. CHEERING Strap in. Colin, is it gonna be a good show? Do you feel it somewhere? I feel it in my balls. By the way, it looks like Portillo Pete on the stage right over there. Right, well, don't know why I gave you the microphone for that. A lot has happened since Kinda Funny Live. A lot has happened since Kinda Funny Live, the original, one year ago, but we learned a lot in that time, Tim. We learned that people love press conferences. They love",
      "start": 1087.56
    },
    {
      "text": "since Kinda Funny Live. A lot has happened since Kinda Funny Live, the original, one year ago, but we learned a lot in that time, Tim. We learned that people love press conferences. They love news specifically about us and about video games and stuff like that, so we thought rather than put the press conference at the end of the show this year, we put it at the front. But something else we learned, both on Thursday's Game Over, Gregory Show topic, and of course, for the last year, is that before you guys ever get any news, man, do you love dumb internet videos played before that news. CHEERING Just fucking dumb, dumb shit, so we thought we'd start the press conference that way. CHEERING MUSIC PLAYS We've seen some shit we ain't never seen before. Holy shit! That thing is big, Tim. It looks weird. We gotta call the aquarium or something. You have to understand I'm Scarpino. I'm not anyone to trifle with. CHEERING Ho, ho, ho, ho! It's all perfectly legal. The Channel 11 Prime movie",
      "start": 1135.56
    },
    {
      "text": "looks weird. We gotta call the aquarium or something. You have to understand I'm Scarpino. I'm not anyone to trifle with. CHEERING Ho, ho, ho, ho! It's all perfectly legal. The Channel 11 Prime movie normally scheduled at this time will not be seen tonight, so we can bring you the following special program. Welcome to the Kinda Funny Aspen Award Champions Finals, featuring regional finalists from all around the United States competing for the title of America's Best We are the champion! CHEERING Our host, the Video Game Awards trending favorite of the year, Brad Miller! With the pride of Long Island, Colin Moriarty! Mr Ice Cream Scoops himself, the Brendan Cessna Master loser, Nick Scarpino! And star of Ball and Sixtah, the beautiful Tim Petty! Ladies and gentlemen, prepare your bodies and souls for I Am Not Money! MUSIC CHEERING MUSIC CHEERING CHEERING That is the type of shit you can never unsee. But now it's time for the 2016 Kinda Funny press conference. From the spare bedroom",
      "start": 1211.56
    },
    {
      "text": "and souls for I Am Not Money! MUSIC CHEERING MUSIC CHEERING CHEERING That is the type of shit you can never unsee. But now it's time for the 2016 Kinda Funny press conference. From the spare bedroom itself, please give it up for president of Kinda Funny Computer Entertainment America, Jack Tretton. Hey Kinda Funny fans, welcome to the Kinda Funny press conference for 2016. Are you pumped to hear about everything Kinda Funny has up its sleeve for the future? It's hard to believe that from this room, four, sometimes five best friends gather around this table and create nearly ten hours of content for you each and every week. It's harder still to believe that you care, but here you are, the most dedicated fans on the face of the earth, gathered in San Francisco to celebrate Kinda Funny, both the present and the future. On behalf of Greg, Colin, Nick, Tim and Kevin, thank you for caring. You make Kinda Funny the force it is on the internet. You make this community so special and you make",
      "start": 1296.56
    },
    {
      "text": "the present and the future. On behalf of Greg, Colin, Nick, Tim and Kevin, thank you for caring. You make Kinda Funny the force it is on the internet. You make this community so special and you make it so that Portillo gets fed. You are Kinda Funny. But enough of that, let's get to all the announcements the guys have lined up for you this year. First up. Hi. It is fucking hot in here. Did you enjoy that little number? That was a lot of fun. You should have seen Nick teaching us that one. All right, so, well, first of all, welcome to San Francisco. It's not Long Island, but it'll do. Now last year during the press conference, we talked about Colin and Greg live and you know how fucking terrible it is. But this year, I don't want to spend too much time talking. I made a little video for you guys about something I've wanted to do for a while. I think you're going to like it. Check it out. Video games are fun. I mean, that's kind of what binds us here on Kinda Funny, right? I'll",
      "start": 1409.32
    },
    {
      "text": "for you guys about something I've wanted to do for a while. I think you're going to like it. Check it out. Video games are fun. I mean, that's kind of what binds us here on Kinda Funny, right? I'll occasionally rant about politics and bore my colleagues to death. Greg will review Oreos and what is easily our two channels most inane show. Nick will pine every now and then about his adoration for Starbucks. Tim will discuss his unquenched thirst for literally any kind of fame and Kevin? Well, Kevin will do Kevin things. But really at our core as a business, we're about video games and I suspect we always will be. And yes, they're fun. Games are fun. They're fun to play, to look at, to collect. You know what I find most fun about gaming? As I get older, it's coupling playing them with talking about them, thinking about them, making them intellectual, appreciating them as art. It's why review scores are stupid, why clickbait is contrived, why a lack of substance equates to a lack of",
      "start": 1486.14
    },
    {
      "text": "about them, thinking about them, making them intellectual, appreciating them as art. It's why review scores are stupid, why clickbait is contrived, why a lack of substance equates to a lack of esteem for our beloved medium. It's why podcasting is important, why streaming is essential, and why foundationally we owe it to gaming to take it more seriously. So where am I going with this exactly? Well, I'm going to announce a new show. Duh. Kinda Funny's very first show before we were even called Kinda Funny was called A Conversation With Colin. And a lot of you really liked it. You liked it so much that when we tried to cancel it following what was supposed to be its last season, you spoke out and asked us not to. And we listened. And to be truthful, we thought we'd have gotten around to new episodes by now. But Kinda Funny is, well, kinda blowing up. And time is getting away from us. That's why A Conversation With Colin is coming back, but just in a new form, all about games, and minus",
      "start": 1522.9
    },
    {
      "text": "episodes by now. But Kinda Funny is, well, kinda blowing up. And time is getting away from us. That's why A Conversation With Colin is coming back, but just in a new form, all about games, and minus the Greg. The guy suggested we call it Colin Was Right, and damn, what a good, truthful name it is. Because as you know, I'm always right. Except for those times I was wrong. But we don't talk about those times. Colin Was Right will launch sometime later this year, and will be a weekly show informed by games and modeled after some of the great programming already out there, both within and outside of the industry. From my friends Jim Sterling and Danny O'Dwyer and their work on The Jimquisition and The Point, respectively, to more famous mainstream fare like John Oliver's Last Week Tonight and Real Time with Bill Maher. Guys and gals, I simply cannot wait to do this show. What I want to do is give you guys a little glimpse into my mind. Let's not only talk about how we play games, but why.",
      "start": 1557.58
    },
    {
      "text": "Real Time with Bill Maher. Guys and gals, I simply cannot wait to do this show. What I want to do is give you guys a little glimpse into my mind. Let's not only talk about how we play games, but why. Let's consider gaming not only as a hobby, but as a business. Something loaded, meaningful, inspired, and even political. Let's talk not only about why games are fun, but why they matter. I'll see you soon, and let me just say this. I think you're gonna like this one. So what the fuck you think about that shit? Alright, so moving right along with the announcements. So here's the thing. Zach Wenzel, where you at? Scream. I hear some noises. Cool. There you are. Zach Wenzel. This motherfucker right here is one of the most talented animators I know. You guys might know him from Kinda Funny Doodles. He does this thing where he animates it. Well, we liked it a lot. And we're like, hmm, what if we just did that for us? So check this out. So what I've been saying lately is that I don't like bad",
      "start": 1593.5
    },
    {
      "text": "He does this thing where he animates it. Well, we liked it a lot. And we're like, hmm, what if we just did that for us? So check this out. So what I've been saying lately is that I don't like bad guys. Everybody knows this. Right. I'm saying I'd have to tip my hat. I'd respect them a little bit if any of these people did it with a bit of panache. They did it with a bit of theatricality. The idea of how come there's never been a villain that takes over all the TVs and all the people. Right? It turns out that's really hard to do. But again, I would respect it. I would respect it so much. That'd be amazing. We're all out to lunch and we're chilling and all of our phones turn on. It's like, hello. It's me. The Klondike Bar. Here's why. You came out and we were like, I would really admire a super villain who just dropped 100 bears into the middle of San Francisco. I did say that. Originally I said what I wanted to do was have a semi truck and then have the back of the semi filled with",
      "start": 1642.58
    },
    {
      "text": "a super villain who just dropped 100 bears into the middle of San Francisco. I did say that. Originally I said what I wanted to do was have a semi truck and then have the back of the semi filled with bears. And they park there and then we all hit the button and it goes boom and the sides fall down and every one of these bears just pour out. That is like visually cool. There's no way that... Still going to take time to figure out our plan. I say we double drop them. No. You mean air drop? I say we air drop 100 bears. That is also a fucking awesome image. We have to have three, like one big one, another big one, and then one small one that we make and we spray paint them all and then put the big white spot on their tummy. And that way these ones come out. People are like, these Charmin bears are killing me. We have to make one looks like Yogi and one looks like Boo Boo. We got fucking Pooh Bear coming out. Paddington Bear is the general. Lord Commander General Paddington Bear rides on",
      "start": 1689.1
    },
    {
      "text": "are killing me. We have to make one looks like Yogi and one looks like Boo Boo. We got fucking Pooh Bear coming out. Paddington Bear is the general. Lord Commander General Paddington Bear rides on the back of another bear. An even bigger bear. That's the goal we're driving at, right? You know what I mean? Because again, Obama would come on and be like, state of emergency in California, we're sending in the fucking army and shit. And he's like, this is deplorable. We won't deal with terrorists like this, but I got to respect them. How did they get a hundred bears? Hello everyone. Wow, there's a lot more people than I thought there would be. Hi everybody. My name is Danny Shepherd. Yeah, you guys might recognize me. I was on an episode of the GameOverGreggy show. I run a channel called Isma Hawk. We do. Yeah. Oh my goodness. Okay. So we make action scenes and like videos where superheroes fight each other, like flash versus quicksilver, all that good stuff. I just want to say, I",
      "start": 1737.06
    },
    {
      "text": "Isma Hawk. We do. Yeah. Oh my goodness. Okay. So we make action scenes and like videos where superheroes fight each other, like flash versus quicksilver, all that good stuff. I just want to say, I started off just like a best friend, just like you guys. I nervously ran into Greg, Tim and Nick and fan boyed out like crazy at VidCon two years ago. And I was just like a best friend, just like you guys. And they kind of welcomed me in and invited me to be a part of their community. And so it reminds me of when we were on, when I was on the GameOverGreggy show, we talked about fictional versus battles that we really want to see. So a lot of these are pie in the sky ideas we never thought would be possible. And with the help of some really talented people and Kinda Funny, we were able to actually set something up from one of those ideas that we had while on the GameOverGreggy show. So I don't want to take up too much more time, but we prepared a little teaser for our new video that",
      "start": 1825.1
    },
    {
      "text": "actually set something up from one of those ideas that we had while on the GameOverGreggy show. So I don't want to take up too much more time, but we prepared a little teaser for our new video that we're collaborating with Kinda Funny on. So without further ado, yeah, this is the fifth episode in our Minute Match Up series. It's just a little teaser. So without further ado, check it out. What do you think so far best friends? Yeah, it's exciting stuff. If you clap, I don't know. I shot this weeks ago. But that's not all Kinda Funny is looking to do in 2016 and beyond. Let's check in in our next exciting world premiere. Hi. I'm glad a few of you picked up on the beyond. So what about Tana? What about Martu? So we come out here every year, twice now, and show you stuff that we're making. You know, Zach's making the animated series. It's going to be on our YouTube channel every week now. Hooray. And like here we're working on a Colin was right show. Hooray. And it'll be out soon. And we",
      "start": 1873.22
    },
    {
      "text": "know, Zach's making the animated series. It's going to be on our YouTube channel every week now. Hooray. And like here we're working on a Colin was right show. Hooray. And it'll be out soon. And we do all these things that you know, because they're in our hands, they will happen. Now they may be really late. We may not warn you they're going to be really late, but they'll happen eventually. You're like, all right, great. The next thing I'm here to show you is something I find indescribably cool. But it comes with a huge but not just my own but it may never happen. It's one of those that we're hard at work on. But once we're done with it, it's out of our control. So the people we need to give it to they may say awesome, let's go. They may not for us. And that's totally within their right. And you are not allowed to be mean on Twitter. Unless I instruct you one day that I need help, but don't just. Out of the blue don't be mean about this because it is a work in progress. It's something",
      "start": 2007.42
    },
    {
      "text": "you are not allowed to be mean on Twitter. Unless I instruct you one day that I need help, but don't just. Out of the blue don't be mean about this because it is a work in progress. It's something I'm very impressed with though and I want to make sure we talk about it. So ladies and gentlemen, let me introduce you to the Kinda Funny PlayStation 4 app. So you log in with your Kinda Funny account, which will be linked to your app, obviously your iOS, everything else you dropped right here. Our featured videos, everything we want to show you obviously won't be the book clubs because they didn't go too well. Other stuff will show you, who's this Japanese fella? And you'll jump on, you'll be able to watch PSI.WXO, it'll pull the YouTube video, you'll be able to comment if you've logged in with your Kinda Funny account. If you were to leave this you can go to KindaFunny.com, pick up where you left off. You can jump in, see the latest stuff, because sometimes you guys miss our latest stuff.",
      "start": 2049.98
    },
    {
      "text": "your Kinda Funny account. If you were to leave this you can go to KindaFunny.com, pick up where you left off. You can jump in, see the latest stuff, because sometimes you guys miss our latest stuff. Thanks for watching that Odin Sphere unboxing. You can go in and buy your show, so you see Game Over, a Gregi show. Again it'll be working of course in a way that's like here's the most recent stuff. But you can pop in, you can see whatever. And of course, most importantly, you can jump in and you can search the Kinda Funny archives for things you want to see and not get every other Kinda Funny video about Portellos. And you see this wiener dog you all love so goddamn much. And that's a glimpse at the Kinda Funny app. James Schuler is working on it with a team of developers. James is here of course, please give him a hug and a shout when you get it. I'm super impressed with it, obviously it's a passion project for us, I know it is for you too. We hope to get it out to you, we will keep you",
      "start": 2089.9
    },
    {
      "text": "please give him a hug and a shout when you get it. I'm super impressed with it, obviously it's a passion project for us, I know it is for you too. We hope to get it out to you, we will keep you updated, kinda, but I wanted you to see something cool. Alright, that clearly wasn't a Kinda Funny call out. They'd go like this, Kinda! Ladies and gentlemen, please put your hands together for the producer slash seducer, Nick Scarpino. Thank you very much, Greg. How's everyone doing out there tonight? I'm doing well also. I love you. You'll remember back in January, like four months ago, we funded successfully 12 episodes of Kinda Funny the animated series. But we also funded an intro for Kinda Funny the animated series. And you're about to see that intro right now. At least half of it, because in true us fashion we only got half of it done. So, what you're gonna see, or rather hear, is the song that Tim and I flew down to record in LA that was put together by Corey McMaster. He's one of the",
      "start": 2130.7
    },
    {
      "text": "true us fashion we only got half of it done. So, what you're gonna see, or rather hear, is the song that Tim and I flew down to record in LA that was put together by Corey McMaster. He's one of the best friends out there that reached out to us and said, yo, I actually know what I'm doing, do you guys want me to help you with this? And we were like, yeah, because we don't know what the fuck we're doing, so let's do it. So he brought together a very talented group of musicians and together they put this together. So what you're gonna see next is an animatic for what we want to do with the intro. And in typical me fashion and in typical Tim fashion, we love the 80s and 90s, so everything you see up there we're going to be recreating in the style of the animated show. You're gonna recognize probably a few shots because we stole them from every popular cartoon from the 80s and 90s. We are also gonna be showing a small promo for the show the kids like to watch in Kinda Funny the animated",
      "start": 2194.82
    },
    {
      "text": "probably a few shots because we stole them from every popular cartoon from the 80s and 90s. We are also gonna be showing a small promo for the show the kids like to watch in Kinda Funny the animated series. It's a show that we have talked about before and I don't want to spoil it because if you remember it, it'll be really funny. Like the 2% of you out there that remember it and the rest of you are like, what the hell is this? So without further ado, you're gonna see the intro, which the animatic and a promo for the hottest TV show to ever come to an animated show that's on the internet. Roll it. Oh, the Kinda Funny crew. Yeah! It's nothing Frank can do. We're talking with Bell. We're here to investigate your clients. I told you, we're private investigators. My man. This is my favorite show ever. I can't wait for season 24. There have been 23 other seasons of this shit. Well that about wraps it up for Kinda Funny Live's 2016 press conference. What did you think? Kinda Funny does this",
      "start": 2235.78
    },
    {
      "text": "ever. I can't wait for season 24. There have been 23 other seasons of this shit. Well that about wraps it up for Kinda Funny Live's 2016 press conference. What did you think? Kinda Funny does this for you. Thank you for coming to the Regency Ballroom tonight. Thank you for supporting these chuckleheads. And thank you for being a best friend. Good night. Hey best friends, Eric Thompson here and I hope that you are doing well. Very honored to be with you at Kinda Funny Live to offer an invitation for all of you to join Team Kinda Funny for this year's Extra Life campaign. Extra Life is a charitable organization that raises funds to support the work of Children's Miracle Network hospitals all across the United States and Canada. Last year was Kinda Funny's first year involving Extra Life as Kinda Funny. And Team Kinda Funny raised just under $55,000. And that amount earned us the 10th place ranking of all teams. We are number 10 out of 6,461 teams. That is amazing. But this year we are",
      "start": 2348.14
    },
    {
      "text": "Kinda Funny. And Team Kinda Funny raised just under $55,000. And that amount earned us the 10th place ranking of all teams. We are number 10 out of 6,461 teams. That is amazing. But this year we are looking to go beyond those numbers and to do that we need your help. I'm your co-captain this year and here with more information about how to get signed up and started is your other co-captain, Lauren. Hey guys, as Eric said, I'm your other co-captain, Lauren. If you want to join this year's Extra Life, all you need to do is go to kindofunny.com slash Extra Life and join us there. As Kinda Funny grows, we are hoping to see our Extra Life campaign grow as well. We saw what great potential we had last year as our first year. And so as the community grows, we really want to strive to push Extra Life and to push the money that we could potentially raise as a community. So if you do have interest, please go to that link, kindofunny.com slash Extra Life and join us there. If you're not sure and",
      "start": 2444.14
    },
    {
      "text": "and to push the money that we could potentially raise as a community. So if you do have interest, please go to that link, kindofunny.com slash Extra Life and join us there. If you're not sure and you're still on the fence, you can sign up. It's not like you're committed to anything if you chose not to later. But just think of it as you're playing video games to heal kids. Twitch even has like an Extra Life thing to where people can just go and see all the different Extra Life streams and donate from there. So it's a great thing and they've really organized it well. And there's really not a whole lot of reasons to not do it, especially if you love playing video games. So if you happen to see me here at Kinda Funny Live 2, just come up to me if you have any questions. I do not mind and I will answer them as best as my ability. And until then, have a great Kinda Funny Live 2, everyone. AUDIENCE MEMBER 1 & 2 CHEERS AUDIENCE MEMBER 2 & 3 CHEERS So patriotic. Hey everybody! So how's",
      "start": 2507.14
    },
    {
      "text": "I will answer them as best as my ability. And until then, have a great Kinda Funny Live 2, everyone. AUDIENCE MEMBER 1 & 2 CHEERS AUDIENCE MEMBER 2 & 3 CHEERS So patriotic. Hey everybody! So how's everybody doing? Yeah? You know, as your internet dad, I feel compelled to tell you that there's a bar back there. I want all you young people to stay hydrated in one way or another. Also, if you can all get jobs, that would be great as well. Listen, get comfortable, settle in, just relax. If you're feeling it, maybe just take off your shirt. Because I guarantee someone in this next segment is going to take off their shirt. Ladies and gentlemen, it's the GameOverGreggy Show! CHEERS CHEERS Greg, put your tongue on that. Nope, that doesn't sound like a good idea at all. This does not get old at all. What, podcasting? No, just coming out, people making noise. CHEERS What's up everybody? Welcome to the GameOverGreggy Show. Wait, wait, Greg, we're missing something. What are we missing this?",
      "start": 2554.14
    },
    {
      "text": "all. What, podcasting? No, just coming out, people making noise. CHEERS What's up everybody? Welcome to the GameOverGreggy Show. Wait, wait, Greg, we're missing something. What are we missing this? Oh, the thing. CHEERS Much better. Better? All right, all right. Now you can start. What's up everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer slash seducer, Nick Scarpino. Hello. Show the crowd them ice cream scoops. CHEERS There it is. Oh my god. Did your wife just pass out somewhere in the balcony? Yeah, she's probably gone. She was like, oh, they're wearing shorts. Forget it, I'm out. Over here at the Pride of Long Island, Colin Moriarty. It's good to be here with you today. It's good to be here with you today as well. And rounding out the group, the pure one, Tim Gettys. Let's hear it for us. CHEERS Are you Kinda Funny live too? CHEERS Was it worth the dollar so far? CHEERS One gentleman here in the glasses did not cheer.",
      "start": 2682.14
    },
    {
      "text": "out the group, the pure one, Tim Gettys. Let's hear it for us. CHEERS Are you Kinda Funny live too? CHEERS Was it worth the dollar so far? CHEERS One gentleman here in the glasses did not cheer. So now you are my mission, sir, in the collared shirt. I will get you. I will get you. My white whale. So you won't get him. I mean, I read the clip notes, the spark notes, just to get through the final. I figured in the end they get him. I believe. Thank you. How are you doing, Tim? I'm fucking... I'm watching all the fucking Twitter videos and this shit. This is not real life, man. Thank you. Thank you all so much. Seriously. CHEERS Thank you all very, very much for coming. I figure most of the show will be about this. So might as well just start. If you didn't know, this is the GameOverGreggy show. Each and every week, four, sometimes five, best friends... ...gather around this table. Each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com",
      "start": 2734.14
    },
    {
      "text": "show. Each and every week, four, sometimes five, best friends... ...gather around this table. Each bring a random topic of discussion for your amusement. If you like that, head over to patreon.com slash kindofbunny. Real quick, how many of you do that? CHEERS Why are you raising your hands? Clap and cheer. CHEERS There we go. If you have no bucks to toss our way like all those saps at home reading about it on Twitter... ...go to youtube.com slash kindofbunny where we post a topic on topic day by day... ...until the entire show posts one big episode of a video on Friday. Crushed it, Greg. You crushed it. Colin? Yes. Lead off today. Well, Eric Cashmore couldn't be with us here today. He's a friend of the show, obviously. Last year, behind closed doors backstage... ...he brought a bottle of pappy for us and told us to drink it. He always reminded me, because I buy a good bourbon and then I'm afraid to drink it... ...that he's like, you buy a good bourbon and drink it. So I bought this",
      "start": 2793.14
    },
    {
      "text": "pappy for us and told us to drink it. He always reminded me, because I buy a good bourbon and then I'm afraid to drink it... ...that he's like, you buy a good bourbon and drink it. So I bought this bottle of pappy for $200 a few months ago. Baller! Thank you, Patreon. Technically, they bought that bottle. And I want us to drink it tonight. No, just we'll have like an ounce for each. You want me to chug that bottle? Don't... No. No. What the fuck? Chug! Chug! Chug! Chug! Chug! Chug! Chug! Chug! Chug! Chug! Chug! I mean, if you want to, but... No, no, I don't want to die. Now the problem is that some gentleman took the cups that I had. Who were the gentlemen who took the cups? Jeff, you know, and Gus, and these schmucks that just take... There's four glasses sitting on top of this thing. I'm like, we'll just use them. And then they drank the rest of my McKenna that I had. I had another bottle of bourbon. And they drank the whole thing. Now for the record, they almost went in on this.",
      "start": 2849.14
    },
    {
      "text": "I'm like, we'll just use them. And then they drank the rest of my McKenna that I had. I had another bottle of bourbon. And they drank the whole thing. Now for the record, they almost went in on this. Gus was like, oh, we had that and you didn't let me drink that? And Jeff's like, I don't think that was for us just to drink willy-nilly. So I need someone to do me a favor? Well, the bartenders are right there. Yeah, I need four cups from the bar. Sometimes five. Sometimes five cups. From the bar. Crowdsurf the cups up to the front. We really would appreciate it. I know you can do it. Thank you. And we'll wait patiently up here. Side ups. Tim, did you have any doubt that the crowdsurfing was gonna work? I mean, doubt isn't the right word. I mean, I had a suspicion that it wouldn't work. Yeah. But I didn't care. I was like, I'm gonna do it. If it fails, it's funny. If it works, it's epic. And it was fucking epic. I was skeptical. I was skeptical. I was skeptical. I was skeptical. But",
      "start": 2900.14
    },
    {
      "text": "Yeah. But I didn't care. I was like, I'm gonna do it. If it fails, it's funny. If it works, it's epic. And it was fucking epic. I was skeptical. I was skeptical. I was skeptical. I was skeptical. But before, before when, uh, before my entrance, when you- Cups! We have cups! Watch them go! Watch them flip-flop! Thank you, kind sir. Before, before I went out, I got to watch all your guys' entrances from up there. Cause nobody knew I was up there. And I was just, I was just watching. And I was just like, this is the fucking coolest thing ever! I'm seeing Nick coming out to fucking queen. And I'm like, what are we doing? I don't know if that's the coolest thing ever. Oh man, it was, it was pretty fucking cool. It is queen, yeah. This is all great. And the Undertaker? Come on, son! It was cool. And then making the statement so many of you cowards are afraid to make. That's right, Batman v Superman, good movie. What are you gonna do about it? Frank Sizemore? I love you Frank Sizemore. There",
      "start": 2938.14
    },
    {
      "text": "And then making the statement so many of you cowards are afraid to make. That's right, Batman v Superman, good movie. What are you gonna do about it? Frank Sizemore? I love you Frank Sizemore. There it is, you know. See? Oh my god. I don't know if you really know, I just gave you the sign. Kaylee knows? Kaylee fucking knows. Well, cheers. Cheers guys. Cheers to you. If you have a glass, if you have a glass, raise it please. Ladies and gentlemen, you're all Kinda Funny. This is what it's about. Thank you for another awesome year. Come high. Did you just shoot Pappy? Yeah. There's something you don't know about me, Colin. That was the most expensive shot you'll ever have. I am a grown-ass man. And I do shit the way that I fucking want to. Fair enough. I'm also ignorant and don't know shit, so whatever. I'm not a thousand percent sure, but I feel like that exact same thing happened at CODA putting Live at One. Yeah. No, you knocked it over. I knocked it over, yeah. But I feel like you",
      "start": 2984.14
    },
    {
      "text": "so whatever. I'm not a thousand percent sure, but I feel like that exact same thing happened at CODA putting Live at One. Yeah. No, you knocked it over. I knocked it over, yeah. But I feel like you shot it as well, no? Probably. It sounds like a Tim move to do. It does. Yeah. I'm enjoying it. You sip it gently. We got some rabble-rodders here. I know. Jeez Louise. I really like, I look out. Joe! Joe! Joe! Joe! Joe! Joe! Joe! Joe! Joe! Joe! I like that we see so many familiar faces here, like we've seen you guys on Twitter, on Facebook, on the forums. Everyone's so fucking awesome to see all in real life. SnowBikeMike, shout out to SnowBikeMike. What up, SnowBikeMike? SnowBikeMike, maybe one of my favorite people I've ever talked to in my life. That was, we lost track of time during our little Patreon conversation a week or two ago. Thank you. Appreciate you. Then I met today for the first time ever Greg Atlas. Never met him before. No, wait, hold on. Shit, I don't know how we're",
      "start": 3032.14
    },
    {
      "text": "little Patreon conversation a week or two ago. Thank you. Appreciate you. Then I met today for the first time ever Greg Atlas. Never met him before. No, wait, hold on. Shit, I don't know how we're gonna do this. Oh, I'll get him up. Okay, okay. Bring him up, bring him up over here. Greg, Greg, yeah, yeah. Not on there. No, no, no, no, no. Careful of the lights. They're expensive as shit. This way. Delete your Twitter, please. Delete the Twitter. Pick him up, Greg. Pick him up! The strength of a bear. So, I... Wait, there's more. Batman! What? Oh my fucking god! For those who didn't see, he shaved his chest hair into the bat symbol. I knew shirts were coming off, so, yeah. I like this guy. So, why don't you show the people what you did to yourself? Okay, so, in March of this year, I went and got the Kinda Funny Live tattoo logoed on my arm. I said that backwards, didn't I? That's okay, I didn't know what you meant. You're a nervous young man. Got the Kinda Funny Live logo. You're",
      "start": 3079.14
    },
    {
      "text": "and got the Kinda Funny Live tattoo logoed on my arm. I said that backwards, didn't I? That's okay, I didn't know what you meant. You're a nervous young man. Got the Kinda Funny Live logo. You're just saying words. What's your name? Zach. Zach. And you make exceptional life choices. I make great life choices. Let me see it. This is by the way, look at that beautiful... Stand up. Go to the catwalk. There's a fucking catwalk. Zach is sporting the finest matches from kindafunny.com/store. While debuting his new Kinda Funny tattoo. It's a dream to be up here, by the way, so thank you. No problem, thanks for coming. Thank you for scarring your body for life for us. What do people say? How sad would you be if we redesigned the logo? I would get another one somewhere else. Tell me how you like it. That's all I need. He's playing to the crowd, right? He's nailing it, he's good. He's natural. They're not shots! I'm not 21, I can't drink here. He's finding us better than here. What",
      "start": 3137.14
    },
    {
      "text": "you like it. That's all I need. He's playing to the crowd, right? He's nailing it, he's good. He's natural. They're not shots! I'm not 21, I can't drink here. He's finding us better than here. What an honest young man. Man, at 21 I would have just fucking been chugging it right now. I wouldn't even care. Or under 21. I would call and sip it, but Greg, you have to chug it. It's so smooth. It's too smooth, some might say. It is. This is the kind of one you drink right before you take a nip before work. Nobody will know. I actually just dumped it in another bottle. It's a Jim Beam. I've done that. Alright, now don't... Come on, you're just being a good kid. You're being a good kid. Alright, you're a manager, it doesn't matter. It's the most important role at Gamestop. No, Papa John's actually. Oh, Papa John's? Now I had a friend who worked at a Papa John's and did bad things to the sauce. You ever do that? No. Okay. What qualifies as a bad thing, Greg? You don't want to know. You know",
      "start": 3196.14
    },
    {
      "text": "Oh, Papa John's? Now I had a friend who worked at a Papa John's and did bad things to the sauce. You ever do that? No. Okay. What qualifies as a bad thing, Greg? You don't want to know. You know what the bad thing is, Tim. I know, I want to hear it. It's a nice slow jerk, it takes a while. Gotcha, gotcha. Okay, okay. We say it's like one beat per minute or slower than that? Depends on the day. Collin, can I see it? Is that accurate? Well, he speeds it up when he gets closer to the base because he's just... That's accurate! There it is. Is that the face that goes with it, by the way? Yes. Right now, some Cosmos is playing on Netflix. Collin's just enjoying himself, nobody cares. Oh, Neil. Wow, you're going to New School. Fuck Carl Sagan. Yeah, okay, whatever. But he's young, he's young, he doesn't know. Zach, thank you for getting the tattoo. No, thank you for the content you made. Thank you for buying one of the least popular t-shirts in the city. You got another one? You have one",
      "start": 3241.14
    },
    {
      "text": "he doesn't know. Zach, thank you for getting the tattoo. No, thank you for the content you made. Thank you for buying one of the least popular t-shirts in the city. You got another one? You have one too? You got another one? Where? Let me see it. On his car. Get up here! Get the fuck out of here! No, no, no, no, no! Stop it! Amy Gill, stop him! You got to go over here and around here. The lights are very expensive and when you touch him, Matt Scarpino loses five years of his life. And he's pretty old to begin with. Also, shout out to Amy Gill, coming all the way from Ireland. Amy Gill! From Ireland! Hold on, hold on, hold on, Nick, sing it! Sing it! Sing it! What am I supposed to sing? What song would you strip to? Oh yeah, fucking Let's Do It. Oh no. Jump on in! Let's do it! Ride it! Ride the boat! Jesus Christ. Why are we on a... From Pinky and the Frig. In a Kinda Funny balloon. You're getting fucking creative with it. Hold on, hold on. He was ready for the balloon drop. We're",
      "start": 3282.14
    },
    {
      "text": "the boat! Jesus Christ. Why are we on a... From Pinky and the Frig. In a Kinda Funny balloon. You're getting fucking creative with it. Hold on, hold on. He was ready for the balloon drop. We're going to take a selfie and send it to Rob Paulsen. Why not? Thank you so much, man. Thank you. Thank you, Zach. Can we play the Shock game before I leave? No. What's the Shock game? No, no, no, no. Oh, no, no, no. You didn't see anything. I don't know what you're talking about. Crowdsurf back into oblivion. I actually crowdsurf. Yeah! Who's got me? That way? That way? How about you go out at the same time? You crowdsurf out that way, you crowd out there. Nobody kill him. Again, Matt Scarpino, scared of him. Scarpino, scared of killing kids. Gently. Can we do this gently? Gently crowdsurf. Now look at this one. Whoa, he went dick first. You don't see the dick first one a lot. Wow, that is a dick first fucking stage nod. I think he got stopped. Security stopped that pretty quick. Amy Gills,",
      "start": 3333.14
    },
    {
      "text": "look at this one. Whoa, he went dick first. You don't see the dick first one a lot. Wow, that is a dick first fucking stage nod. I think he got stopped. Security stopped that pretty quick. Amy Gills, catch him! Amy Gills, he's coming right to you! Oh my god. Oh no. Oh no. Put him down, put him down, put him down. He got that, it's fine. No more crowdsurfing. That was the final crowdsurf of the night. Shout out to Louis Menchaca who caught him and gets to take him home. Like a foul ball. Like a shiny Pokemon. Like a shiny Pokemon. It is so hot. Oh my god. I can only imagine. Are you still wearing the leotards? No, I took them off. Oh yeah. Yeah. I want you to know how bad it looked a second ago backstage. I can only imagine how much lactation there has been since then. This is the sweatiest we've ever been. Look guys, it's Batman! It looks more like a moth. Holy shit. Oh god, what are we doing up here? I don't know. We're entertaining. They know what they signed up for. It's true. All",
      "start": 3401.14
    },
    {
      "text": "we've ever been. Look guys, it's Batman! It looks more like a moth. Holy shit. Oh god, what are we doing up here? I don't know. We're entertaining. They know what they signed up for. It's true. All the grandmas like, where you going? So Greg, you often tell me before we start shooting the show, you're like, make sure my hair is good, let me know. You need a lot of help right now. So. Nailed it. You know what, you're good. What's wrong with it? Describe the problems. You're getting a little bit, you know what, I don't know actually. Sweat. It's a nice, yeah, sweat. Sweat. Should I get the Undertaker hat again? I think I threw the crown, I don't know where it is. Are you crazy? It looks fine. Now it looks good. It looks like I'm hot. I'm into it. Thank you for that. Nick, how are you? I'm well. How's your leg? It is good as well. Okay. I can't really tell, the pappy is kicking in, so everything feels just right. Yeah? Yeah. It's good. Right beforehand, you blew out your thigh just",
      "start": 3459.14
    },
    {
      "text": "I'm well. How's your leg? It is good as well. Okay. I can't really tell, the pappy is kicking in, so everything feels just right. Yeah? Yeah. It's good. Right beforehand, you blew out your thigh just practicing. It was my calf. Oh, sorry, my apologies. Yeah, it was my calf. It was my calf. Oh, sorry, my apologies. It was my calf. It was my calf. It was my calf. Oh, sorry, my apologies. Yeah, I've never pulled a calf before, but I pulled that today. Yeah. Turns out, none of us are dancers. Yeah, that's the funny thing about this. And we should have known that going into this. This entire show, I was like, all right, because me and Nick had a conversation about what, four or five months ago, where we're like, where are we going to do this? We decided this place. And we're like, should we get seats? I'm like, no, I can't crowd surf if we get seats. Yeah, he said that. And then Nick's like, well, I mean, they're not going to stand for this whole time. And I'm like, we're going to give",
      "start": 3511.14
    },
    {
      "text": "get seats? I'm like, no, I can't crowd surf if we get seats. Yeah, he said that. And then Nick's like, well, I mean, they're not going to stand for this whole time. And I'm like, we're going to give them a show worth standing for. It's very true. And oh, motherfuckers. We did. But that means, that means that we have to be really active. And by really active, I mean kind of active, which to me is extremely active. Again, the guy in the white collar shirt did not seem to react positively to the standing. Who is this fucking guy? I don't know. Where is he? Raise your hand, guy in the white collar shirt. You see this grinning guy in the flannel? Where? See the grinning guy in the flannel? He starts to raise his cup. Move to the side. Move to the side. That's the guy right there behind him. He's not even looking at us. What can we do for you, sir? Did your son drag you to the show? I'm so sorry. He's heckling. You asked for all ages. We gave you all ages. He's smiling now, at least. We did",
      "start": 3544.14
    },
    {
      "text": "not even looking at us. What can we do for you, sir? Did your son drag you to the show? I'm so sorry. He's heckling. You asked for all ages. We gave you all ages. He's smiling now, at least. We did our job. Yeah, yeah, exactly. The whale or the unicorn has been caught. I don't remember the reference, but it was, you know. Well, it was the white whale. The white whale. Yeah. He was never caught. Who's heckling us from the friends and family section? Is my mom talking shit? Your brother was earlier. Hey, shout out to my mom. Hey, shout out to all of the moms. Oh, standing O? You want to do him a standing O? Let's do him a standing O. Let's do it. All right. Let's do this. We came out of them. Now take it off. Jesus Christ. Don't tell my mom. She would. Genuine moments ruined. Greg Miller. Shit. Oh my gosh. That was dark. That went dark fast acne. I'm just trying to get the show. There's a lot in there. Again, I have one man to impress. I'm not going to be happy until he buys a Kinda",
      "start": 3584.54
    },
    {
      "text": "Shit. Oh my gosh. That was dark. That went dark fast acne. I'm just trying to get the show. There's a lot in there. Again, I have one man to impress. I'm not going to be happy until he buys a Kinda Funny Live shirt on the way out. Yeah. What should we do? I don't know. Tim, what do you want to do? I don't know. You want to do like a super cool special thing that these guys would probably like a lot? Are you suggesting the first ever Kinda Funny Live 2 lightning round with our guest lightning reaction lightning game? Yeah. You know what? I think I am. We will crown a champion today of lightning reaction. It will be me. Now how many people have bought lightning reaction? Franklin Sizemore is really into everything tonight. Love it. I like your shirt too. That's a sloth, isn't it? It's a sloth. For the Arctic Sloth. Yes. I'm very perceptive of sloths. Thank you. So you want to bring out special guests? Now who is, everyone is familiar with lightning reaction? You going to put it all the",
      "start": 3664.54
    },
    {
      "text": "For the Arctic Sloth. Yes. I'm very perceptive of sloths. Thank you. So you want to bring out special guests? Now who is, everyone is familiar with lightning reaction? You going to put it all the way up? The best of the, oh I put, oh yeah we're going all the way up. Oh God, I hope it's out of batteries. Do you go to the MLB and say, hey Hunter Pence, pitch slow to me. Hunter Pence doesn't pitch but. On an off day. I thought it was a hard pitch. I thought it was a hard pitch. On an off day. I thought it was a home run joke. Nolan Ryan turns to him and says I can't throw today, get out there. Nolan Ryan, yeah, he's like 65 years old. So? You know, it's like hockey, people stick around a lot. So I'm a little worried about this because I'm all sweaty. And I feel like I learned from Pokemon that water is weak against electricity. Just getting everyone ready for the sounds. Greg, drink this more. Drink two more of these. Should I chug them? Yeah, chug it. No, don't chug it. Chug, chug,",
      "start": 3718.54
    },
    {
      "text": "that water is weak against electricity. Just getting everyone ready for the sounds. Greg, drink this more. Drink two more of these. Should I chug them? Yeah, chug it. No, don't chug it. Chug, chug, chug, chug. Colin, the people love chugs. I'm not going to chug, I'm not going to chug. I'm not going to chug. I'm setting it for four. All right, we're up to four. So for those that don't know about Lightning Reaction, it's a horrible, horrible game. Where four people grab this stupid metal thing, this horrible song plays, when it beeps and the light turns on, the first person to click the button doesn't get shocked. The other three people get the shit shocked out of them. So we're going to do this shit. Let's bring our first ever Kinda Funny Live 2 Lightning Round with the guests, Lightning Reaction, Lightning Game. You've got to shorten that title. It's not going to fit on that t-shirt. Ladies and gentlemen, please welcome Andrea Renee. Yes. Oh my gosh, these lights. They're very",
      "start": 3762.54
    },
    {
      "text": "Reaction, Lightning Game. You've got to shorten that title. It's not going to fit on that t-shirt. Ladies and gentlemen, please welcome Andrea Renee. Yes. Oh my gosh, these lights. They're very bright. They're very bright. Hi guys. Hey, how are you? What are you drinking there? I'm great. Is that a coffee? Thanks for having me. This is what happens when you have Grimecraft get you a drink. Oh, Grimecraft. Good old Grime. It's lit. Jungle juice. It's lit. Andrea, thank you for coming out. Thanks for having me. You guys are the best. Aren't they the best? They're the best. Thank you for all your support. You're a frequent Gamescast contributor. We love that. We appreciate that for you. What are you doing now? Where can people find you? The best place to find out all the things I'm doing, because I'm doing lots of things, is on Twitter, at AndreaRenee. You can find me at Yahoo Esports. You can find me on Gamer Next Door. You can find me in GameStop stores around the country. I'm going to",
      "start": 3813.54
    },
    {
      "text": "I'm doing lots of things, is on Twitter, at AndreaRenee. You can find me at Yahoo Esports. You can find me on Gamer Next Door. You can find me in GameStop stores around the country. I'm going to be doing some cool stuff for E3 I can't quite announce yet. Please follow me on Twitter and you'll find about those plans very, very soon. Let's shock the shit out of you. Here's the thing. Backstage, Bernie's making a lot of ruckus, so I couldn't hear what happens. Don't hold the ball. Just hold one. You want to sit this one out? He started it! When it goes green, Andrea, hit it. Hit the button faster than anyone else. Or you're going to get shocked. Oh, God. Greg, I don't want you to knock it. Oh, damn. Nice! Yes. This is such a dumb idea! Get out of my head, Scorpino! Andrea! Andrea! Andrea! Andrea! She's a fan. We just put fresh batteries in. Good Lord. Well, Andrea, you get to leave a winner. Oh, that was it? That was it! No, I was going to ask you before you go, what do you have to say",
      "start": 3871.54
    },
    {
      "text": "She's a fan. We just put fresh batteries in. Good Lord. Well, Andrea, you get to leave a winner. Oh, that was it? That was it! No, I was going to ask you before you go, what do you have to say about these kids? How have these kids been to you today? Everybody's fantastic. You guys have the best community on the Internet. We know. Let's go down about that. I'm so... I've been doing digital media a long time. You guys so graciously let me tell my story the last time I was on the Gamescast. And there's a lot of really mean people out there on the Internet. They're not in this room. And all the Kinda Funny best friends are the best Internet fans. You guys are awesome. It's so great to meet some of you tonight. I haven't gotten a chance to talk to a lot of you yet, but I'll be around if you see me. You guys can come up and say hello. We can take selfies. We can high five. We can talk about games, whatever you want. So thank you so much for having me. And I won! I won! If she's with like",
      "start": 3934.54
    },
    {
      "text": "see me. You guys can come up and say hello. We can take selfies. We can high five. We can talk about games, whatever you want. So thank you so much for having me. And I won! I won! If she's with like a dopey, blondish, brownish-haired guy, just smack the shit out of his face. How does it feel you lost, sir? You know what? Again, Nick was in my ear. I'm not saying it's under protest. It's under protest. It is under protest. Next, we have the one and only from twitch.tv, Alfredo Plays. This is the game where we put this on our balls, right? Nope, not that. Nope, that's a different game you and Tim play. Okay. If people wanted to find you, where do they go? Twitch.tv slash Alfredo Plays. YouTube.com slash Alfredo Plays. Patreon Alfredo Plays. Okay. I owned it, man. Yeah! You got it. Nick underscore Scarpita. I own that underscore, my friend. No one else has an underscore but me. Alfredo, I want to thank you for all your support this year. You've gone off. Every time they're like, hey, do",
      "start": 3975.54
    },
    {
      "text": "Scarpita. I own that underscore, my friend. No one else has an underscore but me. Alfredo, I want to thank you for all your support this year. You've gone off. Every time they're like, hey, do you want to play this multiplayer shooter? We're like, fuck no, but Alfredo will for us. And you go and do it. So thank you. I got to thank you guys, man, because like my community is everyone. It's a Kinda Funny community. I know this because every night you guys are like, Alfredo, get on the fucking PlayStation 4. What are you doing? Yeah, exactly. I got one. I got one. We were just waiting for that sweet PlayStation 4 app and Kinda Funny. Oh no, I played Uncharted. I played Uncharted. It was amazing. All right, grab one of these things. No, don't hit the button yet. Just yank it out. Yank it out. You understand what to do? Yeah, you go for it. You're good. Now, I don't like you sitting on the stool. He got next. Nick! Nick! Nick! Nick! Nick! Give it to him! Yeah, all right! I'll give up",
      "start": 4034.54
    },
    {
      "text": "out. You understand what to do? Yeah, you go for it. You're good. Now, I don't like you sitting on the stool. He got next. Nick! Nick! Nick! Nick! Nick! Give it to him! Yeah, all right! I'll give up my mic so we hear the music too. I think the music's a big part, and that's probably why Andrea beat me, but no big deal. So it's when it hits red? No, it's when it goes green. When the music stops. Well, for color-blaring. I hate this so much. Aah! I won and I dropped it because I was so scared, but I actually won. Aah! A winner is you, Colin Moriarty. Good shit, Colin. Thank you. Colin! Colin! Colin! Colin! Colin! Colin! That's what they're going to chant when I seize control of the government one day. Yeah, probably. Can I be your secretary of state? Yes. Alfred, we love you. I love you too. Thank you for coming. I feel like this made me rethink my life. You're supposed to be a Twitch gamer. Yeah, exactly. You got beat by the oldest one of us here, the curmudgeon Colin Moriarty. The",
      "start": 4076.54
    },
    {
      "text": "too. Thank you for coming. I feel like this made me rethink my life. You're supposed to be a Twitch gamer. Yeah, exactly. You got beat by the oldest one of us here, the curmudgeon Colin Moriarty. The Mega Man skills coming through. Yes. All right, go mingle. Say hi to everybody. Bye, Alfredo. Good to see you, my friend. Round of applause, Alfredo plays. Reaching into my next bag of tricks, and through the fog I see someone, but I legitimately can't tell through the fog who it is. Oh, oh, oh! Ladies and gentlemen, from Easy Allies, Brandon Jones. So before we get into this, I just want to say, congratulations motherfucking Lacey. Congratulations, what, what, what? Holy shit, this guy, who supports Easy Allies on Patreon. I am so, so proud of you, man. You just crossed $40,000. Killing it. Yes, awesome, congratulations. It's a big day. It's awesome. Thank you, guys, man. We're getting this right on the right foot. Thank you, guys. We're getting this right on the right foot. Thank you,",
      "start": 4136.54
    },
    {
      "text": "Yes, awesome, congratulations. It's a big day. It's awesome. Thank you, guys, man. We're getting this right on the right foot. Thank you, guys. We're getting this right on the right foot. Thank you, guys. Thank you, guys. We're getting this right on the right foot. Oh, sure, okay, yeah. Take the compliment, Greg. You're welcome. It was my pleasure getting you started on the right foot. Wow, it's warm up here. It's really warm, and I'm overweight. Where's my towel? Yeah, exactly. You're not that overweight, though, anymore. All right, can we just not go down this way? Brandon. Yes. Where's the easiest place to find Easy Allies? On Patreon, on YouTube, on Twitch. On Patreon, of course. Yeah, yeah, yeah, all right. By the way, fantastic name. When I saw that name, yeah, I loved that name. It's a great name. Some people were curious where that came from. Uneasy Alliance was a term that got floated around a lot back in the old GT days. When I met with the guys, they were like, oh, we're",
      "start": 4188.54
    },
    {
      "text": "It's a great name. Some people were curious where that came from. Uneasy Alliance was a term that got floated around a lot back in the old GT days. When I met with the guys, they were like, oh, we're the Easy Alliance. We already figured it out. I was like, oh, great. I'm glad I was there for that meeting to pick the name. Also, shout out to the IGN GT situation going on. Oh, yeah. Good job, everybody. Archiving all your guys' old stuff. Fucking awesome shit. Very cool. All right, are you ready to play? I'm totally ready. Are you aware of the rules? Yes. I played this before. Call and get on, winner. So this is the light on the end here. No, no, you watch this light. He's going to make a little noise. You ready? All right. Nick, please back away from me. Now, Greg, you're 0 for 1 right now. Colin, is that how you do that? Yeah, I want you to look at me, Greg, while smelling Nick. I'm thinking of Colin while touching Brandon. And tasting Brandon. Taste Brandon. Here we go. Oh, my god,",
      "start": 4225.54
    },
    {
      "text": "Colin, is that how you do that? Yeah, I want you to look at me, Greg, while smelling Nick. I'm thinking of Colin while touching Brandon. And tasting Brandon. Taste Brandon. Here we go. Oh, my god, already? Oh, my god. Oh, my god. Fucking look. Now, Greg. Oh, I hate this fucking game. Don't let me sway you, but I want you. Damn it. Yes. Wait. Did we both win? I didn't get nailed at all. I think we both. Play off. Play off. OK. All right. Wait, should we go double? No, no, you don't want to go double. You never know who wins. All right, there you go. One on one. Oh, this one. Colin, grab that one. And then you got this. Two and two. No one wins. No one wins. We all win. Three, two, one. Oh, god almighty. Easy Alley is a great name. Just think about that. Thanks a lot. I appreciate it. Yeah, it's a really good name. I like it a lot. Oh, god. We've worked on one for us so far. Oh, god. Suck it, new Patreon wonderkin. What's the first one? Colin, Colin, Colin, Colin, Colin, Colin, Colin,",
      "start": 4268.54
    },
    {
      "text": "it's a really good name. I like it a lot. Oh, god. We've worked on one for us so far. Oh, god. Suck it, new Patreon wonderkin. What's the first one? Colin, Colin, Colin, Colin, Colin, Colin, Colin, Colin. Yes. Yes, brother. Brandon. The fireworks. What do you think of these kids? They're unbelievable. There's nothing like this, man. I've never been to a show like this ever. Never seen a crowd like this. Never seen goofballs like you on stage before. It's amazing. There's nothing like it. Thank you for coming out. Thank you for all your support. Thank all of you. Thank you guys. No problem. Love you. Thank you, man. You know, I was thinking about before, what I was talking about with you guys was Nirvana played this stage. Yeah. Devo played this stage. Public Enemy. Public Enemy played this stage. The Cranberries played this stage. Diane. Like, and now we're on this stage as well. Yeah. Disgracing this stage. Yeah. Like only we can. The Regency Ballroom has jumped the shark. Yeah. Now,",
      "start": 4314.54
    },
    {
      "text": "stage. The Cranberries played this stage. Diane. Like, and now we're on this stage as well. Yeah. Disgracing this stage. Yeah. Like only we can. The Regency Ballroom has jumped the shark. Yeah. Now, Greg, I want to ask you a question. How does it feel to have Colin just completely take the title from you? Because I know. Dominating you. With the Nintendo World Championship, how that feels for Shoo-In Tim Gettys to be this this legacy. I mean, that's what you're talking about is not really, it's not really the same because like you've never had the Nintendo World Championship. So like, it's kind of like, you know, like Colin and I, it's like, it's like, it's like Hulk Hogan in the warrior, right? We're going to pass the belt back and forth. We honor, we respect each other. We're both probably going to die of heart attacks. I'm going to have a sex tape that'll end Kotaku. Ooh. But you. So what's that mean? Like the Miz? Am I the fucking Miz? No, you're the Brooklyn Brawler. No. You are",
      "start": 4361.94
    },
    {
      "text": "going to die of heart attacks. I'm going to have a sex tape that'll end Kotaku. Ooh. But you. So what's that mean? Like the Miz? Am I the fucking Miz? No, you're the Brooklyn Brawler. No. You are the Brooklyn Brawler. Everybody wants him to do this. No, nobody cares. Can I be like the Shelton Benjamin? At least I get to do cool things. You're the one who doesn't do Benjamin one stuff though. I know what you're talking about. You don't win anything. All right. Next up. Oh my God. Ladies and gentlemen, the man who loves hiking from IGN.com, Sean Finnegan. Welcome Sean Finnegan. Thank you for having me. It's the shark. Let me get a chomp, chomp, chomp. Chomp, chomp, chomp, chomp, chomp. Now, what did he say? I don't know. Oh, fire team. It's a podcast. Yeah. You know that podcast? Yeah, it's a fire team chat. It's the destiny podcast. It's cool. It's cool. It's cool. It's cool. You're doing the destiny. It's cool. Sean Finnegan. Yeah. You're here of course because you are a member of the",
      "start": 4408.54
    },
    {
      "text": "a fire team chat. It's the destiny podcast. It's cool. It's cool. It's cool. It's cool. You're doing the destiny. It's cool. Sean Finnegan. Yeah. You're here of course because you are a member of the Kinda Funny family. I want to thank you for shooting the best looking videos we do. Thank you so much. I mean, honestly, it's such an honor to be able to work with such talented people both here and abroad. So I just love to collaborate with you guys and I'm really excited to be able to do this. I'm really excited to be able to do this. I'm really excited to be able to do this. I'm really excited to be able to do this. I love you so much. I mean, honestly, it's such an honor to be able to work with such talented people both here and abroad. So I just love to collaborate with you guys and honestly it's very heartwarming for me to even be here. So thank you. No problem. Tim, run me through. What is it for people? When is Sean behind the camera? Love and sex stuff. Most of the episodes.",
      "start": 4455.54
    },
    {
      "text": "honestly it's very heartwarming for me to even be here. So thank you. No problem. Tim, run me through. What is it for people? When is Sean behind the camera? Love and sex stuff. Most of the episodes. Yeah. Not the Rooster Teeth season. If the camera shakes a lot, it's not me. It's Kevin. Now as Kevin, this motherfucker's one of those guys. He watches films. He doesn't watch movies. So, you know. I love your hot takes on Twitter about films you watch. Yeah. Folks, what you seem to hate, which is awesome. We are a symbiotic. I don't hate. I criticize. What you do is you watch a movie. You go to watch X-Men Apocalypse. Yeah. Then you open up an encyclopedia. You look for the biggest words and then you tweet them all next to each other and you're just like, that's what I thought. Tim, the encyclopedia, did you say encyclopedia, dictionary? It's up here, man. I don't need to use that stuff. Okay. Okay. Smart, Tim. Smart. Let's take it to the fucking- All right, let's play. What am I doing",
      "start": 4479.74
    },
    {
      "text": "did you say encyclopedia, dictionary? It's up here, man. I don't need to use that stuff. Okay. Okay. Smart, Tim. Smart. Let's take it to the fucking- All right, let's play. What am I doing here? Hold on to this thing? Yeah, so there's a button here. All right. We're going to press this button. It's going to glow red. When it glows green, the first person to press it wins. It makes songs too, though. It makes a song. No, but I'm red- Tim, do you want Greg to play this one? I'm red-green colorblind, so that's cool. I'm playing at a massive disadvantage here. Yeah, the guy that shoots our videos is colorblind. Does that ever bite us in the ass? Yeah, once or twice. Whatever. Remember when loving sex stuff looked blue? I'm not going to say it was his fault. That was my fault. Oh, right. Okay, all right, three-two-one- So I have to, oh, god- I can't see Greg. Excited. Ble, I'm not that confident. Oh, shit hand- cooking- Okay, what color am I waiting for? Green. Oh, fuck! Fuck! Fuck! That",
      "start": 4521.38
    },
    {
      "text": "all right, three-two-one- So I have to, oh, god- I can't see Greg. Excited. Ble, I'm not that confident. Oh, shit hand- cooking- Okay, what color am I waiting for? Green. Oh, fuck! Fuck! Fuck! That is so painful! Damn. That was crazy. That's what I've seen on stage this entire season, so sweet. It's just pretty- That's it? Just fall right through the stage. Thank you Sean. Thank you very much. Before I jump out of here, can I get a photo of you guys? Of course. You want to go on the catwalk? I want to do two things if it's not too much of a trouble. Alright cool. So we'll do the catwalk after this, but just face me. I'm going to go back here. Cool. I love it. Oh so you get all these kids. Hey real talk though, shout out to Sean Finnegan. This motherfucker's been there for me since the beginning. That's a good one. I can feel that one. The Avengers boy band video, the Malcomor Game Shop thing, anything that we did that looked good, IGN or otherwise, is Sean Finnegan. So round of",
      "start": 4560.82
    },
    {
      "text": "beginning. That's a good one. I can feel that one. The Avengers boy band video, the Malcomor Game Shop thing, anything that we did that looked good, IGN or otherwise, is Sean Finnegan. So round of applause for this guy. Thank you. Can we do the catwalk? Yeah go to the catwalk. No you guys have the catwalk. Do you guys mind if we take a photo? You guys are all going to be in the photo. Are you ready? Raise your hands up. Sean. This catwalk was such a good idea. Shout out to Matt Scarpino. There he is, look at him. You almost had a meet and greet out there on the catwalk. I did almost have a meet and greet because I care about my fans. One, two. Hey Greg, how much longer are we doing this? I gotta pee. God damn it Nick. We probably like wait it out, but if we have five more guests I'm going to go pee right now. I think we have like five more guests don't we? Yeah. Hey Kevin, how many more guests we got? How many more guests? Let's bring out the next one and figure it out. Ladies and",
      "start": 4614.38
    },
    {
      "text": "to go pee right now. I think we have like five more guests don't we? Yeah. Hey Kevin, how many more guests we got? How many more guests? Let's bring out the next one and figure it out. Ladies and gentlemen, from Achievement Hunter, Michael Jones. What's up? Hi Greg. What's up man? Michael! Michael! Michael! Michael! Michael! Michael! He's in fucking movies and shit. He's a movie star. A YouTube Red star. I was in a movie. Yeah, no, but you were the star of it. You were the breakout hit. One of four. And they said everybody else, garbage. They did say that. And it's true. The guy's British accent, terrible. Yeah, he was pretty awful. You should have been there during the movie. Yeah, a lot of editing involved. Honestly, I think that just might be. You look sweaty. I am a little hot. Is it showing? The lights. Yeah, well it was the physical activity mixed with the lights, then the drinking, and then yeah, just you know, the 33 years of abuse on a body. That'll happen. It will happen.",
      "start": 4699.38
    },
    {
      "text": "showing? The lights. Yeah, well it was the physical activity mixed with the lights, then the drinking, and then yeah, just you know, the 33 years of abuse on a body. That'll happen. It will happen. Michael, how are you? I'm great. What's going on? What am I walking into, by the way? This is Kinda Funny live, too. Oh, hi Kinda Funny live, too. You, of course, back tomorrow to do a little bit of podcasting, meet and greeting, autographs, photos of all these lovely people. Because we're doing it tomorrow. All true. Yeah, yeah, yeah. Where's Lindsay? She's in Austin, where we live. Oh, you guys don't go everywhere together? Kind of a lackluster answer. It happens. Have you ever played lightning reaction before? I have not. I've seen this thing before, but I've not played this particular game. Have you learned how to play it? No. By screaming off? That's perfect. Grab one of these. Okay, I got it. Done. I win. Did I win? So now, it's going to play a creepy song that you won't be able",
      "start": 4769.38
    },
    {
      "text": "game. Have you learned how to play it? No. By screaming off? That's perfect. Grab one of these. Okay, I got it. Done. I win. Did I win? So now, it's going to play a creepy song that you won't be able to hear. Okay. And it'll glow red. It's going to glow red and play a creepy song. It'll turn green and stop playing the song. That's when you hit the button. You hit it. If you're the first person to hit it, great. You win, everybody else gets shocked. Okay. If you're not, you get shocked. All right. And you get shocked. I can't feel my hand anymore. It'll be fine. I hear you're a prick and you win this a lot. I'm having a rough night. That's what I was thinking. Yeah, that's great. I'm glad you have a rough night. Fuck you. Ah! Oh, wait a minute. So the three of us are good. I'm so not! Just him, got got. All right, we'll take him out. He was by a microsecond. The round robin continues. Okay. Which one's off? You got it. You just keep hitting it. Just keep slapping it. Oh, someone gave",
      "start": 4814.38
    },
    {
      "text": "him, got got. All right, we'll take him out. He was by a microsecond. The round robin continues. Okay. Which one's off? You got it. You just keep hitting it. Just keep slapping it. Oh, someone gave me like thinking glow sticks. I'll give some out. They asked me if I could throw them violently towards the crowd. You gotta break them first. Oh, listen, the audience can break them. Nah, I lied. I'll break them. And glow stick for you! And glow stick for you! And glow stick for someone else! You almost got the white shirt guy. That really would have made him happy. Yeah! I got none left. I got no- All right, play off, play off, play off. All right, all right, sorry, sorry, sorry, sorry. Oh, God. Only seven more guests to go call. Green, green, green. It's a green light! Go now! Go now! Go now! What is going- how are the rules of lightning reaction? You cruel mistress. There's DLC with this shit? It's just making up the whole thing. All right, fine. I like it. I like when you're- You're",
      "start": 4862.38
    },
    {
      "text": "What is going- how are the rules of lightning reaction? You cruel mistress. There's DLC with this shit? It's just making up the whole thing. All right, fine. I like it. I like when you're- You're like, all right, Greg. It's just the two of us now. Oh! Fuck! Oh, man, come on! I don't want to play anymore. It hurts. I mean, we want to bring up the fact that Nick came back with a pile of meat. I'm hungry, Greg. I got to eat. In the middle of the show? We got lots more show to go. I'm pretty sure we have a break right after this, though. If you would have just hung on. I got to eat when I got to eat, Greg. It's really weird doing the show without being able to talk shit to Kevin. I don't like it. Where is Kevin? It's super simple. Kevin, fuck you. Kevin, come here. Is Kevin back there? Oh, here comes Kevin. No, that's not Kevin! Kevin! That's Gus Sirola! Gus Sirola! There are no breakaway bottles. Are there any bottles here? There are no bottles to hit you at this time. Well, plastic.",
      "start": 4920.38
    },
    {
      "text": "here comes Kevin. No, that's not Kevin! Kevin! That's Gus Sirola! Gus Sirola! There are no breakaway bottles. Are there any bottles here? There are no bottles to hit you at this time. Well, plastic. That person loves you. You're pretty sweet, too. You guys are killing it out here. Are we? You guys are fucking killing it. Is this segment going okay? Wait, white shirt man left. Oh, no. Sir, where did your father go? The show is canceled. To buy a shirt? No, he didn't go to buy a shirt! We want him over! Hey! Hey! Bah, bah, bah, bah! I'll take it. Now, Gus, you're drinking out of a glass you stole from Colin. How's that feel? No, no, no. It's borrowed. You can have it back. Oh, okay. Thank you, Gus. There's still some whiskey in there. No, you keep the whiskey and the glass and enjoy it, please. It's all yours, my friend. Gus, I want to thank you. Not only for being on the show, coming here, but being an inspiration, a mentor, a friend, as we've done two years now, it's Kinda Funny.",
      "start": 4994.38
    },
    {
      "text": "It's all yours, my friend. Gus, I want to thank you. Not only for being on the show, coming here, but being an inspiration, a mentor, a friend, as we've done two years now, it's Kinda Funny. We're not going to hit you in the head again. I've been here. I've been here. You know what, motherfucker? You were so down for that bit when I told you about it. I was down. I was like, he knows how to use a stage bottle, right? Nope. I didn't know you were a fucking Georgia peach. Immediately there'd be problems. God, I'm ruining my honesty. All right, now, Nick, you have to play. All right. Get in there. Now, Colin, do you not want to play? Do you want to sit one out? Gus, you know how to play? Let me recover. Huh? Give me this. I've played this many times. Let me tell you a little secret of mine. Yeah. Where the fuck is the button? I've never hit it. Right here. That's it. Okay. Okay. Okay. I'll trade you. I'll trade you. Smart. There we go. That's why you guys make the big bucks. Oh, god",
      "start": 5053.38
    },
    {
      "text": "Yeah. Where the fuck is the button? I've never hit it. Right here. That's it. Okay. Okay. Okay. I'll trade you. I'll trade you. Smart. There we go. That's why you guys make the big bucks. Oh, god damn it. Damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. Oh, god damn it. I told you I always lose at that game. You know what I mean? If I'm not going to win then I know it. I'm gonna win you know what I mean and like if I'm not gonna win and I know it I'm not I don't have The moment but there it was where it's just like it was like remember the hit movie with Kevin Costner whose name I don't remember the professional know where he's the baseball player, and he goes you clear the mechanism The natural angels in the outfield That's what that guy yelled, but I'm just like Remember he cuts his hand he cuts his hand on a saw It's always pitching a perfect game. Yeah, okay? Perfect game is a copper Does anyone have a",
      "start": 5092.38
    },
    {
      "text": "That's what that guy yelled, but I'm just like Remember he cuts his hand he cuts his hand on a saw It's always pitching a perfect game. Yeah, okay? Perfect game is a copper Does anyone have a person in their pockets to home alone? It's not home alone man of steel All right, that's enough all right Just we love you very much. Thank you Gus. I can't believe I came out for like 15 seconds. Thank you no problem from Austin, Texas That's how the lightning reaction round of the lightning reaction game Tends to go you can of course meet Gus tomorrow get signatures from hurt him in the head looking back here. Oh Here's a gentleman. I haven't seen in a duck stage ladies and gentlemen from IGN calm I Brad Brad Brad Brad Brad Brad Brad Brad Brad So this looks fun Our den of wires and I haven't been on the show in two years and now apparently you guys are fucking electrocuting What happened we needed to get them clicks? Saw what the kids like they like personal pain. I love you guys. This is",
      "start": 5158.8
    },
    {
      "text": "on the show in two years and now apparently you guys are fucking electrocuting What happened we needed to get them clicks? Saw what the kids like they like personal pain. I love you guys. This is wonderful. Thank you I think I'm gonna hate you in a minute Beyond And that too that's Greg Atlas you remember him of course I do he was here first Just like he was the first at every up at noon even on the days where we were gonna do one We forgot to tell was there he actually started camping out for this show at the end of last year's Kinda Funny life Brian how the hell are you? I'm really good. This is great. This is this is fucking ridiculous. I'm under playing it. This is Unbelievable you guys built this in a bedroom Most people just jerk off in their bedroom Mike Mitchell to Me button yep super knocking boots. Yep. What else am I missing here? What I got I have an album out miss the throat yep, I have a new one coming out this fall. What's it called? It's called continues it's a",
      "start": 5234.56
    },
    {
      "text": "yep super knocking boots. Yep. What else am I missing here? What I got I have an album out miss the throat yep, I have a new one coming out this fall. What's it called? It's called continues it's a dedicated to video games because they're fucking awesome I Ever figured out the clear the mechanism Here that one on All right, you ready? Yeah, what do we do here? So all right, so we're gonna hit the button. It's gonna glow red Yeah, when it glows green the first person to hit the button is safe. Everyone else gets a look. Okay. All right Gregory. Yeah, I Fucking hate my life when I do this shit Oh Holy Christ what the fuck? Fucking knows good. I was good. I was fucking good Yeah, you were good to another one on one Fucking that was like when I took over beyond Oh Is yours lit up no grab down play off Thank you. I just saw the love of the game. Thank you Wild to find that check up deep in his list now Greg was unusually long. I don't want to alarm you Greg But you can't lose Tim You got",
      "start": 5305.68
    },
    {
      "text": "play off Thank you. I just saw the love of the game. Thank you Wild to find that check up deep in his list now Greg was unusually long. I don't want to alarm you Greg But you can't lose Tim You got me get out of here Brooklyn brawler god Can I leave yeah, you can you want to say hi to everybody I want to say hi to everybody and goodbye to everybody. I fucking love you all support these guys until the end of the time Kinda Funny forever. Thank you, Brian I like him. We should use him in more things Brian miggles asked for a dick pic. So I'm sending him on right now Hey, where are you for everyone out there? If you're taking selfies, if you don't know we got a snapchat filter up in this bitch. Oh, yeah If anyone has snapchat right now and you take your phones out load up snapchat Hold on filter. You must make sure you use one of the kind of pretty life filters. Wait, what's up, Brian? Uh, I have a I have a show and you you guys have a show. Yeah, should we maybe like do some shit",
      "start": 5409.48
    },
    {
      "text": "on filter. You must make sure you use one of the kind of pretty life filters. Wait, what's up, Brian? Uh, I have a I have a show and you you guys have a show. Yeah, should we maybe like do some shit together soon? Hi Kinda Funny cross comedy button comedy across Kinda Funny comedy funny funny comedy Kind of button. We have a lot of work to do. We'll figure it out. We're gonna do it. We'll see you soon What a nice young man, he's such a nice young man very well-kept Oh now here's a piece of shit man, everybody from fun house Adam Kovic I Am a much more handsome version of Tim You're a younger Hugh Jackman, oh that's good Hugh Jackman, he was the Wolverine Leopold in Kaitlin Leopold race through and I believe it's like The granddaughter falls in love with her grandfather. I don't remember that one same difference. Yeah That's really what it was about Here the mechanism who came here for Kate and Leopold talk I'm sorry Adam Kovic seems like hey so long ago that we met on the set of",
      "start": 5477.8
    },
    {
      "text": "that one same difference. Yeah That's really what it was about Here the mechanism who came here for Kate and Leopold talk I'm sorry Adam Kovic seems like hey so long ago that we met on the set of the gauntlet There's a long long time ago so much has changed our lives since then yeah, no, no, okay When we first met at the gauntlet everybody at roosterteeth. Nothing me and Greg were a gay couple. Yeah. Yeah Story I mean, yeah Well, cuz everyone got to bring a significant other and I was like no I didn't get to bring my wife But Greg had his wife. I Was like that's not fair. It was it was a it was a bonding experiment for me and Tim for sure Oh, yeah, when you have your dick in his ass They're bonding I believe that's a covalent. Oh, yeah I'll never forget those nights. I never believe those Austin nights. Oh my gosh How's funhouse going it's going well, yeah you were you came by recently I did Greg Greg was our doom coach. I coached you to victory. He's really good. It's sweaty up here.",
      "start": 5556.44
    },
    {
      "text": "Austin nights. Oh my gosh How's funhouse going it's going well, yeah you were you came by recently I did Greg Greg was our doom coach. I coached you to victory. He's really good. It's sweaty up here. I'm sorry. We all crazy white man hair The diversity up here is insane It is pretty typical for the video game industry we brought out Andrea and then just do You like white people And the whole let's play We got a black woman school Cool selecting reaction Reactions That one easily So when it goes green What is going so that's wrong? Oh, you're buzzing in first. No, did you get buzzed? No. All right, you get that I got the shit hit it. You never get anything mercifully. It's breaking. We so we have to play this for much longer Brooklyn, I definitely did not hit that shit. I'm scared of hitting the ball when it turns green Usually this turn green I could go grab it don't be a coward All right, it's breaking it's broken day God Can we throw it away? Yeah, we throw it away. It's like it",
      "start": 5615.16
    },
    {
      "text": "the ball when it turns green Usually this turn green I could go grab it don't be a coward All right, it's breaking it's broken day God Can we throw it away? Yeah, we throw it away. It's like it hurts so bad, but it feels so good You've lost but it's broken. Well, it's only shocking one person Ghost in the machine man I want to spike this thing so fucking hard. Just throw it away, dude Well, don't do it right in front of their fucking eyes. Jesus Who wants it? Oh Give it to one lucky man or woman and make them play Make them play it's broken. Give it to a white person shock them all. Oh My god, look how eager the oh god, it's gonna be like a zombie horror film. We're just gonna rip it apart They're eating the batteries I did everybody should hold each other and see if they can chain the lightning around the room This is some good podcasting right this is great Yeah winner takes all take it hey, what's your name? What's your name? What's your name? Andrew Andrew Andrew Andrew Andrew K",
      "start": 5682.96
    },
    {
      "text": "around the room This is some good podcasting right this is great Yeah winner takes all take it hey, what's your name? What's your name? What's your name? Andrew Andrew Andrew Andrew Andrew K and Leopold K and Leopold K and Leopold No one mentioned underrated Adam we love you mom mentality. Oh, I'm out of here. Yeah. Okay guys want Bruce Sure, we forgot about Bruce we need it back no, no, no, it's gone now, it's fine now We're not lightning reactions to talk show. Yeah, we're talking ladies and gentlemen, the one and only fun house is Bruce So disappointed Bruce Bruce Bruce Bruce Bruce Bruce Bruce Bruce So lightning reaction broke yeah, we like lightning reaction a lot. Yeah need to buy a new lightning reaction. Uh-huh How much cocaine have you done? That much okay, that's fucking awesome What are we gonna play Where's the game now? It's the talk show game where we just talk. Okay. How you doing? Good really good What's like working with Adam? It's fucking great. Yeah Adam's a great",
      "start": 5767.68
    },
    {
      "text": "What are we gonna play Where's the game now? It's the talk show game where we just talk. Okay. How you doing? Good really good What's like working with Adam? It's fucking great. Yeah Adam's a great guy is he? Yes. He's way better than you Not better than you. Thank you, Bruce A little better than you Greg people are asking you to arm wrestle Bruce. Oh sure Now how do we got to set it up in a proper way so that they know they like enough room here Now the table that I can't do it But you come over here and you can scooch in. All right, that's good. Now Bruce. Are you up for this? Yeah, sure. Why not? I Can't do that I Can't wrestle that you can take it off. I'm gonna say he has an abnormal amount of strength. So just be careful Oh, this is happening. Take it off. Take it off Now that's a fucking man Greg Those glasses are fantastic fucking awesome. So Nick I'm gonna need you to wrap this Gentlemen welcome to the first official ever company life to our wrestling championship With me in",
      "start": 5860.0
    },
    {
      "text": "man Greg Those glasses are fantastic fucking awesome. So Nick I'm gonna need you to wrap this Gentlemen welcome to the first official ever company life to our wrestling championship With me in the left corner, they call him the gruesome they call him the greggy gruesome Greg ladies and gentlemen To the other left of me Bruce the power Gentlemen rules are simple There are no rules If you've seen the movie over the top, then you know all you need to know about arm wrestling my question is no questions What is your question can you hold the table some people say yes something no holding the table Hand behind your back and Bruce. I'm gonna warn you. He has the strength of eight gorillas. It's weird. He loves all slippery He doesn't look as strong as he is. It's very strong. When are we going? That's gonna be one three two one then go. Okay, not say go I'll say go you go on go. Do not go on one Huh? There's no way I'm gonna get that much I'm not don't worry Ladies gentlemen, are you ready?",
      "start": 5929.2
    },
    {
      "text": "That's gonna be one three two one then go. Okay, not say go I'll say go you go on go. Do not go on one Huh? There's no way I'm gonna get that much I'm not don't worry Ladies gentlemen, are you ready? No matter what. I still love you, Bruce Three two one go The winner and still champion Broken in half from funhouse Greg it's not the WWF in 1988 you get up You really sold that great quake was really well done. Thank you guys backyard wrestling two-time you out of his champion. Thank you my friend He's running away, thank you Bruce, thank you very much So great. We got a couple more guests couple more guests. Let's bring them out. Let's talk to him and see what's up Who's next? I believe this is Jeff Ramsey from achievement I Was told there would be alcohol you drank all of it you drink it all in the back yeah Kevin can we get a bottle of alcohol? Here do you want a little pappy me a second Kevin's on the alcohol for it to worry I Know how are you? I'm okay. How are you guys? All right",
      "start": 6007.76
    },
    {
      "text": "all in the back yeah Kevin can we get a bottle of alcohol? Here do you want a little pappy me a second Kevin's on the alcohol for it to worry I Know how are you? I'm okay. How are you guys? All right What are you guys what are you guys talking about what's going on? We're just talking about anything now. Yeah Yeah, you look like 20 years old. You shaved your beard. You're just like all right, da I Will take a hand job I want to give you an even better hand job here, but this is my thing I gotta do this This is fucking surreal to me man like 13 years ago. I started watching this little show called red versus blue I Know I'm sitting on a fucking table with one of the Partnered with their network none of this makes fucking sense Thank you so much for looking at us and being like I want to partner with those guys because that means the fucking world to me Well all right Tim let me respond by saying thank you for signing a contract before reading it I Don't read contracts that's for",
      "start": 6097.6
    },
    {
      "text": "to partner with those guys because that means the fucking world to me Well all right Tim let me respond by saying thank you for signing a contract before reading it I Don't read contracts that's for pussies Take things on faith Tim hey, that's this so it works very true Let's play going so far. Are you happy are we doing okay? You know? Now we We've known each other now for a few months And I was told that you don't like to do like anything that involves traveling and I see you a lot in San Francisco So I think we're doing something right because you keep coming out here for us, which is amazing I just like you. Oh, I have a great amount of I have a good feeling about you. Thank you I Think they want us to have sex. Yeah, so you will I people I blow him he was what? So Let me ask you guys question yes, so you guys are the belle of the volume star of the night tonight It's all about the Kinda Funny. Yes, who you guys are actually actually funny It's all about the funny for the people",
      "start": 6165.2
    },
    {
      "text": "question yes, so you guys are the belle of the volume star of the night tonight It's all about the Kinda Funny. Yes, who you guys are actually actually funny It's all about the funny for the people that I'm surrounded by are you having a good time? It's gonna go like a thousand miles an hour and you're gonna look up and it's gonna be over and you're gonna be like 364 days again before I get to do that. No, I'll sleep all second and just enjoy That tonight is not a critical failure in any capacity. These are going exceptionally well Seems to be But they seem super entertaining, you know, you are super wait, what about the white shirt guy did you ever come back? Still not there, huh? Is your dad army crawling to the merch table? Just enjoy being on stage in front of these awesome people That's enough Honestly To hijack that incredibly thoughtful Gesture what I would like to do is have Tim and Nick walk the catwalk and take it all in because this is only because of Them. Yeah, they did",
      "start": 6248.2
    },
    {
      "text": "enough Honestly To hijack that incredibly thoughtful Gesture what I would like to do is have Tim and Nick walk the catwalk and take it all in because this is only because of Them. Yeah, they did all this work Go out to the thing. They're basking your audience You It's hard to hear back there has Colin talked about his unwavering support for Donald Trump yet It's not true, I don't know who I'm gonna vote for For party You're gonna vote for Trump. No, I'm not gonna vote for Donald Trump. Are you gonna vote really Clinton? No, I've never voted for a Democrat. Are you not gonna you gotta vote? I will I'm gonna vote third party I probably want libertarian. He's gonna he's gonna write in This guy Greg Greg's ain't yeah, I'm not old enough yet. So are we proving that we can win Greg anything true? Next election will do it. We'll make a presidential campaign Amy gills you need to come over here. You need to get citizenship so you can vote every vote So it'd be Kinda Funny for will be the",
      "start": 6312.06
    },
    {
      "text": "Next election will do it. We'll make a presidential campaign Amy gills you need to come over here. You need to get citizenship so you can vote every vote So it'd be Kinda Funny for will be the road to the White House Kinda Funny live for Five we started right? Yeah. Yeah. Yeah, we play by our own rules. Fuck it. I've next year We did a presidential debate last year. So whatever And you were co-presidents. I think constitutionally makes it constitutionally ineligible. You know what you got it. You got to shake it up You gotta shake it. Yeah. That's the way the Supreme Court loves that Trump's doing right now Jeff. Yes, sir. Thank you for coming out. Yeah Yeah You're here tomorrow taking photos doing podcasts maybe signing what do you mean maybe what are you gonna do? Where are you gonna go? Who'd have you now? There's a What I'm sorry There's I apparently there's a bar in San Francisco Really talk about this establishment. I just heard about a bar We have one enticing I might check",
      "start": 6392.34
    },
    {
      "text": "go? Who'd have you now? There's a What I'm sorry There's I apparently there's a bar in San Francisco Really talk about this establishment. I just heard about a bar We have one enticing I might check it out until then Our next guest in the lightning reaction lightning round that's no longer lightning reaction roosterteeths Barbara Dunkelman I Touch me too Thank you. Thank you. You don't want to know where that hands been Kevin wanted me to whisper near that this segment needs to be over at 1025, but I just uttered him on the podcast Oh, we got it five minutes from now. We're good. We got seven He knows who the last guest needs to be so as soon as he puts that guest there it's over Kevin worries about too much. Am I right? He does. He also sweats a lot Barb Now you told me you didn't necessarily want to come up on stage tonight because you didn't want to be quote-unquote Electrocuted it's true. And I notice you're here now because there's a decidedly lack of electrocution happening So I",
      "start": 6439.98
    },
    {
      "text": "want to come up on stage tonight because you didn't want to be quote-unquote Electrocuted it's true. And I notice you're here now because there's a decidedly lack of electrocution happening So I was actually watching from up top and when you guys threw away the electrocution machine, I was like It does it sucks it does and actually I know what was playing it up it's not it's fucking horrible It's awesome everybody send Send a new one. We'll get a giant one game going Daisy chain of the honestly an idea I have for Kinda Funny live to originally was to buy a shit ton of them and Put them all in the crowd and have everyone play at once But it was really expensive. So we got a catwalk instead. Yeah Now what many of you might not be able to appreciate is that and this goes is it displays your interests also Is Brimecraft smoking Turn on the fog machine Now Barb displays your interest before everyone got here the catwalk very much looked like a dick Fucking the stage. Yeah, and now it's",
      "start": 6514.7
    },
    {
      "text": "interests also Is Brimecraft smoking Turn on the fog machine Now Barb displays your interest before everyone got here the catwalk very much looked like a dick Fucking the stage. Yeah, and now it's harder to see purpose No, not from above they can still see the baby still see the dick. All right good Like perfectly aimed at me right now, which I feel is appropriate very appropriate That's of course because you were on one of the first breakout Kinda Funny success videos how to draw a dick the Greg way That's right. Yeah, I had no idea who you were. We got introduced. You said I draw dicks and I said let's make a video We're best friends now Are you having a good time so far Like such incredible performance I was watching come up top and I don't know like the energy in this room is Like mind-blowing you guys put on a really good show. Thank you. Thank you No, please everything you do is awesome then you look at our subscriber numbers They're all in this room We fucking walk the shit",
      "start": 6561.9
    },
    {
      "text": "mind-blowing you guys put on a really good show. Thank you. Thank you No, please everything you do is awesome then you look at our subscriber numbers They're all in this room We fucking walk the shit out of all of you Yeah thousand percent if you guys are having a good time it's because you're having a good time It's that we feed off of your energy and give it back to you Alex O'Neill's throwing up the Taylor Swift heart And I appreciate that a rational passions podcast everybody throw up the hearts Does a little complicated call Okay That was one of our first success stories with you and now you've just debuted on our animated series I have a nerdy Barb Dunkelman. I love it. I Think my favorite part was when we reference nerdy Barb Dunkelman the first time it didn't have your voice and people were like I wonder if Barb Dunkelman's gonna be in this I would like to think that I was just in that first episode and like never again That's the way we do things here Kinda Funny we also",
      "start": 6630.64
    },
    {
      "text": "people were like I wonder if Barb Dunkelman's gonna be in this I would like to think that I was just in that first episode and like never again That's the way we do things here Kinda Funny we also made the horse I don't know if you know this Nick, but we made the front page of reddit today. We did based on a Based on a gift of Barb from love and sex stuff. So that's pretty cool She's just there it's fun though. I was into it I like these all very weird. Yeah You know, okay Barb will be here tomorrow as well doing signings to meet her tomorrow. I Really feel like a time machine just landed or something. I know just like safe yard of nugs being smoked in the back I think it's actually steam. It's so fucking hot up here now ladies Well, what the hell's coming out from the thing like what? Oh, those are particular toys Oh, that's his bacon piece. Okay, bacon piece great. Sometimes I'll take the toys away from him and put him in there He's got his costumes in there. It's bigger outfit",
      "start": 6680.92
    },
    {
      "text": "Oh, those are particular toys Oh, that's his bacon piece. Okay, bacon piece great. Sometimes I'll take the toys away from him and put him in there He's got his costumes in there. It's bigger outfit few other ones adorable. Yeah, who's next? It's our final guest And now I want to say we saved the best for last We've saved perhaps the dirtiest for last Someone I haven't been on a stage with since I was almost mortally wounded by the man Oh Ladies and gentlemen from giant bomb calm Dan Reicher Oh Dirty Dan Reicher hello Greg. Wait a minute. Wait as my son Dan this is my mom Jamie Jamie. This is Dan Reicher who almost killed me. Hello, miss You young man. I have a bone to pick with you And that bone just happens to be my son's ribs Perhaps you don't know me. I don't I didn't think so Because when you best with my son you mess with me Talk shit good shot And just in case you don't know what I do for pleasure is Get on 1200 pounds of animal that doesn't speak English Jesus Freezing by what",
      "start": 6740.2
    },
    {
      "text": "when you best with my son you mess with me Talk shit good shot And just in case you don't know what I do for pleasure is Get on 1200 pounds of animal that doesn't speak English Jesus Freezing by what what what what she rides horses Okay from Spain and that's what I do for pleasure, okay You would not be a problem Oh Sure now Jamie Jamie Jamie I can leave a little late for that Shit Jesus I think you should have kept the shack machine just for him. All right mom Somebody cut her off All right, so now I leave it up to you carry on So Dan Yes, thanks for coming on the show You didn't tell me that your mom was gonna yell at me agreed to do this. I Like to keep secrets. You didn't tell me you were gonna land all on my fucking back when you drop You said to be an elbow drop. I already felt really bad. Oh We're all having fun. Ladies and gentlemen, I love Dan He's not great Jeff I am a fun tonight so far. Yeah, this is a pretty cool thing you did here. This is all right Good work on this",
      "start": 6843.86
    },
    {
      "text": "bad. Oh We're all having fun. Ladies and gentlemen, I love Dan He's not great Jeff I am a fun tonight so far. Yeah, this is a pretty cool thing you did here. This is all right Good work on this thing. Thank you very much. We've had a lot of fun Well, I want to thank you for all your support You've been a big supporter outside of just the packs of wrestling. Obviously, you've been on the shows You've been there we got to do that Xavier wood stuff together with yes concrete great stuff. I love you a lot Dan you're a great dude. You're great for all you guys are great Thank you Ladies and gentlemen Get all of Dan's content at giant bomb calm and buy his books one nonfiction about anxiety then Air Force Gator Same thing same thing We love you a lot. You're great. Thank you Tomorrow for me to read stuff and sign stuff and photos and stuff I think that's not stuff people And if you want to walk around and take photos with inanimate objects, you could do that, too Do I not have to get",
      "start": 6963.62
    },
    {
      "text": "me to read stuff and sign stuff and photos and stuff I think that's not stuff people And if you want to walk around and take photos with inanimate objects, you could do that, too Do I not have to get shocked? No, I broke it Okay You weren't you were very worried about that early on because you didn't tell me what the fuck I was doing when I agreed to Do this classic Miller showed up and they're like, oh we're gonna electrocute you and wait I didn't agree to do this at all Trust me the first time I walked into Paris Schneider's office and he locked the door and said do you want to be famous? It wasn't nearly nearly as painful as that shocking. All right All glass office though. It's very awkward If you didn't know ladies and gentlemen, this has been the GameOverGreggy show each and every week for Sometimes five best friends gather around this table each bring your random topic discussion for your amusement If you like that head over to patreon.com/kindafunny And if you don't",
      "start": 7018.58
    },
    {
      "text": "week for Sometimes five best friends gather around this table each bring your random topic discussion for your amusement If you like that head over to patreon.com/kindafunny And if you don't have any bucks to toss our way go to youtube.com/kindafunny where he puts the whole thing Top of it you all knew all this. Do you know this? All right until next time it's been our pleasure to serve you There's more show Oh Greetings Kinda Funny live welcome to what's news weekend special edition. I'm Anthony carboni and I'm Trisha Hershberger today's top story mayonnaise Scientifically the worst a new study by all of these smartest people with all of the best Qualifications says that eating mayonnaise causes antisocial behavior poor taste in 90s rock music and weird penis Oh New research suggests that the Marvel and DC universes might be crossing over for the first time since the amalgam comics event in wherever Sources say it's obvious because our Killian and Superboy sound",
      "start": 7049.42
    },
    {
      "text": "research suggests that the Marvel and DC universes might be crossing over for the first time since the amalgam comics event in wherever Sources say it's obvious because our Killian and Superboy sound exactly the same like exactly The same our source is quoted as saying it's like they're not even trying or like they have no idea what they're doing A local man has been missing for over 72 hours We think no one really noticed when he went missing police chief O'Hara released a statement saying Who even is this guy? I mean does anybody know nobody does nobody does in legitimately sad news crash Bandicoot was found dead in his Pasadena apartment yesterday Police say he succumbed to complications from irrelevance an issue. He'd been battling for almost 20 years He has no family, but it's survived by this man who says I'm devastated But at least now I know for sure and I can get on with my life And that's a probe will be launched into space next week to replace the Voyager 1 NASA asked the",
      "start": 7110.02
    },
    {
      "text": "by this man who says I'm devastated But at least now I know for sure and I can get on with my life And that's a probe will be launched into space next week to replace the Voyager 1 NASA asked the public to suggest media to include on the craft that would best represent the human race and Surprisingly the Bruce Willis movie Die Hard was chosen after 10,000 letters were sent to NASA All in the same handwriting a NASA official was quoted as saying Handwriting how old is this guy? Does he understand technology at all? Hey, we just want to say Greg Colin Tim Nick Kevin. Congratulations on another wonderful year you guys See so energetic what was that you keep saying it You're all talk What's that Let me tell you something about my fiance she's fucking mean so Be careful Hey everybody, we got something really special next we have an enormously funny dude former writer for IGN a Currently a writer for the Tonight Show with Jimmy Fallon and the host of the how to be a person podcast But you",
      "start": 7156.56
    },
    {
      "text": "something really special next we have an enormously funny dude former writer for IGN a Currently a writer for the Tonight Show with Jimmy Fallon and the host of the how to be a person podcast But you probably remember him most as mr. Universe 2013 Please give it up for Mike Drucker Oh This is like the end of the movie where I get shot the head how's it going everybody? Give it up for everybody you've seen tonight, by the way Greg Colin Nick Nick's younger brother So, yeah, I'm not a cool guy you guys I don't know if you can tell that I'm not a cool man Here's an example when I was seven years old I had a writing assignment my class if you could be any animal, what would you be and why? My friend Josh wrote I would be an eagle because Eagles can fly this girl my class wrote I would be a horse because horses are pretty and I wrote I would be a jellyfish because when you don't have a nervous system, you can't be sad So too real I Was also a very I know I'm fat now But I was a super fat",
      "start": 7238.52
    },
    {
      "text": "because horses are pretty and I wrote I would be a jellyfish because when you don't have a nervous system, you can't be sad So too real I Was also a very I know I'm fat now But I was a super fat kid like very fat kid and I was really into video games because the two are not mutually exclusive So one Halloween because I was so into video games. I decided to dress up as Ryu from Street Fighter 2 No, because every house on my block assumed that was Chris Farley from Beverly Hills ninja And I had to go with it because I like candy Another Halloween I usually explain this I don't need to explain it for this crowd. I dressed up as Simon Belmont from Castlevania Except he's dressed in all leather and has a whip So I was a seven-year-old obese child Going door-to-door being like where is your vampire kia And all the neighbors gave me this weird look that I now know as them thinking I think Dennis Drucker is fucking his son Too real Shouldn't use real names of real relatives. That's okay He's",
      "start": 7315.72
    },
    {
      "text": "kia And all the neighbors gave me this weird look that I now know as them thinking I think Dennis Drucker is fucking his son Too real Shouldn't use real names of real relatives. That's okay He's gonna be real disappointed on YouTube one day when he finds this That's okay, I Do work at a 30 Rockefeller Center, which is a cool place to work It's a very touristy place to work Now I haven't got to ask for help by tourists and one time this tourists were asking me for help in English was not his First language, which is fine. I don't mind helping anybody what he was trying to ask me was where's the subway? He just want to know where the subway was but what he ended up asking me was where's the Underground Railroad And there was like half a second where he could have shattered my reality just grabbed me by the shirt and was like what year Is it? Went to my favorite museum in the world recently, it's called the Mutter Museum. It's in Philadelphia, Pennsylvania Yeah, I named a place that some",
      "start": 7376.16
    },
    {
      "text": "me by the shirt and was like what year Is it? Went to my favorite museum in the world recently, it's called the Mutter Museum. It's in Philadelphia, Pennsylvania Yeah, I named a place that some of you are from The Mutter Museum for those of you that don't know it's worth the trip it is the Museum of medical abnormalities And it's real. It's all legit like they have books bound in human flesh They have a woman that was so fat when she died her body turned into soap It's the only museum I've ever been to have heard a curator say to a student. Yes, that is fucked up like It's beautiful and The best thing slash worst thing in there is they have a baby that was born without a head Yeah, that's just how the stork brought it Then the stork was like I'm getting into the pickle business. I'm sorry I'm sorry Cuz they're both in jars now. Okay, that's okay You don't need to be on board with that. That's fine Baby more without a head and the label on the jar is really interesting It has this",
      "start": 7429.34
    },
    {
      "text": "I'm sorry Cuz they're both in jars now. Okay, that's okay You don't need to be on board with that. That's fine Baby more without a head and the label on the jar is really interesting It has this classy old-timey language and what that language says is child born without a head Usually dies after childbirth because it is a condition not compatible with life It's very cute way to put that very classy way to put that I wouldn't have that sort of class if I were a doctor And my patient gave birth to a baby without a head if I were a doctor in my patient gave birth to a baby without A head I'd probably do the worst thing which is like put under my chin and be like hi mom Mama dream of me Ah Hello my baby, hello my darling hello, all right time gal Someone's laugh was picked up by the mic Wasn't that that was weird that wasn't mine. Oh That kid's dead, um, so It was 200 years ago he would be dead now anyway, but not as tragically I need to not tag things alpha top my head. Um, I'm so I'm",
      "start": 7487.7
    },
    {
      "text": "that that was weird that wasn't mine. Oh That kid's dead, um, so It was 200 years ago he would be dead now anyway, but not as tragically I need to not tag things alpha top my head. Um, I'm so I'm dating someone now, which is nice, which is cool. Yeah. Sure one person would No, no, you don't all who maybe because I asked for it. Oh, yeah, not like any of you are gonna fuck me All right, let's go on What any of you fuck this often? Okay All right, anyone wooing I don't want All men too, which is fine, but not my gender of choice Although I will let me back up a bit I recently signed up for a gym and I had to do a fitness test and I was really worried about it because like whenever I've done like fitness tests in the past like the trainers always made fun of me, but that's not what happened What happened was I met the trainer and I fell in love with him Like have you ever met somebody that's not your gender of choice, but they're so attractive that you're like, oh sexuality's fluid Like",
      "start": 7540.48
    },
    {
      "text": "What happened was I met the trainer and I fell in love with him Like have you ever met somebody that's not your gender of choice, but they're so attractive that you're like, oh sexuality's fluid Like he was gorgeous. He was so handsome that when I said when he said my name is Jeremy instead of me saying My name is Mike. I just went yeah it is It's gorgeous But I am dating someone right now and it's the weird thing that she likes porn more than I do which sounds good But she always wants me to talk dirty like the guys in porn and I can't cuz guys in porn are so masculine It's always like I'm gonna split you open And I don't have the authority to say that Whenever I talk dirty just sounds like she's going to the doctor's office. It's like, all right, you're about to feel a little pressure I'm sorry, it's cold Here's a lollipop I Don't even like porn as much as I used to I don't know if I'm getting older or more liberal with age But I don't like porn as much it's not fun all the way",
      "start": 7594.28
    },
    {
      "text": "I'm sorry, it's cold Here's a lollipop I Don't even like porn as much as I used to I don't know if I'm getting older or more liberal with age But I don't like porn as much it's not fun all the way through Like it used to be I just masturbate and have a good old time with it But now I'll watch porn and like I'll start masturbating I'll be like, ah you two have sex with each other and then I'll come then I'm like I'm part of the problem Can't believe that I did this glass ceiling in the workplace is so hard. That's so anti-feminist. I mean That woman somebody's daughter, you know, not that guy's daughter like it says in the title, but she's somebody's daughter You know Basically I watch porn the way I used to play video games with my brother, which is fuck I just fucked up the joke god damn it. I fucked up the joke boo boo, I I Will say it anyway because I like the joke the joke is that I watch porn The same way I used to hang out with my brother, which is I beat it while my brother",
      "start": 7639.36
    },
    {
      "text": "it. I fucked up the joke boo boo, I I Will say it anyway because I like the joke the joke is that I watch porn The same way I used to hang out with my brother, which is I beat it while my brother watches And I make fun of myself a lot which I'm okay with I like making fun of myself I don't like when other people make fun of me like my sister has bullied me my whole life My sister is a very mean person Like for example a couple of Christmases ago. My parents were not doing well My dad my mom both lost their jobs in the same year so they could only get me like comic books for Christmas Which is a nice gift when you're really struggling and I was really touched by it, but my sister made fun of me She was like really Mike you're in your 30s. You're reading comic books. What do you still think you're gonna become a superhero? And that hurt my feelings. So I was like, I don't know Tiffany you're in your 40s and your romance novels Do you still think somebody's going to love you? I'm not",
      "start": 7691.1
    },
    {
      "text": "you're gonna become a superhero? And that hurt my feelings. So I was like, I don't know Tiffany you're in your 40s and your romance novels Do you still think somebody's going to love you? I'm not drunker. Thank you guys very much Give it up again for Mike Drucker everybody Amazing well, I am happy to tell you that we have now reached the musical portion of our evening This is normally the part of the show where I would tell you all to get on your feet but they didn't give you fuckers chairs, so I Guess that patreon money only goes so far All right, we got some great acts coming up we're gonna start off with an amazing one Please give it up for mega ran Kinda Funny Oh This is amazing, this is my boy Rocky Tauret everybody So I didn't come here to talk I came here to wrap Let's talk some Final Fantasy 7. Shall we? All right. This song is about the meanest baddest group of insurgents to ever blow up a Mako reactor I'm talking about avalanche. Yeah, let's do it Now for this song Your",
      "start": 7738.86
    },
    {
      "text": "Final Fantasy 7. Shall we? All right. This song is about the meanest baddest group of insurgents to ever blow up a Mako reactor I'm talking about avalanche. Yeah, let's do it Now for this song Your word is hey Hey, hey Hey Hey I don't know exactly what thing it says They wanna get you showed on my live stream And I just can't let that continue They don't care who they hurt, who they is, yeah Tell my whole family to kiss us See if we can join the resistance Or you wind up going against us My name is Barrett Wallace I'm over paralyzing Over-rushing, posing just to finish it Fantasize it Wish this world wasn't about it It'll get worse if we allow it I head with a cannon for an arm and a mile And never really sign it And I represent Avalanche Them chumps don't have a chain Watch them scatter, man When Paris land was battle-flazed My people beside me, team, remember how they Put them in the place of reason Big sweat, Jesse, and anybody in my way We squeezing Behind me I believe in the bomb",
      "start": 7820.36
    },
    {
      "text": "man When Paris land was battle-flazed My people beside me, team, remember how they Put them in the place of reason Big sweat, Jesse, and anybody in my way We squeezing Behind me I believe in the bomb in the region It's gotta be the highest treason We can't do more of the back down And I'm not leaving till we even Bring it to number one, you can get it quick Pressing the chin, restore hips It's alright for the gang, get your shoulders in Okay, Sam, man, let's go! Hey! They're just not a hater Yeah, yeah And the courage got a bit further to go Enemies gettin' rid of my enemies A-B-A-L-A-M-C I can't hear you Hey! That's not a hater No germs Got a further to go Do what I gotta Who want that problem? A-B-A-L-A-M-C-I-G-L-E-S P-A-R-R-E-T They gon' have to come get me if they want me I don't pen, don't print, don't care about much My daughter, Marlene My people's being freaked You gotta understand, son I don't have the answer I just keep the faith and we always keep a hand No, I mean that",
      "start": 7920.16
    },
    {
      "text": "don't print, don't care about much My daughter, Marlene My people's being freaked You gotta understand, son I don't have the answer I just keep the faith and we always keep a hand No, I mean that literally Cause I got a handgun I call that a gun arm, so I'm never unarmed, got it? Battle scarred from the chicks scarlet Wet-laced developer who caught me in her dump And now I try to say my friend died Lost my grip, she shoved my head I thought my friend had died So I kept his door on a razor Asked my own chap I discovered God was alive And he gon' keep going till the planet is at peace And this somebody's gotta go That's just a small casualty Keep my eyes on faith And I keep a bad attitude Pity the fool that compare me to that other dude Ever last me rapping Till we pass on Even if I'm going kinda funny He's got my back Here we go! Hey, Kurz, hey, not a bad curve It's what? Hey, Kurz, hey, not a bad curve It ain't go Any means Get me rid of my inner Hey, B, A, M, A, F, G, A, C Keep going",
      "start": 7977.26
    },
    {
      "text": "kinda funny He's got my back Here we go! Hey, Kurz, hey, not a bad curve It's what? Hey, Kurz, hey, not a bad curve It ain't go Any means Get me rid of my inner Hey, B, A, M, A, F, G, A, C Keep going Hey, Kurz, hey, not a bad curve No, sir, hey, got a bad curve It ain't go Do what I gotta Hey, who want that problem? Hey, B, A, L, A, F, G, A, C Just have to be big Mega rad, so mega rad, what's up? Hey, we hope you made one today Mega rad, hey You guys having a good time? Wow, alright Put your good arms in here one time Give a good arm real quick Good arm Yeah, that's awesome Now let it go on the count of three One, two, three Yeah, that's beautiful Alright, have you noticed by the name Mega rad I actually like this video game that's called Mega Man And it's a member of the Kinda Funny crew Who also likes Mega Man So I wanna bring him on out Please make some noise Yeah You know who I'm talking about Make some noise for my friend New York's The one and only Karlous Keep it going Okay,",
      "start": 8034.96
    },
    {
      "text": "Who also likes Mega Man So I wanna bring him on out Please make some noise Yeah You know who I'm talking about Make some noise for my friend New York's The one and only Karlous Keep it going Okay, okay Let's get it, let's get it, let's get it Let's get it, let's get it Karlous in the world Amazing advancements in the field of robotics And money with no object But he never felt the need to make a problem with projects And our best friend Dr. Light That have changed the world, we stay together Grabbed the competition, turned up in a robbery And one that can change forever Yeah, why they thought he done enough? But no matter how good he was He was always running rough He got sick of second place Felt like it was wild, he's trying to start coming up The school had a contest To the world technology and chart on our progress Wilding in like a liberated but like a loaded accolades Well, Percocet, yeah, yeah And he had enough of that Started acting up Capped his stuff and though it was that",
      "start": 8102.56
    },
    {
      "text": "and chart on our progress Wilding in like a liberated but like a loaded accolades Well, Percocet, yeah, yeah And he had enough of that Started acting up Capped his stuff and though it was that was up We weren't buying it But that's the beginning of a mad scientist Might win some, just lost one They were real, then the wars got what? Stable for what? That's no fun Built a robot to call his son Rock, named for his love for music And they have a system, that they're too big Teenage boys, girls included Always amusing That's them little preps I ain't gonna live all alone He was another robot named Joe Life was grand Little did he know Front to back, everybody Somebody say Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie I'm taking over Just take him Stop Stop Wylie Stop Wylie Stop Wylie Why did they say Dr. Wylie? Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie I'm taking over Just take him Stop Stop Wylie Take him",
      "start": 8152.06
    },
    {
      "text": "Stop Wylie Stop Wylie Stop Wylie Why did they say Dr. Wylie? Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie Dr. Wylie I'm taking over Just take him Stop Stop Wylie Take him on the track Stop Wylie Come on, come on All is well The city of robots A piece of love No shots no jumps Forget who can't Step to the top If a angel comes He's heading me That I will not Rope the land Repo man Left all the robots Repo grand Cup man, Iceman, a black man Cup man, fireman Rock and roll keep those man If a statue is ready Repo man If a tree is chosen Repo is playing And you can just let me down And if you want to stop What you got about now Everyone is hot Could be taming like First, everybody's waving like Rock has one profile Left is rock And this kid Is an even train In a fight All world domination He's helping Big summer Blue student helmet Delt's rock Don't kill him You can help it Can't believe my old friend So selfish The structure's my only objective If only we'd only",
      "start": 8202.06
    },
    {
      "text": "All world domination He's helping Big summer Blue student helmet Delt's rock Don't kill him You can help it Can't believe my old friend So selfish The structure's my only objective If only we'd only respected If only the blessing Made me feel like I'm the one If only the blessing Made all of this blind It's just a matter of perspective Can't let a witness sweat It's time to get equipped Doc is tight Doc has Wally in his sight Can't bring himself To end his life They ain't like the Doc in the cave Where they think they'll spend The rest of his judgment But I heard the other day He escaped and he might Be his same friend Somebody say Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley",
      "start": 8253.06
    },
    {
      "text": "Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Thank you guys so much. Oh my gosh. Panda, Panda, Panda. Thank you. Oh my gosh. Thank you Kinda Funny. You guys are the best. Make some noise for yourselves.",
      "start": 8299.06
    },
    {
      "text": "Dr. Wiley Dr. Wiley Dr. Wiley Dr. Wiley Thank you guys so much. Oh my gosh. Panda, Panda, Panda. Thank you. Oh my gosh. Thank you Kinda Funny. You guys are the best. Make some noise for yourselves. One love, one love. Y'all, let's hear it one more time for Mega Ran. Come on. And holy crap, let's hear it for Colin. What was that? Who knew? I didn't. All right. Best friends, best friends. I hope you guys are ready for this because shit is about to get real. Our next act came up strong on the streets of the marina. And if you're from out of town, that's not a very tough neighborhood. That was the joke. One of these performers knows way too much about the internet. The other doesn't know a goddamn thing. Please welcome the Internet Explorers. Yo, who the fuck knows what happens if y'all talk shit? Let me tell you. You talk shit, you get shot. Yeah, you talk shit, you get shot. Yeah, you talk shit, you get shot. Yeah, if you out there knocking shit, then you know you bout to get shot. You",
      "start": 8379.06
    },
    {
      "text": "shit? Let me tell you. You talk shit, you get shot. Yeah, you talk shit, you get shot. Yeah, you talk shit, you get shot. Yeah, if you out there knocking shit, then you know you bout to get shot. You really need to pay for two. Where's the ego? Because he's fat. Now he's for his ego. Call it for a playstation Tito. He's super frustrated like a hard to find a people. We have a fucking year. You didn't write the rest of the song. Why did you do that? Cut the music. Cut it. Cut it. Cut it. Cut it. Tim, I thought we had the rest of the song down. Nick, we had a year to write it. I put that on you. What the hell are we even doing? I don't know. What are we doing? What are we doing? What are we doing now? Why are we doing? Should we do the new shit? We should do the new shit. Do you guys want to hear the new shit? Yo, what's the new shit? Make some noise. All right. Best people in that new shit. All right. Oh, that's familiar. I think I heard this before. Turn that shit up. We're talking",
      "start": 8457.06
    },
    {
      "text": "to hear the new shit? Yo, what's the new shit? Make some noise. All right. Best people in that new shit. All right. Oh, that's familiar. I think I heard this before. Turn that shit up. We're talking one million, two million, three million, four. We ain't gonna stop this like ten million more. I'm hard as you thought, but you know I ain't hungry. Look around you. We are all kind of fucked. We are all kind of fucked. We are all kind of fucked. Fuck your family. Tim, what's good, brother? What's up, motherfucker? This is unreal, dude. Shout out to Tim Gettys for bringing me out here. Next, Garfito holding us down. So, it's a fucking honor to be here in San Francisco with all the best friends tonight. Make some noise for yourselves. My name is Tone Deff. That's the C-O-N-E-D-E-F-F. No spaces. What was that? No spaces. What was that? What was that? Very, very good. So, check this out. Last year, Tim brought me out to do Kinda Funny One. And he said, Tone, I want you to do your song called",
      "start": 8512.06
    },
    {
      "text": "What was that? No spaces. What was that? What was that? Very, very good. So, check this out. Last year, Tim brought me out to do Kinda Funny One. And he said, Tone, I want you to do your song called Glutton. I said, why? He said, trust me, it's gonna be epic. Did anybody see the performance from last year? Okay. So, this year, Tim calls me up and he said, yo, we want you to remix that Aerobic shit. I said, really? He said, yeah. It worked out. And then he said, Tone, I want you to do that Glutton shit again. And I said, nah, B, I already did that shit. They're not gonna wanna hear that shit. And he's like, trust me. So, with that said, can I do Flying Again for y'all tonight? So, check it out. In the middle of this song, there is a break. I've done this all over the world. If we can do this with the best friends tonight, it would be amazing. There is a break. And when this break happens, I want everybody front to back to get low to the floor on one knee. And then we're gonna build,",
      "start": 8685.06
    },
    {
      "text": "this with the best friends tonight, it would be amazing. There is a break. And when this break happens, I want everybody front to back to get low to the floor on one knee. And then we're gonna build, build, build, build, explode. Can we do that, Minda Funny? I think we can do it. Let's go. Y'all ready? Are y'all ready? All I need you to sing is, ay, ay, ay. Come on, come on. Ay, ay, ay. Now here we go. Ay, ay, ay. Come on. Now here we go. Ay, ay, ay. Come on. Now here we go. Ay, ay, ay. One is not enough, I'm a-clutting. Ay, ay, ay. Gonna take it all off till there's nothing. Ay, ay, ay. Grass-fed at the bottom when I plunge it. Ay, ay, ay. Never sleep because I'm always hunting for more. Nothing has ever run out because I never clutted. Ay, ay, ay. Consumption is my only function. Ay, ay, ay. If I run out of the bubble, what am I gonna get? Ay, ay, ay. Never sleep because I'm always hunting for more. And I got that cream and porridge when I'm at the table sorta. When I'm not",
      "start": 8763.06
    },
    {
      "text": "Ay, ay, ay. If I run out of the bubble, what am I gonna get? Ay, ay, ay. Never sleep because I'm always hunting for more. And I got that cream and porridge when I'm at the table sorta. When I'm not surveying sources for one of my most favorite courses. I just wanna taste the morsel, save and also make it cautious. The empty dish makes me nauseous till I'm sedated with way and cautious. Aiming for more than I ever see. So the bill was the same as before. The battlegrounds are my appetite. They're taking over the red band of my palette that is made of a tool. I'm not a man, no I'm a man. The cake, the bread, the cake, the trash, the waste of all the hate, the ball, the plate, the problem, the table, the time, the time, the time, the time, I'm gonna scrape the wall. Ay, ay, ay. Come on, tell the boys, let's do this. Ay, ay, ay. Everybody hear this mother fucker. Ay, ay, ay. Never sleep because I'm always hunting for more. Nothing has ever run out because I never clutted. Ay, ay, ay.",
      "start": 8827.06
    },
    {
      "text": "tell the boys, let's do this. Ay, ay, ay. Everybody hear this mother fucker. Ay, ay, ay. Never sleep because I'm always hunting for more. Nothing has ever run out because I never clutted. Ay, ay, ay. Consumption is my only function. Ay, ay, ay. If I run out of the bubble, what happens? Everybody get low. Get down. Come on. Everybody get low. Everybody, everybody get low. Everybody, everybody get low. And stay low till we go. Listen, I want it all. Let's go. I want it now. We're coming down to you. Your heart, your soul, your time. Everything that's screaming out gets crushed in my mouth. Everybody get low. I want it all and I want it now. Your heart, your soul, your time. Everything that's breathing out gets crushed in my mouth. Here we go, here we go. Come on. I want it all and I want it now. Your heart, your soul, your time. Everything that's breathing out gets crushed in my mouth. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on.",
      "start": 8865.06
    },
    {
      "text": "it now. Your heart, your soul, your time. Everything that's breathing out gets crushed in my mouth. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. Come on. It's so hot. And I want it now. I want it all. Right now. Right now. Right now. Make some noise. Thank you very much. San Francisco. Best friends. I love y'all. Tim, thank you very much. He was right. He was right. Tim was right. Thank you very much. Hey, when I say tone, y'all say, come on. Tone. Tone. Tone. Tone. Tone. Tone. Tone. And I'm out of here. I love y'all. Peace, baby. Wow. We got to give it up again for Tone Deaf. Come on. Wow. And let's hear it for the Internet Explorers as well. I want that pair of sunglasses. They're just too beautiful. You know what? Give it up for yourselves. That was awesome. You guys were incredible during that. What's that? Fuck rap. I'm not rapping. I'm a 43 year old white",
      "start": 8931.06
    },
    {
      "text": "They're just too beautiful. You know what? Give it up for yourselves. That was awesome. You guys were incredible during that. What's that? Fuck rap. I'm not rapping. I'm a 43 year old white dude. That's against the fire code. Hey, guys, I got to say, I'm feeling really triggered right now. I just came here to MC and I'm feeling super attacked. It's not fair. What's the get over it? Don't ever say that on the Internet. It's the end of your career. Listen, I like you a lot too, but look, I just think we're going in opposite directions, sweetie. But maybe we can maintain contact and talk every now and then. Friend zone. All right. Let's keep this going. How do you guys feel about a little lip sync battle? All right. Well, let's get it started. I know. I'm not. But if you want to give it to me, I'll give it to me. I'll give it to you. You're doing what you can. You're. Super sonic, idiotic, it's connected. You want to go to the top that saturates the pretty face, but hanging in your face,",
      "start": 9062.06
    },
    {
      "text": "I'll give it to me. I'll give it to you. You're doing what you can. You're. Super sonic, idiotic, it's connected. You want to go to the top that saturates the pretty face, but hanging in your face, I wish that you would take a look at what you thought. Well, I don't really give up about trying to stop that. Stop that. I wish you'd probably take a really, really stop that. What's that? I don't really give up about that. You can try to use. Hey, what's up, everybody? It's Nick, the producer slash producer. You're about to watch my lip sync battle. Spoilers. It's going to be the best. But I need you to do something for me. When we get to the chorus, you guys know what to do, right? You got to get that phone out. You got to strap on, hit a video of yourself, Swell-Fy mode, and then ride that pony with me while you're filming yourself. Just put that chorus down flat and then spoilers. Yeah, it's got to go right up to social media. Hashtag, haas, haas, haas. Oh, I'm just a bad girl Never",
      "start": 9154.06
    },
    {
      "text": "pony with me while you're filming yourself. Just put that chorus down flat and then spoilers. Yeah, it's got to go right up to social media. Hashtag, haas, haas, haas. Oh, I'm just a bad girl Never thought I'd see you So I'm on your side Without getting found in love I'm just a bad girl Never thought I'd see you So I'm on your side Never thought I'd see you So I'm on your side I'm just a bad girl Never thought I'd see you So I'm on your side I'm just a bad girl I'm just a bad girl I'm just a bad girl I'm just a bad girl When I'm in love Jump on it Jump on it Let's do it Ride it My pony My saddle Wait in line Jump on it Jump on it Let's do it Ride it My pony Give them some more dance moves. I got to make these tears, don't you doubt me It just needs something that you wanna hear So when you see me, you're on me, and you're not sure You're gonna want to see me So when you see me, pull up that tight and keep going And when you turn off that light, turn your electric field The voices are",
      "start": 9247.06
    },
    {
      "text": "see me, you're on me, and you're not sure You're gonna want to see me So when you see me, pull up that tight and keep going And when you turn off that light, turn your electric field The voices are as fast as you can And when you're on the top, you may ask it, what's up? So tonight, get ready to fly Cause we're gonna live in honor And you're just having fun with me And those are the places you wanna be And when you're on the top, you may ask it, what's up? The flight feels like the one for some of you who have never operated a seat before Really? I mean, it works like this Insert the metal end into the buckle until it clicks And pull on the loose end to tighten Making sure it fits fully tight across your lap There you go To open, lift on the top of the buckle And remember, seat belts should be fastened whenever you're seated Just in case of unexpected turbulence or weather conditions Personal electronic devices should be turned off and properly stoked during taxi, takeoff, and",
      "start": 9374.06
    },
    {
      "text": "should be fastened whenever you're seated Just in case of unexpected turbulence or weather conditions Personal electronic devices should be turned off and properly stoked during taxi, takeoff, and landings Laptops should be placed inside carry-ons or under the seat Not in seat back pockets or a huge home efficient next to you Nice try Your Inflight team with a sign above will determine when electronics may or may not be used during flight Yo, yo, yo, lay it up in your head You can't see the lights, you can't see the screen You can't have any precious changes, we don't need what we need You can't even move your mask down First and worst, the oxygen blows Tightness drops after placing on your mouth and your nose If you're traveling with someone like a child You can't put your man on first before you offer a visit Okay, so listen to Putin follow your smores out there It's never allowed here to let you forget Federal law prohibits temperament Destroying or disabling smoking So don't touch",
      "start": 9432.06
    },
    {
      "text": "you offer a visit Okay, so listen to Putin follow your smores out there It's never allowed here to let you forget Federal law prohibits temperament Destroying or disabling smoking So don't touch that skin Don't you know the answer? Yeah, yeah, under your seat There's a life that's like class Class gets real nice and tomorrow's Remove the couch, tear it open, place it over your head Are we coming in clear? Keep it clear when we say The whole of white straps and tightness You are the proudest waste Ruins off the plain Pull that hazel and your fist will inflame If your bet doesn't feel funny No big deal, blow into your head too And you've got everything There's a plan for pain and life And it's much fun, you're so good Thank you for your attention This war by class is over Now you know the law It's clear when we say The whole of white straps and tightness You are the proudest waste You are the proudest waste We'll be proud of it when we say The whole of white straps and tightness The",
      "start": 9475.06
    },
    {
      "text": "law It's clear when we say The whole of white straps and tightness You are the proudest waste You are the proudest waste We'll be proud of it when we say The whole of white straps and tightness The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say",
      "start": 9536.06
    },
    {
      "text": "straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we",
      "start": 9554.06
    },
    {
      "text": "straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we",
      "start": 9558.06
    },
    {
      "text": "straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we",
      "start": 9562.06
    },
    {
      "text": "straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness We'll be proud of it when we say The whole of white straps and tightness Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco!",
      "start": 9718.06
    },
    {
      "text": "Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco! Cisco Cisco! Cisco! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you! Thank you!",
      "start": 9780.06
    }
  ]
}
