{
    "id": 2404,
    "video_id": "8mkJ2ZKPruc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Fascism in America - The GameOverGreggy Show Ep. 167 (Pt. 3)",
    "description": "We continue talking about the ethics of punching Nazis.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487145601,
    "duration": 1385,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by MVMT Watches. MVMT Watches was founded on the belief that styles shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices. With more than 500,000 watches sold to customers all around the world, MVMT Watches has solidified itself as the world's fastest growing watch company. MVMT Watches started just $95, but at department stores you're looking at 400 to 500 bucks. MVMT figured out that by cutting out the middleman and going online, they can get rid of all that retailer markup and just get you the watch you want. Get 15% off today with free shipping and free returns by going to MVMTwatches.com/Greggy. That's MVMTwatches.com/Greggy. What time is it? It's time to step up your watch game. Now they said it was time to step up your watch game. I added to what time, what time is the thing of the front because I",
            "start": 0.08
        },
        {
            "text": "MVMTwatches.com/Greggy. What time is it? It's time to step up your watch game. Now they said it was time to step up your watch game. I added to what time, what time is the thing of the front because I thought that was funny. MVMTwatches.com/Greggy. I don't know. To to to me, I just encourage people out there to just there is, I want to be clear about something, there is a place for political violence. There is. Like to anyone who said it says otherwise, it's just being intellectually dishonest. We were founded in a violent revolution in the United States. It's not like we just asked the British to leave. We fought them and killed them. But we exhaust all options. We exhausted many options and it's still unclear who started hostilities in in 1775. But it is clear that we didn't really want that, you know, and they didn't really want it either, which is why they didn't win the war because of Lord North and all, you know, we don't get into the history, but it doesn't really matter. The point is is that",
            "start": 39.4
        },
        {
            "text": "know, and they didn't really want it either, which is why they didn't win the war because of Lord North and all, you know, we don't get into the history, but it doesn't really matter. The point is is that there is a place for that and that happens and sometimes the violence is **** way out of control. Like you can read about the French Revolution, which was insane in terms of its VI, like absolutely nuts, you know, or the Russian Revolution, the, you know, the really the the October Revolution when they murdered the entire Royal Family. There's all sorts of violence that goes too far and then there's violence that seems to be justify because you're trying a means to an end. So I'm not saying that there's no place for that. What I'm saying is that we are nowhere near that sort of Tipping Point in in in just in historicity. You know, what was going on in the 20s and early 30s in Germany was **** heinous and anyone who talks about like, well, the parallels are so clear, like what are you, what parallels?",
            "start": 94.8
        },
        {
            "text": "just in historicity. You know, what was going on in the 20s and early 30s in Germany was **** heinous and anyone who talks about like, well, the parallels are so clear, like what are you, what parallels? You know, Germany lost a war in 1918. There was this myth, this myth going around of the stab in the back, which I'm sure a lot of the audience know, the idea that the politicians sold the military out, that the military wasn't going to lose the war, that they pulled the rug from out under under them. So this's this massive like for years like this budding of like the politicians sold the military out. We shouldn't have lost. They signed the Treaty of Versailles. They're blamed for the war in writing and they're asked to pay reparations. The reparations become so incredibly bad for them that they start printing money to pay the reparations and cause hyperinflation in their country where where where basically you're wiping your savings out. So now people are poor. There there's an economic depression",
            "start": 129.28
        },
        {
            "text": "printing money to pay the reparations and cause hyperinflation in their country where where where basically you're wiping your savings out. So now people are poor. There there's an economic depression going on. The stock market crashes in New York City. All of this kind of stuff happens. Then the Nazis come to power. Like what what the **** is anyone talking about? What is the parallel there? We're talking about like a really bad situation that that not that the Nazi rise is justified. You can understand how people in Germany at that time were like, we are just completely **** destitute and we're desperate for whatever solution you have. And so they turn to them. Like what is happening in the United States where everyone's like, can't you see the parallels? Have you seen the one going around from the Holocaust Museum or whatever of the signs of Nazism or whatever? And it's it's basically like the kind of Make America Great Again, right? Make the people believe that they are already in a place that isn't",
            "start": 170.72
        },
        {
            "text": "Museum or whatever of the signs of Nazism or whatever. And it's it's basically like the kind of Make America Great Again, right? Make the people believe that they are already in a place that isn't this uh I guess I mean push down. Well, I'm just saying, I mean, like this is where the parallels are. I see those things, but like I'm like, I'm just looking at the actual record of what happened, the steps that led to that. Everyone forgets Hitler was in jail, you know, like they he was actually imprisoned in the 20s for like what he was doing. People didn't like him, you know, like it like it's it's only when things got so very very very desperate that he became the power. And even then he used a bunch of parliamentary maneuvers and was given power and wasn't really even elected to that to the position he ended up in. And then things went to ****. And I'm not saying that there isn't like one string to draw here and there about that. What I'm saying is the utter alarmism is causing these this kind of violence",
            "start": 213.36
        },
        {
            "text": "up in and then things went to ****. And I'm not saying that there isn't like one string to draw here and there about that. What I'm saying is the utter alarmism is causing these this kind of violence and these kinds of things to happen. And we have to just look at it from a calm perspective. What has happened happened? Well, a man won an election, a free and fair election based on the rules of the game. He is the fifth President to be elected not winning the popular vote. That's not a new thing. You know, there's a a steep divide in the country and everyone hates each other because of this this presidential election in these politics. That's about as far as we can let it get if we just become reasonable again and and and and start talking to each other. And so when everyone just runs around ramping all this rhetoric up and no one wants to take the time to learn what the **** talking about, then you get that kind of situation in which, you know, you you feel like you have to resort to violence on",
            "start": 252.72
        },
        {
            "text": "all this rhetoric up and no one wants to take the time to learn what the **** talking about, then you get that kind of situation in which, you know, you you feel like you have to resort to violence on the street. And what I say is that that isn't the answer. Violence isn't the answer at this juncture. We're nowhere near near a juncture where violence is the answer. And freedom of speech is a very important thing that we have to protect. We have got to protect. It is the pillar and the cornerstone of everything we hold dear in the United States. And when that starts to become eroded, we are in a lot of trouble because then you start getting Fascism and then you start getting Nazism or Communism or all the things. Why do you think that the the Communists wouldn't control their people so hard so so to such a degree? Because the the system didn't work. As soon as information was injected into their society, they realized that they were wrong. See, this is where the fear comes in and this is where the",
            "start": 295.48
        },
        {
            "text": "to such a degree because the the system didn't work. As soon as information was injected into their society, they realized that they were wrong. See, this is where the fear comes in and this is where the parallels do come in, right? Is that this Adolf Hitler didn't take power overnight, right? There wasn't just a moment in time where he goes, I'm out of prison, let's rock and roll on this, right? That that was a 10-year, according to you, uh span, right? Took power what, 33, 1933, um started that process well before that. And this is the this is the problem is a lot of people look at those those societies that so easily control their population. How do they do it, right? Okay, well, they um they instill in them some sort of uh anti-other people uh rhetoric, right? Um in the Nazis case, it's the Jews. In our case, the anti-Islam, right? Let me, can I run through this real quick? Because it's it's literally paralleling what are you saying? Oh, sure. This is the thing that was going around early warning signs of fascism.",
            "start": 338.76
        },
        {
            "text": "right? Let me, can I run through this real quick? Because it's it's literally paralleling what are you saying? Oh, sure. This is the thing that was going around early warning signs of fascism. This from the Holocaust Museum: powerful and continuing nationalism, disdain for human rights, identification of enemies as unifying cause, supremacy of the military, rampant sexism, controlled mass media, obsession with National Security, religion and government intertwined, corporate power protected, labor power suppressed, disdain for intellectuals and the Arts, obsession with crime and punishment, rampant cronyism and corruption, and fraudulent elections. I mean, that's I mean, to me, that that's that could be the a lot of those some of those are signs of fascism. A lot of those can be signs of almost anything. That's true. That's true. Again, but I think but I think the problem is a lot of people they don't know what to expect for Trump. But when he comes out of the gate firing on all cylinders, that's when",
            "start": 380.04
        },
        {
            "text": "that's true. That's true. Again, but I think but I think the problem is a lot of people they don't know what to expect for Trump. But when he comes out of the gate firing on all cylinders, that's when people say we need to do something now. At least we become, you know, draw the par history become repeats itself, right? And again, he's got eight years mirroring that, you know, talking about exponential growth as far as what Trump can accomplish now with the current modern military and communication. He could do what what Hitler did in a half the time if he wanted to. Not saying that he's going to, not saying that it behooves him to. I I gotta be honest with you, like and I I know this won't be a popular thing. He has almost a zero percent chance of doing anything close to what Hitler did. And that's and that's we have a see the the Weimar Republic, which is where he came into power and then dissolved it. It was a system that was nascent. It was really young. Like they they had come from a, you know, Bismarck and all that. The",
            "start": 415.4
        },
        {
            "text": "have a see the the Weimar Republic, which is where he came into power and then dissolved it. It was a system that was nascent. It was really young. Like they they had come from a, you know, Bismarck and all that. The the Third Reich, which is Nazi Germany, was the third iteration of like Germanic unification that started in the middle of the 19th century. So without getting too nerdy about history, the Weimar Republic only lasted for 15 years. These people didn't have constitutional traditions. These people didn't have a massive separation of power. They had more of a weak parliamentary system. We have an established uninterrupted government system since the 1780s. And and and the suggestion that one man is going to crumble that, you nuts. I'm not saying you, but like a lot of people out there. I don't think anyone necessarily a general. I think it's a general just reaction to the sheer ferocity that that has been Donald Trump over the last six to eight months. He just is a man that no one knows what to expect and he's he",
            "start": 448.28
        },
        {
            "text": "a general. I think it's a general just reaction to the sheer ferocity that that has been Donald Trump over the last six to eight months. He just is a man that no one knows what to expect and he's he seems like he's completely totally unethical anymore. And the problem, I mean, is that there's just no faith in the people. I the the checks and balance people that are behind him, you know what I mean? I'd like to imagine, yeah, that like impeachment this, that and the other. But then that education secretary just got but the court but the court struck but I guess I see what you're saying. But the court struck down the the the ban, you know, and then they and then they the the Trump Administration accepted that they struck it down and are are appealing it. But the the ban's over. It's not like it see a sign of fascism would have been the **** Court just told you that it's illegal and the Homeland Security and Defense Department's like, too **** bad, you know, that's fascism. But what just happened was the",
            "start": 493.88
        },
        {
            "text": "fascism would have been the **** Court just told you that it's illegal and the Homeland Security and Defense Department's like, too **** bad, you know, that's fascism. But what just happened was the system worked. The courts heard the case. They were like, this is completely unconstitutional. And and Homeland Security is like, okay, we're going to fight that in the court. But in the meantime, everyone's allowed in. That is the system working. The Betsy DeVos getting through is the system unfortunately working. She shouldn't have gotten through, but she did. And a lot of that frankly, as I wrote, has to do with the Jeff Sessions kind of delay and all that. It doesn't matter. Yeah, to me, I see the system working. It's just working in a very polarized way. Someone getting through 51-50, you know, in a c in a cabinet position is really strange. For the record, there are only nine cabinet positions or cabinet appointments in American history that were voted down. Nine. So it's not a common thing. So for someone to",
            "start": 531.72
        },
        {
            "text": "position is really strange. For the record, there are only nine cabinet positions or cabinet appointments in American history that were voted down. Nine. So it's not a common thing. So for someone to even pass by one vote by the Vice President having to break the tie is unprecedented, you know. But it but the system is is is functioning. And so I look at that and I'm like, are people do people really believe that the American system is just going to break down because of Donald Trump? I mean, it totally could, man. No one nobody thought he was going to win and he did. It's like it's he falls upward. It gains power. We all give him all everything. We're talking about this topic about giving the people power. That's what we're doing to him. What we're going to keep doing to him. And yeah, okay, maybe this time it all worked. Next time it might not. Maybe not would put it past it. But but that's the thing, Tim, and this is what this is what I'm trying to say, even though we're getting away from the topic, is my",
            "start": 572.28
        },
        {
            "text": "it all worked. Next time it might not. Maybe not would put it past it. But but that's the thing, Tim, and this is what this is what I'm trying to say, even though we're getting away from the topic, is my belief is this, that let's say he goes rogue, right? And there and he's doing some weird ****. Like I'm not brings in Sarah Palin. I'm not going to say I'm not going to Sarah Palin was a one time a pretty sexy woman woman. I just want to throw that out there. Still sexy. I'm throwing it out there. But I want like what I'm saying is like, let's look at the apparatus as it is. And he is doing some strange ****. For instance, having Steve Bannon on the National Security uh advisory. How do you feel? Do you believe that whole thing that that was something he didn't know he was doing when he signed the executive order? I don't I don't know. I don't I really don't think. I was watching Morning Joe this morning. It was a great show. Joe Scarborough, uh Mika Brzezinski. You guys should watch it if you don't. It's",
            "start": 610.04
        },
        {
            "text": "order. I don't I don't know. I don't I really don't think. I was watching Morning Joe this morning. It was a great show. Joe Scarborough, uh Mika Brzezinski. You guys should watch it if you don't. It's an MSNBC show. Really fantastic show. And they were talking about how like Steve Bannon's becoming so part of the cycle. He was on the of the of Time Magazine. He was on the front page of The New York Times today. And everyone's like, this is unprecedented for an aid basically, yeah, to be giving this much attention. And that the more this happens, the more likely he's going to be gone. Like because Donald Trump's not going to accept no matter how useful the man is to him, is not going to accept someone like besting him and looking like he's the **** Puppet Master, even though maybe he is. And that's the whole like tactic people are taking, right? Of sending mail to the the offices as President Bannon, right? Exactly. And so but what my whole stance is like, let's sit back. Let's not be alarmist. Maybe I'm wrong.",
            "start": 644.56
        },
        {
            "text": "like tactic people are taking, right? Of sending mail to the the offices as President Bannon, right? Exactly. And so but what my whole stance is like, let's sit back. Let's not be alarmist. Maybe I'm wrong. But the the point is that we don't we'll have a bunch of different chances to observe what is happening, right? And right now when I saw the when I saw, I was really interested to see what happened with the court because I was like, this will be a sure sign that something is a muck if they just refuse to comply with the court order because that's illegal. That's just straight up not allowed. That's unconstitutional. And what would happen? And I really do believe because the Republicans in Congress have no real allegiance to Donald Trump. They really don't. Like that's that's a fact. Lost them. Most of them do not like him. And most of them only are supporting him because they're going to try to get him to sign anything they want when they start actually passing bills, which they're not doing yet. The",
            "start": 680.68
        },
        {
            "text": "them do not like him. And most of them only are supporting him because they're going to try to get him to sign anything they want when they start actually passing bills, which they're not doing yet. The minute he does something crazy that's going to put them in jeopardy, they're going to impeach him, you know. And then again, we'll have a chance to see if the system works. In other words, the system eroding is not going to be this instantaneous thing. It will happen over time. And we can but but I don't see any evidence from a voting standpoint from anything. Yeah, the Electoral College and the popular vote were different. But that is part of the system going all the way back to like Tilden and other people that lost the that lost the electoral vote but won the popular. This isn't new and unprecedented. I'm not really seeing all I'm seeing way more alarmism that is not commensurate to what is actually happening. And I think that's the kind of **** that where we get to Richard Spencer and everyone getting ****",
            "start": 719.68
        },
        {
            "text": "seeing all I'm seeing way more alarmism that is not commensurate to what is actually happening. And I think that's the kind of **** that where we get to Richard Spencer and everyone getting **** all crazy about it. It's like, guys, just **** relax. Just relax and let's see what happens. Here's what I want you to explain to me then, uh, because not and like that it sounded more I think intense than I mean it to. Uh, you're talking about like they'd bounce him, they'd impeach him, right? The concern I have is the fact that with this this education secretary that it seemed like unanimously people are like, she's not the one for this job. He they all the Republicans vote for her except for two, right? Wasn't that the deal? Two of them are, two of them are allowed to leave. All Democrats, two Republicans. And then all the rep the Republicans on the other side of the Vice President breaking the tie. The question then becomes, why should I believe? And the whole thing was put out of like, she's giving money to all",
            "start": 750.72
        },
        {
            "text": "all the rep the Republicans on the other side of the Vice President breaking the tie. The question then becomes, why should I believe? And the whole thing was put out of like, she's giving money to all those Republicans that voted for. That's not fascism. That's just American politics. Sure. And that and but I mean, so stick with me because that's at the core of what I'm saying is that I feel like I and I've had you talked to me for a decade about this. I have no faith in American politicians. I feel like they're all two-faced **** behind the money to keep their jobs to do these different things. I don't think any of them have the balls to support the actually impeaching Donald Trump. And that's where that's what I'm talking about where it gets weird and why there's concern of like, well, like, you know, these signs that there's when you're talking about the signs of fascism, the drastic examples we've seen with fascism in history. But like seeing like seeds or parallels, can you bring me that sign again? I",
            "start": 788.92
        },
        {
            "text": "these signs that there's when you're talking about the signs of fascism, the drastic examples we've seen with fascism in history. But like seeing like seeds or parallels, can you bring me that sign again? I want to read the the don't listen. I don't disagree that if you look closely enough, there are seeds being sown that are totalitarian in nature and a little dispiriting and disassociated with our constitutional republic and the constitutional way we do things. But when I look at this sign with all due respect, it's like powerful and continuing nationalism. Like the United States is one of the most nationalist societies in American or in in world history. Like always has been. The term American exceptionalism is the most nationalist term there is. The fact that many Americans that they are supreme didn't start with Donald Trump, you know. Uh disdain for human rights. The Bush Administration was torturing people. This didn't start with Donald Trump, right? Uh identification of enemies as a unifying cause.",
            "start": 825.4
        },
        {
            "text": "start with Donald Trump, you know. Uh disdain for human rights. The Bush Administration was torturing people. This didn't start with Donald Trump, right? Uh identification of enemies as a unifying cause. We did that in World War II. That's not necessarily a a fascist or totalitarian thing. We rallied against the Japanese and against the Nazis. That's what countries do. I'm not saying what's happening now is is good. We shouldn't be rallying Islam or Muslims to your point. Obama even, I mean, Obama targeted down to radical Muslims, right? And Bush was uh uh weapons of mass destruction when we went into a mass destruction. Yeah, well, yeah, exactly what you're talking about. Again, it's to a point now. I think the lens is skewed, right? Of like, well, every Muslim's against us, which isn't what he said. I'm aware. But, you know, you know, I I understand. I mean, I think that's the most optically sound one in terms of like, well, we do we do seem to have an anti-Islamic kind of thing going on in the United States for sure. Uh rampant",
            "start": 871.64
        },
        {
            "text": "know. I I understand. I mean, I think that's the most optically sound one in terms of like, well, we do we do seem to have an anti-Islamic kind of thing going on in the United States for sure. Uh rampant sexism. I frankly am not seeing that. I I don't know what that means. Grab by the ****. Uh that's Donald Trump. That's not society. A society must a society must be a part of this for it to work. You understand what I'm saying? Like it starts. Your leader is saying that then it makes people think that's okay. But he said that. He said, I'm not saying that what he said or it did is right. What what I'm saying is like, you got to keep everything within the bounds of reason. Like controlled mass media. What does that even mean? The Free Press **** hates Donald Trump. This is like the antithesis of that. There is no controlled mass. But now he's out there saying though, don't listen. What was the the tweet the other day, right? Any polls that are negative aren't true polls. Yeah, and basically **** ABC, NBC, Fox. I",
            "start": 915.44
        },
        {
            "text": "no controlled mass. But now he's out there saying though, don't listen. What was the the tweet the other day, right? Any polls that are negative aren't true polls. Yeah, and basically **** ABC, NBC, Fox. I guess what I'm saying is like Corp corporate power protected. That is American tradition. I'm not saying it's right or wrong. Corporate power has been protected since the Gilded Age in the United States. Uh obsession with National Security. We've been obsessed with National Security for 100 years. But this is him banging the drum harder on that stuff, right? Like today him going after Nordstrom or whatever because of his daughter. Like that's not what a president does. No, I think that that's weird. But I I guess like rampant cronyism and corruption. Like that's that's you come from Chicago. That's like that the **** hotbed of that. I'm not insult what I'm saying. It's like that. See, Mayor Daley. How dare you? So what I'm saying is like, you could look at this stuff and I can say like, well, this is this is, yeah.",
            "start": 952.56
        },
        {
            "text": "the **** hot B of that I'm not insult what I'm saying it's like that Mayor Daley how dare you so what I'm saying is like you could look at this stuff and I can say like well this is this is yeah these are the early warning signs of fascism by the way most of this has been happening in the United States long before Donald Trump so it like it was Obama a fascist too I I just don't understand no he was a Muslim we knew this he was super so all I'm trying to say is that I mean we're getting off topic but to me I think we we split this into two topics a while ago but to me like I I just I wonder if we're if the rhetoric is being so disassociated with actual reality that we're getting to the point where people feel like they need to be violent know 100% that is this is back to the split of what we're talking about here is where nobody's listening to each other anymore no one's actually analyzing no one's talking no one's putting context in anything I do think there's a difference though",
            "start": 985.52
        },
        {
            "text": "we're talking about here is where nobody's listening to each other anymore no one's actually analyzing no one's talking no one's putting context in anything I do think there's a difference though between like the one guy punching someone and and people using the punch and talking about the punch like that's not violence does that incite more violence absolutely can and probably will but I I do think that that is their free speech to have that conversation it's like and going to prom and you know you're not supposed to bring alcohol but everybody brings a little bit of alcohol and no one really says anything but then there's the one kid that brings cocaine and gets cotton ruins it for **** everybody never make prom to a coke party don't do it exactly and that's the **** problem but I feel like it's just there's we can't let the bad apples ruin these protests and ruin these things and be the only thing that we talk about I agree and I I think that that that is what's happening time",
            "start": 1024.6
        },
        {
            "text": "like it's just there's we can't let the bad apples ruin these protests and ruin these things and be the only thing that we talk about I agree and I I think that that that is what's happening time and time again with all this where it's just taking these moments and making them like the only thing that matters when it's like the whole Berkeley thing there was people there uh exercising their right to protest and they did that they were protesting someone else's right to to speak but I mean that's how this system works right but and I wouldn't dispute that if that if that peace the process remain peaceful and they just shouted and chanted and had their signs that's that is free speech what's not free speech is attacking cops what's not free speech is is attack you know private property and attacking things and putting in a person in a situation even even a person that he might think is deplorable that he has to wear a bulletproof vest and be snuck out of the building basically that's",
            "start": 1061.8
        },
        {
            "text": "attacking things and putting in a person in a situation even even a person that he might think is deplorable that he has to wear a bulletproof vest and be snuck out of the building basically that's not free speech that's political violence that's well in excess of the actual situation on the ground and that's the point I'm trying to make I agree with you that there is a troubling trend on both sides to put the bad apples and kind of castigate everyone because of those bad apples understand that that happens with the right-wing as well right like we you know 6 million people voted for uh Trump as an example and he has millions and more people that probably support him they're all Nazis right even though there's only a few hundred Nazis in the United States they're all Nazis on the same token like Hillary Clinton had 65 million voters and there's plenty of sympathizers that didn't vote and or voted for Jill Stein or whatever they're all uh the pro the rioters right I agree with you which is",
            "start": 1100.2
        },
        {
            "text": "like Hillary Clinton had 65 million voters and there's plenty of sympathizers that didn't vote and or voted for Jill Stein or whatever they're all uh the pro the rioters right I agree with you which is why we have to just look at the Spectrum go to maybe the edge the last 5% on either side just cut them off throw them in the **** ocean shoot them off to the Moon who gives a flying **** then everyone else will be the reasoned mass that will stop this **** Madness you know and and I do believe that the system is powerful enough to withstand a man 10 times worse than Donald Trump I really believe that like it is set up to withstand tyrants you have to understand that the framers and the founders had a direct experience with a monarchy they knew exactly what could happen under totalitarian rule like under George II even though he wasn't really a totalitarian Monarch he was a parliamentary mon Monarch whole musical about this you should check it out exactly uh but you know they had",
            "start": 1137.2
        },
        {
            "text": "rule like under George II even though he wasn't really a totalitarian Monarch he was a parliamentary mon Monarch whole musical about this you should check it out exactly uh but you know they had experience with this so they were very scared of the consolidation of powers and if you read the Constitution as you should if you haven't it is a beautiful Patchwork of making sure that no one under any circumstance has all the **** cards at any given time it's why Congress under the original aegis of of the Constitution had the House was elected every two years by the people the Senate was elected every six years by the state legislatures right the the judges on the Supreme Court were appointed by the president and uh approved by the Senate for Lifetime uh service so that they didn't feel like they had to make political choices so that once they were in they could do what they thought was right without ever having to worry about getting elected again that is the beauty of the system",
            "start": 1178.08
        },
        {
            "text": "like they had to make political choices so that once they were in they could do what they thought was right without ever having to worry about getting elected again that is the beauty of the system insinuating that a businessman from New York City can come out of nowhere and blow that up is too far for me and I don't believe it I do not believe it and we are and if we see real tangible actionable signs that that is happening you will see me in the streets but until that point we have to look at things a little more tepidly and look at things a little more realistically and understand that we are just fraught with bad politics right now but the underlying Foundation is very strong indeed this underlying Foundation survived an invasion of the United States in 1814 this Foundation including the burning down and destruction of our nation's capital it survived a Civil War it survived a depression of ma of of Epic magnitude the likes of which we will probably never see again it survived a",
            "start": 1223.6
        },
        {
            "text": "the burning down and destruction of our nation's capital it survived a Civil War it survived a depression of ma of of Epic magnitude the likes of which we will probably never see again it survived a war a two-front war against two very powerful enemies that we fought at the same time and won it has survived a lot of things uh FDR in 1940 or 1944 could have been we are not having elections I will be president until this is over but they had an election in 44 months after the D-Day invasion they had an election in 1940 after Hitler had already moved into a bunch of countries in Europe we survived right and now we're going to look at Donald Trump and be like this is the end this is it come on guys you know like yeah we have a we have an unbalanced crazy man in the White House that doesn't mean uh and and he can do scary things and he has scary ideas it doesn't mean fascism is alive in well in America it does not mean that and so I'll leave it there we shall see oh hi I didn't see you",
            "start": 1265.96
        },
        {
            "text": "mean uh and and he can do scary things and he has scary ideas it doesn't mean fascism is alive in well in America it does not mean that and so I'll leave it there we shall see oh hi I didn't see you come in I was just subscribing on iTunes to the Kinda Funny Morning Show you can do the same on podcast service around the globe I just have an iPhone or you can go to SoundCloud.com/KindaFunnyMorningShow that's right ladies and gentlemen the Formerly Known Colin and Greg Live now Kinda Funny Morning Show is a podcast we listen to you 017 is all about communication so we put it up as YouTube videos I'm sure you've seen subscribe YouTube.com/KindaFunny or get the Kinda Funny Morning Show as a podcast on SoundCloud.com/KindaFunnyMorningShow your iDevice if you're dork like Kevin your Android thing how do you even get podcast on your thing you say to the watch I need a podcast what happens you don't you shrug you don't listen to podcasts I go to SoundCloud and download oh okay you're",
            "start": 1311.16
        },
        {
            "text": "thing how do you even get podcast on your thing you say to the watch I need a podcast what happens you don't you shrug you don't listen to podcasts I go to SoundCloud and download oh okay you're one of those guys what do you mean one of those guys I mean like what you can't just you can't there's no subs there's nothing ladies and gentlemen it's a podcast it would mean a lot if you went and subscribe to it you might say I watch it live on Twitch and to which I just say just subscribe who cares it's just a number subscribe hi it's Kinda Funny Morning Show SoundCloud Kevin",
            "start": 1355.64
        }
    ]
}