{
    "id": 2439,
    "video_id": "_rBwNuwEsTk",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Horizon's Amazing Photo Mode - Kinda Funny Gamescast Ep. 109 (Pt. 1)",
    "description": "Greg took some amazing photos in Horizon Zero Dawn.\n\nThanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1488202200,
    "duration": 1710,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient and recipe delivery service in the country. The mission's to make incredible home cooking accessible to everyone. Not all ingredients are created equal. Fresh, high quality ingredients make a real difference, so it's important to know where your food comes from. For less than $10 per person per meal, Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. Greg Miller, you might know him from his, you know, world-renowned Instagram series, Cooking with Greggy, is all about this Blue Apron goodness. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Gamecast. No S, just Gamecast. You'll love how good it feels and taste to create incredible home-cooked meals with Blue Apron, so don't wait. That's BlueApron.com/Gamecast. Blue Apron, a better way to cook. Cooking with Greggy, man, he's good. He",
            "start": 0.08
        },
        {
            "text": "love how good it feels and taste to create incredible home-cooked meals with Blue Apron, so don't wait. That's BlueApron.com/Gamecast. Blue Apron, a better way to cook. Cooking with Greggy, man, he's good. He makes good stuff. What's up, guys? Welcome to the first ever Episode 109 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the Nintendo Switch. Here it is. Hey, there it is. My God, we can't open it yet, but we can't open on camera. We open it. The Switch exists. Stuff inside the box. You have the box. You such a pretty box. Big fan. You like the box, Colin? I actually see the box. The unboxing is up, right? It's a good box. By the time this, by the time this posts, I don't know. It's Wednesday morning. Is the embargo, so yes, this has been up, but everything leaked already, so whatever. Those were stolen, Colin. I heard that guy returned it. Nintendo came in straight up like took it back from like FBI St KCK down their door. Reggie himself. Reggie has a battering ram with Mario's head on the front. It's",
            "start": 38.28
        },
        {
            "text": "Colin, I heard that guy returned it. Nintendo came in straight up like took it back from like FBI St KCK down their door. Reggie himself. Reggie has a battering ram with Mario's head on the front. It's weird, 'cause you think you would want one of the hundred of them that are going to be sold to uh to be stay in the wild, but yeah, yeah. But no, I I got mine pre-ordered already. Greg Miller, hi Greg, decided to stick with it. Why not? You got to Betty told you to held this for the first time today. I mean, it's yeah, we have more to say about it. Yeah, so I know, right? This I have a lot to say about it, but what are your what are your your Switch launch packages looking like? What what you what are you getting day one? Zelda? Zelda? Play another game? Are you buying any other controller? You buying? I pre-how much money going into your Nintendo Switch launch? 360, I would say, right? Plus tax, because it's the system plus the the game, yeah. And that plus I brought the I bought the Pro Controller, 'cause you lied. You said that",
            "start": 99.8
        },
        {
            "text": "going into your Nintendo Switch launch, 360, I would say, right? Plus tax, because it's the system plus the the game, yeah. And that plus I brought the I bought the Pro Controller, 'cause you lied. You said that when you take the Joy-Cons, you put them on the Joy-Con Grip, it feels pretty good. It don't feel pretty good. It does feel pretty good if you have baby. It feels like I'm holding a postage stamp over here. I need a meaty man witch, you know what I mean? That's my that for years with Vita, so hey, what up? Don't talk that way about Vita. You know, we've had up to with buttons than the damn thing. It uh yeah, so I I'll get Zelda and then we'll we'll I'll put it in the stasis until Mario comes out and then God knows what the hell happens. I'm going to be playing you and me at play any fun games. I'm not playing Mario Kart. He he allows himself fun twice a year. Max Dood is back though. Is back back golf on there. The port of an amazing Mario Kart game. Me me and Tim Gettys play put the Nend. I got my Nintendo",
            "start": 143.12
        },
        {
            "text": "Mario Kart. He he allows himself fun twice a year. Max Dood is back though. Is back back golf on there. The port of an amazing Mario Kart game. Me me and Tim Gettys play put the Nend. I got my Nintendo Switch coming. I got my Zelda coming. Sure. I got I'm going to wait and see what other games I end up just picking up whether digital not launch. We still don't know the release date. March is still what they're sticking to. 1-2-Switch. I want to make sure at least the office has a copy. Of course, whoever I don't care if it's me or you, whatever. We don't need more than one. Well, the thing about it is like we had this conversation. So all three of us have pre-ordered our Switches. Today we got the Switch from Nintendo. So depending on if you or I take this and play with it, that'll become our Switch. And then the Switch we get that becomes the office. And the Switches can have different profiles on them. So it's like we load it up, we'll be fine. You know what I mean? We'll have all three profiles there. Kevin",
            "start": 182.96
        },
        {
            "text": "the Switch we get that becomes the office and the Switches can have different profiles on them. So it's like we load it up, we'll be fine. You know what I mean? We'll have all three profiles there. Kevin, I'm sure will make one. Plays one game a year on this one. I got my name. I made my name a long time ago actually. And then I got an email with someone like that looks like someone was trying to get uh like was trying to get that name or or asked for like a lost password thing. That did you read the email? 'Cause it might have been a fan trying to help you. 'Cause I got an email of a fan trying to help me and he helped me. It said, did he really help? Oh yeah, yesterday. I thought you were all offended. He didn't help. Well, I was worried, but then I I I managed to get them to connect the email. The email said, you know, blah blah blah, click this link. And then it said, if you don't know why you got this email, you can delete it. Okay, that's what it about now. So here's the question though, 'cause this is I also don't care.",
            "start": 225.2
        },
        {
            "text": "blah blah blah, click this link. And then it said, if you don't know why you got this email, you can delete it. Okay, that's what it about now. So here's the question though, 'cause this is I also don't care. My name is this has been confusing is 'cause I have when they started Nintendo accounts, I went and made a Nintendo account, right? And then when I started Super Mario Run, it was like log in. And it was like I did that. And it's like, hey, do you want to make your account name or whatever? And I was like, okay. So I made GameOverGreggy. And then this week it broke as people are starting to get ready for this that yeah, Mario 64 helping the people out there. Okay, so this almost happened to you. You had your Nintendo ID. So there is, you know, the the old there's the Nintendo Network ID, right? Which is used for the Wii U and 3DS stuff. That that was the cluster **** when they didn't have things figured out. Then they now that all their their new stuff's coming out with the the mobile games, they're trying to like",
            "start": 262.84
        },
        {
            "text": "U and 3DS stuff. That that was the cluster **** when they didn't have things figured out. Then they now that all their their new stuff's coming out with the the mobile games, they're trying to like actually create an ecosystem. That's when they add this thing. But you can have nicknames. So you had your Nintendo nickname. But that those are things you can just change anytime. Okay, change the name anytime, buddy. I know. I saw that. I retweeted Kaiser's. So now there's the Nintendo account, which is going forward what we're doing now. Also, there's the My Nintendo account, which is the old thing like back in the Wii/DS days. That has been going up till now. Now that's the one I used to get hats for. I claim my points on. You get all Platinum Points and all that. A getting goofy ass **** all the time. You're still getting Platinum Points and stuff now with these. Had to get a job there. Yeah, yeah, no, she won. Um, anyways, so it's really confusing, but I finally have Tim Gettys across. Kid hit you up though",
            "start": 300.08
        },
        {
            "text": "still getting Platinum Points and stuff now with these. Had to get a job there. Yeah, yeah, no, she won. Um, anyways, so it's really confusing, but I finally have Tim Gettys across. Kid hit you up though and said, I got Tim Gettys to try to save you. Yes, he was like, 'cause I know there's going to be some **** out there trying to **** you over. Yeah, so like what happened with Pokémon Go? 'Cause before Nintendo had the **** all figured out. And so what happened is you were able to switch it over and bring it in. Was a really nice dude. Emailed me and like just he was like, here's the 10 password. You can change it. And like, here's your name. But what worried me is that I had my own account already. I just didn't have a username. I just had the nickname and the Nintendo Network ID. So then I had this other account. I had to figure out a way to link them. Did you do it? Yeah, I did. I lost a couple of my points, but I don't really care because the points are garbage at this sure point anyway. Do we care about points? It",
            "start": 335.96
        },
        {
            "text": "had to figure out a way to link them. Did you do it? Yeah, I did. I lost a couple of my points, but I don't really care because the points are garbage at this sure point anyway. Do we care about points? It was like, it's points. It's like you opened up Fire Emblem Heroes for the first time. You opened up Pokémon Go for the first time. Like, all right, cool. I can do that again if I had to. Sure. You know what I mean? So anyway, I bought my Nintendo Switch. I got my I got a Joy-Con Grip. The charge. Yeah, so I can charge them ****. I got my two neon blue Joy-Cons. Yeah, 'cause that's what I wanted. I wanted the blue on blue. It's the Kinda Funny blue. It's this blue. Well, first off, we just did a GameOverGreggy Show. Even this show though, we are excellently color coordinated here in a Kinda Funny blue spectrum. Even Nick had a blue shirt on or whatever. But yeah, that I mocked you, I think, initially when you did it. And then the more I thought about it, the more I think that that's going to look really hot. The Kinda",
            "start": 370.96
        },
        {
            "text": "had a blue shirt on or whatever. But yeah, that I mocked you, I think, initially when you did it. And then the more I thought about it, the more I think that that's going to look really hot. The Kinda Funny blue on these this guy. It's going to look good. And now here's the thing. Granted, when I'm outside in in the public eye at this point as a grown ass 7-year-old man, I want just the gray. I'm not trying to get attention on myself. I'm not trying to look like I'm playing with some toy or whatever. I don't want to deal with that. But when you give Tim Gettys the option to have obnoxious blue, I'm in. I'm **** in. Even if they make it complicated, oh, we're going to sell this thing with one red and one blue. You'll **** catch me dead with red on this thing. Whoa, I don't I don't roll like that. Better blue than dead. Mhm. That's the only way to go. So I I bought the additional blue also though, because I'm like, I the Switch to me, just like the Wii U, is going to be very much a friends are over. We're",
            "start": 407.96
        },
        {
            "text": "blue than dead. Mhm. That's the only way to go. So I I bought the additional blue also though, because I'm like, I the Switch to me, just like the Wii U, is going to be very much a friends are over. We're playing games together, local multiplayer type of system. So I need to have at least four uh controllers at all times, because God forbid Kuran invest some money on this. Kuran, what's going to happen with him? I bet you is he's not going to get one now. He's going to wait a while. Eventually his girlfriend, fiance at that point, probably wife will be like, Tim, what should I get Kuran for his birthday? And I'll be like, get him the Nintendo Switch. I mean, right? Why didn't you just like I did with the Wii U and the Wii, why don't you get it for wedding wedding gift? Buy him one a Nintendo Switch. I don't know. We'll see. He's only getting married. Maybe do I need to get him a wedding gift if I'm like the best man? Yeah, really need be special. Yeah, get him and get it engraved. Me my pres back. Tim loves you",
            "start": 443.64
        },
        {
            "text": "know. We'll see. He's only getting married. Maybe do I need to get him a wedding gift if I'm like the best man? Yeah, really need be special. Yeah, get him and get it engraved. Me my pres back. Tim loves you forever. Kuran. I'll bring my Nintendo Switch with my four controls. Anyway, I got a Pro Controller. Excited about that. Um, so I'm three controllers in. I'm missing one at this point, but I'm awake, 'cause I don't need a third. Sure. Well, I think the most multiplayer we're going to be doing is us horsing around together. Yeah, playing some Mario Kart. When I can't wait to get that Snipperclips though. I've been prepping Gia. I showed her a Let's Play of it. I'm like, this is happening. Was her first. She stoked about. Was her first question, are there trophies? That was not a first. She like, why would I play this game if there second or third question? But yeah, she did ask, is this on the Vita? And I was like, baby, no. That's my girl. That's my girl. This is our Vita. Yeah, we're all this. She's like, this is our system.",
            "start": 484.48
        },
        {
            "text": "game if there second or third question. But yeah, she did ask, is this on the Vita? And I was like, baby, no. That's my girl. That's my girl. This is our Vita. Yeah, we're all this. She's like, this is our system. Destined excited about. And I was like, yeah, yeah, we're excited about this. So anyway, I'm excited about it. And that's what I'm getting for my launch day. No, I'm not getting a Micro SD card yet, 'cause I'm going to wait out for that. There's no need. Yeah, you talk me down off that ledge. I was getting ready to do it. You're like, well, you don't need it right away. And they're going to go down to price. All yeah, all these people hooting and hollering about the Switch isn't even out yet and there's already a game out that can't even fit on in this. It's like, who the **** cares? These things are practically given away. It's not proprietary. If this is really an issue, you shouldn't be playing these games. Got hard to believe launches next week. Yeah, 'cause the GDC got PAX right on top of it. I got D.I.C.E. this week. It's",
            "start": 518.88
        },
        {
            "text": "it's not proprietary. If this is really an issue, you shouldn't be playing these games. Got hard to believe launches next week. Yeah, 'cause the GDC got PAX right on top of it. I got D.I.C.E. this week. It's like, it's it's all so muddled that I don't feel the excitement. And Grant that we have one now, I guess. But oh, I feel the excitement. I'm ready for it. I I want it here. But even that day, it's not like that day is blocked out to just play Switch. I think there's I mean, I've been reading a lot of, you know, I'm looking forward to playing Zelda. I think it looks fantastic. Um, but I mean, I'm reading a lot of a lot of chatter. Do you see? I mean, I'm sure there's excitement in certain spheres in Nintendo spheres, but there there there's certainly not a lot of excitement for Switch compared to compared to Wii or certainly Wii or even Wii U. Like, I think there's more than Colin was wrong, ladies and gentlemen. Each and every week we get together here. The Kinda Funny people didn't like that's not true. Yeah, it is. No, it isn't.",
            "start": 556.04
        },
        {
            "text": "Wii or even Wii U. Like, I think there's more than Colin was wrong, ladies and gentlemen. Each and every week we get together here. The Kinda Funny people didn't like that's not true. Yeah, it is. No, it isn't. That's not true. No, it's not. People loved. People thought the Wii U was going to be like the **** hottest **** ever. Now there were people out there that thought that it wasn't going to be. Yeah, us. Uh, but there was super hyperbolic **** going on about the Wii U. I don't even see that about the Switch. That's what I'm saying is like seems very tepid. People understand what they're getting. They're getting the Zelda machine that they're going to have to wait six months to play another game on. And that's and that sets expectations expectations down, which I think is fine. I think it's going to outsell Wii U. So I don't I don't think that's a huge problem, but I don't think it's going to, you know, relate the world on fire clearly. So if you were excited for Wii U when it was coming out at",
            "start": 592.88
        },
        {
            "text": "to outsell Wii U. So I don't I don't think that's a huge problem, but I don't think it's going to, you know, relate the world on fire clearly. So if you were excited for Wii U when it was coming out at launch, you were stupid. I agree. But there were I remember the excitement. I remember that. Fri I think it was Friday it came out, right? Or was this it was Sunday? Sunday. I remember. Yeah, 'cause I remember being off uh like that night reading. And that and that's why I stick by the fact that it wasn't maybe I'm just talking in our own echo chamber, but I remember when Charles like tweeted he was begrudgingly going to go get it. And he was like fourth in line, 'cause nobody cared about this stupid thing. See, that was that's not like that's crazy. He that there was so many lines saying Charles at GameStop. Like there was so many people in all of the lines for that. Dumb kids. You were a dumb kid. You didn't know. We'll see how it all we see how it all shakes out. If they don't have a strong E3, the thing is with",
            "start": 628.76
        },
        {
            "text": "there was so many people in all of the lines for that. Dumb kids. You were a dumb kid. You didn't know. We'll see how it all we see how it all shakes out. If they don't have a strong E3, the thing is with with all all those systems, whether it's the Vita, the Switch, or the not even so much the Switch, but the Wii U. It's like those are things where it's just like no one was excited about it. And then when people were when it came to launch day, all of a sudden it was just like, well, now I kind of want 'cause like the people that have them have a new shiny toy. Yeah, well, yeah, that's the thing. Unboxing the same **** with that. I was like, oh, look, this is a moment. Anyway, this is Kinda Funny Gamescast. Each and every week we get together, talk about video games, all the things we love about them and all that. You can get the show early at Patreon.com/KindaFunnyGames. Or you can get it late at Patreon.com. Nope, just you just get YouTube.com/KindaFunnyGames. I got distracted because all of a sudden the TV changed. Every",
            "start": 667.96
        },
        {
            "text": "can get the show early at Patreon.com/KindaFunnyGames. Or you can get it late at Patreon.com. Nope, just you just get YouTube.com/KindaFunnyGames. I got distracted because all of a sudden the TV changed. Every time we did a test, I opened it. It didn't click over automatically. But here we are. Anyways, this episode is brought to you by the one and only Patreon Producer Salem Gamal. Yeah, that's right. Get a fact check on that. Yeah, that's right. Salem Gamal. Were you just doing a Tusken Raider? Yeah. Oh, you like that? That's for you. That was nice. I like that. So the first topic of the day is not the Nintendo Switch, correct? It is Horizon Zero Dawn. You guys have already given your review on, right? In particular, we're going to be talking about the photo mode. Sure. Of that game. We're to talk about Horizon in general, right? Because I think it's a special game. You haven't weighed in on it. People are getting ready to play it at this time. Our reviews up. Uh, by the time this posts on YouTube, Let's Play will be up. You",
            "start": 700.24
        },
        {
            "text": "right? Because I think it's a special game. You haven't weighed in on it. People are getting ready to play it at this time. Our reviews up. Uh, by the time this posts on YouTube, Let's Play will be up. You can go watch that. The Kinda Funny Gamescast exclusive where we play an extra hour of it is up. Um, I want to know what do you think of Horizon Zero Dawn? Horizon Zero Dawn for me has been the roller coaster of a century. So I experienced it via your Let's Plays and sitting in watching it all. And I was super sold on the game just because it's gorgeous and it looks very fun. It looks like like my type of game from an aesthetic point of view. It looks like the opposite type of game that I'd like to play from a gameplay point of view. Open world. Here's a bu bunch of **** to do. Here's a way too many side quests and all that type of stuff. We even call things errands. Like I'm like, no, no, no, no, no, not my type of game. I I like the line linear narrative based stuff. It doesn't get the honor of being called a side",
            "start": 740.44
        },
        {
            "text": "and all that type of stuff. We even call things errands. Like I'm like, no, no, no, no, no, not my type of game. I I like the line linear narrative based stuff. It doesn't get the honor of being called a side quest. It's an errand. So I'm like, all right, that's cool. Um, but I'm still like, all right, cool. I I want to give this a shot because it's the the AAA level that it's at. I'm like, this deserves my time. And also it looks amazing, right? Um, the soundtrack sounds amazing. The visuals are great. The voice acting. All the things that like I care about from a AAA experience as an exclusive game. I'm like, all right, cool. I'm sold on this. Started playing it. And I was like, I don't like the beginning of the game. The beginning of the game soured me so much. I was like, this is so tropy, slow, cliche. And I'm like, it just put a bad taste in my mouth. Then I kept playing it. Immediately is way too big for me. Super open. And I'm just like, this isn't I don't like this, you know? Um, and then we then that's when we",
            "start": 779.52
        },
        {
            "text": "it just put a bad taste in my mouth. Then I kept playing it. Immediately is way too big for me. Super open. And I'm just like, this isn't I don't like this, you know? Um, and then we then that's when we did the Let's Play. And I kind of watched you play and stuff. And like the things you were doing, I'm like, well, this looks super cool. Like I want to get to that point. And you seemed way more invested in the story than I was at the point uh when I was playing. And then we did the the Gamescast exclusive. And we recorded all the stuff really out of order because of embargo. So it gets complicated. Um, but I was really down on it. I was like, you know, I don't think I like this game. Like I like a lot of things about it, but it just it does not speak to me um in the way that I like to play games and the amount of time I want to put into something and what I get out of it. Then I was like, you know what, **** this. Everything Greg's saying in this Let's Play is convincing me that there is the story. There is",
            "start": 823.92
        },
        {
            "text": "of time I want to put into something and what I get out of it. Then I was like, you know what, **** this. Everything Greg's saying in this Let's Play is convincing me that there is the story. There is the gameplay there that I do enjoy. I just need to not focus on all the stuff I don't like. So then I just started playing it like Uncharted. And I was like, I'm just going to do the main missions. And then everything changed. And I **** love this game because it can play like a AAA linear experience if you want it to. And that's not even to say I don't enjoy the side quests when I do them. I just feel like they take away from what I'm I'm trying to get from this game. And I can imagine they they're great world building for the people that are looking for that. But it immediately changed. So I'm like, holy ****, this game's great. The story elements, the pacing, the pacing of just playing the main quest is fantastic, right? So I'm like, kudos to them for for keeping that level of quality and polish. I",
            "start": 863.6
        },
        {
            "text": "holy ****, this game's great. The story elements, the pacing, the pacing of just playing the main quest is fantastic, right? So I'm like, kudos to them for for keeping that level of quality and polish. I think if there's one thing I could say about this game is that it's polished 100%. Like it is very, very, very technically impressive. Um, and just it's fun. It's fun to play. That's that's huge. I I didn't think there'd be as much of a focus on melee if you wanted there to be, which I do. I like play that way. And it's especially since I'm not um super leveled up, 'cause I don't grind at all. Um, facing some of the the the more boss fighty uh like monsters is challenging in a way that I'm like, this is what I like. I like this. It reminds me more of we talked how I wanted the more Zelda style experience for an open world game. And I started getting that. I'm just like, man, like the fact that I play this game so differently than than you guys played it and still have such a great time is a testament to its",
            "start": 901.44
        },
        {
            "text": "an open world game. And I started getting that. I'm just like, man, like the fact that I play this game so differently than than you guys played it and still have such a great time is a testament to its quality. And and I haven't beat it yet. That's why I wasn't on the review. Um, but I'm I want to say I'm probably over halfway at this point. And I'm just going to keep going through. And then Zelda comes. So that's going to be a whole thing. But like, I'm having such a great time. I'm definitely going to beat this game. And it's it's it's going to be up there for me for Game of the Year. Oh yeah. I think I mean, granted, we're in February, but I think you can easily see. I mean, like, I think we're going to have some stellar games this year. And I think there's going to be stiff competition by the time we get to December. But I mean, right now, far and away, I think this game does so much, so much, so well. It's so special. Yeah. And so yeah, to the topic we're jumping into here is like if you've been follow me on",
            "start": 948.24
        },
        {
            "text": "to December but I mean right now Far and Away I think this game does so much so much so well it's so special yeah and so yeah to the topic we're jumping into here is like if you've been follow me on social media or anything like that uh I've fallen in love with photo mode in this game and photo mode not new to video games but not something I've ever really **** around with I mean I've seen it you know in the uh Naughty Dog games and like oh that's cool and I think you know in Uncharted 4 I took a few snaps of like Elena and some perspectives that I thought were cool and I was like all right cool yeah shut up not like that you pervert and I enjoyed that and I remember when uh Batman added it for Arkham Knight or whatever and I was doing DLC stuff I was taking Batmobile Beauty shots but it's always been like I don't get the point of this and I don't know if it's uh the you know meeting here the intersection of my own you know like not love of Photography it's not like I have a great",
            "start": 984.2
        },
        {
            "text": "it's always been like I don't get the point of this and I don't know if it's uh the you know meeting here the intersection of my own you know like not love of Photography it's not like I have a great camera or something like that but I like Instagram and I like making social media and framing things for specific things and trying to tell a visual story and the fact that the game has so much going on in that the photo mode's so easy and so great that when we jumped in uh when I went down to LA and played that preview event like in the preview I talk about the fact that I I was playing the game on the back of you know just one of the Striders going through a thing and I stopped it you know went through put this white border on it because I'm like I'm going to have a style which is not something I ever say when I'm taking photos I'm like I'm going have a style for this game for this photo mode that I think I'm going to get invested in where I put a white border on everything and ****",
            "start": 1020.92
        },
        {
            "text": "I ever say when I'm taking photos I'm like I'm going have a style for this game for this photo mode that I think I'm going to get invested in where I put a white border on everything and **** around with it and so I brought some of the shots I've done or whatever here I'm putting up like 30 some I think I hit 50 hours last night uh I'm I quote unquote have Platinumed it uh there's one corrupted area I need to clear and once that's done the Platinum is mine but since I've played on so many systems I don't want and the trophies aren't live yet I don't want to do it and pop the last Trophy and then hope that when I sync everything the game's smart enough to be like oh you you earned a Platinum I'm leaving one trophy to pop to get the Platinum uh 50 hours in I have something like 39 now 40 photos I cut some of them out of here because they were spoilery stuff that I'll show later and stuff but I don't know how we want to talk about it or whatever I mean photo modes in general I mean we've",
            "start": 1063.16
        },
        {
            "text": "I cut some of them out of here because they were spoilery stuff that I'll show later and stuff but I don't know how we want to talk about it or whatever I mean photo modes in general I mean we've been sitting on this one here of this black and white Aloy this is in the middle of a battle I hit pause jumped into photo mode was able to swing around put a the depth of field on it so she's in focus nothing else is in terms of it what I think is cool is you've been posting them on on Instagram like I don't know what your schedule is but I've seen a whole bunch of them right yeah oh yeah I'm putting up way more on Instagram than I do on a normal thing Instagram I usually put up like maybe one it's cool though because I'm seeing a lot of engagement with it and like you're getting like over a thousand likes on each of these which I think is surprising cuz like you'd imagine if you put the same thing over and over it kind of degrades but no people seem really into this because this game again",
            "start": 1096.32
        },
        {
            "text": "likes on each of these which I think is surprising cuz like you'd imagine if you put the same thing over and over it kind of degrades but no people seem really into this because this game again every single way you look every area you're in it's like this is stunning yeah and like the the pictures do a really good job of being like holy **** this is a video game you can play this this is you playing it Tak ex and I want to make sure we're you know keeping this going for audio listeners the first one we're showing is this black and white one depth of field Aloy with a fire arrow drawn back this next one is s coming down this this uh slide or getting out of an area wearing one of the costumes that I think are ridiculous and stupid looking in this game I wish I could make her look cooler and I have this diaper on her head cuz I don't want her taking damage diaper the Tommy Pickles look what was interesting though is like I've you know Colin and I talked about this in the review and the",
            "start": 1130.92
        },
        {
            "text": "and I have this diaper on her head cuz I don't want her taking damage diaper the Tommy Pickles look what was interesting though is like I've you know Colin and I talked about this in the review and the fact that we've been for the most part blackout on this game cool we've seen it E3 we've given it game of the show at two E3s in a row we're in looks great I don't want it ruined for me and the number of people who on this specific photo of Aloy sliding down this rail here pointed out the fact that Guerrilla took feedback I guess from previous demos and added in that little thing she's holding cuz I guess in previous things it was just her grabbing the the pole with their hands and people complained enough about that or enough people were like that looks weird that Guerrilla for the final game went and changed that and put something in there to show like what you're talking about like the TLC they're putting into this game uh another one here this is me playing with light like what's cool",
            "start": 1166.64
        },
        {
            "text": "went and changed that and put something in there to show like what you're talking about like the TLC they're putting into this game uh another one here this is me playing with light like what's cool about it and I'm not again a photo mode expert on other games by any mean I think it's cool to be able to jump into the game when you use Photo mode and then this battle is happening uh where I'm fighting all these different dudes here I think these are what uh the the ones who spit the Rocks I forget their names the they're tearing it up spitting out the rocks um I'm fighting them at like noon but when you jump in Corruptor thank you wait what Corruptors no no Corruptors are corrupting other guys this is they pick up the rocks and throw them too okay fine whatever uh this is happening at noon I went through you can change time of day so I made it night and I put stars in the back like I the moon moves the sun moves you see the world swing around so you can get the lighting just how you want",
            "start": 1202.48
        },
        {
            "text": "went through you can change time of day so I made it night and I put stars in the back like I the moon moves the sun moves you see the world swing around so you can get the lighting just how you want it wherever shaded her uh one of the perspectives here you which is one of the landscapes of how beautiful this game is this is another one too where in reality Aloy is standing at the very front there but you can turn her off to hide her to get to right to what you're doing in the game um a dead body to show we all return to dust at one point Tim everyone's going to die at some point another perspective it's one of those like I think for me it's lazy but a lot of them are panoramics like this or you know landscape shots with her but it's just like for me I like this style of photo especially when she's silhouetted by the Sun or whatever lens flare there like all these different things showing the scale of it too I mean it's just like that's the thing is like getting those E3 shots like",
            "start": 1240.6
        },
        {
            "text": "when she's silhouetted by the Sun or whatever lens flare there like all these different things showing the scale of it too I mean it's just like that's the thing is like getting those E3 shots like yeah they the camera work in this game is great like just holding the right stick and just holding it left or right the way the camera swoops is like man it's so cinematic like even in just standing here this feels like an epic adventure yeah 100% and then uh this is me in a town like you know there was a part in this story where these people were giving a presentation or like giving a little not jokes but they were performing of something or other and I stopped and took the photo and it for me struck a chord from when I used to be at the newspaper and I'd go out on these dumb assignments or whatever with a photographer and they would sit there and try to capture like candids of what's actually happening in the event so what's happening in this town I thought that was interesting that",
            "start": 1278.16
        },
        {
            "text": "or whatever with a photographer and they would sit there and try to capture like candids of what's actually happening in the event so what's happening in this town I thought that was interesting that there's that much life in the world that she's running around doing that uh this is one of my favorite ones I just took it last night uh black and white filter on obviously what's happening here is this was her idle animation I had left it while I was screwing with something and I paused I saw it was happening a pause it you it looks weird right here I've brought the camera up and she's looking up at a snowflake falling it's actually the white dot that looks to be part of her headband she's looking at that snowflake I'm able to tilt it up look down at her I might have used up the feeling third album cover it's like when she started getting really experimental with her music she stopped the the genre that everyone loves and that's one of the goofy things about why I like this so much in",
            "start": 1314.2
        },
        {
            "text": "album cover it's like when she started getting really experimental with her music she stopped the the genre that everyone loves and that's one of the goofy things about why I like this so much in posting them is that you start like like this is just a beautiful shot again that I think you know I think for a lot of games you would look at these and think they were concept art or doctored in some way where this is just me pausing the game mid-fight when I drew back the arrow and I and to be fair it is doctored in the sense of **** with the depth of field and filters and all that stuff sure this one I think honestly for this one though I think all I have is a vibrant filter on like you know what I mean just a Instagram filter for the image and stuff but what you're talking about is like when I start doing these I start making the story around them which was interesting for somebody who doesn't use photo modes who doesn't do that kind of thing I never would have thought that I'd sit",
            "start": 1347.28
        },
        {
            "text": "when I start doing these I start making the story around them which was interesting for somebody who doesn't use photo modes who doesn't do that kind of thing I never would have thought that I'd sit there and be like oh like I'm documenting what's happening in this world on this journey in this town as I go in there another perspective here vibrancy messing Colin have you ever used a photo mode no not my thing yeah I I'm surprised it struck a chord with me on this one yeah it's cool I I don't judge it I mean I think but but the yeah I like looking at pictures I have no have no passion for photography in the real world so I'm certainly not going to have passion for photography in and see that's the weird thing about it like I I do here and there when we're doing stuff for goofy social media or whatever but I would never think to go out and I'm like I'm I'm to go take photos of this beautiful landscape or whatever and now granted maybe it's the technology holding you back you know what I",
            "start": 1379.84
        },
        {
            "text": "or whatever but I would never think to go out and I'm like I'm I'm to go take photos of this beautiful landscape or whatever and now granted maybe it's the technology holding you back you know what I mean like iPhone camera can only do so much to make it look great and Grant is pretty awesome now not taking away from it Timmy I'm just saying this is one of my early works I don't like this this is from my early period I like that her tongue's hanging out like she's really focused on rope walking this but I I don't like it anymore Tim I want you to know that one of the ones that fallen off this is an earlier perspective shot you know what I mean of what I was doing you saw her sliding down the other thing this is a different way of sliding down I didn't spin the camera enough this one really shows what she's feeling you it's like there's so much empty space in her at this point wow see there you go this see this is right after you got a collectible yeah exactly we got one of",
            "start": 1415.68
        },
        {
            "text": "one really shows what she's feeling you it's like there's so much empty space in her at this point wow see there you go this see this is right after you got a collectible yeah exactly we got one of my figurines uh there was a lot of cool stuff here in one of the Cauldrons that I took a off don't worry it's not a spoiler you should know Cauldrons are there a lot of reviews are talking about them already uh but going in and seeing that mashup this is another one where I took her out of it I just thought it was a cool perspective all these pipes and stuff this is her fourth album when she goes back to the genre that people loved her for hold on there I like that would be the cover for the fourth album that's the mixtape that accompanied the album this is like the street tape that get people excited oh wow I don't know a lot about releasing albums I guess I didn't know about mixtapes for the album you're putting out and stuff like that so it goes on like this these are just the",
            "start": 1447.12
        },
        {
            "text": "people excited oh wow I don't know a lot about releasing albums I guess I didn't know about mixtapes for the album you're putting out and stuff like that so it goes on like this these are just the perspective shots and stuff like that I just wanted to share with you guys and talk about like it's you know the Gamescast we always talk about is uh jumping in and talking about what we love in games and stuff and it's I think I was telling Guerrilla actually I was talking to some of their folks on DM of whatever about the fact that it's I I love the game the game's awesome but what's I feel rare when I find is finding something brand new I love in a game where photo mode's been in games before and I've tinkered with it and I've **** with it but it's never spoken to me like it spoke to me in this game where this is a game where I was like I want to document my journey through this I want to take all these different photos I and like I want to just do this of a landscape right of like",
            "start": 1479.88
        },
        {
            "text": "in this game where this is a game where I was like I want to document my journey through this I want to take all these different photos I and like I want to just do this of a landscape right of like because like the game's so cool of our world deter at and then however many years have passed you know seeing what's happened there Grant Last of Us did that too but for me it didn't speak to me in the way of like it's something about being an open world RPG where I'm out there and exploring and discovering I feel like I you know that came up so many times in our review right uh the fact that for me what works with Horizon is the Discovery aspect in making that world your own so to come in and you know this is abandoned I killed it his chair and like I after I cleared everything out and the the settlement went back to that he was still dead there so I came back and took this shot and it's like it's not to celebrate my kill it's just this weird thing of like this battle that happened where",
            "start": 1514.2
        },
        {
            "text": "settlement went back to that he was still dead there so I came back and took this shot and it's like it's not to celebrate my kill it's just this weird thing of like this battle that happened where this man's collapsed or whatever and shot in the chair and stuff like that another dead person that I **** up don't **** with me you know what I mean like but that's the thing of like it's this weird thing of people talk about chronicling their journeys in games all the time and like I remember when No Man's Sky came out right like people there was a guy who was doing it and keeping a written journal of it and I was like that's a really cool idea I'm not inspired to play the game that way but this is like my visual log of like this 50 hours I spent in this amazing place with this amazing character with this amazing story and like I don't know it's this weird thing I can't put it into words precisely but it's this weird picture book memory thing they are all so beautiful and some K you",
            "start": 1551.96
        },
        {
            "text": "with this amazing story and like I don't know it's this weird thing I can't put it into words precisely but it's this weird picture book memory thing they are all so beautiful and some K you know a lot of people on the Instagram photos popping up saying like you should get these printed you should get them framed and there's like certain ones where I'm like I actually would do that do that and put get get it put up and put it somewhere and like have it on the wall because there's so much cool **** that happens in this game that you want to see that you want to be a part of yeah the only photo mode I ever did was in Smash Bros. Melee when I would jump with Peach and then turn the camera around you're **** I mean I did that though that was a thing and then that was a photo mode they added Brawl for just that reason I swear to God I believe you we all had that there's the snapshot mode if you if you try to tell me that you're between the ages right now of 0 and 30 and that you didn't",
            "start": 1585.72
        },
        {
            "text": "Brawl for just that reason I swear to God I believe you we all had that there's the snapshot mode if you if you try to tell me that you're between the ages right now of 0 and 30 and that you didn't have that on your GameCube memory card you're **** liar and that those photos took up way more space than they should have yeah we had to reorganize that **** back in our day yeah you you lived a hard life you get to live you can have unlimited Horizon pictures now pretty great God those GameCube you remember those GameCube cards Colin yeah those were some tiny little **** they were I remember them very well God remember GameCube very fondly yeah so this has been my journey thank you for let me talk about how great is oh this looks cool yeah right another artsy one yeah I know right lot lots of death and devastation in there and of course like in this world it's Aloy like crouching on a bed or whatever so I can get the thing and I get rid of her but in this real world she just",
            "start": 1616.44
        },
        {
            "text": "lot lots of death and devastation in there and of course like in this world it's Aloy like crouching on a bed or whatever so I can get the thing and I get rid of her but in this real world she just crouched behind this poor woman with her dead family oh my God what's up there no I was gonna say hey there but I said what's up there that was weird anyways you know you just watched some awesome piece of content over here on Kinda Funny Games and when I say awesome I mean it was probably okay so you can click right here to subscribe to get way more okay content or you can click here to get you know more content from Kinda Funny our other channel that's just as okay as this one if not a little bit worse cuz you know we're pretty game centric I want to get that one better though like this one's beating it now on you know subscribers and like that's kind of sad to me so help people like me not be sad",
            "start": 1658.72
        }
    ]
}