{
    "id": 2365,
    "video_id": "ao_IEa9QYvg",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Nick Scarpino",
        "Kevin Coello",
        "Colin Moriarty"
    ],
    "title": "Sony Sales and GameStop Troubles - Kinda Funny Morning Show 02.02.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1486072793,
    "duration": 5757,
    "transcript_chunks": [
        {
            "text": "greetings and salutations welcome to Colin and Greg Live right here on Twitch.tv/KindaFunnyGames. My name is Colin Moriarty, this is Greg Miller, Kevin Coello, I'm sorry, Nick Scarpino. Kevin Coello is off the screen over there, uh, over-grouper, over-grouping purveyor of Kevin Coello. Yeah, went too far again. No, it's not too far. Went too far. It's not too far when it's accurate, that's the thing. Not accurate. It's not stereotypes, Kevin, are only stereotypes unless they're really, really accurate to everyone involved. And we all know that you are the over-grouper and purveyor of of of Kinda Funny, of of of me. It's just German, Kevin, we're not speaking anything else. It's just German. That's how you say it in German. I'm cutting your mic. I love how off that shot is too. I know it's like a lot of a lot of space over here. Is this the Millennium Tower? That no, that's not it. Did you guys read about Millennium Tower again recently? What's happening now? Uh, that it's getting worse and that people are saying that there's like some conject",
            "start": 1.34
        },
        {
            "text": "Millennium Tower that no, that's not it. Did you guys read about Millennium Tower again recently? What's happening now? Uh, that it's getting worse and that people are saying that there's like some conject. First of all, no one can sell their building, their things in there because they're worth nothing. Yeah, then uh, it might fall over. People don't know the Millennium Tower is this massive building that was built in 2007, 2008 in San Francisco before all these buildings started going up. So it was one of the first new prominent buildings near the Bay. Now it's dwarfed by two buildings around. Yeah, because Salesforce is putting up there anyway. Uh, this building, uh, certain like Joe Montana lives in there, other people like famous people live in there. Um, the building is sinking and starting to tilt. Yeah, because for people I don't know, San Francisco was even San Francisco 7 miles by 7 miles and it was even smaller than that. What ended up happening in the in the mid to late 19th century is that people started basically",
            "start": 56.72
        },
        {
            "text": "I don't know, San Francisco was even San Francisco 7 miles by 7 miles and it was even smaller than that. What ended up happening in the in the mid to late 19th century is that people started basically putting sand and rocks and debris around the edges, especially in the bay to make to extend it out. So the Marina and Cow Hollow and parts like that are not even really naturally part of San Francisco, which is why they were destroyed in the earthquake in 1906 land. So this building is apparently on sand, on some sort of wet sand. So first of all, water is already leaking in to the basement. They showed in the garages and they showed all of this footage of this. It's getting fucked up, not good. And and the building starting to sink and tilt. It sunk like 19 inches or something like that. Is the news done? Yes. And uh, and so anyway, I was reading about it and they were saying like this building might not real like it's not like a problem like where it's to like this building is maybe going to collapse or",
            "start": 94.12
        },
        {
            "text": "yes and uh, and so anyway, I was reading about it and they were saying like this building might not real like it's not like a problem like where it's to like this building is maybe going to collapse or fall at some would be terrible if there's an earthquake. We're talking about a big building too. This is not this is not like a three-story apartment complex like live in. This is like a 50-story skyscraper highrise. Oh, it's bigger than 50 stories and it's huge like 54 stories. Is it really? Jesus Christ. But I mean if that thing goes, it's taking the next building over with it, you know what I mean? So what's funny about it, Nick, that you might find interesting and Kevin, I think we talked about this in the past, was that they're blaming it. They don't know what the problem is. They're blaming it on the sediment and and the builders are saying like it's not our fault. And then they're like, well, there are two things going on around it. They're building this massive train terminal right next to it, excavating",
            "start": 131.36
        },
        {
            "text": "and and the builders are saying like it's not our fault. And then they're like, well, there are two things going on around it. They're building this massive train terminal right next to it, excavating the ground. And then they're building Salesforce skyscraper, which is going to be the biggest building in San Francisco. And they're some people are saying like they're actually fucking this building up because last I heard, um, that that's a lie that it's not that the new buildings are causing any issues. It's that when it was originally constructed, corners were cut, poor decisions were made. That's I mean, this is fascinating. This is going to be a fascinating story to tell because who who knows who knows, right? We'll see. I mean, clear Engineers. But if you're the contractor, right? If you're the person responsible for like the building like or the insurance company, right? You're going to want to put that blame out on every single person possible, right? So obviously the contractor is like, it's not our fault.",
            "start": 171.0
        },
        {
            "text": "for like the building like or the insurance company, right? You're going to want to put that blame out on every single person possible, right? So obviously the contractor is like, it's not our fault. It's the other building's fault. And the insurance company's probably like, it's the contractor's fault. I think it's the city saying that. Oh, it's the city saying that. Yeah, cuz what's happening now is you know that like giant Garden thing they're building right next to Salesforce, sure, where it's it's going to be a Muni. I haven't seen it from like a sky. I I just seen it. It's going to be a Muni station. Looks really cool, cool. Um, the city is subsidizing like $7 million for that. And they suddenly were like, no, not anymore. Not until this gets cleared by that building. That's tremendously dangerous though, right? Like yeah, that's why they're not paying for it. That's that's that's bad. They're stopping payment for. You hear this all the time, by the way, because my wife has a lot of uh, she deals with a lot of rich",
            "start": 210.12
        },
        {
            "text": "like yeah, that's why they're not paying for it. That's that's that's bad. They're stopping payment for. You hear this all the time, by the way, because my wife has a lot of uh, she deals with a lot of rich clients who buy new apartments in these places, these brand new buildings. And at first they seem amazing. You don't know, you buy them. And then lo and behold, there's all there's there this is not the first time this is has happened where someone's cut corners and like roofs are leaking or buildings are tipping and things like that. It's fucking despicable. But especially given how much you probably paid to live in this in this Tower, right? I mean, this is not like they were saying that that the buildings like it's like $3,000 a square foot to buy something there. Christ. Or was was $3,000 a square foot? Um, I'm trying to find because the the not that this has anything to do with our news at all, but it's it's an interesting. I'm going to put it in the in the uh chat or in the uh pad there, Kevin, I'll",
            "start": 246.4
        },
        {
            "text": "um, I'm trying to find because the the not that this has anything to do with our news at all, but it's it's an interesting. I'm going to put it in the in the uh chat or in the uh pad there, Kevin. I'll put it at the very top for you just because the pictures are really amazing that they have like there's some fucked up shit going on in this building and it's not that old. It's not even a decade old. So I I put it in there for you. Also, FYI, everyone that works front desk, really mean. Oh yeah, total dick. Every they all hate Kevin now. Does that make me hate them or like them more? Any given day, you know what I mean? Any given day. So could be one or the other. Kevin, open that story and then scroll down. People should read this, by the way. It's a really fascinating article, super long. Uh, scroll, keep going. Go, go, go, go, go. Put this. Can you put the link in the chat? Wait, stop. Go up. So this is like one of the garages that they're like trying to fix the waters. Go up one more picture too. They show sorry, I'm",
            "start": 283.92
        },
        {
            "text": "go, go, go, go, go. Put this. Can you put the link in the chat? Wait, stop. Go up. So this is like one of the garages that they're like trying to fix the waters. Go up one more picture too. They show sorry, I'm putting the link. Oh, it's okay. Like so like this is like a closeup of what's going on. God, that's terrible. And then keep going, keep going down. And then go down more, more, more. So this is oh, so they put these things on the build that are like basically tracking like how much they like how much they no, they're like, I think they're tracking like how much they're spreading apart from each other. Like there's if you keep going, there's uh yeah, like like this is just in one of the floors like just water coming in from the ground. Bad cuz that's just going to put that's fucking stunning. I'd still live. Yeah, but look at these places, gorgeous. Oh, I've been I've been in the tower. I've seen it. It's gorgeous. They're gorgeous. But like like who wouldn't want to live there? It's just sad that they fucked up the",
            "start": 325.0
        },
        {
            "text": "yeah, but look at these places, gorgeous. Oh, I've been I've been in the tower. I've seen it. It's gorgeous. They're gorgeous. But like like who wouldn't want to live there? It's just sad that they fucked up the construction of it. It's one of those things where like it's it's a double-edged sword. You get in when you can get in when the prices are whatever they are. And then you just don't know. You just don't know. Anyway, totally unrelated anything we do, but we don't really do anything on the show anyway, really. Uh, go read it. It's an interesting story. I read it on uh, I don't know when I read. I read it yesterday on the train or something like that. So do you think they fixed this building and now is the perfect time to buy as much? That's some people are saying. I don't think they have a choice. They have to fix it, right? It's either they fix it or the building collapses. So I think now would be a great time to buy in that building. I would totally do it. But I mean, they have to. I mean, knowing fully well that",
            "start": 364.92
        },
        {
            "text": "it, right? It's either they fix it or the building collapses. So I think now would be a great time to buy in that building. I would totally do it. But I mean, they have to. I mean, knowing fully well that you're getting it at a depressed at a depressed rate for a reason. And it's a huge risk. But like what's the what's what's the downside? It collapses and everyone dies inside of it. Yeah, in like a a cataclysmic event that's similar like 9/11. You buy it and rent it out and then put insurance. And then when it goes down, you get the insurance money and you hope those people weren't there. You you yeah, you pray they don't see you in the building like family. No, they can't see you. You just you just you know what you do is you rent to people who don't have families. You specifically rent to like orphans who just are transients that want to live here. And like maybe they're Tech guys like Dexter and they can just like, you know, they kill people on the side or whatever. It doesn't matter. But you rent to them.",
            "start": 395.52
        },
        {
            "text": "just are transients that want to live here and like maybe they're Tech guys like Dexter and they can just like, you know, they kill people on the side or whatever. It doesn't matter. But you rent to them. That way if they die, no one's around to see you. I like this plan. Let's talk about this offline. The uh, so the interesting kind of end note to this is that and this is the scary part is that they were saying the insurance across all the like the building and then and all that kind of stuff is spread out over multiple insurance companies. So, and that they that the companies, there's no way in hell the companies are going to pay this without sue without, you know, having to be sued. So they were saying like there's no real solution to this. And that the building they expect. So they were saying a building a unit was sold in there recently at like a fire sale. And the guy was basically convinced that they are going to fix the problem. They they say it's going to cost many tens of millions dollars",
            "start": 432.24
        },
        {
            "text": "a unit was sold in there recently at like a fire sale. And the guy was basically convinced that they are going to fix the problem. They they say it's going to cost many tens of millions dollars to get under there and like prop the building up and do all these kinds of things. And and then if there's an earthquake before then, that it could be very bad news for that building. So anyway, I thought it was an interesting kind of kind of story. You guys can check out. Has nothing to do with anything. Uh, more apropos. Yeah, uh, the Nioh, uh, Nioh. Some people are confused uh about that. The embargo's up. I played it for about five hours. Uh, first of all, it's getting great reviews. Um, I think it's a really fun game. I'm not very good at it. Uh, but it's a fun game. Uh, picture it's it's got an Onimusha vibe in terms of its environments, in terms of but it's not really as we knew, not really an Onimusha game. It's Ninja Gaiden meets, which is not a huge surprise since Team Ninja made this game. Ninja Gaiden meets Dark",
            "start": 466.48
        },
        {
            "text": "of its environments in terms of but it's not really as we knew, not really an Onimusha game. It's Ninja Gaiden meets, which is not a huge surprise since Team Ninja made this game. Ninja Gaiden meets Dark Souls. It is a way quicker Dark Souls. And I really, really enjoy that. Dark Souls is so plotting and slow and frankly not very fun for me. Uh, I liked Bloodborne because it got a little quicker and a little more arcadey. This game is very arcadey. Um, and so I think you guys if you if you understand what you're expecting there and what not, I think you're going to like it. I'm really looking forward to dumping some more time into it uh tonight, tomorrow, this weekend, etc. So I wanted to give everyone a heads up on that. An opposite heads up is that but I also downloaded Double Dragon 4 a few days ago. Uh, it's only $7. Uh, Arc System Works put it out. Uh, it's terrible, terrible, absolutely terrible. Now I can't stop playing it because it's Double Dragon, but it's just so fucking bad. I think I gave it a three and a",
            "start": 503.84
        },
        {
            "text": "it's only $7. Uh, Arc System Works put it out. Uh, it's terrible, terrible, absolutely terrible. Now I can't stop playing it because it's Double Dragon, but it's just so fucking bad. I think I gave it a three and a half. I'm like, it's so so bad about it. It's people were like, well, it's an old game. Double Dragon was never that good to begin with. And I'm like, no, you're wrong. Double Dragon was awesome. This game just doesn't feel right. It doesn't have any design aesthetic. It doesn't it doesn't the different characters are weird. The the the hitboxes are strange. There seem to be no rules about how you get damage there. It's like it's it's not the combat that necessarily broken. It's just not very fun. So just keep that in mind in case you're going to download that. Although you might like it. I don't know. Kevin, did you say see? Let's see. Uh, should we get into the news? Wait, before we do that. Okay, two announce two things. One, obviously something to say, welcome to the Kinda Funny Morning Show. We post this on YouTube after",
            "start": 540.44
        },
        {
            "text": "you say see? Let's see. Uh, should we get into the news? Wait, before we do that. Okay, two announce two things. One, obviously something to say, welcome to the Kinda Funny Morning Show. We post this on YouTube after this. If you can't watch it live, please go watch it on YouTube. KindaFunny.com or excuse YouTube.com/KindaFunny. Also, we are on iTunes, SoundCloud, podcast services everywhere. So if you like if you'd rather hear us instead of see our beautiful faces, you can do that. Please go subscribe over there uh on the podcast service of your choice. Um, Kevin, more importantly, I'm confused. This is is this not Colin and Greg Live? This is not Colin and Greg Live. We don't call it that anymore. It's called the Kinda Funny Morning Show. Colin likes to be I guess the term I would use is obtuse, maybe be I don't know. Uh, he likes to go against the what's what's the term when you go against the system? A hipster? No, I would say anti-establishment. Yeah, anti-establishment. He's very anti-establishment. Um, hipster is",
            "start": 591.92
        },
        {
            "text": "know uh, he likes to go against the what's what's the term when you go against the system? A hipster? No, I would say anti-establishment. Yeah, anti-establishment. He's very anti-establishment. Um, hipster is really more of a style. Yeah, Hipster, you're not against anything really. You don't stand for anything when I don't stand for literally anything. You just wear really skinny jeans and cool boots that I that I envy. Uh, Kevin, the more important thing I was going to ask you is yesterday we had a crisis. Okay, we ended the show and I said to both of you, where are we getting lunch? And both of you said, I can't get lunch today. And I was I didn't know what to do with myself. So my question for you, Colin, you probably can't with Kevin. I'm in. All right, cool, cool. Where do you want to go? Los Matates? I mean, you know, maybe Built Burger, what? Built Burger, Built, Built. Yeah, we haven't been there in a while. I want all that over. My first instinct was Los Matates. All right, Los Matates. I'm in Los Matates. I didn't",
            "start": 634.48
        },
        {
            "text": "know maybe Built Burger, what? Built Burger, Built, Built. Yeah, we haven't been there in a while. I want all that over. My first instinct was Los Matates. All right, Los Matates. I'm in Los Matates. I didn't know you were in. That was my that was what I was thinking. Love Los Matates. You know how I feel about that place. I how can you say there's no food when we've got Los Matates? Los Matates is in Soma. Yeah, but that's a 5 minute drive. We in the car 5 minutes from then we're there. Is parking hard? Sure. It's usually not as hard as we made it the other day though. We made it hard. You could park right in the Planet Fitness thing. They're going to get away with murder that in that place. You what saying? I I I never fuck around with that. I fucking tell you. Yeah, they know people like's store there too. That's true. We should go buy some bows. I like knocking an arrow every once in a while. Me too. They got rentals. You want to go shoot some arrows today? When I was in high school, we had archery class, which",
            "start": 677.28
        },
        {
            "text": "true we should go buy some bows. I like knocking an arrow every once in a while. Me too. They got rentals. You want to go shoot some arrows today? When I was in high school, we had archery class, which is funny. I can't imagine that that exists anymore. Like I I'm surprised. And and people used to just take the and shoot them into the ceiling in the gym. And you know how the gym ceiling is like 100 feet high. And so for years there's just arrows sticking out of things up there. Occasionally fall down, I assume. So awesome. I love that. I used think it was so funny. I love I loved archery. Archery, dangerous sport, but fun, but fun. Do you think people enjoy? I was I often wonder this about our content, right? Because let's be perfectly honest, we we make fairly mediocre to shitty content most of the time. A lot except for Colin Was Right, which is awesome. You put a lot of thought and effort in that still, which we don't do in most of our other podcast content. I often wonder why people watch this particular show like",
            "start": 721.56
        },
        {
            "text": "for Colin Was Right, which is awesome. You put a lot of thought and effort in that still, which we don't do in most of our other podcast content. I often wonder why people watch this particular show like we do give you the news, which is cool. You get some perspectives. But for the most part, it's just us talking about complete non sequiturs and where we're going to have lunch for a good 45 minutes. Then we talk 5 minutes. Then we try to get through the news as quickly possible, running out of time. And then we give Kevin shit for like another 15 minutes. Arbitrary time limit. Yeah, no, I I I agree. I it's comforting for people. I don't know when I came up with the idea for the Colin and Greg Live, the original show. I didn't know what it was going to be, but I didn't know it was going to be this, right? Right. You were just like, it's not well, some GameOverGreggy Show, right? Like when I came up with the format for GameOverGreggy Show, I didn't realize that that was going to be so popular with people and that",
            "start": 767.96
        },
        {
            "text": "were just like, it's not well, some GameOverGreggy Show, right? Like when I came up with the format for GameOverGreggy Show, I didn't realize that that was going to be so popular with people and that it was going to allow us to, you know, it feeds very well into our Patreon technique. We used it with the Gamescast, all that kind of stuff. So there's some good ideas out there that Colin came up with. But this show might be the biggest Albatross we've ever come up with, self-inflicted wound we've ever indeed forced ourselves now going on three years doing. Uh, but uh, it's working. People are liking it. People are liking the fact that we're posting it to YouTube. We were just talking about that before. We're getting a lot of the international audience watching this at work, wasting their time at work as well. This is mostly for those Europeans out there. Yeah, mostly Olá. That's what they say in uh, that's what they say in England, right? They do say something like that. You have a new didn't they get you a new",
            "start": 805.64
        },
        {
            "text": "this is mostly for those Europeans out there. Yeah, mostly Olá. That's what they say in uh, that's what they say in England, right? They do say something like that. You have a new didn't they get you a new cup? We got you a new cup. It's on your desk. And I quote, I hate this cup, but it's the only one here. So we got you a new one. I figure out what the problem is. Fan got of a new one. Nick, whatever. Who cares who got it? I'll take credit for it. Kevin, that's what I do in this organization. I feel like the problem is that there's multiple problems with the water bottle. The the big problem is that water goes on the on the lip here. So when you when you drink it, it drips that aren't even coming out of the the spout drip onto yourself. So you need a little rag to down. I guess so. But what I'm saying is like, how did this get get through? Did did someone make make the mold of this and never try it? Oh, probably not. Probably also is that one of those BPA-free like things? Are you just getting poison? BPA-free. Yeah, why?",
            "start": 841.48
        },
        {
            "text": "this get get through? Did did someone make make the mold of this and never try it? Oh, probably not. Probably also is that one of those BPA-free like things? Are you just getting poison? BPA-free. Yeah, why does it spill when you drink it out of the cap? Because the see that's the other thing is that the the lip like it doesn't need to be this wide. I'm not a Big Mouth Bass. You understand what I'm saying? Like I don't need you don't know that for sure. I'm more of a with a small mouth. What are you doing? I'm resetting the shot since you guys don't like it. Well, it's not that we don't like it. It's just good that you get 16 minutes for for you to to get the energy to do that one, Kevin. That was only said at the top of the show. But God, it's 1:16. What happened was he was like Los Matates. And then he was like, I'm going to it just takes so much effort. Take my feet off the desk, you know what I mean? When I'm Kevin, it's just too hard to take my feet off the desk. Well, Kevin's a Kevin's a creature of habit.",
            "start": 883.84
        },
        {
            "text": "like I'm going to it just takes so much effort. Take my feet off the desk, you know what I mean? When I'm Kevin, it's just too hard to take my feet off the desk. Well, Kevin's a Kevin's a creature of habit. You're still on center, but like that's on purpose for aesthetics reasons. Look, we're also pretty close together. I mean, farther apart rather. We can be a little closer together than we would be centered. I like being far cuz I like see you're out of focus. Holy shit. Wait, wait, sit back, sit back. That's I'm in focus here. Yeah, you're in focus there. But should I just do the show like this so? I mean, you're exaggerating it if you just lean back like you were literally 30 seconds ago. Yes, yes. All right, let's get into the news. Let's go. Let's go talk some news. I want to talk news. I'm excited about this. Oh, and props to everyone that burned Berkeley to the ground last night. That was really productive. All right, uh, is that what happened last night? I didn't read about that. More protests. Yeah, really violent.",
            "start": 926.08
        },
        {
            "text": "and props to everyone that burned Berkeley to the ground last night. That was really productive. All right, uh, is that what happened last night? I didn't read about that. More protests. Yeah, really violent. Really? Yeah, Jesus. Remember when Berkeley used to march about free speech and protect free speech when they and then they became exactly what they hated? Those were those were the watching that happen before our very eyes is was fun. Jesus. If these people are so if these people are so righteous, why do they cover their faces, by the way? Why are they so scared? You let everyone see. I mean, you're you're you're you're fighting the powers that be for for the freedom of all, right? So show your faces. Oh no, you're a coward. So you won't do that. Damn. Um, okay, this is a big one, Kevin. This first story. Timothy J. Pfohl. Okay, and Brian kente WR Kon WR. Oculus lawsuit ends with half billion dollar judgment awarded to ZeniMax. ZeniMax, of course, is the parent company of Bethesda. Uh, says a Dallas, Texas jury today awarded half",
            "start": 972.4
        },
        {
            "text": "okay and Brian Kent, VR, Kon VR Oculus lawsuit ends with half billion dollar judgment awarded to ZeniMax. ZeniMax, of course, is the parent company of Bethesda. Uh, says a Dallas, Texas jury today awarded half a billion dollars to ZeniMax after finding that Oculus co-founder Palmer Luckey and by extension Oculus failed to comply with a non-disclosure agreement he signed. In awarding ZeniMax $500 million, the jury also said that Oculus did not misappropriate trade secrets as contended by ZeniMax. Um, so basic, I'm not going to read the whole story. Basically, what happened here, and I don't know if you're with the Nick, um, so what basically, hold on, let's see if it's in here in more. No, okay, is it no? All right, so John Carmack is one of the co-founders of id along with Romero, right? Yeah. Uh, Carmack was at id for a very long time, even after Bethesda acquired id. At id, uh, Carmack was working on VR stuff, some proprietary VR stuff. For people that don't know, Carmack is like super insane about technology. That's why Wolfenstein",
            "start": 1020.68
        },
        {
            "text": "even after Bethesda acquired id. At id, uh, Carmack was working on VR stuff, some proprietary VR stuff. For people that don't know, Carmack is like super insane about technology. That's why Wolfenstein and Doom are these very advanced games. He's obsessed with 60 frames a second, obsessed with the fidelity of games. Romero was more like the creative guy. So, and they have not worked together for many years. Uh, Carmack, uh, then left and went to Facebook and Oculus hired him or whatever to work on things. And the argument with ZeniMax is that he basically just did all, took stuff that he did at ZeniMax and then just brought it over, and that stuff is in Oculus. Okay. Um, so ZeniMax sued Facebook and for billions of dollars and got a fraction of what they asked for, but still a big haul of money. Um, that's basically boiling it down. It is a way more complicated case than that. Um, and so you guys can go read about it. I don't want to get too, too into it. That's crazy. Uh, but, uh, that's a big piece of news, and I was",
            "start": 1064.96
        },
        {
            "text": "boiling it down. It is a way more complicated case than that. Um, and so you guys can go read about it. I don't want to get too, too into it. That's crazy. Uh, but, uh, that's a big piece of news, and I was thinking about doing, uh, Colin Was Right about it, but I can't do another complicated Colin Was Right. Yeah, why don't just, why don't you not's, let's chill for like a 5-minute episode? I mean, you, you don't, you can plan it for like three weeks from now, do slow research, maybe record two in one day. See, the, the, the thing was is that it was good, man. I really enjoyed this last Colin Was Right. Good job. Thank you. Appreciate that. I, uh, well, it's doing great, but, uh, the problem with it was the editing was fine. It took like, I would say, 10 hours to edit. Yeah, it was the writing that was hard, and the research that was hard. In terms, I, I have so many **** email chains going for this one. It reminded me of back when I was at IGN. So the most complicated project I've probably ever done outside of the history of pieces that",
            "start": 1106.48
        },
        {
            "text": "in terms, I, I have so many **** email chains going for this one. It reminded me of back when I was at IGN. So the most complicated project I've probably ever done outside of the history of pieces that I wrote. So I hope, go, go check it out and support it, please. And if you want more of them like that, then please share this one, get the views up, show me that you want to see more like that, and I'll do more like this. If this one doesn't do that well, then I'm never going to do this again. Um, because the, the, uh, Same Old Nintendo is less than half the length, took me a fraction of time, and is like 160,000 views. So I know your audience, people are thirsty on Nintendo news. Everybody wants to know what's going on with the Switch and Nintendo. Do you think Timothy Punon would want? I think Timothy Punon can have whatever Timothy Punon wants with a name like that. Get into it nature, which you saying the name? I, we're not saying it. That's, that's the man's name, Kevin. There's nothing sexual about that. We",
            "start": 1149.56
        },
        {
            "text": "can have whatever Timothy Punon wants with a name like that. Get into it nature, which you saying the name? I, we're not saying it. That's, that's the man's name, Kevin. There's nothing sexual about that. We both know you're saying it a sexual way. It's short for Harpoon of the Boston, Massachusetts Harpoons. Um, by the way, two, two notes, been a long week, two notes. Yeah, give it to me. We talked about how this show, Colin & Greg Live, is available now on, on podcast services. I've seeing some people complaining that the show doesn't work as podcast, as a podcast. Yeah, I **** told you that for years. Yeah, definitely. But we, but nonetheless, no one wanted to, no one wanted to listen. I haven't seen anyone say, I've seen a lot of people tweeting at me saying, thank you for putting, people are thankful for. But there are people also, Kevin, that are saying that it doesn't work, and I'm like, but I told you that it doesn't work. Yeah, but like, those people shouldn't be **** listening to us a podcast, you know, whatever.",
            "start": 1193.2
        },
        {
            "text": "are people also, Kevin, that are saying that it doesn't work, and I'm like, but I told you that it doesn't work. Yeah, but like, those people shouldn't be **** listening to us a podcast, you know, whatever. That's why I put on YouTube. Everyone, point two, on Twitch to watch it. People want Colin Was Right on, on, on podcast services. Just don't think that's going to happen. Not ever. So, not ever. That's stupid. That's, you think that you're dumb. I mean, it's just not, I mean, it's not a super visual show. It could conceivably work. It's just that you want it, so I don't want to do it is basically, basically, you know. I think the visual components are really important. I think that, uh, I really think that like, that, that's a crucial part of it. I feel like, and people that don't understand that are just stupid. I'm not, I'm not your monkey, just gonna dance for you. You understand, Colin doesn't want to be put in the corner, and you can't put Colin in the corner. He won't do it. He's not going to dance for, he's not a monkey. He's",
            "start": 1236.92
        },
        {
            "text": "your monkey, just gonna dance for you. You understand, Colin doesn't want to be put in the corner, and you can't put Colin in the corner. He won't do it. He's not going to dance for, he's not a monkey. He's not that little monkey with the symbols from Monkey Shines. Not gonna do it unless you tell him you don't want it, then he's going to cram that down your throat, or maybe he won't. I don't know, cram something down your throat. Colin is a very complex human being, probably the most complex human being I've ever met in my entire life, if I'm being honest. Kevin, on the other hand, very simple human being. Oh, he's simple, very simple. What is this? The map analytics for Friday's Morning Show. So, America, 61%. Big audience in Alaska. What about UK? 13% of the, yeah, see, I figured the UK would be the bigger or a big percentage of it. How about Peru? Not on the list. I see Argentina on. Is that South Africa? Who's watching us in South Africa? I don't, where are you seeing South? I don't think it's South. Third from the top or",
            "start": 1282.24
        },
        {
            "text": "of it. How about Peru? Not on the list. I see Argentina on. Is that South Africa? Who's watching us in South Africa? I don't, where are you seeing South? I don't think it's South. Third from the top or third from the bottom. Oh, yeah, you're right. That's South, South Africa. That's awesome. We got a small contingent in South. I want to go to South Africa. 58 people in South Africa. Yeah, boy, meet and greet Johannesburg. Yeah, but like, surprisingly, majority United States. I thought Europe would be a little bit higher. It might if we translated it. I don't think most people in Europe even have electricity. I'm looking at the numbers here. It goes UK, Canada, Australia, then Ireland. But Ireland drops down to 1.4% already. Well, there's only like three people in Ireland still. It's Amy Gill and her parents. That's it. That's all. Dwyers, like, whatever, off spawn. He's got still going in there. Thought he was moving back. Weren't we, weren't we deporting him at a certain point? We're going to deport him soon. I, for God's sakes.",
            "start": 1324.12
        },
        {
            "text": "that's all. Dwyers, like, whatever, off spawn. He's got still going in there. Thought he was moving back. Weren't we, weren't we deporting him at a certain point? We're going to deport him soon. I, for God's sakes. He's married to an American. He can't go. Is he married to an American? I'm just teasing. I think he was. I'm just teasing. He's not going anywhere. What'd you say is awesome, huh? I said, good for him, marrying up. Better do that before they take that off the books too, Kevin. They can, they can always retroactively go fix that, you know what I mean? They do whatever they want. Trump can do whatever he wants. It's great. Got to get rid of Birthright citizenship. That's one of the things I think we got to. That's crazy. You're a crazy man for that. Why don't we, we that inter, your family is, is, is American. Some point, someone came here and they had a kid, and yeah, my family came here before Birthright citizenship was a thing. But the, that, that comes from no, what we been saying is just your family came here from another place.",
            "start": 1369.96
        },
        {
            "text": "here and they had a kid, and yeah, my family came here before Birthright citizenship was a thing. But the, that, that comes from no, what we been saying is just your family came here from another place. Yeah, chilled here for a while. Boom. Now they're Americans. Spit a couple people. My family came here chilling for a while. Someday my kids' kids will be like, what, where? We're as American as they come. We're three generations. But then Daniel O'Dwyer gets to have a children, a child that's American. Yeah, yeah, but that makes sense. Guess what? Grow with no. I can't imagine Daniel Dwyer having a child who's not Irish. You're but, okay, you're Italian. Oh, M, you've got Italian heritage. Not really. Yeah, I mean, he talks about it all the time. I've never heard it. The, what, the only thing I hear come out of Colin's mouth is that he hates mustard. He's got this ongoing war against mustard, which is why I'm on. It's Andromeda, or whatever you told me. And Roma. But the interesting thing about, about Birthright citizenship, why",
            "start": 1417.08
        },
        {
            "text": "that he hates mustard. He's got this ongoing war against mustard, which is why I'm on. It's Andromeda, or whatever you told me. And Roma. But the interesting thing about, about Birthright citizenship, why I think it needs to be spelled out more clearly or like needs to be legislated on in some respect is that it comes from the amendment that that was designed to give slaves citizenship. That's where that, that's where the whole argument derived from. But that wasn't the intention of, of, of it at all. Sure. So, is there a loose construction or strict construction argument? But when they made the First Amendment, no one is like, these sons of **** are going to burn flags, you know what I mean? Yet here we are burning our flags. I say, burn a flag all you want. That's, it's so weird that anyone would think that that should be legislated. Who cares? Doesn't mean anything. Just burn it. Well, no, it means a lot, and that's why. Well, it has deep personal meaning for some people, but it is a piece of fabric. Yeah, that you",
            "start": 1462.52
        },
        {
            "text": "should be legislated. Who cares? Doesn't mean anything. Just burn it. Well, no, it means a lot, and that's why. Well, it has deep personal meaning for some people, but it is a piece of fabric. Yeah, that you should be able to burn or wipe your ass with if you want. That's fine with me. I mean, as long as you do it for the right reasons, you are legally allowed to like burn it, right? You're not just supposed to destroy it for fun. You're supposed to destroy a flag under certain circumstances. I think it hit the ground or something like that. You're right. Once it touches the ground, laws are weird. Some burn, you know. So, here's, here's an idea. The guys that were destroying property and attacking people with their masks on yesterday, they should wrap themselves in a flag and burn it. Jesus Christ. That would, that would result in their death. So, many financials are out. This is always an interesting thing. Oh, get through it. Ah, let's get to it. Let's see. I'm tired of all this shenanigans. Let's get to some",
            "start": 1503.68
        },
        {
            "text": "that would result in their death. So, many financials are out. This is always an interesting thing. Oh, get through it. Ah, let's get to it. Let's see. I'm tired of all this shenanigans. Let's get to some real hard-hitting news. Here's the commentary you want, people. Are you ready? Are you ready? I'm ready. Okay, bring it on. Brian Ashcraft over Kotaku. Sony's video game business is doing very well. Thank you. It's an interesting thing, says PlayStation 4 just had the best three months ever. Bloomberg reports today. Sony released its financials for the quarter ending on December 31st. The gaming business did great, and here's what Sony had to say, quote, sales increased 5. % year on year, uh, and the increase was primarily due to an increase in PlayStation 4 software sales, including sales through the network, and the contribution of PlayStation VR, which was launched on October 2016, partially offset by the impact of foreign exchange rates, as well as the impact of a price reduction for PS4 hardware during the past",
            "start": 1549.16
        },
        {
            "text": "of PlayStation VR, which was launched on October 2016, partially offset by the impact of foreign exchange rates, as well as the impact of a price reduction for PS4 hardware during the past quarter. Sony sold 9.7 million PS4 consoles worldwide, which is more than the 8.4 million sold during the same period in 2015. It's also the most Sony has sold in any quarter to date. For context, during the second quarter of 2016, the PS4 sold 3.9 million worldwide. In the first quarter of 2016, it sold 3.5 million worldwide. As of January 1st this year, the console's install base hit 53.4 million. So I was seeing evidence that they were saying that the install base is something more akin to like 57 million now. Um, this console is not stopping, and, uh, I think it's pretty safe that it's going to hit 100 million and become the second best-selling PlayStation console and the second best-selling console, second best-selling console overall. I think, good question for you, PS2. Yeah, PS2 is 15. That's crazy. What's up? Does",
            "start": 1598.76
        },
        {
            "text": "the second best-selling PlayStation console and the second best-selling console, second best-selling console overall. I think, good question for you, PS2. Yeah, PS2 is 15. That's crazy. What's up? Does the Slim and the Pro like, do both their sales just count towards the normal PlayStation 4 numbers? Question. It has to, right? They all accumulate in the same bucket. Yeah, presumably. It, it depends on if they're trying to hide the numbers or not. When Vita came out, uh, we never got Vita sales after like the first time, first report, because they just started combining them with PSP sales to make them, to inflate the number. So that's why to this day, no one really knows how much Vita sold. Um, the number conjectures about 14 million. Um, as opposed to Nintendo, which no matter how badly things sell, they'll, they'll tell you the numbers, which I respect. They talk about everything. We know how, that's what's so great about Nintendo. We know how all of their games sold. Interesting. Like, if you go and look at like Zelda",
            "start": 1639.2
        },
        {
            "text": "tell you the numbers, which I respect. They talk about everything. We know how, that's what's so great about Nintendo. We know how all of their games sold. Interesting. Like, if you go and look at like Zelda sales, for instance, you can go back all the way to the NES and see how all the Zeldas have sold, um, to the, to a T. It's really, really cool. But Sony doesn't do that. Microsoft Xbox One, there's been no Xbox One number since 2014. Really? Yep. We get numbers of Xbox One because EA and other publishers occasionally let it slip. They'll say like, there's 100 million units in the wild right now, and everyone's like, okay, like 100, 100 million next-gen consoles in the wild. So everyone's like, okay, we know PS4 sold this much, and therefore just subtracted, and that's how many Xbox Ones are. That's literally how the numbers are, are, are guarded right now. Is that because they just don't want to share because they're losing this? Yeah, during Xbox 360, we got numbers every five **** seconds, if, if everyone remembers.",
            "start": 1680.88
        },
        {
            "text": "numbers are, are, are guarded right now. Is that because they just don't want to share because they're losing this? Yeah, during Xbox 360, we got numbers every five **** seconds, if, if everyone remembers, like every minute they were saying how nothing for almost three years. Interesting. Yep. Uh, so, so interesting kind of stuff there. Well, congratulations, you're winning. Not my company. I don't really care. Up 6%. I'm winning. Oh, you have Sony, Sony stock. Yeah, I didn't know that. Yeah, back, you have domestic Sony stock, or you have Sony stock in domestic Sony stock. Back when it, uh, **** went bad, when their stock dropped like **** a quarter its price, I bought a whole bunch. I bought instead of buying a PS4, I bought some stock. It since doubled. What other companies do you want stocking? You own Google, Apple, Disney. You have a bunch of blue, you have a bunch of blue chips. Yeah, it's fascinating that you own Apple, seeing how much you hate Apple. Oh, yeah, I hate Apple. I love money. However, you're just an",
            "start": 1718.12
        },
        {
            "text": "Apple, Disney. You have a bunch of blue, you have a bunch of blue chips. Yeah, it's fascinating that you own Apple, seeing how much you hate Apple. Oh, yeah, I hate Apple. I love money. However, you're just an opportunist, really. So that has gone up nearly 5% since I bought it. So, yeah, and I don't have a little of it. I didn't realize this, but I guess I, there was a new story out the other day. I guess iPhone 7 has, is one of the best-selling iPhones to date. Yeah, they're all the best-selling iPhones, 'cause people like, everyone just like wants a new version. That's crazy. Me, I would have thought that there, I would have thought those sales would have dropped off, but I guess, well, that and the fact that they're more expensive than they used to be, but I guess they're doing just as good as they always have. There, there was one where it did not do as good as the previous years. That was probably the 6s, I would guess. It might. Has there been a 7 Plus yet? There is a 7 Plus. Yeah, it might have been this year then.",
            "start": 1763.08
        },
        {
            "text": "one where it did not do as good as the previous years. That was probably the 6s, I would guess. It might. Has there been a 7 Plus yet? There is a 7 Plus. Yeah, it might have been this year then. No, I think I just saw one that the 7 is, is the best generation. I just saw a report on that on The Verge. The 7, does that include the 7 Plus? I think whatever this, this newest generation. Yeah, I, I, I just saw the headline. I didn't read the actual article. So, you know, in typical me fashion, I could be completely talking out of my ass. But if you looked it up, that'd be cool. It's just fascinating, 'cause I, because to me, the, the notion that Apple is still selling well is kind of foreign to me. I, I don't understand why people still are that die-hard about the brand, but I guess they are. It's not the most expensive company on the planet for, for nothing, Kevin. Yep, there is a supplemental story that you already have here from GameSpot. Um, so, uh, Eddie over GameSpot has just supplemental information, kind",
            "start": 1800.2
        },
        {
            "text": "expensive company on the planet for, for nothing, Kevin. Yep, there is a supplemental story that you already have here from GameSpot. Um, so, uh, Eddie over GameSpot has just supplemental information, kind of talking about the same information here, uh, via DualShockers about PS4 Pro and VR. Uh, it says, quote, this is from Sony itself, says, quote, PS4 Pro is running as we had expected, as we assumed, but Pro maybe is doing more than we anticipated. So it seems like if Sony's telling the truth here, I don't see why they wouldn't, that Pro is actually exceeding their expectations. Uh, likewise for sales or performance for sales. Okay. Uh, likewise, it seems like PSVR is doing what they expect as well. Um, so maybe a little drama around these two pieces of hardware that don't, not necessarily merited based on what Sony's saying, also based on the, the healthy financials. Um, it is worth noting, though, that the financials I don't think are as strong as people expected, considering the performance of PlayStation.",
            "start": 1839.16
        },
        {
            "text": "what Sony's saying, also based on the, the healthy financials. Um, it is worth noting, though, that the financials I don't think are as strong as people expected, considering the performance of PlayStation. They're still making a profit and are in the black, but it seems like poor foreign exchange rates, as was mentioned earlier, is going to hurt them because they are dealing in Yen, um, which is not a good thing for them. Uh, if they were dealing solely in American dollars as an American company, they would be doing way better. Um, there is a followup to yesterday's GameStop story from Jason Schreier, uh, over at Kotaku. As you remember, Nick, yesterday we talked about how GameStop, and you guys can go back and read GameStop's basically lying or having its employees lie to people about the availability of new hardware and new software in order to meet these quotas, since their margins are much bigger on used hardware and used software as opposed to selling new things, and, and the margins there are much smaller. We",
            "start": 1878.72
        },
        {
            "text": "and new software in order to meet these quotas, since their margins are much bigger on used hardware and used software as opposed to selling new things, and, and the margins there are much smaller. We talk about that actually in today's Colin Was Right, if you want to check that out, the margins. Um, so Jason writes this, says this afternoon, following yesterday's Kotaku report on GameStop's controversial Circle of Life program, the retail chain sent out a memo to all stores condemning some of the actions we spotlighted in claiming that most of their employees don't behave that way. Um, the full memo says this, uh, quote, Dear GameStop family, I want to take a moment to address an article that called into question our Circle of Life program and the exceptional service you provide our customers every day. In the article, there were behaviors described that indicate our, that indicated our Circle of Life program places pressure on store associates to mislead customers on the value of certain products. Let me be clear",
            "start": 1917.68
        },
        {
            "text": "there were behaviors described that indicate our, that indicated our Circle of Life program places pressure on store associates to mislead customers on the value of certain products. Let me be clear on this, nothing can be further from the truth. You and I know at GameStop, it is absolutely our mission to help our customers get the best advice and price on any product we sell through buying, trading, pre-ordering, and earning points. We want every customer to get the product and the deal that is right for them, whether that be new or pre-owned video game product, digital sale, or collectible. The Circle of Life generates great value for the customer. Consider these facts: GameStop issued approximately $1 billion of trade credits to our customers last year. 70% of the time, those trade dollars were immediately spent on new gaming products. I've heard many, how many of you are concerning this, and know that you work very hard to make sure our customers have a great experience. Thank you for that. While this",
            "start": 1957.08
        },
        {
            "text": "spent on new gaming products. I've heard many, how many of you are concerning this, and know that you work very hard to make sure our customers have a great experience. Thank you for that. While this behavior described in the news articles are disappointing, I know they don't represent the vast majority of our associates and how they treat our customers. Um, so there's a followup there. I still, it still doesn't quite resonate or sync up at all with Jason's reporting, though. The issue yesterday was that they were incentivized to dissuade people from buying new gaming and new, new, new games and new hardware, right? According to Jason, the Circle of Life program at GameStop is split into four segments. Uh, the segments, I believe, are something like pre-owned games and et cetera, and so on. They need to reach, they need to hit three or four of those quotas, which requires them not to, or encourages them to push the de facto to not, right, push new hardware and new software. And in fact, according to these sources that",
            "start": 1987.8
        },
        {
            "text": "Jason had talked to, people just straight up lie about the availability of these games in order to push the used product. For instance, he brought up Watch Dogs 2, I think, which is $54.99 used and $30 new. But they make more, the margin of selling the game. Uh, wait, did you flip those? No, I didn't. 54. It's, it's more expensive to get used, right? Because Watch Dogs 2 is so much. Watch Dogs 2 had a huge price cut. That might be that the, the used game price might be latent. Typically, a GameStop for a newer game, you're only getting $5 off the product, even though they'll only pay you whatever, $30. So the margin there is, is much bigger. The rip of a retailer typically is about $10 on a $60 game new within the first 90 to 180 days after it is.",
            "start": 2023.88
        },
        {
            "text": "is much bigger the rip off for people that don't know and I talk about this in Colin Was Right the rip off of a retailer typically is about $1 on a $6 game new within the first 90 to 100 days after it is sold the other $48 goes to the publisher to pay their bills $8 of that goes to the person who or the the company whose hardware is being sold $5 or so goes to the manufacturers etc. and so on right so that's how the breakdown goes so since the margin is so small at a $60 game $10 they look at it as saying well if we have a $54.99 used game that we paid $15 for the margin there is $30 it's thick okay so so basically just it boils down to margins and profits yes your margins you got it makes sense that is an interesting business it's uh it it it makes me question their viability this this is a desperate company like I I understand that they're they're changing or whatever but you know I saw a story yesterday Electronic Arts reported that a full one-third of their",
            "start": 2067.24
        },
        {
            "text": "viability this this is a desperate company like I I understand that they're they're changing or whatever but you know I saw a story yesterday Electronic Arts reported that a full one-third of their games sold now are digital one-third remember that the benchmark only a year or a year and a half ago was 10% GameStop's in a lot of trouble with with this with this kind of stuff it's happening happening GameStop I feel like it's just any brick and mortar uh company that's selling that's selling actual physical hardware is going or sorry physical games rather I think GameStop specifically oh I see you're saying any game store well I'm just saying any game store you walk in and try to get I mean digital digital distribution has been on the rise for the last 10 years that's just going to be that this is this is something I'm sure they're they're combating every day and trying to figure out strategies for hence the sort of internal shift towards selling those used products and also would be my",
            "start": 2114.4
        },
        {
            "text": "is this is something I'm sure they're they're combating every day and trying to figure out strategies for hence the sort of internal shift towards selling those used products and also would be my guess I'm I'm not discrediting them or they sold used for a long time but but definitely emphasizing that more along with uh collectibles and toys and all that kind of stuff which is a huge part of the GameStop business now along with their mobile market which is you know Cricket I think is a GameStop uh subsidiary uh combined uh with their publishing arm GameTrust now they're trying to publish games so if you bought if you wanted to get uh the new game Deformers from the guys that made The Order: 1886 Ready at Dawn you can only buy that at GameStop or digitally same thing with the uh with the Insomniac game uh Song of the Deep so they're getting they're they're trying I I give them credit for trying but it's it's this business is a dead end like it it it just it is it is totally what happened",
            "start": 2150.6
        },
        {
            "text": "game uh Song of the Deep so they're getting they're they're trying I I give them credit for trying but it's it's this business is a dead end like it it it just it is it is totally what happened to the PC market is going to happen to the to the console market it's just way slower than than I think we expected no one buys PC games in store no one well but I feel like then this is why this behoove retailers like GameStop to try to figure it out right obviously clearly they're trying to evolve and this is this is the growing pains of that so we'll see what happens someone else pointed out they they own Kongregate that's true we our good friend that we used to work with at IGN works at Kongregate and that's a that's like a a flash game mobile game kind of provider and now they're getting into some more serious publishing as well we were talking a little bit about that with our with our our friend there uh when we were at GameStop Expo in Anaheim I think that was back in September so uh",
            "start": 2188.72
        },
        {
            "text": "some more serious publishing as well we were talking a little bit about that with our with our our friend there uh when we were at GameStop Expo in Anaheim I think that was back in September so uh that's that story there in case everyone's curious um the final story I have and then we'll move into the to the to the uh the entertainment stuff you've dug up here some interesting entertainment stories uh The Last Guardian uh just just in case you're curious and you want to buy it The Last Guardian's price cut from $60 to $40 which has happened very recently in the last couple days is permanent um the game clearly has bombed so if you want uh to go get that whether new or at PSN you should be able to get a pretty good deal on it and I think $40 is a pretty appropriate price for it but uh you know even though I I the game didn't resonate with me even though I think that the fact that they even went about this decade long journey to make this game is a joke um I'm glad that I'm glad that",
            "start": 2225.68
        },
        {
            "text": "know even though I I the game didn't resonate with me even though I think that the fact that they even went about this decade long journey to make this game is a joke um I'm glad that I'm glad that people uh like it but it is sad that the game clearly has like clearly has just abjectly bombed uh you don't see a permanent $20 price cut for a game that came out a month and a half ago yeah uh so you have to assume that's they were assuming that right you have to assume that given the lineage the game and how long it took to develop that they were just like this this is a risk put this out it's going to be yeah let's see how this one goes I would love to know how much money they lost on it like is it is it is it a 10 years of development cycle a lot they took they took a big loss on this one yeah I assume so yeah I mean you have to like past a certain threshold they're like we just got to get this game out we got to recoup some of these expenses some of this loss they have to well I I",
            "start": 2266.36
        },
        {
            "text": "yeah I assume so yeah I mean you have to like past a certain threshold they're like we just got to get this game out we got to recoup some of these expenses some of this loss they have to well I I would love to see how much yeah that would be that would be fascinating to see how you see price cuts with games that aren't doing well recently that are quicker Titanfall 2 didn't do well got a quick price cut Watch Dogs 2 didn't do well got a quick price cut this is just if The Last Guardian was selling at $60 it would stay at $60 you're not going to find uh many you can you can you know Doom and Uncharted 4 and all those kinds of games if you go into GameStop right now are probably still $60 they came out long before The Last Guardian because they're selling at $60 so I think The Last Guardian should have always always been sold at $40 and I think that it would have sold better similar to Ratchet & Clank which was actually you know 5,000 times better than The Last Guardian uh but sold",
            "start": 2303.76
        },
        {
            "text": "should have always always been sold at $40 and I think that it would have sold better similar to Ratchet & Clank which was actually you know 5,000 times better than The Last Guardian uh but sold at $40 new Uncharted you know that game was good that game was really good it's very very good if you guys haven't played Ratchet & Clank that came out almost a year ago on PS4 the kind of reboot of the original go check that out yeah I got into that game I don't know why it's fun though I know why it's fun it's a great game it's beautifully designed and it's fun um and speaking of we brought up Doom speaking of Doom and Bethesda the Pete Hines episode with Greg should go live tonight I think for our subscribers as well as the GameOverGreggy Show that was that was quite rambunctious if I do say so myself uh should before we get into the to the next story should we read some tips sure you want me to take care of that B, do that okay sounds good have a lot of tips today I'll go through them",
            "start": 2336.6
        },
        {
            "text": "so myself uh should before we get into the to the next story should we read some tips sure you want me to take care of that B, do that okay sounds good have a lot of tips today I'll go through them as quickly as I possibly can you look digital says do you guys think Trump's new policies create an increase on of tariffs on Bongos I certainly hope not I don't know what is the Bongos tariff situation Kevin everybody knows Bongos are made domestic it's just a rumor they're made overseas well technically yeah you were made domestically right no you were made overseas Kevin I was made domestically I was born overseas okay it was not really overseas well I mean this is this is a complex issue so I mean technically speaking there might need to be a tariff on Bongos but probably not I don't think you understand how Bongos work it's not my body Nick I don't understand how tariffs work either so it doesn't really matter uh Connor says I implore you both to watch HBO series The Leftovers it's",
            "start": 2374.68
        },
        {
            "text": "you understand how Bongos work it's not my body Nick I don't understand how tariffs work either so it doesn't really matter uh Connor says I implore you both to watch HBO series The Leftovers it's criminally under underwatched and I feel you both would absolutely love it Season 2 is regarded as one of the best seasons of TV ever um that's not true sucked a lot of people do like The Leftovers um do you do you like The Leftovers I've watched a couple episodes of it I couldn't get into it I didn't but my thing is this I I watched it and it was during a time where I'm like I don't want to get into another series that I know is going to never answer the question of what the **** happened you know what I mean like suddenly all these people are just like everyone's gone and all these people are left over on on the planet and there people that don't talk and I'm like I don't this is a Smoke Monster all over again I don't I don't want to know what's going I want to know what the ****",
            "start": 2412.6
        },
        {
            "text": "are left over on on the planet and there people that don't talk and I'm like I don't this is a Smoke Monster all over again I don't I don't want to know what's going I want to know what the **** happening on the island and I don't want to wait till season 7 to figure out that there spoilers it's a **** terrible ending so I I can't get into that I got too many things like that I got The Walking Dead that's that's the only series I can I can stomach right now where I I can I'm never going to know what's happening right also not a big fan of Justin Theroux I don't know why he's just probably the wrong way maybe it's cuz I don't know maybe I'm I'm on the side of Jennifer Aniston not him oh I'm yawning my bell is exposed there it is there it is let me touch it uh City Vicious uh says today Colin Was Right is a shining example of the all too rare journalism happening in games media today your dedication to educating whilst entertaining thank you for using whilst uh does not fly under the",
            "start": 2448.72
        },
        {
            "text": "was right is a shining example of the all too rare journalism happening in games media today your dedication to educating whilst entertaining thank you for using whilst uh does not fly under the radar well done sir thank you seems like it's getting very positive responses which I appreciate sorry that word whilst, whilst, whilst Isn't it whilst, whilst it's not whilst no one's ever said whilst before Kevin whilst it's whilst still entertaining uh Ben Gibson says Hey thank you very much your thoughts on the new retro consoles and that you can play wait I'm sorry hey your thoughts on the new retro consoles that you can play Old NES Genesis SNES etc. versus just downloading the games on PC or buying the overpriced NES Classic System question mark K thanks my my thought on so the Retron uh or Retron, Retron you start sentences off with the word what are your thoughts so that I know that at the end of it there's going to be a question mark FYI when you just start with your thoughts on the new the",
            "start": 2483.64
        },
        {
            "text": "Retron you start sentences off with the word what are your thoughts so that I know that at the end of it there's going to be a question mark FYI when you just start with your thoughts on the new the new your thoughts in the new retro consoles I'm expecting the next phrase are stupid period as a statement an affirmative statement sorry continue uh but thank Ben so uh some of these all-in-one consoles uh while of dubious legality probably are are super interesting my brother has the Retron and I was playing with his son uh Mega Man X2 and X3 and Mega Man 3 and 2 when I went home for Thanksgiving it's a really cool kind of device my my my take on piracy because that's what you're kind of talking about here is this and the availability of ROMs and all that my take is this if a game is because I think this is a reasonable stance if a game is available on a platform that is easily accessible so for instance if you can get it on a Virtual Console on a Nintendo product if you can download a PSN",
            "start": 2528.96
        },
        {
            "text": "I think this is a reasonable stance if a game is available on a platform that is easily accessible so for instance if you can get it on a Virtual Console on a Nintendo product if you can download a PSN Classic or PS1 Classic whatever um then I don't think you really should be downloading ROMs if a game is just made completely unavailable for years and years or decades and there's no and it's just not available then and the only way you can play it is on an emulator then that's kind of like not your fault you know and not that you have a right to play it but you but you but to say in other words if you put your money where your mouth is and and they like I want this game I want to play Fantasy Star IV I'm going to go download it on Wii U because it's available via Virtual Console as opposed to something obscure then you're basically showing and doing the right thing being like when the game's available I am happy to buy since the game is no not available and unless I go and buy a $100",
            "start": 2568.64
        },
        {
            "text": "to something obscure then you're basically showing and doing the right thing being like when the game's available I am happy to buy since the game is no not available and unless I go and buy a $100 cartridge and then dig up an old console then I have no choice if I want to play the game then to play the ROM and I think that that's totally a reasonable thing I'm not saying it's legal but I think it's reasonable you fair enough uh that was from Ben Gibson thank you for that tip Ben uh I was wrong Quaner says late birthday tax Colin your episode of Colin Was Right was incredible will the tariffs impact digital pricing could this cause a divide between digital and physical sales question mark uh yeah I didn't want to get because I tried to put as little of myself into this in this as possible because it was 20 minutes long um as it was but uh so my my take is that tariffs uh bring uh games up to uh $70 for instance will push digital sales further especially if the digital sales stay low in other",
            "start": 2606.28
        },
        {
            "text": "it was 20 minutes long um as it was but uh so my my take is that tariffs uh bring uh games up to uh $70 for instance will push digital sales further especially if the digital sales stay low in other words you know it's all **** if everyone's prices go up to $70 even on digital sales so that reaction will tell you everything you need to know about the mo the profit motive um of the publishers um as my source says the profits made by publishers are just not as big as people think there's not especially when a game starts going to $40 and $30 for instance at $40 let's talk about The Last Guardian sure we were talking about how a $60 game $10 goes uh to the person who's selling it so your GameStops your Walmarts whoever then uh the other $38 goes to the publisher right if you're selling a game for $40 $10 still goes to GameStop now you're dealing with $18 or whatever it is or or no that's not right 18 what I don't know whatever the math a fraction of of the uh of the of the price I'm not",
            "start": 2641.64
        },
        {
            "text": "for $40 $10 still goes to GameStop now you're dealing with $18 or whatever it is or or no that's not right 18 what I don't know whatever the math a fraction of of the uh of the of the price I'm not a math a fraction of the price we're not scientists so but you still have to extract what you need to pay for for out of that price so if if The Last Guardian is being sold for $40 and they're suddenly walking away with $18 in uh in profit then that money might not even be enough to cover their cost because remember that is also gross not net so they still have to pay taxes on it then they have to go pay the manufacturer still another $5 off that then something you're left with with peanuts if your game selling for or $30 the jig's up you know so that's why the games are sold at $60 and this also takes inflation and all that kind of stuff as well so just things to consider on this particular Mark so I think that it could support digital digital the digital structure as long as the",
            "start": 2689.96
        },
        {
            "text": "also takes inflation and all that kind of stuff as well so just things to consider on this particular Mark so I think that it could support digital digital the digital structure as long as the digital structure isn't affected by the tariffs because then you know that there's a bunch of **** going on as well um well digital sales uh well let me back up I had an interesting conversation with a source that didn't make it into the video he was saying that um that there could be some sort like we don't exist in this space but it's conceivable that a game made in Japan even though it's manufactured here could still be considered tariffed because it is a product from overseas so if um physically importing it but there is they're importing the data yeah the data come so even if Technicolor makes the discs Technicolor makes almost all the DVDs and Blu-rays you make for you watch for instance even even if they make the disc the argument might be able to be made and I don't know if it's",
            "start": 2733.0
        },
        {
            "text": "makes the discs Technicolor makes almost all the DVDs and Blu-rays you make for you watch for instance even even if they make the disc the argument might be able to be made and I don't know if it's legal or I don't know if there is an argument to be made that well that product is actually still foreign you know interesting so now could that not be applied to digital distribution then I mean does it have to be a physical good for to be tariffed well that's what I'm saying so that could be the argument if if digital goods go up in price and then they point say like actually the tariff is at the point of exchange not at the point of manufacturing manufacturing that's fascinating yeah kind of makes sense though so it's not something that they ever had to really deal with because the argument could be like well the book like if you're reading um uh you're reading like Aristotle or something well that's not a good example cuz that's in the public domain if you're reading like just a Russian",
            "start": 2781.16
        },
        {
            "text": "be like well the book like if you're reading um uh you're reading like Aristotle or something well that's not a good example cuz that's in the public domain if you're reading like just a Russian author right and then the book's published here in English is it a foreign good interesting I don't think so but that the argument was being made that that's possible so more importantly how do we stop Fifty Shades of Grey from happening that's that's the more important question we have to stop the proliferation of that uh M Gas Man 300 says Nick what's the status gives a nice tip and said what's the status of the Bongos of Bongos the movie starring The Rock and Kevin Coello also have a video for your fun clip section neighborhood fireworks fail um that movie The Project again as I've said for 13 days straight not in the works we are not trying to make that film um it's a great idea uh and I have no doubt that if we were to to to put The Rock on it it would sell well because The Rock just can",
            "start": 2817.48
        },
        {
            "text": "days straight not in the works we are not trying to make that film um it's a great idea uh and I have no doubt that if we were to to to put The Rock on it it would sell well because The Rock just can make anything he wants and it's good and it'll sell well um Kevin on the other hand will just he's he's we get that '90s trailer the the trailer guy to do the commercial yeah we sure can one man one man one belly two hands Bongos uh Darw King Dar King says hey Colin and Nick really enjoy the content recently Nick you and Kevin were so funny in the Wildlands let's play Colin love your latest Colin Was Right sorry about uh the divisive people out there well there's always going to be divisive people out there you just got to push through them and not listen to the not listen to the noise thank you very much Kevin spent a lot of time working on that Wildlands let's play a lot more time lot more time but thank you for enjoying that and for those of you who haven't seen it over Kinda Funny",
            "start": 2858.2
        },
        {
            "text": "you very much Kevin spent a lot of time working on that Wildlands let's play a lot more time lot more time but thank you for enjoying that and for those of you who haven't seen it over Kinda Funny Games right now go check it out on our YouTube channel it's very very cool uh a few more tips uh Maro Kasm says how often do you all eat at home you seem to always eat out somewhere it makes me think of how much you spend on restaurants a month I stay straight eating out I spend a **** ton of money on eating out It's upsetting I also spend money on restaurants uh I actually like to cook I actually like cook at home pretty often but I'm I'm often in fluxing in transit between my place and Erin's place so uh I eat out far more often than I would like but that's just the reality of the situation um I couldn't have imagine 10 years ago that I even have any money at all to be able to eat out like this right uh but uh but I do it and it's not good for your health and it's it's it's it's but",
            "start": 2906.2
        },
        {
            "text": "um I couldn't have imagine 10 years ago that I even have any money at all to be able to eat out like this right uh but uh but I do it and it's not good for your health and it's it's it's it's but there are also times where that your your your your time is money also if you're buying ingredients for a thing that you're not going to use for anything else you could be wasting money making food so you have to be very thoughtful and deliberate about that very true uh I often eat I usually eat breakfast and dinner at home but I I enjoy the break during the midday to to actually go out with the guys and hang out and have fun that's why I kind of I just I I I I eat the expense of of the lunches it's just fun also having worked at IGN for so long where people would work through lunches it was like a point of pride for me to be like I'm going to stop working right now we're all going to go have a lunch hang out together and then come back with our heads cleared yeah I liked at IGN I liked our",
            "start": 2946.52
        },
        {
            "text": "a point of pride for me to be like I'm going to stop working right now we're all going to go have a lunch hang out together and then come back with our heads cleared yeah I liked at IGN I liked our our weekly lunch that we would go to every Wednesday I want to say I was not part of these lunches no you weren't you weren't you were not even the embryonic state of this company un just a sperm in my gonads there was a point where you guys will still having lunches and I was helping yeah I just like to insult you that I like that you're like you just missed the very Genesis though of it no you're doing great it was really funny I enjoyed it Ro K64 says Colin regarding the Switch what would you think if Nintendo used their My Nintendo rewards system as an achievement Trophy system where uh where you could actually buy discount stuff with your games rewards uh I so actually made this argument and I think it's a really salient kind of thing like the way Nintendo should have done achievements",
            "start": 2981.4
        },
        {
            "text": "you could actually buy discount stuff with your games rewards uh I so actually made this argument and I think it's a really salient kind of thing like the way Nintendo should have done achievements or trophies and they could have and they're clearly not going to like is to really monetize in some way your achievement in those games if they really were thoughtful and deliberate about it went and gave all of their Virtual Console games of first and third party provenance a trophy or Achievement System and lock that into an ability to get money in your wallet you know maybe little fractions of money so you don't get crazy with it but that gives you a reason to go back and download Super Mario 3 and then get all the achievements because then maybe you get $5 for that and you go buy the next game and and and that would create an I mean they I don't people would say like they would lose money but I don't think so like I think it I think people's you know uh eyes are bigger than their",
            "start": 3020.84
        },
        {
            "text": "next game and and and that would create an I mean they I don't people would say like they would lose money but I don't think so like I think it I think people's you know uh eyes are bigger than their stomach and that like they'll buy these games and be like I'm G to **** net all the money and then they won't and then Sony's and or Nintendo be like well they actually maybe even made money on doing something probably that's not a bad concept so so I would I I always wanted Sony to do something like that where it be like if you get a platinum trophy you get $5 but because but because there's no you know something small not $5 you wipe your ass $5 who cares but it's like something to say like oh here's just we'll just put $5 in your wall congratulations for getting a platinum trophy right uh but then there's all I Amo or all the whatever those games are with the easy plats that ruin it because you know there would need to be some quality control as we all know Sony doesn't give a flying",
            "start": 3055.64
        },
        {
            "text": "but then there's all I Amo or all the whatever those games are with the easy plats that ruin it because you know there would need to be some quality control as we all know Sony doesn't give a flying **** about quality control so there you go um so that's what hinders that ability fascinating concept though uh Tetris Effect says hey boys hope you're doing well today I think you guys especially Colin will appreciate this video wish I had half as much talent as this dude he gave us a there's a video for that Kevin let's copy that we'll get to that if we can Hugo S.E. says thanks so much gave us tip a nice tip and said thanks so much uh for this week's Colin Was Right it was the most positive and constructive opinion uh video about this topic you just made my day thanks and love from London uh Mike Kale Pistol says Please welcome a new Kinda Funny best friend of the world uh Arya Elizabeth Pist Pistella born with the Vita in her hands love you guys speaking of Lola was going to be here",
            "start": 3091.8
        },
        {
            "text": "Mike Kale Pistol says Please welcome a new Kinda Funny best friend of the world uh Arya Elizabeth Pist Pistella born with the Vita in her hands love you guys speaking of Lola was going to be here today I don't want to let anyone down but Lola until the very last minute was supposed to to be here today now Lola as we all know is the head of the SS for Vita Island she is the one that's going to basically we don't call them the SS we don't call them SS we call them the secret police right we don't call them they're the SP they're the CC the secret police I don't know doesn't matter um terrifying terrifying you know the worst things come with the cutest faces you understand that right yes she gets away with murder because she was adorable she's ridiculous I love you can't say no to her like well I guess you can kill that person whatever uh the first was porn has given us a tip it's said great show today guys Colin and Greg live is my second favorite live stream I've watched in the",
            "start": 3127.92
        },
        {
            "text": "like well I guess you can kill that person whatever uh the first was porn has given us a tip it's said great show today guys Colin and Greg live is my second favorite live stream I've watched in the last five minutes thank you for that underhanded uh remark just say but I'll take it yeah Jinaki 45 says I want to apologize for my stupid comment yesterday calling Kevin boring don't apologize for that he's not boring but you've disparaged him and that made my day I also don't forgive you yeah doesn't matter he's fun uh SHBG has given us a tip and says Colin what are your thoughts on Double Dragon 4 so far also 311 or 311 excuse me was an inside job uh Colin already gave us thoughts earlier yeah Double uh uh Double Dragon 4 is not good at all but there's a little piece of nostalgia there as well there you go it's so funny because when you look play play game like Mega Man 9 or 10 that's built on the aesthetic of a great game and then you play Double Dragon that's built on the aesthetic of a",
            "start": 3171.76
        },
        {
            "text": "you go it's so funny because when you look play play game like Mega Man 9 or 10 that's built on the aesthetic of a great game and then you play Double Dragon that's built on the aesthetic of a good game or a mediocre game it's just they're just it's night and day maybe Double Dragon doesn't hold up anymore I don't know few more tips Mike_Lore_RZ says here's a little of my birthday tax keep being awesome Colin keep being sexy Nick Kevin okay keep being awesome Colin Nick Kevin keep being sexy oh we're not awesome we're sexy but you know I'll take it sorry you're awesome I'm also sexy yeah not according to Mike_Lore_RZ uh Junior People says there needs to be an amendment that Kevin gives us Bongos in the Kinda Funny Constitution it's not a bad idea I mean it's gonna be hard to pass that our good friend THR7 has given us a temp Colin Bravo the new episode of Colin Was Right exploring gaming through your political and historical lens is fascinating keep making please keep",
            "start": 3212.08
        },
        {
            "text": "to pass that our good friend THR7 has given us a temp Colin Bravo the new episode of Colin Was Right exploring gaming through your political and historical lens is fascinating keep making please keep making this content uh Bib says Colin would you consider not using all caps when displaying quotes on Colin Was Right it would make it easier for the viewer to read along with their own head along with their yeah keep up the great work it's it's that's so Nick was actually the one kind enough to even show me how to do that and that was the format we made I thought it looked fine but I haven't heard this complaint so I'll keep an eye on it but I I don't know that that's necessary we can take a look at it uh the problem is I think that font is all caps no that's fine I mean I I I this is the first I've even heard that piece of feedback but I have not also read almost anything about what people are saying right I'm happy I'm happy to switch the the font if that becomes a problem so we'll see",
            "start": 3255.2
        },
        {
            "text": "I've even heard that piece of feedback but I have not also read almost anything about what people are saying right I'm happy I'm happy to switch the the font if that becomes a problem so we'll see but I thought Nick I thought Nick's solution was quite good so I I think we'll probably keep with it but we'll see cool Paner G says Colin uh Colin need to thank you for the uh Strider recommendation Strider recommendation excuse me uh such a great game secondly Nick everyone who has ever and will ever meet you want want to see you sex tape be a man of the people he got you I mean okay but the problem is this I'm only having sex with one person these days clearly my wife and that only happens very rarely early usually Sundays around 4 p.m. if you guys want to come over um my wife will never let me record that intimate moment between us uh for a number of reasons not the least of which is because she knows I'm irresponsible and probably posted on some level um so as much as I'd like to have",
            "start": 3289.68
        },
        {
            "text": "me record that intimate moment between us uh for a number of reasons not the least of which is because she knows I'm irresponsible and probably posted on some level um so as much as I'd like to have there be a sex tape I need a willing participant otherwise you're just going to see me masturbating on camera which if that's what you guys really want to see but I'm going to do it nasty like with my legs up so you can see all of me oh man all of me oh dear God I want a hand off screen that's kind of tickling not not the ass but getting real close get real close kind of on the edge of the grundle where it's like yeah it's tantal and it's got to be just oiled up down there so the hair kind of sticks to the legs in a real sweaty looking nasty it's never going to happen sorry but uh but thank you for the tip um Do Songo B says greetings seeing a Sony and Microsoft have stores worldwide can you see them moving console sales to these and Amazon in an attempt to cut physical media uh which i.e.",
            "start": 3330.44
        },
        {
            "text": "for the tip um Do Songo B says greetings seeing a Sony and Microsoft have stores worldwide can you see them moving console sales to these and Amazon in an attempt to cut physical media uh which i.e. GameStop should wouldn't support things are let's just say this the the the the politics between the retailers and the hardware manufacturers are going to get really interesting because per the point we were making about money spent the impetus is on the de on the hardware manufacturers and the Publishers to get them out of the game yeah as quickly as possible and again as you said and have said many times the uh the only reason that they're plated at all is because they need to people push Hardware um at the point in which the software is removed the hardware has to have a huge you know I think Hardware will get more expensive when that happens happens because the the for for them to play ball when they're not selling software which is a lot of money made um we're talking about 400 million",
            "start": 3371.76
        },
        {
            "text": "Hardware will get more expensive when that happens happens because the the for for them to play ball when they're not selling software which is a lot of money made um we're talking about 400 million pieces of software I think sold on PS4 you know uh that's a lot of **** money that's a lot of money even if they were all $10 games that's a lot of money um so I think that the the the solution is going to come from uh from one Hardware manufacturer being bold enough to do it and I would have in 2013 I said boldwin and that this these are the last pieces of Hardware with drives with with like physical media drives on them I don't know that that's necessarily going to be the case now um things have gone a little slower than I thought yeah me too that's and you don't want to alienate people yet but eventually they're going to have to be alienated um and uh if it were Apple they would have done it yeah years ago that's the way you do it with phones and tablets it's the way you do it with PC",
            "start": 3413.56
        },
        {
            "text": "but eventually they're going to have to be alienated um and uh if it were Apple they would have done it yeah years ago that's the way you do it with phones and tablets it's the way you do it with PC why are consoles immune from this it's just it's just weird I understand some of the excuses but at the at the same time I don't understand some of the excuses and I think that um you know this generation is also I don't think going to last very long so uh remember that the generation last generation lasted as long as it did from 2005 to 2013 because of the recession otherwise there's no way in hell it would have lasted that long and I think that that point is lost on a lot of people I think that you would have gotten new consoles way earlier 2011 2012 the latest but the recession **** everything up for everybody so they had to pull back we have four more tips to read and then we should call tips no more tips please people calling them now let's calling them now let's call them right now",
            "start": 3453.0
        },
        {
            "text": "up for everybody so they had to pull back we have four more tips to read and then we should call tips no more tips please people calling them now let's calling them now let's call them right now so we can get we have a it's like this this is this is it this no is this is which one I don't understand I just saw your hands do something he Colin and I don't know what they did hell Colin Gad Zuk says uh to Colin for his I don't know what S.O. is S.O. what does that mean what is it what is this shout out oh shout out to Colin for his love of Fair to Midland love them curious as to his opinion on System of a Down I feel like he'd find their line my **** is much bigger than yours uh relatable hash Event Horizon I like the first few System of a Down records the uh uh obviously Toxicity was you know the I think their second which is great the one with sugar on it that came before I can't remember the name of that uh and then the one after that which was Steal This Album",
            "start": 3488.84
        },
        {
            "text": "Toxicity was you know the I think their second which is great the one with sugar on it that came before I can't remember the name of that uh and then the one after that which was Steal This Album right with Inner Vision on it I liked those three records after that one they got a little little weird for me D that double album they released was good uh Fair to Midland's **** awesome though if you guys don't Fair to Midland **** rocks great band holy **** sounds like an indie film by the way Fair to Midland uh they're a Texas based like hard indie rock band really really they were they they broke up but they're really like super **** good check them out on Spotify if they're there not go **** yourself I think they went bankrupt actually if you read about them really yeah too much cocaine I think they they just ran up a bunch of debt as a band and then that was the end what star just did oh I guess Johnny Depp's in that problem did you read about that yeah I heard he had like 14 houses",
            "start": 3534.0
        },
        {
            "text": "I think they they just ran up a bunch of debt as a band and then that was the end what star just did oh I guess Johnny Depp's in that problem did you read about that yeah I heard he had like 14 houses or something like that **** fascinating article I came out to 10 days ago I'm I'm I'm just absolutely fascinated with that because I can understand there's part of me that understands that part of me says **** it let's spend on as much money as possible let's live Splurge but then there's the other part of me that grew up with a with a hardcore Italian mother who is pinching every single penny that she my mom has the first penny she ever made guarantee it so I'm like how you lose that much **** money why do you need 15 houses I would I would live so lean if I was a rich and famous millionaire or something like that like I would just I would have a nice house and some accoutrements and some luxuries but I'm not going to like I don't need all this **** I want I want that money so I",
            "start": 3567.8
        },
        {
            "text": "or something like that like I would just I would have a nice house and some accoutrements and some luxuries but I'm not going to like I don't need all this **** I want I want that money so I don't have to do anything yeah the only extravagant thing I would have is I would have one of these screens in my house that had my bank account number in it and and watch it going up as I would slowly stand in front of a naked like Sam Rockwell from uh Confessions of a Dangerous Mind just slow jerk off to it all **** day to the point where my wife's like I'm literally leaving you my bags are packed because you won't leave from that spot and I would just be like I would just look up and think Millions going to go down by half though millions that's true you're about to lose knowing my wife that's more than that um Swamp Fox 343 says pay my annual birthday tax keep up the word gents uh Captain G 36 says Colin what's your favorite Mega Man 3 level song uh besides Wily stages I'm partial to Shadow Man I",
            "start": 3602.68
        },
        {
            "text": "than that um Swamp Fox 343 says pay my annual birthday tax keep up the word gents uh Captain G 36 says Colin what's your favorite Mega Man 3 level song uh besides Wily stages I'm partial to Shadow Man I agree it's the best video game ever made no contest Wily Stage yeah Wily Stage One is the best song but uh and I think the best Mega Man song period super underrated uh out of all the stages um is that the one that goes Castlevania that's Castlevania uh tough one yeah I like Top Man's oh probably I think it would be really good by the way shout out to Mega Man 4 Bright Man damn uh Bright Man's uh music is **** rad also shout out to Mega Man 6 Flame Man check out those songs as well and final tip for the day thank you very much Gamer Versus Girlfriend GF says I've already seen the latest Colin I've already seen the latest Colin Was Right playing on two PCs here at Blizzard I'll be waiting until tonight when I can really pay attention congrats on creating something that clearly resonates congrats",
            "start": 3643.32
        },
        {
            "text": "already seen the latest Colin Was Right playing on two PCs here at Blizzard I'll be waiting until tonight when I can really pay attention congrats on creating something that clearly resonates congrats and that is it for the tips we are calling tips no more tips we have a few more new stories they're not really of any consequence but we can go through that very quickly sure why not uh first new story is Fun the debate or the war between our venerable president and our would be president Arnold Schwarzenegger uh continues as you know I don't know if you saw the story of course you did he was that was some sort of prayer meeting or something it said let's all pray pray breakfast I think uh prayer breakfast let's all pray for the ratings for Arnold Schwarzenegger's The Apprentice to which Arnold Schwarzenegger can not to be outdone the the oak the Australian Oak has fired back I need to open the story first before I say something in a tweet you want to just watch the video uh I'll just read",
            "start": 3695.0
        },
        {
            "text": "Schwarzenegger can not to be outdone the the oak the Australian Oak has fired back I need to open the story first before I say something in a tweet you want to just watch the video uh I'll just read the quote it's much more funny and I'll read it as on alws H Donald I have a great idea why don't we switch jobs you can take over because you can take over TV because you're such an expert in ratings and I can take over your jobs the people can finally sleep comfortable again give the people what they want Kohagen give them the **** a I added that last part you are constitutionally ineligible but it doesn't I would legit vote for Arnold I would be like be damn the Constitution Arnold TW we can't we can't amend that out of the Constitution because then then we're going to have fanatic from another country come here and run it Putin just comes over and it's like I'm in finally **** anyway I think this is Putin sounds I think this is funny I don't know how Putin sounds how do you I hav",
            "start": 3730.64
        },
        {
            "text": "another country come here and run it Putin just comes over and it's like I'm in finally **** anyway I think this is Putin sounds I think this is funny I don't know how Putin sounds how do you I hav heard Putin speak ever heard Putin speak it's always overated with **** someone speaking English yeah but they still you still have him in the background usually you know Putin's a badass in Judo no he's black belt and Judo he's a bad **** and Judo huh yeah also rides horses chess and bareback I mean uh I know anyway I thought that was just funny this is this is an interesting thing yet again our president our fine president is doing for no reason making fights with Arnold Schwarzenegger he's a **** idiot because he has nothing better to do than talk **** just don't understand how this can possibly continue it just goes but it's going to continue we all know it's going to continue so the good news is it gives me a reason to be terrified and wake up uh every morning um",
            "start": 3771.36
        },
        {
            "text": "how this can possibly continue it just goes but it's going to continue we all know it's going to continue so the good news is it gives me a reason to be terrified and wake up uh every morning um scared for my for my family and my friends uh the story right above that Kevin I don't know if you can open that up or not is uh the Batman script rewrite story this is posted over on IGN hold on a second Sor yeah sorry this is just a quick this is a quick aside this was from yesterday Alex O.S.B. writes following the news that B that Ben Affleck is officially no longer on board to direct the Batman uh it has been revealed that screenwriter Chris Terrio has Rewritten the film script according to Deadline or rewrite of the initial cut which was panned by Ben Affleck of the DC Comics and DC Comics Chief Creative Officer Geoff Johns has been turned in by Terrio. Terrio wrote the screenplay for Argo which earned him an Oscar he also co-wrote last year's Batman v Superman: Dawn of Justice which with David",
            "start": 3813.48
        },
        {
            "text": "Creative Officer Geoff Johns has been turned in by Terrio. Terrio wrote the screenplay for Argo which earned him an Oscar he also co-wrote last year's Batman v Superman: Dawn of Justice which with David Goyer and wrote the screenplays for both upcoming Justice League movies uh Justice League movies off off stories he off of stories that he developed with Zack Snyder so uh no surprise here this is probably just what happens people get Rewritten all the time um which is what generally leads to the ultimate Calamity that is the DC Universe right now so we'll see how this and we'll have to deal with Greg saying how great it is yeah so far this movie is uh is not looking it's not looking promising although I do agree with I do agree with some of Ben Affleck's rationale for not wanting to direct and be in the movie at the same time I can understand that that's probably very difficult to do when you have to it takes you like six hours to get into the costume um so I get that we'll see what happens it",
            "start": 3849.56
        },
        {
            "text": "the movie at the same time I can understand that that's probably very difficult to do when you have to it takes you like six hours to get into the costume um so I get that we'll see what happens it takes him six hours to get in the con I don't know I just made that number up but he that but that was one of his gripes that I read earlier on for why he didn't want to necessarily do it because it's so with Argo he could just sit down and direct but with the costume he has like this I don't know did it I I couldn't see was everything good Nick I cancer in my head we were so close to getting shots of Batman sitting in a director's chair directing could have been cool I mean this is a sad thing with this I love Ben Affleck despite Ben Affleck and I like him as Batman despite himself and I think he's a really really really competent director he's a phen I think he's I think the argument can be made that he's a much better director than he is anything else as far as his talents are concerned",
            "start": 3888.88
        },
        {
            "text": "he's a really really really competent director he's a phen I think he's I think the argument can be made that he's a much better director than he is anything else as far as his talents are concerned um so it's it's unfortunate but whatever I'm sure they'll bring in someone just as equally competent to drive this movie Into The Ground uh next story or last story which is fascinating is something that we're probably going to have to hear a lot more about or going to hear a lot more about whether we like it or not uh up until the end of February when the Oscars happen is now if you remember calling last year the big curfuffle with the Oscars was #OscarsSoWhite uh because a lot of people and you could argue rightfully so we're saying there's lack of diversity in Hollywood right now um now they're doing Oscars So I right because everything's cool what's that everything's cool Oscars So I yeah one day one day we strive for that in this in our country that was good that was a good",
            "start": 3926.2
        },
        {
            "text": "um now they're doing Oscars So I right because everything's cool what's that everything's cool Oscars So I yeah one day one day we strive for that in this in our country that was good that was a good joke I like that a lot uh but no this is over on The Hollywood Reporter writes uh the newish the new hashtag is #OscarsSoMale question mark U lack of female nominees highlights another industry problem uh this is by Daniel Downey uh identity politics are fun this is a long article I'm going to paraphrase um they're saying there's a lack of diversity as far as women are concerned in the categories of cinematography writing uh and directing and uh and there is so you know look into this article for yourself make your own opinion we're not going to sit I'm not going to sit here and pass judgment on this I think there is I think there is a diversity problem in Hollywood um and I think that it should be brought to light as to whether or not it should be brought to light continually through the",
            "start": 3963.84
        },
        {
            "text": "on this I think there is I think there is a diversity problem in Hollywood um and I think that it should be brought to light as to whether or not it should be brought to light continually through the Oscars is another question altogether I don't know why the Oscars keeps taking the brunt for this um but I guess because it is the fulcrum point because it is the highest Accolade any actor can get it is a rightful Target so um go read the Ser on The Hollywood Reporter and form your own opinion of it Oscars So I Oscar we should start that Oscars but not like you said it's got be like Oscars All Right so all right you know I mean like could be better could be worse Oscars this was like this is the thing I was saying I don't believe I believe in meritocracy and I believe in in in supporting a Creator in this instance that has the Merit to be nominated based on what they've done so if the entire nominee list for instance of Best Director is all women all black women let's say that's fantastic if",
            "start": 4006.44
        },
        {
            "text": "in this instance that has the Merit to be nominated based on what they've done so if the entire nominee list for instance of Best Director is all women all black women let's say that's fantastic if it's all white men and they did the best job then that's the way it's got to be like it has to be based on Merit this was the argument we were saying last year about Oscars So Black or Oscars So White rather with Will Smith for Concussion his performance that movie sucks like I don't even understand like what anyone I watch that movie sucks like the other people that like just just get him in there because he's black right I just I don't understand this particular argument I think I think it I think it counterbalances getting to a place of complete um equality through Merit because then everyone no one will have a problem with that it's it's respected as AOS because then someone will always question right well you got here based on you know why would you want that that particular Outlook",
            "start": 4046.36
        },
        {
            "text": "no one will have a problem with that it's it's respected as AOS because then someone will always question right well you got here based on you know why would you want that that particular Outlook you know what I mean I think it's dangerous and I think it actually maintains a concrete stance that you have to keep doing stuff like that as opposed to letting everything you know met out the way you know in this case the talent will allow I see both sides of it I see both sides of it because Hollywood is you know to play Devil's Advocate Hollywood is an old an old institution that's predominantly run by old white men um especially when it comes to the Academy Award voting right and there's a lot of that a lot of those articles came out last year of like a majority of the people that vote don't even work in Hollywood anymore they're just kind of grandfathered in because they worked maybe in the 50s or 60s and they're still voting for as many white men as humanly possible so I get that",
            "start": 4088.4
        },
        {
            "text": "even work in Hollywood anymore they're just kind of grandfathered in because they worked maybe in the 50s or 60s and they're still voting for as many white men as humanly possible so I get that there is there that's a valid argument and I also understand understand that you know not not all Progressive thinking happens in a manner that's Merit based right sometimes you have to kind of say hey there's this is happening and there's a level of shame that should go along with this and maybe you should broaden your broaden your uh your your thought processes when you you know if you're a filmmaker and you're directing something maybe or you're producing something maybe you should look a little bit cast a little bit of a wider net and maybe look tell the truth tell the truth yeah that's an Oscar-nominated performance right there I'm fine with that and again not there are there are a lot of amazing directors that are female and amazing DPs that are female and so you know hopefully this will",
            "start": 4124.44
        },
        {
            "text": "nominated performance right there I'm fine with that and again not there are there are a lot of amazing directors that are female and amazing DPs that are female and so you know hopefully this will cause a little bit of change or at least when people are thinking about you know you're funding a movie you're a producer and you're looking for that DP or looking for that director or you're a director looking for a DP cast a wider net here's what I'm saying this is an example of progressives turning on progressives there is no more Progressive industry in the United States than Hollywood and if they think that they're racist and sexist then there's a big fucking problem with the way they're going about businesses I guess that's kind of like my big takeaway not everything is racist and not everything is sexist or motivated by race or gender it's just not I don't care that I'm a white man I can say that I will continue to say by the way whatever I want as a white man but uh I just feel like",
            "start": 4162.04
        },
        {
            "text": "is sexist or motivated by race or gender it's just not I don't care that I'm a white man I can say that I will continue to say by the way whatever I want as a white man but uh I just feel like we're finding issues that don't need to be spoken like they're just they're just divisive issues that cause to bring us apart that cause us to argue that bring spotlights on things where like in in the dark corner somewhere where's like is this really a problem is this really a fucking problem you know I just so we have to have the equal amount of races represented in the Oscars the equal amount of gender 50% male 50% female there might be 10 females on the sidelines that that should have been nominated for something we got to get the males in there you know sure like and I'm like well okay that's just so strange to me it's it's interesting I I do see both sides though you look at these charts that are they're talking about like cinematography for instance there there has never been a female",
            "start": 4194.2
        },
        {
            "text": "just so strange to me it's it's interesting I I do see both sides though you look at these charts that are they're talking about like cinematography for instance there there has never been a female nominated for best DP now again you could argue that that's predominantly a man's job and men have just been doing that job for a very long time but I think that the whole point behind this is not necessarily say hey we need to go out there and find the one woman that shot a film and nominator I think it's more about encouraging women to get into that trade and and and to encourage men to recognize that and I I don't necessarily think there's anything wrong with that um I do it's unfortunate that the Oscars keeps taking the brunt for this because it's not the Oscars' job to retroactively go back like the Academy Award the Academy it's not their job to retroactively go back and say wait a minute Arrival you shouldn't have had a male DP you should put a female DP in there or give her a",
            "start": 4237.16
        },
        {
            "text": "go back like the Academy Award the Academy it's not their job to retroactively go back and say wait a minute Arrival you shouldn't have had a male DP you should put a female DP in there or give her a chance it's not their their job they just keep taking the shit of this every single time and I guarantee here's what's going to happen they're going to give another speech talking about how yes this is a problem we should change it and then next year it's just going to be something else but I guess also doesn't Hollywood realize that anything they say politically just doesn't matter at this point like yeah but but it's it's that it's that little echo chamber everything they everything they say everyone's like why are you even like we don't care what you think you know like they're they're the tip of the progressive spear I get that quick question is it more diverse this year like the that is that is a question I don't know I'd have to look at the categories I'm sure it is uh but I don't",
            "start": 4272.6
        },
        {
            "text": "tip of the progressive spear I get that quick question is it more diverse this year like the that is that is a question I don't know I'd have to look at the categories I'm sure it is uh but I don't know again this I'm sure this is going to this is probably going to take the this is probably going to take a lot of the the the space up in the in the argument uh or in the room for for whatever the newest controversy is I don't know I'd have to look at that I just just based on this article they talking specifically about women so again I don't know uh I think that's the last news story I have uh yes that's the last new here I have uh we do have a don't worry about the giant bat creature that was going to be in Batman v Superman you guys can go look at that see it you want to see it they they had there was supposed to be a giant bat creature in one of his uh uh in one of Bruce Wayne's dreams you can look at it right here this is what it was going to look like that almost made it into",
            "start": 4307.16
        },
        {
            "text": "they had there was supposed to be a giant bat creature in one of his uh uh in one of Bruce Wayne's dreams you can look at it right here this is what it was going to look like that almost made it into the movie remember remember when we were watching the movie in the the together and that scene when he gets lifted up by the bats out of the well and I started laughing you L you audibly were like what God and you started laughing it was so bad that movie sucks it's not good oh I really believe you know Greg's not the smartest man in the world but he's not a stupid man he's pretty smart hey stupid man feel like he's fucking with me and all of us with this movie like it's a long con you know like oh I I think there's no way he thinks this movie I think it's three I think one he enjoys fucking with everyone I think that there is a component of that I think two is that his he's he's invested so much into the DC world that he won't allow himself to be that disappointed with it you know what I",
            "start": 4345.36
        },
        {
            "text": "everyone I think that there is a component of that I think two is that his he's he's invested so much into the DC world that he won't allow himself to be that disappointed with it you know what I mean like he's he's indoctrinated into that world so so deep five times in the theater and then three there's just so weird like with friends and stuff and three he's just he's just a twisted idiot I don't know I don't know what else to say you know what I mean you think his plane's going to go down and he's going to end up on the island when he tries to come back I I think we would have known I think they landed already when that's technically LAX to Sydney this is SFO to Sydney so it's not the same route no I told him but I told him if that happens he has to tell us what the Smoke Monster is when he comes back uh it was not real the Smoke Monster yeah I thought it was like a me I thought it was like a defense mechanism that they could launch it was a machine it was all in purgatory so oh",
            "start": 4386.0
        },
        {
            "text": "when he comes back uh it was not real the Smoke Monster yeah I thought it was like a me I thought it was like a defense mechanism that they could launch it was a machine it was all in purgatory so oh like what we predicted after the first episode and then they lied about it for years and they're like oh by the way it's just it's exactly what you fucking thought did with the Wii U production do you remember there was a video when I was in college before it was like I'm going to see like um are we doing this video real quick yeah do whatever you got to do go find the video this is a cool uh upcoming this says Big Game Spot I assume that means Super Bowl spot because they're not all to use the word Super Bowl without getting sued right is that a thing is is that a thing I think that was the thing I remember hearing last year but they call they have to called the Big Game Spot super BS trademarked uh let's watch this real quick this is for the upcoming Ghost in the Shell film uh the reason",
            "start": 4421.76
        },
        {
            "text": "I remember hearing last year but they call they have to called the Big Game Spot super BS trademarked uh let's watch this real quick this is for the upcoming Ghost in the Shell film uh the reason I pulled this out was cuz I think it's really cool there they have a lot of shots in this that mirror the original Ghost in the Shell I think it's cool let's watch it real quick wait Poe funny this is going to be the uh hold on no there you go okay cool roll the clip give me a second roll the clip it did not save your life they stole it now I like this because you know this we got a lot of shit of course another big controversy of whitewashing which I think is a little more reasonable it's a little bit more reasonable since it's a Japanese woman fair enough uh but what I like about this is it it really when you think back to the original Ghost in the Shell there are a lot of touchstones in this that I think resonate with me there there they're clearly trying to at least do that movie Justice",
            "start": 4456.44
        },
        {
            "text": "really when you think back to the original Ghost in the Shell there are a lot of touchstones in this that I think resonate with me there there they're clearly trying to at least do that movie Justice they're not they're not trying to remake it into a new style you can hear for instance the music they're using is very similar to the music that was in Ghost in the Shell which is that sort of like Japanese chanting which is really really cool so I have high hopes for this um despite the controversy behind it I will be seeing this movie I love that shot right there that is so cool that's so can't see it they can't see it right oh they can't see it but that's so clearly taken just from that original the first scene goes but for the people saying nips and like banned she's in a skin suit you know what just you know what you want to ban us from Twitch just get it over with already no we won't do the show anymore okay the ban us we are true true story We Are The Number One Morning News Show",
            "start": 4534.28
        },
        {
            "text": "know what just you know what you want to ban us from Twitch just get it over with already no we won't do the show anymore okay the ban us we are true true story We Are The Number One Morning News Show on Twitch that's we're number one we are number one just like we're the number one PlayStation podcast Games podcast the we're the number one talk show we we I mean yeah sure we're the number one definitely talk show can't say show for sure can't say that not even close but we're close we're close uh hear me I said it's not even close Kevin bring up this next fun clip section this is not a clip this is a tweet I can't remember why I pulled this up give me a second oh no let's watch this what is this this oh this is the neighborhood fireworks fail this is this is for Mr. Yasman300 thank you so much for the tip let's watch this real quick give it to us give it hard hold it's not give it hard oh fuck that was amazing I can we see that again can we see that one more time America, fuck yeah!",
            "start": 4567.4
        },
        {
            "text": "for the tip let's watch this real quick give it to us give it hard hold it's not give it hard oh fuck that was amazing I can we see that again can we see that one more time America, fuck yeah! yeah dude God bless idiots man you guys make the world go around thank you thank you for having kids Uh Kevin do we have another clip we do indeed let's watch it uh this was submitted by someone now wait does this have Tears for Fears in it yeah well it's a cover of Tears for Fears okay cuz we might get dinged on that just is kind of it's too close we're going to stop it all right this is from Ted Yoder oh I've seen this this is awes that's awesome it's also on Facebook I think it's amazing it gets the melody as you'll see what is that instrument I have no idea you me to like skip around or no this is awesome I don't know why he's adding an extra two beats to yeah that's I notic that too yeah I don't I don't get that uh pause this Kevin everyone should go watch this this is",
            "start": 4608.28
        },
        {
            "text": "around or no this is awesome I don't know why he's adding an extra two beats to yeah that's I notic that too yeah I don't I don't get that uh pause this Kevin everyone should go watch this this is really really cool despite the fact that this guy doesn't understand a 44 time signature um which is annoying to me he just went 6'4 halfway in the middle for no reason yeah that I noticed that as well and I tried to listen to the I love people I fucking love Tears for Fears one of my favorite bands um and I was listened I'm like why I noticed that as well I'm glad you noticed that like there's an extra there's an extra half of a measure basically weird and but I I I but I went back and listen I'm like am I just missing the component of the composition no he just I don't think I am though he just adds I'm singing in my head as it goes and I'm behind a half a measure it's entirely possibly out of that in there so he doesn't get like some sort of copyright strike but I don't know that's really",
            "start": 4704.96
        },
        {
            "text": "adds I'm singing in my head as it goes and I'm behind a half a measure it's entirely possibly out of that in there so he doesn't get like some sort of copyright strike but I don't know that's really cool though either way that that whatever instrument that is is fucking awesome and that sounds right I'm sure he does his own more cover check out what is it Ted Yoder Ted Yoder Ted Yoder Ted Yoder check him out uh and the final clip for today which is not a clip it is a fun tweet from uh one Mr. Edgar Wright if you haven't heard of him you're living under a rock and delete your Twitter he says reminder this film is set in 2017 that's awesome that's The Running Man that's so awesome and that's very close to the world we're living in right now very close no not not literally true we're about a year away from Donald Trump making all of us fight each other to the death just why you to know that but I'll tell you one thing right now I'm getting in shape I'm going to look fucking awesome in that",
            "start": 4746.84
        },
        {
            "text": "away from Donald Trump making all of us fight each other to the death just why you to know that but I'll tell you one thing right now I'm getting in shape I'm going to look fucking awesome in that yellow jumpsuit yellow not a traditional good color looking color that people look look good in neither is the Quilted of it it just adds thickness to you you just powered through that statement oh my brain broke halfway through I was like here's whated I said yellow comma and then I thought Los Mates and then I went off on that tangent and then I heard quilting and not good and then I thought how fat I would look cuz I have this like I have this like level of dough around my stomach that I'm trying to get rid of that just won't go away and it's just like it's a fucking tire mine I'm not talking about yours literally the other day uh you know I'm still doing the Jiu-Jitsu pretty pretty pretty heavily these days height not really something we do they do there's two types of Jiu-Jitsu there's",
            "start": 4784.16
        },
        {
            "text": "about yours literally the other day uh you know I'm still doing the Jiu-Jitsu pretty pretty pretty heavily these days height not really something we do they do there's two types of Jiu-Jitsu there's gi and no-gi no-gi means you just don't wear the big thick uniform big thicko but you have to wear like more skin tight things that when you roll around people can't grab a hold of it so I I went and bought a rash guard the other day and what's called spats these are like leggings that women would wear right and and I walked out in and I took one look at myself and I'm like I'm not doing no-gi anymore I'm not I'm not doing this until I can actually get in shape because it went like this decent shoulders tiny little waist and then fat just a roll of fat it looked like it looked like I had blown up one of those inner tubes put it on and then stretched the rash guard over it and the guy at the store by the way nothing more intimidating than buying a skin tight rash guard in a fucking fight",
            "start": 4820.64
        },
        {
            "text": "blown up one of those inner tubes put it on and then stretched the rash guard over it and the guy at the store by the way nothing more intimidating than buying a skin tight rash guard in a fucking fight store where the guy that's working behind the desk has cauliflower ears in his jacket and he's just like he just shook his head at me he was like brother this is not your this is not your take this shit off purify it with fire and get the fuck out of my store uh Colin yeah you you know every day here on Colin & Greg Live oh we like to we like to give away something how do you enter to win this giveaway Colin well I'll tell you oh okay do you want to tell them no you tell I like when you tell them you're better at this than I am is it the same as it used to be no we have new rules because I've only done the show like four times since we we changed rules now are we're not giving away anything on Friday anymore now we're giving away well that I know I know we're giving so let me try let me",
            "start": 4857.24
        },
        {
            "text": "only done the show like four times since we we changed rules now are we're not giving away anything on Friday anymore now we're giving away well that I know I know we're giving so let me try let me try let me try let me try go ahead get in it code so we you were afraid of getting our garbage for some reason yeah we just started giving away garbage 15 weeks late you would get it maybe sometime in 2018 so we give away we have we have great access to PR we do at the devs and Publishers we get a bunch of codes uh we give one away a day that frees us up from having to ship things that you don't want and you get more prizes out of us as well and the way you used to be able to do it is you have to be in the chat or you can be a subscriber or a Patreon now you can be yes any of these way see I knew it all yeah you can be a you can be here's the deal you can be in the chat you can be a subscriber of us if you're a subscriber and you're not in the chat you're not watching you're automatically",
            "start": 4899.88
        },
        {
            "text": "it all yeah you can be a you can be here's the deal you can be in the chat you can be a subscriber of us if you're a subscriber and you're not in the chat you're not watching you're automatically enter to win you can also support us at the $ above tiers on either of my Patreons so Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames which by the way you used to be able to if you're a Patreon supporter you can see Kinda Funny Live too I don't know when when is that going live Kevin for everyone uh on on the sixth so you have five more days to see that or you can wait five days and and four more days to see that or you can just wait four days no you're right wait no no no I'm right right four doesn't fucking matter doesn't matter um so that in mind we will be giving away today 64 ROM the game Kevin can you play the trailer for this while we talk about it oh fuck yeah that's a good call you know what I like some good voices in that game you brought up the uh The Showdown the",
            "start": 4934.8
        },
        {
            "text": "ROM the game Kevin can you play the trailer for this while we talk about it oh fuck yeah that's a good call you know what I like some good voices in that game you brought up the uh The Showdown the Showcase Showdown y remember how they'd always be like this and what's behind door number one new car yeah the music's awesome it's never changed it then for the longest time for all I know it's still the same music and they just they're just reanimating Bob Barker behind Drew Carey the entire time like I'm still bar Drew Carey ate Bob Barker in order to uh to get assume his soul heated his soul uh so we're giving away this one L to one lucky winner and today's winner comes from Twitch the random generator said Twitch and it's MelorraYY you'll be getting a Steam key uh game key for this game so it was sent M like just moments ago check your messages on Twitch if you don't get this if you're not watching the show right now you're like what how did I why did I get this game because",
            "start": 4973.44
        },
        {
            "text": "game so it was sent M like just moments ago check your messages on Twitch if you don't get this if you're not watching the show right now you're like what how did I why did I get this game because we love you that's why P.S. We love you XOXO also a great podcast uh that's it Colin should we talk to some people in the chat let's do it quick three and three as I used to like to say GL we'll do three regular questions three sub questions so let's queue up your questions comments and concerns and we'll talk to you briefly we'll read some subs and then I'm going go eat a fucking dang three and three three questions for non Subs question we did that all the time three or five and five yeah we did I remember five and five but never three also Chuck Woolery two and two who was he from Love Connection Love Connection who hosts Wheel of Fortune Pat Sajak Pat Sajak still host it Pat Sajak still as far as I understand uh uh I gotta gotta be honest maybe we should do a topic on this ranking",
            "start": 5022.76
        },
        {
            "text": "connection who hosts Wheel of Fortune Pat Sajak Pat Sajak still host it Pat Sajak still as far as I understand uh uh I gotta gotta be honest maybe we should do a topic on this ranking the the the the game show hosts because I really feel like I feel like Trebek has to be on top depends here's the thing about Alex here's here's the thing about Alex maybe we should save this for GoG next week I just want to say this one thing about you I should do an exclusive episode of GoG for next month and just raking this the thing that bothers me about Alex Trebek is that he acts as he acts as if he wrote all the questions and knows all the answers he doesn't fucking know shit he doesn't know anything that fucking reading uh autocue I just like how confident like he's like a ass I'm like come on Alex you didn't oh I'm sorry you have to all he has to do is absorbed a bunch of information that's right you're wrong or you have to fucking form that for some fucking reason it has to be in the form of",
            "start": 5063.44
        },
        {
            "text": "you didn't oh I'm sorry you have to all he has to do is absorb a bunch of information that's right you're wrong or you have to fucking form that for some fucking reason it has to be in the form of a question that's all he ever says oh I'm sorry that's not that is incorrect that's correct in the form of a question what is Egypt nailed it you're right an fucking you know they should you know what they should have done more of though man I'll tell you the best skit the best skit on Saturday Night Live was when they did the the Jeopardy parodies those are always great and Norm Macdonald as Burt Reynolds nailed it Norm Macdonald then he went off the deep end he's crazy I heard has a lot of cocaine uh cocaine I don't know for sure I just made that up it's fine it's 017 Kevin Kevin those Los Matates another question did we take a question yet no we we didn't take let's go into it uh Four Carats uh recommends that we watch The Expanse um which I've heard good things about it's based on a book series",
            "start": 5107.4
        },
        {
            "text": "question did we take a question yet no we we didn't take let's go into it uh Four Carats uh recommends that we watch The Expanse um which I've heard good things about it's based on a book series I actually downloaded the first book and I read a little bit of it but I hadn't knock it very far and it's a Sci-Fi uh book uh thank you for the recommendation I'll add that to the list I still have to get through uh well The Path is back which I fucking love so I have to get through that Colony's On which I have to get through that I got to get through The Crown etc etc etc some good documentaries Crown Your Love tomorrow The Circus the show I told you all to watch on Showtime is releasing a full documentary on Showtime about Donald Trump um and his the upset basically uh and it's gonna be fucking awesome I can't wait to see it those guys are John Heilemann you're G fascinating thanks for retweeting me that one time Realore R 13 says Colin or Nick what were your thoughts on Arnold when he was",
            "start": 5152.44
        },
        {
            "text": "awesome I can't wait to see it those guys are John Heilemann you're G fascinating thanks for retweeting me that one time Realore R 13 says Colin or Nick what were your thoughts on Arnold when he was governor of California was he any good at it I didn't live here uh I was an intern here when Gray Davis was recalled and by no that's not true actually I came back no I was I was here for two years or three years when he was I don't remember it being anything I remember the 010 election with Jerry Brown and Meg Whitman U I voted for Meg Whitman obviously uh so I I I guess it was fine I don't know I don't remember California kind of kind of a fucking mess I was not really paying attention I know at some point he was he was governor and it was hilarious that's all I know called him the Governator what what's that it's funny if you look at people's diplomas that graduated from UC schools during that time it's Arnold Schwarzenegger's signature on fucking when when was he Governor 004 005 still",
            "start": 5191.96
        },
        {
            "text": "what what's that it's funny if you look at people's diplomas that graduated from UC schools during that time it's Arnold Schwarzenegger's signature on fucking when when was he Governor 004 005 still gray cuz I graduated in 00 that would have been dope though yeah it's funny when I I've seen that a few times I that's awesome uh Conative says Colin Super Bowl score prediction Falcons 31 Patriots 17 Falcons 31 Patriots 17 bold bold it's going to be a very I think it can be a very high-scoring game we'll see what happens if that doesn't really reflect my prediction of course cool let's get sub only mode uh you oh you can do it there I think I can do it watch sub only modes I think is how you do it with the Z is that right sub please no I don't think that's going to do it is that going to do it Sub Station no I don't know that is that working that's not going to do it either subscribe to me spelled wrong Jesus Christ the hell does that say Sans it are we in subbing yet oh know let's just",
            "start": 5231.4
        },
        {
            "text": "it Sub Station no I don't know that is that working that's not going to do it either subscribe to me spelled wrong Jesus Christ the hell does that say Sans it are we in subbing yet oh know let's just take sub question all right let's go Justin Time says Colin I watched Arrival last night it was fucking gold it really was that's a great movie fucking awesome very deep movie anyone who doesn't like that movie is it's because they're too superficial and not smart enough to understand it it is a I mean I I think I do think it is it is surprisingly deep I don't dislike the movie you said you ha Tim and you you were like it's too dark we couldn't see the yeah no the the lighting is terrible and like I I think that it was shot dark so that that one scene with all the light could be more shocking it was an artistic choice for sure it was a dumb Choice also the audio was like the hell is going on with the sound I don't know nothing can hold a candle of the audio from from Interstellar but that's",
            "start": 5285.68
        },
        {
            "text": "was an artistic choice for sure it was a dumb Choice also the audio was like the hell is going on with the sound I don't know nothing can hold a candle of the audio from from Interstellar but that's where they're talk they're talking like this and then also like with that the fucking organ music you're like why is it so fucking loud and then an so loud it was so loud when I saw an IMAX that my wife covered her fucking ears every time there was a song she was like why is it this loud I watched get on Amazon and I fucking you not I had to ride the control cuz my wife was asleep and I was like I can't you can't hear any of the dialogue but then when the music sets it it is definite you want to choose one uh another question yeah we need two more uh guys have you ever dealt with head injuries or known anyone who has dealt with them if so how long did it take to for them to recover I've never dealt with a head injury I've had concussions but I don't know that if that's what you're talking",
            "start": 5337.4
        },
        {
            "text": "or known anyone who has dealt with them if so how long did it take to for them to recover I've never dealt with a head injury I've had concussions but I don't know that if that's what you're talking about yeah I mean that's a head injury yeah I mean my the problem is recovery I don't think there's a lot of information out there you may you may never recover you don't know head injuries are very interesting and uh as far as I know not very well researched like there's a lot of research coming out about about concussions obviously the movie Concussion all that stuff tell the truth tell the truth but you just don't know be careful with your Noggin be careful with your Noggin final question we can get out of sub mode now comes from Mr. Manager 08 3 says Colin I'm thinking of getting a drum kit for my daughter to learn on or my daughters to learn on what do I need to look in uh look into for a good basic kit uh that's the thing get a basic kit so uh there's a lot of um in music generally uh",
            "start": 5390.28
        },
        {
            "text": "for my daughter to learn on or my daughters to learn on what do I need to look in uh look into for a good basic kit uh that's the thing get a basic kit so uh there's a lot of um in music generally uh a musicianship there's a lot of a lot put onto the what you're playing on um so like you know a good drummer will play on a good kit you know I like playing on Tama for instance um but my first drum kit was a Percussion Plus drum set which you would never see in a band use or anything like that it's it was a 44005 $500 five piece kit um snare drum low Tom High Tom and floor tom and bass drum um and then I had a high hat and a like a crash ride and a crash cymbal or something like that uh all told $700 really basic Sabian A1 symbols when I was a kid and all that kind of stuff so get them something basic and see if they're good and they can and and they can play on that it's perfectly reasonable you're not going to notice much of a difference and then if they're good then you can really",
            "start": 5424.92
        },
        {
            "text": "basic and see if they're good and they can and and they can play on that it's perfectly reasonable you're not going to notice much of a difference and then if they're good then you can really start investing in in in expensive equipment um for instance like I invested in a piccolo snare when I was when I was a teenager and and all sorts of other things like that um you know double base pedals if that's what you're into better symbols which will get better resonance stuff like that but start basic and start cheap and then work your way up I just gave my first drum kit to my nephews um in Virginia and um glad I'm sure Dan's elated at that oh it's Dana my sister's my sister and she's through the roof huh I'm sure uh but uh yeah and that was cool it was a hand-me-down and now they can you know one of them is taking drum lessons and now they can figure out on this kit if they want if they can play and then we'll and then I'll invest and buy them a like a Tama or something like that or or a",
            "start": 5471.08
        },
        {
            "text": "one of them is taking drum lessons and now they can figure out on this kit if they want if they can play and then we'll and then I'll invest and buy them a like a Tama or something like that or or a Pearl or you know whatever and and and then if they like that then you work your way up to the custom kits like Orange County and stuff like that but you don't need to you don't need to jump up that far I hate when people think because they have nice instruments they can play right um I've seen uh people play on terrible drum kits uh that are way better than the person playing on the Orange County sure so keep that in mind uh despite having called tips we have one last tip which is from Gifted Dime 63 says hey guys I'm a brand I'm brand new to subscribing to you but keep up the good work excellent job I try to watch you guys every day PS 0 minute call was right was amazing thought you would like that to stroke your ego a little bit I do I appreciate that all right I'll before we go I'll read",
            "start": 5507.24
        },
        {
            "text": "job I try to watch you guys every day PS 0 minute call was right was amazing thought you would like that to stroke your ego a little bit I do I appreciate that all right I'll before we go I'll read tips if I read your name you are a new sub I'm sorry T sub if I if you read your name you're a new sub or resub we appreciate you very much here on twitch.tv/kindafunnygames Static X 55 a reference of course to Wayne Static and Static X the early late 90s early 000s metal band MG Pepus Jeffrey with 1F Patty Santa Surreal Gaming One Lot Boy 16 Grumpy Man see this is what I'm talking about that's a good one now we're getting back to where remember you need to you need for Placenta Milkshake you need to strive for Walk and Talking Stephen Hawking okay Grumpy Manity is getting there Quantum Arbiter Rayman SD91 Benefactor TV M Lopez 70 says I love you thank you Mandarin Carnage Sith says seven months hype Elastic Corn Untouchables Haduken good Untouchables I like that Working Gaming uh subbed",
            "start": 5542.08
        },
        {
            "text": "Rayman SD91 Benefactor TV M Lopez 70 says I love you thank you Mandarin Carnage Sith says seven months hype Elastic Corn Untouchables Haduken good Untouchables I like that Working Gaming uh subbed Sup P Boy said four months strong thanks for keeping me going guys you're very welcome Emperor John 117 Johnny NYK PLYR Gygo Official Modern Monarch Organic Produce I like that one Spectacular PLYR Pitt Injury Pit Injury Monster Bard Billy Bob McAfee Billy Bog MC I think I don't know Shreder John Bob Stab Scummy Assassin E94 Mr. Jib Jabber Barb Ratty Teddy Tag says 15 months well spent keep up the great content guys Dave Cowl says thanks for everything you guys do love all your content hope to see you kind of Jesus Christ Kinda Funny Live Three love from Ireland Dave Cowl super cool Tony says Platinum Gravity Rush last night there's a trophy called",
            "start": 5584.52
        },
        {
            "text": "guys do love all your content hope to see you kind of Jesus Christ Kinda Funny Live Three love from Ireland Dave Cowl super cool Tony says Platinum Gravity Rush last night there's a trophy called Event Horizon signed Colin and play it Gifted Dime 63 Drew Wizzle Humming Tiger Cod Sturb Kiwi Jim says 1 months it's 4 a.m. and as saf just woken I don't know what the fucking you're just saying Marco Gaming Pra 150 Little Dick Momes quick there it is now we're talking there it is come on people know your audience I Ser47 Error can't be shown Paul Merge FC Hagger Osta I think it says Nick you big Beautiful Bastard how do you groom that magnificent beard carefully CPRAM Metalfingers One and Fear Nick G thank you so much for subscribing here on Twitch at Kinda Funny Games Nick and I will be back tomorrow for more Colin and Greg Live right here on twitch.tv/kindafunnygames uh in the meantime you can follow us on Twitter KindaFunnyVids I'm at NoTaxation Nick is at Nick_Scarpino Kevin is it Kinda Funny Kevin",
            "start": 5642.84
        },
        {
            "text": "for more Colin and Greg Live right here on twitch.tv/kindafunnygames uh in the meantime you can follow us on Twitter KindaFunnyVids I'm at NoTaxation Nick is at Nick_Scarpino Kevin is it Kinda Funny Kevin uh let's go to Los Matates I need those onions that have been put in vinegar for a little while and then I put them on the burrito with the salt cut the feed.",
            "start": 5694.92
        }
    ]
}