{
    "id": 2424,
    "video_id": "h7FkCkh6oo4",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Kevin Coello"
    ],
    "title": "Nintendo Switch Unboxing - Kinda Funny Reacts",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1487858407,
    "duration": 582,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Kinda Funny Reacts as we unbox the Nintendo Switch. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. It's been a long time coming. How does this feel? You've been building this, finally gave it to us, gave it to you indeed. Oh my God, I'm so happy about this. I, you know, it's been a long legacy of me and Nintendo, a lot of thing, a lot of ups, a lot of downs, a lot more downs, but then a lot of the Switch stuff started happening and most of it's been good news. I've been very excited about it. Got to go to the Nintendo event, you know, wasn't too thrilled with the the stream that happened, but then got my hands on and I'm like, all right, it's still still what I want. I'm still being hopeful about this. We talked about in the Morning Show, right? That I feel like I feel like Nick was talking about the fact that for Nintendo Switch, right? The swing of opinion, it's positive. It's not as positive when we first saw the trailer, but it's also not incredibly",
            "start": 0.12
        },
        {
            "text": "like I feel like Nick was talking about the fact that for Nintendo Switch, right? The swing of opinion, it's positive. It's not as positive when we first saw the trailer, but it's also not incredibly negative. It was just a little boop and then we're fine. It's like, okay, cool, 'cause yeah, it was a bad presentation, but everybody's, I've played it, I've held it, I'm super excited to get it and play Zelda. Yep. And now having here, I am even more excited than I thought. I love the box. I love clean it is. Me and you obviously, real real big fans of video game boxes. Obviously, the PlayStation box, that sexy ass all blue, we'll never forget that, you know? But this, I like it. I like the size. I like that it's nicely in the middle. Pop Nintendo, they know what they know what they do. I love them going going back to the old school logo. What's up? What up? So what what I really appreciate though is that it's in between a console size box and a handheld size box, just like the Nintendo Switch is. You can kind of do both.",
            "start": 34.72
        },
        {
            "text": "old school logo. What's up? What up? So what what I really appreciate though is that it's in between a console size box and a handheld size box, just like the Nintendo Switch is. You can kind of do both. You can system switch between the two. So I want to been waiting to actually do this. Well, look, you got all the different ways to play up then like then I'm a big fan of then like over here you got all the ones to play over there. This got got serial numbers, you got your things. All right, do remember remember old console boxes where it's just like you turn it around, it was just like all the different screen, all these games. Game Switch isn't doing that. All right, all right, we're opening up here. Oh, you got it. You got it upside down. We got we got the rules. Um, there you go. Plug it in, set it up. It's all you need to do. If you need help, you can go to, you know, websites for the dumb kids. This for the dumb kids. Great dumb kids. Come on, just get in there and figured out, kids. Let's see what's up. Oh, oh, that's",
            "start": 76.52
        },
        {
            "text": "need to do. If you need help, you can go to, you know, websites for the dumb kids. This for the dumb kids. Great dumb kids. Come on, just get in there and figured out, kids. Let's see what's up. Oh, oh, that's even better. Yeah, that fits way better. You should have started with that. I mean, you just went straight in. I thought you were going to, but then you didn't. I mean, let's get the fun stuff out of the way first, right? So hold on your Joy-Con. Super fun thing. We got the right Joy-Con, right? We got the yeah, and you can, you know, buy these individually for obscene prices or you can buy them together for even more prices. Yeah, if you're doing it though, you're buying the blue, right? I already bought the blue Kinda Funny blue. Them things pre they. Oh, I cannot wait. I haven't seen one with two blues on it. Yeah, but I've Photoshopped it and it's real pretty. It does it does seem really pretty. I've been waiting for this. I've been on NeoGAF like every day now, reading every single week, every single thing of people playing this. Uh,",
            "start": 120.24
        },
        {
            "text": "it and it's real pretty. It does it does seem really pretty. I've been waiting for this. I've been on NeoGAF like every day now, reading every single week, every single thing of people playing this. Uh, it feels good to have them back in my hands. It does. You want to touch them? Sure. I do want to touch them. I love the feel of brand new controllers. Yeah, here Greg, be happy. I'll let you. No, no, please. This is you. This is you. You kidding me? Thank you. That was as easy as it looked. Now now you're in now you're in handheld mode. You're in handheld mode for the Nintendo Switch. Oh my God, this is going to be the rest of our lives, Greg. Yeah, this every flight now, every Mario Kart on the plane. Can't we? Oh my God, I can just imagine. All right, so let me hold it. Go for it. See, now this is the first time I've held it where doesn't have the giant lock on the top. They're afraid I'm going to run away at RTX Sydney with it, which I would have done. I don't care. Your country doesn't scare me. Okay, we get the little, you know,",
            "start": 165.8
        },
        {
            "text": "doesn't have the giant lock on the top. They're afraid I'm going to run away at RTX Sydney with it, which I would have done. I don't care. Your country doesn't scare me. Okay, we get the little, you know, baby butt. Your Nintendo health and safety guidelines. Don't really care about that. We're healthy and safety. We already know all that. Oh, and then here we got the next main event, the Dock. The Dock. The Nintendo Switch Dock. Feels kind of chintzy. Yeah, doesn't really need to be an impressive thing, but let it in. Hold on. I wanted I'm using the thing for the first time. I've never used the I've never used a kickstand so that when you take it take the little uh the Joy-Cons out. Tabletop Mode, as they call it. Oh, Tabletop. Yes. Yeah, so here, let's Kev, camera switch. You do it. It's going in. It's all you. No, see, when I put it in, this would be the little like figured out the puzzle noise. There we go. Is it in? Did it click? Yeah. Okay, that's it. It's so seamless. I've never done so that's the thing. I mean, we keep talking",
            "start": 215.72
        },
        {
            "text": "when I put it in, this would be the little like figured out the puzzle noise. There we go. Is it in? Did it click? Yeah. Okay, that's it. It's so seamless. I've never done so that's the thing. I mean, we keep talking about this and a lot of people in the comments are like, why are you that impressed? It's like, because it's impressive when you you're playing handheld mode. You slip it in. Boom. It's on. I have a whole bunch of controller chargers at home for my Xbox One and PS4 and every time I go there, it's **** trying to find. No, man, this just slips right in. It's like she's helping you, you know? She is helping me. She's helping me get in, you know what I'm saying? Okay, so here we have the Joy-Con Grip. Ah, now this is the one that you lied to everybody and said this was as good as a Pro Controller. I didn't know. I said it was totally fine and then I I stand by that. I do. You're crazy, man. Now again, I now I get to play it. I I got my Pro Controller 'cause I I'm not okay with it. These little baby buttons. Uh-uh. I was so",
            "start": 267.32
        },
        {
            "text": "said it was totally fine and then I I stand by that. I do. You're crazy, man. Now again, I now I get to play it. I I got my Pro Controller 'cause I I'm not okay with it. These little baby buttons. Uh-uh. I was so desperate for a Pro Controller. I ordered it from Best Buy. That's not a desperate move, but I love Amazon. I do too. But they **** up with the Pro Controllers. I'm going to be real. Yeah, this feels like a real controller. See, I feel like my hands are so I'm I'm going to get used to it. It's a baby controller. I'm telling you that, Greg. It's a real controller, but it's a baby controller. Okay, wow. Okay, still got the Pro Touch. Touchy subject for Tim. I important. Oh, it's very touchy. But the uh important thing to note about this is that it does not charge your Joy-Cons, right? That's a there is the Joy-Con Charge Grip. Yeah, that is a separate thing you can buy for $30. Sure, of course. Yeah, accessories other. I mean, like this is like I I don't like it, but I mean, like I think that it's totally fine as a control.",
            "start": 307.92
        },
        {
            "text": "grip. Yeah, that is a separate thing you can buy for $30. Sure, of course. Yeah, accessories other. I mean, like this is like I I don't like it, but I mean, like I think that it's totally fine as a control. For me, the problem is I'm not I have no problem, Kevin, with the baby buttons, as you call them, up here. How small they are, right? 'Cause like, yeah, Kevin, can you grab my backpack and bring you leave it in the shot? Go grab my backpack. I want the Vita for comparison to baby button sizes. Like it's the fact that my hands feel super close together. My fingers and Game Boy Advance SP. Not that bad. But I mean, just I guess compared to how controllers usually feel for me. Let's do this. Do this. Mhm. Bust out that old PlayStation Vita. All reliable Vita, we call her. So here here she comes. We got an HDMI cable. Yeah, which, you know, thankfully is now standard with with consoles. I remember back in the day it wasn't. I think, well, they're clear, so it's turn. They're probably the same size. The Vita even looks like it might be smaller. No.",
            "start": 348.04
        },
        {
            "text": "is now standard with with consoles. I remember back in the day it wasn't. I think, well, they're clear, so it's turn. They're probably the same size. The Vita even looks like it might be smaller. No, the Vita is smaller. Okay, the Vita is even like is a baby's baby, you know, one of them dumb yeah, babies, babies, 2017. God lord. Um, here. Oh, we have the I don't know why there's only one of them. No, there's two. We have I don't know what these are called, but they're things that go on the it's the the wrist for the Joy-Con now. So check this out, Greg. You know, you see those people playing them video games and they're all like, I'm at the cool party on the rooftop. I want to play games and they're they're playing like like this. Can I get yeah, you know, they're just like, oh, to make it a little a bit more comfortable. Here you go. Nobody **** play this way, please. There's yours. Please buy real controllers. Don't play this way. Slide it in. Slide slide these little Ds in there. You go. I switched it up. You might remember",
            "start": 390.08
        },
        {
            "text": "here you go. Nobody **** play this way, please. There's yours. Please buy real controllers. Don't play this way. Slide it in. Slide slide these little Ds in there. You go. I switched it up. You might remember this hold from when I beat Hideo Kojima at a Switch Let's Play on youtube.com/KindaFunnyGames. I'm having I'm having trouble here. Hit my why am I having so much trouble? I'm one of them dumb kids that I was talking so much **** about. Let me see it. Are you doing it wrong? Probably doing it wrong. Doing 'cause in the plus we we both them dumb kids. You're supposed to be so easy, Nintendo. Maybe they we're not snapping enough. This is like what it feels like to have kids. Lock on. Is that what it is? No, no, that's when it's locked. This is why you don't do live presentations. Your not isn't all the way on either though. The taking up my point is once it's on, it makes it a little bit more comfortable to be able to use the shoulder buttons. But like, let's be real, it it doesn't even matter whether or not we",
            "start": 434.44
        },
        {
            "text": "though the taking up my point is once it's on, it makes it a little bit more comfortable to be able to use the shoulder buttons. But like, let's be real, it it doesn't even matter whether or not we get these on. We're never playing like that. Yeah, except for maybe Snipperclips. Cut it out together, which is the best looking game on. Oh, there's a lot you have to turn on and off. Yeah, that's what I was saying. See, um, here we have the charger. USB-C. That **** charges fast. Someone jammed this one. So this charges this guy. Yes. Okay. USB-C, AKA Thunderbolt 4, if I remember correctly. It's real good. Real fast. That's it. That's all that comes in the box. It's all you need. That's all you need to play with. Need nice. Yeah, yeah, this is dumb. This should be easier to come on and off. No, it's not that bad once you know what you're doing. Even this one, Kevin, unlocked. Not moving. Not doing his thing. I took I just put that one on. This one stuck. I'm aware you just put this one on, Kevin, and I'm saying I'm still having",
            "start": 493.4
        },
        {
            "text": "what you're doing. Even this one, Kevin, unlocked. Not moving. Not doing his thing. I took I just put that one on. This one stuck. I'm aware you just put this one on, Kevin, and I'm saying I'm still having trouble now getting it off. That's what I'm saying. It's still still not great. That's it, ladies and gentlemen. This is the Nintendo Switch and us bickering with each other. What do you think of it? Let us know in the comments below. Then of course, keep it tuned here to youtube.com/KindaFunnyGames where we're going to put putting up all signs of content talking about the Gamescast, talking about that Zelda Let's Play stuff. Arms stuff will be happening too. But until next time, no, it's been our pleasure to serve you.",
            "start": 547.28
        }
    ]
}