{
    "id": 2437,
    "video_id": "hgoL1MD0aEE",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Kevin Coello"
    ],
    "title": "Zelda And Switch Impressions - Kinda Funny Morning Show 02.27.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1488229366,
    "duration": 4665,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to the Kinda Funny Morning Show. Kevin, here's my question because I was thrown off from the beginning. I missed a few, the last Morning Show I did. I thought the new thing was going to be lights off, you do the countdown to the mics going live, then you're going to bring up the lights when we were live and we would all start talking. You wouldn't have to point and do the snap and the point anymore. No, that was just your stupid idea. That was a really good idea that I think it works. Sounds sounds way better than what you... Thank you. What was wrong with what I did? Cause the way you do it is just like, it's never consistent. I feel like the lights going up, yeah, orchestra roar into life. I feel like we'd be like, all right, cool, now we're in the headspace of put on a great morning show. Yeah, now it's just kind of, we're sitting there waiting, we don't know when to start yapping way. Yeah, why? We know when to start, but I just, I feel like from the moment, moment you hit the buttons, you do",
            "start": 1.67
        },
        {
            "text": "yeah, now it's just kind of, we're sitting there waiting, we don't know when to start yapping way. Yeah, why? We know when to start, but I just, I feel like from the moment, moment you hit the buttons, you do the turn in the clap thing, the turn in the snap thing, there's still of us just staring like an idiot at at the camera. The lights would be perfect. I motion that the lights be the new signal for going live. Like normally it's lights, camera, action, but we're, we want camera lights to trigger the action. True. 100%. See, and right now Kenzo 989 agrees with me in the chat. Yeah, but he's crazy. Can I, can you second my motion? I mean, I'm down to try it. The motion carries. My thing is, I, we have the votes, we have the vote. We need to change something about this, 'cause this doesn't work. Why doesn't it work? I don't, it works totally fine. There is TBY Studio says Greg is right, Kevin is being stubborn and wants his ways to, it wants to stay in his own ways. I'm asking you to start with me, Kevin, to join me on this.",
            "start": 47.48
        },
        {
            "text": "it works totally fine. There is TBY Studio says Greg is right, Kevin is being stubborn and wants his ways to, it wants to stay in his own ways. I'm asking you to start with me, Kevin, to join me on this. Tomorrow, I'm not on the show tomorrow. Yep, you make sure it happens. I don't happen tomorrow. Not going to happen. I'll try to make it happen tomorrow, but there, that moment of silence is like, just hold for a second before the camera starts going. I understand, but I'm saying if you want to have a countdown for the camera, be like, well, that I can't see that. What do you mean you can't? Not over here. He just looks like you have your paw up. I can't see what number that is. I'm looking at the camera. I need to address the camera. What I'm saying is that is why I snap. But I'm, but I know, but again, what I'm saying is this is what you do. Like, there's definitely someone watches this show, correct? It has to start where I'm like this and I'm like, what's up everybody? For a fraction of a second. Sure. For a fraction of",
            "start": 90.04
        },
        {
            "text": "is this is what you do. Like, there's definitely someone watches this show, correct? It has to start where I'm like this and I'm like, what's up everybody? For a fraction of a second. Sure. For a fraction of a second, just give it. Time is money, Kevin. The next time, time is money and you've wasted a lot of it here today, Kevin. The next time I host this show, which I believe is Wednesday, I want to do like, do it my way just to try it. All right. And then I have to explain it to all these other dingos, dingo, all the other ones. You're, you're, you're competent staff, comp you. Who the hell do are we getting new employees? Competence staff. You know what I mean? So you have to explain it to the voices in your head. What are you even talking about? We move off. What's up everybody? Welcome to the Kinda Funny Morning Show for Monday, February 27th. One of the last days of February. This month, it comes, it goes so fast. Just like you, just like me. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. Let Tim host it.",
            "start": 127.96
        },
        {
            "text": "Monday, February 27th. One of the last days of February. This month, it comes, it goes so fast. Just like you, just like me. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. Let Tim host it. Feels like I haven't been here in a year and a half. I know, right? Veg. So much travel adds years to you. You killed it at D.I.C.E. You did damn good. Thank you to the chat. I was watching backstage, of course, chiming in on the, the people watching here on Twitch.tv/KindaFunnyGames. D.I.C.E. was a lot of fun. I'm sorry the crowd wasn't more into it. I learned something. That's my, I learned that I, I, I took it for granted that we have such great audiences everywhere we go. Yeah, we go to RTX. This is a solid point. We go to PAX and I forget, of course, that like, and even Game Awards, I forget that there's so many fans in the audience that when I went there and these were buttoned up developers, people who are there, you know, being respectful, probably don't even want to be there. Just we cost a lot, so they have to go. I was",
            "start": 167.48
        },
        {
            "text": "audience that when I went there and these were buttoned up developers, people who are there, you know, being respectful, probably don't even want to be there. Just we cost a lot, so they have to go. I was like, ah, I didn't psych the crowd up. If I get a chance next year, I guarantee you there will be ad-lib Greg Miller in the beginning screaming, yelling, jumping off there, grabbing Shuhei, shaking him, pushing him up, punching Neil Druckmann, right? Eny, right? You just got to come. Exactly. That's a, that's a solid point. And so it was, it was a different, it was a different energy. You're fancy gentleman now, hosting fancy Video Game Awards. I like it. You're stepping up, you're evolving. I try. I'm trying to, trying to take this thing somewhere. I, I really enjoyed that it was you and Chobot. It was like a, a reunion party. And I also loved that all the pictures of you guys were with the backdrop with the IG and stuff. I was like, something about this just feels right. Yeah, no, I like, I like the fact that the one thing, the takeaway",
            "start": 209.28
        },
        {
            "text": "loved that all the pictures of you guys were with the backdrop with the IG and stuff. I was like, something about this just feels right. Yeah, no, I like, I like the fact that the one thing, the takeaway from it was that, uh, I in the room, I thought we were doing fine, but then it was when I was looking at the chat, which I knew was a dangerous situation, but it was our chat, which is overall me positive. They, they were like, the crowd. I'm like, I guess the crowd isn't that great. And then it got to me. I'm like, are we doing okay? Here's the takeaways. Yes, chat was positive. Yes, reaction on the internet was actually pretty positive. Usual Greg Miller is a funny thing. I understand. **** you, I'm popular, you're not. And then everybody who talked to us afterwards went out of their way to say they enjoyed it. And not just though, good job, but like, oh, this was so much better than last year. That the, which I love, because I, I always bring this back. It's one of my greatest moments in my life was after the Final Fantasy",
            "start": 251.16
        },
        {
            "text": "and not just though, good job, but like, oh, this was so much better than last year. That the, which I love, because I, I always bring this back. It's one of my greatest moments in my life was after the Final Fantasy event. We went to that party and Phil Spencer came up to me. I was like, you guys did really good. Yeah, like, I've seen a whole bunch of these things, but like, you guys are obviously, we're not reading off prompters, have a chemistry together. And I was like, and that was, that was the big takeaway that a lot of the, the feedback I got from a lot of people were that our best parts were when we had living people were turning to look at the thing. And so it needs to be more, I think, like Final Fantasy. But now that not taking away from the fact that D. Duer wrote excellent jokes. Yes, exactly. All that amazing, amazing. But, but I will say from a production standpoint, and this is why people are always like, like, oh man, Kinda Funny Live 2 took so long to edit. And now once you see it, very few people",
            "start": 283.56
        },
        {
            "text": "amazing, amazing. But, but I will say from a production standpoint, and this is why people are always like, like, oh man, Kinda Funny Live 2 took so long to edit. And now once you see it, very few people are giving me ****. But a big part of that is I want the energy of the room to come across on video, which means I need to get all the right audio clips where you hear the audience actually reacting. So the problem there is they need to mic up the audience, which is something we need to do this year, Kinda Funny Live 3, because we haven't done that before. But, uh, that, that was the problem is like, even if there was in the room an energy, it doesn't come across because they're trying to get the what people saying, the energy on there. And you see this in a lot of live concert videos when you see people's, uh, like DVD specials of their concerts. And, and it's hella awkward, 'cause it'll be Linkin Park and they're like, uh, how you doing? How you doing? And it's just like, you hear, but it's like when they do the whole",
            "start": 319.6
        },
        {
            "text": "DVD specials of their concerts and, and it's hella awkward, 'cause it'll be Linkin Park and they're like, uh, how you doing? How you doing? And it's just like, you hear, but it's like when they do the whole singing song where they stop singing for a second, so I let other people sing and then it's just dead silent awkward. That's what you faced. Then stayed in Vegas for multiple days to eat too much, drink too much and gamble. Mhm. With Jen. It was great. Good times. But most importantly, it's great seeing Jen. Great long-distance girlfriend. Fantastic. Most importantly, this little ****. Oh yeah. Holy goddamn, Kevin, do I enjoy the Nintendo Switch? No, they're not paying me to say it. I love it. We do it together. Lean into the camera one. You hit the camera one. Just go. There it is. It's camera two, by the way. **** off. Hold on. We need, we need a better thumbnail. One more. Wait, hold on. Middle camera, middle. I don't know. Here. TT. Yeah, we got to get the tilt. I'm straight. You're not straight. You want to go straight? Yeah, that's",
            "start": 356.84
        },
        {
            "text": "on. We need, we need a better thumbnail. One more. Wait, hold on. Middle camera, middle. I don't know. Here. TT. Yeah, we got to get the tilt. I'm straight. You're not straight. You want to go straight? Yeah, that's hard for me. All right, good. Thank you. Um, previews up, embargo up for both the Switch and Zelda. We're going to do content for it. Obviously, this we, when the review posts, when we can talk the review and then it'll be a conversation for quite some time. Yes. But Jimmy Jillikers, do I love the Nintendo Switch? You know what I mean? I know what you mean. It's Greg. It's one of those things, you know, it's been the roller coaster with me and then this from the NX, from X, trying to give it to us and all that. And then having some, some problems in Japan in early January. I still believed in him, you know? And now that I have it, like he, there's still going to be the haters. The haters will hate. All does it have issues? Of course it has issues. Everything has issues. But playing this damn thing constantly, I'm just like,",
            "start": 402.72
        },
        {
            "text": "I have it. Like he, there's still going to be the haters. The haters will hate. All does it have issues? Of course it has issues. Everything has issues. But playing this damn thing constantly, I'm just like, I'm going to get to play a real Mario game on this one day. There'll be a Virtual Console. The idea of playing any Nintendo game I want on something like this, fantastic. Have I been doing it for years on the PlayStation Portable? Yes, Greg. But there's always weird frame rate issues and save problems and this and that. No, it's true, you know? But with this save problems, there, there problems. There is no, uh, man, I'll tell you what, Nintendo Switch. I was, I, since I got to hold it, I like the form factor of it. But then my concern, of course, was that Li sold us all on that the Joy-Con grips and this thing were going to be a real controller. They weren't. However, like this is perfect. I have not. Now let's talk about Zelda for a second in a very curatory fashion. Hours and hours into Zelda, I have not plugged this",
            "start": 447.56
        },
        {
            "text": "to be a real controller. They weren't. However, like this is perfect. I have not. Now let's talk about Zelda for a second in a very curatory fashion. Hours and hours into Zelda, I have not plugged this into the dock to play at all. Yeah, I've strictly used my Nintendo Switch as a handheld. This feels super comfortable, super easy. I've done the playing in bed like this. I've done the airplane like this. I've done myself like this. Yes. Uh, I'm excited to use the Pro. Those came while I was gone. I'm excited to have a case for it. I so far, I've been wrapping this in an Ismahawk T-shirt and traveling it around the world. It fits in my back pocket. Yeah, I've done it. Yeah, I've done it. What are you going to do about it? You know what I mean? Your back pocket? Yeah, you slid, slide in my back pocket. Just when I'm boring the plane. You're crazy. A lot of people ask me on, uh, Instagram and Twitter too, when I had it out, I'm playing it in the airports, right? Which did not violate the embargo, but thank you all for trying to",
            "start": 485.48
        },
        {
            "text": "the plane. You're crazy. A lot of people ask me on, uh, Instagram and Twitter too, when I had it out, I'm playing it in the airports, right? Which did not violate the embargo, but thank you all for trying to keep my career going. Uh, how many people came up and asked you about it? **** zero. Zero people asked me any questions about what I was doing or what I was. Yeah, now granted, I'm, I like, I'm off the beaten path on the airport or whatever. But even when I was like standing at the gate waiting for Jen to board the plane, I was sitting there playing Zelda. Nobody had any questions. Nobody did anything. I, I was playing at at the gate at Virgin and like this girl next to me who I could tell didn't really know what was going on, but she kept looking over at me and then eventually she was like, hey, that's the new thing, right? And I was like, new? Yeah. And she, she had no idea, but she just knew was, she was like, oh, I saw, she saw at the Super Bowl commercial. Oh, really? Yeah. Uh-huh. Marketing. I **** love it though.",
            "start": 522.88
        },
        {
            "text": "thing, right? And I was like, new? Yeah. And she, she had no idea, but she just knew was, she was like, oh, I saw, she saw at the Super Bowl commercial. Oh, really? Yeah. Uh-huh. Marketing. I **** love it though. And I, I've been playing 90% of my time on the, the handheld, but I put it into the dock yesterday for the first time, 'cause I wanted to play with the Pro Controller. My favorite thing about this so far is the versatility of it and the options it gives you in terms of controllers and play styles and this and that. 'Cause I, there's, I'm weird, Greg. I like things to be just right when I play games. This gives me the option to have it be just right in so many different ways. And it's good, because there was a while that I played with the Pro Controller on the TV, snapping it in. It's there instantly. I'm having a good time. But then Gio wanted the TV and I was like, ****, all right, sure. Get that **** going. Put it back in handheld mode. But eventually I was like, I still want to play with the Pro Controller. So I put",
            "start": 560.56
        },
        {
            "text": "time. But then Gio wanted the TV and I was like, ****, all right, sure. Get that **** going. Put it back in handheld mode. But eventually I was like, I still want to play with the Pro Controller. So I put it up like this on tabletop mode and I started busting through on the, the Pro Controller. I did the thing where I was like, I wanted, I wanted that photo of it. I didn't have it. Not only did I not have the Pro Controller with me, 'cause they hadn't come in yet. I didn't pack the Joy-Con grip when I left, which I didn't really care about, you know what I mean? But then I wanted the photo of it on the thing playing like that on the airplane. But then I couldn't bring myself to play with the little guys like this. And once I disconnected them too, they were like, oh, hey, it doesn't work in airplane mode. I'm like, oh, I'm not bringing this plane down to play Zelda for photo. I respect the lives of all these people. That's, it's interesting though, 'cause I, I came across that same problem, uh, which I think is a problem,",
            "start": 603.04
        },
        {
            "text": "oh, I'm not bringing this plane down to play Zelda for photo. I respect the lives of all these people. That's, it's interesting though, 'cause I, I came across that same problem, uh, which I think is a problem, because I could have sworn that, that we saw a video of the guy on an airplane in the original launch or in the original trailer doing that with Skyrim. And it, but I mean, real quick, airplane one's a bunch of ****. You're, this isn't even doing like, this isn't even doing wireless, wireless. It needs, it just means it's not, all it means is it's no long, it's not searching for Wi-Fi, so it'll save your battery unless you want to dial into their Wi-Fi, so you can pop it off and do it maybe ad hoc. Yeah. Oh, okay. I mean, it's like your air, your phone. Yeah, you can leave your phone on. Oh, I guess you're right. Remember it drains your phone's battery, 'cause your phone's constantly going, where am I? What's happening? I'm looking for a signal. I'm a phone. Why am I a cognizant phone? Kill me. That's another thing. The",
            "start": 635.92
        },
        {
            "text": "remember it drains your phone's battery, 'cause your phone's constantly going, where am I? What's happening? I'm looking for a signal. I'm a phone. Why am I a cognizant phone? Kill me. That's another thing. The system is it right now, we're not allowed to use online. Like it just doesn't work. There's no online, there's an update available that we can't use yet on this. Yeah, you can't download it. Oh, oh yeah, 'cause I ping for it. It's like nothing. We don't see nothing. Oh, I mean, there is an update available. Okay, anyways, I'm, I'm excited for that. I can't wait. Uh, we're going to do stuff Wednesday. No, we're filming on Wednesday our review and progress kind of thing, because we have a lot more to play to Zelda. That'll post Thursday and stuff. Excited for that. But Zelda's great too. It's **** great. Yeah, Zelda is, uh, it's one of, it's weird, weird, 'cause playing Zelda, especially I think off of Horizon, jumping in, you start in and I remember being like, hm, it seems kind of simple. Yeah, it's, you know, blah, and it's one of those",
            "start": 677.64
        },
        {
            "text": "one of, it's weird, weird, 'cause playing Zelda, especially I think off of Horizon, jumping in, you start in and I remember being like, hm, it seems kind of simple. Yeah, it's, you know, blah, and it's one of those games I think when I'm away from and now I'm, I think I'm hipped to the game. When I'm away from it, I'm like, yeah, it's good, it's fun, whatever. Blah. And then when I'm playing it, I'm like, ****, this is awesome. Yeah, you know what I mean? Of holy ****. 'Cause like it, it's, and it speaks to me in the same way, uh, uh, Horizon did. And it's that sense of discovery where it is, I'm up there and I'm looking around. I see shrines and I tag them on my map and then I go to them and I don't have the thing unlocked. I don't know what's happening. I'm find new enemies are attacking. So without going too far, this be the last thing I say about Zelda before we save it, because I don't want to like repeat ourselves a million times. We're going to, I'm going to repeat what I'm saying right now again. Do you want one something? Yes.",
            "start": 717.4
        },
        {
            "text": "I say about Zelda before we save it, because I don't want to like repeat ourselves a million times. We're going to, I'm going to repeat what I'm saying right now again. Do you want one something? Yes. Thank you. Something I hate about games is the open world. Like there's just so much to do, but there's nothing to do. It's just, it's just a lot of ****. I hate the whole, you see that mountain over there, you can go to it. Like that was a cool marketing thing for Jak and Daxter, sure, back in the year 2000, you know? But now it's like, all right, we get it. That's kind of standard. Just being able to go to a mountain's whatever. What I like about this game is not only can you go to the mountain, you can climb the mountain. And when you're there, yeah, I am shocked. I find myself constantly with this game being like, there's no way I'll make it up there. Like I don't have enough stamina. **** it, I'm going to try. And nine out of 10 times, I make it up. And I'm like, then I get up and there's **** up there. Are you",
            "start": 756.64
        },
        {
            "text": "there's no way I'll make it up there. Like I don't have enough stamina. **** it, I'm going to try. And nine out of 10 times, I make it up. And I'm like, then I get up and there's **** up there. Are you eating the ingredients and stuff to keep, to keep your stamina going? No, no. I've just been like going pretty, pretty. I've been pushing Little Link harder than he needs to be pushed. I'll tell you what, he's got the sweat popping off all the time. And it's one of those, I've gotten into the thing where it's like, man, I am just two hand holds away, but I'm going to die. So I have to sit there and eat a skewer or whatever. I'm just impressed, because I feel like games are so good at keeping you out of where they don't want you to go. This game is not that, man. It's like, it just lets you go places and it rewards you instantly for it. Yeah, get hyped, guys. It's NES Zelda, Ocarina of Time. They had a sexy ass little baby. Yeah, it's a 18-year-old baby though. So, oh, this a baby you can ****. Don't worry, you can",
            "start": 798.72
        },
        {
            "text": "you instantly for it. Yeah, get hyped, guys. It's NES Zelda, Ocarina of Time. They had a sexy ass little baby. Yeah, it's a 18-year-old baby though. So, oh, this a baby you can ****. Don't worry, you can **** this baby. Oh, what's that, Kevin? You can **** any baby if you try hard enough. Why would you say that? That look, they can see. Well, yeah, but they said it before you turned on your little thing. My mic's always on now. Huh? Another Greg Miller question or, uh, suggestion you took to heart. So, Greg, walk me through how you wanted to start one more time. Go ahead. So, uh-huh. You'll do your intro videos. Yeah. Then you'll do the garbage truck rolling out. Yeah. You'll still count us down that the mics are going live. But the one change is you've never turned the lights on since we've gone into any of this. So then when the mics go live and you hit the button for the lights to fade up, that you, you switch the camera on, you hit the lights to fade up. And as they fade up, I'll know to talk and we'll have a",
            "start": 833.32
        },
        {
            "text": "so then when the mics go live and you hit the button for the lights to fade up, that you, you switch the camera on, you hit the lights to fade up. And as they fade up, I'll know to talk and we'll have a perfect transition where I don't sit here like this. Okay. What's up everybody? I mean, the, the, the issue that I have is there's three separate things that I'm using. Mhm. All right. Whatever. We'll try it. Okay. Better work. Love you. Better work. Now I want to do this to you too, Kevin. We've been talking a lot about Nintendo Switch here. One news story I left off the thing. I tossed on the document. We're going to open with that. So while you prep the story, I'll tell you ladies and gentlemen that this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames. We come to you with all the nerdy news you need to know about before jumping in the chat to ask your questions, comments and concerns. In between those two segments, I give you a video game each and every day you can",
            "start": 875.12
        },
        {
            "text": "with all the nerdy news you need to know about before jumping in the chat to ask your questions, comments and concerns. In between those two segments, I give you a video game each and every day you can win by being in the Twitch chat like you are right now. Or if you're one of those marvelous **** who supports us on Patreon. If you're giving us $5 or more, you get money, you get entered it win there. If you're watching on YouTube or you're listening on the podcast services, 'cause yes, this goes live each and every day right in the afternoon. True. You can enter by subscribing to us on Twitch. And if you say, well, I don't ever use Twitch, I ask you, do you use Amazon Prime? Because if you use Amazon Prime, you have a Twitch Prime subscription just sitting there. Each and every month they give you one and you have to give it out to somebody or it goes nowhere. So what I'm saying is you've given Amazon so much money. Don't you want to get some of it back for us? Go there every 30 days, give it to us. Flick",
            "start": 915.6
        },
        {
            "text": "you have to give it out to somebody or it goes nowhere. So what I'm saying is you've given Amazon so much money. Don't you want to get some of it back for us? Go there every 30 days, give it to us. Flick off Amazon and say, why don't you sell 90-inch TVs that Greg needs when he's doing a Gears of War stream? Top story, keeping with the Switch information over at Kotaku. Mike Fahey says, not all Switch games will support TV mode. Yes, not all Nintendo Switch games are going to take advantage of the console's dual TV/portable nature. Released last year for iOS and Android, rhythm game Voez is now a Japanese Switch launch title and it requires a touchscreen to play. Doesn't this mean we're in for, does this mean we're in for a flood of tablet ports? Yes, the latest game. You don't think so? I don't think so. I, I mean, I, I think indies, some of them will port things over, but I think it's, it, this means we'll get more things like Severed. Yeah. Uh, I think, yeah, I, it's going to be interesting how easy it is to develop.",
            "start": 951.32
        },
        {
            "text": "I I think indies some of them will port things over but I think it's it this means we'll get more things like Severed, yeah. Uh, I think yeah, I it's going to be interesting how easy it is to develop for Switch, how easy the hardware is for people to get their hands on, like that, blah, blah. Uh, I don't really care. It does speak to Colin's whole argument all the time of like mobile games ruining everything. Colin was right. You can go watch that episode right now. I get it. It is a problem PlayStation has as you see like Life of Black Tiger and all these shitty things coming out. But again, it's also a free market. I don't know if we need to go in there and yeah, I mean, for me, this is good news because there's just more options to be able to play games. I'm happy it's this and not all every game has to be able to do both because now we can games like uh Elite Beat Agents and things like that that were awesome on DS. This is another step towards making the 3DS not a current system, cuz right now they're",
            "start": 995.28
        },
        {
            "text": "able to do both because now we can games like uh Elite Beat Agents and things like that that were awesome on DS. This is another step towards making the 3DS not a current system, cuz right now they're still doing that that thing and it's going to be at least a year and a half till the 3DS is gone. This is a step towards that. I think this is good. Yeah, for me, it's fine. My Switch is going to be a handheld machine for the most part, which I'm fine with. And so I don't care. Also not in the mood to play. I'm not going to play that game. Can I play Zelda both ways? Can I play Mario both ways? Can I play the games you'd expect and have been promised to play both ways? Yep. I don't give a ****. Fine. If you're if you want to bring Severed to the Severed should come out. Severed is an amazing game. Severed should be played on everything. It's possibly you can played for uh DrinkBox Studios should get your money wherever they can. If they want to do it here, then sure. No, we do. And not to mention you're buying the Switch",
            "start": 1033.4
        },
        {
            "text": "on everything it's possibly you can played for uh DrinkBox Studios should get your money wherever they can. If they want to do it here, then sure. No, we do. And not to mention you're buying the Switch to play it on the go. I don't want to hear this **** that you're playing it only for the dock. You could it's a dumb to be you're gonna have a trip eventually. You're gonna have a trip eventually. Here's what's interesting, like looking at at NeoGAF, there's there's hype for the Switch right now and it is really divided between I'm a handheld only, I'm a console only, and I'm doing it for both. You know, it's like a third, third, third. Shocked. I thought people would be way more handheld about it. But no, Kevin Coello is uh Nick Scarpino on his way over there. I know he's doing other stuff. Yeah, cool. Just making sure if it's more Nintendo stuff, bring it in cuz I want to see what the **** we're getting. Met this developer whose name I'll leave off the or I guess publisher in passing gave me his card.",
            "start": 1071.24
        },
        {
            "text": "making sure if it's more Nintendo stuff, bring it in cuz I want to see what the **** we're getting. Met this developer whose name I'll leave off the or I guess publisher in passing gave me his card. He's like, we have so many Switch games to send you. I was like, **** yes. I'm tell Snipperclips getting a launch release date next Friday, March 3rd. Oh, that's that that's this recent of news. Yeah, okay. Well, when you told me, I thought I missed it from probably it was like from Friday. Yeah, yeah. But I mean, I wasn't here either. So, J hype. Snipperclips, best game I've played on Switch so far. Wait, you've been playing Zelda. I know, but Snipperclips is **** dope. Wow, that is a bold **** is sick. That is a bold ****. Totally. If he plays it with you, you might feel the same way. True. It's I there's there's something cool about Snipperclips. I mean, Zelda's obviously **** Zelda, but sure, we know that. We did know it. I I didn't expect it to be this good. I think, you know what I mean, in terms of a pure gameplay",
            "start": 1113.12
        },
        {
            "text": "something cool about Snipperclips. I mean, Zelda's obviously **** Zelda, but sure, we know that. We did know it. I I didn't expect it to be this good. I think, you know what I mean, in terms of a pure gameplay experience. Dialogue's kind of, you know what I mean, the dialogue's kind of dumb for most of the characters. Oh, yeah, but that's I know that's Zelda. It's not even just Zelda, it's like kind of video games. Like I I very rarely am happy with the dialogue that you can skip, you know, when it's just like we're just doing the conversations. The other thing I want I want I want to look into, right, is um they I want to know who's been working on the translations. We know a bunch of people over there. You know what I mean? There's there's some letters in there that are hilarious and I got to talk to some. There are. Yeah, I'm talking about what we get, Kev. I think Lens is oh, I'm excited for you. I was hoping for more games or something. Uh Kevin, but wait, next story, we're going to talk about the Oscars a little bit.",
            "start": 1154.56
        },
        {
            "text": "Yeah, I'm talking about what we get, Kev. I think Lens is oh, I'm excited for you. I was hoping for more games or something. Uh Kevin, but wait, next story, we're going to talk about the Oscars a little bit. But what so the Oscars happened last night. Tim, you watched some of them, right? You I watched all of them. You play play Zelda. Yeah, cuz you switched. I did. You got off the TV. You let Greg watch. It was interesting. Uh it the whole show was interesting and I I think you without watching it have a bad taste in your mouth cuz everyone's just kind of like about the bad stuff. I thought overall it was it was a good show. It wasn't great. Uh Jimmy Kimmel did a good job hosting. Some of his jokes fell really flat and he a lot of the jokes felt very tempered and kind of the same joke over and over and over. Like it was it was weird, but I'm like, I get it though. It's you know, national TV. Like there's there's a lot of thoughts going into what this is, but I thought he did really well. Uh the winners overall, I thought",
            "start": 1195.68
        },
        {
            "text": "it was weird, but I'm like, I get it though. It's you know, national TV. Like there's there's a lot of thoughts going into what this is, but I thought he did really well. Uh the winners overall, I thought I'm like, okay, can at least understand how this all came to be. Um I saw a lot more of the movies than I usually do in the years. Yeah, usually I've be seen. I don't know the **** half this is. Now it's like, oh, I don't know what 30% of this is. Sure, cuz you saw Suicide Squad. Saw I did see Oscar. Saw Oscar-winning Suicide Squad. Suicide Squad. Yeah. Uh the musical performances, we got a little bit of that. Justin Timberlake coming in for the intro. The one of my favorite things now in our in our lives in year three or whatever the **** it is of Kinda Funny is is all the crazy opportunities that we've had that now whenever I watch standup comedy or live things like that, it's like, oh, the Oscars. Oh, we performed on that stage. Oh, was it Shrine? No, it was a um Let's Play Live. Oh, in LA. And I'm just like,",
            "start": 1247.04
        },
        {
            "text": "had that now whenever I watch standup comedy or live things like that, it's like, oh, the Oscars. Oh, we performed on that stage. Oh, was it Shrine? No, it was a um Let's Play Live. Oh, in LA. And I'm just like, look at. I'm like, we literally me and Greg ran up and down the the things with air horns talking **** in this very theat. They took it away from me and it was bad. Throw me away. Yeah, that stuff's cool, but it was a great show. Justin Timberlake killed it. Um Sting performed. I don't know what came down like hit people. The B. Wow, he did. Um and then my favorite of the musical performances was uh from Moana. They did How Far I'll Go, which is the jam. But then they also had Lin-Manuel Miranda who wrote the song Hamilton. Dude came out and rapped about Moana before it happened and I was like, this is the most Tim-est thing. Now you I The Rock did stuff. I saw The Rock intro them singing and he came out and he sang a little bit of his song, but it was kind of like a joke. It was like a real he was like, yeah, they",
            "start": 1290.72
        },
        {
            "text": "thing now you I The Rock did stuff. I saw The Rock intro them singing and he came out and he sang a little bit of his song, but it was kind of like a joke. It was like a real he was like, yeah, they asked me to sing my song. And then he sang like two lines. I was like, I'm just kidding. They didn't do that. We're going to do this. It was good. Uh and then the last music performance was for it was City of Stars and Fools the Dream from La La Land. Was go no, it was they intro uh John Legend. Just John Legend on piano and like it was beautiful. The set was super awesome. The dancing looked great. I do wish that the Gosling and Stone got involved. Uh but it was what it does. But then at the end there was the **** up, right? And holy ****. I pay attention a little bit on Twitter here and there. I instead was watching Nashville. If you have not seen the most recent Nashville, ladies and gentlemen, you got to. I was behind on the show. Had it spoiled right before I went out for the D.I.C.E. Awards. I was like, I gotta",
            "start": 1335.4
        },
        {
            "text": "Nashville. If you have not seen the most recent Nashville, ladies and gentlemen, you got to. I was behind on the show. Had it spoiled right before I went out for the D.I.C.E. Awards. I was like, I gotta watch this immediately. So Jen and I came back. We cooked dinner. She cooked most of it. And then I just watched this **** Nashville that tore me apart. But while that happened, this broke that. Yeah, the whole thing with La La Land gets introduced by Warren Beatty. They go up there. They get into their speech. I didn't realize how deep they got cuz the clip I saw made it look like it happened right away. And no, they got through like three acceptance speeches before they were like, we lost. What happened was uh the the I don't know who the people were that were it was Warren Beatty and it was the woman uh Faye Dunaway. I want to say I'm not familiar with them that they came up and they were talking and it felt weird from almost the beginning. He looked at at the winner and like there was a lot of weird staly moments.",
            "start": 1380.8
        },
        {
            "text": "I want to say I'm not familiar with them that they came up and they were talking and it felt weird from almost the beginning. He looked at at the winner and like there was a lot of weird staly moments. Like and then he said it and then, you know, she said it. Yeah, he passed. Well, yeah, I'm not doing this. Uh we we were stoked. Um I was stoked because La La Land, the **** yeah. But then they they get into the speech and it was so awkward. You see these guys with red envelopes running around like panicking and like first thought I was like, I've seen Kevin in this situation. Like there's panic happening and it's like something is really **** wrong. It immediately reminded me of Kevin and Chris Auter Tag from IGN where it's just like they are the guys that need to solve the problem as it's happening. And it was bad, man. Like then the La La Land guy was just like, hey, no, this is not a joke. I want to read that cuz I think you've all seen it now. Uh New York Times here has an interview up with Jordan.",
            "start": 1420.16
        },
        {
            "text": "and it was bad, man. Like then the La La Land guy was just like, hey, no, this is not a joke. I want to read that cuz I think you've all seen it now. Uh New York Times here has an interview up with Jordan Horowitz, who's the guy, you know, who did La La Land. I'm going to read and it was Faye Dunaway. I'm going to read for a while here. It's not super long, but I'm read. Jordan Horowitz knew something was wrong the moment he saw people in headsets scurrying across the Oscar stage. Only a minute earlier, Faye Dunaway had said the words that Mr. Horowitz had longed to hear, La La Land, as she announced the Best Picture Winner for the 2017 Academy Awards. Mr. Horowitz, a producer on that film and colleagues and C members raced to the stage. Mr. Horowitz spoke first, quote, thank you to the academy, he began. But his excitement quickly dissipated when he recalled the shocking end to the night in an interview with the New York Times after the ceremony. I'm holding the envelope and the award and I had just given my speech and there",
            "start": 1461.12
        },
        {
            "text": "dissipated when he recalled the shocking end to the night in an interview with the New York Times after the ceremony. I'm holding the envelope and the award and I had just given my speech and there are people on stage with headsets and I thought that doesn't seem right, Mr. Horowitz said at the at the Governors Ball, the official post Oscar celebration. They asked me to see my envelope, which I haven't opened, he recalled. Clearly something was wrong. They open the envelope and it says Emma Stone, La La Land. So clearly something is not right. The guys in headsets were going around with urgency looking for the other envelope. It just kind of appeared, he said. One of the guys opens it and says Moonlight. And I took and I took it on stage and went to the microphone and said what I said what Mr. Horowitz said what Mr. Horowitz said, there's a mistake. Moonlight, you guys won Best Picture. Was one of the most surprising reveals in Oscar history with apparent human error combining with a live television combining with",
            "start": 1503.4
        },
        {
            "text": "Horowitz said, there's a mistake. Moonlight, you guys won Best Picture. Was one of the most surprising reveals in Oscar history with apparent human error combining with a live television combining with live television to powerful jaw jaw-dropping effect. It was also a pain reminder on the most celebratory night of film industry that no system of voting is perfect and it warped and dampened the euphoria of film executives and artists who had spent years working on the two movies. And so it goes on like that. But I mean, the big thing I think to shout out, of course, is how well the La La Land handled it, dude. I mean, honestly, I was impressed overall with the entire scenario because the the guys in headsets, they got that **** done. And like the fact that they interrupted it mid speech, they didn't let it go. They didn't whatever. Like I thought it was handled as well as humanly possible. And La La Land took it very well. Did it really well. It was taking a step back from it as it was",
            "start": 1543.64
        },
        {
            "text": "they didn't let it go. They didn't whatever. Like I thought it was handled as well as humanly possible. And La La Land took it very well. Did it really well. It was taking a step back from it as it was happening. I felt super uncomfortable with it cuz I was just like, ooh, th this is really bad. And my first gut reaction was this is a bit. Yeah, like that this was a planned thing of like like everyone thinks it's going to be La La Land, but no, it's Moonlight. Like the Oscars aren't so white. And it's just like that's that's not good. You know, like that would have been super **** that. So I'm happy that at least this was. Yeah, I mean, like I don't know. For me, watching reading about it and watching the clip where it all I think where we turned the corner where it's all right is the fact that Horowitz is like, no. And I think it was Horowitz because there's two guys who talk. One said lost. Horowitz is the guy who does it. And he's come up here and he's like, it's my honor to give this, you know, my friends at",
            "start": 1587.68
        },
        {
            "text": "Moonlight and all that different stuff. It was that thing of like, you know, when you think I obviously I could the fact that everyone universally not even even before the Steve Harvey, everyone jumps to M. Night Shyamalan. And the fact that he tweeted every between that you're watching. I watched, you know, Nick and Ransky and a whole bunch of our friends did a reaction stream once it all was over. I jumped over to watch their reaction to that one part. And the fact that like, I think it's Mike Horen says, oh my God, what? Or maybe it's Sean says it, oh, M. Night Shyamalan. I was like, everyone jumped there in two seconds. But then the Steve Harvey thing for comparison's sake, when Steve **** it up, he talked about it and he was the only one speaking. And it was very much like he just ran over your dog. Like, I know this",
            "start": 1628.76
        },
        {
            "text": "but then the Steve Harvey thing for comparison's sake, when Steve **** it up, he talked about it and he was the only one speaking. And it was very much like he just ran over your dog. Like, I know this is horrible and heartbreaking. Whereas this one was that the fact that they La La Land to come be like, nope, sorry, this isn't us. This is sorry, this isn't come up here. And it was the celebratory moment. They still Moonlight got to come up, have their speech. You got to see both casts on stage and ****. And then like, and it was that thing of like, Jimmy Kimmel comes out. He makes a joke. Warren Beatty explains like all these different things. Yeah, it's I mean, for I mean, it sucks. Again, it does suck. And who knows the realities of it? Who knows if somebody was did this on purpose or whatever? I doubt it. I don't think so. But like, but the thing is, it's like, it does kind of suck that Moonlight had to share, you know, and that La La Land did get to to go up and have a moment as well. It's like, it's kind of like a, well, good job, you",
            "start": 1662.52
        },
        {
            "text": "but like, but the thing is, it's like, it does kind of suck that Moonlight had to share, you know, and that La La Land did get to to go up and have a moment as well. It's like, it's kind of like a, well, good job, you guys too, you know, which does take away for me. I sucks more for La La Land of like, we did it. We got up there. And then it's ripped away from you. And that was the thing too, is I forget who it was on Twitter. Somebody else was complimenting the La La Land guys for how they took it in stride. And somebody responded like to and God, I want to say this is a Carboni conversation. Somebody responded like, what did you expect them to do? Spike the award and get really pissed off. And but it was like, no, like if I'm up there and I I've won Trending Gamer of the Year and I'm giving my speech and like Sean's like, I'm sorry, I've read them. I'd be like, oh, I I don't even know how like just that emotional switch to be thrown and then pass it off to the guy in the headset and step back and awkwardly fade away.",
            "start": 1702.16
        },
        {
            "text": "like, I'm sorry, I've read them. I'd be like, oh, I I don't even know how like just that emotional switch to be thrown and then pass it off to the guy in the headset and step back and awkwardly fade away. Like the fact that it was like, sorry, come up here. You deserve it. This is how it is. It says Moonlight. You know what I mean? Like that was the way it was. I thought it was handled really well in terms of it's a bad situation. What are you do? No, absolutely, absolutely, man. It was interesting. And again, La La Land won a bunch of ****, you know, including Best Director. So it's like people had enough things. Like they're up there. There different people and everyone does their stuff. But very interesting. Uh huh. I like somebody pointed out on Twitter last night too. Like how **** up would it have been if it went the opposite way where Moonlight came up and then they're like, sorry, no, it was La La Land. And like cuz La La Land has been this juggernaut that nobody can beat. Here's this small Moonlight movie trying to",
            "start": 1740.12
        },
        {
            "text": "the opposite way where Moonlight came up and then they're like, sorry, no, it was La La Land. And like cuz La La Land has been this juggernaut that nobody can beat. Here's this small Moonlight movie trying to make it not small, but you know what I mean? I think more people have heard of that. Uh next story comes from the Schmoedown. This is where Nick Scarpino went to be on it. This is up right now. So so here's the deal. Nick Scarpino goes down to compete in this movie movie trivia Showdown. Yeah, excuse me. Um you should watch the video before this point. There's they're cutting like wrestling style promos, right? And uh is this other dude Mark who I just don't know, but he's there. He's doing he's doing he's doing well, right? But then there's Nick. And this is Nick in his goddamn prime. He is so funny surrounded by a bunch of beautiful women, some of which you might be familiar with. Um and they're just cut on his promos and everything he's saying is hilarious. But then this is Nick's entrance. Okay, so let's just",
            "start": 1778.36
        },
        {
            "text": "a bunch of beautiful women, some of which you might be familiar with. Um and they're just cut on his promos and everything he's saying is hilarious. But then this is Nick's entrance. Okay, so let's just watch it. Representing Fat Batman earlier. See, I thought it was interesting when you earlier said that's it. And it was just this. Yeah, I mean, it is this, but it's Nick. Not I know, but I'm saying you just said it without knowing if it was Nick here. That's not Nick. That's Miss Movie. That's Miss Movie, sir. Wait a minute. That's oh, wow. So that's wait, that's Stacy. That's her partner. What? Oh, there. Wait, he's got mma5 and Perry. Producers already mastered the art of the Entourage on the movie trivia. Look at Perry Nemiroff and look smiling. Very nice. Nick Scarpino is really showing the smack and the push from Stacy. And is this the first time we've seen team shirts come out? Coordinated uniforms. All right. Um and apparently the ladies are staying. Nick, this is not a a team for here. Uh you have to compete against Bernard",
            "start": 1821.0
        },
        {
            "text": "is this the first time we've seen team shirts come out? Coordinated uniforms. All right. Um and apparently the ladies are staying. Nick, this is not a a team for here. Uh you have to compete against Bernard by yourself. Yeah, all right. All right. Anyway, you guys should I love it when Nick goes full Nick. When Nick gets to be Nick, it's great. Full Nick is the best Nick. But anyway, you should watch it because the I've only watched that far, but the beginning was hilarious and I can't wait to watch the rest. Schmoedown. Is that the one uh oh **** if I know. Collider. I don't know. Collider Digital. It's it'll be on Nick's Twitter, I'm sure. Honestly, no, I I would not guarantee that as far as you go. Collider Videos. Collider Videos. Everybody. Uh next story is just a teaser for tomorrow, but I thought we'd watch it all the same cuz we love Guardians of the Galaxy. The full trailer is coming tomorrow. They put up this tease. Dude, what? Dude, what? Good for them. Good for them. I'm excited for that movie seeing Logan",
            "start": 1877.0
        },
        {
            "text": "the same cuz we love Guardians of the Galaxy. The full trailer is coming tomorrow. They put up this tease. Dude, what? Dude, what? Good for them. Good for them. I'm excited for that movie seeing Logan this week with you, dude. We're doing a reaction to that. All right. Can we just get hyped for a **** second? I've been ready to get hyped the whole show. Tim, no, that's not how you do that. We got Logan this week. Yeah, we got Beauty and the Beast next week. Then there's Power Rangers. Don't **** uh about Beauty and the Beast. This **** looks **** awesome. Awesome. Period. I'm not I'm not at all taking away from your excitement. I want you to have fun. Go live your life. I think what you just did took away from his excitement. No, it didn't. No, never mind then. Are you are you at PAX East going? Yeah, that's my problem is I'm ****. Now here's what I think you should do. It's pretty simple. What PAX East? We have a panel. Yeah, 8:30 at night. Okay, we booze it up there. Yeah, then we just say, hey, who wants to",
            "start": 1927.64
        },
        {
            "text": "my problem is I'm ****. Now here's what I think you should do. It's pretty simple. What PAX East? We have a panel. Yeah, 8:30 at night. Okay, we booze it up there. Yeah, then we just say, hey, who wants to go see Beauty and the Beast? We all go to find Beauty and the Beast. That sounds like a disaster of an idea. Oh, PAX crowd, do you not want to go see Beauty and the Beast? I'm sure they do, but I'm just logistically. I mean, I'm not against the idea if it gets me to see Beauty and the Beast. I'm probably there's got to be like an 11 o'clock show we could get buy tickets for. Kevin shaking his head. Now I want to go. Maybe you should you should be profitable for this company. I think I am. You should be profitable. Now you make us a lot of money. Do do a good job. You just don't do anything in front of the camera. You know what I mean? It's hard to sell you going to PAX East because honestly, probably none of us should go. I got this little guy. Now you do have I this came too late though. ****. There's no way for me to turn",
            "start": 1996.84
        },
        {
            "text": "I mean, it's hard to sell you going to PAX East because honestly, probably none of us should go. I got this little guy. Now you do have I this came too late though. ****. There's no way for me to turn this into the Kevin the Kevin PAX East cam. You know, I mean, it's really easy. We just a Periscope stream. You know, I mean, these arest you should up in the morning the morning over at the New York Times. We finally, finally, finally have hard numbers on PlayStation VR. And they are impressive. Uh Nick Wingfield writes, popularity of Sony's PlayStation VR surprises even the company. There are plenty of people who are skeptical about virtual reality, a technology that some have heralded as the biggest thing to come along in years come along in years in games and entertainment. Even Andrew House, Global Chief Executive, Sony Interactive Entertainment, the video game division of the Japanese Electronics giant, has doubts about how quick virtual reality would be embraced by the mass market. So when Sony needed",
            "start": 2037.2
        },
        {
            "text": "executive Sony Interactive Entertainment, the video game division of the Japanese electronics giant, has doubts about how quick virtual reality would be embraced by the mass market. So when Sony needed to decide how many of its virtual reality headsets to manufacture, Mr. House was among those inside the company advising that Sony make fewer of them. It's the classic case of any in any organization, the guys who are on the front end in sales are getting very excited, very hyped up. Mr. House says, \"Yes, you have to temper that with other voices inside the company, myself among them, saying let's just be a bit careful.\" It turns out Mr. House was too cautious. The headset, PlayStation VR, has been scarce in many stores, especially in Japan, since it went on sale in October. In an interview at a Silicon Valley office on Friday, Mr. House revealed PlayStation VR sales for the first time, saying consumers had purchased 915,000 of the headsets as of February 19th, roughly 4 months after it went on sale. Stick with it.",
            "start": 2078.48
        },
        {
            "text": "on Friday, Mr. House revealed PlayStation VR sales for the first time, saying consumers had purchased 915,000 of the headsets as of February 19th, roughly 4 months after it went on sale. Stick with it. Sony's internal goal was to sell 1 million of the headsets in its first 6 months by mid-April. The company will almost certainly surpass that forecast. Quote, \"You literally have people lining up outside stores when they know the stock is being replenished,\" Mr. House said, describing the scene in Japan, one of the biggest games markets. That's so interesting. This has always been a thing. I have seen so many VR units in so many stores. I just, just last weekend, I was returning a laptop at Best Buy. Yeah, VR units as far as the eye can see. If your eye's not looking too far, there was only like three, but still, they were there. Yeah, yeah. Mr. House said the supply of PlayStation VR headsets will improve by April. By Fall, Sony expects to begin shipping them in Latin America. Um, that's the thing is that it is very where",
            "start": 2122.28
        },
        {
            "text": "were there. Yeah, yeah. Mr. House said the supply of PlayStation VR headsets will improve by April. By Fall, Sony expects to begin shipping them in Latin America. Um, that's the thing is that it is very, where are you located? Where are you looking? Cause I've seen the, our friend, one of our friends over at YouTube was tweet, tweeting a while ago that she couldn't find them and I was like, \"Tim says he sees them. Do you need one?\" Or whatever. She's still looking at the time and I know that I've had uh, audience members, PS I Love You people talk about like, \"I keep trying to buy and I can't buy it.\" And so I know in Japan for sure I have seen those photos. But yeah, still, congratulations. ****. I mean, they're actually doing it. That's crazy. I mean, 900,000 is, is a very large number for a device that requires another expensive device. Yeah, you know, but you probably already have it. Yeah, but I mean, I know I'm with you. I'm with, well, still, I mean, like the install base of that, you just start going down that. Yeah, no, start",
            "start": 2168.32
        },
        {
            "text": "device. Yeah, you know, but you probably already have it. Yeah, but I mean, I know I'm with you. I'm with, well, still, I mean, like the install base of that, you just start going down that. Yeah, no, start segment, segment, segment. It'll be interesting to see if we get more games for at least from Sony, big Triple-A. Yeah, it would be. I mean, I like, I'm really concerned if we don't hear about E3, there's going to be some problems. There will be some problems, I'll tell you that. All right, Kevin, you don't want no problems. More Money, More Problems, Kevin, that's what they say. That's why we're not bringing you to PAX. Uh, let's read a few tips, what do you say? Yeah, let's do that. Um, here we go. First is from Slinky59. Thank you guys for everything you do. I've enjoyed your content for a long time. This is from my Brother's unboxing video. It contains cringe, I know, and he gives me a YouTube link. Kevin has walked away. Brewcocky gave us a tip, said, \"First time being able to watch live forever. Miss you sexy Angels.\" Fun clip for",
            "start": 2207.12
        },
        {
            "text": "video. It contains cringe, I know, and he gives me a YouTube link. Kevin has walked away. Brewcocky gave us a tip, said, \"First time being able to watch live forever. Miss you sexy Angels.\" Fun clip for your holes. Kevin has abandoned his post. Brooke, great job with the D.I.C.E. Awards. Greg, special shout out to the Kinda Funny Best Friends who helped me Platinum Watch Dogs 2 last week. Thanks for being such a cool community. No, thank you for being part of that cool community. Uh, Wahi1547 says, \"This fun clip is just for you, Greg. Hope this changes your mind about fun Clips. Time code is in the link. It's the lady talking about the weather.\" Uh, Kevin has abandoned his post. I tell you not to submit fun clips for this very reason, but he will go through these links and he will vet them and we will see if we watch them at the end. DamenSor gave a tip and said, \"Here's my birthday tax. Thanks for all you guys do. Much love. Thank you. Have a great day.\" DJKento says, \"Getting soldier, getting shoulder surgery on the 8th.",
            "start": 2248.4
        },
        {
            "text": "them at the end. DamenSor gave a tip and said, \"Here's my birthday tax. Thanks for all you guys do. Much love. Thank you. Have a great day.\" DJKento says, \"Getting soldier, getting shoulder surgery on the 8th. I won't be able to bring my hands together to hold the controller. Excited to play this. Control, say good news on the Nintendo Switch. On the Nintendo Switch, Anything is Possible, except for most current gen video games.\" Yeah, that's right, Enil. Uh, MrBrawl96 is paying my birthday tax for my 21st, sharing it with Pokemon's 21st today as well. Also, send Fran a happy birthday as well for his. We'll be streaming on the KF BF tonight, that's the Kinda Funny Best Friends uh, Twitch channel, along with a bottle of Maker's Mark to celebrate. Kevin, three fun clips were submitted while you were gone. Yeah, I'll go, you vet him, you let me know. Um, I'm not a big fan of this whole, I mean, I guess sure, it's just a couple internet posts, so like, it's not, not the end of the world, but anniversaries have gone too far, like",
            "start": 2288.88
        },
        {
            "text": "you vet him, you let me know. Um, I'm not a big fan of this whole, I mean, I guess sure, it's just a couple internet posts, so like, it's not, not the end of the world, but anniversaries have gone too far, like we're celebrating Pokemon's 21st. I mean, it's, it can drink now, but that's just, that's you getting **** up. But yeah, hell yeah. Yeah, you know what, you just changed my mind on this. JoshGrab gave a tip and said, \"A friendly heads up, GameStop is releasing Horizon at 9:00 p.m. Eastern tonight. Not sure what time for the rest of the country. GameStop has been releasing certain games early this way with publisher permission, right? Because of course, no, I guess it doesn't check out.\" Oh, interesting. Horizon's a weird one for me because since we've had it for a while, it doesn't feel, it feels weird that it's not out yet. I feel like people have been talking about it as if it's, it's already here. That's the problem where when you talk about embargos and I mean, it makes sense, right, that Sony got out in",
            "start": 2330.68
        },
        {
            "text": "it's not out yet. I feel like people have been talking about it as if it's, it's already here. That's the problem where when you talk about embargos and I mean, it makes sense, right, that Sony got out in front of everything. Nintendo, they must have done that on purpose. Yeah, I'm sure. I don't know if they, that's so far out. Like, good, Sony did good, good job. They, they did really well. Yeah, yeah. And I think people are super stoked to play it, so that'll be good. ProjectSoul says, \"Greg, do you miss Portillo's Italian Beef and Hot Dog, or, or hot dog, because that's what I'm eating right now?\" You know that I miss them both. Uh, which one do I miss more? That's like choosing my children. I can't do that. I'm sorry. You know that I sometimes when I go there, \"Easy choice,\" you think so? \"You don't like the Italian beef?\" No, I do. I like it very much. I just like the hot dog way better. Combo's a great one too. Never had the combo. **** up. I'm scared of it. I want one right now. E3, we'll go down and get some. I guess VidCon's before",
            "start": 2373.16
        },
        {
            "text": "like it very much. I just like the hot dog way better. Combo's a great one too. Never had the combo. **** up. I'm scared of it. I want one right now. E3, we'll go down and get some. I guess VidCon's before then, right? No, it's after that. Yeah, E3. Uh, Jad11 says, \"Hi there, Greg and Tim. Just paying my birthday tax for yesterday to Overlord Colin. I was also wondering if there is any update on Kinda Funny socks coming to the RT Store. I need some socks.\" SCG, no update yet. We're working on it. They know, they know. AlexEve gave us a tip and said, \"Glad you guys are liking the Switch. Can't wait for Kinda Funny Live 3.\" You know it, Alex, you know it. PrincessDaisy3 gave it to and said, \"Hey gentlemen, please wish me luck in my job interviews this week. I've one today and one tomorrow. Thank you guys for all your content. It definitely helped me get through grad school. Good luck, go get them, go **** him up. Get in there, push him right in the dick.\" Greg, Jay, Princess Daisy, **** him up. What's the **** him up? Al, Al.",
            "start": 2412.12
        },
        {
            "text": "it definitely helped me get through grad school. Good luck, go get them, go **** him up. Get in there, push him right in the dick. Greg, Jay, Princess Daisy, **** him up. What's the **** him up? Al, Al. AndyDixon, Greg, what is the battery life like for Switch when Zelda in handheld mode? Also, I have a fun clip. Uh, Andy, Kevin will do that for you. Uh, the easiest way is I played probably an hour and 45 minutes uh, in the airport, then on the plane on my way to Vegas. That brought me down to 50%. And that was in airplane mode with, I don't think I'd **** with the brightness. Then I got to the hotel and played for a while longer and then charged it when it got to 10. Yeah, I had brightness all the way up. Yeah, and I flew from here to LA, so that's a hour, hour 15ish. Really thought it was an hour or 15 minutes. Oh, whatever. I don't know. But there was that, but plus on the gate beforehand, I played for 20 minutes or something like that, so that there was no issue there. Throughout the day, I'd pop in, had a Starbucks or",
            "start": 2452.76
        },
        {
            "text": "I don't know. But there was that, but plus on the gate beforehand, I played for 20 minutes or something like that, so that there was no issue there. Throughout the day, I'd pop in, had a Starbucks or little bit play here and there. Um, but then yeah, then on the, the thing about the Switch is, is that it's USB-C. Yeah, so that **** charges super fast. So even if you do get low, pop it in, 15 minutes gets you a **** ton of charge. So that my, my, that's the one thing. And I mean, don't get me wrong, I know haters are going to hate, blah, blah, blah, blah, but like the comments on the post are like every time, like, \"Oh, a new travel bud. I hope it's a short flight.\" I'm like, \"What ancient **** plane are you flying on that you don't?\" I'm, we're going to Boston. It's a 6-hour flight. I am not, I'm going to play Switch the entire **** way because I'm bringing, I'm going to bring the USB cable, can plug into the ****. Or Virgin has them down here, right? Virgin has plugs. Virgin has USB things. You have portable USB charger things. I, I",
            "start": 2501.12
        },
        {
            "text": "way because I'm bringing, I'm going to bring the USB cable, can plug into the ****. Or Virgin has them down here, right? Virgin has plugs. Virgin has USB things. You have portable USB charger things. I, I haven't tried running it off a USB charger. You need, they need to be specific ones that are like, there's like new Power Cores or whatever the ****. They're cheap, they're fine. New Power Cores? What do you mean Power? The, I forgot what the, the name of the brand is, the Anker PowerCore. Whatever, the little tiny lipstick ones probably aren't going. I got a big chunky one. You think that'll work? Uh, potentially. It might not. Kevin, I need you to go get it. It needs the supercharge or whatever, cause it, and I need the USB-C off my desk. It's in a bag. I would, I would not just plug willy-nilly in. Yeah, Kevin, don't do it. Tim scared me. Yeah, why? You think fry it up? USB-C. It's, there's, there has been issues with things frying things. Okay, I'm not going to do it. Kevin, I'm scared. I don't want to die. I don't, I don't want my, my Switch",
            "start": 2543.52
        },
        {
            "text": "me. Yeah, why? You think fry it up? USB-C. It's, there's, there has been issues with things frying things. Okay, I'm not going to do it. Kevin, I'm scared. I don't want to die. I don't, I don't want my, my Switch. Did I? Kevin, what am I supposed to do? It's what you are. Oh, Kevin, no. I've missed you. Don't do this. Don't turn on me. You too. How you been? Good. Uh, High8 says, \"Thanks for all you guys do. Trying to plan on going to Kinda Funny Live 3 since it's on my birthday. Good showing up in my birthday sweet.\" Yeah, I, he means suit, but he, he means suit, but it's going to be sweet. He did a little winky thing too. Walking Talking Stephen Hawking, who I haven't heard from in a long time. Good to see you. Says, \"Beauty and the Beast doesn't release until the week after PAX East, but if you want to see Logan again with me, check out the AMC Loews Boston Common 19.\" I'm, I was wrong. February's **** me up because it's like the dates are so short and like we jumping into, \"What if we go see Get Out? Did I already miss the Get Out?\"",
            "start": 2584.2
        },
        {
            "text": "out the AMC Loews Boston Common 19. I'm, I was wrong. February's **** me up because it's like the dates are so short and like we jumping into, \"What if we go see Get Out? Did I already miss the Get Out?\" Oh my God, I want to watch Get Out so bad. PAX East audience, would you like to go see Get Out with us? I want to watch Get Out tonight. Oh, you're, I'm, no, I'm going to Alamo Drafthouse tonight for Day of the Devs. You should come with me. See some indie games, drink, drink a drink. Little indie indies. It's GDC, if you didn't notice. GDC. I don't think anybody says that. Uh, JacqulynLewis14 says, \"What's the schedule for Saturday at PAX? Anything after party again? We missed last year's.\" Uh, Saturday at PAX East, Tim and I are doing a video. Uh, I'm doing uh, League of Heels, and then we're bumming around seeing games. I'm going to bring another capture kit, maybe do some stuff. But uh, no, no after party plan. Really bum around and see what's up. Mhm. Hey Greg, check this out. I'm, let me see what's up, Kev. Oh, did you **** it up? Damn.",
            "start": 2624.48
        },
        {
            "text": "bring another capture kit, maybe do some stuff. But uh, no, no after party plan. Really bum around and see what's up. Mhm. Hey Greg, check this out. I'm, let me see what's up, Kev. Oh, did you **** it up? Damn it. F, you moved. You moved. There it is. What's up, guys? It's me, Greg Miller. I'm sexy. Two more tips before we get back to the stories. MemberedMan says, \"How does Horizon's open world compared to other PlayStation open world games, in particular Infamous? I missed that map.\" Uh, it's more open. It's bigger than Infamous. There's, it's less dense than Infamous because there's not buildings and ****. Plenty to do. I mean, lots to do. That map is chalk full of content, which I think is awesome. And I loved it. Platinum over the weekend finally. I mean, I Platinum, technically I Platinum it this weekend. I Platinum it before I left. I had to wait for my trophies all to be able to sync. Uh, 50 hours to Platinum it. It'll, it'll take less for you because you can use guides. Yeah, it's true. Yeah, I still haven't beat it. I'm getting",
            "start": 2670.76
        },
        {
            "text": "I left. I had to wait for my trophies all to be able to sync. Uh, 50 hours to Platinum it. It'll, it'll take less for you because you can use guides. Yeah, it's true. Yeah, I still haven't beat it. I'm getting closer and closer, but like at this point of my, with Zelda. Zelda, I understand. But I'm going to beat it. My goal is to beat it before PAX. Oh, it won't be before PAX. I have to figure this out. Maybe before April. BeesiForLife with the final tip for right now says, \"Want to go to Kinda Funny Live from the, he wants to go to Kinda Funny Live from the period. Are Muslims allowed to America? Question mark, question mark, question mark.\" Let Kevin host. \"Yes, Muslims are allowed in America. You should come. Just tell them you're going to Kinda Funny Live.\" Yeah, exactly. Stand at the border. Mhm. Uh, what else we got here now? Uh, you put this one in here. Next story. I did coms from NeoGAF. Assassin's Creed Empire, the Egyptian setting, screenshot leaked rumor. Yeah, take this as a rumor. Nothing **** knows if it's real or not.",
            "start": 2717.16
        },
        {
            "text": "now. Uh, you put this one in here. Next story. I did coms from NeoGAF. Assassin's Creed Empire, the Egyptian setting, screenshot leaked rumor. Yeah, take this as a rumor. Nothing **** knows if it's real or not. Knowing Ubisoft's track record with leaks, it's probably real. Yeah, 100%. Uh, so we got some pictures. We got this dude looks like he's about to walk into a cave. Hell no. Scroll up, Kev. Hell no. How much money would you need to go in there and like, you have a time, but I'm like, me, you, 10 seconds to get in there. Not even 10. I mean, take, you, I'm saying none of that. You just got to walk through it. $1,000, would you do it? Oh, sure. $1,000 bucks. Yeah, 100%. I mean, I hate it and I get, they get in my mouth. I have to, spider. Why you have your mouth open? Cause I be. Now, this reminds me of a little game called Legend of Zelda: Breath of the Wild. Well, another thing I'd like to give the tip of the hat to with Legend of Zelda, uh, is the practical problem solving. I walk up, got a shrine up there, **** thorns all around it.",
            "start": 2757.6
        },
        {
            "text": "Zelda: Breath of the Wild. Well, another thing I'd like to give the tip of the hat to with Legend of Zelda, uh, is the practical problem solving. I walk up, got a shrine up there, **** thorns all around it. Try to glide in, that **** didn't work. I'm looking, I'm like, \"What?\" I'm like, \"Do you think a fire arrow?\" And I hit it with the fire arrow and it burns all the thorns. I'm like, \"That's, that's a **** cool feeling of like manning.\" I love it because I solved that problem totally differently and it worked. What you do? I don't want to talk about. I don't know. I know what I'm allowed to. I know. I understand. Um, next one comes from Kaku over there. Mike Fah again says, \"Twitch starts selling games streamers play this spring. Millions of people watch games being played on Twitch. This spring, they'll be able to purchase the games they want directly from the streaming site with a portion of the revenue going to the onscreen talent. Detailed in a blog post over at Twitch.tv, the new game sales program will allow",
            "start": 2814.56
        },
        {
            "text": "the games they want directly from the streaming site with a portion of the revenue going to the onscreen talent. Detailed in a blog post over at Twitch.tv, the new game sales program will allow stream viewers to click a buy now button at the bottom of the stream page to purchase the game they are viewing. Sales go through Twitch parent company Amazon, and while games will be available worldwide, only US Dollars will be supported as a payment currency at launch. Partner streamers who opt into the program and play games from Twitch publishing partners will earn 5% of the revenue generated from their stream. Fees from streamers who have not opted into this program will still feature buy now buttons, but the streamers will receive no benefit. Sweetening the pot for viewers, purchases made through Twitch over $4.99 will earn the buyer a Twitch Crate filled with digital rewards like special icons and the like. All right, this is one of those things where to a lot of people it doesn't mean much, but I",
            "start": 2857.88
        },
        {
            "text": "over $4.99 will earn the buyer a Twitch Crate filled with digital rewards like special icons and the like. All right, this is one of those things where to a lot of people it doesn't mean much, but I think that this is great for our industry and where we're going and what we do. Amazon making the right decisions. And I think that when they first bought Twitch, there was a lot of questions of, \"Oh man, when, when's Twitch going to get awesome? There's now money being put behind it and there's all this.\" And it's taking a lot longer than we've expected and wanted and whatever, but things are slowly starting to happen, whether it's Twitch Prime or things like this. This is functional, you know, this doesn't hurt anybody and it, it benefits everyone involved. So this, I mean, yeah, this is just a natural evolution for the platform and the program, especially when Amazon bought them. But it has been that thing that Amazon hasn't ruined Twitch. I think that was another concern, right? They're going to come in, **** it",
            "start": 2898.32
        },
        {
            "text": "the platform and the program, especially when Amazon bought them. But it has been that thing that Amazon hasn't ruined Twitch. I think that was another concern, right? They're going to come in, **** it all up. And the fact that you get Twitch Prime with Amazon Prime, it's totally innocuous. It's not something being forced on your throat. That's great. This is great because yeah, it does benefit a streamer if they want to opt in, if they want to be a part of it, because they could easily not benefit them at all. And within the, I mean, if you don't sign up, it doesn't benefit. It's still there. So exactly. And also, I think that it's good because it creates that ecosystem system that is going to benefit Amazon Prime, uh, in terms of being the place people go to to buy games instead of GameStop or Best Buy or whatever. And I think that the more people buying games, the better Amazon system is going to be, the more gamer benefits they're going to add, and 20% off pre-orders and this and that. And it's like this",
            "start": 2938.4
        },
        {
            "text": "and I think that the more people buying games, the better Amazon system is going to be, the more gamer benefits they're going to add, and 20% off pre-orders and this and that. And it's like this could create a really cool ecosystem of what it means to be a gamer that uses Amazon and Twitch. 100%. Next story is over at IGN.com where Joe Scrubbles, a made-up name, says, \"Middle-earth: Shadow of War officially announced.\" Warner Bros. has officially announced Middle-earth: Shadow of War, the sequel to 2014's excellent Shadow of Mordor. It will be released on August 22nd in North America and August 25th in Europe. Australia not confirmed at time of run. Following a retailer leak yesterday, the publisher has officially announced the game for PlayStation 4, Xbox One, including Project Scorpio, Steam, and Windows 10, where it will be an Xbox Play Anywhere title. Developed by Monolith Productions, creators of Shadow of Mordor, the game will once again feature an original story in the Middle-earth universe and will see",
            "start": 2973.24
        },
        {
            "text": "10, where it will be an Xbox Play Anywhere title. Developed by Monolith Productions, creators of Shadow of Mordor, the game will once again feature an original story in the Middle-earth universe and will see the return of Talion. Talion, we're going to call him. We're just going to call him to, to T. His ghostly companion, Celebrimbor. **** dorks with this Middle English garbage, you know what I mean? Mhm. **** hell. Uh, yeah, yesterday's report about the game story content has been proven correct. \"Players wield a new Ring of Power and confront the deadliest enemies,\" reads a press release, \"including Sauron and his Nazgûl in a monumental battle for Middle-earth.\" The game will also feature an expanded version of the Nemesis System. Blah, blah, blah, blah, blah. So exciting times if you were dork in like the **** that garbage. Yeah, I mean, I'm happy another one's coming because people love that ****, you know. So, ex, I, the name I think is a little weak. Yeah, like, I don't know, you couldn't come up with something better",
            "start": 3020.68
        },
        {
            "text": "garbage. Yeah, I mean, I'm happy another one's coming because people love that ****, you know. So, ex, I, the name I think is a little weak. Yeah, like, I don't know, you couldn't come up with something better than Shadow of War when your other one was Shadow of Mordor. Like, I mean, that's what they want to keep, I guess. That's where they want to go, I guess. I mean, it's Arkham Asylum, Arkham City, Arkham Knight. I guess that's weak as well. Sure. Well, but that, I feel like that was what's weak is that there was a hope that this was going to be an Arkham game. They're going to announce a new Batman game. The Arkham Origins to this doesn't do anything for Greg Miller. Yeah, I'm happy you're excited. I'm not trying to rain on your parade. I'm just saying that George R.R. Martin is dumb. I'm saying The Hobbit is dumb. It's just rant saying all your trolls and **** goblin storytelling is dumb and it should all be comic books set in modern time, cause nobody wants to go back and fight **** dragons and ride horses. I",
            "start": 3065.2
        },
        {
            "text": "think a lot of people do. I think Shadow of Mordor did really well. Didn't you enjoy it too? Yeah, I enjoyed, no, yeah, I didn't play a lot of it, but I respect the combat systems. When it, two stories left, we'll go quick. This is a trailer from for Bright. What is Bright, Tim? Bright is a **** Netflix movie. Okay. Is it, Kevin? Yep. Movie. It's a movie starring Will Smith. Yeah, coming this December. Okay, we got a trailer for it written by Max Landis. What, friend of the show, Max Landis. You ready? I'm ready. This land is your land and this land is my land. Is it cool to say I like Will Smith? I feel like Will Smith gets **** on a lot now. Does he? That's cause people don't like his political beliefs. I feel like there's that. They don't like Suicide Squad, even though it won an Oscar. What the **** is that? What the",
            "start": 3107.84
        },
        {
            "text": "gets **** on a lot now does he that's cuz people don't like his political beliefs I feel like there's that they don't like Suicide Squad even though it won an Oscar what the **** is that what the **** is that I'm assuming this doesn't end well ah is that not exactly what you just pitched like put that **** in modern exactly if it turns out that this is George R.R. Martin telling me a new Middle-earth tale and it's got Will Smith and guns I'm like all right I can do that I don't mind that part of the story I it was Max Landis telling you that actually sure that's a great Point too maybe this ties into his comic book too I'm **** sto yeah that looks cool sto I'm sto sto can be a thing it doesn't mean it got stolen it means that you're stoked and sold uh final news story comes from IGN.com where the Boy Wonder of news Jonathan Dornbush reports from D.I.C.E. Marvel Games to tell Original Stories not tell the Canon Marvel Games won't for Force the developers it partners with to",
            "start": 3162.8
        },
        {
            "text": "from IGN.com where the Boy Wonder of news Jonathan Dornbush reports from D.I.C.E. Marvel Games to tell Original Stories not tell the Canon Marvel Games won't for Force the developers it partners with to squeeze their games into existing storylines throughout Marvel's universes speaking to IGN D.I.C.E. 2017 Marvel Games Creative Director and friend of the show Bill Rosemann said I'm sorry instead assured that the teams behind games like Spider-Man for PS4 or Guardians of the Galaxy: The Telltale Series are be are being given the opportunity to create new versions of beloved characters quote we want to give developers freedom to tell their story and we want to make it an original story we want to give our partners freedom to look at all Marvel history to pick from what interests them it's a bit like we're saying hey you're the chef and you're going to make this meal here's all the ingredients you pick the ingredients that you want to make a new meal with he goes on like that but that's awesome",
            "start": 3212.96
        },
        {
            "text": "we're saying hey you're the chef and you're going to make this meal here's all the ingredients you pick the ingredients that you want to make a new meal with he goes on like that but that's awesome great I'm telling you what man Mar there Marvel Games knows what's up hell yeah everybody knows what's up bought up recently that what if what if PS4 Spider-Man was a sequel to Spectacular Spider-Man and I would lose my **** they're not going to do it but that would be fantastic if years later of what happens after he he's out of high school and all that **** get Josh Keaton back to voice him oh wait hell yeah hell yeah but either way I think this is goingon to be great I E3 I assume we're going to see more you of the Spider-Man you'd think hopefully I mean yeah Sony will probably give you a new teaser trailer there and then put 2018 at the end of it okay cuz I want it oh I want a bad I want a bad I want it all up my face yes I want that webbing right around here the whip if you didn't",
            "start": 3255.68
        },
        {
            "text": "a new teaser trailer there and then put 2018 at the end of it okay cuz I want it oh I want a bad I want a bad I want it all up my face yes I want that webbing right around here the whip if you didn't know ladies and gentlemen this is the Kinda Funny Morning Show each and every weekday here on Twitch.tv/KindaFunnyGames we come to you with the nerdy news you need to know about before jumping in the chat to answer your questions comments and concerns but in between those two segments I reach into the internet grab a game throw it to you that's right we give away a full video game each and every day here how do you win the game it's kind of simple kind of complicated but it's not that bad you have multiple options number one you can be in the Twitch chat like many of you are right now live that's it congratulations you're entered or if you're watching on demand on YouTube later on or you're watching with your ears by listening to the podcasts that are available everywhere Please",
            "start": 3296.96
        },
        {
            "text": "live that's it congratulations you're entered or if you're watching on demand on YouTube later on or you're watching with your ears by listening to the podcasts that are available everywhere Please Subscribe like share to them or you're just checking this out later and you want to support us different ways or you want extra ways to win there's three extra ways to win number one subscribe to us on Twitch if you subscribe to us on Twitch you are automatically entered and don't need to be here plus you get the Kinda Funny logo next to your name the cool emotes private chat Time With Us multiplayer with me sometimes and the thing add free unless we bake them in and say **** you and your money hold on you notice the difference there this needs to be stopped here can you guys just appreciate how **** sexy that shot looks with that blurred out background with Greg Miller here we can have a direct **** Focus side by side comparison there compare that shitty ass looking video wall",
            "start": 3333.48
        },
        {
            "text": "how **** sexy that shot looks with that blurred out background with Greg Miller here we can have a direct **** Focus side by side comparison there compare that shitty ass looking video wall **** Jesus you guys are hard on the video that magic everybody magic good job Kev good job BR continue Greg. Hi Jan, it's me Greg. I love you and this is a sexy shot apparently show her the muscles dude like The Rock taught you oh my God I didn't shave my armpits yet uh you can also support us on Patreon.com/KindaFunny or Patreon.com/KindaFunnyGames for $ you get enter to win the raffle plus you get the bonus episodes a month early before anybody else uh also shout out January's bonus episode is now live for everybody on YouTube podcast Services because that's how we're doing it now new stuff on February including an hourong let's play of uh Horizon you and me anyways lots of ways to support us lots of ways to win thank you if you do if you don't no big deal we understand your money's your",
            "start": 3371.84
        },
        {
            "text": "February including an hourong let's play of uh Horizon you and me anyways lots of ways to support us lots of ways to win thank you if you do if you don't no big deal we understand your money's your money uh this winner comes from the Kinda Funny Games Patreon page we are giving away Sub Level Zero Redux on PlayStation 4 this **** looks dope and the winner is Jeremy Hill Jeremy Hill Jeremy Hill I am emailing you with your Patreon provided email address you want a game now you get to play I hope no one breaks into your house in may they steal your soul through your ass oh why why I just made a movie we just wrote a **** movie get Landis on the phone Max I got a thing for you these guys break in they steal Souls through **** we got to stop them not you and me but somebody's got to stop them in this thing I feel like this is a good one for Thomas Haden Church he's the one who's out there to stop **** Soul Stealers holy **** we got a movie you're a crazy person we got a movie",
            "start": 3419.88
        },
        {
            "text": "them in this thing I feel like this is a good one for Thomas Haden Church he's the one who's out there to stop **** Soul Stealers holy **** we got a movie you're a crazy person we got a movie everybody I appreciate it somebody uh whip up the the whip up the poster for that please the guys come in they steal Souls through **** Stars Thomas Haden Church so the brown hole Brown hole I want to call it whole snatcher what if it's brown out whole snatcher whole snatcher fine I lost I mean Browner Brown out oh Brown out you really think no we'll do Soul Snatcher we're going to do Soul Snatcher please submit your Tweet at me tweet at me Max Landis and Thomas Haden Church if he has a Twitter account tweet me your posters we'll go through them Wednesday on the show uh let's see close out the tips here close them things out Greg the final tips we got one from Laona Sabosa no **** no message but thank you very much uh Mario Not Bro says oh my God I know we probably have call tips by now",
            "start": 3474.4
        },
        {
            "text": "tips here close them things out Greg the final tips we got one from Laona Sabosa no **** no message but thank you very much uh Mario Not Bro says oh my God I know we probably have call tips by now I'm sorry I fell asleep anyway Tim your exclusive with Tone Dee was amazing one of my favorites so far Greggy kill it ice love you thank you very much thank you everybody saying nice things about the interview with with Tone Dee which is great which I can only describe as a 90-minute circle jerk and it's fantastic who doesn't want to watch that the Philan Death gave a tip said hey Tim are you going to have time for Nier: Automata it is it is it Doom to fail coming out so close to Horizon Zelda Mass Effect and Persona love you guys keep it the good work I think it's doomed to fail regardless of any of that stuff sales I think it's going to be great um I I think it's going to be an eight out of 10 game but I think that that's what it needs to be um I think it would sell the same even if it was",
            "start": 3533.04
        },
        {
            "text": "of that stuff sales I think it's going to be great um I I think it's going to be an eight out of 10 game but I think that that's what it needs to be um I think it would sell the same even if it was coming out at a different time like that's just one of those games if you're going to buy it you're going to buy it you know so the other games are people are going to get those we know those are going to do well this is the one that's like I I think it's an awareness game people need to spread the awareness of how awesome it is I'm very concerned about when I'm going to get time to play it but I also don't think it's going to be that long so yeah after three playthroughs you can buy the trophies that you don't have with in-game currency really yeah that was that came out off the Japanese uh version of the game that yeah you play it three times and then you can go through and buy the trophies interesting like with real money no in game currency now the problem is the game's not out I'm not",
            "start": 3579.36
        },
        {
            "text": "of the game that yeah you play it three times and then you can go through and buy the trophies interesting like with real money no in game currency now the problem is the game's not out I'm not sure if you can buy in-game currency or if it's just something you grind out in the game or whatever I'm sure there'll be a discussion on PS I Love You about this uh DJ Kento gave another tip said Bright is quite literally literally Training Day means Dungeons & Dragons from David Ayer director of the Oscar-winning Suicide Squad and author of Training Day and then final tip comes from Walter White who says what's up guys I'm going to college to study journalism probably South Carolina Gamecocks I also want to edit videos and get involved in film how do I find a how do I find good work as a novice 18-year-old college student you got to do internships and stuff like that probably I mean your school if you went to a good one like Mizzou and you were doing journalism you'd be doing it right there",
            "start": 3617.6
        },
        {
            "text": "18-year-old college student you got to do internships and stuff like that probably I mean your school if you went to a good one like Mizzou and you were doing journalism you'd be doing it right there you'd be working for the papers you'd have a whole bunch of Clips but you're going to South Carolina I understand you're you're dumb one of them dumb kids uh do your internships go ahead and apply everywhere start reaching out making contact and talking to people let's jump into the chat let's jump in the chat we do three oh God I can't wait QB Studios says you guys have talked before about split screen going away with onl online play how did you feel about Microsoft saying the lack of split screen in Halo 5 was a big mistake and it will be returning for Halo 6 in future Microsoft titles yes **** you Colin **** all the haters split screen is the way to go now and forever especially for games like Halo love that **** it provides options that's all we need in life is options options I",
            "start": 3657.68
        },
        {
            "text": "you Colin **** all the haters split screen is the way to go now and forever especially for games like Halo love that **** it provides options that's all we need in life is options options I want to play this way if I want to play this way give me them give me them X going to give it to you I hope that Microsoft gives it to me Xbox is going to give it to me okay okay um there's a can you pull another one cuz right here somebody here was the Mega American said Greg can you show us the the case you order for the Switch I'm I'm trying to pull that up so I'm digging through my Amazon orders here here it is and then I'll sh I'll give it to one we ordered big Kev dog right yeah that's not one we order it is it is yours sorry they fre out that picture yeah that one so here's the one Kevin I'm I of course closed the document cuz I'm **** stupid no you're great all right how good is this lens I put at the top there if you can throw that open Kevin this is the PDP one I ordered",
            "start": 3692.16
        },
        {
            "text": "Kevin I'm I of course closed the document cuz I'm **** stupid no you're great all right how good is this lens I put at the top there if you can throw that open Kevin this is the PDP one I ordered now two things have happened since I ordered this because this is the only case we had seen at the time and as you can scroll on those little images over there the official Nintendo one that I assume I hadn't seen it before now we have it are we allowed to say that can we show that where the Embargo information for that oh I have no idea Kevin can you grab the case off my desk give me yeah all right uh this one has been an this is the one we bought I think it looks really cool MH then uh SF Bags Waterfield Designs the ones who made my V Case they announced their own one as well the problem being it's huge it's humongous it keeps the dock in two Pro Controller like I don't want a bag all that this is the official Nintendo one yeah it's similar I still think that one looks nicer it does",
            "start": 3743.28
        },
        {
            "text": "being it's huge it's humongous it keeps the dock in two Pro Controller like I don't want a bag all that this is the official Nintendo one yeah it's similar I still think that one looks nicer it does and it's got that nice Kevin can you scroll over to the one where it zipped closed uh yeah sure there you go it's that looks nice this one no offense in know this one's fine it'll get the job done but that one has style to it this one's just like all right here you go it says Switch it says this it also doesn't feel that protective but this part will protect the screen fine I'm sure yeah kind of looks like yeah it looks like that one looks fun it's and fashionable I mean I'm down for either like I'm just about the functionality of it but you're right that one does look better so I ordered it I'm excited about it all right uh Tyson Rhino said and this is the final one before we're get into sub only Greg would you accept a challenge in Madden or you coward like Tim with Crash Team Racing I love",
            "start": 3785.4
        },
        {
            "text": "about it all right uh Tyson Rhino said and this is the final one before we're get into sub only Greg would you accept a challenge in Madden or you coward like Tim with Crash Team Racing I love you Tim just playing along I love you uh you'd beat me in Madden there's no reason to play Greg Miller probably could have whipped your **** ass at NCAA Football in 0 summer of 000 MH uh but I I don't play like I ever played I don't play those games anymore like I used to play so that's done we're in subon mode one of the benefits of this uh Kevin were any of the fun Clips worth watching um you know actually all three have been placed to watch the only one that's I have a little bit of questions is the the first one okay but uh this is the unboxing from that kid yeah but it looked like he would go to a fun place with it so it looks like it's a long clip did he get it did he give us a time stamp he gave us a Time step of 1 minute so let's watch 10 seconds we're to give you 10 seconds of this",
            "start": 3825.32
        },
        {
            "text": "go to a fun place with it so it looks like it's a long clip did he get it did he give us a time stamp he gave us a Time step of 1 minute so let's watch 10 seconds we're to give you 10 seconds of this this is one of your brothers unboxing Splatoon it looks like he has some kind of cat behind he said parts of it were cringe worth I think the guy's just starting you know what I mean ready yeah what these do in the game is they lock music videos the Squid Sisters are back at again with brand new hits so switch on your Nintendo Wii U System I apprciate this get these Timeless classic featuring Calamari Incantation is that enough of that yeah that's enough I appreciate what he's working on go over there give him a view give him a sub like them share them subscribe his channel is called John Open Stuff John Open Stuff yeah that's pretty **** good that's a really good Channel Hey Tim did you ever get back to that dude that straight called you out I didn't get back I mean I told him that I'm",
            "start": 3869.84
        },
        {
            "text": "stuff John Open Stuff yeah that's pretty **** good that's a really good Channel Hey Tim did you ever get back to that dude that straight called you out I didn't get back I mean I told him that I'm still thinking about he called him and he was like Hey I'm a **** so don't worry about it what's the next fun clip that wasn't terrible ready yeah I that is fun I was that was a good fun clip that was a good fun clip all right all right ready and here's our final fun clip of the day have you seen this at all is our final fun clip of the day yeah it's the final one all right cool before you did win it my name is today very lucky congratulation me yay English no program only so so um is he **** with him I don't know but he's awesome yeah good for him okay I like that I like that **** get him let's see what got happened in the sub only chat over here now I got a text from my mom she yeah what she saying that I thought was was worth sharing she just out don't know where",
            "start": 3923.6
        },
        {
            "text": "that **** get him let's see what got happened in the sub only chat over here now I got a text from my mom she yeah what she saying that I thought was was worth sharing she just out don't know where it says you know I can spend several days blowing up balloons for Kinda Funny Live 3 oh thank you very much I I I enjoy that but it's not out of nowhere I think the breakouts we started talking about the great maybe not doing the balloon knowing my mom watches stuff is the worst thing she watches everything from what I hear yeah I know Robert Ramirez9 says hey Tim love your drunk Instagram video the other night congrats on being the best man how did you feel the next morning yes congratulations yeah you're Colonel's best man I'm Colonel's best man the first time I've been officially someone's best man have you already written the speech do you already know what you're doing made the video I've been no there's been a lot of I'm working on all of it they announced the date for the",
            "start": 3992.24
        },
        {
            "text": "someone's best man have you already written the speech do you already know what you're doing made the video I've been no there's been a lot of I'm working on all of it they announced the date for the wedding it's next year um so I'm I'm excited about all that stuff it was fun they did this whole like present thing where they invited all the groomsmen and bridesmaids just to like hang out um and then like brought us into their room eventually like after everyone was really drunk and there was like this whole presentation oh wow really yeah there was like everyone had we had custom hats and we had **** like balloons and **** mine was blue nice of course of course of course um yeah it was great it was a fun fun experience they did good we got trashed like I haven't been that drunk in a long time yeah and yeah then I upside down sideways I know why they all sideways said down you're **** around that's what yeah but anyway I I like getting drunk and posting Instagram videos which is",
            "start": 4031.2
        },
        {
            "text": "time yeah and yeah then I upside down sideways I know why they all sideways said down you're **** around that's what yeah but anyway I I like getting drunk and posting Instagram videos which is probably not a good thing no not a good but it fits it's on brand it's on brand KingFranchise88 says Tim when can we see pictures of your Switch with the two sexy blue Joy-Cons attached dude let me tell you I hope soon Friday I'm assuming Friday is like when they'll come in cuz I have them on order we got a lot of stuff coming I got my own I just I want my own Pro Controller like I hate that there's only one here cuz this thing is I still say you can keep taking it I mean if you're okay with that I will I have mine coming on Friday then we'll leave the one you get on Friday here or whatever got it works for me cuz yeah this thing expensive yes but the battery life on it is ridiculous puts like DualShock 4 to utter shame oh wow yeah I'm I'm bounce it that's the problem there yeah there's",
            "start": 4070.84
        },
        {
            "text": "it works for me cuz yeah this thing expensive yes but the battery life on it is ridiculous puts like DualShock 4 to utter shame oh wow yeah I'm I'm bounce it that's the problem there yeah there's other things I want to say but I can't save them yet I save that for yes of course of course of course um Walter White says guys I love open world games like Fallout but I'm worried about not knowing anything thing about the story of Horizon Zero Dawn how did you feel about the narrative being told it's an excellent narrative it's told very well keeps you engaged yeah my favorite part of the game I think it caught me off guard I wasn't expecting to be like holy **** I want to do the next Story Mission the next story mission to find out what's going to happen but they reward you early on and keep you rewarding and there's twist and turns I want one final one here for you or me I don't care uh DrewBaka1313 says any members of the Kinda Funny crew at IGN today for their stream this",
            "start": 4111.4
        },
        {
            "text": "and keep you rewarding and there's twist and turns I want one final one here for you or me I don't care uh DrewBaka1313 says any members of the Kinda Funny crew at IGN today for their stream this afternoon no they invited us we're just way too busy with GDC yeah go check it out though it's for a good very good cause the yeah the Video Game History Museum this is for video game history so go support them a lot of our homies and friends are going to be helping out with that stream ladies and gentlemen this has been the Kinda Funny Morning Show for February 27th, 2017 thank you so much for joining us remember Kinda Funny Morning Show Goes live each and every day 11:00 a.m. here on Twitch.tv/KindaFunnyGames or you can catch it later on YouTube or podcast services around the globe would mean a lot if you gave us a few bucks for it but if you can't no big deal we ain't mad but you if you have Amazon Prime you have Twitch Prime you can sub just like all these people did do you want to",
            "start": 4147.88
        },
        {
            "text": "mean a lot if you gave us a few bucks for it but if you can't no big deal we ain't mad but you if you have Amazon Prime you have Twitch Prime you can sub just like all these people did do you want to read subs today sure feel like I've been talking for a long time yeah I'll do it these are if Tim reads your name you are a sub or a resub we love and appreciate you yeah especially PimpDaddyTrickySackMangleSvingGatorEvilZarEduFish94 ReedAllen13BG580 says 7 months with you beautiful bastards excited to get my Wii U copy of Zelda on Friday TabScap says I rarely get to watch live anymore but I'll continue supporting you guys keep up the good work thank you thank you it means a lot that one Andrew love watching your streams all the time Ray you're the best streamer ever hash Ray thanks Ray name goes here Parker493 TomareNeoGNeoJAvyMikey just says XD XD Conor just subscribed GooStatus NBPrimeFers48 JPiser says you guys got to get Jessica Chobot for one of your",
            "start": 4194.84
        },
        {
            "text": "thanks Ray name goes here Parker493 TomareNeoGNeoJAvyMikey just says XD XD Conor just subscribed GooStatus NBPrimeFers48 JPiser says you guys got to get Jessica Chobot for one of your shows the great Chobot Combo was nice to see at the D.I.C.E. Awards how can we make that happen we I told her I'm like she we were talking about it open you know she's a few different things coming up to promote I was like we'll get schedule around one of those good yeah we love J. Jess totally come up we should get her on we should do it two and two two Gamescast topics two GOG topics or just have on both shows sure regardless JobJob388 says thank you guys for a wonderfully crazy ride who's better Emma Watson or Emma Stone come on why we why why we got to do that no need to choose DLResoGunray thanks friends that's Switch1 I'm just a billy here's another Prime sub Aron thank you NXAlexander50 LobDens BobsHD MassBoilerKza RickAndDragon RickDuffMan990 DKoyStudios which by the",
            "start": 4239.0
        },
        {
            "text": "friends that's Switch. I'm just a Billy. Here's another Prime sub, Aaron, thank you. NX Alexander 50 Lobdens, Bob's HD Mass Boiler KZA, Rick and Dragon Rick Duff Man 990D Koy Studios, which by the way, I see you all the time in the YouTube chat, in YouTube comments, so thank you for for being supportive. You guys have talked before about split screen going. We already talked, we already we already talked about this in the show. And Patty P 5464 says, you guys are awesome. Thank you, Patty. Wraith Guard B 1989 1889, actually. The Vitar Bob the Swan. Dustin Pearl says, Let's Go Blue Jays. Jugon XT 84 says, RIP Bill Paxton. I was watching Titanic a couple cou nights ago. Yeah, so to your heart screen, sir. KC Hammer Kobe Connor says, trying to finish up Rise of the Tomb Raider to perform my pre-order for Horizon Zero Dawn tomorrow. I just love my bow wielding female lead open world action adventure RPG games apparently. So many dashes in there. Uh, J Mill 1138 says, what up from UPenn? Shout out to UPenn GZ. What do you call them?",
            "start": 4290.96
        },
        {
            "text": "I just love my bow wielding female lead open world action adventure RPG games apparently. So many dashes in there. Uh, J Mill 1138 says, what up from UPenn? Shout out to UPenn GZ. What do you call them? Alma Mo. Alma Mo. Uh, I've been watching you guys for years and enjoy the content. Keep up the awesome work. We will. A couple days ago, G, we were walking uh down near um Ninth and Irving. Yeah, and we saw this couple walking and he had a UPenn shirt and she like looked at UPenn and he just did not respond at all. Just kept walking. And I was like, that is just like like we have the Kinda Funny like things go on. You **** Mizzou. You people got **** down this guy. I've I've been hung off to die on the Mizzou before. Mizzou to a guy in a Mizzou shirt and he goes, yeah. Like, no, you ****. What? How old are you? When did you graduate? You **** idiot. And then I beat him to death and then Kevin hides the body. It was easy. Copyright of these says, Tim, you finished Final Fantasy XV yet? Where would you rank it with your favorite Final",
            "start": 4352.68
        },
        {
            "text": "**** idiot. And then I beat him to death and then Kevin hides the body. It was easy. Copyright of these says, Tim, you finished Final Fantasy XV yet? Where would you rank it with your favorite Final Fantasy games? I'm I beat it, but there's like still like a lot of the of the random story elements that I want to do. So I I before I rank it with the other Final Fantasies, I don't want to like understand it, give it. But it's up there. Uh, it's not way up there, but I'd say it's definitely top five. Keep in mind, I haven't played them all, but I haven't played them all 'cause I'm not too interested in them. So top five says, how's Porty doing? Thanks for nine awesome months. Porty's doing great. Got him back from pet camp. Uh, he's doing good. Still growing his hair back. He was super tired. Had another seizure. Jen makes him seizures. Got to figure that out. She makes him seizures. Yeah, usually what happens with Porty in his seizures is and this is the idea, it's always his seizures usually happen around someone visiting. His first",
            "start": 4400.04
        },
        {
            "text": "seizures got to figure that out. She makes him seizures. Yeah, usually what happens with Porty in his seizures is and this is the idea, it's always his seizures usually happen around someone visiting. His first one ever was when I had friends from college. Then it was Porty. Then it was Mom. And and so it was like, oh, when people are here, he must not be eating or drinking enough or something like that. And he just short out. And then I've noticed like with Jen being around so much lately, like he's having a multiple times in this trip. And like last night he seized in bed again. And it's like, ****. I know you're eating and drinking, so I don't know why why I don't know. It's just the excitement. He literally gets so excited his little brain fries out. I don't know. Holy ****. That sounds so scary. And well, now it's just so now it's just normal. Joey Noel says, am I writing this from the next room over? Maybe. Don't forget to sign up for Extra Life. kindafunny.com/EL. I don't know if that matters. I'm",
            "start": 4444.64
        },
        {
            "text": "just so now it's just normal. Joey Noel says, am I writing this from the next room over? Maybe. Don't forget to sign up for Extra Life. kindafunny.com/EL. I don't know if that matters. I'm literally it does. I don't know why I shout it out. Just let does it matter? Says Kevin. I'll test it. No, it's fine, Kevin. I trust you. I'll test it. English Half Irish says, Bond **** goes, I squeeze butts. Just subscribed. The real Tim Shady says, love you guys. Thanks for all you do. Ray Ray Play Crazy Dogs. Masan 08 Greener 4 4. And finally, the real Nard Dog Bernard. What? Hey, I just checked. It definitely doesn't matter. Okay, good. And Joey Noel. Hey, Joey Noel, Community Manager. I'm here. How are you? I know for Extra Life there. Good, ladies and gentlemen, this has been the Kinda Funny Morning Show. Thank you so much for joining us. We'll see you tomorrow when it'll be Nick and Tim because I'll be downtown seeing games for GDC that I can't tell you about until I can tell you about them. Then we'll do a whole bunch of",
            "start": 4482.36
        },
        {
            "text": "joining us. We'll see you tomorrow when it'll be Nick and Tim because I'll be downtown seeing games for GDC that I can't tell you about until I can tell you about them. Then we'll do a whole bunch of stuff about that. And it's a big week full of content. Oh, we didn't mention this earlier because we don't remember things too well. Next week, we're going to PAX East on Thursday. Uh, no Kinda Funny Morning Show the entire week. They're going they're going off to do something on Tuesday. So we would just have Monday and Wednesday. But Colin's got to do Colin Was Right. I've got to do this. There's a million other things going on. So just no shows at all next week for the Kinda Funny Morning Show. Two silver linings to it. Number one, this week, Colin's doing a whole bunch of Colin Was Right interviews. Those will all go live next week. Five of them. Five pieces extra content. Hour-long interviews with the likes of Jeremy Dunham, Jason Schreier, Mike Bithell, a whole bunch of cool kids. Then even more exciting when",
            "start": 4533.64
        },
        {
            "text": "those will all go live next week. Five of them. Five pieces extra content. Hour-long interviews with the likes of Jeremy Dunham, Jason Schreier, Mike Bithell, a whole bunch of cool kids. Then even more exciting when we do come back from PAX East. Bye, Joey Noel. When we come back from PAX East on the 13th of March, Monday the 13th, Kinda Funny Morning Show, probably all of us, Blessing, and the one and only Cisco the Dragon will join us. The Dragon is coming through to the morning show. Then in the afternoon, game doing a GameOverGreggy Show with us. We are super excited. Is this subject to change? 100%. It's the Dragon. He he is one of these Hollywood rapper types who's just, you know, maybe he's in Paris this week. Maybe it's one of his clones. Nobody knows what's going on. Who knows? So he's very popular and very busy. But Cisco the Dragon coming through for the Kinda Funny Morning Show Friday the 13th. I don't know if you made this clear or not 'cause you said all this stuff. I was listening to you, but just to emphasize, next week,",
            "start": 4567.92
        },
        {
            "text": "Dragon coming through for the Kinda Funny Morning Show Friday the 13th. I don't know if you made this clear or not 'cause you said all this stuff. I was listening to you, but just to emphasize, next week, every day there will be a Colin Was Right. Five of them. Every day Colin Was Right. Unless something goes horribly wrong. And what's the chance that happen? Five five of them total. Five Colin Was Rights total. Every day. No, well, I know you said five of them every day. Once a day. Once once every work day, Monday through Friday. I'm just trying to make sure we're very clear with you. I'm not mad. I'm just trying to be clear. I'm just being trying to clear with you. Excellent. All right. Love you guys. Bye bye. Cut.",
            "start": 4613.32
        }
    ]
}