{
    "id": 2408,
    "video_id": "J9cNyNicubs",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Nick Casts Actors As Game Characters - Kinda Funny Gamescast Ep. 107 (Pt. 4)",
    "description": "Nick is a certified crazy person.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1487250002,
    "duration": 967,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by MVMT Watches. MVMT Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices. With over 500,000 watches sold to customers in over 160 countries around the world, MVMT Watches has solidified itself as the world's fastest growing watch company. That's right, MVMT Watches. MVMT Greg Miller has had his sexy, you know, the sexy one with the red hands and the black face and it's look good. MVMT Watches started just $95. At a department store, you're looking at $400 or $500 bucks. They're expensive. MVMT figured out that by selling online they were able to cut out the middleman, retail markup, all that stuff, providing the best possible price. We're talking classic design, Quality Construction, styled minimalism. It's everything you can want. You can get yours with 15% off today with",
            "start": 0.16
        },
        {
            "text": "markup, all that stuff, providing the best possible price. We're talking classic design, Quality Construction, styled minimalism. It's everything you can want. You can get yours with 15% off today with free shipping and free returns by going to MVMTWatches.com/kinda. If you like super clean designs and getting compliments, now's the time to step up your watch game. Go to MVMTWatches.com/kinda. Join the movement. Still one of my favorite catchphrases. Good job, guys. Last up of the day, as always, brought to you by you. You can go to KindaFunny.com/gamescasttopic. Leave your questions for us and we will answer them this week. Very Nick themed. I decided to kind of, you know, bring you back into the fold here a little bit. Um, wasn't planned to have you on the whole show today. It was supposed to be just a topic, but then kind of just fell into it and we're like, why not? Why, you know, let's just roll, roll through this. So Richard Welch, okay, says, I'd like to see him cast video game characters. Cast",
            "start": 39.2
        },
        {
            "text": "be just a topic, but then kind of just fell into it and we're like, why not? Why, you know, let's just roll, roll through this. So Richard Welch, okay, says, I'd like to see him cast video game characters. Cast video game characters. I imagine he means in a movie. Oh, in a movie. So I'll throw, I'll throw some characters at and we'll, let's just start off old braining, you know, with a nice Segway. Solid Snake. Solid Snake. Uh, I mean, obviously, the obvious answer is Michael Biehn because that's the character on the covers based off of. Michael Biehn's career did not pound out the way he wanted to. Also, he's a bit old for that. I would say a Taylor Kitsch would be awesome for a Solid Snake or uh, maybe someone, oh, let me think. Who, who am I thinking that I love right now? Yeah, I would go Taylor Kitsch. I love him and he's so underrated and he's so underused. Unfortunately, who else? They make it a Legend of Zelda movie. Okay, who's Link? I think you cast Zelda. You cast. Hmm, interesting, interesting because you have a character",
            "start": 97.76
        },
        {
            "text": "so underrated and he's so underused. Unfortunately, who else? They make it a Legend of Zelda movie. Okay, who's Link? I think you cast Zelda. You cast. Hmm, interesting, interesting because you have a character who's got to be childlike, doesn't speak. Haley Joel Osment for Link. And then he grew up, you know, right? No, he's grown up. He'll always be that kid that's six, seven for me. And I would cast Emma Watson as Zelda because I want to, I just would want to work with her 100% in the whole, well, now you're directing the movie. I like that. Of course, **** yeah, I'm casting. If I'm casting the movie, I'm clearly directing the movie. Got it. All right. Uh, let's go with just any video game character at him. Oh God, Greg, right? Dark Chief, DARPA Chief. You've already cast it for Metal Gear. Oh, uh, this the guy that hosts Family Feud, Steve Harvey. By the way, Steve Harvey, very universal actor. He could have played all the roles you already talked about. Very true. He could play Zelda. He could play Link. Absolutely 100%. Okay, so any",
            "start": 141.76
        },
        {
            "text": "Steve Harvey. By the way, Steve Harvey, very universal actor. He could have played all the roles you already talked about. Very true. He could play Zelda. He could play Link. Absolutely 100%. Okay, so any video character? We already do Nathan Drake? Do we already figure? No, did Nathan Drake go for it? Nathan Drake. Hmm, I mean, the obvious, see, I don't want to go the obvious though, because everyone's always like, it's either Bradley Cooper or uh, uh, what's his butt from Jurassic World, Chris Pratt? I don't want to go there though. Nathan Drake. Hmm, how, how about you can think about it if you want for, think about that for a second. How about this? How do you feel about the Tomb Raider girl, woman, Alicia Vikander? I don't know anything about her. I saw that first set photo of her though. I like, she was, I love it. Oh, I do know her then. Okay, yeah, she photos of her. I was like, oh, ****, looks just like the game. This looks just like the game. Good for you guys. She's an amazing actor. I think they did a great job with that. Let me",
            "start": 193.8
        },
        {
            "text": "okay, yeah, she photos of her. I was like, oh, ****, looks just like the game. This looks just like the game. Good for you guys. She's an amazing actor. I think they did a great job with that. Let me this you, yeah, Crash Bandicoot. Crash Bandicoot is a CG movie. Are we doing the voice of it or does someone actually have to be in a Crash Bandicoot costume? Because I very much, they're casting the commercial and they're putting him back in the suit. We're casting. If we're casting Crash Bandicoot, I think we have to bring back probably arguably the most underrated comedian ever to live, Mr. Carrot Top. I think Carrot Top has to be Crash Bandicoot. I think it has to be. I like it. Like if it's the voice of Crash Bandicoot, I think there's only one person who can do it and that man's name is Tim Gettys. Thank you. Thank you. I'll take it up. If I have to take up the mantle, boogah. Mhm. Trying to think of a fun one. Bayonetta. Ooh, ooh, that's tough. You want to go with someone like a Rose McGowan, but I don't know if",
            "start": 236.48
        },
        {
            "text": "you. Thank you. I'll take it up. If I have to take up the mantle, boogah. Mhm. Trying to think of a fun one. Bayonetta. Ooh, ooh, that's tough. You want to go with someone like a Rose McGowan, but I don't know if Rose McGowan's doing stuff like that. I was thinking Ashley, Ashley. I was thinking Angelina Jolie. Yeah, she might be a little too motherly now. Okay, okay. You know what I mean? Well, she's out in the press now. What's that? Oh, she has, that's right, right. They broke up. Bayonetta kind of has like a sexy thing to it. She got the librarian thing on it. Yeah, at least Bayonetta 2 definitely. Yeah, yeah, that's a, that's, that's, I mean, there's lots of women that could, that could do that. I want, I would want to put like, I want to put like an Eva Mendes in that just to see what it's like. I know the character is traditionally supposed to be Caucasian, but mhm, there's a Japanese, it's, she look kind of a witch. She's from, yeah, she's white, but I would do like an Eva Mendes in that, like a Jessica Alba. Get a little flare. I like that.",
            "start": 277.44
        },
        {
            "text": "to be Caucasian, but mhm, there's a Japanese, it's, she look kind of a witch. She's from, yeah, she's white, but I would do like an Eva Mendes in that, like a Jessica Alba. Get a little flare. I like that. Hot. I like the Jessica Alba factor. I mean, they don't have to be like, you know, uh-huh, all that crazy. Pac-Man and four ghosts. Pac-Man, we got to go with Adam Sandler and the four ghosts, all the other people whose names I don't know in the Adam Sandler crew. Gotcha. In Pixels. Yeah, Pixels, pretty much the same crew worked with since Happy Gilmore and Billy Madison. Big, uh, Lee Everett and The Walking Dead. Do you ever, you know, The Walking Dead, Dave's character? Oh, Dave's character. Yeah, then, then Dave. Okay, okay, perfect. Well, do that. Dave is one of those fascinating guys that he's super talented and I want him to do more live action work. Yeah, me too. Um, and I don't get me wrong, I like Eze on The Walking Dead right now, but I think Khary Payton, Khary Payton, however you pronounce it, I think Dave would have crushed",
            "start": 324.6
        },
        {
            "text": "do more live action work. Yeah, me too. Um, and I don't get me wrong, I like Eze on The Walking Dead right now, but I think Khary Payton, Khary Payton, however you pronounce it, I think Dave would have crushed that role. Final one, yes. Super Mario and Luigi. If they were to make a live-action movie. Live-action movie. Well, I mean, I think you got to bring back John Leguizamo was on it. John Leguizamo was, we lost, unfortunately. Bob Hoskins is dead. Yeah, that's sad. Um, didn't have a one-up Mario. I, he's a real man who died. I feel like if you want to get crazy about it, you want to get **** crazy about it, you want to get like, take it up to $200 million, $300 million budget. Yeah, Mark Wahlberg as Mario. No, stop putting Wahlberg in everything. Yes, I'm kind of down. Or no, Mark Wahlberg as Mario, The Rock as Luigi. You got to do it. You want to do Vin Diesel as Mario? I want The Rock as Toad. I feel like that's Toad. Be amazing. That would be amazing. Okay, so we're casting Super Mario Bros. The Movie. Okay, all right. It's going to be a semi",
            "start": 373.12
        },
        {
            "text": "do Vin Diesel as Mario. I want The Rock as Toad. I feel like that's Toad. Be amazing. That would be amazing. Okay, so we're casting Super Mario Bros. The Movie. Okay, all right. It's going to be a semi-reboot sequel to the 90s movie, but this one, it's of Super Mario Bros. 2. Okay, where they're in Subspace, or not sub, yeah, Subspace, sub, uh, not Emissary, just sub, Subspace. And uh, you, we need Mario, Luigi, Peach, and Toad. I'm, I'm sticking with Mark Wahlberg for Mario. Okay, feel like that works. **** this movie. I don't know why Hollywood, either Mark Wahlberg or Channing Tatum for Mario. But if Mark Wahlberg, if it was Channing Tatum, then you got to go, you got to flip it a little bit and maybe go Channing Tatum as Luigi and Jonah Hill or Seth Rogen as Mario. Got that connection. Or if you want to go R, like hard R it, and you want to bring a little like, not go true to form, like maybe one of them was adopted by the Italians, you go Danny McBride and Craig Robinson as Mario and Luigi, right? Or Craig Robinson can play",
            "start": 418.92
        },
        {
            "text": "it and you want to bring a little like, not go true to form, like maybe one of them was adopted by the Italians, you go Danny McBride and Craig Robinson as Mario and Luigi, right? Or Craig Robinson can play Toad because that kind of is fun, right? So any combination of that of like the Danny McBride, Channing Tatum, Craig Robinson, and then for Peach, I'm going to go with Aubrey Plaza because I just watched Dirty Grandpa and now I have a huge **** crush on that. She's great. Huge crush on her. What about Zac Efron could also be a Solid Snake? I just want you guys to know that. Robert De Niro for Mario. He's a little, yeah, he could work. I mean, he's an amazing actor. Yeah. Um, I think he could definitely work. Um, but I feel like you want the Mario character if he's going to be acting opposite Channing Tatum and Craig Robinson, you might want him to be in that, in that H brackets, you know what I mean? Steve Harvey on the other hand would make an amazing Mario because as we know, Steve Harvey would make an amazing",
            "start": 470.72
        },
        {
            "text": "Robinson, you might want him to be in that, in that H brackets, you know what I mean? Steve Harvey on the other hand would make an amazing Mario because as we know, Steve Harvey would make an amazing, he's the Mushroom Kingdom King, right? Oh, the king. Who do we cast as Bowser though? Do we have to have a bad guy here? No, Bowser's not in Super Mario Bros. 2. He's like a frog, a frog and Birdo. Who's Birdo? Birdo. I mean, I feel like that's maybe where John Leguizamo can come back into play. Oh no, things didn't turn out too well for him. No, I don't know. I mean, you know, his career's, he's had a great career, you know, always gives Birdo vibes to me. Alfredo Diaz, I can see him playing a hell of a Birdo. He could be a great Birdo. Someone about, I love that his pretty from Street Fighter to, to worry about it. What? It's not a crossover. We don't have to worry about it. He, I guess you're right, he can be both. You're right. Lilu says, how do y'all feel about that Castlevania cartoon? Have you heard about this? Yeah, I heard about on",
            "start": 514.52
        },
        {
            "text": "we don't have to worry about it. He, I guess you're right, he can be both. You're right. Lilu says, how do y'all feel about that Castlevania cartoon? Have you heard about this? Yeah, I heard about on the news. I haven't seen. Did you hear more details about it? No, all I saw was what we kind of covered the last story when you and I were doing. Animated by Frederator. Oh, really? Okay, so that's just going to be good. Produced by Adi Shankar. Oh, that's right. I did hear that. Hard R. That's going to be awesome for this thing. That's going to be amazing. Hell yeah. Adi Shankar, for those of you who don't know, produced Dredd, but he also more importantly did that amazing uh, Power Rangers short that came out about a year and a half ago with uh, Katee Sackhoff and James Van Der Beek. Directed by Joseph Kahn of Taylor Swift video and the Thong Song video and Larger Than Life by Backstreet Boys. Joseph Kahn's a bad ****. He really is bad ****. Comic book writer, Warren Ellis. Oh, Warren Ellis. No ****. From uh, did he write Preacher? No, he did the Extremis thing. The",
            "start": 564.2
        },
        {
            "text": "Thong Song video and Larger Than Life by Backstreet Boys. Joseph Kahn's a bad ****. He really is bad ****. Comic book writer, Warren Ellis. Oh, Warren Ellis. No ****. From uh, did he write Preacher? No, he did the Extremis thing. The Iron Man: Extremis was the thing he did that. Plan very exciting. Hellblazer, The Authority, Red. That's going to be dope as ****. Yeah, I'm very excited about that. Yeah. Matthew Evans, I'm calling it right now. Colin will hate it. Go ahead. Matthew Evans says, I don't, Colin even watch it. Oh, he watch. Oh God, I don't want to watch cartoon. Matthew Evans says, as someone who's big into production, what draws Nick's attention to a game? The design, music, the setting, things like that. Definitely the style. Like for instance, Hitman. The style, the music actually really got me when I was walking around and it felt like a 60s Noir secret agent film. I was like, I'm really getting into this. So yeah, definitely. Um, oddly enough, the cinematics don't really draw me in. I like, I like storytelling through gameplay. And so if",
            "start": 602.88
        },
        {
            "text": "a 60s Noir secret agent film. I was like, I'm really getting into this. So yeah, definitely. Um, oddly enough, the cinematics don't really draw me in. I like, I like storytelling through gameplay. And so if I'm actually playing a game and and I get a sequence of cinematics that are just characters in uncanny valley, it doesn't really draw me in. Um, but I do like, I, I like discovering those stories kind of organically through the gameplay. Jose Lewis AKA Pello14 says, what's the first video game you played and could you ever fathom that you'd be going to work in an industry related to them? No, because I never really wanted to. Um, the first game I think I remember playing was, was Jesus Christ, it was, got to be on the Apple IIc, because I think that was the first like computer that I had that could play a game. It was either that or the Atari 2600. And I think that was like, like River Raid, I think was a game right on Atari. I remember playing that. And then also, uh, the, the, the game that I wanted to master so badly,",
            "start": 649.4
        },
        {
            "text": "was either that or the Atari 2600. And I think that was like, like River Raid, I think was a game right on Atari. I remember playing that. And then also, uh, the, the, the game that I wanted to master so badly, but never could because I loved the movie franchise so much, Aliens, which was on the Apple IIc. And it was **** impossibly hard. It was so hard. I got to the, I got to the ending every time. You just had to keep dropping flares and I just couldn't figure out how to get through it. Probably the easiest game on the planet, but I was like four. Yeah, makes sense. John Leola, if you were to write a video game, what game would you want to write? Oh, interesting. Um, that's a very interesting question. I would probably want to try to write something that played out similar to like a Gone Home because I feel like that's a really good use of the medium that really combines all the aspects of cinema and the interactivity of games to tell a really compelling, cool story. Um, and it's only four hours. So even if you don't",
            "start": 696.64
        },
        {
            "text": "a really good use of the medium that really combines all the aspects of cinema and the interactivity of games to tell a really compelling, cool story. Um, and it's only four hours. So even if you don't like it, it's only four hours. You get through it. Actually, I think that might not even a bit four hours, hours. Um, but I like that. And I like, I like what that, what um, his team did with that where you just kind of go through and experience it and you're being told a story. Firewatch is another example of a game that I really, really, really liked in that regard. Had some problems toward the third act, like everyone knows, but I like, I like the concept of just being in that world, being able to explore it and then experiencing that story kind of organically and the way they did it, I thought was really genius. Jotus says, if you could make any change to the Deus Ex franchise moving forward, what would it be? I mean, another game would be good. Unlikely. Yeah, we'll see. Um, I don't know. I mean, I'm not that deep in",
            "start": 741.16
        },
        {
            "text": "Jotus says, if you could make any change to the Deus Ex franchise moving forward, what would it be? I mean, another game would be good. Unlikely. Yeah, we'll see. Um, I don't know. I mean, I'm not that deep in Deus Ex, but I, but uh, I like, I like the gameplay and I was, I'd like that. I'd like them to make another game, but unfortunately, they're probably not going to. Matt Labuck says, what's the next game you're going to play after Hitman? Probably Uncharted at some point. I have to. Got to go. I've never played Uncharted. I've played the first two hours of Uncharted three times now. I **** you not. I'm like, this game's cool. I should go back to this. And then, you know what's putting me off now is that I just don't want to **** play that sub level again. I don't want to pick up from where you left off. I don't think I have my save. I think I, I did it on yours. That ****. So it goes by so fast. I know, I know. I'm being a **** about it. It's one of those things where like, I, I just, I've been, I've held ground so long on this. And I know",
            "start": 779.8
        },
        {
            "text": "I, I did it on yours. That ****. So it goes by so fast. I know, I know. I'm being a **** about it. It's one of those things where like, I, I just, I've been, I've held ground so long on this. And I know I'm going to like it that I'm just like dreading having to eat my words. You know, you're like, God, I know I'm going to like this one. Yeah, you're, you're, suck it up and go play. Buttercup. Chris Moore says, Nick, what's up with that Robotech Battlecry Let's Play? I'm going to change that question to, have ever, you ever played Robotech Battlecry? Yeah, we should do a Let's Play on that. Really? Can you still? I don't know. Be PS2, GameCube, and Xbox. We get creative. Yeah, we'd have to get creative with that. That was, it was fun. We'd have to like, it had a cool multiplayer. Yeah, did you guys ever play it? No, I didn't. I loved the style that was back when cell-shaded games were still like a huge deal. So it was like, oh man, unfortunately, the actual single player campaign for that was not very fun because you",
            "start": 823.44
        },
        {
            "text": "the style that was back when cell-shaded games were still like a huge deal. So it was like, oh man, unfortunately, the actual single player campaign for that was not very fun because you didn't, I think they, there was something off with the sense of momentum they had in space when you actually the Veritech Fighter in space. But when you played the actual battle mode, it was a lot of fun and hard and cool. Very cool. Let's see. Want that Robotech Crystal Dreams Let's Play? Remember that game? No, I don't remember any of these things. I've never even really heard about Robotech. Broke my **** hard. That was when I was hella into video games and I, I wanted an N64 so badly because I wanted to play Mario and I wanted to play Robotech Crystal Dreams. And everyone was like, this game's going to be terrible because you're in space, fight a bunch of crystalloids, just crystals, because that's all that the N64 could render. And then they canceled it. Oh wow. Okay. I think it was a Rare game. Trust me, you could have actually",
            "start": 861.2
        },
        {
            "text": "you're in space, fight a bunch of crystalloids, just crystals, because that's all that the N64 could render. And then they canceled it. Oh wow. Okay. I think it was a Rare game. Trust me, you could have actually gotten the game you wanted. Superman 64 is your prize. Sorry about that. Gangster wants to know, how's it being so damn suave? Um, it's, it's really fun, but it's really hard because um, you know, I get to be around you two beautiful sons of ****. So you guys keep, you guys set the bar high. He said it high. And then there's Kevin. Speaking of Kevin, for stepping bar, you know what I mean? Jesus Christ, going to hear this. Go for Kevin wants to know, what are Nick's thoughts on explicit sex scenes in games? I always find them super awkward, but I also always find explicit sex scenes in movies pretty super awkward. Like it's very hard to do a sex scene tastefully. And you've got characters that clearly aren't real. Like the only sex scene that I can really think of that comes to mind is like the Mass Effect sex",
            "start": 897.68
        },
        {
            "text": "like it's very hard to do a sex scene tastefully. And you've got characters that clearly aren't real. Like the only sex scene that I can really think of that comes to mind is like the Mass Effect sex scenes where you're like, I've wanted this for so long. And you got it. You're like, all right, Miranda, what's up? But all right, all right, fine. Thanks, Nick, for joining us, ladies and gentlemen. This is the Kinda Funny Gamescast. We will join you next week for another enthralling episode. But until then, I love you.",
            "start": 940.04
        }
    ]
}