{
  "id": 2367,
  "video_id": "JNJqS2VPmUE",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Ridiculous Amazon Reviews - The GameOverGreggy Show Ep. 165 (Pt. 4)",
  "description": "Nick thinks Amazon reviews are funny.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1486022400,
  "duration": 1043,
  "transcript_chunks": [
    {
      "text": "MVMT Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high quality minimalist products at revolutionary prices. With over 500,000 watches sold in more than 160 countries around the world, MVMT Watches has solidified itself as the world's fastest growing watch company. MVMT Watches started just $95, and at a department store you're looking at 400 to 500 bucks, buddy. MVMT figured out that by selling online they were able to cut out the middle and retailer markup, providing the best possible price. Classic design, stylized minimalism. I said minimalism, you understand what I mean. There's all these watches, we have a bunch here. We use them when we wear suits, we being me. I don't know what the other guys do. You can get yours right now with 15% off today with free shipping and free returns by going to MVMTWatches.com/Greggy. That's MVMTWatches.com/Greggy, and step up your watch game.",
      "start": 0.08
    },
    {
      "text": "the other guys do. You can get yours right now with 15% off today with free shipping and free returns by going to MVMTWatches.com/Greggy. That's MVMTWatches.com/Greggy, and step up your watch game. W, W. I don't have a watch on, but you know what I mean. Nick, yes, what's your final topic? Talking about uh Dippin' Dots this morning and Kevin went online, how terrible it is. Uh, that's not the topic. Uh, Kevin went online to Amazon and you, you asked him to read reviews of it, right? And the reviews uh range from slightly helpful to completely **** stupid. And I wanted to know if you guys use product reviews, will you buy ****? Or if, if at this point as a closer, we're just like, I don't believe anything these **** people say. Question. So this topic is the first time we've ever discussed this on the show, but I feel like the answer for me relates back to something that we've talked about many times, which is when you are a, a child of the internet, right? When you grew up using this thing, it's all",
      "start": 42.48
    },
    {
      "text": "show, but I feel like the answer for me relates back to something that we've talked about many times, which is when you are a, a child of the internet, right? When you grew up using this thing, it's all just kind of in your head now, subconscious. But there is definite, there's a ritual that goes through, robotic, it just happens. But it reminds me a lot of when we did the topic about um, music downloading services like Limewire and Kazaa and all and Napster and all that. It's like, how do you know which are the virus files? How do you know which are the, the fake songs that aren't actual songs or whatever? You just kind of train yourself to realize like, all right, hidden language. There's a hidden language here. Like you start looking at the, the kilobytes per second, you start looking at the um, how many peers are there? How many people have downloaded? There's just some tail signs where like, you want to stay away from this. When in terms of reviews, there's the obvious answer, stay away from the five, stay away from",
      "start": 102.24
    },
    {
      "text": "how many people have downloaded. There's just some tail signs where like, you want to stay away from this. When in terms of reviews, there's the obvious answer, stay away from the five, stay away from the ones, right? Like you think I, because my, that's the thing, my first instinct is to go to the ones and then balance that with the fives and four. You're so wrong, Nick. You're, that's why you make the worst purchases ever and it's so infuriating. No, so I mean, the like the majority of the time, ones are just like, oh man, I like, I, the shipping was horrible and like this thing **** up. It's never really about, or it's about just the person inability to, to, to cope with life and what was happening at the time. And there's sometimes where like, yeah, the thing just totally didn't work. But I just think that more often than not, ones are not valid. Fives are pretty much the same thing where it's like, I mean, if, if all of the reviews are fives, that's a really good sign. But I like to, to stay more in the, the three",
      "start": 141.76
    },
    {
      "text": "often than not, ones are not valid. Fives are pretty much the same thing where it's like, I mean, if, if all of the reviews are fives, that's a really good sign. But I like to, to stay more in the, the three. And I think four is actually the, four and two are the best, best places. But if it's a two, why are you even looking at this product? You should be moving on already anyways, right? Like obviously number of views that really matters, but like it also kind of doesn't if it's just a bunch of the stars. You got to get, that's my problem. Like where's that threshold? Because if you're buying something on Amazon and it's a very popular product, it could have potentially like a thousand reviews. So is that, if you see something that has four reviews and it's at five stars versus something that has 800 reviews and only at four stars, which one's more valuable? I lean towards the, the latter one for sure. Yeah, because, but because the thing there, no, I'm just shaking my head at Kevin with all these cuts. It's clearly a",
      "start": 183.8
    },
    {
      "text": "only at four stars, which one's more valuable? I lean towards the, the latter one for sure. Yeah, because, but because the thing there, no, I'm just shaking my head at Kevin with all these cuts. It's clearly a conversation between you two, but rather than keep you and he's t-t your response off camera. Uh, you're over again is like, usually, 'cause I, there's a lot of times I, I don't buy something without really thinking about it first. Like I will antagonize, I know this about you. Yeah, agonize over it. Took you like six months to buy a hard drive one time. Oh my, well, I, it did Kinda Funny Live too. Uh, but uh, that I compare all of the different ones. I found websites have, you know, found out people do this ****. So they start doing the whole thing of where you can compare the different items next to each other. Or it's like people that bought this ended up buying that. Love that feature. There's all this **** that just kind of comes into like a base knowledge of just like understanding how to shop and look at all",
      "start": 223.88
    },
    {
      "text": "like people that bought this ended up buying that. Love that feature. There's all this **** that just kind of comes into like a base knowledge of just like understanding how to shop and look at all these reviews. But it really does come down to you got to read it. And something I found on Amazon in the last two years that's been really helpful, the Q&A section. The Q&A section, yeah, more important than reviews will ever be. You go there and there's a bunch of questions. You're going to find the question that you have 'cause all you're reading the review for is some very specific thing that they're not going to say in the description. And even if they do, you don't, you don't know you can trust them. What's the battery life? They'll say what the battery life is. I don't **** trust you. What's the data transfer speed of this hard drive? Whatever. Get hard drive specifically, right? Is it a 7,200 RPM drive or is it a 5,400 RPM drive? They don't say that in the description. Why? Because general consumers don't",
      "start": 265.28
    },
    {
      "text": "speed of this hard drive, whatever. Get hard drive specifically, right? Is it a 7,200 RPM drive or is it a 5,400 RPM drive? They don't give a ****. When you're trying to edit a video, you need to know that ****. It's got to be fast. So go to the Q&A section. Oh, there'll be a detailed breakdown like, oh, if you buy the two terabyte version, it's this. If you buy four terabyte, it's, I'm like, thank you. I'm buying the four. It's what I need to know. Q&A section, got to shout out to you. So then, sorry, Greg, did you have me? No, I was just saying, yeah. So then where does this, does this translate over to everything in your guys's lives? Perfect example for me is I have actually, and I don't like the fact that I do this, but now on Netflix, if something has less than three stars, I won't even give it a chance. You know what I mean? Which is a form of sort of the reviews, right? We, yeah, yeah, we talked a little bit about this, I think Yumi off mic maybe, or when I was",
      "start": 304.68
    },
    {
      "text": "three stars, I won't even give it a chance. You know what I mean? Which is a form of sort of the reviews, right? We, yeah, yeah, we talked a little bit about this, I think Yumi off mic maybe, or when I was talking about my movie list from last year and what I, I last year was where I broke out of my shell and gave up a little bit on the stars. And I'm talking mainly about Amazon Instant, 'cause I, what I like to do is go into the Amazon Instant, what are the new movies? Okay, great. And like, oh, this is happening, that's happening. And forever it would be, oh man, I like everybody in this movie, but it got two stars. I'm going to waste my time on that. And then I took, I, you know, jumped. I like, I like these people in this movie. Some Aubrey Plaza movie that wasn't reviewing well, right? Was like, that was great. I like those people. And I did it again with another movie. Did another, sure there's a bad one here, there, whatever. But it's like, okay, cool. No, I need to stop. I need to start ignoring the stars. Do I like the",
      "start": 343.64
    },
    {
      "text": "those people. And I did it again with another movie. Did another, sure there's a bad one here, there, whatever. But it's like, okay, cool. No, I need to stop. I need to start ignoring the stars. Do I like the premise? Do I like the players? Yeah, I'll give you that. I'll try that out. You know what I mean? But then how far after you click on it are you like, no, I'm not watching this movie? Well, an Amazon Instant, Amazon Instant is great 'cause I have skin in the game. Amazon Instant, I'm talking about renting the new movies, right? Oh, interesting. Okay, so you got to go the whole time then. Exactly. So I, whereas Netflix is the complete opposite. Netflix, I, if it's got two stars or one and a half stars, like that's a **** **** movie usually. But I'll do it. I'll do it like, all right, you know, whatever. Anna Faris is in this. I'll, I'll give it a shot. I jump in there. I'm like, Anna Faris, that's just what I, such a crush on movie. Pull it out of the blue on that one. But you jump in and like, no, if you don't hook me and this looks",
      "start": 380.28
    },
    {
      "text": "I'll give it a shot. I jump in there. I'm like, Anna Faris, that's just what I, such a crush on movie. Pull it out of the blue on that one. But you jump in and like, no, if you don't hook me and this looks shitty and then I'm **** out. That's the problem with it. Netflix, I, I only go to four documentaries and standup specials or like West Wing, if Young Justice run. Oh yeah, West Wing. So where it's like, that's great. But like if I'm taking a shot, I'm taking a shot on Amazon just because I think I feel like I have to commit. I, I have to do my research. Another thing with Amazon too is the Prime thing. I think Prime, I gives, it gives me an automatic like, I trust you more. Yeah, like and I, I think that as, you know, time goes on, the third party sellers are a little bit more trustworthy. But still at the end of the day, if Prime was an option, even if the Prime cost $5 more, I trust it more. Okay, sorry, you're talking about product products now, right? Yeah, 'cause Prime Video is a thing too. No, no, no, yeah, no, no, Prime",
      "start": 415.92
    },
    {
      "text": "the day if Prime was an option, even if the Prime cost $5 more, I trust it more. Okay, sorry, you're talking about product products now, right? Yeah, 'cause Prime Video is a thing too. No, no, no, yeah, no, no, Prime, that's the opposite because it's free for you. You can just take a chance on any of those because like, like he's talking about some, you have to actually buy, buy videos to watch. Buy videos on Prime, you can just watch the Prime Video. Yeah, I'm talking about like products when you're have to sh-sh-I'll go out of my way to use only Prime. I'll check that little box too, like only show me Prime stuff. Got time to **** around with you. I got time to **** around. So I do, so I like to, I do organize my Prime first. I got time to **** around. And then, then I'm like, I go and like look at with because I want to know the other options. Like for what I mainly have to do because the problem is like when you start getting into like hair products and ****, right? For some reason Amazon doesn't have them all.",
      "start": 452.24
    },
    {
      "text": "to know the other options. Like for what I mainly have to do because the problem is like when you start getting into like hair products and ****, right? For some reason Amazon doesn't have them all. Like it's always a third party seller that has the three pack that I'm looking for. So I will weigh my options there and I'll be like, I can wait more than two days to get this. So that's not the problem. But it's more, do I trust these guys? 'Cause those like the Prime ones always have a bunch of reviews. Then you look at the, these other like random ass little things. I'm like, do I want to try this new product that only has three reviews? They're all good. Dangerous. But I don't know. Dangerous. Got to roll those dice sometimes. I know. I don't know. I don't know. I, oh, that was going to be my next question. Like, what do you guys come down on Yelp? Yeah, Yelp. Uh, Erin's a big Yelper. Really loves Yelp. Did she actually leave reviews? Yeah, wow. Okay. Uh, but uh, yeah, I, I don't, there Yelp's kind of a tricky thing because like,",
      "start": 486.96
    },
    {
      "text": "you guys come down on Yelp? Yeah, Yelp. Uh, Erin's a big Yelper. Really loves Yelp. Did she actually leave reviews? Yeah, wow. Okay. Uh, but uh, yeah, I, I don't, there Yelp's kind of a tricky thing because like, there are Hard Water sucks now, but Hard Water used to be great and it had like three and a half stars. I, that's ridiculous. You know, like it's definitely not Nopa is 4.4. Nopa is like a five-star restaurant. Maybe thing with the Hard Water, maybe the people reviewing it saw it coming. Maybe they did. Maybe they did. But then, you know, I, I've been thinking about Metacritic, uh, in terms of and other aggregates where I'm like, you know, The Last Guardian, you know, 83. I'm like, yeah, all right. So you have to make, so you have to make your own kind of, yeah, decision based on your, the way you feel, you know? Uh, that's why I hate, always hated putting numbers on reviews when I was at IGN because I was like, I don't like, yeah, I'm reading the rubric. The rubric says this, this is how I feel about it. But depending on how you",
      "start": 525.08
    },
    {
      "text": "I hate, always hated putting numbers on reviews when I was at IGN because I was like, I don't like, yeah, I'm reading the rubric. The rubric says this, this is how I feel about it. But depending on how you even read this review, that number might not even be accurate. So I don't really have any idea. So I kind of, I kind of take that rationale to Amazon and other places where I don't really deal with the, unless there's like a precipitous like two and a half star rating in which 500 people have given it, you know, something that nets there on Amazon. I'm not really wary of that. The Q&A section is very useful. Uh, I also just buy what I want anyway. So like it's like, I don't need your review on the, uh, the six-pack of Crest toothpaste. I'm just going to buy that, right? You know, you know you like that. You, you've proven to yourself that Crest is, is the brand of choice. So, uh, yeah, so to me it's like, I'm, I'm always wary and, and I don't really believe anyone what anyone says at any given time. It goes back to the",
      "start": 569.64
    },
    {
      "text": "proven to yourself that Crest is, is the brand of choice. So, uh, yeah, so to me it's like, I'm, I'm always wary and, and I don't really believe anyone what anyone says at any given time. It goes back to the fake news thing where I'm like, I don't really believe anything. So, so it goes back to that as well. Like the last time I bought a product that I never, I wasn't familiar with was I bought a scale so I can obsess over my weight. That was a really smart decision. And uh, it was a scale that is this very cheap but mass market scale that I bought on Amazon that was reviewed thousands of times and had a 4.6 or something. And I'm like, okay, it weighs things. Yeah, like, like we know that it's okay. And that's, I have no idea if it's right or not. It's telling me that I'm way fatter than I should be. So, right. And then I, you know, definitely don't obsess over it. So, uh, yeah, so but I don't often just go on there and just buy will. I'm not, I guess what I'm saying is I don't buy big items where I'm worried about it.",
      "start": 606.6
    },
    {
      "text": "then I, you know, definitely don't obsess over it. So, uh, yeah, so but I don't often just go on there and just buy will. I'm not, I guess what I'm saying is I don't buy big items where I'm worried about it. You know, like if it doesn't work out, it's like, all right, I guess it's not opposed to me. Like for me, if I were to buy a scale, I would go to Amazon or first I'd start at Google and I would scale, best scale 2017. Literally took the words out of my mind. Best the product and then the year you're in, right? You see what people are saying. And then there's all those top 10 websites that you can't trust 'cause they, they're all sponsored things where they're trying to **** like make money off that ****. But like you look like I trust CNET overall to at least as a starting point of like looking at them. And I'm like, okay, go Wirecutter. You go Wirecutter.com. One of the best sites ever. It's like, it's a thing. Their entire site is, it'll be you, it's kind of what I'm talking about. Like there's a product you can",
      "start": 645.44
    },
    {
      "text": "I'm like, okay, go Wirecutter. You go Wirecutter.com. One of the best sites ever. It's like, it's a thing. Their entire site is, it'll be you, it's kind of what I'm talking about. Like there's a product you can click on and it'll be like top 10 of that. And it's like, there'll be subsections of it. So it's like a little like flowchart where it's like, um, so you're looking for a monitor. So if you're looking for a best monitor 2017 computer monitor, it'd be like, are you looking for a widescreen? Are you looking for a big monitor? You're looking for a small one? And like kind of just keeps going. And it's like, if you're looking for a 24-inch monitor, here's the top 10. And the top 10 is curated by people that are experts in that field. Experts on the internet. It's just people which I trust way more than random Amazon idiot that doesn't know what the hell he's doing with this monitor. Doesn't understand the refresh rate or this or that or whatever. Like I want people to know what they're talking about to tell me what",
      "start": 685.0
    },
    {
      "text": "idiot that doesn't know what the hell he's doing with this monitor. Doesn't understand the refresh rate or this or that or whatever. Like I want people to know what they're talking about to tell me what, right? I don't know. Need a list of top 10 booties. So they're there. Baby booties. There's a bunch of baby products there, there. Uh, but anyway, Wirecutter, Wirecutter is fantastic. If I get a scale, I'd be looking, I'd be on the Wirecutter scale and the scales would be there and be like, this scale has Wi-Fi. This scale has Wi-Fi plus ad hoc, whatever. Be like, well, ****, do I need the ad hoc? You might need. I do want to give a shout out to Yelp because I, I've talked about it before and so I won't to beat the dead horse. But I noticed I was, I, you know, I was trying to Yelp review or I, I wasn't trying. I noticed I was Yelp reviewing, but only when I was having bad experiences, which totally breaks it. So rather than try to commit to doing good because I knew I couldn't do that when I had a great experience, I",
      "start": 726.44
    },
    {
      "text": "I was Yelp reviewing, but only when I was having bad experiences, which totally breaks it. So rather than try to commit to doing good because I knew I couldn't do that when I had a great experience, I just stepped away. And I feel like Yelp does have that community where it's not even, do I have to look at how it's been? You can go to a restaurant and you can see the elite users who have done it. Like Gad who works at GameSpot, used to work with us at IGN, is like super **** Yelp guy. And you go in and like, I'll go to random San Francisco restaurants to see on Yelp to see if they're good. And the top review will be from him. And that is, and it's also the thing where people share photos and they overshare information. And so if it is, the food was great or I didn't like this or, you know, this isn't how this works for like, I feel like Yelp, the community that actually reviews on Yelp is really into it. Whereas with Amazon, it totally can just be, order this thing, it **** sucks. Here's why. You, but it",
      "start": 765.16
    },
    {
      "text": "this works for like, I feel like Yelp, the community that actually reviews on Yelp is really into it. Whereas with Amazon, it totally can just be, order this thing, it **** sucks. Here's why. You, but it sucks because of the box being broken. The best, the best Yelp reviews are not even the ones that tell me anything useful. The best Yelp reviews are the ones that take me on a little, take me on a little ride. And I love when people, and I love, yeah, KDR, tell me what you ****, tell me in, in a thousand words what happened to you here today. I stating circumstances that led you up to that day and then what happened afterward. Some people on there are really, and then I'll click on, I'll see, I'll click on their name and I'll start reading like, they're funny. It's funny. Like they know they're being funny. Like it's not like it's being, it's totally facetious. Like I, it was a rain-battered day and I was, you know, my, my rain coat was wet as I took it off to ring it out. I saw in my corner of my eye a tavern. You",
      "start": 801.0
    },
    {
      "text": "it's not like it's being, it's totally facetious. Like I, it was a rain-battered day and I was, you know, my, my rain coat was wet as I took it off to ring it out. I saw in my corner of my eye a tavern. You know, it's like, it's so fun being funny. I think those people, that's their **** life. That's their only outlet. That's all they **** have. The start of this topic was that exact same thing, but for Amazon, where it's like reading these **** guys like writing these reviews. And it's like they're talking about like, you know, you joke to McDonald's, you're just like, uh, man, yeah, no, the, the toaster worked great, but my wife left me today. So, so, like one star. Wish like, give it zero. But you know, that's the, that's, that's the only other thing I **** hate when people like, I wish I could give this product zero stars. I'm like, oh, one's enough. You got nailed it with the one. Yeah, you know. But I mean, so my problem with Yelp is I don't trust it. And I, I feel like people just rely on Yelp. You don't know where",
      "start": 834.16
    },
    {
      "text": "zero stars. I'm like, oh, one's enough. You got nailed it with the one. Yeah, you know. But I mean, so my problem with Yelp is I don't trust it. And I, I feel like people just rely on Yelp. You don't know where you are. You like, I'm just going to find something needs. So you pull up Yelp. The first three recommended things are always like, it's, it gets stuck with this high rating. So everyone just keeps going there. It's like a self-perpetuating thing. So then everyone's like, oh yeah, cool, great. And then they just go and they're like, oh man, this the best burritos in San Francisco. Let me tell you, it's this place. I found it on Yelp. It's like, no, they're not. Stop. Like just, they're just **** not. And I, you can replace burritos with literally anything. And it's like, that's all I have. Like the, uh, in Daly City, the best food in Daly City according to Yelp is this **** uh Korean barbecue next to Daly City BART. **** sucks. It's fine. It's totally fine. Number one. No, bro, there's a lot of good play, there's a lot of",
      "start": 873.08
    },
    {
      "text": "best food in Daly City according to Yelp is this **** uh Korean barbecue next to Daly City BART. **** sucks. It's fine. It's totally fine. Number one. No, bro, there's a lot of good play, there's a lot of good spots in Daly City, including Nations. True. I'm only kidding. Nations isn't that good, but it's fine. I want to, I want to make one sidebar complaint if I might about Amazon. Take the floor. The gentleman has the floor. I hate when it's like, only four left, order now or whatever. I'm like, I don't believe you. I don't believe you. Why are you telling me this? You should believe them. I don't believe it. I don't believe it. You're going to get burned. I don't like that they tell you that. They should just, it should just be a **** roll of the dice. Tim and I got burned on, on those little shorts, didn't we? Didn't we try to order those little shorts for Kinda Funny, the aerobics? Yeah, yeah. And Tim's like, I'm sure it'll be. I'm like, should we go to those today? And like, yeah, we should probably. Like, I don't know.",
      "start": 914.84
    },
    {
      "text": "we try to order those little shorts for Kinda Funny, the aerobics? Yeah, yeah. And Tim's like, I'm sure it'll be. I'm like, should we go to those today? And like, yeah, we should probably. Like, I don't know. Because you know, I take forever to buy anything. I'm like, maybe we should wait a week. And we waited a week and we, we **** up. That's a perfect example is like, we paid $10 more for those shorts than we should have. Colin, we're, we're talking about these damn reviews. For us, it's not even review. Just Nick is just like, I want to pay $15 more per pair of goddamn pink shorts 'cause I want the ones with the stripe on it. No, it was, it was, it was matter of white versus uh, a little black like logo on it. And I didn't think the black logo good against the pink. I thought it just stood out too much. Oh my God. And if I'm going to be the art director of the show, you have to listen to me. I hate it. That's what's happening. If you didn't know, this has been The GameOverGreggy Show each and every week, four sometimes",
      "start": 960.88
    },
    {
      "text": "I'm going to be the art director of the show you have to listen to me I hate it that's what's happening if you didn't know this has been The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement these are good feeling packs man man I worked out forever I've lost like 3 lbs recently yeah just simply from not lifting weight and being sick okay sad uh if you want to get the show early along with a bunch of exclusive perks goodies and chance to be on the show have your topic on the show or to see Kinda Funny Live too early you can go to Patreon.com/KindaFunny if you have no money and no bucks toss our away no big deal you can go to YouTube.com/KindaFunny to catch it topic by topic day by day until it posts one big MP3 in video on the following Friday until next time no it's been our pleasure to serve you",
      "start": 994.6
    }
  ]
}
