{
    "id": 2407,
    "video_id": "kQEkrr7Jrik",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Superbowl Halftime Shows - The GameOverGreggy Show Ep. 167 (Pt. 4)",
    "description": "Nick loves Lady Gaga.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487232004,
    "duration": 835,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by MVMT Watches. MVMT Watches was founded on the belief that styles shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices. With more than 500,000 watches sold to customers all around the world, MVMT Watches has solidified itself as the world's fastest growing watch company. MVMT Watches started just $95, but at department stores you're looking at 400 to 500 bucks. MVMT figured out that by cutting out the middleman and going online, they can get rid of all that retailer markup and just get you the watch you want. Get 15% off today with free shipping and free returns by going to MVMTwatches.com/Greggy. That's MVMTwatches.com/Greggy. What time is it? It's time to step up your watch game. Now they said it was time to step up your watch game. I added to what time, what time is the thing of the front because I",
            "start": 0.08
        },
        {
            "text": "MVMTwatches.com/Greggy. What time is it? It's time to step up your watch game. Now they said it was time to step up your watch game. I added to what time, what time is the thing of the front because I thought that was funny. MVMTwatches.com/Greggy. Nick, oh, going to me. What's your final topic? Yeah, yours is, yours is timely. Mine's never. Do yours instead. Yours is more fun. Nope. Nope. My topic: the Lady Gaga Super Bowl halftime show. Super time, super time. Um, I came in like a wrecking ball on this, uh, on this halftime show. Uh, didn't watch the first half of the Super Bowl last Sunday. Um, was out and about running some errands, hanging out, having some lunch with a friend. Came back right literally as I walked in. I see Lady Lady Gaga standing on a roof, a nondescript roof. Don't know if it's the Dome or not. Just was probably roof somewhere. Jumps off and kicks off what I would argue is one of the best, if not the best, halftime shows ever. Met. Wow, really? Oh yeah, see, yeah, you wanted to talk about",
            "start": 39.4
        },
        {
            "text": "Dome or not, just was probably roof somewhere. Jumps off and kicks off what I would argue is one of the best, if not the best, halftime shows ever. Met. Wow, really? Oh yeah, see, yeah, you wanted to talk about in a broad spectrum of how was there something better? Can you think of show suck? I mean, I would argue that's one of the best performances ever, period. Yeah, full stop. Stop on that. That shit was crazy. It was so multi-layered. There was so much going on. She rocked the living shit out of it. Singing the whole thing. No lip sync shit. Danced, flew, jumped off things. Like it was, there was no gimmicky special guests. There was no nothing. It was just Lady motherfuckin' Gaga with a ridiculous set, ridiculous choreography, a superbly awesome mixed, um, compilation of her songs. There was, it was politically charged in the music. Everything about it. I'm like, shit, get it, girl, get it. She nailed that shit too. Isn't there some part of you that misses the concept of like, let's take a bunch of groups that have no",
            "start": 99.32
        },
        {
            "text": "in the music. Everything about it. I'm like, shit, get it, girl, get it. She nailed that shit too. Isn't there some part of you that misses the concept of like, let's take a bunch of groups that have no business being on stage together and throw them on stage just to see what this shit? We'll get that next year. We'll get that. We got that last year. It was always, there was a while in the '90s where it was always Aerosmith. You guys remember that? Yes. Where it was like, it was like Limp Bizkit performing and then it's also featuring Aerosmith. I remember it was Britney Spears, Justin Timberlake, maybe all of 'N Sync, I don't remember. And then yeah, Aerosmith came out or whatever. They're going like, all right, cool. That's fine. Again though, they all suck though. These are stupid. Halftime shows are dumb. Shit awesome. How? Why? Why would you think they're stupid? Whatever is enjoyable. What is ever enjoy? No, the commercials is the best part of. No, they're not. The internet ruined that. The internet. That's true.",
            "start": 147.6
        },
        {
            "text": "awesome. How? Why? Why would you think they're stupid? Whatever is enjoyable. What is ever enjoy? No, the commercials is the best part of. No, they're not. The internet ruined that. The internet. That's true. Dude, the commercials haven't been good for since Budweiser frogs. Uh, no, Budweiser delivers every year. You see this? You see this year? You see this one? See this one? It's good. It goes the opposite of what you think. It's about immigrants being good. You think you, you think Budweiser in middle of the country, they're going to be all like trumping it up. No, they were like, no, we're all immigrants. And that's why people tried to protest them. They couldn't spell Budweiser. Their hashtag was, it was Pepe the Frog. There. Pepe the Frog. That'd be awesome. Positive Pepe the Frog made an appearance in the anti-Budweiser. I think that was the anti-Budweiser protest. Um, yeah, I don't know. I mean, I, I'm not a huge sports fan to begin with and, and, and football, it's fun to watch. But I'm one of those guys that literally had like up",
            "start": 178.52
        },
        {
            "text": "I think that was the anti-Budweiser protest. Um, yeah, I don't know. I mean, I, I'm not a huge sports fan to begin with and, and, and football, it's fun to watch. But I'm one of those guys that literally had like up until about a week ago, I was like, who's in the Super Bowl? I don't even know. Um, who was in the Super Bowl, Nick? Who was in the Super Bowl? Yeah, Patriots and the Falcons. Thank you. I watched half the game. Well, I just making sure you could remember it. But I didn't know. Lead up to that. And what a game, by the way. Great, great game. Maybe the best, maybe the best, certainly the most remarkable comeback in Super Bowl history. But really, a really unfortunate the, the outcome, of course. Well, depending on who you, who you're rooting for. Um, great for Tom Brady as I guess he's the now considered the greatest all-time quarterback. Five Super Bowls. He's pretty amazing, incredible. And he's got a smoking hot wife. Um, yes, he does. But yeah, but I, you know, I was watching the, uh, I came in just watch another attracted wife. He",
            "start": 217.2
        },
        {
            "text": "quarterback, five Super Bowls. He's pretty amazing, incredible. And he's got a smoking hot wife. Um, yes, he does. But yeah, but I, you know, I was watching the, uh, I came in just watch another attracted wife. He left when she was pregnant. What's that? Nothing. It's fine. I can't remember if it was a girlfriend or pregnant or, uh, wife. Was that, was that? I forget who. You remember who this? You remember this one? Who did he leave? He had either a girlfriend or a wife that was pregnant and he left her for. I'll look this. Did he? How they had to get rid of the kid? Didn't get. No, no, no. Goddamn Savage. Sometimes I like just set things up and see who takes the bait on that one. Uh, no, it was, it was a really good game actually. We so I came in and my wife was, uh, just had it on because she wanted to watch the, the halftime show. She didn't give a shit about the game. Um, and then the game actually got me as they started coming back. Meanwhile, my wife's sitting there asking me questions about travel. She's like, what would you want",
            "start": 256.32
        },
        {
            "text": "she didn't give a shit about the game. Um, and then the game actually got me as they started coming back. Meanwhile, my wife's sitting there asking me questions about travel. She's like, what would you want to go to that? And the whole time I'm trying to actually pretend like I'm paying attention to her while in reality I'm like getting enthralled with this shit game that it's like one of the best comebacks in sports history that goes into overtime. And I'm like, baby, you don't understand. Like, I didn't even know this, but apparently never been a Super Bowl that went into overtime before. There's never been a Super Bowl in which a, a deficit of more than 10 points was overcome. Nonetheless, what, what was it? Uh, 24 point or 25 point deficit? Bridget Moynahan. Oh, right, right. He did date her beforehand. They ended the relationship sometime in early 2006 around the time she became pregnant. That's unfortunate. More importantly, there's never been a Super Bowl where Lady Gaga jumped off the thing, spiked the",
            "start": 299.0
        },
        {
            "text": "ended the relationship sometime in early 2006 around the time she became pregnant. That's unfortunate. More importantly, there's never been a Super Bowl where Lady Gaga jumped off the thing, spiked the fuckin' mic and then fire went up. Spikes the mic, jumps off, catch football, catch B, catches like a diamond studded football or whatever it is. It just disappears. See, I like Lady Gaga and I like her music. I like a lot. I like Katy Perry. I, you know, I enjoy people who was dope. No, stop. I'm not making that point yet. I'm not making that point. The point I'm making is I don't want to see any of them during the Super Bowl halftime show. Why not? Why do I care? What do you want to see? You want to just see shit? Dead air would be better. Is that what you want to hear a band? I just don't understand the like this half all time. You get up and you go pee. You, you get a when it was shit when they had Rock vs. Mankind that one at one time on in WWF. That was great. That was a good way to do it. That should be the",
            "start": 334.84
        },
        {
            "text": "half all time. You get up and you go pee. You, you get a when it was shit when they had Rock vs. Mankind that one at one time on in WWF. That was great. That was a good way to do it. That should be the halftime show. So you want the Rock and Mankind just out year? Remember empty Stadium match? You remember this? No, I don't. It was pre-recorded. You they did this for a while where they had it where you click over USA and they they do one match or whatever. Oh, really? Yeah. And they did a Mankind and Rock one. It was great, great match. Falls Count Anywhere. They brawled all over the place. The only thing that was a deal breaker was at the end Mankind used a forklift to pin the Rock, which sounds cool until like it had a cam on the forklift as it came down on him. You're like, why the fuck would there be a camera on this forklift like that? No, you broke my immersion. Got also shout out to the 30 for 30 on XFL. So shout out to the 30 for 30 for XFL that I watched that you recorded that cut off the last half an hour",
            "start": 375.68
        },
        {
            "text": "on this forklift like that. No, you broke my immersion. Got also shout out to the 30 for 30 on XFL. So shout out to the 30 for 30 for XFL that I watched that you recorded that cut off the last half an hour of it. So I have no idea how it ends. Thanks. It doesn't end well. Thanks. I mean, I remember how it ends, but I don't know how it ends. No, you got to do it because they it's, I was telling him, it's like an Easter egg. Like, you know how you finish the superheroes and then they pop the thing up after the credits. The ending is, uh, Vince sitting down with that guy who helped found it. I forget his name now from NBC. And I'm talking about like, would you ever do it again? He's like, yeah. And they start talking about how they would do it again. Like, we, we got to get Jerry Jones involved. It's like, oh my God. Totally make the XFL again. Anyway, um, yeah, I don't know. I mean, I think there's, there's a part of me that loves that spectacle. I think you can definitely tell from the, the team that put this together. They sat in a room",
            "start": 417.28
        },
        {
            "text": "XFL again. Anyway, um, yeah, I don't know. I mean, I think there's, there's a part of me that loves that spectacle. I think you can definitely tell from the, the team that put this together. They sat in a room and we're like, how do we take this up not one notch, fuck, 10 notches? How, how do we just have fun with this? And obviously the verticality of it was definitely. At least down the Super Bowl is an event unlike any other, right? Like that is the American event. It's the Super Bowl of Super Bowls. Very well. But I mean, like there is no other like the Super Bowl halftime show is probably the most money put into one performance that anyone can do. And it always looks awkward. It always looks awkward as hell. I what I, the only, the only that's awkward about it is that there's a bunch of people that are clearly paid to be there that are dressed just like Lady Gaga and they're just having the best time on the planet. They're not, you can tell they're not real fans. I mean, maybe some of them are real fans, but they're",
            "start": 451.4
        },
        {
            "text": "to be there that are dressed just like Lady Gaga and they're just having the best time on the planet. They're not, you can tell they're not real fans. I mean, maybe some of them are real fans, but they're, they're clearly. Remember Paul McCartney's not being bad. And I think it's just because he played music. The Chili Peppers were good until you found out that they weren't even playing. Yeah, you running around the bass guitar, nothing plugged into. Um, yeah, I don't know. It insult. I guess this is the thing. Even as a casual music fan, it usually insults me because it's just like, play the music. Can I hear the music? Just do, give me that kind of show. Bruce Springsteen did a good one that was just again, playing music. Man, you just, you don't like fun. I, I just don't understand like that's the whole thing of you want music, go watch performance. You're right. I wasn't, I wasn't in America for the Super Bowl. America, you were in Sydney for Christ's sake. Did you? So you didn't get to watch it? No, that's well, actually I",
            "start": 500.72
        },
        {
            "text": "music, go watch performance. You're right. I wasn't, I wasn't in America for the Super Bowl. America, you were in Sydney for Christ's sake. Did you? So you didn't get to watch it? No, that's well, actually I caught parts of it. We were in and out of bars that day. I, I, I, I mean, I've, I've enjoyed some of the performers. I enjoyed Katy Perry. I think she's interesting and talent. And also Left Shark had a great like my one of my biggest celebrity crushes possible. Uh, but I, I, I also think it, it lasts too long. I, I, I, I have a huge problem with the Super Bowl as it is. I mean, we did a conversation with Colin this a long time ago. It should be about the game and, uh, it seems like it's about everything else. And that's fine because there's so many casual fans and so many passers by around the world and in the United States that watch this. Uh, not to be sexist because I, I think the intention of a lot of these spect halftime shows was originally for like, oh, your girlfriend doesn't care. But now it seems like, you know, you",
            "start": 533.68
        },
        {
            "text": "that watch this. Uh, not to be sexist because I, I think the intention of a lot of these spect halftime shows was originally for like, oh, your girlfriend doesn't care. But now it seems like, you know, you know, plenty of women are in football. And now it just seems to be this thing where it's like, I kind of just want to get back to the game, you know, like Janet Jackson showed her tit. That was a good one. Yeah, that was. I remember, I remember watching that in my dorm room and being, whoa, this kind of crazy. Um, the Super Bowl is like E3 for movies though. And I think that like that's why I get in. There's a whole bunch movie trailers. It's like the only time a year that you just get, here's a new trailer, here's a new trailer, here's a new trailer. Like, you know, you're looking forward to it. It's like, oh, I think we're going to get a new Fast trailer. I think we're going to get a new whatever Marvel movie or all that shit. I said the commercials are great. And I mean, but see that that's all part of it. And I, I get that",
            "start": 573.64
        },
        {
            "text": "to get a new Fast trailer. I think we're going to get a new whatever Marvel movie or all that shit. I said the commercials are great. And I mean, but see that that's all part of it. And I, I get that like there's, there's people out there that care about football and want to watch the game. But it's like the game's still there. And the game would have had other shitty commercials otherwise. And it would have some other like, what do they do for halftime shows in normal games? They're not show shit. If it's an NFL, if it's just a normal game, like during the championship games and stuff, they might have or like, yeah, they might have a band play, but they don't even show it. Do a normal game. Yeah, during if you're watching a televised NFL game and it's halftime, they'll kick back to the studio to talk about what they've seen. They'll recap that. They'll talk about other games. College games would have like, there's marching Mizzou that comes out and The Golden Girls will do the number and stuff like that.",
            "start": 606.6
        },
        {
            "text": "what they've seen. They'll recap that. They'll talk about other games. College games would have like, there's marching Mizzou that comes out and The Golden Girls will do the number and stuff like that. Marching, that's the thing. They suck in college too. They usually that's your time to thank people like, oh, this, this is, um, you know, Lieutenant private whoever who's G Sal. He waves at everybody and they give him a game ball or whatever stupid shit like that. Just dumb. Because I've never been invited down to get a game ball. Halftimes just suck and they're stupid in general. And even when like, and that's the thing about this. And it's that's my thing is I'm not what you're saying. I hear you. This was just, you know, I thought we were having an open conversation. Maybe you're going to come over here and punch me, Pepe. But what the problem is, I guess I'd be wearing Pepe. You're a fascist. Just check. I'm checking your SWAT. My Pepe against halftime show. The armband fits, Greg. We already said that. Let's not",
            "start": 635.72
        },
        {
            "text": "me, Pepe. But what the problem is, I guess I'd be wearing Pepe. You're a fascist. Just check. I'm checking your SWAT. My Pepe against halftime show. The armband fits, Greg. We already said that. Let's not commit to that, guys. But we, it could be a shirt. Let's not, let's not make it a shirt. I don't know too many people that are going to actually wear that shirt. They might buy it. You just want to make it a wristband. We just sell wristbands. You can make an armband. We're on to something here. If you didn't know, this has been The GameOverGreggy Show. Each and every week for sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get each and every episode early along with a bunch of exclusive perks, goodies and other things. Speaking of which, Kevin is our Patreon producer on this one. Yes. Yeah, it says on there. Can you look at that or no? We're going to check on who's producing this episode.",
            "start": 669.2
        },
        {
            "text": "perks, goodies and other things. Speaking of which, Kevin is our Patreon producer on this one. Yes. Yeah, it says on there. Can you look at that or no? We're going to check on who's producing this episode. Uh, also, of course, if you have no money, no bucks toss our way, no big deal. You can head over to YouTube.com/KindaFunny where you get the show broken up topic by topic, day by day until it goes up as one big MP3 and video for your amusement. True. Michael Trees. Michael Trees, you are a Patreon producer of this episode. Thank you, Michael Trees. First time that Michael Trees. Second time that Michael Trees has. Appreciate Michael. 18th time. Whoa. Michael Trees has been all over this thing. You think Michael Trees will be the new Steven Enzler for? I can tell you right now, next month is someone else. Fingers crossed. Next was someone else on both GoG and Gamescast. No. Do we have two Steven Enzler? Steven Enzler isn't in it. Steven Enzler is dead. No, guys. Whoa. Come on. Come on. Until next time. What, what you got? Not",
            "start": 706.72
        },
        {
            "text": "crossed. Next was someone else on both GoG and Gamescast. No. Do we have two Steven Enzler? Steven Enzler isn't in it. Steven Enzler is dead. No, guys. Whoa. Come on. Come on. Until next time. What, what you got? Not worth it. Just say my thing. Then have a conversational day. Goddamn. Goddamn it. Oh my God. Oh, hi. I didn't see you come in. I was just subscribing on iTunes to the Kinda Funny Morning Show. You can do the same on podcast servers around the globe. I just have an iPhone. Or you can go to SoundCloud.com/KindaFunnyMorningShow. That's right, ladies and gentlemen, the Formerly Known Colin & Greg Live, now Kinda Funny Morning Show is a podcast. We listen to you. 2017 is all about communication. So we put it up as YouTube videos. I'm sure you've seen. Subscribe YouTube.com/KindaFunny or get the Kinda Funny Morning Show as a podcast on SoundCloud.com/KindaFunnyMorningShow. Your iDevice, if you're a dork like Kevin. Your Android thing. How do you even get podcast on your thing? You saying to",
            "start": 748.8
        },
        {
            "text": "Kinda Funny Morning Show as a podcast on SoundCloud.com/KindaFunnyMorningShow. Your iDevice, if you're a dork like Kevin. Your Android thing. How do you even get podcast on your thing? You saying to the watch, I need a podcast. What happens? You don't. You shrug. You don't listen to podcasts. I go to SoundCloud and download. Oh, okay. You're one of those guys. What do you mean one of those guys? I mean like what? You can't just, you can't, there's no subs. There's nothing. Ladies and gentlemen, it's a podcast. It would mean a lot if you went and subscribed to it. You might say, I watch it live on Twitch. And to which I just say, just subscribe. Who cares? It's just a number. Subscribe. Hi, it's Greg. Good Morning Show. SoundCloud. Kevin.",
            "start": 798.16
        }
    ]
}