{
    "id": 2363,
    "video_id": "LBrEmDSy5sk",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "The Gaming Industry vs. Donald Trump - Colin Was Right",
    "description": "This week, Colin explores how President Trump's policies could adversely affect the industry, and discusses the anger towards Trump emanating through every corner of gaming.",
    "published_at": 1486054802,
    "duration": 1205,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, and welcome back to Colin Was Right. So last week I told you we could and would occasionally inject politics into the show when it made sense, which I assumed wouldn't be very often. Last week was practically eons ago though, because somehow the gaming industry we know and love has become even more politicized than it was when we last spoke. We're going to talk about politics again this week, probably much more in-depth and down to brass tacks than you ever likely expected the show would. And at this rate and in this culture, in environment, I can't guarantee it's not going to happen again. Consider that fair warning. The nugget of this episode started innately enough with just a pinch of politics that would then segue into something more consumer focused. I wanted to investigate how President Trump's protectionist policies could possibly alter the pricing landscape of physical games as well as gaming hardware. I reached out to a bunch of people to talk about that, then two",
            "start": 3.92
        },
        {
            "text": "how President Trump's protectionist policies could possibly alter the pricing landscape of physical games as well as gaming hardware. I reached out to a bunch of people to talk about that. Then two events happened this past weekend that further fueled the flames, a series of political flash points in our industry that I've not seen in the 15 years I've been paid to write about and talk about video games. In other words, there's a lot to cover, so let's jump into the longest episode of Colin Was Right you'll probably ever see, at least for quite some time. Let's start with a chat about protectionism. It's a word you may not be familiar with, but as a history dork and a part-time, entirely amateur economics nerd, it's a word I know all too well, and it may just adversely affect the pricing of consoles and physical software in the United States. So it's something you should familiarize yourself with. For those that don't know, protectionism is a trade policy that advocates added cost, sometimes",
            "start": 42.44
        },
        {
            "text": "and physical software in the United States. So it's something you should familiarize yourself with. For those that don't know, protectionism is a trade policy that advocates added cost, sometimes called a border tax, but more properly called a tariff on goods not natively created in the country the goods are being consumed. Why? While Merriam-Webster's definition puts it all into focus, for a protectionist is quote, an advocate of government economic protection for domestic producers through restrictions on foreign competitors, end quote. In other words, and put perhaps entirely too simply, if item X is created using cheap labor and resources in say China, and then shipped to the United States to be sold alongside an American-made item X using more expensive labor and resources, a tariff could be placed on the Chinese item X to making more comparable. Protectionism is designed at its core to level the playing field and protect domestic manufacturers and other business interests, as well as huge swaths",
            "start": 79.56
        },
        {
            "text": "the Chinese item X to making more comparable. Protectionism is designed at its core to level the playing field and protect domestic manufacturers and other business interests, as well as huge swaths of workers. President Trump's rhetoric on protecting the domestic manufacturing market is well established, and his unilateral withdrawal from the developing Trans-Pacific Partnership Trade Agreement, as well as his continued assault on the 23-year-old North American Free Trade Agreement, fully signals what his intent is when it comes to trade. This means that at least theoretically, video games could be one of the many, many things that American consumers may soon pay more for. Trump and Congress act in unison on the issue to penalize foreign-made producers. Severe protectionist policies have already had and are still having adverse effects on gaming markets outside of the United States, particularly in Brazil. The website Tech in Brazil states that quote, the sales of gaming hardware and software in",
            "start": 117.52
        },
        {
            "text": "and are still having adverse effects on gaming markets outside of the United States, particularly in Brazil. The website Tech in Brazil states that quote, the sales of gaming hardware and software in Brazil has historically been driven by factors such as the prohibition of imports, high taxation, and the adoption of practices such as smuggling and piracy, end quote. It's so bad there that Sony and Microsoft both started manufacturing hardware within Brazil to dodge its steep tariffs. According to a 2015 Polygon report, the Japanese company Nintendo bailed out of selling in Brazil completely due to taxation and the refusal to create domestic means of production to dodge taxes. As Polygon also notes in an article from 2013, a full 63% of PS4's cost in Brazil, at least at launch, was due to onerous taxation. Legacy consoles dating back decades are still widely used in Brazil due to their much lower cost, something somewhat unique to that market. Could we experience something similar here in the United",
            "start": 155.84
        },
        {
            "text": "Legacy consoles dating back decades are still widely used in Brazil due to their much lower cost, something somewhat unique to that market. Could we experience something similar here in the United States? It's doubtful tariffs would ever even remotely approach Brazilian levels, though possible experience remains unclear. For now, the answer seems to be segmented largely by where hardware and software is produced, as each company is different. To help answer the question, I reached out to PR representatives from Activision, EA, Ubisoft, Bethesda, and Deep Silver with identical sets of questions. I also sent the same set of questions, plus hardware related inquiries, to Nintendo, Microsoft, and Sony. Activision, Sony, and Nintendo didn't return multiple requests for comment. EA and Ubisoft responded, but the canned comment, while Microsoft told me quote, similar to other products sold around the world, pricing offers often vary on market conditions, tax, tariff, and exchange rates. We're always looking at how to",
            "start": 195.84
        },
        {
            "text": "comment, while Microsoft told me quote, similar to other products sold around the world, pricing offers often vary on market conditions, tax, tariff, and exchange rates. We're always looking at how to offer the most value to our fans, but have nothing further to share, end quote. Bethesda wanted to participate, but needed time the turnaround of this show could not accommodate. Deep Silver is the only publisher I contacted that would talk to me at actual length, but even then the conversation remained vague. So to get to the nitty-gritty, I had to turn to one of my sources, someone extremely well-connected at a big United States-based retailer. What this source told me on the subject of tariffs complicates the issue for one overarching reason: who is affected and how will depend on which publisher or console manufacturer you're talking about. As an example, if you're Bethesda, Activision, Ubisoft, your games for sale in America are likely being manufactured at Technicolor, an American company. So these",
            "start": 234.12
        },
        {
            "text": "console manufacturer you're talking about. As an example, if you're Bethesda, Activision, Ubisoft, your games for sale in America are likely being manufactured at Technicolor, an American company. So these publishers could conceivably avoid tariffs as their games are made in the United States. The catch here is that tariffs Technicolor itself might have to incur as they're using all sorts of materials, some imported, to create the discs, boxes, inserts, and all the rest that go into modern manufactured retail games. It seems logical that Technicolor would put those cost increases on the publishers. Nintendo, according to my source, imports its games to be sold in the United States from overseas through Seattle and to a distribution center outside of the city, so they would conceivably be subjected to tariffs. Likewise, many games Sony publishes for sale in the United States are shipped to the US through Canada via train to Illinois for domestic distribution. These games would also be subjected to tariffs.",
            "start": 270.68
        },
        {
            "text": "Likewise, many games Sony publishes for sale in the United States are shipped to the US through Canada via train to Illinois for domestic distribution. These games would also be subjected to tariffs. Microsoft apparently prints some of its games domestically and others overseas, muddying their outlook, though at least a portion of their games of foreign provenance would be taxed under full-scale protectionist policies. How about hardware? The possible scenario I with hardware and protectionism are what my source called terrifying in quotes, because hardware and accessories manufactured for sale in the United States are universally made outside of its borders. Since tariffs are traditionally percentage-based, the higher cost of consoles will make the tariffs more severe, which could, as my source said, have a negative effect on so-called quote unquote downstream sales, or the idea that a console sold puts into motion the purchase of games for that console that benefits retailers, publishers, and",
            "start": 308.08
        },
        {
            "text": "said, have a negative effect on so-called quote unquote downstream sales, or the idea that a console sold puts into motion the purchase of games for that console that benefits retailers, publishers, and hardware manufacturers alike. It's why some hardware has been sold at a loss, as the console in question is deemed more valuable in the wild, but sold at a loss than being on a shelf sold for a profit, or perhaps not sold at all. My source stresses that the margins in gaming, both on the software side and the hardware side, are far lower than people think, making the market more volatile than expected. Quote, Gamers assume pubs and retailers are making out like bandits, but it isn't actually the case, end quote. The source told me retailers and publishers have a small window to make a game profitable, somewhere between 90 and 120 days before price cuts and general player apathy take hold, and further taxation could severely complicate the arithmetic necessary for all sides to make a buck. As an example, a",
            "start": 343.8
        },
        {
            "text": "between 90 and 120 days before price cuts and general player apathy take hold, and further taxation could severely complicate the arithmetic necessary for all sides to make a buck. As an example, a retailer may pay $48 to a publisher for its game, turning it around for a $60 sale, thus equating to a $12 gross rip for the retailer. The $48 is for the publisher to pay its bills. $8 or so will go to the hardware manufacturer that game was sold on, whether Sony, Microsoft, or Nintendo. $5 or so will cover the cost of the game being manufactured and shipped. That leaves a publisher of a game sold for $60 at retail with $35 per game gross, which it then needs to fund its publishing arm, pay its developers, and much more. This also assumes a $60 price, which never holds for any game, and it also assumes no pre-order or other sale incentive is a fixed add-on, say a 20% border tax, and suddenly the math becomes much fuzzier, and it may be impossible to make the numbers work if consumer side pricing remains",
            "start": 380.88
        },
        {
            "text": "pre-order or other sale incentive is a fixed add-on, say a 20% border tax, and suddenly the math becomes much fuzzier, and it may be impossible to make the numbers work if consumer side pricing remains unchanged. The reality, according to my source, is that game prices may go up for consumers if tariffs go through. Here's what he said, quote, don't be shocked to see market-wide price increases that start at the first party and publisher level. Expect to see everyone move up to $69.99 or higher to offset the cost of the tariff without changing the status quo in regards to funding and promotions, end quote. But wait, we're just getting started. Donald Trump reared his head again with one of the many executive orders sent from the Oval Office since he became the 45th President of the United States on January 20th. Like with his possible protectionist proposals, one executive order in particular, which among other things, temporarily bans people from seven Muslim-majority countries from entering the United",
            "start": 421.28
        },
        {
            "text": "20th. Like with his possible protectionist proposals, one executive order in particular, which among other things, temporarily bans people from seven Muslim-majority countries from entering the United States, while putting strain on those even with legal work visas and green cards, could adversely affect the gaming industry as well as many other segments of the American economy. And it appears that while the gaming industry doesn't seem too worried about possible tariffs yet, this immigration issue won't be taken sitting down. My question is, who and what is it affecting? How and what, if anything, can be done about it? My inquiry on this front began with a series of tweets from Rami Ismail, a famous game developer and a Muslim who heads the studio of Vlambeer, the guys behind games ranging from Nuclear Throne to Super Crate Box. The tweet he sent that piqued my interest said, quote, due to the #Muslimban, I'm working with five talented devs that were all coming to GDC, but can't or don't dare to",
            "start": 461.52
        },
        {
            "text": "Throne to Super Crate Box. The tweet he sent that piqued my interest said, quote, due to the #Muslimban, I'm working with five talented devs that were all coming to GDC, but can't or don't dare to anymore. It breaks my heart, end quote. I reached out to Ismail with some questions, and he got back to me with answers that helped illustrate his observations and concerns. Without naming any names of specific developers, he described a situation in flux where no one is really sure what to expect when traveling to or working in the American games industry. Many are what he termed baffled in quotes. Sadly, Ismail spoke to me about some developers from targeted countries who saved a ton of money to come to a show like GDC, who are now unsure if they can attend, and who can't even secure a refund on money's paid. He described a situation in which a foreign developer may have lived and worked in the United States for a long time, but aren't yet citizens, and could be sent back to places they wouldn't recognize.",
            "start": 499.2
        },
        {
            "text": "He described a situation in which a foreign developer may have lived and worked in the United States for a long time, but aren't yet citizens, and could be sent back to places they wouldn't recognize. Many folks can still come here, but many are scared to. To many, the entire system seems anti-immigrant and anti-foreigner. It goes far beyond the literal language of the executive order. For many, this represents a disturbing sea change in how the United States deals with outsiders. Here's how Ismail ended his email to me, quote, the games industry benefits tremendously from having access to the most talented people from all over the world, and many major game studios employ people from the banned countries. The American focus on the games industry means that many opportunities are most easily accessible through the events in the United States. It'll be up to our industry to ensure that those outside of the United States whose opportunities have been limited by the ban will be given extra recourse to",
            "start": 539.44
        },
        {
            "text": "through the events in the United States. It'll be up to our industry to ensure that those outside of the United States whose opportunities have been limited by the ban will be given extra recourse to remedy the new limitations, end quote. I was especially curious about and disgruntled by the idea that foreign developers, whether they were Muslim or not, were not able to come here to conduct business and show off their products. And I wondered how common this theme was, or was being overblown. A prominent, well-known, extremely successful independent developer spoke to me about this, but asked to remain anonymous. I first asked him if Ismail's story is common, and if he had heard anything similar in his circle of devs being wary of coming to the US for shows like GDC and E3, even if they aren't Muslim or don't come from one of the countries targeted by Mr. Trump's executive order. Here's what he had to say, quote, I've had a GDC meeting change because a person I was due to be meeting with will not be",
            "start": 577.72
        },
        {
            "text": "or don't come from one of the countries targeted by Mr. Trump's executive order. Here's what he had to say, quote, I've had a GDC meeting change because a person I was due to be meeting with will not be allowed into the country if these new rules are still in place. Beyond the massive human cost of such an exclusion, that's a real world example of a loss of business. The reality of the games industry in 2017 is that product is made and paid for by our diverse people, many of whom come from backgrounds which exclude them from traveling to the US right now. On a broader level, yes, it is intimidating for foreign nationals to travel to another country when it's known that people are being detained illegally, regardless of whether I currently match the profile being excluded. As has been demonstrated, the profile could be changed while I'm midair. That has a cooling effect on my desire to do business in the US. It doesn't make me confident. The pace of these changes and the erratic nature of their",
            "start": 615.2
        },
        {
            "text": "the profile could be changed while I'm midair. That has a cooling effect on my desire to do business in the US. It doesn't make me confident. The pace of these changes and the erratic nature of their application makes it very hard to make long-term plans, end quote. That sounds terrible. And as the particular scenario outlined by my developer friend can be extrapolated to the wider development community, it's safe to assume that this is a common problem felt by many talented game developers outside of the United States. It doesn't bode well for our hobby or for the people within it. Thankfully, some folks are taking a stand. I originally reached out to the Entertainment Software Association, the gaming industry's representative and lobbying body out of Washington D.C., about the aforementioned tariffs. And while an ESA representative wasn't able to speak on the record about the organization's concerns over possibly higher costs, he was more than happy to provide me with this statement about Trump's",
            "start": 651.68
        },
        {
            "text": "And while an ESA representative wasn't able to speak on the record about the organization's concerns over possibly higher costs, he was more than happy to provide me with this statement about Trump's immigration executive order, quote, the Entertainment Software Association urges the White House to exercise caution with regard to vital immigration and foreign worker programs. As a leading force in technology and an exporter of entertainment, the US video game industry thrives on the contributions of innovators and storytellers from around the world. While recognizing that enhancing national security and protecting our country's citizens are critical goals, our companies rely on the skill of talent of US citizens, foreign nationals, and immigrants alike. Our nation's actions and words should support their participation in the American economy, end quote. Individual game developers and publishers are also responding in kind. I was especially impressed with a video put out by Insomniac Games, the",
            "start": 689.8
        },
        {
            "text": "their participation in the American economy, end quote. Individual game developers and publishers are also responding in kind. I was especially impressed with a video put out by Insomniac Games, the Southern California-based developer best known for the Spyro the Dragon, Ratchet & Clank, and Resistance series. I encourage you to watch it. While it's unintentionally comedic seeing cross-armed developers standing there looking into the camera like they're going to kill you and your entire family in cold blood, their message is heartfelt and important. Ted Price, the head of Insomniac, says in part, quote, there's no question that these orders will harm us as a company and many of our team members. So we ask, is this the American way? Is discriminating based on religious faith or national origin American? Absolutely not. This is a deplorable, discriminatory act that we and many others across the nation believe is patently unconstitutional. We have been, we are, and we always will be a nation of immigrants, end",
            "start": 726.36
        },
        {
            "text": "not. This is a deplorable, discriminatory act that we and many others across the nation believe is patently unconstitutional. We have been, we are, and we always will be a nation of immigrants, end quote. As game publishers and developers began to stand up to the Trump Administration, however, another tweet came through that gave me pause, and it's where I wanted to close this extra long episode, because frankly, I think it's a great illustration of what not to do at a time like this. There's a new game on the PC and PlayStation 4 called 2064: Read Only Memories. It's an adventure game that takes place in a futuristic San Francisco, and I've heard quite a few positive things about it. Our very own Greg Miller is a big fan, and I was really looking forward to playing it when it came to Vita. That's why I found a tweet sent from the game's official Twitter account curious at best and misguided at worst. The tweet reads as follows, quote, if you voted for Trump or support his fascist regime, please don't play",
            "start": 766.68
        },
        {
            "text": "a tweet sent from the game's official Twitter account curious at best and misguided at worst. The tweet reads as follows, quote, if you voted for Trump or support his fascist regime, please don't play our game, just go **** off, end quote. Now, I would never, ever deny that the person behind this tweet is well within their right to say that, feel that way, and conduct their business how they see fit. I suspect everyone at MidBoss supports that message, and that's great. I just don't quite comprehend the strategy behind a stance like this. It's not productive. I regularly tell people to **** off, but never for truly defining reasons. I'm a conservative, fed by the single most pronounced political echo chamber I've ever encountered without comparison, but I would never tell a socialist not to enjoy Kinda Funny. In fact, I hope they do. I may be politically outspoken, but I'm certainly not exclusionary. People don't have to agree with my politics to enjoy what I do, and what we do here at Kinda Funny, and",
            "start": 807.16
        },
        {
            "text": "Funny. In fact, I hope they do. I may be politically outspoken, but I'm certainly not exclusionary. People don't have to agree with my politics to enjoy what I do, and what we do here at Kinda Funny. And I guarantee you, a not so insignificant portion of our audience doesn't agree with my politics. Our connection requires a special sort of bravery and tolerance this tweet flees from with great haste. Though it's well within a person's right to be exclusionary, again though, I find it antithetic to the sort of unity I hope we should be striving for right now, not only in the gaming industry, but in society generally. See what I heard from Rami Ismail, and what I see and hear from others, is a situation full of fear, but also one full of hope. One with a solution. At PAX South, proceeds from the sale of merchandise at Ismail's booth was donated to the ACLU. A productive and useful maneuver designed to directly counteract what he sees as wrong. I respect the **** out of that. Surely Ismail could have told",
            "start": 844.76
        },
        {
            "text": "at Ismail's booth was donated to the ACLU. A productive and useful maneuver designed to directly counteract what he sees as wrong. I respect the **** out of that. Surely Ismail could have told people who voted for Trump to take their copies of Read Only Memories and deleted off their device immediately. But he combated negativity and toxicity with positivity and optimism. No matter how dire it may seem to him, he makes his politics known, but doesn't attempt to limit his art to only those who agree with him. He wants to help clean up a mess he didn't contribute to at all, instead of fanning the flames and making things worse. I asked a prominent game developer friend of mine, a true-blooded liberal, if he wanted people playing his games who disagreed with him. He asked to answer anonymously, but he said the following, quote, I'm very happy for people who disagree with me to buy and play my games. While there is certainly political content in my work, I don't want to communicate only with people who agree with",
            "start": 883.84
        },
        {
            "text": "quote, I'm very happy for people who disagree with me to buy and play my games. While there is certainly political content in my work, I don't want to communicate only with people who agree with me. Maybe I'll even convince a few folks who dislike my politics to reconsider their perspective, end quote. He then touched on something that I talked about at length in last week's episode of Colin Was Right, quote, that respect goes both ways though. The audience better also respect that developers get to express themselves through their work. Critique or not buying it is good. Saying something should not exist is too far for me, end quote. He went on to describe some quote unquote soul searching he had to do when he realized that there were plenty of people in the wild who he completely disagreed with when it came to politics, who there are still people who consumed his games, use imagery as their Twitter avatars or Facebook banners, and were fans of his, quote, ultimately, I have to accept that my games can",
            "start": 921.04
        },
        {
            "text": "it came to politics who there are still people who consumed his games use imagery as their Twitter avatars or Facebook banners and were fans of his quote ultimately I have to accept that my games can bring pleasure to folks I wouldn't want to hang out with and I'm sure that feeling is mutual end quote this perspective coupled with ismail's activism represents a far more cogent useful and activated response to Trump's incursion into the gaming industry when contrasted to the needless escalation of the Tweet sent from 2064 Read Only Memories account maybe it was a shrewd piece of advertising I don't know all I know is that it's smarter to talk to people like their people try to get them back back onto your side to get them to understand what's gone wrong and how to make things better maybe I'm a naive optimist in this regard which is strange since I consider myself neither naive nor inherently optimistic but I believe in the adage that when it counts you get far more bees with honey than",
            "start": 956.32
        },
        {
            "text": "a naive optimist in this regard which is strange since I consider myself neither naive nor inherently optimistic but I believe in the adage that when it counts you get far more bees with honey than vinegar and you look a whole lot smarter in the process I reached out to Matt Khan who founded Midboss the studio behind 2064 Read Only Memories and he was kind enough to respond to my questions here's what he said when I asked if the company stands behind the Tweet quote ultimately we can't control who consumes our products and part of why made this game was to build Bridges and understanding so I think that taking the stance is probably not good in the long run but this isn't about us this is about saying what's right and needs to be said this has been a hellish week for members of the team and their families and it's pain caused by and promised by Trump that people voted for end quote when I asked him if a litmus test for politics of some sort is a prerequisite to buy Midboss's games",
            "start": 991.88
        },
        {
            "text": "and their families and it's pain caused by and promised by Trump that people voted for end quote when I asked him if a litmus test for politics of some sort is a prerequisite to buy Midboss's games Khan said quote we stand at the edge of the Abyss there is nothing wrong with conservatism or liberalism this is a straightup con man working with white nationalists to steal our country end quote when I inquired whether there was an overall downside or upside to taking a stance like this he said quote does it matter sales are irrelevant to making sure we stop this guy before he destroys our country end quote I'll give Mr. Khan this you cannot question his dedication to his principles you can't help but respect that the thing is I hope we can strive for something a little different in our tiny corner of the global economy something that stresses Unity something that approaches different people with different beliefs with the faith that their heart is in the right place I don't think we",
            "start": 1030.08
        },
        {
            "text": "corner of the global economy something that stresses Unity something that approaches different people with different beliefs with the faith that their heart is in the right place I don't think we have to like President Trump or some or any or all of his policies but I do do think we need to talk to each other with respect and give each other the benefit of the doubt even if we don't want to give the powers that be either of those things 6 million people voted for Mr. Trump I'd gather well over 60 million of them are perfectly nice reasonable kind people I happen to know some of them I'm sure you do too the Surefire way to prove you're in a bubble is to say you don't to this point my aforementioned Anonymous developer friend said this quote as developers we should continue to make games that entertain and enrich our audience maybe that's a protest game maybe it's a big chunk of escapism I'm sure there are pro-Trump developers who will want to explore their perspective through games",
            "start": 1067.12
        },
        {
            "text": "that entertain and enrich our audience maybe that's a protest game maybe it's a big chunk of escapism I'm sure there are pro-Trump developers who will want to explore their perspective through games too I think a lot of this comes down to whether you think Trump is exceptional countries have had leaders on the left and right before Leaders with ideologically different approaches attempting to make their people better off I feel that Trump is a very specific and different kind of leader one who is driven by self-interest and ignorance as a citizen I'll oppose him through any means I safely can at work I'll primarily focus on whether the sprint button feels good and quote so is Donald Trump in a war with the gaming industry yes he is though not through direct means instead his protectionist policies could increase the cost of gaming while his immigration policies are complicating the creation publishing and selling of video games what we shouldn't let Trump do whether you support him",
            "start": 1103.32
        },
        {
            "text": "policies could increase the cost of gaming while his immigration policies are complicating the creation publishing and selling of video games what we shouldn't let Trump do whether you support him or loath him is split us apart not only as a community of game enthusiasts but as Americans and for the whole video's audience a global family I believe we have far more power unified than separated and that we can find decency and common ground with each other again if only we gave each other a chance I don't like the way we're talking to each other here in early 2017 I'm truly hoping that we can change that there's nothing wrong with choosing your side of any issue there is something wrong with dehumanizing each other and splitting ourselves even further apart I truly believe that as for me I'm still looking forward to playing 2064 Read Only Memories though I'll now have in the back of my mind that as a conservative even though I didn't vote for Mr. Trump the creator of the game doesn't",
            "start": 1137.84
        },
        {
            "text": "I'm still looking forward to playing 2064 Read Only Memories though I'll now have in the back of my mind that as a conservative even though I didn't vote for Mr. Trump the creator of the game doesn't want people like me playing it at all and as lame as that may sound it bums me out a bit it probably bums you out too last week's episode of Colin Was Right stress that creators should create whatever they want and that people of all types should embrace that philosophy perhaps we can learn something by turning that notion on this head too man that was a long episode I hope you enjoyed it until next time thank you for watching",
            "start": 1174.84
        }
    ]
}