{
  "id": 2421,
  "video_id": "RNU7IuLP58o",
  "show_name": "Kinda Funny Morning Show",
  "hosts": ["Tim Gettys", "Kevin Coello", "Colin Moriarty"],
  "title": "Make Kinda Funny Great Again - Kinda Funny Morning Show 02.22.2017",
  "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1487798677,
  "duration": 4877,
  "transcript_chunks": [
    {
      "text": "🎵Music🎵 What's up guys take two. Welcome to the Kinda Funny Morning Show. Don't nod! Do not nod at me! I'm Tim Gettys. Don't nod at me. Fucking Kevin. What? This is- No Taxation himself. You guys! Colin Moriarty. The most underrated duo of Kinda Funny. Looking like a broke down Sith. I like it. It brings out- the red kind of brings out your like hate. Looking like a broke down Sith Lord. No didn't quite make it. Dropped out of Sith school. Darth... Darth Taxis. Darth- Darth Taxation. Darth Misery. Yes. Darth Misery. Now... It's good to be here. I'm never on the show anymore. But... I'm still trying to figure out where- Like this was on my desk this morning. It's a real- Kevin can I have the one please? It's a real Make America Great Again hat. Now... It was on my desk this morning. Was it really? And I was like yeah. And then you gave it to me? Well I was like well... You know vote your conscience so... I did vote my conscience. I know. Wait a minute. Hold on. You didn't",
      "start": 0.0
    },
    {
      "text": "Was it really? And I was like yeah. And then you gave it to me? Well I was like well... You know vote your conscience so... I did vote my conscience. I know. Wait a minute. Hold on. You didn't play the game. So what's the origin of this shit? Oh shit. It's a real Make America Great Again. Wait a minute. Hold on. Holy crap. What happened? There we go. Oh okay. Yeah where did it come from? I don't know but the funny thing- I assumed- I assumed that you got it and gave it to me as a practical joke. No I wouldn't do that. That's too expensive. Now... The funny thing about it is it says Made in China. Oh yeah. On the hat. But Kevin I was wondering you should probably put it on. I don't see why. And... Go ahead. It's a snap bag. No you should put it on. You should put it on. No no. I'm not gonna put this hat on. It'll match your little outfit. Your little Darth outfit. Ooh. That's weird though. I wonder what the- What the origin of this is. We'll put it here for the entire",
      "start": 65.58
    },
    {
      "text": "no. I'm not gonna put this hat on. It'll match your little outfit. Your little Darth outfit. Ooh. That's weird though. I wonder what the- What the origin of this is. We'll put it here for the entire show. I'm sure that won't be taken out of context. If we must. I mean we really- If we must. We really don't have to. I mean I didn't say we had to do anything. None of us even have to do the show right now. No I think that we do have to do that. Part of your job. Look how big he is. I know. I don't like it. Kevin put the hat on. No. I'm technically your boss. No I- Nick's my boss. Everyone else is the owners of my company. Nick would absolutely tell you to put this hat on though. And yet he couldn't if he wanted to. You know what I mean? Well the hat's not going anywhere. I can't dematerialize the hat. So one day we're gonna get it. We're gonna get it onto your fucking head. Your hat. I really doubt it. Where the fuck did the hat come from? Like who bought it? Here's the thing.",
      "start": 105.24
    },
    {
      "text": "the hat. So one day we're gonna get it. We're gonna get it onto your fucking head. Your hat. I really doubt it. Where the fuck did the hat come from? Like who bought it? Here's the thing. Someone must have sent it to the- Oh okay. Because there's no box. Greg did this. No Greg wouldn't do this. Oh you know what? Maybe Greg bought it. Maybe Greg bought it for the Australian thing. Oh that would be funny. And then it didn't come in time. And he's just been holding it. That sounds wrong. That would have been fucking awesome if you wore this in Australia. We definitely played the heel role in Australia and trumped it up a bit. I'll never forget seeing one of these for the first time. Like someone in California wearing one before he was anything at all. And I was like that's an interesting hat. I mean it's the worst design in the world. I understand that we're a company that for our first year and a half our logo was an Impact font. Hey whoa whoa whoa whoa. But like- We rock",
      "start": 146.1
    },
    {
      "text": "hat. I mean it's the worst design in the world. I understand that we're a company that for our first year and a half our logo was an Impact font. Hey whoa whoa whoa whoa. But like- We rock that shit. What is this fucking area? Wait Kevin. Kevin someone had a good idea. Put your face back on and don't move. Oh God. Don't move Kevin. Oh oh. This is the fly Kevin. Because he's like a fly. I hate this. You need to fix that like- I know. I just saw that too. There's issues. He trademarked it years ago. Steve-o-mat-kick. I'm sure he made a lot of money on these hats. Yeah God. We should sell a- Didn't we have an idea to sell a- Make the Vita Great Again. Make Vita Great Again yeah. Which we should still do. Didn't pan out. I mean it would be a great hat though. It would be a great hat. How you doing Colin? I'm all right. Yeah. Yeah I'm still a little sick. I feel it in my face area you know? And that itchy throat. I had a bunch of nightmares a couple nights ago. And I",
      "start": 190.98
    },
    {
      "text": "great hat. How you doing Colin? I'm all right. Yeah. Yeah I'm still a little sick. I feel it in my face area you know? And that itchy throat. I had a bunch of nightmares a couple nights ago. And I think it was because I was sick. I didn't like it. Night terrors? Yeah I was waking up. I haven't had that type of problem in years. I was just a soft- Or what played through Fatal Frame. I haven't talked to anyone about this but I keep having dreams with The Rock. Of just him being mean. Like coming to Kinda Funny Live 3 and just being mean. Being a asshole. I'm scared guys. I can't imagine him being a mean person. Yeah me neither. Yeah I can't imagine it either but I also couldn't imagine you guys being mean. Came real easy you know what I mean? Yeah that's true. But Colin so I've had a lot of nightmares but I also had a dream that- Like Martin Luther King Jr. Yes it's very similar actually. It's like a little uncanny. I don't think that you are the target audience for",
      "start": 248.82
    },
    {
      "text": "I've had a lot of nightmares but I also had a dream that- Like Martin Luther King Jr. Yes it's very similar actually. It's like a little uncanny. I don't think that you are the target audience for this dream but I feel like you might appreciate aspects of it. So you know me. I scheme a lot. I think a lot. I'm always planning and trying to accomplish more than I'm capable of. In my dream it was me and Nick. And we were at CBS. Like in here? No no no. Like the real CBS. And we were pitching them on a reality show. And they were like here's the thing the reality show can't have to do with you which was really hard for me to fathom and deal with right? But I've been watching a lot of The Bachelor. This has kind of been an ongoing thing in my life the last couple weeks. So I've been in this world of reality TV of dating stuff because that's where the drama comes from. Drama is what people are here for. Who gives a fuck who wins and whatever. It's about the drama of the",
      "start": 296.74
    },
    {
      "text": "been in this world of reality TV of dating stuff because that's where the drama comes from. Drama is what people are here for. Who gives a fuck who wins and whatever. It's about the drama of the interactions right? And I was like how do we maximize drama? So me and Nick came up with a pitch the perfect pitch for a reality show for CBS. It goes a little something like this. 30 contestants right? No one ever gets eliminated. They're all there for a month in a giant mansion. 30 contestants. And what's the goal? Who wins? I don't know. We'll figure that part out later. Maybe if you're coupled up by the end you get money. We'll have to figure out the semantics of it. But the concept is you start with one person right? The second person is that person's ex. The third person is the second person's ex. The fourth person and so on and so on. So everybody has at least one ex-boyfriend or girlfriend at least one. I'm sure we'll get some fun over that. And those are storylines that will",
      "start": 344.74
    },
    {
      "text": "person's ex. The fourth person and so on and so on. So everybody has at least one ex-boyfriend or girlfriend at least one. I'm sure we'll get some fun over that. And those are storylines that will develop right? Interesting okay. And the person was like that sounds a lot like high school. Everyone's just dating each other. And I respond exactly the name of the show High School. Oh shit! So yeah I thought this out. And then I woke up and I'm like I'm a fucking genius. So yeah I'm pretty proud of myself for having a fairly fully thought out plan. What was the nightmare? In my dream. The nightmare was it was one of those things where just a lot of scary shit was happening. Me and Nick had been talking a lot about trying to make a horror short for Halloween. And so we've been trying to really think about what are the scariest things. I think that that's been having some ramifications on me. Yeah I don't have nightmares too often. But I have the same kinds of dreams over and",
      "start": 393.46
    },
    {
      "text": "to really think about what are the scariest things. I think that that's been having some ramifications on me. Yeah I don't have nightmares too often. But I have the same kinds of dreams over and over again. Always trying to get somewhere but never being able to accomplish what I'm trying to do. Like literally the same thing over and over again just for years. I can be in any situation trying to find a store in the mall can't find it. Trying to get the class on time never get there. Oh dear. Like it's clearly a metaphor right? Or something. But yeah it's something weird. It's something weird within me. Like I have those dreams over and over again. I gotta write this paper for school for some reason. There's an entrance. It's late. You know? There's such a weird sinking feeling you have when you know you're not making it on time. The paper's not going to get done. Whatever it is it's just like fuck man. Especially because Tim I'm so deeply depressed that I sleep to escape",
      "start": 435.62
    },
    {
      "text": "have when you know you're not making it on time. The paper's not going to get done. Whatever it is it's just like fuck man. Especially because Tim I'm so deeply depressed that I sleep to escape life. As one does Kevin. And then I'm set with existential problems in my dreams. When you're sleeping yeah. Oh man that's a problem. Kevin stop with the thing. You've become too big for your britches. I've seen people say it. How big has he gotten? You're technically losing weight. That's fucking horrifying dude. You're a horrifying man. We gotta get you into this hat though Kevin. You're made for this hat. Look at this thing. Greg bought it. He spent a lot of money. This is he went into Donald Trump. Maybe Ivanka Trump's bank account. Maybe Melania Trump's bank account. I'm gonna need you to wear this at some point. That's such fun names. Kevin we use every part of the fucking bison the buffalo. Including the Make America Great Again hat. Can you pull the tips? Not to read names.",
      "start": 478.42
    },
    {
      "text": "to wear this at some point. That's such fun names. Kevin we use every part of the fucking bison the buffalo. Including the Make America Great Again hat. Can you pull the tips? Not to read names. I did. I brought them up already. Cool. Just to get them up. So let's get into the housekeeping stuff. This is the Kinda Funny Morning Show. It happens each and every day here. Twitch.tv/kindafunnygames at 11 a.m. Pacific time. You can get it later over on YouTube.com/kindafunny or podcast services around the world including Beyond Pod iTunes Stitcher Google Play all that stuff. And in addition to that we got some cool fun news about Greg Miller. Jesus. There we go. He's in Vegas currently. Good. Playing the Nintendo Switch. Let him stay there. He's going to be hosting the Dice Awards tomorrow night at 730. You can watch them right here on Twitch.tv/kindafunnygames. Greg was running through the jokes because he's hosted. It's him and Joe about hosting and",
      "start": 535.06
    },
    {
      "text": "the Dice Awards tomorrow night at 730. You can watch them right here on Twitch.tv/kindafunnygames. Greg was running through the jokes because he's hosted. It's him and Joe about hosting and they're doing their whole like he wrote it. Him and Drucker worked on it. Oh OK cool. That shit is funny as fuck. It's really good. I'm very proud of them. This is going to kill. I think people are going to like it a lot. Of course there's going to be the haters. Fuck you guys. This shit's funny as hell. I bet you you couldn't do better. Anybody. Anybody. Drucker's a funny motherfucker. Yeah he's a very good writer. And Drucker and video game comedy it's like are you kidding me? It's just amazing. It works. Yeah it works really well. I'm interested to see how Greg does. Very excited about that. We don't see enough of him so we should really see more of Greg. I think one of the great demands that have been happening I don't know if you can confirm this but I feel like one of the",
      "start": 585.3
    },
    {
      "text": "that. We don't see enough of him so we should really see more of Greg. I think one of the great demands that have been happening I don't know if you can confirm this but I feel like one of the great demands we have is everyone's like we don't see nearly enough Greg. Yeah. And so what we need to do is... Greg's not afraid. He doesn't hide. What does that mean? I hide? Why would you think that? Why is that what I'm saying? Seems like that was your incident. I inferred that from what you said. I wasn't implying. I was not implying anything. Because I feel like in general it's the law of diminishing returns with me Kevin. Like you got to have just a little bit of... You got to keep him right on the line. You can't have too much Colin. You can't have too much Kevin. You can't have too much Tim. Because it rubber bands on you real quick. You want to keep them wanting more and more and more and more and more and more. And I don't know that that's necessarily a problem with Greg",
      "start": 627.3
    },
    {
      "text": "too much Tim. Because it rubber bands on you real quick. You want to keep them wanting more and more and more and more and more and more. And I don't know that that's necessarily a problem with Greg Miller. He gives him a lot. He does. And he just gives him more anyway. He has more to give though. I mean I can't imagine Greg never having less to give than what he has to give right now. Does that make sense to you Kevin? It does not. Tim? Doesn't make sense to me at all. But I appreciate the sentiment. I get where you're going with it. But that sentence I'm not sure. I slept for like three hours last night so I'm not even really sure what I'm saying. Yeah. Video games? Yeah. Actually I've been falling down the... So every once in a while I fall down the Howard Stern rabbit hole. And everyone's been talking a lot about freedom of speech freedom of expression all those kinds of things. I've been really kind of really falling down the rabbit hole watching old Howard Stern clips",
      "start": 669.14
    },
    {
      "text": "everyone's been talking a lot about freedom of speech freedom of expression all those kinds of things. I've been really kind of really falling down the rabbit hole watching old Howard Stern clips from the 90s and early 2000s. And he just really pushed... I mean we already know this but he really pushed the limits. What a great man. What a smart man. What a great interviewer. What an important component of American media. And especially watching the... Do you know the Whack Pack? Do you know anything about... Yeah yeah yeah. I'm like this is so amazing. He just doesn't care. The Sybian stuff he did where it was just the porn stars. Just genius. Just like... Art really. Orgasm while being interviewed. I'm like this is Tim humor if I ever saw it. It's so brilliant. I mean he does that in Private Parts I think right? With one of them or a woman straddles the speaker and stuff like that. Yeah yeah yeah. And I think he like... He hums into it. But it's just so interesting",
      "start": 717.7
    },
    {
      "text": "that in Private Parts I think right? With one of them or a woman straddles the speaker and stuff like that. Yeah yeah yeah. And I think he like... He hums into it. But it's just so interesting that he just didn't care and just doesn't care. Like he just says what he wants. That's the thing though. He's like that is not a true statement. He does care. He knows exactly what he's doing and he says what he wants. It's like it all feeds into itself. And that's how you know hats get made and people become celebrities. When you just fucking... It's like South Park and all that shit. It's like when you're doing something different very loudly people are going to listen to it. Whether or not they like it. And that's what you see with all of these things we're talking about. You either love it or hate it. His dry affect is really what makes it for me. I was watching the... They had Bill Maher on in the late 90s with some of the Whack Pack doing Politically Incorrect. But as if he",
      "start": 757.38
    },
    {
      "text": "love it or hate it. His dry affect is really what makes it for me. I was watching the... They had Bill Maher on in the late 90s with some of the Whack Pack doing Politically Incorrect. But as if he was hosting a show with normal people. But it was like... You know... And these are really the guys' names. Gary the Retard is one of the guys' names. All these things. He has Daniel Carver the Ku Klux Klan guy on the set. All together Beetlejuice. And they're all just acting as if they're on an episode of Holy Lick. And Greg is like this is insane. This is so amazing that he just pushed the limit. So it just went far beyond the line. He's an interesting man. What was the movie that he was in? I remember it was really interesting. Private Parts? Was it Private Parts? That's his book. Or his book that he wrote. Yeah yeah yeah. I remember watching that when I was really young. Just being like this seems really cool. It's just... I was reading about specifically with his character or",
      "start": 798.02
    },
    {
      "text": "book that he wrote. Yeah yeah yeah. I remember watching that when I was really young. Just being like this seems really cool. It's just... I was reading about specifically with his character or the guy that was on the show Gary the Retard or whatever. Like I was like... While I was reading about him because I haven't watched it. So I really started to really appreciate him. Everyone knows who Howard Stern is. I mean when I was in middle school and high school I'd watch him on... You guys were a little young I guess. But I was watching him on E! on the show. His show was on after school. It was like a part of the syndicated thing. But when I looked at Scott Bromley Scott Bromley is a huge Howard Stern fan. And he had Howard TV which is like the pay for kind of thing through Comcast. And I used to sit there with him every day and watch like an hour or so of it. And it's just really really funny stuff. But I was reading about him recently with the characters that he has",
      "start": 843.54
    },
    {
      "text": "Comcast. And I used to sit there with him every day and watch like an hour or so of it. And it's just really really funny stuff. But I was reading about him recently with the characters that he has inappropriately named. Like the Gary the Retard character and all these other guys. Where he actually had a change of heart and had renamed all these characters. Yeah now people in the chat are saying that it's Gary the Conqueror. Yeah Gary the Conqueror. And then apparently Aaron was telling me that Robin who's like his sidekick or whatever like still kind of doesn't agree with that kind of stuff. It still calls them by their old name and stuff like that. And I'm like it's just interesting that he had the tenacity and the balls to do that. And I think the reason that he pushed the limit by using a word that he knew was offensive was because the FCC couldn't find him for using that word. Couldn't find him for having a Ku Klux Klan member on saying racist things and stuff like that.",
      "start": 877.38
    },
    {
      "text": "by using a word that he knew was offensive was because the FCC couldn't find him for using that word. Couldn't find him for having a Ku Klux Klan member on saying racist things and stuff like that. And it's like it's just interesting radio. And the movie Private Parts is really interesting. You know Don Imus was the big deal. And then he came in and like stole Don Imus's thunder basically. Very interesting stuff. I haven't seen him in years or heard him in years. Stern? Yeah I know he does stuff. I'm pretty sure when he signed that Sirius that was the crazy thing. When he signed that contract with Sirius a hundred million dollars a year. One hundred million dollars a year. Good for him. He was making it. It wasn't like for his show like they all I was watching a video about all their contract negotiations with Sirius and they all negotiated separately. Yeah. So like that was just his money. I think his first deal was five hundred million dollars for five years. My God. And I",
      "start": 911.38
    },
    {
      "text": "contract negotiations with Sirius and they all negotiated separately. Yeah. So like that was just his money. I think his first deal was five hundred million dollars for five years. My God. And I think that whole thing the only reason he still does radio is because it's like they're basically throwing so much money at him that it's not like twenty million dollars a year. It's like he's like well how can you not do this for three days a week? Wasn't he going to quit? Yeah I think twice he tried he was going to quit. And then they were like they gave him so much money like half a billion dollar contract that you can't walk away from that kind of money. That's baller. Anyway I do recommend if you guys are in a free especially a younger audience those really maybe are not familiar with Stern. We're not really in terrestrial radio is not really a thing anymore. Don't go to YouTube and fall down the Howard Stern hole. You can do it for weeks and months. There's so much shit on",
      "start": 950.42
    },
    {
      "text": "with Stern. We're not really in terrestrial radio is not really a thing anymore. Don't go to YouTube and fall down the Howard Stern hole. You can do it for weeks and months. There's so much shit on there. Yeah I remember I didn't even ever watch him on TV. It was like downloading clips off because I just watching shit. I remember trying to find full episodes because I like this shit's hilarious. Anyways Kevin let's pull up the first story. Thank you. Hold on. So this has been kind of an ongoing situation Colin. OK. There's this little game called Crash Bandicoot. I saw this. The Insane Trilogy. And there's been a big question of whether or not it's exclusive on the PlayStation 4 because when it was announced at E3 Shawn Layden was very kind of like vague about the wording. And he was just like we're partnered with Activision to bring back the originals. And you'll play as him first in Skylanders this year on the PlayStation 4. And it's like OK you didn't mention exclusivity.",
      "start": 986.74
    },
    {
      "text": "just like we're partnered with Activision to bring back the originals. And you'll play as him first in Skylanders this year on the PlayStation 4. And it's like OK you didn't mention exclusivity. You didn't even say it first. You didn't even say anything. Right. Then there's been a lot of questions since like we haven't seen anything on the box art of exclusive on PlayStation. But nowadays that's not even necessary. Things like Nioh don't have that on the box art. We talked about this last week on the show. Yesterday PlayStation Ireland tweeted out. Someone was like hey is Crash going to be exclusive to PlayStation? And they're like yeah exclusive to PlayStation. Everyone's tweeting at me and Nioh blowing up and stuff. And I'm like guys can you not see through this? Like this is not going to be confirmed by PlayStation Ireland. Right. Yeah no. Like no. They're out of the loop. Yeah. PlayStation Ireland doesn't know what the fuck is going on at all. No they definitely",
      "start": 1035.22
    },
    {
      "text": "is not going to be confirmed by PlayStation Ireland. Right. Yeah no. Like no. They're out of the loop. Yeah. PlayStation Ireland doesn't know what the fuck is going on at all. No they definitely don't. They definitely don't. So then today it was late last night PlayStation Ireland tweeted out. They're like no so to clarify it will be coming to PlayStation 4 and PlayStation 4 Pro first. That's not a huge surprise. Interesting. Great news I think. Great news. Because what does this mean? Xbox One obviously. Nintendo Switch. Maybe. My theory is that it's not coming to Xbox One. It's coming to PC. But I just feel like there's something a little off about them revealing that at the PlayStation conference and then never saying anything about it. Well they revealed it at E3 at PlayStation's conference. But then at PSX they showed the first gameplay of it. Right. But the thing is Crash has been on every console for a long time now. That's true. But not these games. Yeah not",
      "start": 1076.5
    },
    {
      "text": "conference. But then at PSX they showed the first gameplay of it. Right. But the thing is Crash has been on every console for a long time now. That's true. But not these games. Yeah not these games. But technically PlayStation doesn't own these games. No I know. Yeah it's possible. It would be weird. But there would be good to proliferate it to the most left-hand. It'll sell more which is good news for the franchise. But what's interesting is there's been cases like this before like with GoldenEye. When they did the GoldenEye remake it was everywhere. Yeah that came to PS3. Yeah. So there's things like that. And also with Activision in particular with Diablo 3 they also did this weird vague wording of not mentioning it was coming to other consoles. But it did come to Xbox One. My question about the GoldenEye thing was all I remember about GoldenEye by the way about the GoldenEye remake is that when we were at E3 one year one of the people on the video team at IGN",
      "start": 1122.34
    },
    {
      "text": "One. My question about the GoldenEye thing was all I remember about GoldenEye by the way about the GoldenEye remake is that when we were at E3 one year one of the people on the video team at IGN broke the embargo. No one knew what the game existed. We actually leaked it. That's what I remember about that the most. But wasn't it on Wii first and then it bombed on Wii? So I wonder if it was only ported because it didn't reach sales figures. Random story about that that I'm probably breaking some idea but it probably doesn't matter because it's old. But before I even worked at IGN I used to do video game focus testing like focus room stuff. And I went to downtown SF. We all sat in a room. A bunch of people in the mic. I'd be very interested in how much these guys know about the history of games or anything. They start describing a game and I'm like they're talking about GoldenEye. Like they're fucking and I was just like is this GoldenEye? And they're like yeah yeah no.",
      "start": 1166.34
    },
    {
      "text": "of games or anything. They start describing a game and I'm like they're talking about GoldenEye. Like they're fucking and I was just like is this GoldenEye? And they're like yeah yeah no. Well I guess the cat's out the bag. Yeah so we're working on a GoldenEye remake on the Wii. And I was like holy shit are you kidding me? And like that's how I found out. But yeah you broke the NDA. Now they're going to come arrest you. Kevin call the cops. Call the video game police Kevin. Whoever the fuck made that. Kevin they only answer phone calls from people in red hats. No. You'll get them one day. We just need one frame Kevin for someone to get a picture. Yeah. But I think this is interesting. And we will see. I really do hope it comes to the Switch because I think that that's the type of game that could do really well on the Switch. Platformers and things like that could sell well. And again I just want this franchise to succeed. I want a chance at Crash Team Racing",
      "start": 1204.82
    },
    {
      "text": "the type of game that could do really well on the Switch. Platformers and things like that could sell well. And again I just want this franchise to succeed. I want a chance at Crash Team Racing coming back and that type of stuff. Well Switch is I don't know how it's going to fit into that Switch catalog. So many games coming out to support it. So I don't know if there's any. I don't know Kevin. Every day games are being added Carl. Every day. Every day. Man that launch line up though huh? Over 61 coming through. 61 games? It's fucking out of Launch Line. We got Zelda. OK. But this is the I can't you know I can't even have this argument. I'd rather play Zelda than anything that launched on PS4. Well me too actually. But then what? That's all that matters. Because everyone keeps saying PS4 and Xbox One did set a new bar. I don't care what anyone says set a new bar for Launch Lineups. There are a lot of great games. Yeah there was a lot of good games. There was a lot of",
      "start": 1251.0
    },
    {
      "text": "saying PS4 and Xbox One did set a new bar. I don't care what anyone says set a new bar for Launch Lineups. There are a lot of great games. Yeah there was a lot of good games. There was a lot of OK I guess that's here games. I bought a PS4 day one. And I'm like don't really give a fuck about playing these games. It was like all right I guess I will play Marvel Avengers. Pretty big deal though that it launched with a Call of Duty an Assassin's Creed and a Battlefield. Yeah that's true. That's never going to get that's never going to that line up's never going to get beaten. Solid points that are irrelevant to me. So I'm like games I don't play or games I do play. I didn't play Battlefield or Assassin's Creed. Though I did play because everyone's like they were ports. And I'm like the games came out two to three weeks before the PS4 launch. So they're really not ports in the same vein that we're talking about now. Yeah but it's like ports in the way where it's like",
      "start": 1291.16
    },
    {
      "text": "I'm like the games came out two to three weeks before the PS4 launch. So they're really not ports in the same vein that we're talking about now. Yeah but it's like ports in the way where it's like these aren't truly made for the new system. I remember that happened with Tony Hawk's American Wasteland the generation before where they made it for the PS era. But then they also made it for Xbox 360. And it was a piece of shit. Because it was like half half-gen. It was like King Kong. Yeah. Remember that Jem? Fucking King. I remember King Kong. King Kong. Oh God. I don't remember it. What? I don't remember King Kong. Yeah you wouldn't. You were too busy studying your biology books. They were big. Next story Kev. Star Wars IMAX news here. Some Star Wars: The Last Jedi scenes shot in IMAX. This is according to Alex Gileadove over at IGN.",
      "start": 1330.68
    },
    {
      "text": "This is according to Alex Gileadove over at IGN. Disney has announced that Star Wars: The Last Jedi has been partially shot in IMAX. Director Rian Johnson has captured specific sequences from the film using IMAX cameras which provide an exclusive aspect ratio and an increased image quality. J.J. Abrams also partially shot The Force Awakens in IMAX. At least part of the IMAX footage The Last Jedi was shot on location in Ireland presumably on the island of Skellig Michael for the first Jedi Temple scenes involving Luke and glimpsed briefly at the end of The Force Awakens. Along with The Last Jedi several other Disney films will also be shot in IMAX as part of an extended multi-picture deal between Disney and IMAX that will run until 019. The deal includes films such as Lucasfilm's untitled fifth Indiana Jones movie, Star Wars: Episode IX, Beauty and the Beast, A Wrinkle in Time, Mulan, The Incredibles, Toy Story 4, Wreck-It Ralph, Black Panther, Ant-Man and the Wasp, Captain",
      "start": 1375.0
    },
    {
      "text": "fifth Indiana Jones movie, Star Wars: Episode IX, Beauty and the Beast, A Wrinkle in Time, Mulan, The Incredibles, Toy Story 4, Wreck-It Ralph, Black Panther, Ant-Man and the Wasp, Captain Marvel, Avengers: Infinity War, the untitled Han Solo Star Wars movie, and the untitled fourth Avengers movie. It's a lot of movies. It is a lot of movies which is really interesting. Things being shot in IMAX is a very special thing. There hasn't been too many in our history and every time it's always like a feat of cinematic marvel going to see that shit in IMAX theaters it's like this is how movies fucking should be. Does Nick like IMAX movies? Yes. But he doesn't like 3D movies. Yeah no. I mean this is totally different. IMAX is like just a bigger wide aspect ratio. He just seems like a purist. He wouldn't like anything like that. Well no but I mean that's pure. So that's just pure. IMAX is pure. So pure. It's like cocaine that's really pure Kevin. Yeah. Yep. So that shit's good.",
      "start": 1411.4
    },
    {
      "text": "He wouldn't like anything like that. Well no but I mean that's pure. So that's just pure. IMAX is pure. So pure. It's like cocaine that's really pure Kevin. Yeah. Yep. So that shit's good. What's interesting here is they're talking about like shooting in IMAX and then they mention Incredibles which is a CG movie. So I don't know that that necessarily counts. Can they if they just make it really big wouldn't that count? Well it's not shooting in IMAX. Yeah you're right. It's not I mean a CG movie in IMAX isn't a big deal. Let's just make it that way. Why don't... Anyway very very exciting. The IMAX shots in Force Awakens were great. Next story Kev. OK. Sticking on movie news. We got some real sad shit here Colin that I know you're going to care about. So so good. That's the girl from Game of Thrones. It is yes. Sophie Turner. X-Men writer Simon Kinberg rumored to direct a Dark Phoenix X sequel. Talk of a sequel to X-Men: Apocalypse has been rampant as of late.",
      "start": 1457.88
    },
    {
      "text": "the girl from Game of Thrones. It is yes. Sophie Turner. X-Men writer Simon Kinberg rumored to direct a Dark Phoenix X sequel. Talk of a sequel to X-Men: Apocalypse has been rampant as of late. There have been rumors of titles shooting dates actors returning and more. But one thing there has been an answer to is who might write and direct the expected X sequel. Now that name may finally be revealed. The name is Simon Kinberg who has co-written and produced the last three X-Men films as well as produced Fantastic Four, Deadpool, Logan, basically everything the X-Men franchise sends First Class. Collado reports that Kinberg who has never directed a feature film is in talks to direct the next X sequel from a script he's already written. And yes that script would be the telling of the Dark Phoenix Saga which has been teased numerous times in the franchise. So here's the thing Colin. Here's why this is alarming. X-Men franchise. So you look at the Marvel Cinematic Universe you",
      "start": 1504.84
    },
    {
      "text": "Dark Phoenix Saga which has been teased numerous times in the franchise. So here's the thing Colin. Here's why this is alarming. X-Men franchise. So you look at the Marvel Cinematic Universe you look at the DC Cinematic Universe and then there's the X-Men Cinematic Universe. R.I.P. Spider-Man. He's done right? Right. Now he's in Marvel. Yay. Okay. Marvel track record good. DC track record bad. Right. X-Men track record all over the fucking place. There's ups there's downs who the fuck knows. Logan is coming out next week supposedly amazing. Getting reviews talking about it being the best superhero movie since Dark Knight like all this stuff. Like I'm stoked. I'm sure. Very very stoked about this right? But X-Men's seen some good days seen some bad days. Days of Future Past two movies ago excellent. Right. They did a great job. First Class before that excellent. Apocalypse. Yeah he didn't look good. Nobody liked Apocalypse. Right. Nobody liked Apocalypse. And that's",
      "start": 1541.56
    },
    {
      "text": "two movies ago excellent. Right. They did a great job. First Class before that excellent. Apocalypse. Yeah he didn't look good. Nobody liked Apocalypse. Right. Nobody liked Apocalypse. And that's when Simon Kinberg's getting more and more involved. Also heavily involved in writing X-Men: The Last Stand, the third X-Men movie which is almost unanimously decided trash. Okay I never saw that one. I saw the first two X-Men movies. Yeah and those are regarded as being very good for their time. Yeah. You look at them now and you're like... My dad accidentally rented one of them. I remember that's how I watched it. Well X- I'll always love X-. Yeah X-3 fucking sucked really bad and he was really heavily involved in that. And that was the Dark Phoenix thing. So him doing it again it's like no guys no stop. Fucking stop. I thought the Fantastic Four would be the Harbinger. Oh and then that too. So he wrote I think the last 0 minutes of Fantastic Four. Just the last 0 minutes",
      "start": 1587.8
    },
    {
      "text": "no guys no stop. Fucking stop. I thought the Fantastic Four would be the Harbinger. Oh and then that too. So he wrote I think the last 0 minutes of Fantastic Four. Just the last 0 minutes huh? I think so because there was a whole fucking thing. But anyways very upsetting stuff. Like the X-Men just need to really get the shit out of them. Are you aware that your brother has never seen any of the Marvel movies? I believe it. I believe it. No. Um I actually I think I'm in it this week Colin. This is an invitation for you as well. I'm gonna watch them all. Which ones? All of them. All the Marvel movies? Yeah the like proper Marvel movies. I would rather just die. Let's just do it together. It'd be fun. Come on. You want to just die Kevin. No it'll be fun. You'll enjoy it. You'll enjoy it. We'll do it together. It'd be fun. Marvel's not my thing. Batman is only Batman. That's because you haven't given Marvel a chance. I mean I saw I mean I won't stop. You're gonna make",
      "start": 1627.56
    },
    {
      "text": "enjoy it. We'll do it together. It'd be fun. Marvel's not my thing. Batman is only Batman. That's because you haven't given Marvel a chance. I mean I saw I mean I won't stop. You're gonna make yourself sound silly. But I saw the Spider-Man films back in the day. You see what you did? X-Men movies. I saw Iron Man. Are you seeing this? You liked Iron Man though right? Yeah. The one. That was the first Marvel movie. I saw that with Charles Onyett. Good man. I don't know who that is. You don't know who Charles Onyett is. You know Charles Onyett. You've been Charles Onyett many times. Okay. All right. I guess what I'm saying is I'd rather I mean I'd love to spend time with you Kevin. I'd love to week a much minute. Let's go to my house. I'll make macaroni and cheese for us. It'll be great. But it's the subject matter. Like it's just I can't. But if you don't know. I can't with Marvel. With you know the Ant-Man guy and the Fantastic Four. He's actually Ant-Man and Fantastic Four is",
      "start": 1680.54
    },
    {
      "text": "But it's the subject matter. Like it's just I can't. But if you don't know. I can't with Marvel. With you know the Ant-Man guy and the Fantastic Four. He's actually Ant-Man and Fantastic Four is Fox. But they're Marvel properties right? But they're not. Yeah but it doesn't matter though. That's like saying. They're not in the Marvel Cinematic Universe. It's a thing. Do you really want the Fantastic Four in the Marvel Cinematic Universe? I mean yeah. Because the Fantastic Four in the Fox Universe sucks. It's not even in the Fox Universe right? I mean it is. But it's not in the X-Men. Yeah it's not in the X-Men Fox Universe. It's stupid. It's stupid. Yeah. It's fucking stupid. You should come to my house after work today. We're gonna go watch Captain America. I gotta edit Colin was right. Captain America though. I'm so far behind. Because I'm doing two episodes this week. So I have one ready for next week because it's GDC. And. When are we recording that? I'm probably gonna have",
      "start": 1722.94
    },
    {
      "text": "Captain America though. I'm so far behind. Because I'm doing two episodes this week. So I have one ready for next week because it's GDC. And. When are we recording that? I'm probably gonna have to come in tomorrow or Friday. I mean at worst I'll come in Monday. The script that I'm working on is just not coming to guide. Simponico115 in the chat says you can only meet someone once Tim. LOL. Not true. If you meet someone briefly don't see him for a year then you've come across them again. You're re-meeting them. Right. You know? I would argue that you can meet someone multiple times. I don't necessarily disagree. I think that's kind of semantical. I would agree with you. I'm also one of them dumb kids. I can say what the fuck I want. You want me to read any of these tips? Yeah you know what? Let's get into them tips. Jesus, God. All right. Is there a lot? Yes. Today's Wednesday right? Yeah. Sure is. OK. FrancisG33 says Was listening to an old episode of Beyond the Fireside Chats",
      "start": 1764.78
    },
    {
      "text": "what? Let's get into them tips. Jesus, God. All right. Is there a lot? Yes. Today's Wednesday right? Yeah. Sure is. OK. FrancisG33 says Was listening to an old episode of Beyond the Fireside Chats where Colin told Clements how he would never leave IGN. He then started the next sentence but it's Kinda Funny. Maybe it's fun. I lied to all your faces when I said that of course. GasMCookie gave us a tip. It said Tim will we see a Hale Collins shirt or sweater sometime soon with a Colin Hydro logo? Probably not. Been trying to buy merch but you're out of larges for a lot of items. Yep. So again just to be transparent about this all American Apparel went under causing a lot of difficulties for people to restock shirts. Merch distributors around the world are fucked including Rooster Teeth. They're trying to figure it out. They're doing a great job trying to get more buyers to get more shirts to restock stuff. But bear with the store. It is trying its best. Do you know they",
      "start": 1805.66
    },
    {
      "text": "Teeth. They're trying to figure it out. They're doing a great job trying to get more buyers to get more shirts to restock stuff. But bear with the store. It is trying its best. Do you know they actually didn't go under? They got bought by another company. The company was just like now you're done. No you're done. That's crazy. Yeah. It's like how GM bought all the electric battery companies in the 90s to kill the electric car. You actually watch the documentary Who Killed the Electric Car? I just spoiled it for you. Walkin Talkin Steven Hawkin. Best name. Says Hey guys long time no watch. Have you seen the reviews for this game Horizon Zero Dawn? Looks pretty good. Do you think it's worth the $6? That game sucks. I think it's worth it. Truth finally comes out. Calls it all the balls to say it. No for real Horizon Zero Dawn is the best PlayStation 4 first party game including better than Uncharted 4. And I'm looking forward to everyone enjoying it. It takes place on the moon in",
      "start": 1848.22
    },
    {
      "text": "say it. No for real Horizon Zero Dawn is the best PlayStation 4 first party game including better than Uncharted 4. And I'm looking forward to everyone enjoying it. It takes place on the moon in case you're curious. Dude people are tripping about that. I know it's awesome. No lie. When I walked in I was doing something while they were recording that. And I came in and that's all they were talking about. And I was like does it? Does it? You're going to find out when you play it. Yourself. Greg told me it takes place on Mars. It takes place on the moon. And that's a huge part. I love it. The other thing what did someone say? I was reading NeoGAF I actually posted because it was someone was like this five second segment is a spoiler from our review or from the podcast or from BS I Love You. And I went to listen to the five second thing and it was something about how you're going to be surprised about when and where it takes place. I'm like that's not a spoiler. Spoiler culture.",
      "start": 1891.18
    },
    {
      "text": "you. And I went to listen to the five second thing and it was something about how you're going to be surprised about when and where it takes place. I'm like that's not a spoiler. Spoiler culture. I appreciate not spoiling anything. I get mad. Someone spoiled The Killing for me a while ago. Years ago and it really pissed me off. What is it? It was an AMC show about this like murder of a girl. And actually one of the characters in it is the guy who played Cole in the Infamous games. There's a little Eric Leighton in his name. But I'm like that's not a spoiler. But I am spoiling it for you right now. Horizon Zero Dawn takes place on Mars. And it's all fucked up. I cut your audio. So you're like Horizon takes place and I cut it. You got to protect the people. Then I brought it back and it's all and then I cut it again. Oh man. The Hot Boy. He said the Hot Boy if you're reading this column I mean I can you don't have to spell it off. It literally says the Hot Boy but then you see",
      "start": 1932.78
    },
    {
      "text": "all and then I cut it again. Oh man. The Hot Boy. He said the Hot Boy if you're reading this column I mean I can you don't have to spell it off. It literally says the Hot Boy but then you see you like phonetically spell. I'm not Greg. OK Kevin Greg struggles with names. Don't applaud that. That's not a feat. Good Lord. It says Colin can Kevin give you the one and can you tell my friend Jose Fernandez how bad PC gaming is? Kevin give me the one. PC gaming is actually not nearly as bad as I make it out to be. Thank you Kevin. All right. Never asked Colin to do anything. Josh? He won't do it. Josh says Tim Trump's making America great again. Let's make Coca-Cola great again. John Pemberton OG recipe. What does that mean? What does that mean? Don't bring Coca-Cola into this. What the fuck? Real Radek 13. So Killzone reference Kevin. Says what are your hopes? I'm sorry. Is it? Yes Radek is a Killzone character. What are your hopes for Kingdom Hearts 3? What worlds would",
      "start": 1985.42
    },
    {
      "text": "the fuck? Real Radek 13. So Killzone reference Kevin. Says what are your hopes? I'm sorry. Is it? Yes Radek is a Killzone character. What are your hopes for Kingdom Hearts 3? What worlds would you like to see? This I'll leave this to Tim. It says personally I would love to see Toy Story and Robin Hood. Robin Hood is the best Disney movie. When do you realistically think Square will release it? Robin Hood is my favorite Disney movie. Followed by Peter Pan. Followed by Fox and the Hound. Sad movie. I was going to say I was going to really pull out some random ones to piss everyone. Really piss everyone off. Say like Mulan. The Rescuers Down Under. Don't talk shit about Mulan. Mulan is not in the top three. It's Robin Hood, Peter Pan, Fox and the Hound. Those are the most call in answers. Like fucking possible. Like that's so funny. It's like not even the Golden Age, not even the Silver Age. Just like the those. I can hate on those. You can't hate on them. But anyways Kingdom",
      "start": 2047.34
    },
    {
      "text": "Like fucking possible. Like that's so funny. It's like not even the Golden Age, not even the Silver Age. Just like the those. I can hate on those. You can't hate on them. But anyways Kingdom Hearts 3 I really do want a Frozen world. I think like we should get it. But I think that'd be fun. And I want there to be a Marvel world and a Star Wars world. I don't want Marvel to like Spider-Man is this and this. I want specifically you know the right things. I'm not in these. No they're not. Stop. Nobody knows what you're talking about. It's in L.A. Talk about it later. I will talk about it later. You fuck. All right. Bring the shit up early. I need to check it. I understand Kevin. Jason McCullough. What's he got to say? Says Colin in your GameOverGreggy topic you talk about homage to sports teams. I grew up in Arkansas so with no NFL team I became a fan of the Baltimore Ravens around their 000 series. I feel like it's OK. I mean you can tell yourself whatever you want. It is",
      "start": 2093.58
    },
    {
      "text": "sports teams. I grew up in Arkansas so with no NFL team I became a fan of the Baltimore Ravens around their 000 series. I feel like it's OK. I mean you can tell yourself whatever you want. It is difficult to be from a place with no sports teams. But there's a geographic kind of relationship. I feel like in Arkansas you should probably be a Tennessee Titans fan. Just like in Virginia Virginians are typically Redskins fans because of the geographic proximity. You can't just go around picking anything you want. That's not the way it works. Kevin. Eric Koval says Hey Colin and Kinda Funny best friends who are Yankees fans. Check out my podcast. It's called Yankee Names to Nose and breaks down some interesting Yankees prospects in camp this spring. Does this look like your promotional platform? Eric. Kevin I want to see on the screen real quick. Ah. Falcon Box gave us. I'm like losing my mind. I'm doing I'm doing I'm reading tips. You can interrupt me whenever you want. Oh OK.",
      "start": 2143.82
    },
    {
      "text": "platform? Eric. Kevin I want to see on the screen real quick. Ah. Falcon Box gave us. I'm like losing my mind. I'm doing I'm doing I'm reading tips. You can interrupt me whenever you want. Oh OK. Now keep going. We'll do two more tips. Falcon Box. We'll get back to the story. So take on you said in the Horizon Review we're dealing with some personal issues during your play through. Hope all's well, have a drink. I mean thank you very much. I was it was a that's why I haven't been there yet because I was I was taken away from it for quite some time. But everything's fine. Thank you. What what? I just put this in here. We want to do it as a story. I think you out of most out of everyone will enjoy it the most. But I talked about how I feel about Alex Trebek. You know how I feel about him. How do you feel about Alex Trebek? Alex Trebek bothers me because he says the answers when someone gets a question wrong is if he knew the answer. He is an actual. And he doesn't know the answer.",
      "start": 2188.78
    },
    {
      "text": "How do you feel about Alex Trebek? Alex Trebek bothers me because he says the answers when someone gets a question wrong is if he knew the answer. He is an actual. And he doesn't know the answer. He's like no it's 15 minutes before the show starts. He has you know the moogles or something like that. I'm like I'm like you know you don't know. Stop saying it with such confidence. Like you're not reading it all. Come on. Come on to your fucking. What you don't actually know is 15 minutes from the show. He like makes the cards puts them up there. It just it comes out of here right here. His mind. Alex Trebek knows all. He's full of shit. All right. All right. High fructose porn syrup. Yes. This call. What is Amy Gills like in real life? I met Amy Gills? We actually had her over for dinner. And she's very nice. Very nice woman. Pretty much exactly how she is online. Yeah she's legit. She's a sweetheart. She's as real as it gets. If she was American we'd maybe hire her one",
      "start": 2233.6
    },
    {
      "text": "for dinner. And she's very nice. Very nice woman. Pretty much exactly how she is online. Yeah she's legit. She's a sweetheart. She's as real as it gets. If she was American we'd maybe hire her one day. But we don't hire people outside of the United States because Oh my God. We're making America great again. Oh my God. Hey Kevin we're going to skip a couple stories. Let's go straight to the Jim Sterling story. Oh yeah. Congratulations to Jim. Yeah. This is from over at Kotaku. Court throws out Digital Homicide's case against critic Jim Sterling. So it's not that long. All right. Yesterday a court dismissed game developer Digital Homicide's $10 million case against YouTube critic Jim Sterling. Fortunately for those of us who write about video games Sterling's scathing critique of Digital Homicide's game Slaughtering Grounds won't create precedent for developers slamming critics with million dollar lawsuits. Quote I'd say this should at least serve as a warning to developers that",
      "start": 2276.72
    },
    {
      "text": "Homicide's game Slaughtering Grounds won't create precedent for developers slamming critics with million dollar lawsuits. Quote I'd say this should at least serve as a warning to developers that such extreme measures might sound good as threats but are generally just a bad idea Sterling said in an email. Critics too should take note. Yes this case was frivolous but it still had to be taken seriously once it was served. Years ago Sterling published a YouTube video describing Digital Homicide's Slaughtering Grounds as a quote new worst game in 014 contender. Sterling who regularly plays games he considers hilariously bad skewered Slaughtering Grounds deemed it an absolute failure. His critique implied Digital Homicide was selling an original game composed of unoriginal materials or asset flipping. In response Digital Homicide accused Sterling of playing the game incorrectly perhaps to entertain or attract viewers. They soon filed a DMCA takedown to wipe Sterling's video",
      "start": 2327.84
    },
    {
      "text": "or asset flipping. In response Digital Homicide accused Sterling of playing the game incorrectly perhaps to entertain or attract viewers. They soon filed a DMCA takedown to wipe Sterling's video from YouTube. Quote we find the usage of the terms worst game in 014 contender an absolute failure to describe the entirety of our product while not absolutely actually evaluating in its entirety unfair and an unreasonable use of our copyrighted material they wrote. YouTube briefly removed the video but reinstated it after Sterling petitioned. It could have ended there but last March the miff developer filed a lawsuit accusing Sterling of assault libel and slander in Arizona District Court on top of the $10 million sum. Digital Homicide asked for apologies in place of every offending article and video for a period of no less than five years. Fucking psychotic. Now that this was a startling sight for game critics if taken seriously Digital Homicide's lawsuit could constitute a",
      "start": 2366.16
    },
    {
      "text": "article and video for a period of no less than five years. Fucking psychotic. Now that this was a startling sight for game critics if taken seriously Digital Homicide's lawsuit could constitute a threat against critics who published negative reviews on large platforms. A little desperate Digital Homicide later sued 100 mostly anonymous Steam users for $18 million in the wake of negative Steam comments. What the fuck? Steam subsequently removed Digital Homicide's games from the platform citing the company's hostility to Steam customers. Thankfully Digital Homicide's case didn't make it very far. Sterling told me the agreement to dismiss the case was exactly the result he'd hoped for although after a year of this he's pretty tired. What's particularly disturbing about lawsuits like this is that even in cases where they're clearly frivolous as this was they can force critics to spend significant amounts of money on legal defenses. Sterling had to hire a lawyer Bradley Hartman",
      "start": 2408.24
    },
    {
      "text": "is that even in cases where they're clearly frivolous as this was they can force critics to spend significant amounts of money on legal defenses. Sterling had to hire a lawyer Bradley Hartman who helped convince the court to dismiss this case in which Sterling's words involved quote series of allegations that were difficult to comprehend even for the one accused of them. Not all threats from the internet are idle ones and I wouldn't recommend anybody brush them off Sterling concluded. It's a big deal. So I was following Jim Sterling's a buddy of mine and I was following this case pretty closely. Let me start since I have the one here Kevin. Digital Homicide all the guys associated with that company go fuck yourselves. Go fuck yourselves. OK? Go fuck yourselves for what you did to Jim Sterling. But apart from that what's important here is the case was thrown out with prejudice which is a very important thing which means that the court is basically like do not even",
      "start": 2445.68
    },
    {
      "text": "did to Jim Sterling. But apart from that what's important here is the case was thrown out with prejudice which is a very important thing which means that the court is basically like do not even attempt to do this again like in this way to Jim. Throwing something out without prejudice means that you could be I mean it means a lot but it basically means that you can reconfigure what you did and come at them again. So the court was like nah you're done. You're done. And this was designed to have a chilling effect. If you really go into the depth and see what Jim's original videos the podcast Jim I think did a podcast with the guy. People can really jump down the rabbit hole and see how just demented these people were. And remember that these guys also tried to sue 100 anonymous reviewers on Steam tried to get Valve to compel Valve to give them as the story states private names similar to how the government sometimes goes at Twitter or something like that to try to find the",
      "start": 2485.36
    },
    {
      "text": "on Steam tried to get Valve to compel Valve to give them as the story states private names similar to how the government sometimes goes at Twitter or something like that to try to find the people's names and identity so that the government can go after them or whatever. Jim obviously won. I always was confident Jim would win but I know that he's a friend of mine. And I know in conversations with him and seeing things he's posted and stuff like that I know that this has been a stressful ordeal for him a very stressful ordeal as it would be for anyone. Even if you are pretty confident that you're going to have this positive outcome being sued for millions of dollars for stating an opinion on the internet about someone's shitty game is if that court case went a different way it would have set as the story suggests on Kotaku a dangerous precedent. Definitely. Definitely. Now the final news story of the day Kev. Yeah you have it right there. Little interesting news for those",
      "start": 2534.08
    },
    {
      "text": "have set as the story suggests on Kotaku a dangerous precedent. Definitely. Definitely. Now the final news story of the day Kev. Yeah you have it right there. Little interesting news for those that give a fuck about social media out there. Instagram releases self-improvement tool for the worst people you follow. Also you can call this headline an interesting tool is being out of Instagram that people are going to find. Very helpful. Essentially starting today they're rolling out a feature where you can have an album worth of pictures. So if we were to go to E3 and the Horizon thing for example instead of posting 10 million pictures over the course of a week of the same thing it can be 10 pictures of the same thing where you swipe left and right. So it's like you go to a brunch with your girls. And you're taking all the different pictures of your little eggs benny and your mimosas. We don't need every single angle to be taking up your feed for fucking. Right right",
      "start": 2579.84
    },
    {
      "text": "brunch with your girls. And you're taking all the different pictures of your little eggs benny and your mimosas. We don't need every single angle to be taking up your feed for fucking. Right right right. Like scroll on scroll. It's optional. I like that. That's good functionality for the brand. Would you believe that I went to brunch with my girls on Saturday? I appreciate that. I was the only man at that brunch. That's how you should do brunch. That's the right way to do brunch. It was a good brunch. 15 Romolo is just a really fantastic way. But that sounds nice to me. I've been reading a lot about Instagram and Facebook and Snapchat recently. Snapchat's going public soon. And what did you say? I said very soon for way too much. Yep. And that company is as fucked as the day is long. And I think everyone knows it. But the interesting thing about them is that I read this huge piece. You probably saw it because you're interested in this kind of stuff. I think it was in The New York",
      "start": 2627.6
    },
    {
      "text": "And I think everyone knows it. But the interesting thing about them is that I read this huge piece. You probably saw it because you're interested in this kind of stuff. I think it was in The New York Times about how they're hedging completely on hardware. That I think that what they realize is that Facebook and Instagram are going to ultimately eat their lunch on Snapchat's software functionality. And they already are trying to do that. And it's working apparently. Their growth was only after Instagram rolled out their complete carbon copy of Snapchat growth went from something like 16% quarter over quarter to % quarter over quarter. So they're putting all of their profits in a very Amazon-like way and building hardware which they build on those glasses. Snapchat's fucked. I don't care what anyone says. That company's fucked. There's no way that you can. Because I was reading. I was reading. Because I was reading. There was a bunch of anonymous I guess investors in there being",
      "start": 2670.08
    },
    {
      "text": "what anyone says. That company's fucked. There's no way that you can. Because I was reading. I was reading. Because I was reading. There was a bunch of anonymous I guess investors in there being like there's just this isn't going to work. This is pushing a huge boulder up a hill. They have an outside chance of success. But getting bogged down in hardware is considered not a smart move for a company like that. My thing is I think that Snapchat is the secret recipe behind the scenes. And they're just doing the right things in terms of partnering with content creators and making Snapchat a destination whether or not you know that you're using Snapchat the way that they're partnering with a bunch of people behind the scenes to make content on their own YouTube channels and stuff. I really think Snapchat they could go the way they don't know but I don't think they will. I think that they're going to keep on growing. Because they're making really smart decisions. And I think that",
      "start": 2708.4
    },
    {
      "text": "think Snapchat they could go the way they don't know but I don't think they will. I think that they're going to keep on growing. Because they're making really smart decisions. And I think that the spectacles and stuff that is a niche market thing that is just to create hype for the millennials out there. High schools around the world are dominated by Snapchat. No I understand that. But they're spending all of their product. They were saying they spent half of their gross revenue on hardware. Which means that it's like what Uber does. It's actually there are two major companies that have been doing this for a long time. Uber and Amazon have been intentionally losing money for different reasons. Amazon's whole thing was to basically invest over and over and over again trying to get you involved in things that will give them proprietary access over say your books which works with Kindle. But then they have things like their Fire Tablet or their phone that no one cared about. But",
      "start": 2752.56
    },
    {
      "text": "involved in things that will give them proprietary access over say your books which works with Kindle. But then they have things like their Fire Tablet or their phone that no one cared about. But they keep dumping money into it. And they have very patient investors. So they're able to do that. With Uber they're basically burning their money in such a way that they understand that eventually they have to remove the human element out of their investments. And that eventually when they run out of money the hope is that they have the car just pulling up with no one. And they have no one to pay. Then it's all going to be revenue-based or revenue-backed for them. Because the interesting thing about Uber this is getting really nerdy but I think 80% of the money goes to the drivers on a gross fare. So $0 $16 that would go to the driver. I think their whole idea is that they're taking a billion dollar hit per quarter by paying out more than they're worth understanding that once they",
      "start": 2791.52
    },
    {
      "text": "fare. So $0 $16 that would go to the driver. I think their whole idea is that they're taking a billion dollar hit per quarter by paying out more than they're worth understanding that once they remove the human element and have no one to pay the prices can stay the exact same. And suddenly they're not making $4 on $0. They're making $0 on $0. And suddenly they just make an enormous amount of money. I don't see the out for Snapchat. I just don't. And like but the last time a major social media company went public in such a way that it seemed dubious which was Facebook they went high went low and then popped back up. So I think Twitter was after that. They were but Twitter's fucked. Yeah that's the thing. Twitter went open super high went really high for a little while and then fucking now it's at $14. Like I really believe that Snapchat will go public and probably regret doing it. But they should have sold to a private equity firm when they had the chance. And they",
      "start": 2827.04
    },
    {
      "text": "then fucking now it's at $14. Like I really believe that Snapchat will go public and probably regret doing it. But they should have sold to a private equity firm when they had the chance. And they still have the chance. But the other interesting thing this is an interesting thing I think I talked to you about this. Sequoia Capital I think was a company which is a massive investor in these things saying that they will no longer invest in any companies I think it was Sequoia Capital saying they will no longer invest in any delivery services that have any people involved in them. In other words they say it's impossible for Postmates or Lyft or Uber or whatever to make any money until they remove the human element and will no longer be investing in those things. And I was reminded of that yesterday when I tried to buy Beep's Burgers for my house and they were trying to start to be $0 delivery fee for that one. Are you fucking kidding me? It's pretty far. But it was their surge",
      "start": 2874.32
    },
    {
      "text": "that yesterday when I tried to buy Beep's Burgers for my house and they were trying to start to be $0 delivery fee for that one. Are you fucking kidding me? It's pretty far. But it was their surge price. Usually it's $10 which I would have paid. Anyway all these companies are fucked. That's the thing. Uber's already figuring out the Uber Eats. Like if they don't have drivers and they can do the Uber Eats while they're Ubering someone you know? There's no cost in having someone go and deliver it. That was the final news story. Colin can you finish out the tips there? Sure. I sure can. I like not hosting. I like being at your beck and call Tim. I like it. It's kind of hot you know? Yeah. Eligible Cow 8 says Colin I've started listening to 311 recently and I'm hooked. You're welcome. I was wondering if there are any similar groups that you'd like to recommend. Keep up the great work. Also MVGA. That's Make Kinda Funny Great Again Kevin. He also says Bongos. Similar groups to 311. 311",
      "start": 2912.24
    },
    {
      "text": "I was wondering if there are any similar groups that you'd like to recommend. Keep up the great work. Also MVGA. That's Make Kinda Funny Great Again Kevin. He also says Bongos. Similar groups to 311. 311 is a pretty unique band. If you're into that rap rock sound then you can fall down to the 90s hole if you want. It's a good hole. Honestly I think that the closest comparison to them would be something like Linkin Park if you want that rap rock sound. The first two albums. Yeah Hybrid Theory and Meteora. They don't want to listen to anything else. But if you want more of the rock sound and that reggae sound you can go to Sublime or Red Hot Chili Peppers. Their DNA especially with Chili Peppers. Linkin Park released a new album this year. They just dropped their first single. The most poppy sounding thing they've done. It's interesting. All right honestly their last couple albums I've just popped in and just gave them a listen. I'm pretty impressed. I think that that's a band",
      "start": 2961.92
    },
    {
      "text": "poppy sounding thing they've done. It's interesting. All right honestly their last couple albums I've just popped in and just gave them a listen. I'm pretty impressed. I think that that's a band that has stayed relevant despite losing the popularity that they had. Yeah I think they still play pretty big venues. I mean they're the top of the game. They sell out arenas and they have so many hits. Over the years it's not just in the end anymore. It's like they have added and added and added. They've switched genres so many times. I'm impressed by them. I mean I've said before and I know it's against music pretension which is something Ramon and I talk about a lot because I feel like our tastes have become more pretentious as we've gotten older because we're like oh we're kind of ashamed of those things. But I was talking to them. It actually came up because we were talking about that first Papa Roach record Infest. And I was like the fact of the matter is that's a really",
      "start": 3004.72
    },
    {
      "text": "ashamed of those things. But I was talking to them. It actually came up because we were talking about that first Papa Roach record Infest. And I was like the fact of the matter is that's a really great record. I don't care what anyone thinks about that now but everyone had that album in 000. That album sold millions and millions of copies. And I hate how people kind of abandon things now. It's like not cool. Same thing I would say about Limp Bizkit. Everyone's listening to Limp Bizkit in 1998. Now suddenly everyone acts like no one listens. It's the same thing that happened to Creed right? Where everyone's like apparently no one listens to Creed. They somehow sold out arenas and all that and tens of millions of albums but no one listened to them. But I was saying Hybrid Theory specifically Linkin Park's Hybrid Theory is really pound for pound one of the great records of the modern era. Like I think it was so funny because they legitimized that genre at a time when that",
      "start": 3042.72
    },
    {
      "text": "specifically Linkin Park's Hybrid Theory is really pound for pound one of the great records of the modern era. Like I think it was so funny because they legitimized that genre at a time when that genre was dying. Like they were too late. They could have had a much greater effect on it if that album came out in like 1995. But nonetheless I remember getting that album in 000 and being blown away by it. I mean I think what they did was I mean we've talked about this many times but coming out with Reanimation that introduced me to underground hip hop. It was such a between that and Gorillaz self-titled album at the same time there was so much shared collaborators on both that I'm like these guys are fucking talented. And then from there I kind of like drifted off and went that direction. But shit's great man. Chad Warden says I can't take the Switch with me. How am I supposed to get some honeys with a Switch? Yo baby look at my Switch. You know what they say to me? They",
      "start": 3074.96
    },
    {
      "text": "But shit's great man. Chad Warden says I can't take the Switch with me. How am I supposed to get some honeys with a Switch? Yo baby look at my Switch. You know what they say to me? They fucking laugh. I get all the honeys with my PS4. It's cool. You know what? Don't ever watch this show again. Dan from Vancouver gave us a tip. Oh good old Dan. Says what does Bill Maher get wrong specifically? When will you go on Dave Rubin? Why didn't you vote for Evan McMullin? I thought his politics probably aligned with yours more than Gary Johnson. Well there's a lot of questions here. No comment on the Dave Rubin thing. Bill Maher gets a lot wrong. I don't know how much time you have. I love Bill Maher though. I'm seeing him live in May. It's going to be fun. Evan McMullin is a nut job. Thank you for your questions. Born Against says Sony always wins baby. The PS4 that shit is slick and black like my hair. You see my hair? You like that shit? It was blonde before the shit. I",
      "start": 3122.24
    },
    {
      "text": "Thank you for your questions. Born Against says Sony always wins baby. The PS4 that shit is slick and black like my hair. You see my hair? You like that shit? It was blonde before the shit. I dyed that shit because the PS4 is black. Sony the bomb baby. Is this the same guy? Nope. What the fuck? What are you guys drinking today? Well you can change your name. They both live in Flint, Michigan. It's a water joke Kevin. It's a joke about how the water in Flint, Michigan's all fucked up. No they must have fixed that by now. They haven't. They haven't fixed that by now. It is still fucked up. You see the chats blowing up about this NASA stuff? Yeah I think they found some planets or something. Yeah there it is. They found a bunch of planets. Well are they exoplanets obviously? Yeah. It's not like a Trojan or something like that right? They're Earth-sized planets in habitable zone and there's a bunch of them 40 light years away. 40 light years away. Those are the headlines",
      "start": 3170.88
    },
    {
      "text": "It's not like a Trojan or something like that right? They're Earth-sized planets in habitable zone and there's a bunch of them 40 light years away. 40 light years away. Those are the headlines that I've read. That's great. That's really attainable. Right there. Oh it's certainly right there. That's the planet that Horizon takes place on I heard. I told you Horizon took place on the moon. It's not a planet. It's a moon. Satellite. All right. Bentley454 says thank you for the Dirty Grandpa recommendation. I had no laughs by the end because I laughed so hard. Fuck him up Al. Told you guys. I'm telling you guys. Dirty Grandpa. Great movie. No more tips by the way. If you send me one more tip I'm going to lose my goddamn mind. Cody Butler says yo Colin when are we going to get some episodes of Washington's Beard? And he wants me to do a political podcast. I can't believe some of you still care about Washington's Beard. Show is really old. It's like over five years ago we were",
      "start": 3218.24
    },
    {
      "text": "episodes of Washington's Beard? And he wants me to do a political podcast. I can't believe some of you still care about Washington's Beard. Show is really old. It's like over five years ago we were doing that show. Slow your roll. Colin only has so many hours in a day. OK? Creo says top of the morning fellas. Hope you're having a great week. Here's a 30-second fun clip I like to risk my chat privileges on. May the odds ever be my favorite. Are you getting these links from the thing? Just closed a bunch of them. Because they're bad? Yeah one of them. Are you keeping in mind Who's Bad so we can ban them? No because if we don't watch them we don't ban it. If I watch them. Oh but we are playing the banning game right? Oh absolutely. OK great. Banning for life. I love that. And there's no banning here. We're all welcome. Love everybody. You guys are playing a dangerous game of acceptance. This isn't Soviet Russia. I know but you're creating this evil evil land where there's",
      "start": 3259.76
    },
    {
      "text": "no banning here. We're all welcome. Love everybody. You guys are playing a dangerous game of acceptance. This isn't Soviet Russia. I know but you're creating this evil evil land where there's no fun. You know? You got to risk it to get the biscuit call. No he's making it more fun. That's the argument I'm making though. He's making it more fun. Thank you Kevin. I agree with you Kevin. I think that's obvious. Now what's for lunch? What's more fun than a little totalitarianism? Right? I mean it's a little risky. Sure. But it's efficient. Let's get some clips Kev. Is this the one? What? No. His clips suck. Oh OK. I don't know who. Let's finish the tips and then we'll look at these things. Tommy Tin Can says hi Colin. I'm loving Colin's outfit today. His clip doesn't exist. Sorry. Sorry to interrupt. I mean that's bannable. The first trailer for GoldenEye Remake had a focus testing group and it was the one with Tim. So we were looking at this. This is the video we have.",
      "start": 3301.44
    },
    {
      "text": "Sorry to interrupt. I mean that's bannable. The first trailer for GoldenEye Remake had a focus testing group and it was the one with Tim. So we were looking at this. This is the video we have. Yeah I remember when this came out I was really excited about it because I was like oh shit. If you look closely. Am I going to be in it? I'm not in it. If you look closely. These were in LA. I was in SF. That's what I'm saying. Like look at this group of people. You don't know GoldenEye. Oh. That third guy definitely knew a little bit of GoldenEye. That gigantic watermark is bothering me. Which one? The first one or the second one? Well the second one's the red one's a facade. A whole channel icon. Yeah I mean yeah but when I was working there I was like we need to move the watermark so there's not two watermarks on top of each other. I remember as suddenly everyone started. I mean everyone was always mad about watermarking but everyone got really mad about watermarking",
      "start": 3353.04
    },
    {
      "text": "so there's not two watermarks on top of each other. I remember as suddenly everyone started. I mean everyone was always mad about watermarking but everyone got really mad about watermarking eventually. And a lot of people stopped doing it. I don't know why. I understand why people would do it. Negnog 8 says Colin what was your favorite place to smoke the crystal bassoon during your time in Northeastern? PS I hope you stopped by campus during your PAX East trip. Go Huskies well. White Hall. Willis Hall. All the halls. West Village. And everywhere else I live. True SB. Says Colin do you have any book recommendations similar to Horizons Caveman Futuristic Setting? No I think that's what's so unique about it that I've never heard of a story like this but I'm sure one exists. Nathan95045 says if PS4 launched with Uncharted 4 and nothing else would it be worth it? Thanks for all the good content. Hashtag Zelda Hype. Yes. Yeah I think so. It would have been a better launch. I",
      "start": 3395.76
    },
    {
      "text": "says if PS4 launched with Uncharted 4 and nothing else would it be worth it? Thanks for all the good content. Hashtag Zelda Hype. Yes. Yeah I think so. It would have been a better launch. I mean Uncharted's you know. It would have been a much better launch. It's on a different level than Zelda though. What? I said damn. The Nanobiologist says with RT's sale on onesies have you all considered selling one as well for maximum comfort once the retailer issue has been resolved? Onesies are in the talks. There's a lot of things that were new products we've been working on for 2017 but with all the issues we can't launch anything right now. Plain Jane Francis says birthday tax I turned 7 yesterday and to celebrate I released a mixtape called Send Nudes. Tim I think you'd like the cover which I shot. It's safe for work I promise. I'd like to see this. I'll show you. Thank you. Meanwhile GoID Personas says Colin was right keeps getting better with every episode. Keep up",
      "start": 3439.84
    },
    {
      "text": "cover which I shot. It's safe for work I promise. I'd like to see this. I'll show you. Thank you. Meanwhile GoID Personas says Colin was right keeps getting better with every episode. Keep up the awesome work Colin. Also can you get Kevin to do his creepy eye thing? I don't know what that means. I have a creepy eye thing? I think it's the shark eye thing. By the way Plain Jane Francis it doesn't matter if it's safe for work or not we own this business. This is the tool to get Kevin off the screen. Yeah that's it. This is so serendipitous Kevin. You're too good. Oh my God stop! It goes down so slowly. So this is the album cover. Wait wait I'm sorry we're not showing it yet. There it goes. Interesting. Looks like a woman eating a cake. Yeah. That has candles on the cake. Well I'll listen to the song later because I'm intrigued by the title. We can listen to it a little bit. I'm a big fan of the Send Nudes meme. I'm just a big fan of sending nudes. Anything about that.",
      "start": 3493.78
    },
    {
      "text": "I'll listen to the song later because I'm intrigued by the title. We can listen to it a little bit. I'm a big fan of the Send Nudes meme. I'm just a big fan of sending nudes. Anything about that. But the meme is really cool too. It is. Yeah. It is. Have you seen this? Do you know what we're talking about? Just like Send Nudes being hidden in a bunch of messages. Oh no. Like subliminal messaging to people. Someone eating like Cheetos and then they drop the bag of Cheetos and on the ground the Cheetos are already set out to say Send Nudes. And like the camera pans from the drop Cheetos to those. And it's like oh that's so good. I didn't see it. I'm not a young man anymore. Let's see. Connotative gave us a tip but said nothing. Mr. Manager 08036 Colin I had a dream that the next Love and Sex stuff featured a tasteful menage a trois between you Dana Perino and Candace Cameron Bure. Sounds fucking hot. Nick provided voiceovers for all three of you and Tim did commentary. I like",
      "start": 3549.94
    },
    {
      "text": "and Sex stuff featured a tasteful menage a trois between you Dana Perino and Candace Cameron Bure. Sounds fucking hot. Nick provided voiceovers for all three of you and Tim did commentary. I like it. I like it. Let's make it happen. Mario Not Bros says oh hello there guys. Good to see you today. Good to not be banned. The next couple of weeks are in stain. Horizon Patreon Hangouts Logan Switch Ed Sheeran's new album. Can't wait for it all. We banned him? I thought he was banned. Yeah. That's it. You read my mind. No. Way too much excitement. You know what to do Kevin. Thank you. Take care of that for me. Sorry we are with the little face with the i0's and those. Colin since I know you like a bit of intellectual news on the show did you see the NASA news? Tim Google X on the Beach. It's similar to the show you pitched. Also you forgot Games with Gold news. X on the Beach. Interesting. Interesting. Train Wreck says did you notice how Jeopardy! adds French words in",
      "start": 3589.86
    },
    {
      "text": "the Beach. It's similar to the show you pitched. Also you forgot Games with Gold news. X on the Beach. Interesting. Interesting. Train Wreck says did you notice how Jeopardy! adds French words in question so Alex can remind you he's French Canadian? Then he corrects the contestants when they say words wrong. He can lick my balls. I like that we now have beef with Alex Trebek. Are we going to add him to the list like Nick's list? Who does he have beef with? Gollum? Yeah. What's his name? Something. Andy Serkis. That's it. We only have a few more tips. We also have beef with Central Time. Yeah Central Time. All Central Time. Whoa Colin. We're a team OK? OK. J-Po says Happy anniversary to all the OG VNOS out there. It is true. That is the 22nd. It is the fifth anniversary. Didn't quite frame the V-Day. Two more. Wanch says Hey guys there seems to be a bit of an exodus in the games media in San Francisco. Where people are breaking off and doing their own thing. Drew Scanlon is the",
      "start": 3632.74
    },
    {
      "text": "frame the V-Day. Two more. Wanch says Hey guys there seems to be a bit of an exodus in the games media in San Francisco. Where people are breaking off and doing their own thing. Drew Scanlon is the newest one. What's he doing? He didn't say he's going off on his own. He says is this a symptom of San Francisco's pricey cost? Maybe. I think it has more in line with the fact that traditional games media is dying and people are going off to do their own things. And I think that's great. So the next evolution. One day what we do will be dead too. That's the way it goes. We'll be doing something different. Yep. I'll be on the up and up. Do you think it'll involve lightsabers? No. It'll probably involve six seconds. Do you think it'll invite involve this? Potentially. Look at this. Roll the clip. Oh I'm excited for this. There he goes. Yes. Look how scared he looks. Tested in Moscow. That's a little disappointing. Yeah. Yeah. Well. Oh my God. The FCC's all got all these restrictions.",
      "start": 3681.94
    },
    {
      "text": "clip. Oh I'm excited for this. There he goes. Yes. Look how scared he looks. Tested in Moscow. That's a little disappointing. Yeah. Yeah. Well. Oh my God. The FCC's all got all these restrictions. This is pretty cool. This guy's got some balls driving that inside. Oh you don't want wind touching this. Yeah but he almost took his head off on one of those beams. What? I think the beams were really hot. No watch that video again if you don't believe me. Obi-Wan Kenobi has the final one. It says hey guys recently started watching Neon Genesis Evangelion. And I'm really enjoying it. What are your thoughts on the series? Fantastic. I'm going to have to watch it forever. Yeah we'll see when it actually ends. All right. That's it for the tips. I think that beam. Kevin Tim that's it for the tips. I don't have any more time for the tips. Done with the tips. We're done with the tips. I'm going to do a little giveaway action right here. Are we not doing the Alex Trebek? No. Really? Can I",
      "start": 3720.34
    },
    {
      "text": "the tips. I don't have any more time for the tips. Done with the tips. We're done with the tips. I'm going to do a little giveaway action right here. Are we not doing the Alex Trebek? No. Really? Can I borrow your plug? Yes. Yes you can. Thank you. There you go. Oh sorry. You want to put it behind you? Hold on a sec. No it's just... The giveaway every day. You have four different ways you can win a video game digitally sent to you. One being in the Twitch chat like you all are right now. Two subscribing to Twitch. Which is pretty easy to do especially if you have an Amazon Prime account where you can sign up for free once a month through a different channel including ours. Third way go to Patreon.com/KindaFunny and at the $ above level you're automatically entered for giveaways. Or four go to Patreon.com/KindaFunnyGames and do the same thing. Four chances to win Colin. How exciting is that? I mean it's exciting. It's four times more than you deserve. Yes",
      "start": 3771.54
    },
    {
      "text": "Or four go to Patreon.com/KindaFunnyGames and do the same thing. Four chances to win Colin. How exciting is that? I mean it's exciting. It's four times more than you deserve. Yes it's true. It's true. Today we're giving away TowerFall Ascension on the Xbox One. Hello! Wait is it too early? No no no no. Well a little bit. But the winner is from Patreon.com/KindaFunny and his name is Mateus Nelson. Congratulations Mateus Nelson. You have won TowerFall Ascension on the Xbox One. Fantastic game. Lots of fun. It is a fantastic game. Yeah. I'm not going to disagree with you and say that you're a liar about that. Yes a liar I am not. Going to read some things in the chat for a bit. We'll do the old three and three as they say. Three and normal. Yeah three and three. It comes from the two and two. Yeah. You know Chuck Woolery for all of you old people out there. There's some old people out there. One thing in the chat here is a Polygon article. The fate of the",
      "start": 3819.38
    },
    {
      "text": "It comes from the two and two. Yeah. You know Chuck Woolery for all of you old people out there. There's some old people out there. One thing in the chat here is a Polygon article. The Fate of the Furious is reportedly 160 minutes long. Two hours and that's almost three hours of Vin Diesel. Fuck yes. Like Gods and Generals. Oh my God I love it. But good. Oh I love it. Gods and Generals is rough. This is going to be great. It's a rough one. I had to go see every history movie at some point in my life. Star Wars: Rogue One, a Star Wars Story was only two hours and 13 minutes. That's really sad. It's fucking excessive. Oh I love it though. I'm sure you do. I do so much. They're adding so many characters in this one. We're going to get introduced to Helen Mirren the mother of the bad guys from the last two movies. How fucking perfect is that? I haven't seen a Fast and the Furious movie since the second or third one I think. I think it was the last one. The one that took place in",
      "start": 3872.5
    },
    {
      "text": "guys from the last two movies. How fucking perfect is that? I haven't seen a Fast and the Furious movie since the second or third one I think. I think it was the last one. The one that took place in Japan. Was there one in Japan? Tokyo Drift. Yeah. Yeah that's the one. I saw that one. A lot of people say it's the best one. So good for you. Really? Yeah. No. It's my favorite. No Six is the best one. Six? Six isn't the best one. We're not getting into this. It was pretty good. You know what? No Seven was the best one. NextTeamCrash says Tim if Crash Bandicoot comes to Xbox do you think it'll feel like blasphemy? Hashtag SaveTheBandicootFromXbox. No man. I'm all about spreading the love. Like this is one of those few times where it's like it being exclusive is not going to help the game. It being non-exclusive is going to help the franchise. So I'm all about it man. Share the love. Let's get the bandicoot where he",
      "start": 3916.74
    },
    {
      "text": "where it's like it being exclusive is not going to help the game. It being non-exclusive is going to help the franchise. So I'm all about it man. Share the love. Let's get the bandicoot where he needs to be. Back. MiddleOfOn says Colin. Thoughts on Sam Harris. Also Neil deGrasse Tyson just did an episode of Joe Rogan's podcast and I highly recommend you listen to it. Absolutely fascinating. Sam Harris. Oh I've heard of this guy. I don't know anything about him. Sorry. No thoughts on Sam Harris. RabbononStrikes says are you guys concerned about there not being any news on the Switch Virtual Console? I'm not concerned. I was concerned when they didn't talk about it at the conference but now that they haven't talked about it it's pretty obvious they're just not going to talk about it until they have something to say. Like it's just like oh my God this is a soft launch. It's coming out. It's so ridiculous. It's going to be what it is. It's going to hate. I got mine. We're going to",
      "start": 3958.1
    },
    {
      "text": "until they have something to say. Like it's just like oh my God this is a soft launch. It's coming out. It's so ridiculous. It's going to be what it is. It's going to hate. I got mine. We're going to have a lot of fun. Call me a hater but world. But I bought one so I can play that fucking Zelda game. Hell yeah. Better be good. Hell yeah. Better be good. I'm real concerned that personally Zelda and Horizon are going to injure each other because I didn't get what I wanted out of Horizon because I wanted it to be Zelda. And I have a feeling of playing Zelda. I'm going to be like this ain't Horizon. I'm about to blow your guys' minds. Ready for this one? It's a decent chance Horizon sells more copies than Zelda. I wouldn't be surprised. The Horizon. So Greg made fun of me or not that he made fun of me but disagreed with me on PS I Love You where I was like Horizon will sell somewhere between like 6 and 10 million units I think I said. And lo and behold SuperData Research says that",
      "start": 3999.7
    },
    {
      "text": "fun of me but disagreed with me on PS I Love You where I was like Horizon will sell somewhere between like 6 and 10 million units I think I said. And lo and behold SuperData Research says that it's probably good for about 8 million sold. I don't know that Zelda can reach that simply because just because. million max on Switch plus Wii U but so many of that audience are going to transfer over to Switch anyways. Yeah. I mean you're right. I think that's. Which is kind of I mean it's worth keeping in context that Zelda never really sells that one. The last Zelda that sold actually extraordinarily well was 19 years ago. It was Ocarina of Time. And actually Majora's Mask sold pretty well too. But like Twilight Princess did fine. That's in like the 8 million region I think. But actually Skyward Sword I think got outsold by Uncharted 3 like to 1. So it's not like a huge surprise there. I think it's just the proliferation of like you said no Switches. I think some people are",
      "start": 4048.58
    },
    {
      "text": "Skyward Sword I think got outsold by Uncharted 3 like to 1. So it's not like a huge surprise there. I think it's just the proliferation of like you said no Switches. I think some people are kind of waning on Wii U. And so if the numbers with Horizon hold Horizon deserves sales like that. Horizon is going to be the next big thing for Sony. So it's we'll see how that all shakes out. The good news is that they're both like we know Horizon's great. My assumption is that Zelda's going to be awesome. So I can't imagine it not being awesome. But I mean just looking at it though I mean Horizon is fucking breathtaking. It is such a technical accomplishment where and then you look at Zelda and I'm like why aren't you this? Just visually. Like oh my god. I mean that's why I said it and people still bring it up. I'm like when I played it at E3 I'm like I mean I'm like this is obviously going to be fun. You know Zelda's Zelda and we enjoy that. But it certainly looks dated.",
      "start": 4086.5
    },
    {
      "text": "and people still bring it up. I'm like when I played it at E3 I'm like I mean I'm like this is obviously going to be fun. You know Zelda's Zelda and we enjoy that. But it certainly looks dated. It does. I like the art style. I like the concept art of it right? But yeah looking at it I'm like it feels kind of empty. And I'm not against that necessarily. Even Zelda 1 was empty but that didn't take away from it. Yeah that was an NES game but it's also kind of the charm of what Zelda is. Like you don't need to have hella people around. But Horizon man that shit looks fucking great. I'm telling you guys and for those that don't listen to PS I Love You. We did a games cast which I think will go up tomorrow-ish. We talked a little bit about your thoughts with Horizon. Just want to reiterate that game is fucking fantastic. Like I really really think that that game is extraordinarily good. I think people are really going to like it a lot. I mean the reviews say. Very",
      "start": 4127.62
    },
    {
      "text": "want to reiterate that game is fucking fantastic. Like I really really think that that game is extraordinarily good. I think people are really going to like it a lot. I mean the reviews say. Very excited. The same. Very excited for people to play it. And likewise I assume I don't know when the Zelda embargo is. You know we have it but I'm waiting for I'll just get it. I'm really trying to save it for when we go to Boston. My assumption my Metacritic prediction of Zelda 86. That's my Metacritic prediction. So here's the thing. So speaking of Metacritic luker815 says Hey Colin and Tim Horizon's sitting at an 88 right now on Metacritic. Do you think it will go up or down after lunch? Down it can only go down. That's the problem is like once you get those main outlets like everything else is just- It's people have to understand that there's a that Metacritic is weighted. Like IGN and GameSpot and a few others are weighted way more than another group of others are",
      "start": 4170.1
    },
    {
      "text": "everything else is just- It's people have to understand that there's a that Metacritic is weighted. Like IGN and GameSpot and a few others are weighted way more than another group of others are weighted way more. Those guys always get their shit out early. So even if and I know this only because I was a critic. So I looked at Metacritic and I was interested in it after everything went up. To see where my score kind of settled compared to everyone else's maybe a week afterwards. Metacritic scores never go up. Yeah so I'd be shocked. I do feel like it deserves more than an 88. 88's high but this game I feel deserves at least a 9 on that or a 90 on that scale. Zelda I don't know Zelda's hard with Metacritic because there's so much baggage that goes into reviewing a Zelda game I think in both ways. Where I think that regardless of even playing it I think people are going to give it 10s and I think people are going to give it 7s. Just because of what they're bringing into the",
      "start": 4208.82
    },
    {
      "text": "in both ways. Where I think that regardless of even playing it I think people are going to give it 10s and I think people are going to give it 7s. Just because of what they're bringing into the table on it. Yeah I wonder if the expectations are going to help or hurt it this time around because the game was in development for so long. It's also a response I think design-wise to western role-playing games. So I think now you're going to be able to now you have to compare it to these games. And I don't know that Zelda can stand toe-to-toe with The Witcher 3 and stand toe-to-toe with Horizon. I just don't know that it's possible. But we'll see. We've got to judge it based on it's going to have its own unique charm. There's no doubt about it. My thing is I'm really hoping that there are dungeons in some type of traditional sense or that the new shrines or whatever do have that magic that Zelda dungeons have. Because that is the thing that I thought Horizon lacked was real moments",
      "start": 4250.02
    },
    {
      "text": "dungeons in some type of traditional sense or that the new shrines or whatever do have that magic that Zelda dungeons have. Because that is the thing that I thought Horizon lacked was real moments where I feel accomplished. And it feels more like I'm going through the story. Yeah I agree. But again that's why I think that both games are going to negatively affect my time with both of them. I wish that they were separated a bit more. I think it would have been nice if Zelda came out and then Horizon in the fall or vice versa. But here we are. RealRadic13 says Colin what are your thoughts on the All-Star NBA players believing that the Earth is flat? Do you think it will start a dangerous new trend of people believing something that isn't true? No I don't think people really believe that. So this is an old argument too the Earth is flat thing. Some rapper or something a while ago was having some sort of Twitter conflict with Neil deGrasse Tyson or something about it. No one",
      "start": 4283.94
    },
    {
      "text": "that. So this is an old argument too the Earth is flat thing. Some rapper or something a while ago was having some sort of Twitter conflict with Neil deGrasse Tyson or something about it. No one believes that. But Colin it's observable in the natural world. You don't need to have pictures from space or the Earth. The ancients knew the Earth was a glow. The universe is flat Colin. Well a plane of the universe is flat. But when you put all the planes together it's not. The whole universe is flat. No. This is come on Colin. All right let's get into Sub-Owen Chop. Like 3 000 years ago the ancients knew that the world was a globe. No one believed and like one of the great and I'm sure a lot of you know this but one of the great myths of even the age of exploration is like Columbus and his people thought they were going to fall off the edge of the Earth. No they didn't. They saw that things fell off the horizon. They went past the horizon and the only fucking explanation was",
      "start": 4327.94
    },
    {
      "text": "and his people thought they were going to fall off the edge of the Earth. No they didn't. They saw that things fell off the horizon. They went past the horizon and the only fucking explanation was that the Earth was round. They weren't dumb. Anyway. RabbononStrikes strikes back and says following my last question when do you think the Switch Virtual Console will arrive and what games do you expect to see first? I don't even care anymore. I'm interested in this because I doubt that there'll be Virtual Console the day it launches and I think that that's why people are so oh how have we heard about it? It's not going to be there. I think there'll be a direct at some point and they're going to be like here's the games and that's going to be the game changer of what happens because that could be like GameCube games are coming. You're getting the rumored Melee and Luigi's Mansion and Mario Sunshine and all that stuff and it's like that's when the Switch starts getting really",
      "start": 4368.42
    },
    {
      "text": "that could be like GameCube games are coming. You're getting the rumored Melee and Luigi's Mansion and Mario Sunshine and all that stuff and it's like that's when the Switch starts getting really fucking awesome and I feel like that is the all the issues that I have with the Switch conference and stuff can be answered pretty easily. They just need to answer them and they just need to answer them quickly because if they do the shit where it's like here's Mario Bros. 1 three months later here's Mario Bros. 3 five months later oh here's two. It's like no guys we've done this for 15 years now. I mean here's the thing everyone has to prepare themselves for and this is just the reality of the situation. Prepare yourselves to not play the Switch very much. That's not true. Just letting you all know if you want to play Disgaea 5 which came to PS4 like three years ago or I don't know like some game with a silly name from Square Enix. That looks pretty good. That game looks",
      "start": 4407.94
    },
    {
      "text": "you all know if you want to play Disgaea 5 which came to PS4 like three years ago or I don't know like some game with a silly name from Square Enix. That looks pretty good. That game looks fucking fantastic. That will definitely not only be on the Switch. So don't know if Square Enix will make those mistakes again. Yeah. I'm really down on the Switch's prospects. Like I just don't I don't know how anyone I'm not saying there's not gonna be good games. I'm buying one. I want to play Zelda. I want to play Mario and etc. So I love the Virtual Console. It's gonna replace the Vita if you let it. Nothing can replace the Vita. But I'm really down on its prospects. I just don't see how anyone can possibly be really that excited about this thing. Like I think I just don't get how anyone can possibly be that excited about the Switch. Just don't understand. It's not for me. But for some reason I'm still buying one. Shit. Fuck that was a good one. All right. Jose M.E. 9 says any tips",
      "start": 4450.42
    },
    {
      "text": "possibly be that excited about the Switch. Just don't understand. It's not for me. But for some reason I'm still buying one. Shit. Fuck that was a good one. All right. Jose M.E. 9 says any tips going to a general admission concert? Participate in mosh pits or no? Just wondering because I'm gonna see Metallica soon. Oh that'll be a great show. When I was younger I used to get kind of crazy with it. Ramon was really crazy. Mosh pits can be scary. So prepare yourself. You know you're gonna get bruised at some point. But my thing is if you really care about the music I'm all about the getting the experience. Get fucking in there. The people standing in the back trying to be cool you're not gonna have as good of a time as the people that are in the action freaking feeling it standing there for seven hours jammed up against people sweating and shit. It's like the moments of discomfort when you think back to that concert in years later you're not gonna think about how hot and sweaty",
      "start": 4489.22
    },
    {
      "text": "for seven hours jammed up against people sweating and shit. It's like the moments of discomfort when you think back to that concert in years later you're not gonna think about how hot and sweaty you are. You're gonna think of how fucking awesome it was. Yeah moshings and all that kind of stuff. Just being on the floor. I'm too old for the collision of it all anymore. But I love that. I mean Ramon used to be a stage diver. I used to really get up there and do his thing. It's fun. I mean being young and brash at concerts is one of the fun things. I love going to live shows. Enjoy yourself. Metallica that's gonna be great. Let's see. ZMD113 says concerts are the worst. What? Are you nuts? Going to a live show with a band you love that's great live is like some of the best things you can possibly do. It really is. One of the best things in the entire fucking world. And finally Fanatic Gamer 1986 says any thoughts on the Kinda Funny Morning Show being number two on iTunes would link",
      "start": 4536.98
    },
    {
      "text": "do. It really is. One of the best things in the entire fucking world. And finally Fanatic Gamer 1986 says any thoughts on the Kinda Funny Morning Show being number two on iTunes would link to this iTunes chart that for games and hobbies were right behind Car Talk which is really I don't fucking understand how these charts work. They're bullshit. Like I think that we're only there because we release things daily and that these charts are an at the moment thing. So we're just consistently there. So yeah I'm not surprised that the morning show is there because PS I Love You released yesterday so it's there. Otherwise Gamescast when it comes out it's there. It's like the only thing that's interesting about this and I mean we've been very self very demeaning to ourselves about this is that Car Talk hasn't even had a new episode in years and it still just dominates. Like one of the guys is dead. You know like Car Talk fucking rules. If you guys have listened to one show don't let it",
      "start": 4584.18
    },
    {
      "text": "Car Talk hasn't even had a new episode in years and it still just dominates. Like one of the guys is dead. You know like Car Talk fucking rules. If you guys have listened to one show don't let it be this one. Let it be Car Talk because it's way better. I don't even own a car. I don't drive a car. I don't know anything about cars. I used to love that show. Those guys are so fucking funny. They don't even try to be funny. They just know how to do it. You understand what I'm saying? They just know how to be. I know what you're saying. All right Colin. All right. We're done for the day. All right. Let me make sure. Should I read the? Read the subs and resubs and all that shit. All right. If I read your name you're a new sub or resub here on Twitch.tv/KindaFunnyGames. We appreciate you very much. Let's see. Let's see. Let's see. Cody Butler. Captain Tutu says eight long hard and girthy months with you beautiful men. Keep up the great work. Digital Main says Kevin please wear the",
      "start": 4625.62
    },
    {
      "text": "very much. Let's see. Let's see. Let's see. Cody Butler. Captain Tutu says eight long hard and girthy months with you beautiful men. Keep up the great work. Digital Main says Kevin please wear the red hat for one moment. No. Born Again says Sony always wins baby. The PS4 that shit is slick and black. I mean oh no that's that's that's the tip. I'm sorry I read that. I read that tip. Fucking bang for your buck today. Born Again. Born Again. Chick Z11. The Timid Terrapin. Terrapins are turtles. Go team. Big Maccagas. Does loving all you boys do keep fucking that chicken? Hail Colin. ShortFuse06. Zzoo79. ArrowZ. Mac Eufuron. Gold Persona. Hayden Likes Gold. Goodie Will. NinjaKraken. Mal James Jr. Holy Cow It's Chris. Digital Samson says Kinda. Funny. Plain Jane Francis says five months. Hashtag Plain Jane Francis. Hashtag send nudes. Yes. Shake Pre-Man. Big Bad Beluga says I've spent two years with you beautiful dudes and here's to many more. Also can you guys move the day Kinda Funny Live",
      "start": 4663.54
    },
    {
      "text": "Plain Jane Francis. Hashtag send nudes. Yes. Shake Pre-Man. Big Bad Beluga says I've spent two years with you beautiful dudes and here's to many more. Also can you guys move the day Kinda Funny Live three tickets go on live so my wallet doesn't die on March 1st please and thanks. XOXO nope we can't do that I hope your wallet does die because it's worth it. Willie Watt. Tyson Rhinos says 11 months now still wondering what I'm doing with my life you and me both. Tiberius the Cat. Sticky 11. Celeborn 1987. Citygov. Radar Ruckus says take this Amazon monies. D-pad 4 0. Rocky TT_. Sephron. J Samper 10. Ricane 503. No Cheese Please. Coup Patrol. Slow Steel 86. Nick the Mage. Leg I guess? Bang Zoom Straight to the Moon. Scott Tremper says great show as usual. PS Colin did you see 311's crowdfunding campaign for the next album launch day? I did see that. Fuck that. D Finney these guys are millionaires by the way. They don't need a crowd for anything. Who cares? And they should",
      "start": 4722.74
    },
    {
      "text": "311's crowdfunding campaign for the next album launch day? I did see that. Fuck that. D Finney these guys are millionaires by the way. They don't need a crowd for anything. Who cares? And they should stop making records because it's diluting their live shows. I don't want to hear anything that was even fucking made since 2003. And now they keep releasing these records and now when I go see them this summer they're gonna have to play five songs off that record which means it's gonna bounce five good songs off the fucking thing nonetheless. Micah Manier. Slim Shady 96 says jumping back on that Twitch Prime subscription sorry for letting it lapse guys will never happen again will Lola stop chasing me now. Thank you. No. The Ice 7 says sorry for the promo Colin you should be. Why Skitch? Met it in 89. For Tony Blazit. Adam Blaine says Colin Taking Back Sunday are Brand New are you aware of the beef between the bands and how their albums respond to each other cheers guys. I'm from Long",
      "start": 4772.9
    },
    {
      "text": "it in 89. For Tony Blazit. Adam Blaine says Colin Taking Back Sunday are Brand New are you aware of the beef between the bands and how their albums respond to each other cheers guys. I'm from Long Island of course I'm aware. Brand New is my choice. Anf 001 says five months my dude my dude's been there since the Beyond days and I'm glad I could sport Kinda Funny Games. Love and peace in Bongos. Straight Loken says woot. Havoc 45 the Hylian legend. Shtrimp? Shtrimp? I don't know 83 says thank you for this amazing show. I hope you guys write off all your work lunches each day. Justified says pronounced Justified. Mikey 16 Baomong 68 and Average Josh. That is it. Average Josh. He's the guy with the Doug avatar. Yep that's all there is. That's it. Until tomorrow. We'll see you later. Adios cut the feed.",
      "start": 4808.42
    }
  ]
}
