{
    "id": 2361,
    "video_id": "ScDNgV_tlXY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Greg's Favorite New Mobile Game and Tales of Berseria Review - Kinda Funny Gamescast Ep. 105 (Pt. 3)",
    "description": "Greg talks about a super cool mobile game, and Colin reviews Tales of Berseria.\n\nThanks to Shari's Berries for sponsoring this episode. Go to http://www.berries.com with the promo code Gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1485954001,
    "duration": 995,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by Shari's Berries. There's no one quite like your Valentine this year. Treat them to an unforgettable gift that's as unique as they are. Don't tell her, but I'm definitely getting Gia some of these babies. Shari's Berries will deliver your gift fresh and on time, guaranteed, or your money back. These berries are decadent, fresh, juicy, and sweet, and most importantly, sharable. And you can choose to get them dipped in white, milk, or dark choccy goodness. With Valentine's Day right around the corner, there's only one way to get freshly dipped strawberries from Shari's Berries. Starting at $19.99, you visit berries.com. That's B E R R I E S.com. Click on the microphone in the top right-hand corner and type in Gamescast. That's berries.com using the code Gamescast. Help support our show and get some sweet, sweet berries for your sweet, sweet lover, lover. Next topic, Greg. Yeah, last week you brought up a mobile game. I did. That you were like, Tim, you got, you got",
            "start": 0.08
        },
        {
            "text": "support our show and get some sweet, sweet berries for your sweet, sweet lover, lover. Next topic, Greg. Yeah, last week you brought up a mobile game. I did. That you were like, Tim, you got, you got to play this thing. Yeah, I got an A Normal Lost Phone. Had picked it up, got my code just before we started the Gamescast and started in, and within two seconds I knew this is a game you'd like. Uh, because you and me loved Emily is Away and and like we like narrative adventures and this is a narrative mystery told through your phone, which talking to a developer friend the other week at brunch, I guess is a very popular thing on mobile phones, but we don't play mobile games, so I would never know that. Um, yeah, what do you want to know about it? It's great. I don't want to ruin the mystery for you. What's it called? A A Normal Lost Phone. A Normal Lost Phone. It's like a who's on first thing. Yeah, but what's the game? Well, sorry, it's called A Normal Lost Phone game, A Normal Lost Phone. A Normal Lost Phone. Okay, yeah, out it's",
            "start": 42.08
        },
        {
            "text": "called A Normal Lost Phone. A Normal Lost Phone. It's like a who's on first thing. Yeah, but what's the game? Well, sorry, it's called A Normal Lost Phone game, A Normal Lost Phone. A Normal Lost Phone. Okay, yeah, out it's what? Out the sixth? iOS, Android, PC. Don't need to play it on a phone. Okay. However, I highly recommend it playing that phone. So when you when you play, so give me the pitch of the game. The pitch of the game is you, the player, have picked up a phone, which is not your phone, but you pick up a phone and you need to figure out what the hell's going on 'cause you pick it up and you're out of minutes, so you can't call or text anybody back. Like you're It's a prepaid kind of phone like that. And you you see Wi-Fi, but you don't know the passwords for them, so you can access anything offline on the phone. And then you have to start piecing together what happened because this phone's just out there. And the first thing you do when you open it is it's like, you know, there's four new messages from Dad and you click",
            "start": 98.52
        },
        {
            "text": "you have to start piecing together what happened because this phone's just out there. And the first thing you do when you open it is it's like, you know, there's four new messages from Dad and you click okay. And the last four messages are like, where'd you go? Say, hey, we're really worried. We're going to call the police. What's going on? And like, you need to like, so like, you know, you pick it up and there's a sense of something's gone wrong. Sam is in danger or missing or hurt or has run away. We need to piece together what's going on to try to solve it. So it's not that you're just snooping to snoop, you're snooping to try. That is there any nudes? Can you find nudes? I texted you the one thing there. Sam is, you know, in high school. Mhm. I believe he turns 18 in this game, maybe. I think they right. I should have written that down probably. But 18, he's an adult. Things are happening in his in his messages. All right. You don't go digging for it, but you got to do it because you got to figure out what's going",
            "start": 139.52
        },
        {
            "text": "have written that down probably. But 18, he's an adult. Things are happening in his in his messages. All right. You don't go digging for it, but you got to do it because you got to figure out what's going on. He's got his girlfriend. But and that but that's the whole thing of like, there's all these tantalizing threads. I feel so you start off and the first thread is like, oh, ****, this guy's missing. What the hell's going on? You know, what's going on in his life, which makes you then dial back, you know, to at least for me, dial back to the top of the messages with his Dad and then read all the way through. And like, it's just Dad being Dad, doing Dad jokes, whatever, talking to him about this, talking about this, his birthday party, talking about the girlfriend, talking about this, blah, blah. And then you like notice like he's being dodgy about the girlfriend. Like, what's going on? Okay, cool. Then you jump over to the girlfriend's text messages. Do the same thing. Start down. You get the thing I sent you. Yeah. And",
            "start": 179.0
        },
        {
            "text": "like he's being dodgy about the girlfriend. Like, what's going on? Okay, cool. Then you jump over to the girlfriend's text messages. Do the same thing. Start down. You get the thing I sent you. Yeah. And but then but then like, oh, ****, this didn't go the way. And you do that and you, you know, the text messages mentioned multiple people. So you're jumping back into other texts. And the way they did it, I thought was inventive, was it's the idea that the phone's newish. The the game's taking place in January, right? The end of January. But like, he got the new phone in December. So he sent out like a mass message of like, hey, my new this is my new number, everybody. So people have responded back. And like, there's tons of throwaway text messages like, oh, hey, cool, thanks so much, blah, blah, bullshitting around that don't have anything to do with story. But it's you having to sift through them. But as you follow the narrative from Dad mentions girlfriend, girlfriend mentions this, and you start trying to piece it all",
            "start": 214.96
        },
        {
            "text": "have anything to do with story. But it's you having to sift through them. But as you follow the narrative from Dad mentions girlfriend, girlfriend mentions this, and you start trying to piece it all together and tie it in. It's like, oh, okay, cool. I'm getting a sense for this. And then it becomes like, from these messages, how do I figure out how to get onto the Wi-Fi? And then I get on the Wi-Fi. Okay, cool. He's got half this email that's like half done. What happens if I send? And like, you start making all these little choices and little decisions that are then, okay, cool. He's got a dating profile. It's password protected. What's his password? You know, you started trying to figure out what the password would be, doing all these different things. Yeah. And it's and like what I when I knew it was I thought really well was like, or I knew it was really good is that we were playing it on Friday. I was playing on Friday here. Uh, went home. Home wasn't feeling that well. I was playing something on the console. I was",
            "start": 252.96
        },
        {
            "text": "well was like, or I knew it was really good is that we were playing it on Friday. I was playing on Friday here. Uh, went home. Home wasn't feeling that well. I was playing something on the console. I was like, I'm going to go get ramen. I'm I'm going to I'm feeling sick. I'm going to go do that. And went there to the ramen shop by myself and sat there and just was on on my phone the entire time. But it wasn't my phone. You know what I And it was that thing of like, I'm scrolling through his text message like, oh, that's that's probably the passcode to this. And I would hit my home button and jump back to my apps. I'm like, no, ****, God damn it. I'm interface. It looks like a a phone interface. Sure. Entirely. Yeah, yeah. No, no. Yeah, yeah. Here, I'll show it to you right now. You and that's the whole thing. And I I personally had never they're called I guess phone simulators or whatever. I've never played one of those before. You know what I mean? And so I guess they are popular. But yeah, like you're now in Sam's phone.",
            "start": 292.6
        },
        {
            "text": "had never they're called I guess phone simulators or whatever. I've never played one of those before. You know what I mean? And so I guess they are popular. But yeah, like you're now in Sam's phone. Interesting. So you can click on any of those apps and then click the little diamond button to go back to the home screen on Sam's phone and figure it all out and piece it all together. Oh, this is really cool. But there's photos, you know, a calendar. Like you get to play this and and it's, you know, not hard. You know, it's meant to keep the narrative going. Yeah, yeah. There's soundtrack on there. Uh, and have you beat it yet? Yeah. And that's the thing. It's not super long. Yeah. Emily is Away, about an hour experience, I would say. Is this similar to that? It's hard to say 'cause I broke it up. You know what I mean? I would imagine, yeah, probably maybe a little bit more. Maybe I mean, Emily is Away, I think our let's play was like 45 minutes, right? And I think even there we could have made different choices to have a",
            "start": 327.0
        },
        {
            "text": "I would imagine, yeah, probably maybe a little bit more. Maybe I mean, Emily is Away, I think our let's play was like 45 minutes, right? And I think even there we could have made different choices to have a different ending. Whereas like this one doesn't. Now the flip side is that this, I think it's $3. You know what I mean? Like, you're not I think Emily is Away was more. Maybe it was pays whatever you want it to be. But I think it was, yeah, I think it was a free game. It's one of those things where this is for I don't feel I enjoyed the experience. I enjoyed the ride. I felt smart when I figured out things. You know what I mean? When I worth $3. Oh, yeah, 100%. Yeah. And that and I thought and it was it was a fun adventure. It was a fun story. I think based on what you know now, if that sounds interesting, go get it. Don't read into it. Don't, you know what I mean? 'Cause like even the email that was, hey, here's your code or whatever. And like the way they described it, I was like, oh, well, I'm pretty sure I know what happens",
            "start": 366.28
        },
        {
            "text": "read into it. Don't, you know what I mean? 'Cause like even the email that was, hey, here's your code or whatever. And like the way they described it, I was like, oh, well, I'm pretty sure I know what happens to him, you know? But it still was of getting there. And it was like the whole, I know something. I I think I know the ending, but I'm not sure the journey. Like, I don't understand 'cause there is that like, you know, the the messages that go from totally friendly tone to like, I'm pissed at you. And like, wait, ****, why? And I need to figure out by looking at the other messages and figuring it all out how that happened. Very cool. Yeah, very cool. Colin, sounds like your type of game. Oh, definit. Well, actually, sounds great. But it's on a phone, so I can't play it. When it comes to Vita, I'll certainly turn it side. You love it. Yes. So Colin, A Normal Lost Phone. You've been playing a very Colin game. Yeah. Tales of Berseria. Tales of Berseria, which I think it's the sixth Tales game. Um, something like that. Uh, I'm a huge Tales",
            "start": 404.0
        },
        {
            "text": "love it. Yes. So Colin, A Normal Lost Phone. You've been playing a very Colin game. Yeah. Tales of Berseria. Tales of Berseria, which I think it's the sixth Tales game. Um, something like that. Uh, I'm a huge Tales fan. And this surprises newer people that are new listeners or newer, fresher listeners, maybe even people that just joined us with Kinda Funny when we started. But I've been a Tales fan for 19 years. And uh, played most of them. And uh, there are I'm a big old school JRPG fan. I've kind of fallen off because I think the Japanese role-playing genre is largely trash now. And I don't I don't think anyone really dispute that. But there are three marquee uh, franchises of varying popularity that I think are are regular kind of franchises. And it's Final Fantasy, it's Dragon Quest, and its Tales. Persona. Uh, well, no, Persona's not regular. I mean, Persona, it took them Persona 4 came out in 2008. So it's it's nine. I don't know your definition. It's a sequel. It's a sequenced numbered series. I but it's not been nine years since",
            "start": 440.0
        },
        {
            "text": "not regular. I mean, Persona, it took them Persona 4 came out in 2008. So it's it's nine. I don't know your definition. It's a sequel. It's a sequenced numbered series. I but it's not been nine years since since the last one. Uh, I'm saying like talking about the ones that come out great frequency. A Dragon Quest game, although Dragon Quest not as regular. But yeah, Persona 00, whatever. But in terms of those three franchises, um, I think Final Fantasy changes too much. I think Dragon Quest for a lot of people is very familiar, kind of comfort food, but doesn't change very much at all. And I think Tales is kind of somewhere in the middle where um, it's a very familiar game to play, but it uh, and it's come a long way since it's like chibi roots with Phantasia and Destiny. Um, but uh, has like a structure that makes it very familiar that makes it that makes it uh, feel like a continuation of the old Tales games, even though like Xillia or something like that or um, even a Legendia or something where you know what you're playing",
            "start": 488.04
        },
        {
            "text": "that makes it that makes it uh, feel like a continuation of the old Tales games, even though like Xillia or something like that or um, even a Legendia or something where you know what you're playing and you know what you're getting into. And so when you play the game, if you played Tales games before, then it's very familiar. That the the the the um, the difference with this Tales game compared to others, and I think Zestiria, which was the last one, is another example of this, is that they're trying to really change things and make it more dynamic. And I think that they realize that to a degree the games are becoming very samey. Um, for some people, they still have a very hardcore group of people. There's a Tales Festival every year in Japan that Namco tried to invite me to like three different times that I couldn't go to. Bro, now they got this Cat in the Hat. Come on. Yeah, the Cat in the Hat character is there. Not as cool as Rollo from Xillia, who was just a cat, didn't have a hat, just a cat. They don't",
            "start": 531.72
        },
        {
            "text": "I couldn't go to. Bro, now they got this Cat in the Hat. Come on. Yeah, the Cat in the Hat character is there. Not as cool as Rollo from Xillia, who was just a cat, didn't have a hat, just a cat. They don't want it to be too samey. Ex. Put you put the Cat in the Hat, different story all together. A little different. The Cat in the Hat happens to be a Mieu, which is a it doesn't matter. The uh, so all right. So Berseria for Tales fans, because no one else will probably care. Um, the combat structure is a little different. Uh, you're not using Arts as heavily. Um, you're using a lot of combat combinations. The game's already always had a fighting game kind of genetic code. But um, but it the combat's a little different. You can set up different uh, combos there, which is not necessarily unheard of in a Tales game, but it's much more physical, I guess, is what I'm saying, as opposed to distance fighting. Um, which is again, if you're playing Symphonia or something like that with you know, with Lloyd or not unheard of, but",
            "start": 568.12
        },
        {
            "text": "it's much more physical, I guess, is what I'm saying, as opposed to distance fighting. Um, which is again, if you're playing Symphonia or something like that with you know, with Lloyd or not unheard of, but definitely has a different feel, I think than Xillia, which was the last major one. I don't think a lot of people played Zestiria because I think it was so different. Um, and uh, the other major difference is is that I think that they've scaled back some systems and then they've added some systems. So or refined some systems. So um, the game still has titles, uh, which are a famous Tales thing, which is uh, uh, you complete certain things or do certain things in the game and you get titles based on that. Like a title like you are the you are the the itemizer. You are the Mr. Mr. Mr. Merchant or whatever because you sell things, whatever. But there's like all of these all of these different things have all these layers. So every art you use has a leveling up system and a star system. Every title, the depending on how",
            "start": 610.28
        },
        {
            "text": "sell things, whatever. But there's like all of these all of these different things have all these layers. So every art you use has a leveling up system and a star system. Every title, the depending on how much you use it and what it is, has a leveling up system and a star system. Um, if you go to a shop and you buy or sell things, you get the shop owners will level up. Uh, if you refine and dismantle items, the shop owner and the and the blacksmith will level up. Um, so there's all these different systems. Every piece of equipment you have can be mastered. The longer you keep it equipped, the more like its innate kind of abilities will be on you permanently. So once you master, say you have a cloak on and you master it and it has plus 5% to arts or whatever, then when you remove it, as long as you've mastered it, that's permanent and you'll have that forever. So there's a reason to equip everything and have use different permutations of items. Um, so on a systems level, it's way more dynamic than Tales",
            "start": 650.36
        },
        {
            "text": "it that's permanent and you'll have that forever. So there's a reason to equip everything and have use different permutations of items. Um, so on a systems level, it's way more dynamic than Tales typically is. Um, which keeps you in the menus much more, which is depending on who you are, you might like that or you might not like that. I actually really enjoy that kind of ****. So um, I like the refining of items and the kind of equipping things and making my character stronger and seeing the permanence of it because what they did remove from old Tales games or some old Tales games is the ability to uh, customize the way you level up. So every time you level up, you get points that you can get then go into this huge grid like Final Fantasy X for instance. And uh, and kind of go about your business in that way. They've removed that. So now you just have you just level up and you just get more stamina and you get more whatever health and all that kind of stuff, strength. So they've removed that. So in other",
            "start": 689.36
        },
        {
            "text": "way. They've removed that. So now you just have you just level up and you just get more stamina and you get more whatever health and all that kind of stuff, strength. So they've removed that. So in other words, they've exchanged depth there for depth somewhere else. Um, in terms of some of the side systems, I think that uh, one of the cool things is you have a ship. Uh, you can send the ship out uh, constantly to go explore the world for you and it finds items and it finds recipes to cook and it finds things that are very lucrative. It can find new parts of the map for you to explore and stuff like that. And uh, it's kind of cool. So you get a little icon, you send it out. It takes a half an hour in game time for the ship to go and come back. And it comes back and it's like, we found these ingredients. This person knew this recipe. So now you can cook that food. Also, this part of the map's now unlocked. Your ship is then leveling up and you're like getting all these things. So now your ship will come back with",
            "start": 724.24
        },
        {
            "text": "knew this recipe. So now you can cook that food. Also, this part of the map's now unlocked. Your ship is then leveling up and you're like getting all these things. So now your ship will come back with more food. Your ship will come back quicker. Um, all that kind of stuff. So there's another subsystem there that has been added based on the removal of some other things that used to be deep somewhere else in a Tales game. Um, so I hope that makes I think that'll make sense to to Tales fans out there. And then the story itself, I think is actually one of its biggest draws 'cause it's strange. Uh, for a Tales game, usually it's like uh, young adventurer, uh, something terrible happens, he has to go save the world. In this, you're actually trying to kill the people that are trying to keep peace in the world. Um, and I think and I think it's I think it's kind of cool because it's it's way deeper than that. I don't want to get too I don't want to ruin it because obviously you're not that's it's not what it seems. Um, but",
            "start": 757.36
        },
        {
            "text": "and I think it's I think it's kind of cool because it's it's way deeper than that. I don't want to get too I don't want to ruin it because obviously you're not that's it's not what it seems. Um, but in the beginning of the game, you're playing as Velvet, who's the who's the primary character. She's a female protagonist. For the first 90 minutes, the game seems like it's one very specific thing. You have a young boy, uh, who's kind of like a brother figure named Laphicet, who is maybe eight or nine years old. Um, and you're being taken care of by this this uh, this older kind of guy, this father figure, whatever, who is like this great swordsman and stuff like that. About 90 minutes in, he turns on everyone and kills the boy and does like all this kind of ****. And then you are thrown in prison and become basically like this demon character. And you emerge three years later to find this world of it's the world's at peace and it's it's run by this group of people called the Exorcists, um, that are are are",
            "start": 793.96
        },
        {
            "text": "basically like this demon character and you emerge three years later to find this world of it's the world's at peace and it's it's run by this group of people called the Exorcists, um, that are are are trying to like get rid of like the blight, the demon blight, um, they call it and all these kind of demons around the world. And all you care about is killing the guy who killed your brother. That's it. Like, that's your only goal. You don't care. And that's why I think that the story is kind of dynamic and kind of interesting. Like, you really don't care about the the ramifications of what you're doing for anyone else in the world because what you're doing at face value for the rest of the world is actually destabilizing the world. But you just want to do it because you are on a on a path of Eng. That's it. That's what the game's about. And I'm about 15 hours in right now. And and uh, I was reading online, you know, 40 or 50 hours, normal Tales length. Um, 100, 110 hours to platinum it. Um, which",
            "start": 834.08
        },
        {
            "text": "it. That's what the game's about. And I'm about 15 hours in right now. And and uh, I was reading online, you know, 40 or 50 hours, normal Tales length. Um, 100, 110 hours to platinum it. Um, which won't happen here. I was going to say, you're going for right? No, not a prayer. Uh, but uh, Tales games are always really difficult to platinum. But there are people that have all of them. Um, and and that's and you know, that's dedication. I appreciate if I was younger and I had time. Yeah, if I had time and inclination to do that. So anyway, I'm really enjoying the game. I think that is it a good place for people that aren't familiar with Tales to jump into? I think it is a much better place to jump into than Zestiria was, which I think didn't resonate with a lot of people. It was empty. It was open. I I appreciate that they tried to do different things. When I first played Zestiria in Japan, um, in 2013 or 2014, uh, I was super excited about it because I was like, you guys are really trying to change it. But when I",
            "start": 868.48
        },
        {
            "text": "that they tried to do different things. When I first played Zestiria in Japan, um, in 2013 or 2014, uh, I was super excited about it because I was like, you guys are really trying to change it. But when I went and played it for just a few hours, I'm like, the combat's all off. This doesn't feel right. This doesn't feel like a Tales game. And this seems like uh, an answer to that. This feels much more like Xillia. Um, in terms of pathways, in terms of com in terms of open. Like it's it's it's it's nonlinear, but it's there's no world map for instance. You're kind of going from section to section to section. Um, so I think in that regard, I think that it it's way more of a pure Tales game. And I think people enjoy it. Uh, I don't necessarily think this is a role-playing game for everyone. For instance, if you have just jumped into the role-playing genre of the Japanese persuasion with Final Fantasy XV for instance, which is a very Japanese game as well. That is a much more straightforward role-playing game. And I",
            "start": 907.36
        },
        {
            "text": "just jumped into the role-playing genre of the Japanese persuasion with Final Fantasy XV for instance, which is a very Japanese game as well. That is a much more straightforward role-playing game. And I think much more palatable to a much more mass market audience. I think that Tales is still very much niche. It's still very corny. It's still very anime. It's still um, all those things that I love about Tales. I'm not an anime fan. I'm not a fan of overt corniness. But that's always been what those games were. And that's it's it's it's like putting on a glove that that that fits just right. Like it always has. It's just a really colorful pink glove. It's just a very colorful pink uh, glove that you'd find in Akihabara somewhere. Uh, so yeah, I I think it's great. I think people are out there are going to enjoy it. I'm I'm hoping for the best for this game because I think it's really cool. And uh, um, you know, Tales keeps on truck along while we kind of wait for, you know, at least I'm kind of waiting for",
            "start": 945.92
        },
        {
            "text": "enjoy it I'm I'm hoping for the best for this game because I think it's really cool and uh um you know Tales keeps on truck along while we kind of wait for you know at least I'm kind of waiting for Dragon Quest 11 so there you go",
            "start": 983.08
        }
    ]
}