{
    "id": 2428,
    "video_id": "Uz3PaoY2BK8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Collecting Things - The GameOverGreggy Show Ep. 168 (Pt. 4)",
    "description": "Tim likes collecting things.\n\nThanks to Mack Weldon for sponsoring this episode. Go to http://www.mackweldon.com and use promo code: greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487836803,
    "duration": 1283,
    "transcript_chunks": [
        {
            "text": "Hey dude, this episode of The GameOverGreggy Show is brought to you by Mack Weldon. Stop dressing like Kevin and start dressing like Tim. I'm so sorry, Kevin, they let me write the ad. That's right, you'll look stylish and hip and not like Mick Foley after he retired. Mack Weldon believes in smart design, premium fabrics, and simple shopping. Mack Weldon will be the most comfortable underwear, socks, shirts, undershirts, hoodies, and sweatpants that you will ever wear. They have a line of silver underwear and shirts that are naturally antimicrobial, which means eliminate odor. You don't say it like that, Colin, but you can say what antimicrobial. They want you to be comfortable, so if you don't like your first pair, you can keep it and they'll still refund you, no questions asked. Go to mackweldon.com and get 0% off using the promo code Greggy. Be a Tim, don't be a Kevin. Why? Why? 'Cause they let me write the ad. Tim, it's your topic. Yes, you might have to leave at the end of it. Yes, okay, that's acceptable. So",
            "start": 0.16
        },
        {
            "text": "off using the promo code Greggy. Be a Tim, don't be a Kevin. Why? Why? 'Cause they let me write the ad. Tim, it's your topic. Yes, you might have to leave at the end of it. Yes, okay, that's acceptable. So my topic is collecting things. I feel like we haven't talked about this before. We might have talked about it tangentially with like, talked about like hoarders and things like that, but I don't think we've talked about collecting things before. I just want to talk about like, what have you guys collected? What do you collect anything currently still to this day? Right for me, I I mean, I've talked many times about like, I collect music, physical, physical. Oh, also my Fast & Furious steelbook collection. Bring, thank you. Um, I've collected Disney movies on on Blu-ray. Um, I've collected Pokémon cards and a lot of, you know, Yu-Gi-Oh! and all that type stuff right in front so that they know, oh my God, they scratch these steelbooks, they scratch. Um, but I think the the thing most proud of that I've collected and",
            "start": 43.92
        },
        {
            "text": "of, you know, Yu-Gi-Oh! and all that type stuff right in front so that they know, oh my God, they scratch these steelbooks, they scratch. Um, but I think the the thing most proud of that I've collected, and it's a weird one, is my digital media collection. That's very weird. Yeah, and your list collection, you love that. I I have a lot of lists, but I over the years, I've been really kind of OCD about organizing my digital files and making sure that everything is how it should be. You were stoked about this for the plane ride. Yeah, no, and I organized a living **** out of things. It was great. But that that stuff's more organizing lists and documents, notes that I've I've made over the years. But when it comes to music and movies, and I mean, even pictures to an extent, but I really like knowing that I have it all. And streaming services have kind of like changed the game of that a bit. Uh, but still, when it comes to to music, I still buy my music, rip my own CDs, and then organize it that way and have it have the",
            "start": 106.48
        },
        {
            "text": "and streaming services have kind of like changed the game of that a bit. Uh, but still, when it comes to to music, I still buy my music, rip my own CDs, and then organize it that way and have it have the digital archive there. Um, but yeah, I'm just kind of interested to see what you guys have collected over the years because for me, like back in the day, I definitely was into collecting video games and like, I I like that, but it reached a point where I was like, I need to stop. Sure. And there's been so many things in recent times where I'm like, I cannot buy a physical comic book 'cause then I'm done. Sure. I'm going to buy too many, you know. I can't buy an Amiibo. I can't like, I never really liked Funko Pops, so like, I'm not too into that. But action figures, like cool action fig, you still have a problem with Funko Pops as well. I do not have a Funko Pop problem. Have you know, they're kind of lame, aren't they though? They're all the same. I like them. That's why they're cool. It's like having a Dr. Look how good",
            "start": 153.84
        },
        {
            "text": "Funko Pops as well. I do not have a Funko Pop problem. Have you know, they're kind of lame, aren't they though? They're all the same. I like them. That's why they're cool. It's like having a Dr. Look how good that Wolverine and Batman look over. They're friends. Bring them over here, Greg. Can you bring your friends over here and touch each other? They can touch, they can hold hands. A Wolverine bobblehead. Bobble H can't get. They're all the same. No, see, that was the thing when Funko Pops hit, that was the that was one of those gut check moments for old Greg Miller of, okay, this can either take over my life or I can establish rules. And so the rule became, of course, I'll buy any Superman. And then, of course, any House of El character. I'll get a Super, I'll get I'll get a Superboy, you know what I mean? Come on, Guess Bo, you know what I mean? And then every version of Superman. Didn't buy the new Dark Knight. They got the, you know, the Dark Knight Returns Superman out there. No, thank you. Don't like don't like how",
            "start": 192.68
        },
        {
            "text": "Guess Bo, you know what I mean? And then every version of Superman. Didn't buy the new Dark Knight. They got the, you know, the Dark Knight Returns Superman out there. No, thank you. Don't like don't like how he's got the old face and I understand that's accurate. I just don't like how he looks. Um, but then it became, okay, there'll be exceptions for Batgirl. Of course, I love Batgirl, so I had to get the, you know, I got the I got the original Batgirl they put out. Now I got in there, I got the Batgirl uh B Batgirl Burnside where they redesigned the body and gave her more of a female figure, which they have for the Animated Series Batgirl, which I haven't bought and I'm probably not going to. I'm going to hold off on that one. But it's the same thing where those were the rules. I'm not going outside of that. Now you might say at my house, I have the two Batman Funko Pops. I do. They're of course from Batman v Superman, though one was a pack in, the other was a gift. What am I going to do? I can't say no to a gift.",
            "start": 233.16
        },
        {
            "text": "you might say at my house, I have the two Batman Funko Pops. I do. They're of course from Batman v Superman, though one was a pack in, the other was a gift. What am I going to do? I can't say no to a gift. But that's the point is that there's got to be rules to what I because it could have easily been that I'm going to buy every **** Funko Pop and have and I see kids who have them and their walls are lined with them and I'm like, I totally get it. And the old days, I would have been there because growing up, of course, I was a collector. I I had a problem and I was a I was a um only child, so I was spoiled rotten and there was no big brother to say no and my parents didn't know any better, so they continued to spoil me like crazy. So I was that **** God, they made a Monster who got you were an only child who yeah, I know, right? No, it doesn't explain anything. I had no no worries. I got good grades. I stayed out of trouble. So when I was like, I'm really into superheroes and all this stuff, I'm buying these",
            "start": 267.64
        },
        {
            "text": "who yeah, I know, right? No, it doesn't explain anything. I had no no worries. I got good grades. I stayed out of trouble. So when I was like, I'm really into superheroes and all this stuff, I'm buying these, will you guys buy me these Superman toys or whatever? They said yes. And then when I was like, can we get two so I can keep one mint on card? Nobody said no **** way, grow up. So that's why in my Dad's attic right now, there are long box on top of long boxes that are one filled with comics and then filled with action figures mint on card. And I'm talking the Superman: Man of Steel collection. I'm talking Total Justice. I see these **** on shelves when we go to Comic-Con selling for $3. I the '90s toys are are largely worthless. I need to write back to Dad and just tell him to burn him down. Now I talk to him every Sunday. Why do I not call him? Tell him? I don't know. I it's so hard though. I'm right there with you. Like like the only thing is like, I don't collect anything necessarily now except for one",
            "start": 303.8
        },
        {
            "text": "to him every Sunday. Why do I not call him? Tell him? I don't know. I it's so hard though. I'm right there with you. Like like the only thing is like, I don't collect anything necessarily now except for one trade magazine, which I which is the American Cinematographer. But all those toys that are sitting in there, I cannot bring myself to part with, even though I know they're they're largely worthless. Kevin, God, you just have to take. But I want to give a it's another one of those things where it's like, we know it's not worth our time to do that necessarily. Like, I don't like when when are we going to get the time to do that? When we call that time? But I can't bear to like throw them out because there is that you should never throw them out. Well, the G.I. Joes, I probably will never throw out. But um, yeah, the only thing I I really collect is the American Cinematographer Magazine. It's a physical trade magazine, which by the way, you can totally get digitally. And and that's the thing is like, for me, video game",
            "start": 347.84
        },
        {
            "text": "only thing I I really collect is the American Cinematographer Magazine. It's a physical trade magazine, which by the way, you can totally get digitally. And and that's the thing is like, for me, video game magazines, the other thing that I I can't believe I didn't mention, like I Electronic Gaming Monthly, Nintendo Power, specifically like those two. I'm lucky I was so addicted to to having them all and having them lined up and there's something satisfying about it, right? And like when I I time investment, when I when I moved for the first time, like we had to get rid of **** and like it sucked 'cause like those they took up so much space and were so heavy. And like, I remember going through and I was like, you know what? I'm going to look at every single one and if it has some resonance with me where I'm like, I remember this issue, I'm just going to keep it. So I still have a whole bunch of them, but I don't have the complete collection. But then there's like websites that have like the I forgot what it's",
            "start": 381.4
        },
        {
            "text": "like, I remember this issue, I'm just going to keep it. So I still have a whole bunch of them, but I don't have the complete collection. But then there's like websites that have like the I forgot what it's called, Retro Archive or whatever, and you can like see digital scans of all the magazines. I'm like, thank God for that 'cause I still have the ability to look at these if I ever I regret to. That's totally one of those things. I the exact same way of I had them all on a bookshelf, you know, all my EGMs, all my Game Pros or whatever. And I say the only one I ever kept was uh the EGM that's the one the PlayStation the giant one, the blue one that I'd read in. Exactly, exactly. But I regret now, you know, I don't know why I never kept the GamePro. That was the Death and Return of Superman one with Maximum Carnage on the inside that launched my, you know, wanting to do this. I should have kept that. Like at IGN, they they have so many video game magazines and I'm like, that's the coolest thing **** ever. I was",
            "start": 416.08
        },
        {
            "text": "on the inside that launched my, you know, wanting to do this. I should have kept that. Like at IGN, they they have so many video game magazines and I'm like, that's the coolest thing **** ever. I was always so impressed by that. So another thing that for me that I was thinking about is like, so I collect the like music and stuff specifically from like Tone Deaf's label Q5. But it was more than just the music, it was like all the Collector's Editions, T-shirts. Anytime they put out a T-shirt, I bought it. And like that, it wasn't until recently that I've kind of fallen off. Like if he put **** out, I'll still get it. But like some of the artist, I'm like, I'm not going to get every **** T-shirt you put out. But it makes me think like, are there people out there that buy every single thing we put out and collect? Yeah, the Kinda Funny stuff. 'Cause it's like, that scares me. It's awesome. Thank you. Like, oh, it's it's amazing, but it's scary to think that like, you're like that for somebody. Yeah, because I would",
            "start": 451.0
        },
        {
            "text": "collect. Yeah, the Kinda Funny stuff. 'Cause it's like, that scares me. It's awesome. Thank you. Like, oh, it's it's amazing, but it's scary to think that like, you're like that for somebody. Yeah, because I would buy all this stuff and it's like, I don't know. I just know how much thought we put in to some of these things. I'm like, don't buy this. Don't buy all of this. Buy the things that make sense. Don't collect this, I guess, is what I'm saying. I don't think of what we do is collecting, you know what I mean? Uh, but I don't know. Do you do you and we appreciate it. I think on the the video game magazine front, I I almost went down that road because I used to be I used to love NextGen magazine when it had that matte cover and I was like, this so unique and cool. And I collected I like I the first one I bought, I forget what was on the cover, but I was like, this, I'm going to read this whole thing. Um, and I and I made my mom uh drive me to the uh the Safeway every single month to like and I would look for it. I",
            "start": 485.4
        },
        {
            "text": "I forget what was on the cover, but I was like, this, I'm going to read this whole thing. Um, and I and I made my mom uh drive me to the uh the Safeway every single month to like and I would look for it. I would keep looking for it, not realizing like a stupid **** kid that I could have just subscribed to the magazine. Um, well, you would to get them in pristine condition. That's true. That was always a heartbreaker. You get there, the magazine covers ripped like ****. Hated hated the concept. And I still hate this. This still kind of uh uh chaps my height a little bit with the American Cinematographer Magazine that they put the **** label on and sometimes it's upside down, you know, and sometimes it's just like ripped off a little bit. And I'm like, and I love I mean, and there's there's also something nostalgic about walking into like a newsstand or magazine store and seeing it and picking out the copy that you want. And like, you're right, like I I try to pick out the press. We've already talked about",
            "start": 526.36
        },
        {
            "text": "about walking into like a newsstand or magazine store and seeing it and picking out the copy that you want. And like, you're right, like I I try to pick out the press. We've already talked about how I put him in Ziploc bags when I travel 'cause I don't like I don't like the the episode. But then NextGen magazine screwed me over when they I guess it was probably an economics thing where they just they switched over from the matte cover to like more glossy cover. And I was like, you lost me. You lost me. Didn't realize till later, Doug Perry wrote for that magazine. Wow. Yeah, no, I mean, I'm right there with you. That was my whole thing with comics for a long time is that once I kicked the comic comic habit when I was going, I guess, out of high school into college. Like, I think is when I stopped collecting comics. And then in college, when you just the poor college student going to the University Bookstore and just taking them off the thing and reading them there and then putting them back, right? But uh like",
            "start": 560.52
        },
        {
            "text": "and then in college, when you just the poor college student going to the University Bookstore and just taking them off the thing and reading them there and then putting them back, right? But uh like when I remember when I got out in the on the other side and we were at IGN and stuff, it was the thing of I'd go to a comic shop. I'd fall off the wagon like once every seven months, go there and buy a whole bunch of stuff that I wanted to read. But then I'd come home and just have loose issues and I would pick force myself to pick them up and throw them away or recycle them or give them away. I was like, I can't have these here because I know what this leads to. And I'm not buying a short box. I'm am not having a cardboard box here. And that's it's hard to it's it seems to me like it was just yesterday, but I remember those days of tweeting at DC Comics and be like, you need to go day and day digital. And I would buy comics that way. And then they finally did when they join, you know what I mean? That was",
            "start": 596.64
        },
        {
            "text": "I remember those days of tweeting at DC Comics and be like, you need to go day and day digital. And I would buy comics that way. And then they finally did when they join, you know what I mean? That was the end. And then I fell right back into it. But I'm so happy to give money that way and just have it all on an iPad and not worry about it and have it be that disposable entertainment because I'm so not interested in collecting it. And I think back to when I was collecting comics and filling those long boxes. And I don't know what it is about being a kid that gets you into that frame. And it's it's social, I guess. You're talking to people, you're interacting with your friend. I mean, me, my friends, you know, would get into the collecting cards. I remember Terminator 2, the first uh cards I ever collected, like trading cards were Terminator 2. And I remember when I got that last card, I traded Matt Noel to get the last card I needed and having that complete set. And like that sense of like, I did something. And it's",
            "start": 628.76
        },
        {
            "text": "cards were Terminator 2. And I remember when I got that last card, I traded Matt Noel to get the last card I needed and having that complete set. And like that sense of like, I did something. And it's probably what I get out of video games, followed by a deep emptiness. You're like, I've the next day like, man, I wasted a lot of money on Terminator 2 cards. Linda Hamilton looks cool though. Great. You got to run. I got to run. All right, cool. I love you guys. To see. But that's the same thing with the comics where it was of just like, I'd go through and do this. Remember my Dad walking around Chicago Comic-Con, which would be going to become Wizard World or whatever. And I remember once seeing they had the platinum edition of The Death of Superman up there. And it's like, it's sealed silver polymer bag with the silver thing on there. And they wanted like $500 for it. And like my Dad being like, no, we're not getting no, sorry, you know what I mean? And me be like, oh, there's a case for it. M go. And it of course, tanked.",
            "start": 665.28
        },
        {
            "text": "silver thing on there and they wanted like $500 for it. And like my Dad being like, no, we're not getting no, sorry, you know what I mean? And me be like, oh, there's a case for it. M go. And it of course, tanked like all the other ones. Exactly. No, who the **** knows? Nobody would buy because that's the problem is like, we've talked about before. What do you got here, Kev? Still $500? No. Or is it signed? It's signed. It's signed though. Signed then. Yeah, see if you find another version of it. $780. Still signed though, right? Yeah, yeah, they're all signed. That see, that's the thing. If you're getting them with something happening on them, whatever. Yeah, I don't know. Now, Colin, you've always been a minimalist. Not always, but yeah, as an adult, I I mean, I as a as a young man, I mean, I collected, you know, toys and I had hundreds of G.I. Joes. Still do, right? They still they're still they're still around. Um, your video game collection was my video game collection is huge. My physical video game collection. But the funny thing about all these",
            "start": 702.84
        },
        {
            "text": "G.I. Joes still do, right? They still they're still they're still around. Um, your video game collection was my video game collection is huge. My physical video game collection. But the funny thing about all these collections, whether it's video games, whether it was DVDs, later on VHSs, CDs, all those things, like they're all these collections that are pretty robust, but stuck in time. So like my music collection from the early to mid '90s and then all the way through the early 2000s is **** awesome, but it's dead there. The thing I was thinking about recently was, you know, I always had a lot of pride in buy I bought I used to buy a lot of books always. Um, I still do, but I buy them digitally now. And I used to just put them on my my nightstand and as I'd read them, then I'd put them on the shelf and they would join them Pantheon of all the books I had write or whatever. And I was looking at my collection of books recently. I I don't have all of them here. I have a fraction of them here. Um, maybe like 100, 150 or",
            "start": 742.48
        },
        {
            "text": "them Pantheon of all the books I had write or whatever. And I was looking at my collection of books recently. I I don't have all of them here. I have a fraction of them here. Um, maybe like 100, 150 or something books here, pretty much all the books I bought since I've been here. And then I went digital in 2011 with books. And I was looking at my collection of books digitally recently and I realized two things. One is that like, because I'm buying them digitally, I feel like I can just throw them away quicker. There's a bunch of books I've read like halfway through. Yeah, you don't want. And which I would never do. And and um the second thing is I I really have carefully seriously thought where I'm like, I'm going to spend a couple thousand dollars and literally buy all of these books physically 'cause I can't stand the fact that I have this **** collection, another collection of **** that's just stuck in time, just like the DVDs, just like the CDs, just like the the video games, just like the and so these",
            "start": 778.52
        },
        {
            "text": "stand the fact that I have this **** collection, another collection of **** that's just stuck in time, just like the DVDs, just like the CDs, just like the the video games, just like the and so these days like, I I don't collect anything. I I think the only thing that I would go out of my way to collect is are PSN trophies. What about bourbon? Bourbon I I I do collect, but I drink it and then it goes away. Also, I've been very drinking very much in the last six months. But the uh so there is a place for that kind of stuff. But I do pride myself as an adult on being a minimalist. I want to get rid of I love throwing **** away. I **** get off on it. And and uh it does it Jacks you up. You're like, I can't let this guy. And you do. You're like, I need more of this. It's what it's it's the same thing I explained when my phone crashed a couple years ago and I I didn't back anything up and I lost everything. And I'm like, I was sad for a minute. I was like, I lost all my contacts. I lost all my pictures and",
            "start": 808.48
        },
        {
            "text": "when my phone crashed a couple years ago and I I didn't back anything up and I lost everything. And I'm like, I was sad for a minute. I was like, I lost all my contacts. I lost all my pictures. And I'm like, **** cares. Yeah, like who honest to Christ **** cares that I lost all those pictures? Am I ever going to there's a million pictures of me on Facebook and Twitter and all these other things. Do I need all this **** in my life? And I think we can go do a great service to ourselves as a people to just decongest ourselves, whether it's, you know, get rid of the clutter, get rid of the **** in your life. It's the same thing why I refuse to this day. I have iCloud set for my contacts, but not for my pictures. I'm like, if the phone dies, **** it. Am I really really in 2050 going to look back at these pictures and be like, man, that was a great meal I had in 2016? Give me a break. Well, that's the whole thing about all the digital photos I have pre-iPhone. Like my iPhone, I look through a lot actually on",
            "start": 847.32
        },
        {
            "text": "pictures and be like, man, that was a great meal I had in 2016. Give me a break. Well, that's the whole thing about all the digital photos I have pre-iPhone. Like my iPhone, I look through a lot actually on airplanes. I like to go through through and curate my collection. Smart. No, it's smart to do because I have 400 pictures of dogs. It's the thing of everything when I stopped taking when I got my first digital camera in college and started from that point, all those photos are either trapped in Photobucket or now on my PS3 'cause that was the only media server I had. And I haven't looked at them in forever. And if if I plug in that PS3 in three decades or whatever and it's dead, am I really going to miss Dr. the photos of me playing caps in the basement with par? Very nostalgic to see. But the point I mean, when Ramone came on the show and showed all those pictures from college that were digital photos, whatever, I was like, this is cool. But and it was it was very nostalgic episode. But I I just I like",
            "start": 881.0
        },
        {
            "text": "with the exception of trophies, literally, I don't go out of my way to really collect anything anymore. Like I I I think that if I had space, I'd certainly have the time and money. But if I had the space, I probably would go back and buy all the G.I. Joes I'm missing, like all of them. Sure. Uh, but that's just that is a that is a specific special nostalgic itch. And I'm watching that happen with my own brother who listen to the show where where he is a rampant collector of video games. Like just I I one of the times I went to Japan, I came home with a Famicom and all that kind of stuff. He has **** everything. And and it's a way to reconnect with the things you truly love. And I respect that. But like when I look back on the things I just wasted **** specious amount of money on on on Star Wars.",
            "start": 917.92
        },
        {
            "text": "everything and and it's a way to reconnect with the things you truly love and I respect that but like when I look back on the things I just wasted **** specious amount of money on on on Star Wars customizable cards I I collected X-Men and Marvel figures for no **** reason for a couple years I I you know it's like this is all hockey cards **** up the ass up the yin-yang hockey cards just a like I I wonder if kids these days and Kevin I guess you're more connected to the children are they less inclined to collect stupid ass **** like this because the internet's there to distract them I feel like with like I think it's so simple for us to look back and be like save your money don't spend them on hockey cards don't buy these action figures never going to use da d d nothing else exactly now like there's entertainment everywhere I remember once some somebody wrote into I think Game Scoop asking Damon like what do you guys do when you get bored and Damon was like I never get",
            "start": 952.6
        },
        {
            "text": "exactly now like there's entertainment everywhere I remember once some somebody wrote into I think Game Scoop asking Damon like what do you guys do when you get bored and Damon was like I never get bored there's something every I I want to read a book I want to do this I want to watch a movie I want to watch a show it's all right there Kevin do you see children being less inclined I mean I I never collected anything well I mean I had Pokemon cards But like everyone you know and you have a little brother right now right yeah he just got into Magic but I see that's that social part of it too and I think that's what it is weird because Magic player shouldn't be social with anyone yeah if he really was cool he'd play HeroClix I think I mean I guess there there's a distinction to be made there though right cuz like that is an actual social activity where you you're supposed to get together have have fun with that and so in that regard that's more of a hobby I would think than a",
            "start": 995.0
        },
        {
            "text": "made there though right cuz like that is an actual social activity where you you're supposed to get together have have fun with that and so in that regard that's more of a hobby I would think than a collection sure um for me I think that in this is just me like when I looked at my DVDs right when I was moving in with my then fiance now White um and I was like it was less a matter of we're switching over to HD DVD and Blu-ray which I think was at the time um and more a matter of like why do I feel so inclined to hold on to these things right I never watched this why like I'm never going to go I had I used to I got it got so bad for me that I took pride in the fact that half of my DVD collection was still sealed right Jeremy Dunham a big offender of this Dunham's collection is well I haven't seen it in years I don't know if he still does it but massive and you'd go up and you be like You'd have two copies of this and they're both still sealed yeah and it's like a they're worthless B um",
            "start": 1034.08
        },
        {
            "text": "seen it in years I don't know if he still does it but massive and you'd go up and you be like You'd have two copies of this and they're both still sealed yeah and it's like a they're worthless B um they're taking up space and C for me it it was just a matter of like I came to a kind of a come to Jesus where I was like why am I holding on to this is this really just is this me like liking to collect something or is it me desperately grasping to hold on to the past as I'm as I become more and more aware thanks to Kevin of my um uh slipping into old age you know um and that's actually a big mind shift for me that that moment kind of started off I would consider myself a little bit more of minimalist than most people but also it's a matter of like do I want to live in the past do I want to live in the present or do want to live in the future and to me I think I want to live in the present right and the present for me is like not necessarily looking forward to like what's what's the new",
            "start": 1070.24
        },
        {
            "text": "live in the present or do want to live in the future and to me I think I want to live in the present right and the present for me is like not necessarily looking forward to like what's what's the new streaming service that's going to happen um it's more of just enjoying what's in front of me right there at any given time and look and searching out those things that are meaningful for me and not being bored but also not necessarily worrying that I lost that picture of my wife on my phone from that first time we went to Big Sur together you know it's like yeah that isn't that is nostalgic and I like looking at it makes me happy it makes me think about that moment um but at the same time my wife's in the Next Room you know like I I can just go interact with her I can touch you know hit X walk you just punch her in the sternum yeah then I jump press X to pay respects you know um but to each his own you know I'm not saying collecting is bad I'm just saying like you have to ask yourself why",
            "start": 1107.28
        },
        {
            "text": "you just punch her in the sternum yeah then I jump press X to pay respects you know um but to each his own you know I'm not saying collecting is bad I'm just saying like you have to ask yourself why you feel this this like inherent need to do this and like what is it is it bringing something to your life or is it causing you anxiety and if it's causing you anx get rid of it it's a very human thing like like you because that that show Hoarders which is one of the great shows right now uh has been for years is is it shows you the end result of that behavior when it's gone rampant unchecked yeah exactly and so like I I think it's important especially in this digital age to minimalize as much as you have like I I am so sick of clutter in my life like I I I need to throw things away I don't need all this **** the only things that matter are the people in my life frankly the money in my bank account which is just ephemeral **** digits on a computer somewhere and you know the the little",
            "start": 1136.64
        },
        {
            "text": "all this **** the only things that matter are the people in my life frankly the money in my bank account which is just ephemeral **** digits on a computer somewhere and you know the the little things I can do to to make to bring pleasure to my life until ultimately I come to an untimely demise motorcycle accident like eating shark dinosaur it's going to be the FBI invading The Compound on the ground get him get him how to go red to **** if you didn't know ladies and gentlemen this has been The GameOverGreggy Show each and every week three sometimes four best friends together on this table each bringing a random topic discussion for your amusement if you like that head over to Patreon.com/KindaFunny where a couple of bucks gets you each and every episode early along with a bunch of exclusive perks goodies and Nick saying if you got no bucks to toss no big deal head over to KindaFunny.com where we post the show day by day topic by topic until it goes up is one big MP3 in",
            "start": 1174.4
        },
        {
            "text": "of exclusive perks goodies and Nick saying if you got no bucks to toss no big deal head over to KindaFunny.com where we post the show day by day topic by topic until it goes up is one big MP3 in video for your amusement the following Friday until next time it's been our pleasure to what's wrong with this you got all the DC Universe here you got us and then you got Iron Man well first no well go yeah sky cam me please give me one second sure I'm I got you all the seconds you want so what you have here yes you have a a basic Iron Man an abstract Iron Man of course yeah the Kinda Funny logo the Weezer logo thought that was the Wonder Woman logo Wonder that's not Wonder Woman it looks similar to Wonder Woman I'll give you but it is Weezer Green Lantern this a hybrid kind of a Flash Shazam cuz I didn't put the tip on it but then I put the circle around it and then yeah of course the Superman logo not one of my not good ones I was just doodling you doodle when you have paper it's how I",
            "start": 1214.04
        },
        {
            "text": "cuz I didn't put the tip on it but then I put the circle around it and then yeah of course the Superman logo not one of my not good ones I was just doodling you doodle when you have paper it's how I think it's true no I I appreciate that here's all the streaming services too I was thinking of when we're talking about streaming services how many times did I use this notes zero zero times I saw you write stuff down though I appreciate that it's a good tactic we'll see you next week",
            "start": 1258.8
        }
    ]
}