{
    "id": 2419,
    "video_id": "VYMLMiRgvYE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What if the Government Was A Business - The GameOverGreggy Show Ep. 168 (Pt. 2)",
    "description": "Colin questions if the Government should function more like a business.\n\nThanks to Mack Weldon for sponsoring this episode. Go to http://www.mackweldon.com and use promo code: greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487664003,
    "duration": 1360,
    "transcript_chunks": [
        {
            "text": "Hey dude, this episode of The GameOverGreggy Show is brought to you by Mack Weldon. Stop dressing like Kevin and start dressing like Tim. I'm so sorry, Kevin, they let me write the ad. That's right, you'll look stylish and hip and not like Mick Foley after he retired. Mack Weldon believes in smart design, premium fabrics, and simple shopping. Mack Weldon will be the most comfortable underwear, socks, shirts, undershirts, hoodies, and sweatpants that you will ever wear. They have a line of silver underwear and shirts that are naturally antimicrobial, which means eliminate odor. You don't say it like that, Colin, but you can say what antimicrobial. They want you to be comfortable, so if you don't like your first pair, you can keep it and they'll still refund you, no questions asked. Go to mackweldon.com and get 20% off using the promo code Greggy. Be a Tim, don't be a Kevin. Why? Why? 'Cause they let me write the ad. Colin, what's your topic? Uh, I just want to see if this works. Oh wait, hold on, I got to put the",
            "start": 0.16
        },
        {
            "text": "20% off using the promo code Greggy. Be a Tim, don't be a Kevin. Why? Why? 'Cause they let me write the ad. Colin, what's your topic? Uh, I just want to see if this works. Oh wait, hold on, I got to put the volume up. Yeah, f*** about, you got to see his movie. I was f***ing dying during that scene. I was dying. I like couldn't breathe. I was like, the movie legitimately had, and I I hate to use the term, but laugh out loud moments, like laugh out dirty G, probably great. Uh, all right, so uh, I wanted to do a quick topic uh, about uh, something specific uh, having to do with I guess uh, philosophy in a way, sure. Um, we often talk about uh, or society at large talks about, well, what should we as a society invest in and what should we invest in our children, educate for? We invest in roads and infrastructure. Um, I was curious specifically if you guys think that uh, society should invest in the Humanities, Art, and Science, um, and if so, like to what extent? The reason I asked this the question is twofold. One is that I've been",
            "start": 43.92
        },
        {
            "text": "specifically if you guys think that uh, society should invest in the Humanities, Art, and Science, um, and if so, like to what extent? The reason I asked this the question is twofold. One is that I've been playing with this idea recently, uh, not necessarily an unprecedented idea, but the idea that the government could be a could be, we often talk about running the government like a business, but could the government really be a business? In other words, could the government come and be like, we want to invest a half a trillion dollars over 10 years in uh, in uh, curing cancer, uh, with the anticipation that we will find some sort of tangible cure that we can then sell the rest of the world, sure. Uh, and in and our American scientists will use American technology to find an American cure for cancer that we can then distribute to the rest of the world and make that money back. In other words, uh, not just a sunken cost of $500 billion, but saying like, we can make maybe a few trillion dollars on this, um, but",
            "start": 124.52
        },
        {
            "text": "then distribute to the rest of the world and make that money back. In other words, uh, not just a sunken cost of $500 billion, but saying like, we can make maybe a few trillion dollars on this, um, but maybe it won't work out. Uh, the the more tangible reason that I bring this up is I tweeted this out the other day, uh, because uh, Donald Trump is going after the National Endowment for the Arts and Humanities, which I think is totally ridiculous. Um, NEA, by the way, spends about half a billion dollars a year, which uh, is has been spent in the time I've been talking about this by the the federal government, so just no money at all. But I I found the statistic interesting. I actually dug this up, this isn't a statistic I found, I actually just did the math. Um, in 2016, uh, $68.3 billion was spent by the American government, um, on the NEA, which is Arts and Humanities, so was paying artists and historians and whatever to do work. Uh, the EPA, the Environmental Protection Agency, NASA, of course, um, NPS",
            "start": 163.96
        },
        {
            "text": "by the American government, um, on the NEA, which is Arts and Humanities, so was paying artists and historians and whatever to do work. Uh, the EPA, the Environmental Protection Agency, NASA, of course, um, NPS, which is the National Park Service, so all of our our parks and recreational areas, uh, the National Science Foundation, NSF, and NIH, which is the National Institute of Health. Um, and half of that actually was spent by the NIH alone. It to contrast, the U.S. military spent $597 billion in that the same time. So those organizations spent $68 billion, right? The U.S. military spent $597 billion. The world spent $1.5 trillion on the military, which which mean I just like, I I like that it like for the audience at home looks like you're reading fact and figures, but it's just a giant PR tweet. And do you mind, I'm going to need be able to see when you say the world spent on military, the general of the of different countries, the United States spent one third of, U.S. spend more money on our military. The United States spent",
            "start": 204.88
        },
        {
            "text": "to need be able to see when you say the world spent on military, the general of the of different countries, the United States spent one third of U.S. spend more money on our military. The United States spent one third of it of the entire global budget on military. Got it. Okay. Uh, and uh, spent outspent the next 10 combined. Um, and that we got to keep that big military, right? We have 4% of the world population. Got to keep got to keep starting those wars. So I'm curious about is if you guys have a philosophical kind of take on this and how do you feel about the idea of the American government actually functioning as a corporation and say finding like, I had this idea, I was talking about this to someone, just just set it up, see what you guys think. I was like, what if the government found a hundred very smart scientists of different ilks? We got roboticists, you got biologists, you got astrophysicists, all sorts of things. They send proposals into a small bureaucracy that that they're like, I want to do this if I",
            "start": 250.84
        },
        {
            "text": "of different ilks. We got roboticists, you got biologists, you got astrophysicists, all sorts of things. They send proposals into a small bureaucracy that that they're like, I want to do this. If I just had a few million dollars, I could do this. And the government's like, fine, just hire them all, pay them all an exorbitant fee to to retain them for a few years, give them a space to work in and all the resources they want, dump a few billion dollars into this and maybe one or two of them will come up with something that like, whatever they do, we own, right? And uh, and and then we can extract that investment, similar to how, you know, a lot of people don't, the American military invented the Internet. That wasn't done by a private corporation, that wasn't done by anyone. Yeah, we would have eventually gotten to that point, but actually ARPANET and DARPA and all those things were made by the American military. The the very Internet that we use today is the very Internet that was created by the American",
            "start": 290.8
        },
        {
            "text": "to that point. But actually ARPANET and DARPA and all those things were made by the American military. The the very Internet that we use today is the very Internet that was created by the American government. So by Al Gore, exactly. So I'm curious what you guys think about those two ideas and if we should kind of withdraw from those things, uh, based on philosophy or or put money into them and if it's important that we do those things as a society, remembering of course that we landed on the Moon, spending an exorbitant amount of money back then, unable, it would be almost a trillion dollars actually today, which is a lot of money. 1969, in in 1969, that's exactly correct. Over this long period of time, 17 Apollo missions. But we did that as a society and we can and we put our flag into the Moon, yeah, and said that we did this together. So how do you guys feel about all that? I mean, I think we, I mean, in general, I think we spend way too much money on the military. I think our priorities in that in that",
            "start": 330.84
        },
        {
            "text": "said that we did this together. So how do you guys feel about all that? I mean, I think we, I mean, in general, I think we spend way too much money on the military. I think our priorities in that in that regard could be a little bit more rejiggered. Um, I I love the fact that we that we still have a National Endowment for the Arts, even though I don't know necessarily what that means. Um, and I don't think we should we should cut that. I think we should spend more money on on on health services and park services and things like that. Uh, on the note of the government becoming a business, uh, I would I think one, there's an argument to be made that it's already there, uh, given that all of our representatives are backed by huge lobbyists like Big Pharma. Um, and that that would terrify me even more because when you start to break down Big Pharma's policies as far as, you know, what was that story, I think it was like six months ago, about that guy who was trying to sell an AIDS pill for Shkreli or whatever his",
            "start": 367.04
        },
        {
            "text": "you start to break down Big Pharma's policies as far as, you know, what was that story, I think it was like six months ago, about that guy who was trying to sell an AIDS pill for Shkreli or whatever his name is. He's he's a a real piece of shit. Apparently he also bought the that Wu-Tang record that they put out. Well, there you go. Um, yeah, so I mean, that that that level of of profiteering kind of scares me a little bit, you know, like I I don't know that I don't know that we're a that far away from it with our current administration being in office right now, um, and some of the things that Trump's doing. But yeah, I just I think that there should be an altruistic side to the government to some degree, right? And that it should be working for the people, not necessarily to make a profit off of the people, um, given the fact especially that we fund this, right? So it's one of those things, like, how would that how would that necessarily work if all the taxpayers were paying these? I mean, that's all money",
            "start": 401.56
        },
        {
            "text": "um, given the fact especially that we fund this, right? So it's one of those things, like, how would that how would that necessarily work if all the taxpayers were paying these? I mean, that's all money that's going presumably toward all this research, right? So do we get a cut of that? If so, I'm in. Yeah, I think the argument you make, I think government is supposed to be altruistic and and typically does run in that in that sense. Um, uh, I think the big question there, twofold, one is what you brought up and the other, so if the money is invested, um, you know, let me back up. What would be interesting is if the government said, hey, we're going to chase a cure for cancer, nebulous thing. We're going to chase a cure for cancer. We're going to invest a ton of money in it, like just a ton of money. We're going to going to we're going to recruit the greatest scientists, give them the greatest resources, greatest facilities, and they're going to get it. If we get it, this is what the budget looks like 10 years from now,",
            "start": 441.8
        },
        {
            "text": "to we're going to recruit the greatest scientists, give them the greatest resources, greatest facilities, and they're going to get it. If we get it, this is what the budget looks like 10 years from now, and this is how much your taxes are going to go down because we're going to take the money that we made on it and we're going to just bomb taxes like to the ground, sure. But if it doesn't work, then this is what's on the books and what we're what we owe. In other words, it's not really it's just an interesting idea of how government might be able to function. The bigger philosophical question is if the American government founded the the cure for cancer and then started charging everyone for it. Yeah, that'd be like how like the government's like, we have it, we know how to do it, which that's what would happen. There's no way around that, right? Well, whoever comes up with a cure for cancer is going to charge for it. Yeah, I mean, whether it's F like Pfizer is going to charge for it. So is it really that wrong",
            "start": 479.2
        },
        {
            "text": "happen, there's no way around that, right? Well, whoever comes up with a cure for cancer is going to charge for it. Yeah, I mean, whether it's F like Pfizer is going to charge for it. So is it really that wrong for the American government to do it? I mean, I feel like it is. I I agree. Yeah, I feel like just because like based on what you're saying, it's just like the moment, especially when our tax dollars are going towards funding this and stuff, it's just like giving them that level of control where it's like, you have to buy stuff. I I guess even now you have to buy like with with all like healthcare and stuff, right? Like with them not providing, you still need to to pay for these services. I don't know, it gets complicated. These numbers are interesting to me because while I also don't agree that this much should be going towards the military, I am shocked that that much is going towards those things, like $70 billion, obviously a lot of money, not as much compared to 600, but that's still a much higher",
            "start": 513.52
        },
        {
            "text": "be going towards the military. I am shocked that that much is going towards those things, like $70 billion, obviously a lot of money, not as much compared to 600, but that's still a much higher percentage than I would if you just asked me how much I think I would not think it's that high. Yeah, it's worth noting that NIH, which is the National Health, you know, they research cures and all those kinds of things, spent half of it. The NEA spent less than a billion of it. So the number is a little misleading. But I mean, but even then, like them spending over, I I believe that health is way more important than Arts, you know, and I feel like there has to be like a hierarchy to to all of this stuff. And like I do believe that Arts are important, uh, but it really comes down to, okay, but how important are they compared to people's well-being and all these other things? And I think that even the idea of let's say a percentage of it, like 20 billion, 10 billion, like how much needs to go towards these things?",
            "start": 548.92
        },
        {
            "text": "compared to people's well-being and all these other things. And I think that even the idea of let's say a percentage of it, like 20 billion, 10 billion, like how much needs to go towards these things, right? I feel like there's also so many other things. And at the end of the day, there I think that art is a like, I'm doing this for the love type of thing. And if it's not starting there, then it's going to end up being for business and stuff. And if it's for business and shit, then it's it's in a different category. So it's like, I don't need it to be funded if you're doing it just for the money of it, if that makes sense. I think I think an interesting, more interesting question or another interesting question would be, what would the world look like if those were switched, right? Um, what would our country, what would our landscape look like? What would our life be on Mars? We'd have cures to all sorts of dis. If not only this one year spending, but let's say we had a 20-year, 20 years, we decided, hey, you",
            "start": 591.44
        },
        {
            "text": "what would our landscape look like? What would our life be on Mars? We'd have cures to all sorts of dis. If not only this one year spending, but let's say we had a 20-year, 20 years, we decided, hey, you know what, we're going to we're going to be isolationists. We're not going to we're not going to try to invest in wars. There would be hundreds of people on Mars. There would be cures for things that we couldn't possibly imagine. You'd all be speaking Russian though. They would have come over. I don't know. We would have cured all their cancer. Well, I made this point in the subsequent, given them all ours, that we could we could cut the military in half, give these people twice as much money if you wanted to, just as a theory, and still cut the budget by $150 billion. Yeah, that's how much money. Like literally give all of them twice as much money, cut half of the military budget, and we still save money. That's how much. And like not an inconsequential amount of money either, hundred and something billion",
            "start": 631.04
        },
        {
            "text": "give all of them twice as much money, cut half of the military budget, and we still save money. That's how much. And like not an inconsequential amount of money either, hundred and something billion dollars a year. That's that's that's 15% of the the deficit, not the debt, the deficit, two different things. Um, so yeah, I don't know. What do you think, Greg? Do you have a philosophical kind of take on this? I mean, I'm with everybody that's been talking so far is, yeah, I think we I definitely think we should be supporting the Arts, the Sciences, the humanities. I think we should be doing more of that. I think that's what we should be encouraging. I think we should be a culture that puts that at the forefront of something that matters to us, you know? I mean, I don't think it's I don't think it's uh, lost on people, myself included, uh, that, you know, like I think people are more interested in celebrity gossip and in video games and in distractions and quote unquote time wasters and things like that or, you know, not",
            "start": 663.64
        },
        {
            "text": "myself included, uh, that, you know, like I think people are more interested in celebrity gossip and in video games and in distractions and quote unquote time wasters and things like that or, you know, not that I'm putting down any of the art forms we all enjoy, but I do think there is a giant disconnect between reading Grapes of Wrath and watching Honey Boo Boo. And I think the fact that more people are willing to do that and that's more accepted and reality TV is okay to watch as your primary source of entertainment, that's all you're engaging in, it's all you're thinking about. And I'm not trying to be on a high horse in an ivory tower. Obviously, I enjoy that stuff too. I enjoy comics and all this different stuff. And I'm not saying one is better than the other, but I think the fact that values have gone a little wacky in terms of what we what matters and what we need to champion and where we need to be. And I think you see that when you look at the fact of how easy it was in this last for fake",
            "start": 700.08
        },
        {
            "text": "gone a little wacky in terms of what we what matters and what we need to champion and where we need to be. And I think you see that when you look at the fact of how easy it was in this last for fake news to in infect everything and f*** everything up and people not be able to want number one to read past the headline and number two not being able to vet things like that. And I think this is all tied into the same thing of that we're a culture that right now doesn't value education. And I'm I'm part of the problem, I think, on some in some respects for sure. But I think that it's reflected by the government in some ways. And maybe maybe it's maybe that's a pot cuddle, maybe that's a cart before the horse, maybe it's the government reflecting its people, maybe it's the people reflecting its government, something to that effect. But I'd like to see us do more of that. And I think, yeah, we could drop this military number by quite a bit and not have it be the end of the world in end times. That's a",
            "start": 739.64
        },
        {
            "text": "something to that effect. But I'd like to see us do more of that. And I think, yeah, we could drop this military number by quite a bit and not have it be the end of the world in end times. That's a fascinating, the your original question, by the way, is very fascinating because when you start to break down, you start to ask yourself why the military budget is so big. It's obvious, the answer is obvious, right? Because that's where a lot that's where a lot of the profits built into. Um, there's a ton of profit in war. It's the military-industrial complex, all that jazz. So the question becomes, if you then were to offset that with there being a bigger margin in another area, what would that do to them the military? How would that change our our basically uh, our foreign policy? You know, like what it would change it in a significant way. Bring would bring us back to, I mean, if we cut the military budget, which I would love to cut the military budget by even like three fifths or more, that now that's my personal",
            "start": 778.36
        },
        {
            "text": "it in a significant way. Bring would bring us back to, I mean, if we cut the military budget, which I would love to cut the military budget by even like three fifths or more, that now that's my personal stance. But it's because we have, you know, you have to look at if you told someone in the in in military apparatus depending on that, they'd f***ing shriek in horror because they see a different world in which the United States needs to maintain these bases in all these. You ever see the pay attention out there, if you ever see a a U.S. Navy or U.S. Air Force or U.S. military, Marines commercials, whatever, especially the Navy commercial, the very end they'll show a logo and pan out on a map. If you freeze, and I've done it, if you freeze on the map, there are stars all over the globe. That's where all of our bases are. Now ask yourself this question, everywhere, f***ing everywhere. Ask yourself this question, how would you feel if Russia had a base in say, Tallahassee? How would you feel if the Chinese had a base in",
            "start": 813.96
        },
        {
            "text": "are now ask yourself this question, everywhere, f***ing everywhere. Ask yourself this question, how would you feel if Russia had a base in say, Tallahassee? How would you feel if the Chinese had a base in San Jose? Now we literally have our military, our sovereign military fighting force in Germany, in Japan, in England, bunch of African countries, Kuwait, Turkey, you know, we have them in we have them even in in Canada, you know, we have them all over the place. Someone's got to watch those Canadians. And you have to you have to ask yourselves like like Donald Trump is on to something interesting, I think, with with one of these particular things, which he's saying NATO, um, NATO particular, like we pay for NATO. Like basically people on NATO, North Atlantic Treaty Organization, is basically designed to keep the Russians away from Western Europe. That's the entire idea of it since the Soviet Union. But we're basically the the bulk of the fighting force. We pay the bulk of the money. Article 5 is the important",
            "start": 852.2
        },
        {
            "text": "Russians away from Western Europe. That's the entire idea of it since the Soviet Union. But we're basically the the bulk of the fighting force. We pay the bulk of the money. Article 5 is the important part of NATO, which says it attack on one and is attack on all. Um, yet we are the ones that do all the heavy lifting financially and all that kind of stuff. And he's his whole thing is like, you guys have to start paying, you know? And that's an interesting thing being like, well, if we're going to station guys in say, Poland, to just scare the Russians a little bit so they don't roll into their f***ing country, then maybe you guys should be paying for it, you know? And I think that that could do put it then. But I do think the bigger thing is a Phil, yeah, here it is, a philosophical, um, is a looks like an outbreak map. It does. It looks like a f***. The yellow circle around Europe, that's that's all all just oh, more than 100 bases. Wow. Okay. So the question is like, what what does the world look like if we did",
            "start": 895.56
        },
        {
            "text": "map it does. It looks like a f***. The yellow circle around Europe, that's that's all all just oh, more than 100 bases. Wow. Okay. So the question is like, what what does the world look like if we did that? And to me, it would be it would look a lot like it did in and I don't want to be dramatic about because some people we don't want the world to look like this, but it going look like the United States looked like in the 30s, which is to say like, we didn't really, you know, it's it's what Theodore Roosevelt said decades before that about carrying a big stick. Like we can we we have the greatest fighting force and the greatest technology the world has ever known in in American military. Not even no one touches anything we do. No one can possibly take us in a nuclear exchange. No one can possibly take us in a ground exchange or in an air or in the sea. We are we are untouchable. We have been since World War II. There's no question about that. No one would ever f*** with us if they could have the",
            "start": 929.76
        },
        {
            "text": "us in a ground exchange or in an air or in the sea. We are we are untouchable. We have been since World War II. There's no question about that. No one would ever f*** with us if they could have. The Soviets would if the Soviets thought they could have taken us, they would have tried for instance, you know, they didn't they didn't dare. And my whole argument is like, we can just remove ourselves from all these places. And if we need to go back to Iraq back or we need to inject ourselves, we'll go. Like no one's going to stop us from trying to inject ourselves back into those countries. But I think the fear becomes then like, what happens if you have a five or 10 year uh, you know, gap where you where we're not having a stranglehold in those countries, right? Do we lose footing? Do we lose footing? Do we lose the ability to have the most amount of aircraft carriers, right? We could, but but we could still have the numbers. We just don't need to deploy them, you know, like right. So we're getting away from the",
            "start": 970.92
        },
        {
            "text": "the ability to have the most amount of aircraft carriers right we could but but we could still have the numbers we just don't need to deploy them you know like right so we're getting away from the philosophical thing because the philosophical thing I want to say about this is this is what's important about not being tied down by Orthodoxy people look at me and they're like well you're a Libertarian so how can you believe in protectionism or you're or you're you're a small government guy so how can you believe in science investment and I'm like because I don't believe in Orthodoxy I believe in small bureaucracies and I believe in a a federal government apparatus as Grover Norquist said that you can drown in a bathtub that's how small it is and I think that that's a great way to look at the government that doesn't mean the government has no function or the government can't do great things or important things it's a matter of how the money is used and scaling the bureaucracy down so the",
            "start": 1005.2
        },
        {
            "text": "government that doesn't mean the government has no function or the government can't do great things or important things it's a matter of how the money is used and scaling the bureaucracy down so the money gets to where it needs to go and that's what's most important so with this kind of stuff I look at it I'm like well NASA does important stuff and they only get $0 billion a year and that's really not a lot of money to work with could they work in concert with some of the private corporations like SpaceX and others to do great things and the answer is yes and I look at something like NIH and I'm like they can invest in in more scientists and doctors to find the next great cure for for a disease that we can proliferate around the world as we have already done a lot of the great medical technology in in the world comes from American companies so could you take could you take some of the pharmaceutical Talent there and put him to work on the the government scale down the bureaucracy to",
            "start": 1038.76
        },
        {
            "text": "in in the world comes from American companies so could you take could you take some of the pharmaceutical Talent there and put him to work on the the government scale down the bureaucracy to let them do what they need to do I have no problem with the government spending money I have a problem with how the government spends money and that's an important differentiator good and so I think it's something interesting whether the answer is right or wrong is for people to think about like how can the government function in such a way to not only serve the benefit of the people to not only pave the roads to not only protect the the airports and protect our space and all those kinds of things but could the government also work for you you know could the government also could we also come together and be like let's invest you know let's what could the American government invest in Tesla yeah you know and then we can all benefit and they take that money back and they're like hey guys we made we",
            "start": 1071.16
        },
        {
            "text": "and be like let's invest you know let's what could the American government invest in Tesla yeah you know and then we can all benefit and they take that money back and they're like hey guys we made we we put just a small amount of money a billion dollars in the Tesla we made a nice rip of a couple hundred million dollars over the last few years on our investment in Tesla we're going to now fund the Arts with that money yeah so it's not going to come out of your tax dollars can we have a government that works smart and efficiently and does lots of cool things without getting in your face because my big thing is I don't want the government involved in your business that doesn't mean the government doesn't have to be involved in any business it just doesn't have to be involved in your business doesn't have to be involved in your life who you're marrying who you're **** what you're smoking all those kinds of things but could it could could we do great things because we look at the Moon",
            "start": 1103.76
        },
        {
            "text": "doesn't have to be involved in your life who you're marrying who you're **** what you're smoking all those kinds of things but could it could could we do great things because we look at the Moon and we said we went there you know and I really do believe that when the Chinese inevitably go back to the Moon and all these and the new space races and invigorated we're going to be like we wish we we wish we did this again like that's what makes us great our art makes us American our our our entertainment makes us American our science makes us American these are the things that define us the Department of Energy doesn't make us American it doesn't need to exist the Department of Education doesn't need to exist that should be happening at a state level but that doesn't mean we shouldn't be investing in things I mean the real concern though comes down to I mean I agree with what you're pitching that'd be awesome but I feel that the concern comes down to what we touched on a second ago with",
            "start": 1139.88
        },
        {
            "text": "in things I mean the real concern though comes down to I mean I agree with what you're pitching that'd be awesome but I feel that the concern comes down to what we touched on a second ago with what's happening now is just the fact that we can't trust the government you know what I mean I don't feel like I can trust the government so I don't for a second think that I could sit there and be like the government in this world is going saying all right we're going to invest in businesses and it not be some Backwater underhanded under the table we're backing this business and it turns out they back this business because of XYZ this this you know guy is in charge and that's the you know what I mean like oh for sure it's just a philosophical I don't think I don't think you could ever get to that point and I don't know that you could really even justify getting to that point because I think that to your point there's so many unsavory things going on and then you don't really understand who's",
            "start": 1173.12
        },
        {
            "text": "point and I don't know that you could really even justify getting to that point because I think that to your point there's so many unsavory things going on and then you don't really understand who's like tracking things and all this kind of stuff and the private economy is what's the the drives the American the American Dream and that should be left alone but it's just to say could we be smarter and more and and I looked at these numbers and I was just pondering this for the last month or so because this tweet's old this tweet's from the 1st of January where I'm like it's an interesting idea why isn't the government smarter doesn't have to necessarily be leaner it just needs to be smarter and can we pay down the debt by making wise Investments mind you we owe $0 trillion $0 trillion dollar that is let let me put it this way just La of patreon if the American government paid for nothing but collected the amount of taxes that it collects right now which is to the tune of like three and",
            "start": 1205.96
        },
        {
            "text": "that is let let me put it this way just La of patreon if the American government paid for nothing but collected the amount of taxes that it collects right now which is to the tune of like three and a half trillion dollars a year or so it would take the government seven years to pay back the debt without paying for anything else other than servicing the debt and serving servicing both the principle and the interest on the debt we owe so much money that we're going to have to find clever Solutions in the next few decades to pay it back or we are going to be **** because anyone that runs around saying sovereign debt should always be this high as nuts the sovereign debt is higher than many times higher than even GDP you know like so could we find a clever solution to say like hey NASA here is $50 billion we want you to go do all these cool things you might want to figure out how to mine that asteroid in the next 0 years and we can take that metal and sell it on the market saying this",
            "start": 1242.16
        },
        {
            "text": "is $50 billion we want you to go do all these cool things you might want to figure out how to mine that asteroid in the next 0 years and we can take that metal and sell it on the market saying this is going to save the country but it might save the country there's some fuel up on the Moon let's uh let's scrape that surface like what if the government was just like hey there's a lot of nickel and aluminum on on that on an asteroid and we were going to Target and we're going to sell it we're going to flood the market you know with it to pay some our debt it's an interesting idea be cool but I don't know the principal philosophy like but but it's one of those things that you can't like that's a great philosophical idea but you can't do that in in principal when was there our Secretary of State was the head of uh used to be the CEO yeah Rex Tillerson so like we're probably not invest in uh battery power Tesla anytime soon with him with with him on the cabinet you know yeah just an idea I",
            "start": 1280.76
        },
        {
            "text": "was the head of uh used to be the CEO yeah Rex Tillerson so like we're probably not invest in uh battery power Tesla anytime soon with him with with him on the cabinet you know yeah just an idea I I want people I want to stress like it's fun to play these with these mental exercise I often play with them by myself because I'm always alone uh of just of just thinking about of just thinking about new ways to go about your business yeah and and new ways to pay off our debt and new ways to invest and new ways to do things and to not be tied about about small government or big government or who cares look at each thing as they are and figure out a way that I I can tell you I can talk to you for 5 hours about how the government can both be small and out of your business and actually invest just as much money as it's investing now way smarter for a return sounds like an Extra Life be part five hours with Colin",
            "start": 1313.84
        }
    ]
}