{
    "id": 2412,
    "video_id": "xF7usO7Ay44",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Kevin Coello"
    ],
    "title": "We Call SisQo - Kinda Funny Morning Show 02.17.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1487367503,
    "duration": 5208,
    "transcript_chunks": [
        {
            "text": "It's raining it's snoring the old man is snoring he bumped his head and went to hell cause Hail Satan! What's up everybody I'm Greg Miller this is the Kinda Funny Morning Show this is the Hero Team News. So is like hailing Satan okay? Did life get so bad and there's so much fucked up shit going on that Satan's not that bad? To say Hail Satan? Yeah. I think at this point we've seen the face of the true devil. PewDiePie. No I'm just kidding. No no no. I think you were always okay to say Hail Satan. Cause people were always just gonna be like eh that's some crackpot. Devil worshipers are like they were always just like oh you guys are crazy but you're not really hurting anyone. Yeah exactly. Oh you attacked a goat? You attacked a goat? Yeah. On the long list of things I'm pretty sure goats are low on the totem pole. Sure. Well again it was just that it was a simpler time back then. It was a simpler time. There was that game about totem poles with goats and they're all",
            "start": 0.0
        },
        {
            "text": "sure goats are low on the totem pole. Sure. Well again it was just that it was a simpler time back then. It was a simpler time. There was that game about totem poles with goats and they're all goats. Right right right. What was that game called? Goat Totem? Goat Totem? I don't think it was called Goat Totem. I don't think that is what it was called. How you doing Greg? I'm good how are you? I'm good. I like doing the show with you. I like doing the show with you a lot too. It's fun. I'm going to be a professional and be quasi-professional which really just means not. We do whatever we want. Ah now Nick, you're? Oh! 10 50s Forces new Power Rangers trailer. I woke up this morning and the first thing I saw was a bunch of people tweeting at me saying that Power Rangers are doing some bullshit ass promotion on their Facebook where and I say bullshit because I'm jealous that I didn't think it was this type of shit. Where there was a Facebook Live video that was just an image and it",
            "start": 60.92
        },
        {
            "text": "ass promotion on their Facebook where and I say bullshit because I'm jealous that I didn't think it was this type of shit. Where there was a Facebook Live video that was just an image and it said if we get oh like 600 000 respond like reacts because you can like or hate or I don't know. Yeah yeah yeah of course some kind of reaction. Then the trailer will unlock and I guess they did it. I guess they did it. Yeah I sat there for about three minutes just tap tap tap away on it. Were you going to watch it today I think? Yeah let's watch it right now. Oh. Let's try to find it. Get it out. New number one news story. Number one. Are you on it? He's on it I'll talk. If you didn't know ladies and gentlemen this is the Kinda Funny Morning Show. Each and every weekday here on Twitch.tv/Kinda Funny Games we come to you with the nerdy news you need to know about before jumping into the chat. To answer your questions comments and concerns. I got one of those burps. It",
            "start": 101.08
        },
        {
            "text": "slash Kinda Funny Games we come to you with the nerdy news you need to know about before jumping into the chat. To answer your questions comments and concerns. Between those two segments. I reached for the computer grab a code for a video game throw it at you and one of you wins a code. Are you going to go hard? Okay. Oh my God. Well I mean I'm trying. That's what the point is. You got it moving. Oh now you're just going to. I don't like this. Okay I got the trailer. Jesus. Yes. More important things Kevin. I want to watch the trailer. Let's make this happen. Hold on. He's got all this tension. I do. Okay in the way of",
            "start": 139.72
        },
        {
            "text": "don't like this. Okay I got the trailer. Jesus. Yes. More important things Kevin. I want to watch the trailer. Let's make this happen. Hold on. He's got all this tension. I do. Okay in the way of the world. My shoulder's here. There it is. Oh God. He's so good. I mean it's tough. It is a tough but fair massage. I'll give you that. Whoa. Never need to run in this office. We caught some cables. Remember that. That's the rules of this place. It's not that I caught you. Oh it's that fucked up PS4 anyway. Don't worry about it. We need to break that bitch and get a Pro anyway. Bro say the word. I don't know how any of this stuff works. I will destroy it for you. I know you will. All you need to say is Kevin. People like your shirt Kev. What shirt? What shirt? What shirt? When I say people like your shirt and you say what shirt? I think originally he was saying we didn't want to make a reference to it. Oh. I said let's not make a big deal. What happened? Your old shirt got wet. Is",
            "start": 174.36
        },
        {
            "text": "like your shirt and you say what shirt? I think originally he was saying we didn't want to make a reference to it. Oh. I said let's not make a big deal. What happened? Your old shirt got wet. Is that what happened? No the shirt that I was wearing I think Paula dried it too excessively and it shrank a little on the bottom and my undershirt was popping out a little bit. You're showing a little bit of the gut. Yeah. And I was like this is not how I want to live. So I went in there I looked for a shirt. We have other shirts. I mean I'm doing it wrong. I appreciate seeing you. No there was options. But I saw it and I was like oh shit I haven't worn a brown shirt in a while. And then I pulled it and I was like oh. Tingles the orangutan. Gotta commit to it. Tingles that your brain would take. Tingles? Cheetos was his name. I was trying to see. Did you hear the news? You didn't catch it. What? I was just sitting there with my mom and I was just sending me seven text messages in a",
            "start": 215.2
        },
        {
            "text": "take. Tingles? Cheetos was his name. I was trying to see. Did you hear the news? You didn't catch it. What? I was just sitting there with my mom and I was just sending me seven text messages in a row. You know I'm live woman! Cheetos was in a car accident last week. What? He's in critical condition. Oh my God why didn't we do some kind of GoFundMe service thing? And all you heard was one word. Bongos. They said Bongos could save him Kev. Why do you hate Cheetos so much? I don't know because of all the scandals. Shit he did with the prostitutes and the cocaine. It's true. Pull up the Power Rangers trailer to the bottom of the news stories. Thank you. Yeah give me two seconds. While on camera I would like to compliment you for what you've done with your camera and microphone. Thank you very much I'm very proud. The camera is now attached to the microphone so when the microphone moves the camera moves and you have no excuse to not be happy with your shot anymore. It's awesome.",
            "start": 247.44
        },
        {
            "text": "very much I'm very proud. The camera is now attached to the microphone so when the microphone moves the camera moves and you have no excuse to not be happy with your shot anymore. It's awesome. It's great. It goes out of the green though you see that? No I don't see that. Oh now I do yeah. Yeah it should be on the thing. Earlier I didn't see it. There's the real world. Back to the green screen. There's the fake real world. Yeah. Oh my God. What's up? We got this Power Rangers trailer? Yep. Figure it out. Figure out the shots it's not working for me. What shots? Your shot. What's wrong with that shot? Long way trip down a Hollywood road. It looks fine. Let's get this thing going. Sorry hold on. I hate it when these trailers are just the recuts. Yeah. Give me the hotness. Give me the new stuff here. Is it okay to show it like this small? Because otherwise it becomes more complicated. Are we okay showing it this small? Sure. I'm not okay. Well tough shit. I'm saying sure. Just",
            "start": 289.76
        },
        {
            "text": "new stuff here. Is it okay to show it like this small? Because otherwise it becomes more complicated. Are we okay showing it this small? Sure. I'm not okay. Well tough shit. I'm saying sure. Just kidding. Ready? Ready? Same place when Billy found those coins. What is that? Dude is that weird? It's a straw. Insanely strong. The answer to what is happening to you is here. You five are the Power Rangers. Any other questions? We're more like Iron Man or Spider-Man. Nice. Could you just say something? Anything. Me and four kids found a spaceship buried underground. Whoa! Pretty sure I'm a superhero. What? Our guys? Five little Rangers. How cute. This is the hottest. They've got new hotness in here. Let's go. Yeah! Power Rangers! Now I'm going to say what we're all thinking Tim. What are we thinking Greg? That looks good. That looks like a fun movie. And Power Rangers was always bad. So this is very much like one of those things that... No but it's different though. This doesn't... It",
            "start": 332.84
        },
        {
            "text": "thinking Greg? That looks good. That looks like a fun movie. And Power Rangers was always bad. So this is very much like one of those things that... No but it's different though. This doesn't... It used to be bad but it was what it was. Dude doesn't this guy look like her golden little... Yeah that's Goldar. That's Goldar Kevin. That's Goldar. Whatever. I thought the other guy was better. And then the little mud monster thing. Alpha-5? No no no. Yeah Alpha-5 is upsetting. But the putty monster is like that... I don't like that look. What Alpha-5? No no. They showed Blue Ranger with his mask off and he's got like... Oh that's all that they're going to do. We're going to see their faces in the whole movie. It's going to be super rare when they have the shit on. It's going to be just like... That looks like he's like Topher Grace becoming Venom. Yeah yeah. And that's the whole thing. He's having a good time which I appreciate though. Does he? Yeah look at him. Oh man! I'm",
            "start": 407.64
        },
        {
            "text": "just like... That looks like he's like Topher Grace becoming Venom. Yeah yeah. And that's the whole thing. He's having a good time which I appreciate though. Does he? Yeah look at him. Oh man! I'm in a dragon! It's true. I call him Blue Balls. That was the Black Ranger. No it was clearly blue. I don't know if it was clearly blue around him. That was gray. Snarf, snarf I'm in a dragon! Looks like he's going... Right there that's his O face. Yeah. That's the one she keeps sucking at you nuts. I'll tell you what there is not an internet joke I appreciate more I think than when somebody screen caps something and then says when she keeps sucking. Fuck yeah. Very funny. Yeah right. Top story is something you put in here called Kevin Food. Yes. Last night me and one Gia Harris and her little sister went out to get food and they were trying to find some place back in my old hood where I grew up. There's some new place called Koja Kitchen. Does not look like this. It's much smaller",
            "start": 451.72
        },
        {
            "text": "little sister went out to get food and they were trying to find some place back in my old hood where I grew up. There's some new place called Koja Kitchen. Does not look like this. It's much smaller because it's in San Francisco. Holy shit Kevin you're going to love this food. If any of you are anywhere near a Koja Kitchen and you can go to this website and look for one because they're all over the place I recommend it highly. Kevin please scroll down. Please scroll down big Kev dog. So it's like a Korean-Japanese fusion situation we got going on but they got these foods Kev. They got these fries. They call them the Kamikaze Fries. They're fantastic. Whoa. Whoa you can see them get built. It's like everything you could ever want on your fries. You seeing this shit Greg? I'm seeing it. But more importantly is their burger situation what they call the Kojas. Try to go to the menu. Let's see if we can get some pictures of this because I saw them earlier. Breaking news right?",
            "start": 505.2
        },
        {
            "text": "it. But more importantly is their burger situation what they call the Kojas. Try to go to the menu. Let's see if we can get some pictures of this because I saw them earlier. Breaking news right? Fantastic. Is this the... Click on the San Francisco location. I don't want to know it's not hamburger. I don't care about Emeryville. They can suck it. Oh they don't have pictures. They don't have pictures. That's an issue. Go back to the front page. Hold on. They got an Instagram. Okay good. No. They're not even the beef that we like. You know? Yeah no. It's like the short ribs at the Hawaiian Drive-In. Yeah they don't have any pictures on the site. Give me a second. I'm going to... Imagine... I saw these fries. You were looking at them earlier. I know. I saw it earlier too. Go to the front page. Enhance. I wonder if there's like a slider. Oh there is. There is. There we go. There we go. That's what I'm talking about. That's what I'm talking about. The Short Rib Koja. So Kev it's",
            "start": 553.24
        },
        {
            "text": "page. Enhance. I wonder if there's like a slider. Oh there is. There is. There we go. There we go. That's what I'm talking about. That's what I'm talking about. The Short Rib Koja. So Kev it's the beef short ribs. Yeah. No bones. Yeah. In this little burger thing but guess what? Rice. It's like soy sauce rice. Oh you mean the bun. And actually it's hard. Yeah. Yeah yeah yeah. It's amazing. Where is this place? Let's find out for lunch. Fourth and Clement. Oh okay. Yeah. I got Paula's car. We can all fit. I'm just saying. Just saying. That shit's good. That shit's good. Okay. Well let me see. Show the fries. Keep clicking right and left there. No that's it. It's got two pictures. Really? Yeah. I for sure saw the fries somewhere. Oh my bad. I was wrong. I had those things. Our customer favorite side dish. Is this meat? That's meat. Yeah that's meat. Yeah. They got a whole bunch of beers and shit too. Okay. I think you'll like it Greg. Okay. I think you'll like it. Well",
            "start": 590.88
        },
        {
            "text": "customer favorite side dish. Is this meat? That's meat. Yeah that's meat. Yeah. They got a whole bunch of beers and shit too. Okay. I think you'll like it Greg. Okay. I think you'll like it. Well let's shut it down. Let's go. All right. You wanna hit the button? Hit the button. Put up the... Thank you for watching the show. We're going to Koja Kitchen. We'll Facebook stream it from there. Holiday roll. Are we done pretending we're leaving? No we're not. We should really do the show. We should know. You build the stories. You want us to lead? Yes I do. All right. First new story Kevin. Please pull it up. Yesterday over on NeoGaf somebody claimed that they had a Nintendo Switch. Fucking liars. And everyone's like you're a fucking liar. You piece of shit. A lot of people were tweeting about it to me like this guy really had it. He put videos up. He's like I don't want to put videos up because I feel like I might get in trouble. Yeah. And I don't want to get the store I got it",
            "start": 636.68
        },
        {
            "text": "about it to me like this guy really had it. He put videos up. He's like I don't want to put videos up because I feel like I might get in trouble. Yeah. And I don't want to get the store I got it from in trouble. And everyone's like oh you're such a fucking liar. And he's like well fine. I'll upload a video of that because I'm not a liar. And then here we go. I'm not arrested. Miyamoto came. Secret police. Beat him half to death. But anyway it's the first time that we're seeing the user interface in anything more than just an image. Right. Because there's been that one image going around. Oh yeah. So here we don't know too much more from seeing this but we do get to know what the little Switch turn on sound sounds like. You're quite good at turning me on. Am I going to hear it if I put on my things? Yeah. I hate that. You'll learn to love it. Now something I noticed no background music just on the menu. OK. Find that interesting. No need. Nintendo has been doing that shit",
            "start": 679.52
        },
        {
            "text": "I put on my things? Yeah. I hate that. You'll learn to love it. Now something I noticed no background music just on the menu. OK. Find that interesting. No need. Nintendo has been doing that shit forever. Yeah. Even PlayStation does that as well. Yeah. I like it. I always turn it off. So I don't. I like the music a lot. You're crazy. I hope that they figure that out especially because Nintendo's weird ass menu music's always been so dope. Sure. You can hit up the eShop all you want but that music's a jam. And that's why Drake sampled it. Yes. Yes. And Nintendo's music is so dope. I'm not going to lie. Yes. Yes. And the hit song Hotline Bling. And I just like I remember listening to this buying things off of me. Yeah buying shit see the little Pikmin run around. Yeah. There you go. Anyway so the main user interface this is the new section of it. The main interface is very similar to what you'd kind of expect but I'm happy that it's so clean. This is an adult Nintendo. Yeah.",
            "start": 715.04
        },
        {
            "text": "Anyway so the main user interface this is the new section of it. The main interface is very similar to what you'd kind of expect but I'm happy that it's so clean. This is an adult Nintendo. Yeah. Nintendo we haven't seen in possibly ever in terms of having menus on your console. Sure. Here's the games. Yeah. Let's do this. So there's like the five cover tabs are where the games go and then quickly you have access to it's hard to see because it's really far. Sure. It looks like messages store images controller brightness and power. Now the fact that the controller is its own thing makes me really happy. So the thing next to it is not brightness I assume it's settings. Okay. I assume it's an anus. It doesn't look like a gear. Okay. It's like a very wide anus. I enjoy this though because I feel like there's going to be a lot of controller hootenanny going on. Did you see him change the settings? Oh yeah you're right. It's system settings. So there's system settings and",
            "start": 760.32
        },
        {
            "text": "because I feel like there's going to be a lot of controller hootenanny going on. Did you see him change the settings? Oh yeah you're right. It's system settings. So there's system settings and something we learned from this video is there's a dark mode. You can make everything black. It'll save battery if it's dark right? Oh yeah sure. Probably yeah. That's what I'm going to do. Go forward a bit Kev. Just a little bit. I love black mode. He did it. I love dark mode. No one believed it was dark. I love black mode. So that's pretty much that. So we can pull up the next story Kev. What? I'm just saying this is how close we are to the Switch. No I know. They're in stores. Some guy stole it from Walmart or a mom and pop shop. Things are happening. We're really confused at what's going on from a games journalism side. We see Brian O'Connell holding one. We see GameSpot people with a box. It sounds like they send it to game journalists. The IGN people can",
            "start": 809.06
        },
        {
            "text": "confused at what's going on from a games journalism side. We see Brian O'Connell holding one. We see GameSpot people with a box. It sounds like they send it to game journalists. The IGN people can look at the console. What I had heard yesterday about the IGN thing was that that was just a visit from Nintendo that they hadn't had units sent to them. However then you wake up today and GameSpot UK I'm going to fuck that up the rest of my life. Can one of them please go out of business? Yeah. Don't worry. Sounds like they're on their way. Which one? GameSpot UK had the box and GameSpot US was doing a 1-2 Switch stream. I have no idea what's happening. Yeah. Who the hell knows? I don't know. But it means it's close. You can go to youtube.com/Kinda Funny Games to see a Let's Play of me and Greg playing 1-2 Switch and having a lot of damn fun. Sure. Yeah yeah. The samurai game the eat pussy game. The Nintendo World Championship. There was two matches for it. Right. It jumped. It",
            "start": 856.86
        },
        {
            "text": "and Greg playing 1-2 Switch and having a lot of damn fun. Sure. Yeah yeah. The samurai game the eat pussy game. The Nintendo World Championship. There was two matches for it. Right. It jumped. It jumped. But it came back. It came home. And then spoilers did it come back again? I'm still the champion. It's like it didn't even happen. It's the shortest Nintendo World Champion reign of all time. Yeah. I like the record's a record. You know what I mean? Yeah. What we've got right here is related to that last story. Yep. Now that we're getting so close to the Nintendo Switch coming out we're getting a bit more you know hard hitting facts about what can and can't happen. What's interesting about this little number over here that we're seeing on Konami's site for Super Bomberman R is all the different control options you got when you're playing Super Bomberman R. Super Bomberman R. But what's interesting if you'll scroll down Kev. I will sorry. Yeah. Is that middle image right",
            "start": 895.42
        },
        {
            "text": "all the different control options you got when you're playing Super Bomberman R. Super Bomberman R. But what's interesting if you'll scroll down Kev. I will sorry. Yeah. Is that middle image right there. I'm liking the fact that you can see you're playing eight player Bomberman using multiple Switches. Yeah. I like that that's an option. Okay. People were worried that if you're going to play eight you have to use the one. Gotcha. This is cool. You can kind of divide it up any which way that you want. Oh shit. Look internet. Oh wait. Does this middle one? Yeah. Local. That's cool. So we can play it on planes. Yep. Next. Yeah. You're just talking about the internet there? Yeah that's it. I just like that. Here's my question for you. They seem like and especially with the controller option being right on the menu they understand that this is complicated. Yeah. With this many you can play with one Joy-Con you can play with two Joy-Cons. There's a Pro Controller and there's a",
            "start": 938.58
        },
        {
            "text": "option being right on the menu they understand that this is complicated. Yeah. With this many you can play with one Joy-Con you can play with two Joy-Cons. There's a Pro Controller and there's a Joy-Con Grip. There's all this shit. No make this shit simple. Just make shit work. Make it fucking work. Sure. Of course. Here's my question for you. Yeah. Now I don't have the breadth of Switch knowledge that you do. I just want it here. Thank you very much. I want to play it. Yeah. I want to get my answers that way. Okay. The one question I have for you. Yes. Is that I think it was in it was some Mario Kart commercial whatever the hell it was I don't know trailer. Super cool commercial. Probably. Perhaps. Where people were playing local Mario Kart on different Switches but their screen was still split. Mm-hmm. Is that confirmed? Or is that just some stupid thing that happened in commercials? I don't know. Because that's dumb if I'm playing locally. Here's the thing. That is dumb.",
            "start": 984.46
        },
        {
            "text": "was still split. Mm-hmm. Is that confirmed? Or is that just some stupid thing that happened in commercials? I don't know. Because that's dumb if I'm playing locally. Here's the thing. That is dumb. Mm-hmm. Will they fix that for launch? I'm not sure they will. Because if you remember in Mario Kart 8 on the Wii U why the fuck if I was playing two player why didn't I have my own thing on the GamePad and why was it split? I don't know. Okay. I don't know. That's all. No I just want to know. It's upsetting. I hope they fix that shit. Sure. You'd imagine that they're thinking about it with things like this. Right. But then again video game companies make really weird decisions sometimes. Video game companies make really weird decisions. Tim is this... Now more good Nintendo news. What? I was going to ask you if this angle is better. I'll tell you what throws it off. And this is the same thing that happened when I sat in that seat. Is that you got to look at the camera. We all should",
            "start": 1025.64
        },
        {
            "text": "was going to ask you if this angle is better. I'll tell you what throws it off. And this is the same thing that happened when I sat in that seat. Is that you got to look at the camera. We all should just do the thing where we ignore each other. Oh well no. I set it up now. So looking at... Yeah but you asked Tim does this look right? And you're looking at Tim off screen which immediately makes it look wrong. Does this look right? I'm looking right at the camera. I know. We need to workshop it. We need to workshop it. I think you might need some... Some sort of borders. Why is he floating? Oh he's taking over my body. I don't like that. Me neither. This is awful. I mean I want to figure out something where you can come here. Just pop up. So that you can look at us. But like... The rogue says just remove the Kev Cam please. No. Go to hell rogue. Yep. See look you can just stay there and hang out with us. Oh my God. That's what we got to do. We got to do a different background",
            "start": 1070.04
        },
        {
            "text": "says just remove the KevCam please. No. Go to hell Rogue. Yep. See look you can just stay there and hang out with us. Oh my God. That's what we got to do. We got to do a different background where it's closer to a building and we put you in the window of the building back there. I like that. Let me work on that. Oh man. Okay the final Switch story of the day I think. Switch it up. But no one made. This is huge. Huge news here Greg. Okay. Let me pull this up so I can actually read the article. That's helpful. It is. Switch and IGN. The Nintendo Switch eShop purchases will be tied to a user account. Fuck yes. Now this might sound like a no shit thing. But this has been the biggest deal with Nintendo for the last decade at this point. That's an issue. They're fixing that shit. Let's get to this. Things you buy on the Nintendo Switch eShop will reportedly be associated with a user account rather than a specific piece of hardware. On current Nintendo systems you guys know how",
            "start": 1115.28
        },
        {
            "text": "get to this. Things you buy on the Nintendo Switch eShop will reportedly be associated with a user account rather than a specific piece of hardware. On current Nintendo systems you guys know how that shit works and it's not good. A NeoGAF user who received one of the new consoles early has apparently found a statement saying quote your Nintendo Account contains your Nintendo eShop purchase history and current balance. By relinking your Nintendo Account after initializing the console it will be possible to redownload any software or DLC purchased using that account. Software that has been discontinued may not be available for redownload in some cases. So it seems Nintendo has taken measures to catch up with the likes of Xbox PlayStation and Steam allowing you to download your purchases anywhere as long as you have your login details. Very smart. Good job Nintendo. Hooray. I'm very excited for Switch. Me too. And it's the brand newness sure and all that jazz. It's that newness.",
            "start": 1167.76
        },
        {
            "text": "anywhere as long as you have your login details. Very smart. Good job Nintendo. Hooray. I'm very excited for Switch. Me too. And it's the brand newness sure and all that jazz. It's that newness. I go to DICE next week. I was like this is my last plane ride without the Switch. Last trip I guess because I got to fly back from DICE. But I think about when we go to PAX I'm like I'm going to have this thing. I'm going to be able to play Zelda on the plane. That's pretty awesome. Switch it up. Switch it up. Do you know what you're going to wear when you're hosting the DICE Awards? I think I'm going to wear my Indochino suit. Ooh. I need to hit up Jess and see what color her dress is. Did you get that resized? I did yeah. Oh okay. I need to go back one more time. Let's leave. Yeah yeah. My little ones. We'll see. What I did is I didn't even go to Indochino. No way. I didn't have time. They're all the way downtown. I'm out here. I actually got it. I got the suit resized in Montreal.",
            "start": 1202.48
        },
        {
            "text": "My little ones. We'll see. What I did is I didn't even go to Indochino. No way. I didn't have time. They're all the way downtown. I'm out here. I actually got it. I got the suit resized in Montreal. That sounds wrong. You're so silly. Jen had to be there to translate because the lady was being friends. You took your money to France. No I took it to Canada. Yeah but it's mini France. It is mini France. It is mini France. That's a fun thing. That's un-American. They're all French kids when they meet you. I'm trying to work on a I don't know if I told you this I told Kevin already I'm trying to work on trying to get a sponsorship at a not a well like a suit place but also like a tux place trying to get Kevin's wedding sponsored. Nice. What you need to do is get a sponsorship at a TV place. So we got a new TV in here and we all get new TVs. Trust. I tried. I tried to work on that. You tried so hard. And it didn't work. Yeah. It nose dived. This is something we can do for Kevin's",
            "start": 1245.16
        },
        {
            "text": "place. So we got a new TV in here and we all get new TVs. Trust. I tried. I tried to work on that. You tried so hard. And it didn't work. Yeah. It nose dived. This is something we can do for Kevin's wedding suit. Kevin you want to make some money off this wedding right? I mean I wasn't initially planning that. Kevin wants to make some money off this wedding. We can reach out to all our video game development partner friends right? And then like at the reception there's just a room that's just all kiosks and stuff. People come in and they play whatever whatever State of Decay and they play you know if that's Xbox they play. Kevin's wedding fun room brought to you by Double Fine. Remember when you broke my heart and you were like I don't want to officiate your wedding. I know as I've said multiple times I don't remember that conversation and multiple times since then I've said I will do it. You really don't remember that conversation? No not at all. You 100% said that.",
            "start": 1281.08
        },
        {
            "text": "as I've said multiple times I don't remember that conversation and multiple times since then I've said I will do it. You really don't remember that conversation? No not at all. You 100% said that. Probably knowing you I was in the middle of 14 things and you walked over and stood next to me hovering until I finally said what? You said that and I said no. Is it my fault you're a busy fucking man? I mean you just know when you shouldn't approach me. I don't. The problem is how have you not noticed? I'm a snapping turtle. I'm a snapping turtle and it's pretty obvious when you're about to snap. Greg how have you not noticed that I have no tack for that? Like I have no idea. Well I know you have no tack period. Kev can you move yourself to the bottom middle of the screen? I don't like that at all. Then he's getting way too close to our dicks. Now he's... KevCam's the best investment kind of fun he's ever made. I don't know about that. Nah bigger. Yeah there you go. That's",
            "start": 1318.4
        },
        {
            "text": "like that at all. Then he's getting way too close to our dicks. Now he's... KevCam's the best investment kind of fun he's ever made. I don't know about that. Nah bigger. Yeah there you go. That's better. Perfect. Nailed it. What I think I like least about Kevin is how good he is at holding that face. Because oftentimes I think the camera's frozen and it hasn't frozen at all. It's just that he's holding it really tight there. Oh I don't like it. I thought it was going to go smaller. Oh my fucking God. Alright moving on from Nintendo. The next news story is about Xbox. Boo. What? So Phil Spencer head of Xbox over on Xbox. Friend of the show. Oh wait no he's never been on the show. He's a coward and he's afraid of me. He's said very nice things about us at the Final Fantasy event. He has said nice things. He is a very nice man. I'm not saying he doesn't... he isn't a nice person. I was joking around. I never get on the show for some reason. Yeah I was... And I think it's",
            "start": 1352.88
        },
        {
            "text": "He has said nice things. He is a very nice man. I'm not saying he doesn't... he isn't a nice person. I was joking around. I never get on the show for some reason. Yeah I was... And I think it's because Jeff Rubenstein hates me. Jeff Rubenstein is a nice guy too. I guess Major Nelson hates me. I think all these people are nice guys. Celebrating in a big Xbox 2017 games lineup. Like Kevin can you scroll? Yeah sorry. Those are a lot of words alright? Sure. None of these words are as important as... None of those words matter? Kevin can you control F? State of Decay is what you're looking for. And type in Scorpio. No. Okay? So if you look closely there's a line that says 2017 shaping up to be one of the most exciting years ever for Xbox gamers. We're preparing to launch the most powerful console ever made this holiday Project Scorpio along with the diverse lineup of games. So okay blah blah blah they say a bunch of bullshit. This is important because this is the first time",
            "start": 1407.32
        },
        {
            "text": "console ever made this holiday Project Scorpio along with the diverse lineup of games. So okay blah blah blah they say a bunch of bullshit. This is important because this is the first time since E3 last year that they have restated reassessed to the public... That this is happening. That Scorpio is happening this year. Okay. They're sticking to it. Good. Because we recently... We did the thing yeah yeah. Now back to the point of it. Will it really? Will it really? They said it about a whole bunch of things. I get it. That's what game developers do. They lie through their fucking teeth. Totally get it. I feel like this is a scenario where they don't need to do that. You know what I mean? It's a big difference. I think they're gonna want to hit that for sure. Now Kevin will you please go back to that article and control F State of Decay? Because that's really what we need to talk about of course. State of Decay ladies and gentlemen is happening. It is. Sea of Thieves",
            "start": 1443.6
        },
        {
            "text": "please go back to that article and control F State of Decay? Because that's really what we need to talk about of course. State of Decay ladies and gentlemen is happening. It is. Sea of Thieves and also all new chapters of fan favorite franchises like State of Decay and Crackdown 3. Sea of Thieves is currently in technical... No one cares about Sea of Thieves. We're gonna do less plays and it's gonna be awesome. You'd be a pirate. We're gonna do one less play I bet. Yeah exactly. It's probably gonna be like the Wildlands. We're gonna dress up as pirates. It's gonna be Switch Oliver and Nick's gonna be just falling off the boat being like out of his family. I can already tell you what it's going to be. It's gonna be me dressed as a pirate immediately giving up the game and giving off real life commands. Kevin make ye Cool Greg walk the plank. It will make Cool Greg come in and walk off a plank. I like it. Why wouldn't you just play the game right? Because I'm Captain",
            "start": 1482.52
        },
        {
            "text": "giving off real life commands. Kevin make ye Cool Greg walk the plank. It will make Cool Greg come in and walk off a plank. I like it. Why wouldn't you just play the game right? Because I'm Captain Pirate. The next news story is one that you put in there. I did. It's about God of War devs' canceled sci-fi game. Over at Sony Santa Monica yeah of course. Let's read this. This is from GameSpot. Oscar Deas. Oscar Deas Oscar Deas. That's a badass name. Oscar Deas Oscar Deas Oscar Deas. Images alleged to be concept art from Sony Santa Monica's canceled sci-fi game have leaked. The images were first spotted by NerdLeaks. NerdLeaks! I think that's a good thought. Which says the pictures were published by a former employee who was working on the game before leaving in 2014. The complete gallery has since been backed up on Imgur. I think that's how you say it. It is. Kevin will you go through the website? Imgur one of my favorite websites of all time. Give me some scrolls here okay? I",
            "start": 1515.2
        },
        {
            "text": "has since been backed up on Imgur. I think that's how you say it. It is. Kevin will you go through the website? Imgur one of my favorite websites of all time. Give me some scrolls here okay? I want to look through some of this while Tim reads. NerdLeaks goes on to reveal more information about the canceled project. The game was apparently futuristic with dinosaur-like enemies and a heavy emphasis on exploration. Some would say it was Horizon. Exactly. And interesting do you think that's part of the reason it was canceled? I wouldn't say. Holy shit I made that joke just reading the text and not even seeing. That's hilarious. The project which was apparently codenamed DarkSide was in development at God of War studio Sony Santa Monica. The game was canceled in 2014 after a round of layoffs at the company and had apparently been in development since God of War 3. It remains unclear why the project was canceled. Sony Santa Monica's current project is PS4's God of War announced at E3",
            "start": 1563.84
        },
        {
            "text": "at the company and had apparently been in development since God of War 3. It remains unclear why the project was canceled. Sony Santa Monica's current project is PS4's God of War announced at E3 2016. The game's director Cory Barlog says it will offer more diverse emotional palettes than previous God of War games. Barlog has previously spoken to GameSpot about the challenge of making people take Kratos seriously. He also talked about reinventing Kratos and the series perspective. We also know the game will be set after the events of the third game and it won't we already know. You wouldn't talk about God of War anymore. It's more interesting about this sci-fi game that got canceled because they were deep in this from everybody said. They've been working on it a long time and I do wonder how much of it has to do with I bet if I was a betting man because I have no inside information on this whatsoever but with my background on uncovering Sony I bet what happened is this gets",
            "start": 1603.12
        },
        {
            "text": "how much of it has to do with I bet if I was a betting man because I have no inside information on this whatsoever but with my background on uncovering Sony I bet what happened is this gets greenlit to go on and keep going. Horizon either gets greenlit at the same time or a little bit later depending on timelines or whatever because I guess this would have been first I think. But I bet this gets into trouble. They feel like it's not turning out the way they want to. Do they go back? Do they do this? Blah blah blah. Then Horizon they see proof of concept on that and they're like well let's just pull the plug on this. I can't have two games like this. They win because I've heard of that happening before at first parties. There was like a mermaid. No he was just wearing like oh oh yeah you're right. There it is. You see this like long neck whale slash octopus on the bottom there? And half long neck half whale half octopus. Whoa. A whale face. Holy shit. Oh no whale face.",
            "start": 1637.72
        },
        {
            "text": "yeah you're right. There it is. You see this like long neck whale slash octopus on the bottom there? And half long neck half whale half octopus. Whoa. A whale face. Holy shit. Oh no whale face. This is the dead thing we saw up here somewhere. There it is. They're doing something. There's a hole right there. Yeah Death Stranding had a whale too. Yeah? It's going to have a bunch of whales. What? I don't know what's happening. Why are you making the whale dance? Why are you making the whale dance? Do the whale dance. Do the whale dance. And we're done with this? Yeah we're done with that. Oh man. Oh man. Oh man. Oh man. Next story Kev. Greg this one's for you. Thank you. Sony files patent for what looks like a Switch-esque handheld. PS Switch question mark. And so right now from the chat about five minutes ago Ashford Alex said I'll endign it. Chances they don't even talk about the Sony patent. Go fuck yourself. Go fuck yourself. You hear that? Ban him. Or at least make him",
            "start": 1677.2
        },
        {
            "text": "chat about five minutes ago Ashford Alex said I'll endign it. Chances they don't even talk about the Sony patent. Go fuck yourself. Go fuck yourself. You hear that? Ban him. Or at least make him not talk. Ashford Alex actually. No no. Leave him alone. We don't do that. No we go hard. Challenge him to come here and fight me? Fight me. San Francisco. Anytime. Yeah. Okay. Is that it? We're done with this? It looks like Sony may be taking cues from Nintendo as the PlayStation manufacturers filed a patent for what looks like a new Switch-inspired handheld device as spotted by NeoGAF user Pompo. The patent was filed back in 2015 but was only just recently published. While controller pieces on the side look as though they may be detachable they aren't explicitly shown as being removable from the device. Like Nintendo Switch the device looks very much like a tablet with blah blah. Okay cool. I don't know what this looks like. We're not stupid. It's important to note that not all",
            "start": 1730.7
        },
        {
            "text": "from the device. Like Nintendo Switch the device looks very much like a tablet with blah blah. Okay cool. I don't know what this looks like. We're not stupid. It's important to note that not all patents ended up becoming products last year. Sony filed multiple patents for a glove controller that the company has yet to announce or discuss in any event. In years before that remember they had a DualShock that had the Move balls on top of it that then broke apart to be like this. Move balls. We're fucked. Move balls. So yeah this could just be something that is being filed. And again yeah filed back in 2015. I don't know if it's... Yeah. They're oh they're copying Switch which everybody wants to jump to but interesting enough to see. Looks cool. They would definitely not do it actually probably. Yeah. But I mean then again... Sony would be crazy. Shuhei Yoshida would be a crazy motherfucker. When Move came out it's like are they really doing this right now? But they did.",
            "start": 1777.86
        },
        {
            "text": "probably. Yeah. But I mean then again... Sony would be crazy. Shuhei Yoshida would be a crazy motherfucker. When Move came out it's like are they really doing this right now? But they did. They did. That was a misstep. That was not something they should have done. Mega Bloks. Mega Bloks. So this is in the world's biggest disappointing news story of the day. Wow biggest disappointing news story? Biggest disappointing. This one's big Greg. That one's disappointing. Pokémon Mega Bloks are coming. What's disappointing about this is they're Mega Bloks. That means they're not LEGOs. It means they're not LEGOs. Yeah. I mean come the fuck on. First off scroll up Kev. Look at that Pikachu. Did you catch them all? Fuck yourself. Okay. This is some bullshit. Some fucking bullshit. That thing looks stupid as all hell. Then that Poké Ball. Yeah. Oh we're just going to take a Poké Ball and add a couple little blocks on the top of it? That looks stupid as shit. I do believe they're Mega",
            "start": 1813.54
        },
        {
            "text": "looks stupid as all hell. Then that Poké Ball. Yeah. Oh we're just going to take a Poké Ball and add a couple little blocks on the top of it? That looks stupid as shit. I do believe they're Mega Bloks. Scroll down. I do believe they're Mega Bloks on top of them. That shit looks dope though. I can't even hate on this. Charizard? No. That's all that we got. That's all they got. But I mean it's like fun. Did you see the little fucking Master Ball? That Master Ball? That's not a Master Ball. What's that called then? Ultra Ball? Super. Boner Ball. No I think it's Ultra. It's the one you fuck. No that was an A. Anyways very upsetting. Very upsetting. Enjoy that shit if you like. And it was fun-tastic. You're one of those dumb kids. You want to read some tips Greg? Sure. Ladies and gentlemen if I read your name here you've tipped us and I'll read you a little message as well because you leave little messages when you leave those little tips. I like it a lot. Ziglitz said fun clip",
            "start": 1859.64
        },
        {
            "text": "if I read your name here you've tipped us and I'll read you a little message as well because you leave little messages when you leave those little tips. I like it a lot. Ziglitz said fun clip baby. I left a YouTube link. Fun clip baby. I'll tell you what Kevin it's Friday. Go ahead. Fucking hit it up. Let's see what happens. Let's see if it happens. Now who would want to see this? No do it right now. Fun clip it up. Do it right now. Cincy Boiler gave us tips and said did my taxes today so I figure it's only fair to throw some vacation day tax your way. Man people doing their taxes early. That was a healthy tip. Thank you very much Cincy Boiler. People doing their taxes. People doing their fucking early. You and me doing them like April 11th. I know right? Wow you guys got to get on top of that man. I always do my taxes early. I'm probably going to do it next weekend. Nah I'm just going to send it to the guy. The problem is I always have there's always somebody waiting",
            "start": 1897.2
        },
        {
            "text": "get on top of that man. I always do my taxes early. I'm probably going to do it next weekend. Nah I'm just going to send it to the guy. The problem is I always have there's always somebody waiting still. Yeah. I've done enough little freelance shit here and there. People are saying it's a great ball not an Ultra Ball. My bad. I'm saying it's a sex ball. Smitty Jay says apparently the link I added to my 4 month resub message was bootleg. Greg and Tim happy 4 month anniversary. Then he gives us a photo link here that is also FUBAR'd that goes nowhere. FUBAR. We're trying to do we don't want it apparently. God has stepped in. Do you have this fun clip ready? No. Okay. Over on the tips. CR1S1 which is like crisis but Crisis. What's up Greg Tim and Kev? You didn't say what's up. What's up? I was wondering if you can tell my friend Alucard Fury who is a fan of you guys and thanks to him you all have a new fan here to please play a tabletop game with me. Of you guys.",
            "start": 1931.24
        },
        {
            "text": "up. What's up? I was wondering if you can tell my friend Alucard Fury who is a fan of you guys and thanks to him you all have a new fan here to please play a tabletop game with me. Of you guys. Well Alucard Fury no. Do not play a tabletop with your friend CR1S1. Here's the problem with tabletops. These games these tabletop games right? We perfected them. We call them video games. You can go play a video game. You don't have to sit here and roll your dice and do your math and envision things are happening. You can fucking look at it on a screen. You want to fuck that person you fuck them in the video game. You have to imagine this. You can see it. You might not be talking about Dungeons & Dragons. You might just be talking about other types of... Settlers of Catan. Take a ride. Like King of Tokyo. What the fuck is King of Tokyo? You always talk about that game. Can we just play it once? Can you bring it as a topic? No I think this is just on our own. It would be fun. It",
            "start": 1975.76
        },
        {
            "text": "Like King of Tokyo. What the fuck is King of Tokyo? You always talk about that game. Can we just play it once? Can you bring it as a topic? No I think this is just on our own. It would be fun. It would be fun. Let me just play it together. You got this one clip? Fun clip. Fun clip from Zee Giglet. Are you ready? We are ready. Fun times in Cleveland again. Still Cleveland. This is the definition of a fun clip. Come on down to Cleveland Town everyone. Under construction since 1868. See our river that catches on fire. It's so polluted that all our fish have AIDS. We see the sun almost three times a year. This guy has at least two DUIs. The flats look like a Scooby-Doo ghost town. Don't slow down in East Cleveland or you'll die. Our economy's based on LeBron James. Buy a house for the price of a VCR. Our main export is crippling depression. We're so retarded that we think this is art. It could be worse though at least we're not Detroit. Damn okay. We're not Detroit. That was good. I",
            "start": 2023.16
        },
        {
            "text": "of a VCR. Our main export is crippling depression. We're so retarded that we think this is art. It could be worse though at least we're not Detroit. Damn okay. We're not Detroit. That was good. I like how it's called suck and attempt. There we go. That was great. That was great. That was great. Good job. Good job. Good job. Zee Giglet. Giglet. Gillette. Zee Gillette. I think that's probably how he wants it pronounced but he can go to hell. That's what I say. Am I right or am I wrong? Josh Anderson gave a tip and said hi guys. Continuing from yesterday. My gift was the folder with the green dog bone for Porty fan art and thank you letter. Anyways I'd like to thank you both for encouraging me to upload my RE7 review and more. No problem. Thank you for context. Yes your fan art is in the other room. Porty did not get your dog bone because he doesn't chew rubbery things. One of the people at RTX Sydney had a dog that chews rubbery things. He took it. Porty will eat the rubber and",
            "start": 2078.5
        },
        {
            "text": "room. Porty did not get your dog bone because he doesn't chew rubbery things. One of the people at RTX Sydney had a dog that chews rubbery things. He took it. Porty will eat the rubber and then I got to make him barf. It's a whole thing. How do you make him barf? But here's what I'll let you know about your fan art. It was viewed by none other than Tim Schafer yesterday. It's true. Because I have hidden one of the fan arts in the office. What? Tim Schafer made a comment about something. Something got moved and there was the fan art. So now me Tim Schafer and Nick Scarpino know where the one fan art is hidden. Do you want to guess what I have hidden in the body? In the... dammit. In the body? Did you say do you want to know what I have hidden in the body? I'm sure it's semen and that was going to be my guess when I thought you were going to say what's hidden in the office. May Swinton do. Star Wars names are hard to remember. Especially because we haven't seen him since episode",
            "start": 2130.62
        },
        {
            "text": "was going to be my guess when I thought you were going to say what's hidden in the office. Mace Windu. Star Wars names are hard to remember. Especially because we haven't seen him since Episode One. Not Mace Windu. Oh Qui-Gon. Oh okay. So we haven't talked about him. He's awesome. He is awesome. I keep looking at you guys and that's not okay. Did you guys hear about Jar Jar? No. I'm not going to spoil anything but there's a canon book coming out in like two weeks where there's a chapter about what Jar Jar's been up to and it's really funny and depressing. Can you just tell me? Can we mute the thing? I'll talk to you later. Yeah I'm in. Glad he got what he deserved. Sorry podcast audio people. I'm sure you lost. Remember this is a podcast. You can download it. Where? iTunes. Soundcloud.com/Kinda Funny Morning Show. Podcast services are on the way. Josh Anderson. My favorite 17 year old I know. Wow. And you've had sex with a lot of 17 year olds. I can say I know I",
            "start": 2175.98
        },
        {
            "text": "slash Kinda Funny Morning Show. Podcast services are on the way. Josh Anderson. My favorite 17 year old I know. Wow. And you've had sex with a lot of 17 year olds. I can say I know I haven't no. But I can say that. I don't know any other 17 year olds that like confirmed are 17. How many times when you're getting ready for bed do you tell Gia to pretend she's 17? I don't need to tell her. Kcrust09 gave it to him and said tonight me and thousands of Penn State students will start our 46 hour dance marathon to end pediatric cancer. Anyone who can please donate at donate.thon.org because childhood cancer sucks. It does. Go get them Kcrust09. Dance to some Katy Perry. Petey Popoff gave a tip and said late birthday tax from yesterday. Love you guys and thank you for all the entertainment. Hopefully I'll get to make the trip from New York to Kinda Funny Live 3 and get to hang out with you and the fellow best friends. Should. It'll be fun. It'll be worth it. I promise. Alex Aziz gave",
            "start": 2233.9
        },
        {
            "text": "Hopefully I'll get to make the trip from New York to Kinda Funny Live 3 and get to hang out with you and the fellow best friends. Should. It'll be fun. It'll be worth it. I promise. Alex Aziz gave us a heart. Alex Aziz. Prez Presh Till Death said hail Satan in all caps. Okay. Night Boogie said Greg I mastered your wings recipe but went on a diet soon after. I cook depressing ass shit now. I fucked up. Were the wings and fries pics you posted yesterday homemade? If so you're killing the cooking game. Alright so number one the baked wings can't be that bad for you. I have nothing to back that up. I look better people say and I eat them every week so I think you can get away with still eating them. Don't be depressed. Number two no. Wings and fries last night were ordered out from Hot Sauce and Panko. Hot Sauce and Panko. Those wing wings was closed for Immigrants Day. It's a wing restaurant. Oh we went to get burritos yesterday and they were closed. Yeah. Oh does Charles close",
            "start": 2283.88
        },
        {
            "text": "Sauce and Panko. Hot Sauce and Panko. Those wing wings was closed for Immigrants Day. It's a wing restaurant. Oh we went to get burritos yesterday and they were closed. Yeah. Oh does Charles close too? Yeah so we went to Chipotle. That makes more sense yeah because I was wondering why. Yeah I do have a recipe for fries like that but those fries are out of this world. The wings fine. It was one of those so unsatisfying that I'm going to wing wings at some point this weekend for sure. Now is that any different than a normal weekend? No. Because that's going to be my treat. Playing a game for a review. Want to beat it so I can review it. Embargo. Once I beat it then I'm going to go breath go watch Lego Batman eat some goddamn wing wings. You see Andy Cortez's dude 30 seconds review. No because I don't want Lego Batman ruined. I saw it with no sound down where he had the car on and then he did this. It was good. I was like fuck is he funny? He's a funny little guy. I ain't a",
            "start": 2324.44
        },
        {
            "text": "No because I don't want Lego Batman ruined. I saw it with no sound down where he had the car on and then he did this. It was good. I was like fuck is he funny? He's a funny little guy. I ain't a ... Just an asshole. People are asking what Immigrants Day is and to be clear it's A Day Without Immigrants. Yeah well I know. It's just a short name. So it was like a protest. Yeah but it was a very different thing. It's a business movement that's anti-Trump's policies of hey this is what America would look like if you threw out all the immigrants in it. So basically anybody who was running not anybody but local restaurants that have or small restaurants that aren't a chain I'm saying that have an immigrant base closed down in solidarity to say this is what it would look like if there were no immigrants. What it looks like is we go to different places to eat and those businesses go out of business. Which sucks. It's really tough for us. I know. I was very upset. I really want",
            "start": 2366.76
        },
        {
            "text": "were no immigrants. What it looks like is we go to different places to eat and those businesses go out of business. Which sucks. It's really tough for us. I know. I was very upset. I really want to go to wing wings. I still do. Wing wings did it too? Yeah of course they did. Wing wings sells a shirt in Spanish that's like fuck Trump or whatever. Trust me. Do they? I forget what it actually says but it's something blah blah blah Trump. And one time I was there all drunk and I- Blah blah blah with kind of like a- An accent to goo. A little thing they put over the U. I don't know. Let's go back to the news and I'll get you more tips when you need them. Because there's tons of tips here. Going back to the news. Bah bah bah bah. I like that my hair looks so good when I left today. But then it got a little wet with the rain. It's raining. Now it looks bad. YouTube's killing one of its most obtrusive ad formats. The Google owned video service said Friday that it was going to phase out",
            "start": 2401.26
        },
        {
            "text": "it got a little wet with the rain. It's raining. Now it looks bad. YouTube's killing one of its most obtrusive ad formats. The Google owned video service said Friday that it was going to phase out unskippable 30 second pre-rolls by next year. British advertising magazine Campaign was first to report the news Friday noting that the site would still offer shorter pre-roll ads that can't be skipped by viewers. These include 0 second ad clips as well as 6 second bumper ad format that YouTube introduced about a year ago. A YouTube spokesperson confirmed the move when contacted by Variety with the following statement we're committed to providing a better ad experience for users online. As part of that we decided to stop supporting 30 second unskippable ads and as of 018 we'll focus instead on formats that work well for both users and advertisers. Good. Cool. Yeah. Those ones were the worst ones when you had to get them. I feel like I've been getting a ton lately. Really? Yeah where I",
            "start": 2445.2
        },
        {
            "text": "on formats that work well for both users and advertisers. Good. Cool. Yeah. Those ones were the worst ones when you had to get them. I feel like I've been getting a ton lately. Really? Yeah where I just can't skip this one. I get a lot of like 1 second ads that are unskippable. Like eh whatever. How is YouTube Red doing? Did that take off? I mean it's making them money and they're investing still. Okay. Pulling shit from PewDiePie but. Well yeah yeah yeah. They'll come back. They'll make up. They'll come back. They always come back. They always come back. Next story. You just called this wrestling drama. Yeah. This is just a stupid story. Being this weird think of it this way. Think about how weird this is. Former WWE star Dwayne \"The Rock\" Johnson goes off on HBO and makes Ballers a show like dramatizing the NFL. Starz says oh yeah fuck you. We're going to go make a show dramatizing wrestling. I think it's funny. I don't know if you'll ever get it off. It's not. It's just",
            "start": 2484.2
        },
        {
            "text": "a show like dramatizing the NFL. Starz says oh yeah fuck you. We're going to go make a show dramatizing wrestling. I think it's funny. I don't know if you'll ever get it off. It's not. It's just getting ordered. There's no real details on it. But I totally would be down for a soap opera behind the scenes of a WWE style thing. Yeah. But isn't that what WWE is already? Yeah but I mean you actually have to watch the wrestling. You know what I mean? Like this cuts out the stuff that I don't want to watch with professional wrestling. I'm sure I'm going to get the awesome move this great ending to a match. And then they're back there and it turns out this guy's cheating. This guy's doing steroids. Vince McMahon's or whoever. I'm sorry. Vince McMahon is starting the Ref-a-Rafael. I can write this for you ladies and gentlemen. Turn over the credit for me. Starz. Segueing into another wrestling story. A sad one. Very sad. George \"The Animal\" Steele passed away. That sucks. George \"The Animal\" Steele",
            "start": 2528.2
        },
        {
            "text": "this for you ladies and gentlemen. Turn over the credit for me. Starz. Segueing into another wrestling story. A sad one. Very sad. George \"The Animal\" Steele passed away. That sucks. George \"The Animal\" Steele was awesome. I remember being terrified of him as a child. Because he'd eat the turnbuckle. He'd get in there and then go gnaw on the turnbuckle and you're like this guy is legitimately crazy. But he was awesome. What 67? I think it's up in the top there. 79. 79. Close enough. He ate too much turnbuckle. That was one of his shticks. His tongue looked like it. Can I scroll down a bit? There was no other images. Yeah there was. Oh I am so sorry. Classy Freddie Blassie. What's his name? Classy Freddie Blassie. This stuff is so old that I don't even have like a... You didn't grow up on this. Well yeah you grew up like what? Way later. Yeah way later. I'm all... So rest in peace George \"The Animal\" Steele. Yeah rest in peace full show. Final news story of the day. It's from BuzzFeed. It's called",
            "start": 2571.2
        },
        {
            "text": "yeah you grew up like what? Way later. Yeah way later. I'm all... So rest in peace George \"The Animal\" Steele. Yeah rest in peace full show. Final news story of the day. It's from BuzzFeed. It's called Helping You See Outside Your Bubble. A new feature on some of BuzzFeed's most widely shared articles. BuzzFeed News is launching an experiment this week called Outside Your Bubble an attempt to give our audience a glimpse of what's happening outside their own social media spaces. The Outside Your Bubble feature will appear as a module at the bottom of some widely shared news articles and will pull in what people are saying about the piece on Twitter Facebook Reddit the web and other platforms. It's a response to the reality that often the same story will have two or three distinct and siloed conversations taking place around it on social media where people talk to the like-minded without even being aware of the other perspectives of the same reporting. Our goal is to give readers a",
            "start": 2619.2
        },
        {
            "text": "conversations taking place around it on social media where people talk to the like-minded without even being aware of the other perspectives of the same reporting. Our goal is to give readers a sense of these conversations around an article and to add a kind of transparency that's been lost in the rise of social media-driven filter bubbles. We view it in part as a way to amplify the work of BuzzFeed News reporters and to add for readers a sense of the context in which news lives now. If you think there's a relevant viewpoint we're missing you can contact the curator at Bubbles@BuzzFeed whatever. I think this is cool. It's an interesting idea. I've heard other things too in a less official capacity where Facebook was you know talking about doing something where there's all the trending news that's curated for you. Also adding in stories that are not curated for you on purpose just to get them in there. Sure. Try to diversify your newsfeed. Yeah it's cool. It's cool that we're",
            "start": 2659.2
        },
        {
            "text": "news that's curated for you. Also adding in stories that are not curated for you on purpose just to get them in there. Sure. Try to diversify your newsfeed. Yeah it's cool. It's cool that we're adapting. We are growing. We've seen that there was a problem. Yeah we're seeing there's a problem when everything is a little too curated so it's like cool. I'm interested to see it work and how it actually brings in an outside opinion and it's not just that I'm liberal thinking I'm reading BuzzFeed with a liberal side. BuzzFeed with a liberal side and the only people tweeting about it are liberals so that's what's getting you know what I mean? But I mean it's not because there's always the people that are talking the mad shit about it. Yeah I know. So that's what they're calling it. I want it to be... I'm sure they know where to find their haters right? But it can't just be haters. If we wanted to do it for us we'd go to NeoGAF and find the threats and just pull that shit in. NeoGAF?",
            "start": 2695.2
        },
        {
            "text": "it to be... I'm sure they know where to find their haters right? But it can't just be haters. If we wanted to do it for us we'd go to NeoGAF and find the threats and just pull that shit in. NeoGAF? Very nice to Greg Miller quite a bit. Not all the time but most of the time. How you doing GAF? I stopped by. I like GAF. I love it. I can look at GAF all the time. I think it's my most visited website. Yeah. But you know they don't like us. They like me. Again I'm saying they like Greg Miller. They don't really care about me. So I'm fine. All right doorbell's here. Go get it. What? For the next... Go get the doorbell! For the next two weeks every doorbell could be the Nintendo Switch. So everything stops until it gets here. Mm mm mm mm mm mm mm mm mm. Because one day that Switch is gonna come. And I'm gonna be stoked. Beyond Freshkin says you're only a snowflake if you use BuzzFeed not if you're against BuzzFeed. I said sarcasm. I don't understand. That's the end of the",
            "start": 2736.2
        },
        {
            "text": "is gonna come. And I'm gonna be stoked. Beyond Freshkin says you're only a snowflake if you use BuzzFeed not if you're against BuzzFeed. I said sarcasm. I don't understand. That's the end of the news Greg. I said we're waiting to find out if the doorbell is the Nintendo Switch. It wasn't. What was it? Like a... It was something else. Is it for me? No. Did I tell you I got my Leatherman the other day? Yeah I remember that. I was on that show and I thought it might be a Switch coming again. And it wasn't. It was you getting a Leatherman. People are asking if NeoGAF likes Nick. They also don't care about him. Big fan of Kevin though. Surprising. Who isn't a big fan of Kevin? You kidding me? No let's not. Ladies and gentlemen this is the Kinda Funny Morning Show. Each and every weekday here on Twitch.tv/Kinda Funny Games. We come to you with the nerdy news you need to know about before jumping into the chat to answer your questions comments and concerns. But in between",
            "start": 2781.2
        },
        {
            "text": "here on Twitch.tv/Kinda Funny Games. We come to you with the nerdy news you need to know about before jumping into the chat to answer your questions comments and concerns. But in between those two segments I reach into the computer grab a video game toss it out to one of you. How do you win? It's simple. Tim explain it while I get a video game. You can win in four different ways. One is be in the chat right here on Twitch.tv/Kinda Funny Games. Two is be a subscriber on Twitch.tv/Kinda Funny Games. If you have an Amazon Prime account that's easy. You can be at Twitch Prime for free. Free being part of your subscription you already pay for. That'd be cool. You should probably do it. We just received a BarkBox. You can bring it out here. I'll open up the BarkBox. We'll see what party you got. Then you can come for the second screen experience later. The other way to win is to go into Patreon.com/Kinda Funny at the $ or above level. The last way is go into",
            "start": 2832.2
        },
        {
            "text": "see what party you got. Then you can come for the second screen experience later. The other way to win is to go into Patreon.com/Kinda Funny at the $ or above level. The last way is go into Patreon.com/Kinda Funny Games at the $ or above level. There it is. Four ways to win. Oh god damn it. You can do all of them at once. Oh my god Kevin. Oh lord Kevin with the back rubs. Alright so random number generator set. It's going to be a Twitch sub. Twitch sub. I don't think I've done recently so that's good to see that win. People from the Twitch chat have won. I haven't seen a Twitch sub win in a while. Twitch sub winning. Twitch sub. The winner is T-Chuckles4. T-Chuckles4 you have won Super Gun World on the PlayStation 4. Of course developed by Kinda Funny best friend who put a Kinda Funny best friend in the game. It's part of our Extra Life. So you can check your Twitch messages T-Chuckles4. It is in there. Enjoy it. If you're watching later on check your",
            "start": 2867.2
        },
        {
            "text": "who put a Kinda Funny best friend in the game. It's part of our Extra Life. So you can check your Twitch messages T-Chuckles4. It is in there. Enjoy it. If you're watching later on check your Twitch messages. Check damn Twitch messages. Let's see what Porty got over here. While you do that I'm going to read the tips. Why do you steal Porty's moments all the time? Ooh look at it. This is a safari tour. Oh my god he's going to love it. Holy shit. Kev can you do Skycam? Yeah give me two seconds. It's a safari Kevin. It's a sniffing safari Kevin. Sniffing safari? Porty loves to sniff. I love you sniffing safari. We got that right there right? Sniffing if you were here. This thing. Oh crap. Look at this. This guy. Oh it's a ball constrictor killing a man. How cute. This man is dying. Talk to the licking stone I presume. All right. This is oh wow. Ooh. It's a hungry hungry hippo. That's a big ass hippo with a big ass tail. Then we got just the",
            "start": 2911.2
        },
        {
            "text": "man. How cute. This man is dying. Talk to the licking stone I presume. All right. This is oh wow. Ooh. It's a hungry hungry hippo. That's a big ass hippo with a big ass tail. Then we got just the head of a lion. Uh oh. Porty's going to feel like a badass. There's Porty hype going on in the chat. We got this one here. Butchers block bones. Some crunchy tubes. My thing is how long do you think it's going to take before Kevin starts gnawing on dog food like this? Like I said it's very clearly there. First off made in the USA right? But not for human consumption. Do not use on carpets. Oh what? Really? Fuck. My whole house is a carpet. What does that mean? Why is it not oh do you think it grabs carpet fibers? Maybe yeah. Well we're not giving that to Porty man. But everything else is cool. Thanks BarkBox. So this reminds me of something Greg. A couple days ago you were talking about a game called Snake Pass. Yeah. And I've never heard of it. Oh yeah? And then I was like",
            "start": 2960.2
        },
        {
            "text": "is cool. Thanks BarkBox. So this reminds me of something Greg. A couple days ago you were talking about a game called Snake Pass. Yeah. And I've never heard of it. Oh yeah? And then I was like that for some reason I want to YouTube this and see what's up. Yeah. That shit looks dope as fuck. Greg Miller early books great let's plays for Kinda Funny. Music composed by David Wise. One of the greatest game music composers of all time. You might know him from Donkey Kong Country 1. I think he did 3. I don't really care about 3. He also did Tropical Freeze and that shit's dope as fuck. Cool. This music's amazing. They're coming in GDC week. I'm excited. That game looks sick. Yeah. You can do let's play with us. What I basically was going to have them do is jump into the heart. It's physics based. You know what I mean? I'm just going to jump into the heart stuff and then give the controller to Nick. I want them to show us the basics. Like all right here's what they do. I'll be",
            "start": 3007.2
        },
        {
            "text": "physics based. You know what I mean? I'm just going to jump into the heart stuff and then give the controller to Nick. I want them to show us the basics. Like all right here's what they do. I'll be like I'll do the first few. Don't tell Nick anybody. I'll do the first few levels and I'll just do them real quick with you know like oh thanks. All right Nick you try. Oh no. And he's getting all angry in that game. There's a snake in my boot. Pulsing his head. Continuing with the tips before we jump into the chat. Carmel Camaro says got a test today in Econ? Wish me luck. Also Hail Colin. Hail Colin and good luck on your Econ test. Earth Gracer says as someone from the Cleveland area everything from that video is true. I need to break the F out of here. Anonymous gave us a tip and said hey friends thinking of changing up careers here. Currently working at a software computer from home. Oh I'm currently working at a software company from home. Struggling to get through",
            "start": 3049.2
        },
        {
            "text": "and said hey friends thinking of changing up careers here. Currently working at a software computer from home. Oh I'm currently working at a software company from home. Struggling to get through some days. Thoughts on how to find a new path. Thanks for the laughs. What do you like to do? What are your applicable skills? I would apply all those to this. No? Yes? OK good. You weren't listening. I wasn't listening. I was researching. That's a good. I was listening. Yeah. That all makes sense. Good. There you go. You nailed it. David Wise did work on Donkey Kong Country 3 but he was just helping out this other woman named Evelyn Fisher who did most of the tracks. OK. PimpinPenguin96 which is a great username says hey guys I just got off the phone with my first interview for an internship and I'm feeling alive. Fingers crossed. How are your days going? I woke up tired as fuck kept sleeping stayed up late playing a game last night. Excited to get home and play more of that",
            "start": 3085.96
        },
        {
            "text": "and I'm feeling alive. Fingers crossed. How are your days going? I woke up tired as fuck kept sleeping stayed up late playing a game last night. Excited to get home and play more of that game. Excited to go to Wing Wings and Lego Batman at some point. I'm doing pretty well though. What game are we playing? Huh? What game are we playing? Can't tell you that. Can't talk to you about that. How's your day going Tim? My day's going great. I'm hungry. Yeah? Yeah. It's cool. We're going to that Kojo place. Do you have the clips prepared here? Because you got some clips coming in. I certainly do. First one is from Matty G. Says short and sweet seven second clip. Greg enjoy your embargoed games this weekend. And Tim just keep doing your thing. I'm going to keep doing my thing. Oh OK. Give me two seconds. Oh my God. There we go. Perfect. Fun clips? Doom trailer leaked. Ready? Ready? Yeah. Jesus fucking God. Show it to me. Show it again. Show it again. Show it again. Show it again.",
            "start": 3130.2
        },
        {
            "text": "me two seconds. Oh my God. There we go. Perfect. Fun clips? Doom trailer leaked. Ready? Ready? Yeah. Jesus fucking God. Show it to me. Show it again. Show it again. Show it again. Show it again. What was the plan here? What was the plan with that? The next fun clip comes from Ryan as a Champ. He says got that fun clip over here. Ready? Yeah. Hi. Hi. That was dumb. Oh man. Next tip comes from NomadSiphier. First time watching live. My son is playing Mario Run on the couch next to me. Thanks for not making me a liar when I tell people I have a best friend. We got you. And that's why you had kids too. Now you have a real life best friend they can't get away from you until he's 18. McLovin434 says have had a rough week this week but getting a chance to see this live show is always a plus. Love you guys. Here's a clip of my favorite wrestler wrestling a nine year old. Okay? Oh I'm very excited about this. Oh yay. Cleanest kid's pot. That's awesome. I tell you man the one thing I",
            "start": 3169.2
        },
        {
            "text": "Love you guys. Here's a clip of my favorite wrestler wrestling a nine year old. Okay? Oh I'm very excited about this. Oh yay. Cleanest kid's pot. That's awesome. I tell you man the one thing I can't believe I've never done when I've gone to Japan especially when I was there a week I never went and saw professional wrestling. I don't know why I didn't think to do it. I don't know what was I mean I was there with other people I know so other things but yeah whatever. Next time. Next time I'm going. Josh Anderson gave a tip and said hey guys. Hey guys. Hey guys again. I got the Kinda Funny mashup with The Simpsons edit for fun clips. Thanks for being the best inspirations ever. I'm going to put the hashtag Bongo that Kevin Doggo. Kevin Doggo. And this is it. If you don't remember a few weeks or days ago this is my reaction to the whole trying to save the Suicide Squad movie and how everything was ruined and Batman leaving. I guess it was just Batman leaving. I don't",
            "start": 3234.2
        },
        {
            "text": "remember a few weeks or days ago this is my reaction to the whole trying to save the Suicide Squad movie and how everything was ruined and Batman leaving. I guess it was just Batman leaving. I don't hear anything but. Oh yeah. I was just having you because it's just the audio from. Simpsons. It's still good. It's still good. Let me just put our faces on it. It's very good. No you're muted. We don't want to get the copyright strike. Okay. You asked. Kevin says pick a number between one and ten. Kevin. Six. Nine. The correct answer is three because you three are awesome. Smiley emoji. That was cool. That was a fun little twist. Whiplash94 said hey fellas here's a hilarious clip that has six million views but deserves more. Have a great weekend guys. Oh shit. We showing this? Yeah. All right. We're not watching the whole thing because this is a stupid two and a half minute video. Oh. What's this channel? Chris Capel. Yeah. I've seen this a long time ago. Let's use the",
            "start": 3284.2
        },
        {
            "text": "Yeah. All right. We're not watching the whole thing because this is a stupid two and a half minute video. Oh. What's this channel? Chris Capel. Yeah. I've seen this a long time ago. Let's use the problem when you send in a six million clip. That's as cool as I thought it would be. Yeah I don't like it. Cut it. I want to play. Kiki Longjohn says hi guys. Can't wait for the Switch. Colin banned someone in the chat on Wednesday for a fun clip from a New Zealand soap opera. Can we have your verdict? Yes you're banned. I'd like to see it. Damn it we're watching the fucking clip now. No but it's the clip of us watching the clip. What? You see this? What the fuck? I don't want to see it. That's not a fun clip. That's one of our clips. This is inception clip. We're not fun at all. We're kind of fun. I don't want to hear Kevin again. Kevin cut it. I don't like it. Everyone ban Kiki Longjohn. There's dashes between the words. That's the final tip. We're calling tips no more tips. Tips",
            "start": 3329.2
        },
        {
            "text": "of fun. I don't want to hear Kevin again. Kevin cut it. I don't like it. Everyone ban Kiki Longjohn. There's dashes between the words. That's the final tip. We're calling tips no more tips. Tips have been banned. Damn it. Sorry We Are gets the final tip in as I said that. The embargo for redacted lifts on Monday. Are you guys going to have any content up when it lifts or are you going to be waiting to watch the first? Also Mass Effect Andromeda the trailer. I don't want to watch any more Mass Effect stuff. We're sold on Mass Effect aren't we? Do we need to watch the gameplay trailer? No. We're sold on that. I don't know what you're talking about. You have to be quiet about the other stuff. Don't worry about it. We'll tell you when we know when things are. Don't worry about it. What lifts on Monday? Nothing. Nothing's happened on Monday. Everybody be chill. Chillax? Yeah so here's the thing. Someone the kid 0 brings up a good point.",
            "start": 3376.2
        },
        {
            "text": "when things are. Don't worry about it. What lifts on Monday? Nothing. Nothing's happened on Monday. Everybody be chill. Chillax? Yeah so here's the thing. Someone the kid 0 brings up a good point. It says two long guys. Even if it's good it kills the tempo. It kills the tempo of the show. Why don't people understand? That's the thing about fun clips. I understand that we're kind of in a bit of civil war when it comes to the idea of these clips that may or may not be fun. Yeah. Well some people don't get them right. Some people don't understand. I get it. I get it. I think that we need to put some more rules out there. The thing is fun clips short. It's like little Vine videos. It's a clip. That's true. That's true. You're sending in fun videos which is not the same thing. If it's a longer video give us the time code of the funny part. That's easy to do. All you go is hit the share button add the little time code. You're done. You're done son. Should we teach people how? Now",
            "start": 3409.2
        },
        {
            "text": "longer video give us the time code of the funny part. That's easy to do. All you go is hit the share button add the little time code. You're done. You're done son. Should we teach people how? Now the thing is if it's a longer clip if it's a three minute clip and it's one of those funny ass white people dancing in the 90s like the aerobics championships type stuff. Tim Minority Report. Thank you. We don't like that. Thanks for finally standing up for the white people. We don't like the white people dancing in the 90s? I don't think we can say that. We have to be inclusive Tim. Tim you're not listening. I'm just kidding. That's the majority. Fuck that. If the clip is three minutes long but you don't need to watch the whole thing it's just funny you can just say that. That's the beauty of tips and the beauty of chat and the beauty of words Greg. Use your words to explain and set up the fun clip so that we don't need to waste people's time. The Jigsaw clip it might have",
            "start": 3449.2
        },
        {
            "text": "beauty of tips and the beauty of chat and the beauty of words Greg. Use your words to explain and set up the fun clip so that we don't need to waste people's time. The Jigsaw clip it might have been funny if we were trying to work and trying to distract ourselves from doing something. Be like hey guys come look at this funny video. You know what I mean? That's when that's funny. Not now. No. You're all bad at it. Except for the people who are really good at it. Joey Knowall also brings up a good point. All dancers matter. What the fuck does she have to say? All dancers matter. It's true. Blue dancers matter. Blue Man Group. Are you referring to the Blue Man Group? Sure. They don't dance. I mean they drum. They got their Nick guy hitting the bell. Do you ever see that crap? You ever go see that shit? No I haven't. That's what passes for theater and we wonder why the arts funding's getting cut. I gotta stop looking at you. You just put his fucking- Which where am I looking",
            "start": 3496.2
        },
        {
            "text": "go see that shit? No I haven't. That's what passes for theater and we wonder why the arts funding's getting cut. I gotta stop looking at you. You just put his fucking- Which where am I looking right now on this thing? I can't see. The lower corner of the TV. Lower corner of the TV. Now you're looking to the mid-level of the TV. You're looking off to there now you're looking at the people and now you're kind of looking at me-ish. Just look right in the camera. If we all looked in the camera we'd all just be looking right at the audience. You wanna see something I set up? No. Yeah. I don't know why do you want me to look at your pores this deeply? I don't know I thought it'd be cool. You got a weird definition of cool man. I certainly do. I like the exponential speed that it has. I don't know why it sped up like that. It has that nice speed ramp. Here's your next challenge. You ready for this one? Your next challenge should you choose to accept it is that you're allowed to",
            "start": 3539.52
        },
        {
            "text": "I don't know why it sped up like that. It has that nice speed ramp. Here's your next challenge. You ready for this one? Your next challenge should you choose to accept it is that you're allowed to keep doing the thing where you make yourself bigger but you can only do it if you can figure out how to turn yourself green as you do it so that by the time you get to full size you are the Incredible Hulk. That's your challenge. I'm just putting a challenge out there. I mean the whole reason I did this is because you were like we were talking about something you're like oh shit did you figure out how to do that? I was like- I think that looks great. I mean I think this looks awesome. Yeah no I'm happy with it too. But I'm just saying thank you for inspiring me to do great things. I push you and you push me. Gotta stop looking at you but you're so damn handsome. Love you man. Just fucking love you. All right let's jump into the chat answer some questions comments get the",
            "start": 3581.88
        },
        {
            "text": "push you and you push me. Gotta stop looking at you but you're so damn handsome. Love you man. Just fucking love you. All right let's jump into the chat answer some questions comments get the fuck out of here. Everybody's talking about the dancing and the bongos. Captain Greg says wow Switch is only two weeks away. I can't fucking believe it. I can't believe it man. We're getting so close. Yeah. Like at any moment it can come through that door. That's why I keep playing with the doorbells. I can hold it. You can be holding it. Can't you guys hit someone up and be like hey where's it at? Where the fuck's it at? No no a little friendlier. Where the fuck is it Nintendo? Where the fuck's Metroid Prime? What's Retro working on? We know where Miyamoto lives. We don't. I don't think that's true. Japan guys. We know. There's a level of truth to it. Just don't go deep into it and we can still say we know what's up. Okay the chat's going fast. Dancing in the Moonlight",
            "start": 3618.76
        },
        {
            "text": "think that's true. Japan guys. We know. There's a level of truth to it. Just don't go deep into it and we can still say we know what's up. Okay the chat's going fast. Dancing in the Moonlight everybody's feeling warm and bright. It's such a funny national sign. Everybody's dancing in the Moonlight. RavinWit88 says if Disney... You had great moves. Kevin had great moves. He didn't even have his camera on. If Disney would buy DC how much do you think DC would sell for? I'm not too well versed in all this type of stuff. Let's think about it right? It's got to be less than what Star Wars sold for right? Yeah. And Star Wars sold for $4 billion. With a heartbeat guys. How much Sugar Studios was going for a bill and it ended up selling for $635 million. I mean also we got to look at how much money they made. Just the movies. Disney bought Marvel for $4 billion. How much is... Look up... Who owns DC? Warner Bros.? Yeah Time Warner. How much has DC sold for... Wait like",
            "start": 3661.64
        },
        {
            "text": "look at how much money they made. Just the movies. Disney bought Marvel for $4 billion. How much is... Look up... Who owns DC? Warner Bros.? Yeah Time Warner. How much has DC sold for... Wait like fucking... They bought them what like 10 years ago? No less than that. It's probably like six years ago. Look at how much they bought it for. That's going to get complicated because isn't it... It's... And how much they've made... Time bought Warner Bros.? Isn't that the deal? That was after though wasn't it? Or has Warner owned DC for hell of a long? I thought that they owned... Let's just call $ billion a fair number. I mean well it sounds like $4 is the number that everyone throws around right? No $4 is. Star Wars got $4. Marvel got $4. Marvel got $4? Yeah. Damn. So I'm going to say $4. I'm going to say $4. Yeah but I feel like it's not in a good place. Like are the comics selling well? It doesn't matter though. Marvel was the same thing right? It's not about how good it",
            "start": 3718.52
        },
        {
            "text": "say $4. I'm going to say $4. Yeah but I feel like it's not in a good place. Like are the comics selling well? It doesn't matter though. Marvel was the same thing right? It's not about how good it is. They got sold for $4? How worth it is it? Like how much money could Disney make off that? No I understand. I understand. But like morale is low right now for DC because all their movies have sucked. Don't matter. The money's there. It's a fact. That's true. That is true. Yeah March 1989 Warner Communications merged with Time Incorporated making DC Comics a subsidiary of Time Warner. I don't have any deals details. Jake Simp once says Greg what are your thoughts on the Batman Rebirth series that's coming out? Looks to be like Flashpoint but a bit different. I don't know anything about it. That's the first time I heard about it. This is the one I think I saw a lenticular cover yesterday come out. That's already out? And it like when you turned it it was no I don't think",
            "start": 3765.4
        },
        {
            "text": "about it. That's the first time I heard about it. This is the one I think I saw a lenticular cover yesterday come out. That's already out? And it like when you turned it it was no I don't think it's already out. You want me to go downstairs? No I don't think it's there. You want me to check it out? Where's Flash and Batman? Let's see if you can find that. If you type in lenticular I think you'll hear it. I think I hear how I spell lenticular. L-E-N-T-I-C-U-L-A-R. Lenticular. The button. This thing? Oh the thing where they're starting to okay okay. No it wasn't that one. But anyways it was lenticular. Where they're starting to they find the comedian's button and all this stuff. Smashing Display says are you guys going to talk about how they've already filmed Avatar through 5 and they're making an Avatar land in Disneyland World Orlando Florida? No I wasn't planning on that. No I probably wouldn't have been talking about it. No I hated Avatar 1. I fucking loved",
            "start": 3808.64
        },
        {
            "text": "5 and they're making an Avatar land in Disneyland World Orlando Florida? No I wasn't planning on that. No I probably wouldn't have been talking about it. No I hated Avatar 1. I fucking loved Avatar 1. I was so happy when it seemed like it just went away. And now the fact that it's like hey we're still doing this. I'm like I don't fucking care. I would have been fine if the movie was a standalone and they never made any sequels to it. I would like to see what they do with the you know the movie. I would like to see what they do with the Avatar World Disney World. I would like to see James Cameron apologize for bringing 3D back. No stop. 3D sucks not in a good way. It's just because you go to bad 3D movies. No I know. I've gone to all the same movies you've gone to. No but yeah but like Kabuki Theater where it's like those fucking lenses were shit. Now hold on hold on hold on. The lenses sucked. Hold on hold on hold on. Yeah no problem. Let's dial it back for a",
            "start": 3850.64
        },
        {
            "text": "but like Kabuki Theater where it's like those fucking lenses were shit. Now hold on hold on hold on. The lenses sucked. Hold on hold on hold on. Yeah no problem. Let's dial it back for a second. Stop looking at you. Doctor Strange Kabuki Theater glasses were terrible but it's what we had to do for the embargo. No it isn't. No it isn't. We could have gone to Sentry's right by my house where we wanted to get some delicious sushi underneath. Where we wanted to get reserved seats because we didn't want to go line up again like we did for fucking Rogue One and wait there for four hours. We can just send someone. We can send people to like lockdown seats for us. Anyways back to my point is that no I've enjoyed the 3D movies I've seen recently. I just hate 3D and I'd like it not to stop. I would like it to stop very much. It doesn't enhance the experience for me. It doesn't make it better for me. Just stop doing it and actually make everything day in day digital. Thanks. All",
            "start": 3892.64
        },
        {
            "text": "stop. I would like it to stop very much. It doesn't enhance the experience for me. It doesn't make it better for me. Just stop doing it and actually make everything day in day digital. Thanks. All right so he's just a madman. Let's just ignore him. Day in day digital. It's going to happen one day. You'll see. No I mean it's inevitable Greg because people are lazy but the movie theater experience will still be there. It's the boutique experience. What we need to do is start going to the movies once a week. No that's sending the wrong message. You mean? What we need to do is start buying Amazon instant movies once a week. Get a little sushi. Why do you want to go to that fucking theater? Because it's right next to my house. It's big. You're never going to get me. You're never going to sell. Until they have reserved seats you're not going to sell. They have reserved seats. Why don't we ever go to those films then? I don't know. Yeah I don't know. Because you guys are like we",
            "start": 3927.64
        },
        {
            "text": "to sell. Until they have reserved seats you're not going to sell. They have reserved seats. Why don't we ever go to those films then? I don't know. Yeah I don't know. Because you guys are like we don't want to watch the 3D version so we're going to go to some shitty Kabuki Theater with bad sound. We went to the Kabuki once for one of our things. Peppolo14 says Tim did you see that Disney slated the title of Episode 8 in Spanish and German and it revealed that the Last Jedi is a plural last? Yeah we assumed as much but it's cool that it is confirmed in German. Deathwon'twalugs89 says I'm really growing attached to sassy Kevin. You say that. He's always been sassy Kevin. Yeah but he's like- When was the last time you was quiet non-confrontational Kevin? I'll stop. Do you want me to stop? No I love it. No no if this is not productive I can stop. No I like it a lot. I'm putting it in sub-only mode. One of your benefits of being a subscriber. What am I to be sassy not on",
            "start": 3968.64
        },
        {
            "text": "to stop? No I love it. No no if this is not productive I can stop. No I like it a lot. I'm putting it in sub-only mode. One of your benefits of being a subscriber. What am I to be sassy not on the show? I feel like I asked you two questions and you're like ugh. Well it's because he- think of it this way it's like everybody has a different threshold with you. And Tim's was passed probably 10 0 years ago. And so now anything just chips away at him. You can do the smallest chip damage to him and it takes him down. He wanted this. He wanted this. Not like this. Remember that. It wasn't time on Kevin Coello. WinnieUsername44 says Greg I'm thinking of starting a campaign to make you the next grand marshal of the Mizzou homecoming parade. Do it. This is the time. Mizzou down in the dumps. Public opinion down. Sports aren't doing so hot. This is my time to come into shine. Let's get into sub-only chat. I did that. I did that. I said I was going to do that. Oh okay. FeedOfficer who",
            "start": 4014.64
        },
        {
            "text": "Public opinion down. Sports aren't doing so hot. This is my time to come into shine. Let's get into sub-only chat. I did that. I did that. I said I was going to do that. Oh okay. FeedOfficer who is a sub says Tim have you seen Disney on Ice? My wife wants to go but I don't know how weird it'd be going as an adult couple with no kids. First off not weird if you do that. Second off Disney on Ice is the fucking jam. Any type of ice capades I'm so into. Me and Kevin went to Aladdin on Ice. When we were like 1 . No definitely not. Really? Yeah we were way younger. Oh okay younger. Okay. Yeah I was like maybe six. I feel like I went to the princess show. Just do the math on this Kevin. Aladdin came out in like 93. Yeah but they're not still doing Aladdin on Ice right now? Uh-uh. Oh that's a shame. It was a great show. I had the sick ass Jafar staff the Cobra. I envy you. I envy you so much. I had the swords. Yeah which is funny but like damn the staff was so cool. Yeah",
            "start": 4054.64
        },
        {
            "text": "Oh that's a shame. It was a great show. I had the sick ass Jafar staff the Cobra. I envy you. I envy you so much. I had the swords. Yeah which is funny but like damn the staff was so cool. Yeah it was a lot of cool shit. Anyway I haven't been to an ice show since then. I don't think I've ever been. Oh really? Yeah. I feel like you'd love it. Yeah isn't that my kind of name? Yeah I'm Batman on Ice or something. Oh sure yeah I do Batman on Ice. Is that a thing? I don't think so but it will be now. I'm probably going to be in some ice at this point. Frankster59 says Tim since someone seems to be thinking of you when it comes to the Crash Trilogy what are your thoughts on the chances of a Crash Team Racing remake or a new Crash? Crash Team Racing unfortunately I think is not going to happen because they're really going in with this remake from the ground up stuff for Crash 1 through 3 and it's just such a different game. It's a different genre totally different",
            "start": 4097.64
        },
        {
            "text": "is not going to happen because they're really going in with this remake from the ground up stuff for Crash 1 through 3 and it's just such a different game. It's a different genre totally different engine all that shit. So it's like I don't see that working out too well. I wish that they would though. The one thing you haven't addressed in the show is that yesterday I asked is there a bigger Crash Bandicoot fan in the video game industry? Chat pretty much universally was like no Tim is the biggest the most vocal Crash Bandicoot fan. Or an enthusiast. Okay whatever. And then Cheeks_Junior over on Twitter popped up a little video and he's like I'll challenge you to Crash Team Racing. I should have said I should have clarified is there anyone in the video game industry that matters that's as big a fan as Tim Gettys? Because of course Cheeks_Junior coming out of fucking nowhere. I don't think I qualify for that either. Well my question is are you going",
            "start": 4140.64
        },
        {
            "text": "that matters that's as big a fan as Tim Gettys? Because of course Cheeks_Junior coming out of fucking nowhere. I don't think I qualify for that either. Well my question is are you going to accept Cheeks_Junior's Crash Team Racing challenge? And it was Crash Team Racing right? It was Crash Team Racing. At this time I have no comment. Kevin can you pull up the clip? It's on my Twitter account. What are we talking about? What clip? Go to Twitter.com/Tim Gettys. I'm going guys let's calm down. I'm going. And then you add- My eyes have been killing me recently. I don't know what's going on. I think I'm dying. Don't go to the doctor. I'm trying to find any excuse. Oh shit is this it? Why didn't you take this kid to ISA? You can't here here you know what? Not that one. I love this clip though whatever this thing is. Is that Rachel Bilson? No it's the girl from Broad City. Rachel Bilson's on Broad City? Scroll down Kev. It was a retweet that I",
            "start": 4183.14
        },
        {
            "text": "Not that one. I love this clip though whatever this thing is. Is that Rachel Bilson? No it's the girl from Broad City. Rachel Bilson's on Broad City? Scroll down Kev. It was a retweet that I did. Why is this still up? Retweet. I mean scroll down. Scroll down. Scroll down. Keep scrolling. Keep scrolling. There it is right there. Is it? No you fucking idiot. It's that. That one. No god damn it Kevin! This video watch this video. Yep it's that one. Chiptooth Gaming Cheeks_Junior. This guy saying he is the biggest Crash Bandicoot fan. Tim Gettys and the Fightmen. I am the biggest Crash Bandicoot fan and I will prove it. I was a weird kid as a little kid and I had shrines of things. You're a weird kid now. I had those action figures those 1997 Mythosaurus action figures. Where's your action figures? I had tiny dude. I had those action figures as well. A 1v1 on CTR come at me bro. Because let me tell you what if there's one thing I could school you on it's Crash",
            "start": 4225.64
        },
        {
            "text": "Where's your action figures? I had tiny dude. I had those action figures as well. A 1v1 on CTR come at me bro. Because let me tell you what if there's one thing I could school you on it's Crash Bandicoot. You came to Kinda Funny Lab too. I'm not very good at video games. I'm good at Crash Bandicoot video games. I'm ready Tim Gettys because if there's one thing I learn it's talk shit get shot and boy I'm coming at you hard. Thank you. I appreciate it. I like the editing of that video. Supposedly he lives around here. So are you going to accept Cheeks_Junior's challenge? I'm looking into some options. I'm looking into some options but at this time I have nothing to confirm. Guys I'm going to be honest I don't like the way that video went. If you want to we'll beat the shit out of him. I like Cheeks. He's my dude. I feel like I need to put on sunglasses be a wrestling manager here and get you psyched up and cut this promo already if we're going to kill this Cheeks",
            "start": 4277.64
        },
        {
            "text": "out of him. I like Cheeks. He's my dude. I feel like I need to put on sunglasses be a wrestling manager here and get you psyched up and cut this promo already if we're going to kill this Cheeks_Junior motherfucker. I'm not going to kill him. I'm not going to kill him. I might. I pretend to be real nice until he trusts me. Okay and then you're going to swing it over on him? Slap his dick? He's going to slap that dick. Slap that dick. So I'm sorry what was lunch plans? Bshally asks a question. Greg how long does the average embargo last? Do you sign formal documents? How does this work? It depends. All those questions depend. Historically it depends how big the game is and who you're working with and which company. The big publishers your Nintendos your Sonys your Xboxes they'll have you sign contracts that are NDAs embargo agreements things you have to say hey I agree to this. Other places if you're thinking of XSEED Games, Atlus somebody smaller like that they'll send you",
            "start": 4310.64
        },
        {
            "text": "have you sign contracts that are NDAs embargo agreements things you have to say hey I agree to this. Other places if you're thinking of XSEED, Atlus, somebody smaller like that, they'll send you an email and you have to respond back, yes, I agree to the embargo, then they'll give you a code. And then if it's a smaller game, they'll just send you the game and say the embargo is this. That happens more often than not on most stuff because there's so many games that come out that we just get emails that are like hey, don't talk about this until February 2nd or whatever the hell it is. And then the bigger stuff is when there's more and more red tape, more and more regulations, and then things switch it up. Yeah, I mean, obviously, everybody's talking about different games. It's interesting when I talk about the embargoes that I'm under, people start jumping around and thinking that we have games that are way out still. But then there are games, but I don't know. Yeah. The Avenger",
            "start": 4350.64
        },
        {
            "text": "when I talk about the embargoes that I'm under, people start jumping around and thinking that we have games that are way out still. But then there are games, but I don't know. Yeah. The Avenger Guy says, Tim, will there ever be a Kinda Funny meetup at Disney World? You can lead us to a siege at the castle. Damn. That's awesome. Here's the thing. Disneyland and Disney World, it's the strictest place in the world when it comes to stuff. You're going to get caught and stopped so fast. But man, Greg, there's no way I'd rather go out than attempting a siege at the Disney World castle. Sure. With just a fucking mob of people wearing Kinda Funny shirts. That'd be awesome. We'd make the news. Oh, yeah. Oh, my God, it'd be great. Yeah, we might also get banned for life. And that's some shit we don't want to miss. At the moment that I've accomplished everything I need to in my life, I'm going to find a way to just go out, swing. The good news is once you go to Disneyland once, you've gone",
            "start": 4388.64
        },
        {
            "text": "don't want to miss. At the moment that I've accomplished everything I need to in my life, I'm going to find a way to just go out, swing. The good news is once you go to Disneyland once, you've gone to Disneyland all the times you ever need to go. You should go with it. Great, great, great. Yeah, I've been with you guys. No, no, no. We went to go eat steaks. And then you all ran around wanting to see stuff. We went on one run because they were about to close. We need to go one day have our good friend James Burke give us the best fucking tour in the world. The Burke Experience. Mm-hmm. It's muy bueno. Final question comes from Finn_lives89 says Greg, I like your Nightwing sticker. Down there. There. Do you still keep up with the comics? What comics do you three read regularly? So, yes, thanks for liking the Nightwing sticker. Yes, I keep up with Nightwing comics, which means that I read the Rebirth when Dick put the suit back on. I was super excited. But I lately just been",
            "start": 4429.64
        },
        {
            "text": "So, yes, thanks for liking the Nightwing sticker. Yes, I keep up with Nightwing comics, which means that I read the Rebirth when Dick put the suit back on. I was super excited. But I lately just been downloading them and adding them in the flights I go through and binge read different stuff. So I'm way behind on the new run of it, but I liked where they were through issue three maybe or whatever. Regularly, as we've talked about a million times, I keep up more regularly I think with Image and stuff like that. You know, like Saga on top of Walking Dead, Invincible now that they started the final 1 of that on top of that. I like all the Superman stuff happening right now with his son. Action and Superman themselves I still think are trashy books. They're just like, why are you doing this? Sometimes they are, holy shit, this is one of the best Superman comics I've ever read. And then it's like, three weeks of just like, I don't give a shit about, why? Lex Luthor's being tried because he",
            "start": 4479.64
        },
        {
            "text": "they are, holy shit, this is one of the best Superman comics I've ever read. And then it's like, three weeks of just like, I don't give a shit about, why? Lex Luthor's being tried because he might become Darkseid? What are you talking about? I'm just like, I'm just reading all this awesome shit, get back to that. However, I have read Super Sons, the Rebirth Super Sons right now, which is, you know, Damian Wayne and Jonathan Kent, or not Kent, you know what I mean, Jonathan. And that issue was really good. I heard that this week's Superman is really good. It's on my list to read when I get home. Do stuff there. Paper Girls is also awesome. Paper Girls is awesome. Kev! I added something to the bottom of the doc, it's very important. I know we're running long. On it, boss man. This is very, very, very, very important. Alex New York in the chat brought this to our attention. There's a fake SisQo fooling the fashion world. What the fuck? Let me read this article, Greg. Damn, that doesn't",
            "start": 4525.64
        },
        {
            "text": "very, very, very important. Alex New York in the chat brought this to our attention. There's a fake SisQo fooling the fashion world. What the fuck? Let me read this article, Greg. Damn, that doesn't even look kind of like a... An imposter apparently posing as R&B singer SisQo has been hitting New York Fashion Week shows, sitting front row, posing for photographers, and charming his way into fashion parties. The fake SisQo sat front row at the Philip P... I don't know, Fashion People, where he sported a black velvet, gold trimmed, coffin style Versace suit, a torrent of chunky jewelry and shades. Hitting the shows with his quote-unquote assistant, he also attended Kanye West's presentation. What the fuck? Sham SisQo, who bleached his hair to mimic the star's trademarked do of the '90s, was even heard bragging to fashionistas that he had just performed at the Meatpacking District, Celebrity Haunt, up and down until 5 a.m. this week. But the shady SisQo was ruffled when he tried to talk",
            "start": 4563.64
        },
        {
            "text": "even heard bragging to fashionistas that he had just performed at the Meatpacking District, Celebrity Haunt, up and down until 5 a.m. this week. But the shady SisQo was ruffled when he tried to talk his way into a wealthy New Yorker's private jet heading to the Caribbean and gave his passport details for the flight, which revealed his name as Gavin Barnes, born in 1986. A source said, this guy was 13 when Thong Song came out in 2000. Reached my phone, Gavin told us I never said I was SisQo. People thought I was him, and that wasn't cool. He denied posing as the singer, but refused to clarify who he actually is, denying his last name was Barnes. The real SisQo, who's currently in Las Vegas on tour, is also the case... What? ...is also on the case of the imposter, posting comments including, That's not me, with a Z in Dats, on Instagram next to photos of the fake SisQo at fashion shows. The singer's real manager, Jeff Allen, told Page Six, Management has no idea who this guy is. It's",
            "start": 4606.64
        },
        {
            "text": "That's not me, with a Z in Dats, on Instagram next to photos of the fake SisQo at fashion shows. The singer's real manager, Jeff Allen, told Page Six, Management has no idea who this guy is. It's flattering, I guess. Thanks for bringing it to our attention. What does his manager look like? The true SisQo is a fucking awesome dude. And yeah, there you go. I cannot believe that. I'm also excited that SisQo is in Vegas. How long is SisQo in Vegas? He's in Vegas for a while. He's doing a lot of shit. You think he's there till September? Oh my God. What? For me? Guys-a-wall. Yes! That'd be great. More recently, the singer appeared on an episode of Celebrity Wife Swap. Huh. SisQo? Yeah. I don't know that. I wonder what that means. Are you calling him? Yeah. Hey, Greg. SisQo, it's Greg Miller. You're on The Kinda Funny Morning Show live on Twitch. How are you? I absolutely knew that that was absolutely happening. I just landed in New Orleans just now. How long are you in New Orleans for? I'm",
            "start": 4647.64
        },
        {
            "text": "on The Kinda Funny Morning Show live on Twitch. How are you? I absolutely knew that that was absolutely happening. I just landed in New Orleans just now. How long are you in New Orleans for? I'm good, man. I just left Vegas last night. And when I got off the plane, that band was playing. Yeah, you know it. You know how they do it there. It was going down. It was a party. Not in my head, but it was a party going on. Number one, SisQo. How horrified am I to find out that there was a fake SisQo at this New York Fashion Week? Oh my God! Did you see that? I cannot bel- We just read the story here. The chat threw it up. That dude didn't even look like- Greg's trying to call me a- we on air right now. That dude didn't even look like me. He was kind of my complexion a little bit. Insane. No, his head cuts- my head cuts way tighter than that. There can be only one SisQo is what I always say. Man, what did you want to know? Was my reaction to it or not? No, I didn't care about that. I was",
            "start": 4697.64
        },
        {
            "text": "his head cuts- my head cuts way tighter than that. There can be only one SisQo is what I always say. Man, what did you want to know? Was my reaction to it or not? No, I didn't care about that. I was calling to see, are you in Vegas next week? Because I'm in Vegas next week. No, not we in Vegas next week. Not we in Vegas next month. Damn it! Because that's the way it goes. Greg Miller, Team Diddy's, the- Oh, I'm sorry. His name changes every now and then. That's right, SisQo. We changed it up. And Nick didn't have me on Twitter. I'm mad at that. What? SisQo, you're wrong. Nick's followed you for years. What? I didn't know that, man. Because I was trying to say something good about the sell. Because Nick is the funniest out of all you guys. The rest of you guys aren't funny at all. Yeah, no, it's true. No, that's not true. It's not true, actually. Because Kevin is the funniest. Kevin's great. So SisQo, I don't know if you saw Kinda Funny Live 3, June 3rd. I know, I heard about that. So",
            "start": 4757.64
        },
        {
            "text": "it's true. No, that's not true. It's not true, actually. Because Kevin is the funniest. Kevin's great. So SisQo, I don't know if you saw Kinda Funny Live 3, June 3rd. I know, I heard about that. So what we gonna do, man? Because I was just in Vegas, like I said, and you know they have the Fantasy Show there. And if you guys didn't know, in the Fantasy Show, girls come out and they dance scantily clad. And then they take their breasts out and everybody's happy. Yeah, yeah. They're my friends. I'll take some notes now. So now I just made it very, very large for Kinda Funny 3. Yeah. I love that. I love that. But June 3rd, put it on your calendar. In two sentences of the word, I just made it very, very hard. Alright, SisQo, it's a family show. I see what you did. You fit in naturally with us. Alright, man, we love you. Enjoy New Orleans. I love you too, man. We'll talk about Kinda Funny 3. Alright, sounds good. Alright, bye. He's the best. He's the fucking best. The dragon himself. Oh",
            "start": 4813.64
        },
        {
            "text": "Alright, man, we love you. Enjoy New Orleans. I love you too, man. We'll talk about Kinda Funny 3. Alright, sounds good. Alright, bye. He's the best. He's the fucking best. The dragon himself. Oh, man. Ladies and gentlemen, this has been the Kinda Funny Morning Show. Remember, each and every weekday here on Twitch.tv/KindaFunnyGames, we come to you with all the nerdy news you need to know about. Before jumping the chat to answer questions, comments, concerns, and give away a video game. You can catch it at 11 a.m. every weekday, but if you miss it, no big deal. You can go to YouTube.com/KindaFunny where we post the entire show. And podcast services around the globe where we post the entire show each and every day. Please subscribe, rate it, share it, suck some buddies nipples this weekend. You know what I'm saying, Kev? Let's go through the subs and resubs. What do you got? So you said SisQo's gonna be in Vegas on and off this year. Bachelor party? That's what I was",
            "start": 4872.64
        },
        {
            "text": "this weekend. You know what I'm saying, Kev? Let's go through the subs and resubs. What do you got? So you said SisQo's gonna be in Vegas on and off this year. Bachelor party? That's what I was yelling when you guys were all excited. I was like, definitely the bachelor party. Alright, good. It's gonna happen now. Kevin's bachelor party featuring SisQo. And the girls who take their titties out. If I read your name, you're a sub or a resub. If I read your name, you left a little message, you left a little message, and we love you. DJ Falafel Poppy, RunAndHide56, RodalFoz11, hey guys, you are awesome, and keep up the good work. Infinity R. Burrows, Infinity O. Burrows, Miss Podcast, Ark07, RaviDewitt88, Zeeps4, How did the frog die? He Kermit Suicide, Professor Reed, Nick Kanata, Shrub Tim, Kev Nizar, Mr. Green Shirt, Floatinhead Action, Taki Oi, Cheeks_Junior, 4 months on Twitch, 8 years overall, Will Gettys accept the Crash Team Racing World Championship sponsored by Chip",
            "start": 4913.64
        },
        {
            "text": "Kev Nizar, Mr. Green Shirt, Floatinhead Action, Taki Oi, Cheeks_Junior, 4 months on Twitch, 8 years overall, Will Gettys accept the Crash Team Racing World Championship sponsored by Chip Tooth Gaming Challenge? Name pending. John BX3, Solid Snake MGS1, BahaMutts05189, McLovin434, wow, 6 months. So can't wait for RTX Austin as I turn 1 on the Sunday of shots, probably not. JumpingIsFutile, Happy 1 year guys, you're the best. MarioNotBros, So close to that gold status, love you forever gents, heart emoticon. SteveDola66, You know what's better than 6? 69, I don't know. Mr. Trigglesworth, Mitchie Wraith, ScootsYo33, Captain Greek, You guys gotta come back to Vancouver, I had a great time meeting Greg at the Lamplighter last time, maybe news on that soon for me. AnarchyWherever, Master Exploder, Joker Man D, Can't believe it's 3 months already, love you guys. RadRigai05, Dunny Stark, The Avenger Guy, Kinda Funny Live 4, Miami hosted by The Rock, please. J. Old",
            "start": 4967.64
        },
        {
            "text": "Wherever, Master Exploder, Joker Man D, Can't believe it's 3 months already, love you guys. RadRigai05, Dunny Stark, The Avenger Guy, Kinda Funny Live 4, Miami hosted by The Rock, please. J. Old Ham 14, Sir Lion, Abrock111, Danger Chops, Matty G, Tim, You need to pressure Rooster Teeth and their backlogged inventory and get that Kinda Funny tank top out, Kinda Fit line. Just so everybody knows, American Apparel fucked everything up, going out of business, making things difficult. They went out of business? Yeah, they closed all their stores in the U.S. and Canada. So like the American Apparel, where we put on all our shirts and hoodies, makes ordering hard, that's why things are a pain in the ass, we're trying to find equivalent products to use with the same color, Kinda Funny blue, not as common as you'd think. It's upsetting. Jedi Pyro, That sniffing safari suspiciously looks like a prize box. It does not, it's for Pratil, he won the prize. Paul, CJII, Thanks guys for doing your",
            "start": 5038.64
        },
        {
            "text": "as common as you'd think. It's upsetting. Jedi Pyro, That sniffing safari suspiciously looks like a prize box. It does not, it's for Pratil, he won the prize. Paul, CJII, Thanks guys for doing your stuff and say hey to Colin for me if that's not too much. That is too much, we won't do that. NerdyGeek106, SpacemanSpiff00, ooh that Kinda Funny Platinum. Markfromtherez, Never get rid of KevCam, it's the best. Agreed. Josh Stevens, Josh E. Stevens, years YO! Waffles, Sidefury, Please sing more Greg. I sing a lot. TheBigFudge, Make fun clips great again. Quest Level, Awesome. ClarkesOnIOhZeiger, Have fun at the DICE Awards, Greg. Look forward to watching it over at Twitch.tv/KindaFunnyGames. See you all at PAX East, Art. Right, hosting DICE Awards Thursday night, it'll be hosted here I assume. IGN's the live streaming partner, I assume they're doing it on Twitch as well and that we can host that. And if not, everybody call Per Schneider at his home, I will give out his",
            "start": 5080.64
        },
        {
            "text": "here I assume. IGN's the live streaming partner, I assume they're doing it on Twitch as well and that we can host that. And if not, everybody call Per Schneider at his home, I will give out his number on Twitter right before if that's the case. Club NP, Did you guys hear about the new Switch game called Bongos Bongos Bongos? Mugwort, Kparagon, Bongos, RT Jamerson, Love you guys, Heart emoticon. We love it all. Yeah, I like you Kevin, you're funny sometimes. What do you do? Oh that thing, that's cute. Ladies and gentlemen, thank you so much for supporting us this week and every week here on Twitch.tv/KindaFunnyGames. We will be back Monday morning with another episode of the Kinda Funny Morning Show, but until then, no. It's been our pleasure to serve you. Cut the feed, Cap.",
            "start": 5137.64
        }
    ]
}