{
    "id": 184,
    "video_id": "oof6ReINho8",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "The Best Christmas Movie - A Conversation with Colin",
    "description": "Home Alone is the ONLY acceptable answer. Besides Home Alone 2.\n\nToday's topics were submitted by @Jaxzz280. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy Merch: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1387893608,
    "duration": 377,
    "transcript_chunks": [
        {
            "text": "They're getting hit with like paint cans. They're like torches on their head, nails through the feet. He's hurting these guys up. What's up everybody? Welcome to A Conversation With Colin. Now I'm Greg and this is my roommate Colin. Now sometimes this little guy, he says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at him, and we talk it out for your amusement. If you like that, like the video, share us with your friends, subscribe to us on YouTube. Colin, are you ready? Yes. Today's topic of conversation is best Christmas movie submitted by Jaxzz280. What do you got for Jax? Oh man. Two. Two movies come to mind. Okay. National Lampoon's Christmas Vacation. Yeah. Oh, that's a really good one. And Home Alone. Okay. Also good. Yeah, I like that too. Um, now these are movies that are of our time. Obviously, there's classic classic movies Christmas. I would I would say that National Lampoon's is a classic. I think it's definitely a",
            "start": 0.16
        },
        {
            "text": "I like that too. Um, now these are movies that are of our time. Obviously, there's classic classic movies Christmas. I would I would say that National Lampoon's a classic. I think it's definitely a classic now, right? Well, it's not that much newer than or older than than Home Alone. Yeah, Home Alone's not really a Christmas movie. Yeah, it is. I know, but it's not really. This is like when the people would make the argument that Die Hard's a Christmas movie. I wouldn't make that argument. That's a That's a Yeah, it does, but that's not that's not that's not like topically about Christmas really. Home Alone really isn't either. It's about your parents leaving like they did in Christmas Vacation. They needed an excuse to get him out of the house. I don't know. The next time around, what it was? They had a French wedding or something. Yeah. Somehow it happened again. It was another wedding, I think. Or no, another Christmas. They were going to They were going to Florida for Christmas. Is that",
            "start": 44.72
        },
        {
            "text": "Had a French wedding or something. Yeah. Somehow it happened again. It was another Christmas. They were going to Florida for Christmas. Is that what it was? The exact same thing happened. Yeah. It's all No, they went Didn't they go to New York? Yeah, that's where No, that's where Kevin got on the wrong plane for the lady with the Crazy Bird. Yeah, Crazy Birdly. It was a weird one. I forgot about her. I watched that movie. It caught on, you know, TBS there at the end. Let's talk about something about Home Alone real quick. All right, cool. Kevin, what was his name? Kevin McCallister. Kevin McCallister massacres those guys, brutalizes them. And no one wants to like when you're a kid, this is funny. Yeah. They're getting hit with like paint cans. They're like torches on their head, nails through the feet. He's brutalizing these guys up, right? And they keep coming, which is a really messed-up part, right? It's like Yeah. It's like",
            "start": 85.44
        },
        {
            "text": "Home Alone is the ONLY acceptable answer. Besides Home Alone 2.\n\npaint cans. They're like torches on their head, nails through the feet. He's **** these guys up, right? And they keep coming, which is a really **** up part, right? It's like Yeah. It's like a boss in a video game where you have to beat him like four or five times before this. He beat him way more times than that, though. That's the worst. And then it gets even worse in because the the **** brilliant scene in Home Alone 2 in New York. He throws a brick off the **** building like a 10-story building and just smashes the dude in the face. Kevin McCallister almost murdered this guy. Now I understand that he had it coming like it's self-defense. Self-defense, but you might get like some involuntary manslaughter kind of charges on this. Really? Would that happen? Because you know Kevin's kind of baiting them a little bit in the second one. Sure. Yeah. He yells at him a lot, takes their photos and stuff. So, like I I you know, but back on the topic, you know, I think Home Alone is a",
            "start": 119.12
        },
        {
            "text": "Kind of baiting them a little bit in the second one. Sure. Yeah. He yells at him a lot, takes their photos and stuff. So, like I I you know, but back on the topic, you know, I think Home Alone is a great Christmas movie. I think Home Alone's an underrated movie. I actually think Home Alone's like actually a great movie. Like I think people watch it because it's nostalgic, but I actually think it's a really good movie. I haven't watched it a long time. And uh and as far as like, you know, National Lampoon's, obviously that movie is awesome, too. But those are the two movies that come to mind for me. Okay. What about you? I'm not I really don't like Christmasy stuff like movies and music and stuff. I like National Lampoon's. Amazing. I like that one a lot. Julie Dreyfus in there. She's the trendy neighbor next door. Yep. Yep. But yeah, outside of that, I really don't give a flying **** about Christmas. Interesting. Interesting. I did enjoy the Santa Claus movie with Tim Allen",
            "start": 154.4
        },
        {
            "text": "Trendy neighbor next door. Yep. Yep. But yeah, outside of that, I really don't give a flying **** about Christmas. Interesting. Interesting. I liked I did enjoy the Santa Claus movie with Tim Allen. Oh, that was really good. I remember I did get that for Christmas and watched it a bunch. I enjoyed that film. That That's Yeah, that was a good movie. Remembering like the hot cocoa was shaking, not stirred. And that's like that was another **** up That was like a curse. That was like a nightmare curse of just like Santa died in your yard so now you have to give up your life. Now correct me if I'm wrong though about this Santa Claus Tim. He came back and did this like every five years, right? Like there was like three or four of these movies. Yeah, there was I think the third one that I remember was the one with Martin Short. It's like Jack Frost. I never saw it but then I was over it. They had overstayed their welcome. Do you think that the",
            "start": 188.08
        },
        {
            "text": "There was I think the third one that I remember was the one with Martin Short. It's like Jack Frost. I never saw it but then I was over it. They had overstayed their welcome. Do you think that the snow in those movies reminds him of his cocaine conviction in the 80s? I think he's probably still on the cocaine back then. Probably. Okay. Cleaned up his act though eventually. Now he does the Dodge commercials. Yeah, he does. He does. And Michigan commercials. Yeah, a big proponent. No, it's good for me. You know, they need some travelers over there some. They need a lot of things over there. They need RoboCop. They need money is really what they need. Yeah. Well, um, so yeah, I think those are the two good Christmas movies. I know there's like very popular Christmas movies when our parents were young, for instance. I don't really give a flying **** about The Miracle on 34th Street. It's a Wonderful Life. You know, Gremlins, if Home Alone can be a",
            "start": 228.8
        },
        {
            "text": "when our parents were young, for instance. I don't really give a flying **** about the miracle. It's a wonderful Yeah, that thing. It's A Wonderful Life. You know, Gremlins, if Home Alone can be a Christmas movie, Gremlins can be a Christmas movie, right? Yeah. All right. Sure. I mean, it bothers me because it's A Wonderful Life. So, did you read this thing recently about A Wonderful Life? How they were going to try to do a sequel to it? No. And everyone flipped the **** out. Like, who really cares? Are you that like attached to this movie, this mediocre Christmas movie? You don't want people to toil with it? If you're going to do a sequel, like everybody always says Hollywood's ideas, this that, and the other, you're finally if you're going to sequelize it A Wonderful Life, it's officially over. Yeah. Just hang it up. Stop making movies altogether. I agree. Hollywood is in a bad way right now. Yeah. Real bad. They made what? Seven. Seven Fast and Furious movies",
            "start": 263.52
        },
        {
            "text": "Life, it's officially over. Yeah. Just hang it up. Stop making movies altogether. I agree. Hollywood is in a bad way right now. Yeah. Real bad. They made what? Seven. Seven Fast and Furious movies, Nick. They're making seven right now. Yeah. Yeah. Out of ideas. Bad ideas. Mr. Walker. Yeah. Yeah. He was a good man. He was. He was cool. I liked those movies a lot. Do you think he was You think he was nice? From what I read. Yeah. He seems real nice. Oh, you write about him. Yeah. Well, tweets read people tweeting about him. If Dwayne \"The Rock\" Johnson liked him. He's got to be good. He's a good guy. He was good. Those movies were fun. He was good in those movies. Yeah. I only saw the first two, I think. Oh, really? See, you you missed it. You missed the big ones then because that like two was and then Tokyo Drift started bringing it back around. I thought Tokyo Drift was the bad one. No, no, no. I mean, you can you can watch the Game Over Greggy show every Monday here on YouTube. We will talk",
            "start": 298.4
        },
        {
            "text": "Drift started bringing it back around. I thought Tokyo Drift was the bad one. No, no, no. I mean, you can you can watch the Game Over Greggy show every Monday here on YouTube. We will talk about the past of Fast and Furious at Link there, I'm sure. Okay. Isn't that right, Tim Gettys? Yes. All right, good. Stop. All right. Well, thank you, Jaxzz280. Uh, ladies and gentlemen, what's your favorite Christmas movie? Let us know in the comments. Then like the video, subscribe to our channel, and share us with your friends. Colin, thanks for your time. Thank you, ladies and gentlemen. Thank you for your time. Until next Tuesday or Thursday, have a conversational day.",
            "start": 333.52
        }
    ]
}