{
    "id": 177,
    "video_id": "PF3kfESCWYM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Skydiving Gone Wrong and Eminem - The GameOverGreggy Show Ep. 2",
    "description": "If you were a skydiver and were in a plane crash, would you ever dive again? The boys discuss along with thoughts on being married vs. being single, and the life and times of Marshall \"Eminem\" Mathers.\n\nSUBSCRIBE/LIKE/SHARE/BUY MERCH: http://www.districtlines.com/gameovergreggy\n\nEach and every Monday, Greg, Colin, Nick, and Tim get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy the MP3 version of the show on Band Camp: http://gameovergreggy.bandcamp.com\n\nMerchandise available for you body: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
    "published_at": 1387202403,
    "duration": 5531,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside Colin Moriarty. Hello, everyone! Did you like that one better? That was good, yeah, yeah. And then this guy Tim - let Tim host. Let Tim host. Huh, that's you're gonna say. Here we are, episode two of The GameOverGreggy Show. We said in episode one we'd post on Thursdays... that we're going to post on Mondays. We're going to keep you on your toes sometimes we say things in the show they don't come true; sometimes we say everything and it comes true. Someone is murdering a baby outside, and the fans are lining up outside the PlayStation Store to get a piece of this action. Uh, if you didn't know what happens on The GameOverGreggy Show, we post them on Mondays. Each one of us brings a topic to the table, and we discuss it for your enjoyment. Sorry, get back to the arm movement. There you like that? It's really weird with the baby being murdered.",
            "start": 0.78
        },
        {
            "text": "on Mondays each one of us brings a topic to the table and we discuss it for your enjoyment sorry get back to the arm movement there you like that it's really weird with the baby being murdered outside I think it's a cat I think it's a cat that not a cat quiet is that a cat speaking is that a cat speaking our language I stand corrected that was the English language did a CAT just become self-aware outside oh my goodness hello Nick so last time we started with Tim hello I see this time we switch this way we go the opposite direction you start us Nick okay you have a topic last time yeah I'm I'm I'm going to do another either or ooh married or single some birds weren't meant to be caged ladies and gentlemen what's better what's better to be is it better to be in a committed relationship or is it better at this day and age for someone between 20 and 35 that's roughly our age range how old are you me yeah uh pushing 34 I'm almost 34 come just seeing where we are in the year spectrum and why",
            "start": 46.92
        },
        {
            "text": "It's better at this day and age for someone between 20 and 35, roughly our age range. How old are you? Me, yeah, uh, pushing 34. I'm almost 34. Come on, just seeing where we are in the year spectrum and why we're asking this question right now. Yeah, is it better to be single or in a committed relationship in general? What's your thoughts? Wouldn't it be in a committed relationship? Cuz everybody who's single is trying to get into a relationship. Not everybody knows you got your heartthrobs out there; your friend Mirabel, they're just out there looking to get rocky jacking around mingling jacking around. Who's jacking around trying to find a piece of strange, trying to find a piece of strange. That's right. Um, yeah, I mean it's usually better. I mean like the thing is what do you like better? You like being single when you were single? Yeah, I enjoyed being single when I was single. You like being in a committed relationship? Sure, it's great having a partner, right, like that's the",
            "start": 96.2
        },
        {
            "text": "you like did you like being single when you were single yeah I enjoyed being single when I was single you like being in a committed relation sure it's great having a partner right like that's the big part of it but you're not married no but he he eventually lessen the question I mean I'm divorced enough to you've already been there yeah yeah I mean being with someone's great when it's good and then if it goes bad that's when it gets really bad and then you come out of that and you're single and you're happy to be single and you want to mingle and be little Timmy gay what's it like being single right now no is it amazing sing no I don't like St don't like this whole I don't like this whole single thing but like you don't like being single no I mean I do like being single but not for the reasons you're implying being single is fun why do you like being single Tim I don't know just because there's nobody worth being with and if there was somebody worth when there's someone that I",
            "start": 137.4
        },
        {
            "text": "the reasons you're implying being single is fun why do you like being single Tim I don't know just because there's nobody worth being with and if there was somebody worth when there's someone that I know that's worth being with I'd want to be with them and then yeah let's get married that's how it works right damn that's quick so you just jump the gun like that jump the gun to marriage hey you know what you're worth being with you like more too let's get married Thrift Shop Thrift Shop yeah yeah real quick you know that kid from MasterChef who cried when his chicken wasn't cooked enough he was on the Fine Brothers video kids react to gay marriage and when he watched the kids get the people get married and they're like at the end of all these questions like you know what what did you think of this what do you think and he's like it's fine it's like more said and he like quoted the line I was like damn this kid's OG yeah well that's the antithesis of OG if you're if you're",
            "start": 170.84
        },
        {
            "text": "you think of this what do you think and he's like it's fine it's like Mmore said and he like quoted the line I was like damn this kid's OG yeah well that's the antithesis of OG if you're if you're quoting that if you're an OG yeah whatever you love Mmore you don't like Mmore that's I know that one song I don't Thrift Shop yeah he's got a bunch of other ones I'm sure he does I I don't I don't listen to him so I have no judgment on one I you listen a lot of rap though you should listen I do listen a lot of rap yeah when I was listening when I Tim was here we were doing something and I was listening to I was listening to like I was what was I listening to Bun B or something like that and you were surprised I was listening like such hard gangster you have just very interesting tastes in everything things that I would not think that you would like you like I have I'm I'm I was talking to my girlfriend the other day like I don't I really honestly believe this you'll not find a person with",
            "start": 210.8
        },
        {
            "text": "things that I would not think that you would like, you like I have, I'm I'm I was talking to my girlfriend the other day, like I don't I really honestly believe this, you'll not find a person with more eclectic musical taste, you're eclectic in general though cuz I would have pegged you when I first met you was just like non-stop just listening to House of Pain that's it, yeah I like House of Pain, House of Paine that one record but like earlier today we were driving the car and you're like oh Duran Duran, yeah I love Duran Duran, I'm a huge fan if you I forget what you said you were like if you're on the new wave I'm on that wave with you dude, I love New Wave, I was listening to Orchestral Manoeuvres in the Dark all weekend, my girlfriend was getting mad at me, that's OMD, in case you're in case you're a huge New Wave band you guys don't know them, um yeah man you I listen to all sorts of music, I like everything even Gun for a Mouth from The Nashville Sound, yes I was going to say like I was I almost",
            "start": 254.48
        },
        {
            "text": "a huge New Wave band you guys don't know them um yeah man I listen to all sorts of music I like everything even Eminem from the Marshall Mathers album yes I was going to say like I was I almost called you out you're like I like everything and I was going to say country and then I remember you love Nashville you do love the Nashville scene like I do don't get me wrong Nashville okay but but to the top Scarlatti and Avery you already voiced your vote you already voiced your vote what your girlfriend got mad at you for listening to music well that sounds like a great existence huh living under goddamn prison rules up here you got snipers if you try to leave the house no my girlfriend's great the the the you know like I I like there's there's perks to any situation I think where you can choose right like you can choose to not work right and and there's an advantage to that because you can do whatever you want but you can't have money you know like in a relationship you know if you're if",
            "start": 295.12
        },
        {
            "text": "Being married is awesome, from Sunday.",
            "start": 330.32
        },
        {
            "text": "guys whenever I want she gets it she gets that's that's a part of my life um and she doesn't put crazy expectations on me um but there is always like I always say being married Is Awesome from Sunday to Thursday like those days are fantastic I love the Sunday movie like last Sunday my wife and I just watched old Bond movies all day and she was cool with that and that's great but it's when you go out on Friday and Saturday that you're missing that thing right that special Like Anything could happen I'm holding to No One Tim you could wind up in Mexico on Saturday and no one's going to care except I'm just going to want to hear the story on Monday morning and live vicariously through you know the stories you're not going to get exactly yeah probably not so I mean that's that's just but you lived those stories you don't need them again I did I did and that's and that's and that's you know a message I would say to anyone that's that's listening that is younger contemplating a committed",
            "start": 367.16
        },
        {
            "text": "lived those stories you don't need them again I did I did and that's and that's and that's you know a message I would say to anyone that's that's listening that is younger contemplating a committed relationship there is no such thing as sewing your wild oats you never get beyond it I tried to go literally the entire podcast last time without saying the word that word but I I don't think that you ever get to a point where like I've heard people say I've had my fun when I get married and I think that's just that's a really horrible thing to say why would you want to say that right so my wife and I I have more fun with my wife than I've had forever cuz we just don't think about it it's not that kind of fun it's not that dirty kind of well some of it's that dirty kind of fun yeah be honest give me a high five too but I do miss that I do miss a time in my life and this is something by the way that my wife and I talk about a lot where we're like we do miss those crazy",
            "start": 407.56
        },
        {
            "text": "give me high five too but I do miss that I do miss a time in my life and this is something by the way that my wife and I talk about a lot where we're like we do miss those crazy times when you were single because do you ever have a hall pass uh I don't get a hall pass I saw a documentary about this once yeah it was with Owen Wilson I think yeah um we talk about we talk about our fears of just being together forever and what that sort of entails is that a nice way to say is that terrible we talk about our fear of being together forever isn't that what the ring is for isn't that what it's all about no I mean you know you want to be with someone but you don't know what you're going to want 10 20 years from now Wings well I know you're going to want that you never know you might develop an allergy to salt I bull it to the brain you wouldn't be able to eat anything you'd have to eat like butter lettuce and I like butter lettuce",
            "start": 444.36
        },
        {
            "text": "going to want that you never know you might develop an allergy to salt, I'd be able to eat anything, you'd have to eat like butter lettuce and I like butter lettuce and coconuts or some stuff, I've been hanging out with you way too much cuz the first thing I was going to say was butter lettuce, L but I love butter lettuce, I buy by the head, butter lettuce, the one when you buy the ones with that you can see the roots, The Roots do you buy that one no I don't buy the ones with the roots still in it, but I bu I don't know what butter lettuce is, it's a really delicious type of lettuce, well far as Lettuce go Greg just likes it cuz it has the word butter in it, I do not, that is not the only reason I like it cuz it tastes delicious and I can imagine little pieces of butter in it but I digress um that's that's that's the only thing I think of I think that I look at you guys I look at the guys that go out and I have other friends who are married now and go the reason oh",
            "start": 483.04
        },
        {
            "text": "in it but I digress um that's that's the only thing I think of I think that I look at you guys I look at the guys that go out and I have other friends who are married now and go the reason oh you hang out with those young guys and I'm like yeah they keep me young for one they keep me my toes and I do enjoy hearing the stories of you guys going out and doing crazy things there is something vicarious about it no doubt about um and you do miss that you will miss that when you do get committed on some level especially when you've had them you're like I don't know Tim Gettys is only five years younger than me but I feel like he's even younger than that well you grew up in the hard streets of the island yeah no doubt the island over here Street Daily City exactly SF SF I grew up in SF I'm in Daily City now you're a West Coast happy about what's funny is you come out you come out you've never been you talk harsh so Tim Gettys talks harsh and he wears ugly sweatshirts he was awesome",
            "start": 518.04
        },
        {
            "text": "Daily City, now you're a West Coast happy about what's funny. You come out, you come out, you've never been, you talk hard so Tim Gettys talks hard and he wears ugly sweatshirts; he was awesome, swe, he's super into gangster rap. I'm not into gangster rap; he's really about the streets, no, he's really about tagging; he's about the trilogy, tagging, and getting out there and like fighting for your turf and holding down your corner, you know, basically if you've seen The Wire, that's Tim; he's not the cop, he's the other guys that are selling the crack. Makes sense, um, but yet he went to the Middle School in my neighborhood which is like the whitest 'hood in San Francisco; it's super white now, no, it's not, no, it's not the Marina, yeah, oh my God, everyone around there is super Marina. Middle School is super Asian; it's like 80% Chinese, yeah, I can just imagine that's why I mean you're in the Sunset right now, you're this is Asian HQ, yeah, and they all go there for school because they don't want",
            "start": 559.64
        },
        {
            "text": "is super Asian, it's like 80% Chinese, yeah I can just imagine that's why I mean you're in the Sunset right now, you're this is Asian HQ, yeah and they all go there for school because they don't want to go to Presidio or Roosevelt because they suck, why did you say they like that, that sounds racist, they want them to go to good schools, guys, racist, yeah there's no good schools in the Sunset, there's that one like creepy ass Sunset High, no one wants to go to Hoover, Greg let me ask you a question, mhm because you are divorced right which is something that surprises first of all from the table to be divorced probably not last probably not the last statistically speaking California 50/50 um will you get married again oh yeah you think so big time really yeah yeah you liked it yeah marriage is great marriage F yeah having a partner is cool having someone you know you can rely on you have a partner right now yeah I know and I know I can rely on her she's great but you're going to so you're",
            "start": 601.64
        },
        {
            "text": "great marriage F yeah having a partner is cool having someone you know you can rely on you have a partner right now yeah I know and I know I can rely on her she's great but you're going to so you're going to marry her yeah not going ahead herselves we'll see how the cards go it's one of those things I think now that we I you know fool me once shame on you I mean you know what I mean like it's one of those like I will I'll look a little more into it as far as like that that's the only thing like I I have no plans to not beer anytime soon you know what I mean I'll probably the fact that he refers to her by her last name still that's how we do we're military rank see that's going to be weird call her Miller later no you guys get married I call Herr a lot too just in casual conversation what's fun about that Tim is they don't actually have to change their last names as proof they do my wife they want to be with me oh really yeah she didn't change yeah if you're one of these new wave",
            "start": 642.6
        },
        {
            "text": "what's fun about that Tim is they don't actually have to change their last names as proof they do my wife they want to be with me oh really yeah she didn't change yeah if you're one of these new wave **** husbands I would marry you just for your last name you can change your name to Scarpino now I'm fine with that adopt him I tried to adopt him apparently there's a law against adopting someone who's 24 years old upet weird I was trying to write him off my taxes too we're spending a lot of time your dependent you raise a good point Colin that me and Christine talk every so often about marriage but it's not like something either of us are like super like yeah let's go do that but like we we talk more about like but we bought this TV together or we're together as long as that TV's together I'll tell you what a good ass TV have like Seinfeld's Kramer or like uh Newman in the signficant episode decided to cut the bike in half when when they couldn't decide if it was uh Kramer's",
            "start": 681.88
        },
        {
            "text": "TV's together, I'll tell you what a good ass TV has like Seinfeld, or like uh Jerry in the signifiant episode decided to cut the bike in half when when they couldn't decide if it was uh Jerry's or George's - that's what that was. I got there in the end. Yeah, how you guys doing? Well, that's interesting. I'm I'm gonna get married. I like being I like being coupled up. I like I like having a partner especially don't know why you wouldn't unless you're like one of those people that just want you know to get a piece of strange every weekend like just going many times have you used that term since you heard me say it a million? I love that was last week right isn't that last time we did the show we F out like two weeks ago but ever since any chance I get piece of I thought I was with you when you learned about it was it was here but we didn't do the podcast that week it was some other stuff oh yeah what conversation Colin Greg yeah",
            "start": 720.12
        },
        {
            "text": "chance I get piece of I thought I was with you when you learned about it was it was here but we didn't do the podcast that week it was some other stuff oh yeah what conversation Colin Greg yeah you check them out you can name drop the other shows on this channel every day of the week nerdy conversations yeah yeah like who wouldn't want to be with somebody unless you you're one of those people that don't want to be with somebody see I don't like you're talking about Thursday through Sunday or whatever no Sunday through Thursday I like it on Friday when it's just like we come home and it's just like guess what I'm tired I'm old it's whenever Damon Han Le do these the Monster Zero shows and these Damon shows and he comes out like all right we're going to go party on Friday I'm like **** man I am old you're do you're starting your DJ set at 10 o'clock on a Friday sorry sir I'm going to bed yeah so I mean that's that's sometimes Mo 90% of the time that's how I am right I want to go home",
            "start": 756.48
        },
        {
            "text": "I am old, you're starting your DJ set at 10 o'clock on a Friday. Sorry sir, I'm going to bed. Yeah, so I mean that's that's sometimes Mo - 90% of the time that's how I am right. I want to go home on Friday night, I want to get something good to eat, a burrito, usually I have three places I go to: one place in the marina for delivery, and another place now too, right? The place that delivers is also in the marina. It's called Los Tacos (not \"loast\"). Now you're off carbs and stuff, right? Well, no, I'm back on carbs - that's a whole other subject over here. Try to do the low-carb diet; I used to do Atkins originally, doing a low-carb diet which I recommend, but only in short periods like 24-36 hours. No, I mean it's a phenomenal diet, it's just not very healthy for you and anyone who is going to do it - you should look up the technicalities behind it because it's harsh on your body. Uh, but I did what's it do to...",
            "start": 791.76
        },
        {
            "text": "diet it's just not very healthy for you and anyone who is going to do it I you look up the you know technicalities behind it because it's it's it's harsh on your body uh but I did what's it do to your body make you poop weird you uh well yeah there's that CU you a lot of fiber so you got have fiber supplements but also you just lose um you I I lost a lot of energy where I was like I couldn't process information my brain wasn't working as much as I wanted it to um and I was actually going through what felt like withdrawal symptoms from carbohydrates which is like it's silly to say but like if you don't give your body the thing that it generally uses to burn for your body would want that your body wants that you start shaking a little bit and I couldn't focus in meetings and I wouldn't I didn't have my U cuz you're so focused in meetings every other time I'll focus on the blog that I'm reading on my phone there a forum I'm trying to post on I can't remember my login because I have 3,000",
            "start": 833.6
        },
        {
            "text": "have my uncle cuz you're so focused in meetings every other time I'll focus on the blog that I'm reading on my phone there a forum I'm trying to post on I can't remember my login because I have 3,000 passwords for everything that's so goddamn annoying um are we close to the retina technology yet where that can just be my password for everything can we just all agree that none of our information is private and or worth guarding anymore and just move on with it we don't need passwords anymore I love it when you go to these dumb sites like Roost your teeth and they're like oh it's got to have an uppercase letter and a lower case here it's like **** now too they're asking for like you need at least this many characters they can't repeat you also need a number you also need a symbol sacrifice the blood of a virgin it's just like virgin blood is actually the easier thing to figure out yeah well at work that's the thing is like we you know we have a lot of these like uh not proprietary but think",
            "start": 872.12
        },
        {
            "text": "a virgin it's just like Virgin Blood is actually the easier thing to figure out yeah well at work at work that's the thing is like we you know we have a lot of these like uh not proprietary but think like you know like our expenses and our and like and I can't remember any of these passwords I literally every time I log in I reset the password works it's like literally every other week Jucker tweeted something along the lines of like my my password for most sites is that I forgot my password link just the easiest way like yeah you come in there it would be easier I always think of I have passwords I just Shuffle around it'd be easier if they said enter your password and then parentheses it needs to be this long and have a period in number like okay great now I know which one I'm using yeah **** a FNA a Colin so marriage yeah so marriage I ultimately look it was none of this I love my wife I how long you been married now uh a couple almost a couple years now no what just barely a year",
            "start": 908.4
        },
        {
            "text": "**** A Final Fantasy XIV Colin so marriage yeah so marriage I ultimately look it was none of this I love my wife I how long you been married now uh a couple almost a couple years now no what just barely a year it seems like so much longer so much longer I just remember this turn it out very good we had we had no way it's been longer than a year no we've been together for like six years no not St togetherness you've been married longer than a year we got married August August 30th it's about a year and some change year and three months I was going to say if it was a year and like we weren't invited **** you oh no August I'll let you slide on that's fine I didn't know you I was still looking for a Tyro replacement you were F you were yeah you got me shorter squater less hair more fun you eat you eat pizza I do eat pizza Ty want like a goddamn hummus platter or some **** boy I used so I used to live with Tyr you know that was terrible there were times in my life where I was like why does the",
            "start": 952.48
        },
        {
            "text": "pizza I do eat pizza Tim want like a goddamn hummus platter or some **** boy I used so I used to live with Ty you know that was terrible there were times in my life where I was like why does the male need to be in the freezer you know that Tim I think it's at is it at Ty who Tim ask question what happens God bless Ty yeah he's a good dude oh I love Ty we I hung out at Damon's party with him all night cuz he came not in costume so he was sort of ostracized he ostracized himself and I didn't BR my costume I tore it yeah and I asked him every time I asked him BS every time I asked him what happened to his costume it changed the story changed at one point it just like at one point he literally and we were drunk by the way so when Ty gets drunk his stories get ridiculous but he legitimately said that it just tore a part of its own valtion like it just it just spontaneously just gravitated away from body did he say what he was he was Ryu from Street Fighter that's what he said I don't know I",
            "start": 996.6
        },
        {
            "text": "that it just tore apart part of its own vaultion like it just spontaneously just gravitated away from his body did he say what he was he was Ryu from Street Fighter that's what he said I don't know I didn't see the costume but he said the night before it just completely as if he took that one final step and the whole thing just all it couldn't hold itself together and just fell off his beautiful body with his great abs I mean that makes sense he's a good looking dude he's a great looking dude my favorite thing about Ty is now he isn't on his car anymore but on his old car big 311 sticker on the back of it yeah really yeah yeah I can't I don't even remember Ty having a car funny story about that so I was like Ty you're really a big fan of 311 right he's like huge fan huge he kept that going for like three years I was like dude you should play some 311 he that sticker was on the car when he bought it yeah he wasn't a fan of 311 at first he just was with us the entire time uh yeah well because",
            "start": 1042.88
        },
        {
            "text": "like three years I was like dude, you should play some 311. He had that sticker on the car when he bought it, yeah, he wasn't a fan of 311, though. He just got with us the entire time we uh, yeah, well, because he knew that 311 is like my favorite band or whatever and and uh, he had seen them live or whatever, like when he was younger. I'm not saying he's not a fan of them; he's not a big enough fan to have put a sticker on his rear window, but I remember having conversations with him about what's your favorite record and stuff. He would talk about the records that I imagine he listened to when he was younger, when they were good or whatever. So I'm like, okay, you're a casual fan, an OG fan, yeah, yeah, that's okay, that's okay. He's a great guy; better looking than almost anyone I've ever met. So Bren II, he was calling him a br, I used to call him a cartoon pilot, that's what he looks like, that's a great idea, like for Wings, like when you draw when they draw. I was getting ready to transition but",
            "start": 1085.64
        },
        {
            "text": "so Brian IIs he was calling a Briscoe I used to call him a cartoon pilot that's what he looks like that's a great idea like for Wings like when you draw when they draw I was getting ready to transition but we're going to talk about Wings so Tim and Danny Tucker yeah I love that show Taxi Tony Shalhoub on that show yeah the taxi driver so good not as good as he was in Monk but pretty good Thomas Haden Church Church fantastic Ray Romano whoever he was he never went to he never did anything again that's his name the one that was his character name oh big fat guy he was the guy from the competing airline yeah but he was their friend too every all sounds made up I don't believe any of it exists Wings Tim if I if I if I can I mean back in the day TV shows could be on with just paper thin premises and nobody on the show could be attractive uhhuh you didn't have like remember that like there was one person on Wings that was attractive the blonde chick that the brothers used to fight over right no they did but she",
            "start": 1120.84
        },
        {
            "text": "Could be attractive, uh-huh. You didn't have like remember that like there was one person on Wings that was attractive - the blonde chick that the brothers used to fight over right? No, they did, but she wasn't that hot. I mean, if you look at photos of her right now, she is not that attractive. No offense to her; I'm sure she's watching. I know, yeah, I'm sure she's just waiting with bated breath for the next GameOverGreggy episode to go on YouTube. Um, you're a partner in this channel and you struggled through every word of it - I've never said it before, that's the first time I've said it in public. Um, case point: you guys love cheers right? I remember you guys talking specifically about Christie Ali was actually... I'm going to take back; she was hot. Yeah, she was really hot. Wasn't Chris Alli hot, but what's her name - Shelly Long wasn't hot. No, she wasn't. They rep the hotness of Christie Ali with Shelly Long so you... oh no, no, no, no - that was the other way around; that was the other way around. Yeah, you're crazy, dude. Shelly",
            "start": 1167.16
        },
        {
            "text": "\"Hot no, she wasn't. They repl they repl rep the hotness of Chris Alli with Shelly long. So you oh no no no no that was the other way around that was the other way around yeah you're crazy dude. Shelly long then Christy Ali was it sh long then C okay my bad anyways is this girl hot yes she had That 80s bangs, 80s bangs she's 80s hot yeah she's hot as hell dude what if I told you the show was in the '90s not the 80s then that's I mean dude. Show her picture of her now cuz I saw that the picture of her now on IMDb and she looks good oh Chris Bernard, that's my jam look in here I mean that's a bad picture I'll ad I'm going to let you I'm going to let you in a little secret she's more attractive than I remember show that picture yeah attractive than I thought you than I remember her. You want to say the name so people at home can do she's all right she's all right I mean Crystal Bernard, Crystal Bernard is her name is she was she could know sh I don't think I don't think the cast of this I almost\"",
            "start": 1207.84
        },
        {
            "text": "the name so people at home can do she's all right she's all right I mean Christina Applegate Christina Applegate is her name is she was she could know sh I don't think I don't think the cast of this I almost said Shelley Duvall which would have been really not I'm just saying that's that's actually a good cast photo maybe I'm I'm just young stupid I guess she was hot she's not she's not I don't think she's that great in the final season she was hot too oh man yeah John Ritter's Gooding John Ritter's wife is amazing wait so was was she a thing cuz I just know her was like the mom in every shitty show like she's the stereotypical mom character the that only ran like she was the antithesis in personality to Christy Alley's character on Cheers so when she left the show which I don't know why she left the show she left the show to go be a big movie star okay uh Christy Alley didn't work out Christy Alley who I believe did not do the next Star Trek movie because she was doing cheers um because she was in Star Trek II: The Wrath of Khan",
            "start": 1255.84
        },
        {
            "text": "The show to go be a big movie star okay uh Chris Ali didn't work out, Christie Ali who I believe did not do the next Star Trek movie because she was doing Cheers. Um, because she was in Star Trek II: The Wrath of Khan. Chris Ali was yeah, she played the Vulcan, yeah Shelly Long just ended up in like a movie that did not work out for Shelly Long; she made the bad move there. I think it's widely regarded as a big failure, leaving Cheers. Yeah, I I I mean it's hard right? You you hear those stories about back in the day when you know you have guys like uh you got guys like Tom Selleck being off of Magnum P.I. to play Indiana Jones and a new Steven Spielberg movie called Raiders The Lost Ark and he goes no, I can't get out of my contract for Magnum P.I. so you know that basically he's done with movies forever; like didn't really have a great movie career but he was Magnum P.I. mhm so it's hard not to take that risk. I you have agents would you like would you like Sam, Amy Weissbeck trivia? Sure, Amy Weissbeck being the",
            "start": 1296.4
        },
        {
            "text": "really have a great movie career but he was Magnum P.I. mhm so it's hard not to take that risk I if you had agents would you like would you like Sam Amy Weissbeck trivia sure Amy Weissbeck being the attractive the super hot redhead who married John Ritter he's passed away all right you ready he died which broke the month of September is related to all the members of her family Amy was born on the 12th her husband was born on the 17th and died on the 11th her daughter was born on the 11th Amy was married on the 18th There You Go Go Wings Boom the biggest example of the of the fail the biggest example of the failed leap was do you guys Tim won't remember this but we can we can fill him in older you guys know the Hogan Family oh yes the Hogan Family the Hogan family was once called are was talking Paul Hogan from Crocodile Dundee Hulk Hogan no the the Miller boy the millerboy at sitcom the Hogan Family about the pilot no idea what you're",
            "start": 1342.16
        },
        {
            "text": "The Hogan Family, the Hogan family was once called are was talking Paul Hogan from Crocodile Dundee, not Hulk Hogan, no, the Miller boy, the millerboy at sitcom The Hogan Family about the pilot, no idea what you're talking about, it was, what you don't know, The Hogan Family bring up a picture maybe that'll spark him out so The Hogan Family started in a show called Valerie, you guys, you and I we all grew up, oh man, that was going to be my other topic, h i remember what my real topic was going to be, bring up the Hog family, Greg, I got it, I'm on it, you guys lived in an alternate universe to me okay because you guys were all about Boy Me's World, it's all when I was all about Saved by the Bell and like Beverly Hills 90210, this is the you don't remember Jason Priestley's breakout, you don't remember this show, it's it's yeah first of all Mrs. Poole is one of the iconic characters in sitcom history which one's the redhead, the fat redhead, she was also the Bad Neighbor on Facts of Life wasn't she no oh my God",
            "start": 1389.44
        },
        {
            "text": "The GameOverGreggy Show Ep. 2\nMrs. Pool is one of the iconic characters in sitcom history, which one's the redhead, the fat redhead? She was also the Bad Neighbor on Facts of Life, wasn't she? No, oh my God, Nick, no, that wasn't Mrs. Gettys; she was St. Elsewhere. She was right, that is 100% correct, yes, but I don't remember the show at all, and I'm sure I watched it. So, all right, so here's the story: Valerie was a show, Valerie Harper, I know Valerie, all right. So, Valerie Harper thought she was big time and she left the show to go do her own thing, which failed; they remade them, they brought in Sandy Duncan, who is like a famous actress, to fill in, yeah, and like one season too wasn't it something ridiculous like she did one season of Valerie and left. Sandy Duncan came in and was the aunt of these children whose dad was an airline pilot, yeah, that was never there; it took place in Chicago, telling you serious. I know I've watched the show, I'm just not blanking on it; it's got that's Valerie no.",
            "start": 1432.4
        },
        {
            "text": "whose dad was a pilot airline pilot yeah that was never there it took place in Chicago telling you serious I know I've watched the show I'm just not I'm blanking on it it's got that's Valerie no this is Sandy Duncan bring up I got they're calling it all Valerie for some reason but it was Val but yeah that's crazy oh Through The Years remember that was their song their sound through the years wow I thought about the Hogan Family quite some sometimes wow I I'm literally blank life is such a sweet Insanity take me more you learn the less you know yeah that's that's the  hot  that's when that's when singing voice that's when songs took yeah we should that's when songs took 90 seconds remember like it was it wasn't this instin culture we live in where you got to write what you wanted yeah you can't like nowadays you got to do you got to do everything within the first 5 Seconds of seeing anything or otherwise you'd lose I mean let's take this let's not take this for granted that",
            "start": 1484.44
        },
        {
            "text": "yeah you can't like nowadays you got to do you got to do everything within the first 5 seconds of seeing anything or otherwise you'd lose I mean let's take this let's not take this for granted that Mrs. Po in the Hogan family was running concurrently with Small Wonder she was the annoying neighbor in every show in The Lady and the Tramp and did she not did Mrs P not jump what her name what is her the actress's name Edie McClurg or something like okay right something like that yeah Edie McClurg so Bonnie Brindle you've seen her a billion times she's amazing if I ever got a chance to hang out with her now correct me if I'm wrong though about this was she not in Step by Step as well she was in Step by Step I believe yeah oh I can just click on her I'm right here I don't remember her being in Step by Step I believe she was in Step by Step as one of the neighbors that's the show with Patrick Duffy Summer yeah yeah boy Suzanne Summers you remember that",
            "start": 1535.96
        },
        {
            "text": "I don't remember her being in Step by Step, I believe she was in \"Step by Step\" as one of the neighbors, that's the Stephanie Powers show Summer's yeah yeah boy Suzanne Summers you remember that show? No, you don't mean I no, that's not where Urkel came from, right? No 's uh Family Matters but then he had his own show right? No what was the spin-off from Family Matters something spun off to be \"Family Matters\" uh it was two Perfect Strangers yeah the maid was uh the mom no the mom was the elevator operator at the newspaper oh my God see that was back in the day when like ten I know this is going to blow your mind but back in the day there was not this thing called the internet, there was not this thing called cable television wasn't very prevalent and phones still had cords that had be attached to walls and there was only like six channels or seven channels of network television that you could access have access to it in a given time you didn't get to pick there's no such thing as a",
            "start": 1574.84
        },
        {
            "text": "to walls and there was only like six channels or seven channels of network television that you could access have access to it in a given time you didn't get to pick there's no such thing as a video on demand whatever was on was on so you were forced to watch these shows everyone watched Small Wonder Al blew my **** mind see I get I get this but not those shows no well you were too young though you didn't watch those but spin-offs but spin-offs were the spin-offs were and that was my point of that spin-offs were just natural they were just like like Cheers everyone had a spin-off of Cheers and all of them failed except Frasier which then became even almost arguably but like yeah like The Perfect Strangers to to uh uh Family Matters spin-off is weird The Golden Girls to Empty Nest spin-off that's really weird was weird who was that with so Empty Nest you know Golden Girls which is still one of the great shows my ally Empty Nest is about the pediatrician that lives down the street from",
            "start": 1618.4
        },
        {
            "text": "That's really weird, who was that with? So Empty Nest, you know Golden Girls, which is still one of the great shows. My ally, Empty Nest is about the pediatrician that lives down the street from the Golden Girls. No, and they after like two episodes he was in randomly; they spun it into its own show about his family, which lasted like four seasons. Then they spun Golden Girls into The Golden Palace. The tall guy, right? Yeah, like the tall, tall older dude with that very deep voice. Elliot Ness is not the that was his character name. Is that right? Elliot Ness is definitely not the name of the actor or the character on the show isn't Elliot Ness; like a criminal or something. No, he was an FBI agent that was famously made famous by... You're all about to eat your words because I'm going to go crack this one. No, I want to know that guy, that guy's name, because he was in a lot of stuff. How the **** did we get from marriage to Empty Nest? There you go; his name is Richard Mulligan, and his character name was Dr.",
            "start": 1662.76
        },
        {
            "text": "one no I want to know that guy that guy's name cuz he was in a lot of Stu how the **** did we get from marriage to empty nest there you go his name is Richard Mulligan his character name was Dr. Harry West, Harry West he was in something really really big a big show it wasn't empty nest before that so look up yeah you got to look up his soap opera \"Soap\" and also \"The Love Boat\" and Company yeah Hey Arnold! hey **** Arnold who he one guy he's Jimmy Kimmel proba character he died in 2000 well this goes the other way look up he and picture of them yeah that's insane stuff **** love Babes in Toyland yeah what do you want me to look at no don't know I should we move on Greg what's your topic Greg what he was EX exini in Star Trek judgment rights a video game in 1993 Noe all right my topic is one you might have seen in the news do you see see these skydivers almost die no no so these skydivers are are SK getting ready to skydive con they got two planes they they're all wearing GoPros like a bunch of",
            "start": 1702.56
        },
        {
            "text": "have seen in the news do you see these skydivers almost die no no so these skydivers are getting ready to skydive con they got two planes they're all wearing GoPros like a bunch of idiots cuz they're skydiving like a bunch of idiots one plane's down here the other plane's up here this plane comes in and crashes into the top of this plane and then sets it on fire it explodes everyone jumps out of all of the planes except for the one who lands this plane and everybody survives wow it's all on GoPro camera it's all out there it's up in Wisconsin that's unbelievable everyone survives the one guy who I think is the pilot of the first plane he ends up landing and being all right but yeah everybody got out they even the pilot of the first plane got out and he had his emergency parachute his little red one it's just crazy so my questions here are many would any of us here skydive have we skydived I would 100% I want to I used to say this",
            "start": 1753.2
        },
        {
            "text": "and he had his emergency parachute, his little red one, it's just crazy so my questions here are are many a old would any of us here skydive? Have we skydived? I would 100% I want to I I used to say this **** all the time and then somebody came into our show and new one day we finished the episode that the other way he's like appreciate that it's fine me and Colin blow burps in each other's face for fun he comes up and he's like hey you know if you ever want to come shoot something for us at noon I'm a Scot, I'm an instructor, I can get you up and I go great nope and it was one of those for my entire life when skydiving wasn't an immediate possibility I was like totally I'll do that that sounds awesome y y be like Superman Y and as soon as it was presented knee-jerk blank mind reaction no **** way why cuz I don't want to it sounds so fun yeah it does what if it I mean it's not even it's not even the thing of death I think you have to do this now it's not even death that scares me it's just that I",
            "start": 1795.6
        },
        {
            "text": "cuz I don't want to, it sounds so fun, yeah it does, what if it, I mean it's not even the thing of death, I think you have to do this now, it's not even death that scares me, it's just that I I it seems like I'd be sick to my stomach, I wouldn't want to do that, ition sick to me, I have this theory that like people are scared of roller coasters, I don't get that if there's people waiting in line to go on this thing it's fine, like yeah you could die, you could die doing anything, like if you're if people pay to skydive and like there's like you have to be all trained and there's all this like there's rules and stuff if that institution exists you're fine, yeah but again but that's not see I don't like roller coasters for the same reason I just get I get sick myally it's safer to skydive than it is to do yeah this is when they always do the whole thing it's like it's safer to drive a car than it is to or safer to fly on a plane than it is driving but that's just I guarantee both",
            "start": 1836.88
        },
        {
            "text": "than it is to do yeah this is when they always do the whole thing it's like it's safer to drive a car than it is to or safer to fly on a plane than it is driving but that's just I guarantee both those are safer than skydiving put that out there I hate that argument Superman uses that all the time too statistically speaking better to you know be in the plane than a car there's not as many planes in the air as there are cars Superman says that yeah in the movie the movie Christ twice actually good movie oh yeah really good film but there's not there's not as many planes in the sky as there are cars in the road that's true but I think any **** can drive a car there's not as many people skydiving as there are cars in the road the one thing that sometimes will get me on plane when I'm thinking about it is like the one day that I know air traffic control is going to **** up and run two planes into each other that's definitely going to be on your watch too you're going to live",
            "start": 1877.6
        },
        {
            "text": "I'm thinking about it is like the one day that I know air traffic control is going to **** up and run two planes into each other, that's definitely going to be on your watch too. You're going to live through it though, no way. Well now it's going to happen now that I'm allowed to play on PS Vita before, like well so here's the thing that I I I think I told Cheryl this um his girlfriend, that's my girlfriend, and it's kind of a dark thing because we fly a lot, we fly over the world and I told her like being in a plane crash or being like in a like in a situation where your plane's crashing is probably **** horrific like horrifying. But there's got to be a moment of clarity when that's happening to you, being like I can't believe that this is actually happening mathematically this is so improbable and I can't like it's almost like you can't you know what I'm saying like you I think I literally every day every time I go on a plane flight which arguably is not as much as it used to be.",
            "start": 1917.64
        },
        {
            "text": "improbable and I can't like it's almost like you can't you know what I'm saying like you I think I literally every day every time I go on a plane flight which arguably is not as much as it used to be because I make Tim Gettys go now um for all those trips he's what's it going to be like when his blood's on your hands I'll be fine I won't think of it mostly who are we going to get to fill in for Tim on this show we'll get Mike or Ty, Ty would be fun too he'll give some awesome dating advice um wait hold on a second this sounds like another podcast you can get somewhere else super knocking boo but every time I go on a plane ride I think you know statistically speaking take off take like takeoffs yes and landings that's what they call them are the most dangerous right that's where most accidents happen incidents happen when it comes to flying so I think to myself right as we take off and then we level out I'm like that's the closest coming to death all week wow and once that's over I'm like",
            "start": 1956.24
        },
        {
            "text": "Happen incidents happen when it comes to flying, so I think to myself right as we take off and then we level out. I'm like that's the closest I've come to death all week, wow. And once that's over, I'm like whatever. I mean there's that one moment where you have to go, \"Am I going to be a control freak and try to do something or just let go?\" And I always just go let go. See, to me, that moment is always when the lights start flashing randomly. That happens every flight - there's always that one time where it's like, \"That's when they reset the power.\" Like, why do they do that? That's not right for people like me who can handle it; I don't really care, but some of the people next to me, I'm just looking out for them. I'm not scared - you're a real humanitarian, dude! What's crazy about San Francisco specifically is how hot it is in San Francisco. Like, have you ever sat next to someone who's never flown into San Francisco? Every plane ride right, someone around me asks if we're making an emergency landing.",
            "start": 2000.16
        },
        {
            "text": "is your hot in San Francisco like, like you like have you ever sat next to someone who's never flown into San Francisco every plane right? Someone around me asks if we're making an emergency landing cuz it looks like you're landing in water in the water and then you make it that and it's always like, and it's always like this until like the last second cuz the wind is like going crazy and then suddenly it just evens out. Yeah, but you're coming in hot and there's no other place I've ever landed that's like that. Oh, Vegas, I went to Vegas once and it was terrible, like that. We were coming in, it was something about the way that temperature was changing from it that was the worst turbulence I've ever had. I had been on a plane though one time down to LA where I was like holy, we dropped like 70 feet, you're like what? Yeah, it felt like we dropped like literally it",
            "start": 2036.84
        },
        {
            "text": "like holy **** where like the the plane definitely like lost like an unusual amount for no reason you dropped like 70 feet you're like what yeah it felt it felt like we dropped like literally it was like it was more than like one it was you know it was like one like that that whole like yeah time it wasn't just like a you know I was like holy **** like I I remember being like Disturbed after that flight I can't believe that that just like that's not normal it was just an air pocket but that was like just not normal what what like percentage of those happening do you think the pilots are like we're cool versus **** we almost died like if we hadn't have just done that one cool avionic thing to save all these people's lives they'd all be dead right now how how do you think you've been on a plane when that's happened no I don't think so it's just normally good my mom used to tell me this story so my mom used to work for an airline um she was like a in charge of flight attendants",
            "start": 2073.72
        },
        {
            "text": "on a plane when that's happened no I don't think so it's just normally good my mother used to tell me this story so my mom used to work for an airline um she was like a in charge of flight attendants a Delta affiliate in New England for like many years and she used sounds like wings and she used to um yeah it was in it was near n and uh she used to tell stories about how like Pilots say and it's true like just in terms of aerodynamics that once planes are in the air they want to stay in the air like you have to actually try to get them to go down you know like it like the plane you know as long as there's an engine in like it's being propelled like it's not natural for the plane to just fall both of it Wings right well yeah exactly because something a plane is flying because of the the the the speed in which the air goes over the wing and under the wing and a minor difference between them that's why something LS that's the thing like when you run a gas in a plane like they",
            "start": 2119.44
        },
        {
            "text": "the speed in which the air goes over the wing and under the wing and a minor difference between them that's why something like when you run a gas in a plane like they tell things they'll glide for like an hour just trying to figure out what they can do so yeah like that once she told me that like when I was a little kid because I used to fly all the time because we used to fly for free she would be like the plane likes to stay in the air and it's it's it's true you know it's like a duck to water it's like a duck to water or flying through the air sure that's what he said making his move what do you got for me Tim topics no anything else on this matter you're done no more wing talk wait I mean hold on what was the original topic for this one skydiving SK oh let's go skydiving we should we should all go skydiving and we should all tie ourselves to each other that going to be don't know that they'll let us do that",
            "start": 2162.84
        },
        {
            "text": "Topic for this one skydiving. Let's go skydiving, we should all go skydiving and tie ourselves to each other - that's not going to be allowed on the first time out. That seems like some advanced **** but you can jump by yourself here. The other question to this one is how quickly I watched all the GoPro footage would I die by myself? I would, and when the plane lands comes down everybody's super excited, everybody's super excited they all lived. How fast do you think you go from the relief of living through this that everyone got out alive to what the **** were you doing one of you **** this up? What were you thinking? I'd be hot, I'd want to know immediately what happened because I have a flip, Tim has a flip, and I have that switch like just temper where I would just be like oh we're furious flames coming out of the side of my head. What the **** like who **** up? What happened but I don't know I'd",
            "start": 2202.2
        },
        {
            "text": "I have that flip the switch like just temper where I would just be like oh we're furious flames coming out of the side of my head what the **** like who **** up what happened but I don't know I'd like to believe thatd be levelheaded in the situation and think and and and try to figure out what there must have been a problem right yeah but it could have just been someone not paying attention the other crazy thing is that the fact that the plane crashed there's everybody bailed out but there was still flaming wreckage raining towards the Earth and what what happened did they ever figure out what happened I don't know I didn't read that much he just saw pictures the news story I watched I watched one of the news videos and I don't think i' ever talked about what happen but did they release the GoPro videos oh yeah good NBC News paid $100,000 to get it all awesome that's why I got you got to GoPro everything CU you don't know when that's going to be worth 100K see now this is",
            "start": 2243.12
        },
        {
            "text": "the GoPro videos oh yeah good NBC News paid $100,000 to get it all awesome that's why I got you got to GoPro everything CU you don't know when that's going to be worth 100K see now this is the other thing I was thinking about getting more than that you speaking of 9/11 not 9/11 speaking of uh airplane problems and San Francisco that plane that you know hit the ground and exploded out or not exploded but hit and lost its tail and everything went crazy there was I there I remember when as soon as it happened and the guy put up the video immediately like the photo of it on the ground or whatever that got viral right away and then like a day later uh a video from like across the bay somebody was doing it that got out but it was like only to CNN or whatever would if this happened and you witnessed one of these disasters you a part of it would you immediately YouTuber it or would you wait and try to sell it I would immediately YouTube it yeah everyone else should try to sell",
            "start": 2276.52
        },
        {
            "text": "one of these disasters you'd be part of, would you immediately YouTube it or would you wait and try to sell it? I would immediately YouTube it. Yeah, everyone else should try to sell what does that mean? Why because for me, I'm all about YouTube. I want YouTube. Wouldn't that be the same thing here? I mean, it would go up on GameOverGreggy maybe we get more eyes in this show if I did it for us. We should do a YouTube but like if you're just some random other person that doesn't do the whole YouTube thing, sell it, make money. I would sell it, make money. Sell it. We need those subscribers, you know? We need the views. Subscribe. People are going to come watch that and then they're going to watch this glorious show. And subscribe. Wow, I can't believe they... I can't believe those people all died in that horrible plane crash but I would like to know more about the perfect boob size. I like how you said a horrible telephone, I don't know where",
            "start": 2316.36
        },
        {
            "text": "all everybody died in that horrible plane crash but I would like to know more about the perfect boob dick size I like how you said a horrible telephone I don't know where the **** that came from everyone died that horrible teleph very late telephone booth I don't know why that's what happened sometimes a horrible game of telephone when ride sometimes Greg Miller black hole of reaching in and pulling something out for a podcast works sometimes it fails so 99% success rate so the good news about piloting an aircraft and you know like your safety and stuff like that is that even though everyone that works for airline that works for an airline are pretty low paid flight attendants are pretty low paid first officers make **** like nothing Pilots are exceptionally well paid so like what are we talking what does that mean exceptionally well paid what like six figures okay so they ought to be right same like surgeons yeah exactly like because they're so they respond",
            "start": 2351.88
        },
        {
            "text": "well paid so like what are we talking what does that mean exceptionally well P what like six figures okay so they ought to be right same like surgeons yeah exactly like because they're so they respond like first mates or first officers make like $35,000 a year eventually you stick around like you yeah and then like you you know that's why like there they call them crash pads like a lot of these Airlines like people share houses like they can't afford to live by themselves um but you eventually get to that point where you make a lot of money so at least the people that that are piloting these air these aircraft are you would assume responsible enough to make that much money and and stuck around long enough to learn how to do it you know I would hope so yeah I was I always give the thanks you know how like the cool Airlines I always kind of come out and no one realizes that's the person that just successfully took your life from one state to another I was giving them like the what's up",
            "start": 2395.48
        },
        {
            "text": "you know how like the cool airlines i always kind of come out and no one realizes that's the person that just successfully took your life from one state to another I was giving them like what's up thanks I appreciate it sometimes i try to give a pound you know you don't try to give anybody a pound like that and even if they can't if i can't reach them i'll give them that i'll give the whole shoulder pound yeah yeah you put it right in there yeah so they see behind me all right Colin what do you got for me the topic range okay oh is is there visuals to this oh man I hope there's an audio visual diary no there's not a visual I want to read you guys story okay tell me a story i'm gonna get a beer Nick Phil okay i'm not GNA tell i'm just gonna we'll talk about it when it's done okay you're going to read the story okay how long is the story i need to know if i need to muster all my energy to it's not super long okay just give me a few a couple minutes fair enough John Moffatt was",
            "start": 2434.84
        },
        {
            "text": "to read the story okay how long is the story I need to know if I need to it's uh muster all my energy to it's not super long okay just give me a few a couple minutes fair enough John Moffitt was unhappy with the lack of playing time in Denver he quit the NFL because he'd lost his love for the game and was tired of risking his health the 30-year-old guard from Wisconsin called the Broncos from his home in Seattle this week to notify them he wouldn't be returning to the team following its bye then he announced on Twitter that he was calling it a career saying quote football was fun but my head hurts ha kidding Roger Goodell who's the you know commissioner I'm on to new things thanks to everyone along the way end quote so hold on I'm going to scroll down Matty said he knows teammates and fans don't understand how he could forgo the fame and fortune of pro football quote I just really thought about it and decided I'm not happy I'm not happy at all and I think it's really Madness to quit",
            "start": 2472.84
        },
        {
            "text": "understand how he could forgo the fame and fortune of pro football quote I just really thought about it and decided I'm not happy I'm not happy at all and I think it's really Madness to **** it reset so God damn it it's one of those pages that resets after every few minutes and I think it's really Madness that you risk your body risk your well-being and risk IGN does that who does that IG does that no I've never had an article page no no on the Hub sure sure uh and I think it's really madness to risk your body risk your well-being and risk your happiness for money everybody they just don't get it and they think it's crazy but I think what I was doing was crazy he said he didn't want to see things through this season for the shot at a Super Bowl quote I don't care about the Super Bowl I don't I don't I used to I mean anytime I played the game I gave my heart to it and I'm a person that does things with his heart I don't need the Super Bowl experience I played in great games",
            "start": 2518.16
        },
        {
            "text": "Super Bowl I don't, I don't, I used to mean anytime I played the game I gave my heart to it and I'm a person that does things with his heart I don't need the Super Bowl experience I played in great stadiums and I played against great players and I had that experience and it's enough for him yeah great for him honestly I mean I've always said first of all let me preface this with, football is a sport yeah yeah they play with a pigskin um I've always joked that I'd want to be on a winning team but I'd want to be third string so that you get the best of both worlds right you get the minimum paycheck which is something ludicrous like what $700,000 in that's an NFL third-stringer it's the minimum salary minimum is like ridiculous, NFL right uh you also get pension so if you play a certain amount of years you get paid forever right or at least a good amount of your time yeah um which we could look up but I've always thought that'd be awesome but the problem with football is there's an",
            "start": 2553.76
        },
        {
            "text": "\"Amount of years you get paid forever, right or at least a good amount of your time? Yeah, um, which we could look up, but I've always thought that'd be awesome. But the problem with football is there's a very real reality to it, which is it could severely mess you up for life - it's like professional boxing, any career where you're getting a lot of head injuries, and they're just now... I don't know what it is, Colin maybe you can shed some light on this. Why is there so much coming out now about the head injuries and the concussions and what those can cause? Well, because I think you know, I think there's a few reasons for this. Because there was actually an interesting Frontline that was two hours long about... you know, Frontline's a great program on PBS, um, and it was about two hours long - it was specifically about head injuries and how the NFL like tried to hide for years what was going on with its players, and people used to talk about getting your bell rung, right, seeing stars.\"",
            "start": 2592.6
        },
        {
            "text": "specifically about head injuries and how the NFL like tried to hide for years like what was going on with its players and people used to talk about you know getting your bell rung right seeing stars um things like that and that was like almost a point of pride to people like that they were getting their Bell rung or they were ringing other people's bells and I don't think these guys lived hard and they drank hard and a lot you know like and they didn't live long enough to see the ramifications of it yeah but like as these players that played in this in like really the Golden Era of the NFL in the 70s and '80s today are crazy a lot of them you know not a lot of them like there's some of them especially linemen look at the helmets of an offensive lineman even today compared to the helmets of everyone else and how dinged up they are because they lead with their heads oh but I mean like so like if you're a wide receiver you're gonna be fine but if you",
            "start": 2631.0
        },
        {
            "text": "even today compared to the helmets of everyone else and how dinged up they are because they leave with their heads oh but I mean like so like if you're a wide receiver you're gonna be fine but if you know a quarterback or even a quarterback but he might take a wrong hit but I don't want to get into that um but uh so here's here's there there's more to the story uh Mafit 27 made about $1.5 million before taxes in his two and a half years seasons in the NFL how did he live on that little quote I've saved enough it's not like I'm sitting here and I'm a millionaire that's what I kind of realized I'm sitting here and I got to this point and I was like what is the number that you need how much do you really need what do you want in life and I decided that I don't really need to be a millionaire I just want to be happy and I find that people that have the least how many years did he play that he's not a millionaire yet two and a half years okay I just want to be happy and I find that people",
            "start": 2669.8
        },
        {
            "text": "I just want to be happy, and I find that people who have the least amount of money are sometimes the happiest. And I don't have a lot in life; I have enough in life, and I won't sacrifice my health for it. I mean, I think that's super admirable, obviously 90% of sports fans are probably like \"Yeah, I appreciate that.\" But in that situation, I would want the money; I would want to find a way to make it work. But I also just don't think anything is worth not being able to think past the age of 40, you know? We talked to Hunter about the same thing right where he was like Hunter Hill, who came on for a middle linebacker for the USC... uh, yeah, up and noon overdog, the app. Go download the app; you can play sports with people, but he mentioned the same thing, right? Where he was talking about he was like, \"Yeah, I just\"",
            "start": 2706.08
        },
        {
            "text": "for the Steve Young up and down overdog the app Go go download the app you can play sports people but he mentioned the same thing right where he was talking about he was like you know yeah I just had to stop I was hurting I had injuries um he could have come back right I mean correct me if I'm wrong yeah it wasn't like he had some debilitating horrible injury right but he just decided that he I talking about a guy who's he's like my age how old is he like 34 35 how old is he oh here we go cracking the knuckles getting on the iPad um and you know by all accounts when the guy moves still he's he's still with it he's he could have probably played a few more years but it's very admirable for someone to go I've done it I'm good you know never won the Super Bowl which is unfortunate but he went and that's more than a vast majority of human beings on this planet can say they did vast majority of players in the NFL can say that um can't say that and so it's admirable you know there every there's",
            "start": 2742.88
        },
        {
            "text": "That's more than a vast majority of human beings on this planet can say they did. Vast majority of players in the NFL can say that, um, can't say that. And so it's airable, you know? There every there's not a day that goes by that I don't hear a story about the NFL. Right today I was listening to the radio and they were talking about 33-year-old Richie Incognito, my age, um, wow, he's way better looking than I am. That's sad; he looks way more established in life. Um, he looks young. You know this morning I was listening to that story about The Bullying. Did you hear about this? Yeah, the the the uh Richie Incognito Miami Dolphins, which is insane. And and I mean you just this is a sport where you breed like ferocity right? You breed people who have to be like the meanest you can possibly get, and you're going to get when when you create that cycle of competition where the meanest wins you're going to get Insanity right? You're going to get injuries and you're going to get people that are really really hurting at the end.",
            "start": 2783.08
        },
        {
            "text": "you create that cycle of competition where the meannest wins you're going to get Insanity, right you're going to get injuries and you're going to get people that are really really hurting at the end of the day um it sucks because most people watch football because of the violence right same reason why I watch MMA sometimes or I'll watch like UFC because I actually I like watching the sport of it but let's be honest I like that sound of that impact right when someone lands a good punch and knocks the dude out that's just so cool you don't see that in everyday life it's the escapism and it's like rawest form wait is that why people watch football is that a thing well I think people watch it for the strategy but also it's watches it for that I mean people that watch football watch it they said that before for different reasons than baseball right baseball they say is a finesse sport right football is all about that play and that that just crazy energy that goes yeah when you think about",
            "start": 2826.48
        },
        {
            "text": "said that before for different reasons than baseball right baseball they say is a finesse sport, right. Football is all about that physical play and that just crazy energy that goes yeah when you think about football, right? What are you thinking about? You're thinking about these crazy ass moments that always end in a giant collision, right? That can't be good for human beings, yeah, yeah. I guess like the greater question to me is, and my girlfriend - who's a forensic psychologist, she's studied the brain, and she knows a lot about this stuff - we often talk about these brain injuries that these guys are incurring, even huge players like Junior Seau, you know? End up killing themselves, you know. And like we they don't understand why, and they study their brains as they die, and they give their brains to science, and they're realizing that love this sport or hate it - and I personally love football, you can ask Greg, I love",
            "start": 2861.0
        },
        {
            "text": "and they're studying these guys' brains as they die and they give their brains to science and they're realizing that love this sport or hate it and I **** love football you can ask Greg like I love literally allowed to record this on Thursday Night Football we can't record on Monday or Thursday so I watch every Monday night game every Thursday night game you do conversation with Colin on Sundays yeah like I W ask Greg I watch I watch 10 o'clock 1 o'clock and 4:30 games on Sundays that's specific time and I watch every Monday night game and every Thursday night game no matter who's playing and I watch the Jets every week but other than like I **** love football and I love the strategy of it I love that football is 90% in the classroom I love all that stuff I also love the big hits I didn't know that Sunday games are at 5:30 but no and five there I'm sorry and uh so football f so so with all of that said my point of view on this honestly is that it sucks that this is happening but",
            "start": 2896.64
        },
        {
            "text": "know that Sunday games are at 5:30 but no and five there I'm sorry and uh so football is so so with all of that said my point of view on this honestly is that it sucks that this is happening but you have to know what you're getting yourself into and there's a risk that this is going to happen right and I what I don't like there's a risk with anything that's professional athlete right exactly your body but I but I don't like that they're like I like that we can make football safer make the helmets better and all that kind of stuff but let's not remove what is in essence the violence out of the game because the violence in the game is really integral to the sport and what you're seeing you know is a lot of you know uh really just toning down the game like if you watch footage from the 70s or '80s oh my god they kill each other and like there was a sweet spot that think there's a sweet spot between that when it was you look at these people and they're like you know any of like the",
            "start": 2928.48
        },
        {
            "text": "or '80s oh my god, kill each other and like there was a sweet spot between that when you look at these people and they're like, you know any of the Monsters of the Midway Bears footage right, of them just like in pads flopping around destroying each other. Dick Butkus film, you know what I mean? But now you have it to the other extreme, that's our player from the Chicago Bears, you might also know him for My Two Dads. He was he was the soda fountain attendant anyways, um now you have it to like you know when they moved in the kickoffs so every kickoff goes out the back of the end zone now you can't touch a quarterback at all you know what I mean like there's so many little things they've gone and tweaked that just how long is the roughing the kicker rule that's been a thing for that's been a thing for some time but it's like that I always I always find that to be the one thing that I wish they could do away with because those",
            "start": 2975.0
        },
        {
            "text": "the kicker rule that's been a thing for some time, but it's like that I always find that to be the one thing that I wish they could do away with because those kickers no matter what quarter of the game it is, they're always pristine, they always have just a beautiful uniform, no one's touching them. I would want to be third string kicker if I could. No team has a third string kicker or even a second string; there's no room. There's no room for on the field, just wear the uniform and kick things on the sideline. Is that something they pay me for? Back in the day, the kicker and the punter were the same person because aren't they anymore? No, they haven't been for years, uh, because they're very different, super different skills; um, they seem similar in the vein but like the whole thing about roughing the kicker and roughing the punter is that they're often the collision often happens when their legs are extended and they get",
            "start": 3011.2
        },
        {
            "text": "Sim in the similar vein but like the whole thing about roughing the kicker and roughing the punter is that they're often the collision often happens when their legs are extended and they **** them like these guys are some of these guys are literally built like L literally built like I am you know like and like if they expose themselves to try to tackle someone then they're a football player and they're and and watching watching a kicker try to tackle someone or getting blocked all they ever do is just like try to push you out of the yeah like it's so some of these guys get creamed but like you know there's something to be said about that I always joke about as a Jets fan I hate the New England Patriots with a **** passion and we call ruining the pass, ruining the Brady because Tom Brady always gets these ridiculous calls or whatever. I agree, National Treasure, let me ask you this question: who's your favorite team? You get you",
            "start": 3050.92
        },
        {
            "text": "the pass ruling on Brady because Tom Brady always gets these ridiculous calls or whatever I agree you know National Treasure let me ask you this question who what's your favorite team you get you like the Jets right the Jets are like my favorite who's the quarterback of the Jets Geno Smith okay if you could be him for a year or Tom Brady for the rest of your life Who Would You Rather Be Tom Brady is one of the great quarterbacks of all time I just have also knocked out Jazelle so let's put that on the table I just I hate I hate Tom Brady and you know like what because he's too good-looking no it's because he plays for the Patriots and the Patriots and the Jets are not patriots you'd be you'd be okay with all that yeah but he has the taint like like for instance like he does have a taint like anyone that's played anyone that's played for the Patriots the problem like Greg will remember the the great quarterback Ty Law how could I forget Ty Law was like a great quarterback played for",
            "start": 3087.48
        },
        {
            "text": "like anyone who's played for the Patriots, the problem is Greg will remember the great quarterback Ty Law. How could I forget Ty Law was a great quarterback who played for the Patriots for years and then came to the Jets - I was like get out of here, he's really good, but I'm like, you know it was like when Johnny Damon came to the Yankees, I was like what the **** here's the deal folks, I'm not a huge sports fan right, I'm not, I've never been one of those guys... like when I refer to sporting events or teams, I've never said we're and that's a very distinct difference between me and guys on this side of the table. Tim's probably with me on this one 100% - when you say we're playing this Saturday or we won, you're referring to a team that's playing hundreds of miles away from you that you've never played for, that you've never been part of but you guys have this sort of connection to these teams that I just don't understand. Point I like that what's that I like",
            "start": 3126.84
        },
        {
            "text": "of miles away from you that you've never played for that you've never been but you guys have this sort of connection to these teams that I just don't understand point I like that what's that I like I like how you said that the whole Giants thing yeah I would never say that see that's we live in San Francisco right I've been to multiple Giants games the Giants have won the World Series now I think twice since I've been here right um and everyone's like we won and I still don't feel that connection to the Giants yeah because the Giants I mean I used to I go I used to go to Starbucks and see Brian Wilson uh uh what's his name Wilson would be at my Starbucks and he would be there with the beard and like weird fanny packs cuz super weird no he just when every where it apparently and girls would hit on him and it was like this the most amazing thing CU he looked at me and I'd be like he never once looked at you he's like and he's like hey Nigga what are you know he knew",
            "start": 3167.2
        },
        {
            "text": "and girls would hit on him and it was like this the most amazing thing CU he looked at me and I'd be like he never once looked at you he's like and he's like hey Nigo what are you know he knew who I was he he's tweeted at me check my Twitter feed he's tweeted at me multiple times long story short though is I see these players come in right which by by all accounts you know is hearkens back to the old days of baseball when like the Yankees right would be like they'd work their day jobs and then you'd see him playing at night or whatever that was like a really long longing back the be guy going to Starbucks because you don't see I mean you don't I wouldn't I wouldn't say like I mean I'm not seeing any 49ers going to my Starbuck right I don't see like guys that are they're human beings D what it was I'm all I'm saying is this it was nice to see these guys in the community right and yet still I did not feel like this was my team right is San Francisco your city no but up I didn't grow up",
            "start": 3206.96
        },
        {
            "text": "it was I'm all I'm saying is this it was nice to see these guys in the community right and yet still I did not feel like this was my team right is San Francisco your city no but up I didn't grow up in a city with with a professional sports team see that's the big thing is like there what you're talking about are shared experiences and that's what builds this kind of things ins you're just basically saying I'm screwed yeah no totally and especially if you don't like the sports or if you're not super from I don't give a crap about don't care about sports but all my friends that are from here when they say we I'm like yeah I get that that makes sense for you guys like they are fans and I was just as happy for them that the Giants won and I was like you deserve this you know what I mean do they deserve it what did they do what did they do deserve it just supporting them they Des World Series I was at a party a friend's birthday party where it just happened to coincided with the",
            "start": 3245.4
        },
        {
            "text": "Mean do they deserve it what did they do what did they do deserve it just supporting them They Des World Series I was at a party a friend's birthday party where it just happened to coincided with the last game of the playoffs right where Boston was playing Detroit I think it was the Cardinals St Louis was it St Louis yeah no no that was the series wasn't it Boston and Detroit can't play in the World Series no no in the playoffs oh in the in the yeah okay yeah in the in the in the uh in the league finals yeah League finals going for the um and two there were two people there one of him was a huge Boston fan the other was a huge Cardinals fan and it was like it was like the tension was not it wasn't it was like ferocious how the mood shifted once I think someone had a grand slam and that put Boston like pretty far ahead to the point where it was kind of a foregone conclusion not that there is such a thing in baseball but they were pretty far ahead in the ninth inning and it was the look on the\n\nI corrected the following errors:\n\n* \"Des World Series\" -> \"They Des World Series\" (assuming \"they\" refers to the two people at the party)\n* \"Boston was playing Detroit I think it was the Cardinals St Louis was it St Louis\" -> corrected to reflect that Boston and Detroit can't play in the World Series, but they could be playing each other in the playoffs or league finals\n* \"ferocious how the mood shifted once I think someone had a grand slam and that put Boston like pretty far ahead to the point where it was kind of a forone conclusion\" -> corrected to \"foregone conclusion\"\n* Added capitalization for proper nouns (World Series, League finals)",
            "start": 3289.84
        },
        {
            "text": "like pretty far ahead to the point where it was kind of a foregone conclusion not that there is such a thing in baseball but they were pretty far ahead in the ninth inning and it was the look on the Detroit Tigers fan was like he just found out that someone in his immediate family was dead yeah like he was he had he left the party he was like I got to guys I got to go I got to go and I'm like I cannot think of anything that I like that much that if I were disappointed by it would make me leave a birthday party because I like I've seen a million times when the 49ers this year won the or lost the Super Bowl like four of my friends left and they were depressed for like the next week I don't like I don't think I like anything that much like I love movies right I go see a movie like I was super excited about Man of Steel and I'm like this is going to be Zack Snyder's like second 300 right he's going to claim claim this back and I got out that movie and it was okay and I was like yeah it was",
            "start": 3334.4
        },
        {
            "text": "excited about Man of Steel and I'm like this is going to be Zack Snyder's like second 300 right he's going to claim claim this back and I got out that movie and it was okay and I was like yeah it was okay and I left and I lived the rest of my life never having **** how many times have we talked about Fast and Furious come on Tim like a fast and furious transcends Cinema okay that's on a different level that is true let's not go on this let's not talk about talking investment though and stuff like that you're talking talking you're talking about a man of steel don't me wrong I'm a big Superman fan but there'll be other movies I'll see when will I see the Bears in the Super Bowl again you know what I mean yeah like that happened once when I was what two and then again when I was about to move to San Francisco what makes the Bears the bear because that team is nowhere close to what it used to be when you were a kid right when you really liked first watched it much better no one plays",
            "start": 3372.28
        },
        {
            "text": "move to San Francisco what makes the Bears the Bears because that team is nowhere close to what it used to be when you were a kid right when you really liked first watching it much better no one plays but yeah but you know what I'm saying like it's been 20 some odd years since you've been watching this they've changed so much what is it just the brand of the team that keeps you guys there part of it I mean it's but it's it's the brand it's the stadium it's you know I mean I'm drinking out of a Bears glass right now and I have little I have a little mobile bear I say mobile like right like the gas station mobile right there's a Bears Cup in our cupboard right and that's my grandmother's Bears glass and that's like when I would go to my grandmother's house it was that and the Bulls and all this other stuff that like she was the one who's super into all this stuff those are the memories this is similar but different stick with me sure like I always talk about Portillo's right the the hot dog",
            "start": 3413.84
        },
        {
            "text": "other stuff that like she was the one who's super into all this stuff those are the memories this is similar but different stick with me sure like I always talk about Portillo's right the the hot dog restaurant in Chicago that I love exactly yeah you've gone there to the LA one with me but people back in Chicago to this day will write to me and be like oh man Gene & Judie's is so much better or Wiener Circle or this that the other and it's like no no no I'm not saying I'm the biggest hot dog fan I'm saying I'm the biggest Portillo's fan because that is a touchstone in my life that my childhood and everything when I think of home is wrapped around going there you know when my grandmother picks me up from school and takes me there like going there with my friends after this thing or that thing you know I mean maybe that's what I'm missing right is that shared experience is all my friends and I on that one special occasion we're having a great time and that's when the Bears won the Super Bowl",
            "start": 3452.08
        },
        {
            "text": "know I mean maybe that's what I'm missing right is that shared experience is all my friends and I on that one special occasion we're having a great time and that's when the Bears won the Super Bowl we remember that and that's that moment is is categorically and sort of intrinsically locked to that success of that team and those build the bond between it that's what you guys are talking about I just don't have anything in my life like that the only thing I'm really bonded to like we talked about earlier is my wife that's about it and my friends but I just don't have anything else in my life that I'm like ride or die about except Fast and Furious yeah that's true see this is such a huge joke but for me I don't have sports but like Macklemore I'm going to bring that up like that's one of those things where it's just like that's where I do feel like I felt a really personal connection to Macklemore when when he hit it big which by the way was only what this past year with with Thrift Shop",
            "start": 3488.44
        },
        {
            "text": "where it's just like that's where I do feel like a weed you felt a really personal connection to Eminem when when he hit it big which by the way was only what this past year with \"Thrift Shop\" I've been listening to him for years and like once it hit every little small success I was like oh my God this is awesome and I felt like I was a part of it and like so I get that it was just like oh man like \"MaloR\" is the like most played YouTube video of the year yeah that means something to me I feel like I'm a part of that recently right like for me it was The Walking Dead with that where i' had been on The Walking Dead train for years and years and years and then it C kept getting bigger and bigger and then like things would start to happen whether it be an action figure you are a natural evangelizer both you guys are so you guys find things that you I think maybe because of your experiences doing what you guys have done for so many years is that you've seen you have the ability to take",
            "start": 3525.12
        },
        {
            "text": "both you guys are so you find things that you I think maybe because of your experiences doing what you've done for so many years is that you've seen you have the ability to take something that no one else knows about and go this is something you should care about right Hot Mess Moves go subscribe right now on YouTube they're going to be big and we're going to say we knew them when and they wouldn't return our texts boom yeah I mean to me like my experience you know one of the things I love about being from Long Island is that there's like this weird I don't want to say Mystique to it because I don't think that's the right word there's just something weird about it like people don't quite get it cuz you never have to go there you know like I'm terrified of long I know why it's like a it's you like you to go to Long Island Long Island's not a place you go to to get anywhere else Long Island is a place you have to intentionally try to go to and that's it you know so long",
            "start": 3560.36
        },
        {
            "text": "A it's you like you to go to Long Island, Long Island's not a place you go to get anywhere else. Long Island is a place you have to intentionally try to go to and that's it, you know? So long, like well it's just if you look at a map, you know, like you drive through New Jersey to get to New York, you drive through New Jersey to get to Pennsylvania, you drive through Pennsylvania to get to West Virginia. Long Island just sticks out of New York and there's no reason to go there unless you're from there right? And like people always wonder like why is New York have two sports teams for everything and it's like well New York's a really big metropolitan area but it's also that Long Island has its own teams, you know. And people don't seem to quite understand that and our teams happen to be ** terrible, you know? Like in in a lot of the sports and we except for that one team that consistently wins every year because they've got the highest payroll but the Yankees right yeah the Yankees are in",
            "start": 3594.04
        },
        {
            "text": "you know, like in a lot of sports, except for that one team that consistently wins every year because they've got the highest payroll, but the Yankees are in the Bronx. The Mets are a Long Island team, that's not how it works exactly. It works, but so like you know, like yeah there are Jets fans in New Jersey and Connecticut stuff, but like typically, like the Islanders are the hockey team right, the Islanders, you know, like they're Long Island's team. The Jets used to play at Giants Stadium where the Mets played on Long Island and Queens, so like these are their teams or whatever, and they just happen to be historically terrible, except for the Islanders and the good years, and the Jets won a Super Bowl, they won you know, and so like we I feel like we saw the John Spano thing, where they talked about how long islanders, like Long Islanders take to these teams and they mean something to them because that's",
            "start": 3629.88
        },
        {
            "text": "we I feel like we and you saw the the the John Spano thing we watched they talk about like how Long Islanders like take to these teams and they mean something to them because that's because we are next to the city and like we don't have our own identity except for these teams you know and it means something to us you know that's like so that's where I come from with this like the teams are bad and for but but for me I think that I think that is what makes intense fans like what you're talking about though is the fact that when I sit down and talk about the Bears right I talk about the Super Bowl you know that they blew or when Jim McMahon got hurt and his wife said he couldn't go back in the game and all these like goofy things you don't talk about the successes you talk about the shared oh my God and we like as a Missourian fan the fifth down you know what I mean all these things where it collapsed and took the wind out of everyone's sales those are the unifying moments",
            "start": 3669.04
        },
        {
            "text": "about the shared oh my God and we like as a Red Sox fan the fifth down you know what I mean all these things where it collapsed and took the wind out of everyone's sales those are the unifying moments it's super easy to be the bandwagon fan to be like a Red Sox fan is completely different than somebody who decided like in the late 80s early 90s whatever to be a Red Sox fan so I I grew up not liking sports my my dad wasn't into sports my dad's a great guy but he just was never into sports right and I think a lot of I can't justify that because I thought he'd be a shitty guy well I mean to you know to some people it's it's sacrilegious my parents didn't like sports either I had I had a real late start to it so I don't yeah so I always sort of feel I always sort of grew up feeling a little uh like I was missing out because I don't have that common like even if you don't like the same teams you can still have that discourse right sure you can talk about",
            "start": 3706.24
        },
        {
            "text": "Sort of grew up feeling a little uh like I was missing out because I don't have that common like even if you don't like the same teams you can still have that discourse right sure you can talk about but you don't understand like I don't like I'm not saying you don't I'm saying like a team a member of definitely like Greg as a Bears fan like has a different experience than me as a Jets fan right like Colin always tells the story like the Jets are like they won the Super Bowl, Super Bowl III and 1969 they've never been back to the Super Bowl and they're just one of the worst teams historically in the NFL like that's just how you hang in there for it every time you're going to be there when they they hit it like and and you want to be that one guy story I I went to Maroon 5's first concert so **** you for liking them now because I the it's not like that at all it's the I was there when there was literally 20 people in the the theater and I didn't care like I was like I'm one of those",
            "start": 3745.4
        },
        {
            "text": "so **** you for liking them now because I the it's not like that at all it's the I was there when there was literally 20 people in the theater and I didn't care like I was one of those 20 people and now that there's millions I'm like this is awesome is it aw well for you on this side is it awesome for you because that's what you to happen in your life and so seeing someone that you support is there sort of like a karma behind that where like you're hoping no not at all yeah that's awesome but like that has nothing to do with it like it's just one of those things where they're fans of it if they win that's awesome and if there's other supporters or whatever that's cool too that's my thing maybe I'm just too fair weather when it comes to this but like I could not stand to follow football okay baseball is one of those things where like how people follow bad teams in baseball blows my mind 162 games watching them lose but think about the like think about what was the",
            "start": 3788.64
        },
        {
            "text": "Follow football's okay, baseball is one of those things where like how people follow bad teams in baseball blows my mind. 162 games watching them lose, but think about the like, think about what was the great Feelgood story about this last baseball season was the **** Pittsburgh Pirates dude and there were PE they had made the playoffs since 1991 you know, like and and they and they finally look I used to be I used to I lived in I've had the pleasure now of living in two cities that both had world champions. I lived in Anaheim when the Angels won and now I live in San Francisco and it's awesome don't get me wrong and I I'll get out there and you know wear the old orange and black as good as everyone else but uh but I'll wear that uh the old the old the old, but I'm a fairweather fan. I don't I don't I don't care about it and I can't see the people that just moved to town and like I'm a Giants fan yeah well that **** pisses that **** pisses me off too like I don't like Fairweather fans",
            "start": 3826.04
        },
        {
            "text": "don't I don't care about it and I can't see the people that just moved to town and like I'm a Giants fan yeah well that **** pisses that **** pisses me off too like I don't like Fairweather fans the reason I don't is because I come from two fan bases in hockey and football that are **** hardcore yeah if you're first of all if you're a fan of hockey at all you're hardcore United States this the United States well hockey a huge in a lot of markets including M and and you know what bothers me Fairweather fans bother me because you know I was saying like Cheryl tells the story all the time when the New York Jets went to the playoffs in 2009 which was like a really unusual year the Jets have been to the playoffs you know several times and but like 2009 they had a rookie quarterback a new coach they sneak you know they snuck into the playoffs you know and then they won and then they won again and Cheryl tells the story about how I I was I Hy I started hysterically crying after one of",
            "start": 3869.04
        },
        {
            "text": "Coach, they snuck you know they snuck into the playoffs, you know, and then they won, and then they won again. Cheryl tells the story about how I, I was, I started hysterically crying after one of the wins like I was like I can't believe this is like I can't believe this is happening. And they lost in the championship game, the game before the Super Bowl, and I was fine, I was like I can't believe that this happened, yeah, like I can't...I...I can't believe that they made it this far. And the next year they made it back to the championship game, and I was like what the ****, and they lost in the championship game again and didn't make the Super Bowl, and then I cried out of pain, you know. And I was like I have a deep emotional attachment to this team, maybe it's a mechanism, a defense mechanism for me to just not care right, like some sort of cool really good-looking Terminator. It's one of those things when my friends will have kids and they'll tweet the first photo of them in the",
            "start": 3907.28
        },
        {
            "text": "for me to just not care right like some sort of cool really good-looking Terminator it's one of those things when when my friends will have kids and they'll tweet the first photo of them in the Bears Jersey I I will tweet I will Tweet back or like you know welcome to a lifetime of pain you know what I mean cuz that was the thing but like in the same thing when the Bears you know won the divisional playoff to go to the Super Bowl cried opened a bottle of champagne sat there drink it called all my friends and then when they lost the Super Bowl I was more like H all right you know what I mean like it wasn't like destroying it didn't destroy me because like they're against the Colts and no one expected them to beat the Colts and neither did I really because Rex Ryan sucks but you know what I mean like that like I I go into most games thinking my team's going to lose they'll **** this up that's terrible no that's the defense mechanism though right cuz I've seen I feel more losses than",
            "start": 3949.68
        },
        {
            "text": "I mean, like, that like I I go into most games thinking my team's going to lose they'll **** this up that's terrible no that's the defense mechanism though right cuz I've seen I feel more losses than wins for both them and Missouri which isn't true probably statistically but I'm used to big games something horrible happening Missouri is number one in the country and immediately loses it I'm used to that that's different though because that system college football is insane right like you can lose one game and then you're just done but it's just more principal not lose a game and you're still yeah because it's all arbitrary that's why the the playoff system yeah they need like a more deeper playoff system but the you know like like what Greg's saying is true in the sense that it's just an identity thing and and you know like Greg will tell you like I'm like not I don't only watch Jets games I am **** nuts during Jets games like I scream and get up and clap and yell like I",
            "start": 3984.96
        },
        {
            "text": "an identity thing and and you know like Greg will tell you like I'm like not I don't only watch Jets games I am totally nuts during Jets games like I scream and get up and clap and yell like I scream like it's like coming like you never see me like you would during those three hours and I haven't missed a Jets game in years you know like that's the other thing is like when they were bad when they won three or four games a year I was still watching every game and what like it it caused a problem with my family in 2011 when I went home and I immediately got home and and like wanted to watch the Jets game like what are you doing I'm like I'm not missing the Jets game I understand that I haven't seen you guys in a while but like I haven't missed a Jets game in years so like I'm sorry I love you guys I'll see you in three hours insane to me it's so insane like I again I love the thing I love most in life is going to see movies I love the experience of going to see movies but",
            "start": 4026.92
        },
        {
            "text": "I love you guys, I'll see you in three hours. It's insane to me, it's so insane. Like I again, I love the thing I love most in life is going to see movies. I love the experience of going to see movies, but I just don't like... I lost that thing that I needed to go see the midnight show of a movie I was looking forward to. I lost that a long time ago. The fact that you guys have still kept this passion for these teams, that by all accounts aren't very good, it's just astounding to me and it actually makes me sad in my life that I don't... I miss out on that right. It's a well-known fact on the office, I know, least with the exception of Tim about sports probably in a 30-foot radius of wherever anyone sits, um, you know, in the editorial pet, um, and I, it sucks because I mean, it, you know we had some VPS back in the day that would be like \"did you see the game, Game Over Greggy?\" this and that and it's awesome and that was a great play and I'm like \"I just don't know what you're\" talking about, want to be a part of dead end could",
            "start": 4061.88
        },
        {
            "text": "back in the day, that would be like, \"did you see the game?\" this and that, and it's awesome, and that was a great play, and I'm like, \"I just don't know what you're\" I want to be a part of Dead End Club, but that's why I'm not a vice president. But here's the cool thing about you is that, like, you don't disparage it, you know? Like, the thing that bothers me is, like, the Islanders are a good example - the Islanders play 82 times a year, I watch about 70 games a year because I miss certain games and I'll follow on Twitter or whatever. The Islanders won four Stanley Cups in a row; they're historically an amazing team back in the day, and since I was born, literally, been like terrible, and they made the playoffs last year for the first time in years, and that, like, was so powerful because you stuck with it. Yeah, and the people that understood that in my life, like Greg did - Greg actually sat and watched the games with me and stuff like that, I thought that was really cool because",
            "start": 4105.04
        },
        {
            "text": "because you stuck with it, yeah, and the people that understood that in my life, like Greg did, Greg actually sat and watched the games with me and stuff like that. I thought that was really cool because it was like a shared experience where he understood that I liked this team was abysmal, you know, like awful. And they were so awful for so many years that they got so many great draft picks that now they're great, you know. And like, so like, you're reaping what you sow and what really bothers me is that when I would talk about these things on the Internet or you know, like tweet about them or whatever people be like \"oh sportsball\" and all that stuff. It's like, shut up, you're sitting there like talking about all this nerdy stupid stuff, I don't care about. Like what's the difference between me liking the Jets or the Bills? You're giving me a little too much credit. I do make fun of sports a little bit here and there, like my favorite thing to do is",
            "start": 4143.12
        },
        {
            "text": "Is the difference about me, like liking the Jets or the aisles, you know, you're giving me a little too much credit. I do make fun of sports a little bit here and there. Like my favorite thing to do is when people are talking about last night's game, I walk by and I just throw out similar to what you do with camera technology in like terminology, I just throw out \"yeah, Chiron\" - I just Chiron, um, I will throw out, I will throw out random terms like the combine and the combine things like that. I don't know what they mean; I don't really - I mean, I know what the combine is, but I will just throw that stuff out and just be like \"sports, hoops, basketball.\" We have a lot of people at IGN like that, who are just like that's their defense mechanism because when sports come up before somebody's made them feel inferior about not knowing it. But what drives me crazy for where we work is that we work right in front of the giant stadium and you're talking about the shared experience of understanding out of",
            "start": 4176.12
        },
        {
            "text": "inferior about not knowing it but what drives me crazy for where we work is that we work right in front of the giant stadium and you're talking about the shared experience of understanding out of the window yeah exactly and when when the Giants go to the World Series I get upset or like the playoffs in general at the people who want them to immediately lose and leave and I'm like God like that's when it gets me I get like I remember being mad at Hillary about this like and Hillary's a sports fan but it's just like I and this granted was you know when they were making their first run at the playoffs or the cup or the series The Cup Jesus Christ uh and you know the fact that I understood that from I don't like baseball but I get for the city what this means and for a fan what this means and it's like let them have their month of games you know what I mean the only time I used to um not like that was when you would be trying to get work done it was a day game and you just see thousands",
            "start": 4214.88
        },
        {
            "text": "It's like let them have their month of games, you know what I mean. The only time I used to um not like that was when you would be trying to get work done it was a day game and you just see thousands of people out having fun drunk and you're like I still got to go to that 3:00 p.m. meeting. Yeah, talk about like eating lunch confidence monitors we giving up the lines for a confidence monitor, you know what's funny is that by the end of like six more months you're going to know everything everything about video production and you're not going to be able to hide it anymore you're going to be a video nerd. He already hides it he knows what an A is he's been drawn in his room it's good. Should we move on to Tim, Tim what do you got from me? What's your topic here? Okay, arguably the greatest rapper of all time Eminem, yeah just dropped an album The Marshall Mathers LP2, yeah so my topic is just Eminem. What are you guys thoughts on Eminem? I Love Eminem. I see this is what I knew was going to happen and I'm",
            "start": 4255.68
        },
        {
            "text": "Eminem, yeah, just dropped an album, The Marshall Mathers LP2, yeah. So my topic is just Eminem. What are you guys' thoughts on Eminem? I love Eminem. I see this is what I knew was going to happen, and I'm really excited to hear Colin's thoughts on Eminem. So, so, The Slim Shady LP right, and Marshall Mathers the original LP are amazing records, especially especially the Marshall ones which I think you know from from \"Kill You\" all the way through to the end are fantastic records like he's a wordsmith, you know, K from Connecticut, like I like everything after that, like The Eminem Show on stuff I could do without but like those first two records man with MM is that yeah the first two records I was all about Eminem and then totally lost him he was just gone a while kind of disappeared for a little bit. Okay, so here's here is the lineage of Eminem, you know, he had his underground stuff but whatever then it goes to Slim Shady okay slow down on this one because I need to follow this because I have no",
            "start": 4299.48
        },
        {
            "text": "Okay, so here's here is the lineage of Eminem. You know he had his underground stuff, but whatever, then it goes to Slim Shady. Okay, slow down on this one because I need to follow this because I have no idea where he came from. Underground just it was 8 Mile, come on, we all saw the documentary exactly right, but underground stuff that was National Geographic, right, which got him really like you know gave him his chance. Found him all that stuff, then there's the Slim Shady LP, which put him on the map for being like this, that's I'm some real some shady my name is not that my name is okay my name is yeah where he say all this crazy stuff and like was kind of that's he talk that was when he was like messing like making fun of Christian Aguilera right no all over on this one. So then the Marshall Mathers LP came out, and it was like way more serious and not that the first one didn't have serious moments but like the second LP was like wow oh yeah this is this Stan this isn't a joke like this.",
            "start": 4347.48
        },
        {
            "text": "Marshall \"Eminem\" Mathers came out and it was like way more serious and not that the first one didn't have serious moments but like the second LP was like wow oh yeah this is this Stan this isn't a joke like this guy's serious and the technical ability is just insane and then he released his The Eminem Show I you mean he can he's good at lyrics and rapping at lyrics and just being witty and like punchlines and like just the his flow Eminem's flow flow is insane his flow Untouchable Untouchable yeah I agree in the sense that his intelligence and his his vocabulary shines through the way and like I love that he just says he's like one of those you know I think a lot of what people under don't under you know understand or don't want to acknowledge about hip-hop especially a lot of the gangster rap or whatever when even when you think about some of the bigger guys like um I don't know like like like no like Gucci like Jeezy or something like that where it's like it's a joke like they're being facetious they're not",
            "start": 4384.84
        },
        {
            "text": "even when you think about some of the bigger guys like um i don't know like like like no like Gucci Mane or something like that where it's like it's a joke like they're being facetious they're not really rapping and you know like you know lil yachty talks about how like his first song was in a drug house like no wasn't you know like they're they're they're talking about these things in a in in a sense to kind of be facetious and be funny and be street or whatever it is they trying to be but like i love i always think about you know like he says in in killshot what does he say they said i can't rap about being broke no more say i can't rap about coke no like that's how he opens like like really like one of those songs whatever it's like he's just saying things to get a rise at you and that's what i loved about he's just he's yeah he's poking and prodding people and they let and he and he gets a rise out of people and it's just like the cycle that's what i loved about him was",
            "start": 4432.92
        },
        {
            "text": "and that's what I loved about he's just he's yeah he's poking and prodding people and they let and he and he gets a rise out of people and it's just like the cycle that's what I loved about him was here are we talking about Marshall Mathers still yeah one yeah so like I I I love that kind Nick is holding on for dear life to not lose what's happening here's here's the deal about him I always I mean I know the man's polarizing um I never listened to an Eminem song and genuinely liked it I mean I like the songs I like the band I appreciate it for what he is but I've never listened to his songs like I listen to Dre where I never felt that connection when I used when you listen to Dre or Snoop back in the day the West Coast like that sound I would roll to that and feel that and try to like and not that I grew up in anywhere c c circumstances to what they were talking about but nor did they I don't think but um you know I I used to vibe that music right where I'd roll and just listen to that",
            "start": 4471.12
        },
        {
            "text": "I grew up in anywhere, circumstances to what they were talking about, but nor did they, I don't think. But um, you know, I used to vibe that music right, where I'd roll and just listen to that and thump, and my **bad** J, that's like, it's meaningless music all that stuff, that's just like background party whatever, which is great. There's listen to Dre talks about some very serious issues, like no, he doesn't. Who's going to bring the Jay-Z and the juice to the party, that's true. But see, em half the songs are jokes, but then half of them are like super deep introspective, like Rock Bottom on The Slim Shady LP, that song if you listen to that and like, that's just insane it's so good. And to continue the lineage Eminem show comes out and it's a great album I don't know what you guys are talking about, I wasn't there, it's the single awesome Without Me was the like joke single but then it had Cleaning Out My Closet soldier Okay I remember I'm cleaning my all all these great songs and then",
            "start": 4515.76
        },
        {
            "text": "talking about I wasn't it's the single awesome without me was the like joke single but then it had \"Cleaning Out My Closet\" soldier Okay I remember I'm cleaning my all all these great songs and then after that he goes into was that like a metaphor for what \"Cleaning Out My Closet\" was there some like that song about his mom why you that was Kim basing you're right his mom oh Jesus Christ 8 Mile no no okay so we get to 8 Mile thanks for being we get to 8 which has \"Lose Yourself\" which is **Lose Yourself** as in M&M's, that's the one that's the song I always equate to I don't know if that's some sh better lose yourself you got to lose that was one of the only ones where I was like oh I'm actually vibing with this because I get but but you're talking about you're using the word vibing and that really like when I think about I come from the East Coast so like the sub I love Tribe and Da Lench Mob and things that I grew up with when I would listen to West Coast rap like Dr. Dre",
            "start": 4559.72
        },
        {
            "text": "word vibing and that really likes when I think about I come from the East Coast so like the sub I love Tribe and Da Lench Mob and things that I grew up with when I would listen to West Coast rap like Dr. Dre you would you would there was a vibe to it because it was like like Tim was saying and I think you're right like it's more of like an and the music a lot of that rap was different a lot of that rap was made for habit parties when you're partaking in various substances and just hanging out and like chilling but there's a different field of those and like if you're listening if you're listening to like uh if you're listening to like \"Stakes Is High\" by De La Soul like that's a rap song exactly if you're listening if you're listening to you know \"California Love\" by Tupac that's a song with great lyrics and fun but it's a song where like you're you're partying there's a few other things that I like like I like a little bit of like well yeah I guess you're right that's true I mean there there",
            "start": 4609.8
        },
        {
            "text": "lyrics and fun but it's a song where like you're you're partying there's a few other things that I like like I like a little bit of like well yeah I guess you're right that's true I mean there there are there is in a lot of the other ones but like but for some reason I just never like I I listened to Eminem but I also saw a guy that was coming up and probably making a lot of money so I was like what the hell is this guy complaining about he always had like these amazing things about his life that he would chair in his in his Rhymes but I was like I don't just don't know that I buy any of this **** I I want to listen to the new record I haven't listened to it yet so here's the so then then after Eminem Show and Lose Yourself which is his Peak and then after that drops off bad things happened his buddy Proof died and like all this **** one of the D12 dudes and like so he puts out Encore which was that was the album that was like **** we're done like all it was was that on",
            "start": 4649.28
        },
        {
            "text": "happened his buddy Proof died and like all this **** one of the D12 dudes and like so he puts out Encore which was that was the album that was like **** we're done like all it was was that on when he started producing for people he started trying to do too much and like that after Eminem show was when 50 Cent got big and Eminem was just like okay whatever that's when things got bad he's had one song where he had to use a damn accent and then his whole next album Relapse was just him using this freaking accent do you know what I'm talking about no no it's horrible see me so like the um he had a song called like that on Encore where he introduced this accent and then he used the accent on every single song on The Single was We Made You on Relapse it was 2009 I think anyway it was so bad and the fans were like **** this Su the album was actually pretty good as a concept album but like song for song sucked gotcha took some time off you and Relapse was when",
            "start": 4689.32
        },
        {
            "text": "think anyway it was so bad and the fans were like **** this Slim Shady album was actually pretty good as a concept album but like song for song sucked gotcha took some time off, you know, and Relapse was when he was off drugs like completely and he was and then that was a problem and then it was a really bad problem and then Recovery which was his last album that came out he was like okay I'm going to totally take a different approach to this do drugs that's one with Rihanna that had Rihanna he he got way more pop with it and stuff and kind the one where he was like Under My Umbrella re this is the one with fire right there that fire there's a lot of fire um hates me I don't so he replaced the accents with screaming so that's what he does now is he just screams he gets really angry at all times and SC so part of the reason you like this guy is because he talks so deeply about the things that happened in the past after you just listed off 19 albums maybe he doesn't have anything to",
            "start": 4741.6
        },
        {
            "text": "times and SC so part of the reason you like this guy is because he talks so deeply about the things that happened in the past after you just listed off 1920 albums maybe he doesn't have anything to talk about anymore maybe he's just super rich and as kids that's my point though his first three albums were Classics after that it was down he had pain he had K basing doing basing in the in the trailer so now Fifer who was like you're never going to be something thing right rabbit yeah rabbit did stuff man he ran remember when he the first time he got on stage you're were like I don't know about this guy but by the end of the movie he was like yeah yeah Britney Murphy's dead mom spaghetti Britney Murphy is is dead that happen what I so I read a Grantland article on this new on this new record and apparently there's what interested me the most about it was like it was supposed to be like full circle for him where obviously the name indicates that as well but where he like even wraps around",
            "start": 4798.12
        },
        {
            "text": "and apparently there's what interested me the most about it was like it was supposed to be like full circle for him where obviously the name indicates that as well but where he like even wraps about how he regrets treating his mom the way he treated her and like that like it's like it's like weird I want to I want to hear I want it's not on Spotify yet but so he put it he put it out it's Marshall Mathers LP2 which immediately when and he dyed his hair blonde again and he's doing all this stuff it's like I'm bringing it back and the immediate reaction to that as a fan is like oh man like this is where we're at but at the same time it's like well I guess I'd rather him try to do old is the guy now right he's got to be his mid 40 just turned 40 like last week yeah I mean that's you know you it's it's when the guys get older you're like do you really have that angst still right do you really have that messaging to get through you're multi-millionaire well that's the thing though he's not",
            "start": 4840.8
        },
        {
            "text": "It's when the guys get older, you're like, \"Do you really have that angst still right? Do you really have that message to get through?\" You're a multi-millionaire. Well, that's the thing though; he's not like he hasn't been like that for a long time, right? He's been making pop songs exactly. So, like at a certain point, like what where do you how do you get back in touch with that thing that made you great? See what's interesting is like the idea of getting back in touch; people act like he's not in touch. His last album was Recovery; his singles on that – \"Love the Way You Lie\" with Rihanna and \"Bad Meets Evil\" this other album he did, um, the song with Bruno Mars – those are the most popular things he's ever done. Like \"My Name Is,\" real some shady nothing compared to those. So he's making more money than he ever has; he's more successful than he's ever been just not as impactful so to speak. I mean, you know, he's not nobody will ever say these are classic albums, you know what I mean? But those are just the elitist hip-hop people that who",
            "start": 4879.32
        },
        {
            "text": "He's ever been just not as impactful, so to speak. I mean, you know he's not no one will ever say these are classic albums, you know what I mean? But those are just the elitist hip-hop people that who really cares about you know like the mainstream loves him more than anything. So but with this new album it's like okay it's kind of combining the two things. So is it good? The thing is it's good, it's not great, it's probably it's better than the last couple yeah um it also has I think like three songs on it are the worst songs he's ever made oh wow um is it better or worse than the fourth Fast and Furious film? Better is it better or worse than the second fast and furious film? Better because although it has some bad parts let me ask you to this question we had a raging debate about this we cannot start this we to start it right now we're going to start it right now. This is the whole episode what is better, damn, the fourth or the second Fast and Furious film if you had to watch one of them right?",
            "start": 4920.12
        },
        {
            "text": "start this we to start it right now we're going to start it right now this is the whole episode what's better damn the fourth or the second Fast and Furious film if you had to watch one of them right now would you choose the four I saw Give me the give me the second one was no Diesel Tyrese the fourth one was the one that had gone through the caves that's what everyone remembers go the stupid caves no but the second one was with Tyrese and Eva Mendes where she phoned in the entire performance I'm already done I know where I'm going two's better no yeah that was a fun movie that was a fun movie no it was not go back and watch it how did Vin Diesel think he could just walk away from that paycheck money the Fast has two unbelievably hysterical franchises he's got the Fast and Furious and he's got Riddick's awesome and Riddick is great but Pitch Black is awesome that's a that's like a great movie",
            "start": 4967.36
        },
        {
            "text": "\"Rude dude Rick's awesome and Richard's awesome Pitch Black, right? That's like a great movie. And I like Chronicles, and I like Chronicles: R.E.C.K., the video game on Xbox. Give me some moments from the fourth that were better, 'cause two was overall so bad. Here's the deal - I watched the fourth and I was like, that's not a very good movie. Then I watched two and I literally couldn't sit through how terrible Paul Walker's acting was in that film. Tyrese, like, phoned it in. Tyrese was yeah, and so did the guy from Dazed and Confused, Lucas Hines. I think that's that's the guy from uh the third one, yeah, the guy from Pitch Black. He was in Pitch Black, I think. I never saw black doesn't matter, it's a great film. Um, anyways in the fourth I I can't remember what happens other than the tunnels right where they have to go to Mexico.\"",
            "start": 5008.24
        },
        {
            "text": "in Pitch Black, I think I never saw \"Black\" doesn't matter it's a great film um anyways in the fourth I I can't remember what happens other than the tunnels right where they have to go to Mexico they a cool scene where they backtrack into Mexico right and they kill the dude out you never want to make it out of home it's like you're bragging I didn't know you were bragging, but everyone in the audience did um that notwithstanding it had a plot that was cohesive and took people from point A to point B number two the best thing that happens is Vin Diesel steals that dude's lighter that's it they they had there were so many there were so many beautiful babes and bikinis no uptalk about Suu, su dude she's she's not cute at all I don't care she's kind of weird movie cool what was that chick what was that chick Devon Aoki yep is that the it's Steve Aoki's little sister I don't know what how Steve she she's in one of those isn't she she's in isn't she in one of those Fast and Furious movies, she's in a couple",
            "start": 5050.6
        },
        {
            "text": "chick Devon Aoki yep is that the it's Steve Aoki's little sister I don't know what how Steve she she's in one of those isn't she she's in isn't she in one of those Fast and Furious movies, she's in a couple yeah she's in too okay that's that's what I'm L is the guy remember Ludacris it's Ludacris' introduction he's doing all of the wave racing yeah it's like the N64 game about you know they were racing on waves yeah in the jet ski and the girl is next to him and that's the same you got talking Suki is I us think real I didn't want to conversation about I haven't seen her recent work I just want you to know rating for Fast Furious so much it's one no stop it 3 542 it's official damn that's that is we did that live stream the most popular video on GameOverGreggy.com and I have to say that yeah then number two is better than number four I've seen them more recently than you have it's a fact four is just bad without any redemption two is bad has the Ghost Whisperer part where he closes his eyes and figures out",
            "start": 5096.04
        },
        {
            "text": "Is better than number four I've seen them more recently than you have it's a fact four is just bad without any redemption two is bad has The Fast and Furious part where he closes his eyes and figures out because of the tire tracks and the way they see how everything happened like he understands cars bullet trajectory is is Four F is Four Fast and Furious yes fast and Fast and Furious which also had the amazing title Fast & Furious I remember I remember liking that one a lot cuz it was when they were like you know what was it new body original parts new body original parts and we're like yay and we all went and watch like that was what reinvigorated the series yeah no it's not yeah it is Four Four three reinvigorated the series Three was a joke Three was a movie that no one went and saw No everyone's like this looks stupid no that's crap Three is the one that people went and were like wait a minute this is actually a legit Series",
            "start": 5148.68
        },
        {
            "text": "was a movie that no one went and saw, everyone's like this looks stupid, no, that's **The Three** is the one that people went and were like wait a minute this is actually a legit series, so then they gave the director another try with Vin Diesel, I was like the dude that's directing better off dead is directing a Fast & Furious movie, how can I not watch this? Rented it at Blockbuster video, that's how long ago this was. Remember when you used to go to Blockbuster and you start at A and go all the way around, and there were weird people that started at Z and went the opposite way. Sorry, it was this way, Z counterclockwise, you people what are you doing? You start at A, you go all the way around, so you pick something then you go through the 80s aisle and then you get a Butterfinger and you you get three, you get Blockbuster, you get three CL high in the 80s used to get a lot of Whoopi Goldberg films just to make just to feel",
            "start": 5197.68
        },
        {
            "text": "and then you **get** a butterfinger and you you get three you get Blockbuster you get three CL high in the 80s in the 80s used to get a lot of Whoopi Goldberg films just to make just to feel right what was the Whoopi Goldberg film where she was like jumping flash, Jumper (yeah yeah) where she she like the hacker was talking great film uh anyway long story short as I went to I we went to The Fast and Furious: Tokyo Drift when when I was living with Ty and Brennon back in the day and we start watching this I'm like this is a joke that we're watching this film right now it's it's like watching a terrible movie it's just just not going to be good you know it's not going to be good halfway through I'm like am I crazy or do I actually like the Fast and Furious series right now because of this then four came out and it was like watching the like the veil of and pull of my eyes it was watching the series with a whole new outlook and I'm like boom I get it this is",
            "start": 5235.52
        },
        {
            "text": "Right now, because of this, then Four came out and it was like watching the veil of and pull of my eyes. It was watching the series with a whole new outlook, and I'm like, \"Boom! I get it.\" This is something that's huge. Four is when yeah, everybody got it at Four. Cuz Four is what reinvigorated the series. When Four was the only one with 3D, they didn't even continue them. Like, I know, and I'm saying it was dumb. Even I'm was the one where you're like, \"All right, back to the original thing cool.\" And you went saw like the fact that H was in Four is the only redeeming thing about it. Cuz that was like, \"Oh crap, okay. This series is actually Contra III.\" Everyone saw Three at midnight. I saw Three at a midnight release. You're the only person; you're a little baby. I went to the theaters and saw Fast & Furious the first one. Uh-huh, you saw it too. I remember thinking they played Rhino's music. I remember thinking that Fast and Furious one was so bad that I would never watch another Fast.",
            "start": 5277.8
        },
        {
            "text": "saw Fast and Furious the first one uh-huh, you sawed I saw it too. I remember thinking they played Rhino's music. I remember thinking that Fast and Furious one was so bad that I would never watch another fast this back when you wore your monocle and were fat and went to film school and stuff. Yes, I loved it so much I bought the DVD when it came out. Was the guy from Monopoly? I love Jessie; they got to bring Jessie back. Watch too, and I was like holy **** why, why did I go back on my vow and never watch one of these things? I I should not have watched this film; it's deplorable. Then three came out, it was amazing. Four brought it back; it elevated the series back to where it needs to be, the level of greatness that it is today. Five is so good; five is amazing. We reinvigorated the series. Six, you got to be careful with spoilers on six; some people haven't seen it yet. I'm not going to I'm not going to spoil it if you haven't seen it, you're a jackass. Go movie Greg hasn't finished six yet all right six I",
            "start": 5322.72
        },
        {
            "text": "careful with spoilers on The Lord of the Rings: The Return of the King some people haven't seen it yet I'm not going to I'm not going to spoil it if you haven't seen it you're an idiot Go movie Greg hasn't finished The Return of the King yet all right The Return of the King I know me was the height of what the series can be The Two Towers was great but I still think I still put The Return of the King a notch above that because they perfected it at this point now they've perfected it it's classic Coke now no longer none of this like new Coke stuff it's classic Coke now now they can just keep making them and I'll keep drinking them and getting fatter so to the topic at hand better being married or single should we wrap it up sure that was good that was a good that was a good uh four topics so yeah we have any wrap up on Eminem any bow to put on him what what's the deal with Eminem how many more albums can we expect from Mr. Marshall Mathers well this one's I mean he's going to keep making albums but like this one is it's a big deal like there's a couple songs on it that people need to listen to",
            "start": 5364.96
        },
        {
            "text": "albums can we expect from Mr. Marshall Mathers well this one's I mean he's going to keep making albums but like this one is it's a big deal like there's a couple songs on it that people need to listen to because it really ties things together he kept saying he didn't want to just make sequels to every song this was a look back at where he's at now isn't there an album called Revival or something so here's the thing there's not a Revival to well there is but it's not called Revival to is there is there a song it's called \"Bad Guy\" but if you just listen to Bad Guy you don't know it stands for until the very end spoilers and it's mindblowing like the story he tells in that and like how that song ends everyone should listen to it listen to \"Stan\" first and then listen to it it's incredible and it ends after that there's a skit that starts right after the skit from \"Criminal\" where he like goes in and like robs the bank and it's shoots and it's like thank you and runs off it's right after that damn awesome I don't",
            "start": 5416.2
        },
        {
            "text": "a skit that starts right after the skit from Criminal Minds where he likes to go in and rob the bank, shoots, and then says thank you and runs off - it's right after that damn awesome I don't remember this but I like that I like full circle I'm sure you do this podcast has come full circle Greg way thank you so much for joining us for the second episode of The GameOverGreggy Show remember we post them every Monday for your enjoyment then spend that first hour it goes live in the comments Nick if people want to follow you on Twitter you're @NickScarpino well yeah they know the part at symbol that's an ampersand no that's an at symbol you can number sign pound pound Nick Scarpino 976 Nick Scarpino that is true follow me on Twitter I I tweet occasionally Tim Gettys is Tim Gettys yes on Twitter Colin Moriarty is @NotTaxation I'm GameOverGreggy this show is named after me and if you like it please like subscribe and share it with your friends until next Monday have a",
            "start": 5454.48
        },
        {
            "text": "is Tim Gettys yes on Twitter Colin Moriarty is NotAXation I'm GameOverGreggy this show is named after me and if you like it please like subscribe and share it with your friends until next Monday have a conversational week with all four of your friends where you bring random topics to the table rest in peace Tim Allen",
            "start": 5502.08
        }
    ]
}