{
    "id": 169,
    "video_id": "PIBl23LhlVE",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "White Fudge Oreo Cookie Review - Oreo Oration",
    "description": "Think nothing can go wrong when you dunk Oreos in fudge? Think again.\n\nSUBSCRIBE / LIKE / SHARE\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1386252002,
    "duration": 300,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to Oreo Oration I'm Greg Miller and while you are out there trying to decide what tripod to buy, the fine people at Nabisco were making endless variations of Milk's Favorite Cookie. So every Wednesday and Friday I tear open a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to my channel, and then please share it with your friends today we are reviewing White Fudge covered Oreos, Good Lord, another popular favorite in the YouTube comments you guys are always telling me that I need to be on top of these they're limited edition why aren't they being reviewed apparently on the back look at that You really upped your Valentine's Day game, you could have just bought these and put strawberries on them and be done with it huh. Stupid idiot with the flowers uh every Oreo Oration begins with the patented First Look this is the first box I think we've ever had to tear through on the First Look let's see what we get",
            "start": 0.57
        },
        {
            "text": "with it huh stupid idiot with the flowers uh every Oreo Oration begins with the patented first look this is the first box I think we've ever had to tear through on the first look let's see what we get here look at that super intact I mean they got the crazy ass has condom shield on them so they're all right you look around it's all white you got some gaps in the back there but these are for sure White Fudge Oreos not getting that many I can't complain they're different something's happening here TR this away all right oh wow yeah they got a bouquet to them of white fudge not the traditional Oreo taste or I'm sorry the smell obviously um let's see how they taste though in the next part of the Oreo Oration H going no right now first off let's see what I'm seeing from my perspective where's all the cream what kind of knockoff Oreos are these you you skimping Nabisco some Hydrogenated oil in there I don't think so see if they're all like this yeah they got big old gaps there not I guess not well no",
            "start": 43.8
        },
        {
            "text": "the cream what kind of knockoff Oreos are these you you skimping Nabisco some Hydro in there I don't think so see if they're all like this yeah they got big old gaps there not I guess not well no that's a big old gap no these are not doing well on First Look taste none of that how do they pair with milk oh no I'm not having not not having this I mean obviously not be stupid right if I dunked it not broken nothing's going to happen we'll do it this way one two three I don't I don't think on this show I have ever not wanted to bite into an Oreo more the Oreo is gone there's no Oreo here it's just they say white fudge right that can't be right because like fudge is like the soft little things but it's like white chocolate right but it doesn't even taste like white chocolate what the hell is this Al and the cats back there eating I was I was like no not not a fan uh again we're all adults here right I can't twist it try as I might with Superman like no you can't now I got it all over my",
            "start": 105.96
        },
        {
            "text": "this Al and the cats back there eating I was I was like no not not a fan uh again we're all adults here right I can't twist it try as I might with Superman like no you can't now I got it all over my hands too okay can we just end this final score for the White Fudge Oreo three they are bad I do not recommend this I I mean if you are a huge fan it's that's the thing right like ladies and gentlemen it's not me saying oh I don't like white chocolate that's why I you know people like that that's fine you understand that these don't it doesn't even taste like white chocolate I don't no it's like a plasticky weird that's why it's probably not that's why it's White Fudge right because I guess fudge could probably be anything if they said chocolate they'd have to prove that it's actually chocolate and I ain't seeing no chocolate on this thing no 3.0 that's the way the cookie crumbles for White Fudge covered Oreos do not buy them don't listen to anybody on the internet who says you",
            "start": 178.4
        },
        {
            "text": "chocolate and I ain't seeing no chocolate on this thing no 3.0 that's the way the cookie crumbles for White Fudge covered Oreos Do Not Buy Them Don't Listen To Anybody On The Internet Who Says You Should If They If You Delete Them From Your Twitter Feed If That's What Happens Um But I Mean What Do You Think Maybe I'm Wrong Maybe I'm You Know The Only Sane Person Left In This World I Got To Get This Taste Out My Mou I'm Sorry Leave Your Video Response As A Video Review In The Comments Below Film Yourself With The iPhone Hey Greg I Got The White Fudge And I Don't Think They're All That Bad You're Crazy Let Me Know What You Think Of Them Down There Uh Then Like The Video Subscribe Share It With Your Friends Then Please Call Out Oreos That I'm Missing In The Comments So I Can Continue The Show We're Getting Close We're Running Out Of Oreos To Review So If I'm Missing Something You Got To Let Me Know Otherwise I'm Going To Go Back To My Home Planet Where I'm Really Needed Uh Until The Next",
            "start": 226.8
        },
        {
            "text": "we're getting close we're running out of Oreos to review so if I'm missing something you got to let me know otherwise I'm going to go back to my home planet where I'm really needed uh until the next Oreo comes around I will be reviewing them every Wednesday and Friday here on YouTube uh please keep on dunking no thank you",
            "start": 267.32
        }
    ]
}