{
    "id": 478,
    "video_id": "ZmUO-gtk2Bs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Thanks, @EmzvasNormandy - The GameOverGreggy Show",
    "description": "EmzvasNormandy's (http://www.twitter.com/EmzvasNormandy) been supporting Kinda Funny for three months over on http://www.patreon.com/kindafunny at the Thank You Video tier. Here's our thank you to her.\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1419180441,
    "duration": 197,
    "transcript_chunks": [
        {
            "text": "[Music] what's up M we're the cast of The Game Over Greggy show you're support us on patreon and she's done it for three months Nick dang now this her her this is what's confusing about this girl love her love the support she's given us so much start with that thank you very much for everything but on the patreon thing she's listed as M's Vos Normandy then you go to her page and she's Emma but then it's M's Vos nor I'm not sure if her last name is Vos Normandy I'm gonna say Emma maybe it's a she's a Mass Effect fan I agree but it's just confusing for me what we do know about her is that she's a woman her name's Emma cool her Twitter bio you're going to like your Twitter bio are you ready for Twitter bio I'm ready I'm ready let's hear it how are you holding up because I'm a Potato loves food video games the Paranormal Sports in my cats the signing my life over to study science with ou in 2015 Manchester UK joined Twitter in 2009 oo she classy yeah she is it's a lot of stuff you got",
            "start": 1.1
        },
        {
            "text": "food video games the Paranormal Sports in my cats the signing my life over to study science with ou in 2015 Manchester UK joined Twitter in 2009 oo she classy yeah she is it's a lot of stuff you got going on there on December on December 15th she tweeted balls that is all with an ellipses well was that did she just write balls she also balls all caps exclamation that is allt okay good I like that she's playing Slender right up my alley it's foggy have you guys played slender I've not played Slender the really no oh man we're going to have to play that is it on Vita no no no no I'm probably not going to play it it's it's fun she said which time honor classic should I eat this evening col they're both hind spaghetti plus sausages I don't even know if they have cream of tomato soup we do not have spaghetti you guys like SpaghettiOs yeah yeah they're all right I mean I thought they all right I mean as a kid I mean I don't I don't crave them nowadays yeah see Emma there was a problem with",
            "start": 44.12
        },
        {
            "text": "have spaghetti you guys like SpaghettiOs yeah yeah they're all right I mean I thought they all right I mean as a kid I mean I don't I don't crave them nowadays yeah see Emma there was a problem with me and spaghetti I was back in the day in the 90s I like Beetle borgs a lot so beetle borgs beetle borgs they were like a Power Ranger knockoff thing they were cool though at some point they you know whatever another story for another day they had a special thing with SpaghettiOs where you had to buy them and if behind the rapper there'd be like these images and they're like mini posters and stuff and you collect them all obviously I had to collect them all I bought a lot of SpaghettiOs that summer I don't think I ever need spaghettio you should have just went to the store and ripped the labels off them I did that oh Tim I'm that guy you're the pure one you're supposed to be the best one above us all thank I thought you were going to say like you um sneezed while eating spaghetti O's and",
            "start": 88.16
        },
        {
            "text": "off them I did that oh Tim I'm that guy you're the pure one you're supposed to be the best one above us all thank I thought you were going to say like you um sneezed while eating spaghetti O's and they came out your nose that's disg oh Spaghetti O oh gross damn that was that was a low point for the show and it's not even a real show it is a real show we're recording it well sure this is for Emma only Emma's eyes only as I say only should I should I sing her the theme from your eyes only sure make it about her though hold on hold on let me let us Emma thank you for your support thank you continue to support us on patreon thank you a million times you're amazing we appreciate it nickel Now sing us out for Emma's Eyes Only Emma's doing some stuff she likes to tweet she likes to go on those Instagrams I can't rhyme though Emma Emma I don't even know I a fantastic voice waiting for a em your Muse Emma is where have you been all my life I just now got creative whoa whoa Whoa man thanks Emma",
            "start": 120.52
        },
        {
            "text": "I can't rhyme though Emma Emma I don't even know I a fantastic voice waiting for a em your Muse Emma is where have you been all my life I just now got creative whoa whoa Whoa man thanks Emma thank you thank you very much thank you [Music]",
            "start": 168.28
        }
    ]
}