{
    "id": 2123,
    "video_id": "AT8Le1swaZs",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Epic History of Xbox Live Arcade - Kinda Funny Gamescast Ep. 90 (Pt. 3)",
    "description": "Xbox Live Arcade creator Greg Canessa joins us to discuss the very interesting history of the platform.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to http://www.dollarshaveclub.com/gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1476882000,
    "duration": 3941,
    "transcript_chunks": [
        {
            "text": "This episode of the Kinda Funny Gamescast is brought to you by Dollar Shave Club. Guys, you don't need to choose between price and quality to get an amazing and affordable shave. DollarShaveClub.com is the answer. To prove how amazing the shave really is, right now they're going to give you your first month free to join the club. DollarShaveClub.com delivers amazing razors right to your door for a third of the price with the greedy Razer corporations charge. Join the club just like I did and stop dealing with the drugstore hassle and battle the locked up Razer Fortress ever again. I've been looking good, Kevin's been complimenting me all the time; he's been touching my face, he's just like, \"Man Tim, this is so soft.\" I'm like, \"Thanks, Kevin.\" Dollar Shave Club, any... just go to the Dollar Shave Club, pick a razor from the lineup of amazing blades. I've been using their Executive Blade and it's dope, let me tell you what. See why over 3 million members like me love Dollar Shave Club; they're so confident in",
            "start": 0.08
        },
        {
            "text": "Razor from the lineup of amazing blades I've been using their Executive Blade and it's dope, let me tell you what. See why over 3 million members like me love Dollar Shave Club they're so confident in the quality of all their products now you can get your first month of the club for free just pay shipping after that just a few bucks a month no long-term commitments I know how you're scared of those things Love and Sex Stu every Monday 9:00 a.m. except for right now cuz it's on for a little bit anyway no hidden fees go to dollarshaveclub.com gamescast that's dollarshaveclub.com gamescast so topic three Greg yeah you you you have a special friend here I do his name is Greg as well hi Greg Hi how are you I'm good how are you Greg I'm doing great is it weird to say say your name Greg cuz I never say my name all that much yeah I generally don't say my own name that's just a matter of practice kind of weird this is Greg Canessa Colin this is Greg Canessa as well you you should meet him",
            "start": 37.52
        },
        {
            "text": "I never say my name all that much, yeah. I generally don't say my own name; it's just a matter of practice, kind of weird. This is Greg Canessa, Colin. This is Greg Canessa as well. You should meet him as well. We've met, okay? Well, not on the episode though. In the episode, it has... Here's what happens, Tim. Thank you. Here's what happens, Greg. For the record, before we even get into who you are, first and foremost, you're a Kinda Funny fan - absolutely, freaking utterly. You actually watched this garbage? Swear that's right. I can swear absolutely. You know we cast off those shackles a long time ago. So I have... We had... We ever met before you came to the studio? I don't think so. Maybe maybe on one of those IGN tours when I was in there for other reasons, but sure, sure, sure. Like a handshake and to pass it off. Handshake exactly. You have this uh lineage here in the video game industry by the way. This is totally going to be a Steinbeck intro as you're talking about uh this is this lineage in the",
            "start": 90.16
        },
        {
            "text": "it off handshake exactly you have this uh lineage here in the video game industry by the way this is totally going to be a Steve Backley intro as you're talking about uh this is this lineage in the industry we're going to start that topic here but as a Kinda Funny fan you know we value nothing more than our transparency with the audience and our clarity and our ethics and all that absolutely so what happened is Greg came through to show a mobile app called Spar and it was to number one show us the app and see if we thought it was cool but also to talk to us about maybe hosting an event around Spar, doing a live let's play and doing this thing in front of an audience of our fans if they want to come out to it that is happening that is happening it's in December you can check the Twitter we'll have you details on how you can RSVP however two things I like that as as an event sure but I liked Greg so much that I told him he had to come on the Gamescast number one to talk about his",
            "start": 132.44
        },
        {
            "text": "we'll have you details on how you can RSVP however two things I like that as an event sure but I liked Greg so much that I told him he had to come on the games cast number one to talk about his long lineage in his career number two to talk about the fact of being a fan the first thing you did is like thank you for taking this I know you guys hate mobile apps I know you hate mobile games and then you said something that clicked for me where you're like and I admit most mobile games suck yes so we're going to talk about your career and what it is and then also though why mobile games suck and why Sparcade doesn't now all that I'm saying and telling you up front because that's not part of the the let's play and the deal or the sponsorship or the event or whatever you want to call it this is not in any contract you are here because you are cool you are here because I'm actually playing Sparcade and I am not as good as I thought I was going to be awesome when I came out just like all",
            "start": 174.16
        },
        {
            "text": "Is not in any contract, you are here because you're cool. You are here because I'm actually playing Sparade and I am not as good as I thought I was going to be. Awesome when I came out, just like all normal guests, you hit me up, you're like, \"Yo, do you want to have him on Gamescast? He's cool.\" Like this be a fun conversation. I'm like, \"**Yeah**, let's do it.\" So I just wanted all that out to begin with so that nobody thinks that we're trying to pull a fast one on you when we start talking about the Sparade event eventually. Never okay, good. So yep, Greg explain: I came in here and I'm like, \"This guy with his **mobile game** great here we go can't wait to see this garbage.\" And you're like, \"Oh, I also found it Xbox LIVE.\" Who the **heck** are you? You know what's the elevator pitch for you in the video game industry? Yeah, so... So first of all, I just have to say thank you guys, it's an absolute honor to be here. I, I, I legit am a huge fan of Kinda Funny. It goes way back even before that to",
            "start": 211.32
        },
        {
            "text": "industry yeah so so I mean I so first of all I just have to say thank thank you guys it's an absolute honor to be here I I I legit am a huge fan Kinda Funny it goes way back even before that to podcast Beyond I was a huge fan and listener for years I've listened and done hundreds of episodes so I feel like I know you guys even though this is like the first time I've ever met so it's a it's a total honor and privilege being here with you guys so I just want to say that up front um I'm I'm a uh I'm a I'm a video game lover so first of all I'm a passionate hardcore gamer that's always where I start because at the end of the day when I go home I kiss my kids put them to bed excuse me I'm like spitting um but what I do is I go home and I play games I play I'm a hardcore gamer so I play console games mostly I'm I'm yeah that's what the hardcore do yeah **** your PC's I play you know I play at home PC Master Race right uh no I actually I'm a console gamer I I go back you know PlayStation",
            "start": 245.64
        },
        {
            "text": "games mostly I'm I'm yeah that's what the hardcore do yeah **** your PCS I play you know I play at home PC Master race right uh no I actually I'm a console gamer I I go back you know PlayStation, Xbox, Nintendo you name it I play I have all the consoles I play everything um and so maybe not every genre I'm not a huge sports fan for instance Sports gamer fan but you know I play most most genres of games and love it um but uh my career I'm super lucky because I am one of the rare guys one of the one parts per million that actually aligns his passion with his career so I've been fortunate enough to be spend my entire career working in video games 25 years um I most uh most recently probably my I guess my greatest sort of sort of claim to fame I guess I was a creator of Xbox Live Arcade at Microsoft so I spent many years at Microsoft 7 years uh working on the OG Xbox as well as Xbox 360 through to the launch um and I was again the Creator inventor of Xbox Live Arcade uh did",
            "start": 288.6
        },
        {
            "text": "Microsoft so I spent many years at Microsoft 7 years uh working on the OG Xbox as well as Xbox 360 sought through to the launch um and I was again the Creator inventor of Xbox Live arcade uh did that um left there went to PopCap worked at PopCap games you guys know PopCap right? Zuma PBZ work there um basically evolving that company past this is pre EA days this is back in the 070809 times evolving them past sort of PC downloadable games which they were really known for kind of in the early days and getting into sort of uh more digital console you know XBLA PSN as well as retail and the Vita don't forget the Vita I know PSN covers it as Colin likes to point out but I like to point out that it came to the Vita we we shipped PopCap games on PSP we did um we did Peggle DS you guys remember which Q Entertainment did you guys remember me I I got to go to Japan a bunch of times and you know collaborate with with Q on on a special version of Peggle which was super",
            "start": 334.96
        },
        {
            "text": "guys remember which Q entertainment did you guys remember me I I got to go to Japan a bunch of times and you know collaborate with with with Q on on a special version of Peggle which was super cool uh then uh from there I went to uh Blizzard uh and was the GM of Battle.net uh so was kind of the uh holy **** the guy that sort of went over and um was you know the at the time they were it was pre-launch of StarCraft 2 and they wanted to they had a vision to sort of reinvent Battle.net the classic you know uh Legacy gaming service from the '90s that StarCraft one and Diablo were on and sort of Bring It Forward this is 2009 bring it forward to the era of Facebook meet Xbox Live and so they had a big Grand Vision to kind of integrate in with all their games and eventually even go beyond that and so I headed up that effort uh staff that you know that team and and led that charge for a number of years um uh and we integrated in with StarCraft 2 launch Wings of Liberty uh Diablo III uh World of",
            "start": 384.16
        },
        {
            "text": "So I headed up that effort, uh, staff that you know, that team, and and led that charge for a number of years. Um, uh, and we integrated in with StarCraft 2 launch Wings of Liberty, uh, Diablo III, uh, World of Warcraft starting with Cataclysm in full integration with the next generation of Battle.net, and then of course Hearthstone. Um, then from there I went I flipped over to the other side of Activision Blizzard and worked at Activision. So for several years I was their head of mobile gaming for Activision. Uh, they tapped me, uh, Bobby Kotick tapped me on the shoulder, no, they actually just asked me if I wanted to you know work on mobile games and lead up a new effort for them um which was the time remember 2011 right we all had iPads we didn't know what the **** was going to happen right like is is this is this going to be this legit platform for gaming is consoles going to go away is",
            "start": 430.88
        },
        {
            "text": "time remember 2011 right we all had iPads we didn't know what the **** was going to happen right like is this is this going to be this legit platform for gaming is consoles going to go away is are we connecting controllers to iPads like we didn't know it was going to happen right and so uh Activision for various reasons decided hey you know we really want to be like let's try to figure this out let's try and figure this **** out because you know in case it's a kind of a hedge right in case console goes away you know we got to have we got to have relationships with Apple, Amazon, Google - we don't have any relationships with these guys like we got to get in so uh I worked on um uh was lucky enough to work with some brilliant people actually a lot of people that that whose work you're familiar with um in the UK we started a a studio called Blast Furnace which was um little because you guys are big PSP and Vita fans you know a lot of the guys that were um at um Rockstar North came over",
            "start": 473.92
        },
        {
            "text": "with um in the UK we started a studio called Blast Furnace which was little because you guys are big PSP and Vita fans you know a lot of the guys that were at Rockstar Leeds uh came over and worked with us on Call of Duty games for mobile so uh the guys that did Liberty City Stories and you guys remember those that through Rockstar Leeds they came over and Mark Washbrook and Gordon Hall and some of those guys worked with us and we did Call of Duty: Black Ops Zombies we did Call of Duty: Heroes the sort of free-to-play game we did we did we did a number of different games too bad they couldn't do Black Ops to Classified we all remember that don't we never forget oh amazing game yes made in apparently two and a half weeks that classic yeah that was uh yeah that's the story in itself that game um but uh we could talk for hours uh but anyway so we did we we tried some stuff we tried a lot of stuff there we did Pitfall! the remake as an infinite Runner",
            "start": 512.8
        },
        {
            "text": "in of itself that game um but uh we could talk for hours uh but anyway so we did we we tried some stuff we tried a lot of stuff there we did Pitfall, the remake as an infinite Runner we did Wipeout we did a bunch of Skylanders games basically did that for a few years and then came over to GSN which is where I'm at now which is a division of Sony uh doing Sparcade so um so yeah Kevin's Whispering Mike I don't know why he would whisper you can just yell Mike you can just do this Stop, Don't Be Afraid, don't be it scares everybody at first you got it then you fall in love with it okay we got it all good I'm kind of a loud talker so I'm sure you probably hear me down the street so Greg Canessa created Xbox Live and I like how he just drops it and walks away from it I created Xbox Live yeah so tell me a little bit about that so uh Xbox Live Arcade obviously is super important uh in terms of the genetic Legacy of the of the industry uh we take it for granted now",
            "start": 560.8
        },
        {
            "text": "I created Xbox Live, yeah. So tell me a little bit about that. So uh Xbox Live Arcade obviously is super important uh in terms of the genetic legacy of the of the industry uh we take it for granted now but the idea of this kind of more indie platform and stuff like that but obviously Xbox was way ahead of the curb on that in console so tell me a little bit about where that came from and how you kind of how that came to be because there was similar to what you're working with now, there is there was a stigma about those kinds of games back then and there isn't anymore. Yeah absolutely I mean uh the the story of XBLA is actually a pretty interesting one um it was a it was a product that almost didn't exist and shouldn't have existed um to be honest it was not part of the plan for Xbox 360 at all um so it was a uh it was an idea that I concepted in 2003 um and it was really a product of a number of things I was seeing in the industry at the time that were unrelated right so you had you",
            "start": 603.08
        },
        {
            "text": "so it was a uh it was an idea that I concepted in 20 late 2003 um and it was really a product of a number of things I was seeing in the industry at the time that were unrelated right so you had you rewind way back to 2003 right you had PlayStation 2 killing it there you had OG Xbox trying to establish itself we had just launched Xbox Live for OG Xbox which was very limited right it was voice chat and multiplayer game it was Halo 2 Rainbow Six: Lockdown that entire thing in Rainbow Six yes um there was a couple couple really good games there um and you had that weird green dashboard thing that was like not software upgradeable um there were a number of things at the same time that were going on in the games industry that had precipitated sort of the vision for this one was uh iPod and it iTunes and the iPod were just starting to take hold and for the first time ever there was a legitimate path for users to get digital content D downloaded directly from their PC onto their device that was a",
            "start": 639.04
        },
        {
            "text": "and the iPod were just starting to take hold and for the first time ever there was a legitimate path for users to get digital content downloaded directly from their PC onto their device that was a foreign concept up to that point remember 2003 we're talking big Publishers AAA you got you watch your game it's got to be this development budget and it's got to be this huge marketing campaign and it's got to be $20 million and you got to work with Activision or EA or Take-Two or you're like you're not getting on the console right so there was no Indie movement uh Steam did not exist there were no digital platforms app stores Google Play iTunes no no none none of this stuff it was we were the very first so uh the only path on the consoles was through a publisher there was no Indie movement Retro Gaming existed but was really hard to make money so you had Midway Namco Namco Museum you remember PS2 PS1 Namco Museum one and two and three later uh you had uh Midway Arcade Treasures",
            "start": 686.8
        },
        {
            "text": "Retro gaming existed but was really hard to make money, so you had Midway, Namco, Namco Museum - you remember PS2, PS1, Namco Museum one and two and three later. You had Midway Arcade Treasures; you had some people trying to bring back retro, but they weren't making any money because it was really easy to download the main movement had started up in '99. So I love that stuff like I grew up in the arcades right, and so you know I used to go to you know Golf Land and you know play Miniature Golf and then spend three hours in the in the arcades. I used to have my uh my birthday parties as a kid at Chuck E. Cheese's and we got unlimited tokens, and so I grew up loving retro games, and so that was happening digital content distribution, and then I was just frustrated - I was part of the Xbox team, and I was frustrated with this path you know this this weird convoluted path to try and get games on a console it was unrealistic and dumb. And then the last thing is you had casual; casual was a web",
            "start": 731.24
        },
        {
            "text": "I was frustrated with this path, you know, this weird convoluted path to try and get games on a console. It was unrealistic and dumb. And then the last thing is, you had uh casual. So casual was a web portal thing, right? It was Pogo and you know MSN Games and remember the Gaming Zone and all that stuff. All these like games, flash games, and a web browser, and you like a $20 download, you know. And those are cool games, but there was no way in hell you were ever going to see any of those games on a console, like just no one, no one wants to play those games right? That's **** so uh so wrote this business plan, this crazy idea which was totally not part of the plan for for Xbox Live. There was the Book of Xenon, you guys may have heard there was like the three-page 33-page 333-page thing that Robbie and you know and and uh Jay Allard and so forth had written. I have no idea what we're talking about, what what is that? This was uh this was like a um at at the Robbie Bach talks about this in his book if",
            "start": 773.6
        },
        {
            "text": "You know, and uh Jay Allard and so forth had written I have no idea what we're talking about, what was that? This was uh this was like a um at Atari Boch talks about this in his book if you if you ever read his book it's um it's at Microsoft they write these kind of concept documents basically it was like a vision for the 360 and what they wanted to do with the console program after OG Xbox and how they wanted to evolve it to sell 100 million units and what the plan and the vision was, the three pager then becomes a 33 pager and a 333 pager which they had called The Book of Xenon. Xenon was the code name for 360 and so uh at the time they had this incredible Vision mostly led by Jay Allard to be honest with you I mean he's the guy he's the father of Xbox 360 and the father of Xbox Live as far as I'm concerned he was the guy that had the vision of okay we have Broadband in the box where can we go with this thing, multiplayer is just the beginning like all the stuff",
            "start": 821.36
        },
        {
            "text": "of Xbox Live as far as I'm concerned he was the guy that had the vision of okay we have Broadband in the box where can we go with this thing multiplayer is just the beginning like all the stuff the achievements the marketplace the leaderboards the you know all the cool stuff um the party chat all of that stuff all the stuff we take for granted now all the stuff we take for granted now was all novel concept stuff like no one had ever done this stuff in history um and so uh my my my idea was why don't we take and leverage this pipeline let's leverage this little pipe that we have this Broadband pipe that wasn't being considered for real downloadable content and let's actually leverage it to download full game content for the first time ever onto a console and it was at the time again 2003 it was like really no and and why would people want to download small games and Indies what who cares about their games and Casual no one wants to play Beed on a console that's dumb and it was a lot of",
            "start": 863.52
        },
        {
            "text": "was like really no and and why would people want to download small games and Indies what who cares about their games and Casual no one wants to play BeDo on a console that's dumb and it was a lot of detractors a lot of people that had couldn't see retro games no no one wants to play that stuff people only want to play Call of Duty people only want to play Madden and and and those big games and so it was an uphill battle it was a total uphill battle the business plan was two-phase it was do a test concept on Xbox OG Xbox and if that worked we would do full Dash integration and the the master plan was really to fully integrate into the console for 360 and so we launched the um we launched the the OG Xbox version in4 it was actually um the same day as Halo 2 probably the version that you don't remember um it was on a disc I don't know if you guys remember this I remember it was on a disc and it was we we literally like had a hell of a time getting this disc in people's hands we were",
            "start": 909.44
        },
        {
            "text": "don't remember um it was on a disc I don't know if you guys remember this I remember it was on a disc and it was we we literally like had a hell of a time getting this disc in people's hands we were polybagging it into like magazines giving away trade shows it had Pac-Man Miss Pac-Man as a pack-in and it was weird because we couldn't software upgrade the OG Xbox right we couldn't upgrade the dash it was not flash flash eom upgradeable whatever call that which is basically you can update the dash right so uh that basically meant that you had to you could stick this in the tray close it you'd get this dashboard that had all these games every game had a demo every game had a free trial games were $10 to $20 you know $10 $15 $10 and $15 they were all 50 Megs or less so they were easy to download um but the wonky thing was there were like 20 games the original service for the OG Xbox but you had to have the disc in the tray to access the content that you downloaded that was on your hard drive",
            "start": 955.96
        },
        {
            "text": "Um, but the wonky thing was there were like 20 games on the original service for the OG Xbox, but you had to have the disc in the tray to access the content that you downloaded, that was on your hard drive. It was like totally non-optimal. Um, but you know we download, we tried this thing and we launched it the same day as Halo 2, of course we got drowned by that, but Jay Allard had announced it at E3 that year and we'd never seen any reaction from the crowd like this at an E3. It only had been at a few E3s. But I give me the eyes, sorry, yeah okay, sorry. So I'll push you in closer, you keep talking. I I I I keep thinking that I'm gonna slam my mouth into this thing. Um, but uh oh, sorry okay. Pushing closer all right this is great, oh wonderful, oh yeah great, so great, oh my God, that took a turn for the absurd. Whatever turn to the Absurd, I liked it. Um, so anyway, so we did that and we saw a... almost nobody saw this thing on the OG Xbox version, sure, but of the people that did, we saw a...",
            "start": 1005.6
        },
        {
            "text": "a turn for the absurd, whatever turn to the Absurd, I liked it. um so anyway, so we did that and we saw a so almost nobody saw this thing, the OG Xbox version sure, but of the people that did, we saw a download to trial, trial to purchase conversion rate about 8 and a half to 10 times that of what we saw in say the PC industry. like we knew we were onto something because people were, we had an amazing download rate, I mean people were downloading these demo trials like Gangbusters, we had up to 50% initial download adoption of the people that had stuck the disc in, people were downloading six to eight of the demos and they were, they were converting to purchases at 8 and a half to 10 times the rate that we were seeing in the PC space at the time. so we knew we were on to something and that ended up being the initial sort of validation for being able to go on to 360 but even then again that was just the beginning of the story because it wasn't part of the master plan and when you're at a big",
            "start": 1052.56
        },
        {
            "text": "up being the initial sort of validation for being able to go on to Xbox 360 but even then again that was just the beginning of the story because it wasn't part of the master plan and when you're at a big company like Microsoft or Sony frequently The Little Engine That Could type of products are not the ones that um that that end up getting a lot of the mind share and you typically have a lot of their larger organizations or some politics involved and their um let's just say that Xbox 360 Xbox Live Arcade had its share of detractors uh so it was not a foregone conclusion that we actually were able to execute on 360 um we actually had the by the time we had determined okay this is actually something that people want the success we launched in November 2004 and remember Xbox 360 launched November 22nd, 2005 so we had a year all right so we spent a few months we validated we were able to prove it almost immediately we knew that we this was something we wanted to do",
            "start": 1109.16
        },
        {
            "text": "November 22nd, 2000. November 22nd, 2005, so we had a year all right, so we spent a few months validating, we were able to prove it almost immediately, we knew that this was something we wanted to do; the business plan had outlined a two-phased implementation, right? And so I immediately went and said, \"All right, I want to do the 360 version.\" Well, we had little known like when you're doing consoles, right. Um, some of you guys may understand there's the hardware and all that manufacturing, you know, China and all that stuff, but there's also tons of people that are working on the backend platform, and they're working on the system software that actually goes on the device, right? And a lot of that now nowadays you have broadband and there day one patches, and everything gets updated day one. But back then in 2005, you really had to have a really stable based operating system flashed on Resident on memory in the device to actually make sure the 360 didn't fall over at launch, and so the system",
            "start": 1159.56
        },
        {
            "text": "back then in 2005 you really had to have a really stable based operating system flashed on Resident Evil on memory in the device to actually make sure the 360 didn't fall over at launch and so the system software team was already well underway they'd been working for years on getting 360 ready for launch and since we were launching uh in 2005 November of 2005 we had to have the final software tested and ready in August of that year so here I am it's December we're a month in just even on the Xbox Live arcade OG Xbox experiment and I want to integrate it into the dash there's no plan for that the Book of Xenon the the vision had a Marketplace but it was a really small Marketplace it was like hats and swords and you know gamer picks sort of stuff um there was a plan for achievements there was a plan for leaderboards but there was no digital content distribution service implied at all and so went long story short um went out to Jay Allard uh December 10th uh 2004 a date that will live in",
            "start": 1201.68
        },
        {
            "text": "a plan for leaderboards but there was no digital content distribution service implied at all and so went long story short um went out to Jay Allard uh December 10th uh 2004 a date that will live in infamy well I'll never forget this day it's probably one of the most you know most most important in my my career probably is uh the day that we actually went as a Friday and I sat in in J all's office I'll never forget it and I asked Cam Frontera was there who was the head of the Xbox Live sort of uh software development team at the time and Jay was in charge of the whole project and I remember sitting there next to his uh he's a huge Eugene Jarvis fan so we had a Robotron 2084 machine in his office and so I sat next to his Robotron machine and I pitched him once again he'd seen it before uh Xbox Live Arcade was a concept pitch that I pitched to five Executives at Microsoft and they all shot it down they were like thanks but no thanks no that's dumb no it's in conflict with our interests",
            "start": 1251.68
        },
        {
            "text": "Xbox Live arcade was a concept pitch that I pitched to five Executives at Microsoft and they all shot it down, they were like thanks but no thanks, no that's dumb, no it's in conflict with our interests, whatever. No one wanted to fund it. Jay was the one to fund the initial OG Xbox experiment with a team of seven people in a small content Development Fund uh back the previous year so I went back to him and said hey Jay it's working can we do this and I pitched him these sort of gamer scenarios about how there was the male gamer and the girlfriend that might be interested in more casual content, there was the guy that might be interested in Indie content and you know I painted these scenarios and I basically asked for funding to integrate and the guy that was sitting there, Cameron, who's an awesome guy but he was under the gun right, I mean they were eight months from shipping the software had said hey um I don't have time for this like this is cool but I thought we're out of time.",
            "start": 1296.32
        },
        {
            "text": "an awesome guy but he was under the gun right I mean they were eight months from shipping the software had said hey um I don't have time for this like this is cool but I thought we're out of time like what Greg wants to do he wants to integrate into the dash it implies a bunch of stuff that we don't have in the system like we don't have a demo trial thing we don't have a cloud storage license key thing we don't have any of this stuff like I can't do this no and um Jay looked at me he thought for a moment and I'll never forget it he looked out the window and he said no this is actually something we have to do this is a key part of where we want to go with Xbox Live this is a key part of the long-term vision for the service Cam you will work with Greg you will figure out a way to get this done you know he basically overrode him in the meeting in front of me um and said you will you will figure out how to get this done Greg you have your people because I had asked for a few more",
            "start": 1343.2
        },
        {
            "text": "this done you know he basically overrode him in the meeting in front of me um and said you will you will figure out how to get this done Greg Gettys you have your people because I had asked for a few more people and another content Development Fund you you'll make this happen and how badass did you feel uh at the time I just felt relieved because it was I was say I thought maybe You'd feel scared I know that would be oh **** I got to make this happen now I I I oh I'm sure I did feel scared at the time I mean I just remember a tremendous sense of relief because we thought we were on to something but yet at that at that meeting one thing the other way Xbox Live Arcade would not exist and had it not existed I mean literally it's I'm not trying to be hyperbolic here but if that did not exist I don't think the Indie movement would be where it is today I don't think the app stores would be where they are today I don't think PSN and we wear and all these other things would would have happened the way",
            "start": 1389.4
        },
        {
            "text": "The Indie movement would be where it is today I don't think the app stores would be where they are today I don't think PSN and we wear and all these other things would would have happened the way they happened so no way especially because of the Year lead that Xbox 360 had on Wii and PS3 so you could see that I mean Greg and I talk about it but PlayStation 3's App Store on digital store used to run on a browser that's how that's how like what they must they saw it they probably saw it Xbox like we got to do something what the **** are we going to do you know and that's why you have Super Rub'a Dub running on a goddamn browser on PlayStation 3 in6 so that's what's so fascinating to me about Xbox uh cuz we're more obviously I mean Canessa and everyone knows more PlayStation Centric we played we just played Gears not not too you know a couple days ago um for a 5 hour stream but we just reviewed it too in the topic before this one oh that's right yeah we're going out we're we're recording",
            "start": 1429.36
        },
        {
            "text": "we just played gears not too you know a couple days ago um for a 5 hour stream but we just reviewed it too in the topic before this one oh that's right yeah we're going out of order um but what I love about Xbox when I'm interested in Xbox because I owned an original Xbox I bought it when I was freelancing for IGN when I was in college and I bought you know Halo and all the stuff and Rainbow Six 3 was um a really seminal game for me on that console getting me online because I didn't play online games I played Dreamcast a little bit like NBA 2K and stuff like that but being able to even go online with that and I was a freshman or a sophomore in college and I would like have this kid lived down the hall from me and he was like really smart with computers we'd be able to plug in the T1 lines from our dorms into the thing but he had to like type all the **** into the Xbox to make it work to think it wasn't a computer because we were using so",
            "start": 1467.52
        },
        {
            "text": "we'd be able to plug in the T1 lines from our from our dorms into the thing but he had to like type all the **** into the Xbox to make it work to think it wasn't a computer because we were using so much bandwidth and then I was paranoid I was going to get shut down and stuff like that and I was serving games when I was in class all the time because my connection was so great and when you really think about the genetics of games like you were saying before Xbox is really important it really started with Dreamcast and Microsoft's kind of involvement with Dreamcast but uh yeah exactly but um which is I think an understated kind of thing in the lineage of of my of Xbox is really it's start with dream Dreamcast but um but with Xbox and Xbox 360 there is so much important **** going on with broadband internet and the original Xbox which didn't seem very intuitive um and then with Xbox Live marketplace achievements uh digital leaderboards all those kinds of things it's really I don't",
            "start": 1502.0
        },
        {
            "text": "broadband internet and the original Xbox which didn't seem very intuitive um and then with Xbox Live marketplace achievements uh digital leaderboards all those kinds of things it's really I don't think Xbox always had the goods with the games I mean that's always been my my like my I think they have some great a few great exclusives and stuff like that but they had the goods with how we play games and I think that that was a really important thing and I think you're actually even seen that a little bit with Xbox one now as well some of it didn't work out the way they wanted it too but anyway it's just on the side I want I've always appreciated that about Microsoft and Xbox yeah yeah I I I I I do think you know we all have our contributions to the game industry and I I mean the games industry you know we're what what we're 30 years in on this you know I I I have nothing but the most tremendous respect for Nintendo and what they've done and their accomplishments and what they brought to",
            "start": 1533.0
        },
        {
            "text": "you know we're what what we're 30 years in on this you know I I I have nothing but the most tremendous respect for Nintendo and what they've done and their accomplishments and what they brought to the table Sony likewise has brought so much to the table over the years in terms of whether it's portable gaming or whether it's the PlayStation and you know the popularization of Eastern content and the Western market and so many contributions I do think that Microsoft just again looking back and just looking at Microsoft's contributions so far of the industry I really do believe it's on live and on the networking side is its principal contribution the box is great the games are great I love gears I love Forza I love you know a lot of their exclusives absolutely Halo is great but I mean if you look at the the major contribution to the industry it's been Xbox Live it's been advancing the ball forward in a time when the industry needed that they need that kind of leadership",
            "start": 1568.0
        },
        {
            "text": "Look at the major contribution to the industry it's been Xbox Live, it's been advancing the ball forward in a time when the industry needed that they need that leadership they need that kind of Steve Jobs. You know no we're going to put broadband in the box we're actually going to push this forward and we're going to drive the whole industry forward and whether that's digital content distribution, like Marketplace, like Live Arcade, whether that's you know achievements, gamer score leaderboards, voice chat, you know all the things multiplayer gaming synchronous you know multiplayer gaming which is you know again largely been popularized due to the push that that Microsoft made in the early 2000s I think it's his principal contribution yeah okay have they had some missteps along the way since then yeah I mean you know clearly I mean I think we all know that the focus on digital, you know the entertainment box in the home and all that stuff is",
            "start": 1608.2
        },
        {
            "text": "they had some missteps along the way since then yeah I mean you know clearly I mean I think we all know that the focus on digital you know the the entertainment box in the home and all that stuff is probably TV yeah probably a step too far but but you could see based on according to your stories and things we've read and I'm really into the kind of the history of of the industry so I read a lot about this stuff as well it seems like Microsoft's always really pushed forward and actually got away with it over and over and over again because it worked until that moment and so you can see how it kind of backfired on them with Xbox One um but you could see also how they drew that conclusion you know based on they got I don't want to say they got greedy they just got bold and bullish with connect integration with the cable box integration voices you know voice control and all that kind of stuff it's like yeah you know but you can understand since they were pushing this this rock down the hill",
            "start": 1648.96
        },
        {
            "text": "integration with the cable box integration voices you know voice control and all that kind of stuff it's like yeah you know but you can understand since they were pushing this this rock down the hill and it was just like it was working over and over again and they were watching their competitor really react to that because even when you yeah when you look at PlayStation Network which still isn't very good uh it's better on PS4 it's people are like it's not good people that join on PS4 that play Xbox 360 we like this network sucks I'm like you have no idea what the **** you're talking about none go on PlayStation 3 in 2008 we'll talk about you know terrible networks um but you've always seen them play catchup with trophies for instance which was a total you know like a a major flop on their part being like we had about that me cross game chat something that took even longer than trophies to get parties do all this different stuff it's unbelievable the things that we again like we were",
            "start": 1685.76
        },
        {
            "text": "part being like we had about that me cross game chat something that took even longer than trophies to get parties do all this different stuff it's unbelievable the things that we again like we were saying that are taking for granted that Sony really had to be reactionary to I think Sony always had the goods with the games and think that that mattered but I don't think that I think you're right because the the games aren't ubiquitous because Uncharted is only on PlayStation what's ubiquitous is the idea of a network console the idea of a Marketplace that's digital so when when Xbox 360 launches because I I I was poor in college I was writing I had my what was I playing in5 so I saw my PS2 my no I didn't I guess PS2 GameCube Xbox so I was still working with those things my roommate Doug who I think watches the Show got his Xbox 360 and was obsessed with it remember him playing King Kong uh with the with the baby 10 chapter 100 each that was my first thousand and I wrote I wrote the",
            "start": 1721.28
        },
        {
            "text": "I think watched the show Doug got his Xbox 360 and was obsessed with it, remember him playing King Kong uh with the with the baby, 10 chapters, $100 each - that was my first thousand dollars. I wrote I wrote the guide for it actually uh based on the PS2 version of the game which I think was identical in some way but um what what were the games that mattered in like because to me Xbox Live arcade and like summer of arcade and all those kinds of things really actually in my mind began that ball started to roll a little later, like it it it didn't seem immediately obvious that the marketplace you know was this viable thing really until like it's really Shadow Complex, Limbo - like all these things are the ones that Geometry Wars, Gears of War, and Killzone right so so um that goes back just to rewind a little bit you know again to that that sort of inception of XA so remember rewind 2004-2005 what do people know? Right there is no indie movement to speak of - there's Garage Games doing M.U.L.E. Blast Ultra, there's",
            "start": 1759.16
        },
        {
            "text": "you know again to that that sort of inception of Xbox, so remember rewind 2004-2005 what do people know? Right there is no indie movement to speak of. There's Garage Games doing MARE Blast Ultra, there's Wreckforce: Fable of Souls, there's a handful of games that came about in response to XA and we actually funded and bootstrapped initially in 2005 but when I was writing the business plan it was about what I call dimensionalizing the ecosystem so there's a couple of principles that really believe strongly in no you're doing angling yeah this this is actually a better this is better cuz now I'm in direct line um so uh the uh there was a couple principles that that I feel very strongly and they're just personal passions of mine right one is curation we can talk about that another is dimensionalizing the ecosystem so when you're building a gaming ecosystem particularly when you're educating the populace on something that they aren't familiar with right you're completely from scratch something new out",
            "start": 1804.68
        },
        {
            "text": "ecosystem so when you're building a gaming ecosystem particularly when you're educating the populace on something that they aren't familiar with right you're completely from scratch something new out of the sky you know Steve Jobs talked about talks about this a lot Apple like people don't know they want an iPhone until you show them the iPhone and then they're like oh my God this is **** awesome how could I ever survive without this device right or your Android device or whatever it is no one's saying that about the Android devices oh um but uh but one of one of the things you have to do is you have to make sure there's a little something for everybody and so you got to remember that when I'm we're trying to create a new platform from scratch from ether that does not exist it was about creating a little something for everybody to attract a broad variety of people and throwing in a combination of things that were innovative and that people had not seen before but also some familiar",
            "start": 1844.76
        },
        {
            "text": "creating a little something for everybody to attract a broad variety of people and throwing in a combination of things that were innovative and that people had not seen before but also some familiar things from some familiar beats and so when we went out and built up the initial content portfolio for Xbox uh live arcade for 360 which was our big bet we had 20 games planned for launch day 20 for launch window 10 for launch day and so there had to be a little something for everybody now I'm a student of the games industry I grew up since I was a kid playing games and so what what was I inspired by I was inspired by Game Boy and Tetris I wanted a Tetris I wanted that pack-in that was like instant validation I get this I'm done I want this thing I I understand how it works perfect I was super fortunate the beautiful thing of working at some company like Microsoft is you have amazing talent everywhere that you can tap into we happen to have on my staff Alexei Petyoff, Alexei Petyoff is the",
            "start": 1884.56
        },
        {
            "text": "fortunate the beautiful thing about working at some company like Microsoft is you have amazing talent everywhere that you can tap into we happen to have on my staff Alexey Pajitnov, not Petoff, Alexey Pajitnov is of course the creator of Tetris he just happened to be on the staff he was actually a janitor, not just \"on the staff\" Tetris H we got the tetris guy he was just little known fact this is you know games the games industry is so small right and and we were super fortunate because back in the days of Ed Fries and Microsoft Game Studios, the EBU, the entertainment business unit right that came about before Xbox or OG Xbox it was a PC gaming business unit right they did they did um Age of Empires they did you know these puzzle game Collections Hoyle and all these little games for PC and Alexey was hired in in the late 90s to actually work on these PC puzzle game compilations um they didn't do very well but Alexey was still very very talented he was kind of like looking for you know looking for new projects so I",
            "start": 1930.88
        },
        {
            "text": "90s to actually work on these PC puzzle game compilations um they didn't do very well but Alexi was still very very talented he was kind of like looking for you know looking for for new projects so I said um I have the Creator Tetris working on my team like hey um I am inspired by Tetris on Game Boy like hey maybe we can't get we didn't want to do Tetris for various reasons but let's try and create our own Tetris uh and so I went over I talked to Alexi this is back when I was just a little engine the remember just me and it was literally just me with a PowerPoint deck and then pitching Executives and then it was seven people for the OG Xbox version which is still nothing and then we grew to 11 um I went to Alexi and said hey do you have any ideas for a really cool puzzle game I want the equivalent of Tetris on Game Boy uh can you come up with something and he came up with Hexic and so Hexic was Alexis' pageant off creation of course we had planned on that being the pack-in game that was",
            "start": 1975.68
        },
        {
            "text": "of Tetris and Game Boy uh can you come up with something and he came up with Hexic and so Hexic was Alexis' pageant off creation of course we had planned on that being the pack-in game that was included and it was in every hard drive for the 360 launch fun fact that was the very first Xbox 360 game to ever be certified so because it was pre-launch it was the first one through the pipe it ended up being this awesome project that was both a super fun game and also critical to the development of the 360 and Xbox Live infrastructure because we didn't have any games it validated the pipeline for certification it was the initial poster child for gamer score and achievements and it allowed us to test all of those systems internally and make sure they were working make sure they were fun so we had Hexic and then we were able to go out and this was privilege privilege of my my job I was given a bucket of money by J Allard and said hey what do you want to do with this and so of course I go naturally to",
            "start": 2022.88
        },
        {
            "text": "and then we were able to go out and this was a privilege, the privilege of my job, I was given a bucket of money by Jason (Jay) and said, \"Hey, what do you want to do with this?\" And so, of course, I went naturally to some of the places that I love and some of the games that I love that I grew up with. So, what I did is I go out and try to dimensionalize an ecosystem, need some retro uh what are my favorite games uh Gauntlet, Joust, Robotron, Smash TV, Midway, how about we do those done? Boom, those are four of the games um PopCap loved PopCap games. I want a couple of real casual games in there. Let's do Bejeweled, Zuma went out to PopCap, they signed up um I really want to do some pushing the envelope sort of indie game stuff that's where Worms (Wick) Fable of Souls came from Marble Blast Ultra, some of the cool sort of indie games we had there launch day or launch window Cloning Clyde if you guys remember some really really talented guys that were just remember pre-steam these guys are little Indies trying to make it garage games",
            "start": 2070.28
        },
        {
            "text": "there launch day or launch window cloning Clyde if you guys remember some really really talented guys that were just remember pre- Steam these guys are little Indies trying to make it garage games little little company that had no distribution they were literally trying to sell on their own websites at the time because there was no Steam on the PC trying to do $20 downloads they came it was an easiest the easiest sell in the world they were like oh my God you're actually going to let us sell on Console I mean yes absolutely we'll do whatever you want so and then we then we got to also work with some of our own partners and this was the super fun part to answer your question about uh what was our killer app initially Bizarre Creations, Bizarre Creations was our PGR partner and so I of course I go to you know Ed and then Shane Kim and some of the other people that were running um Microsoft Game Studios at the time and said you know who wants to do an XBLA game now of course not everybody within",
            "start": 2115.72
        },
        {
            "text": "to you know Ed Fries and then Shane Kim and some of the other people that were running um Microsoft Game Studios at the time and said you know who wants to do an XBLA game now of course not everybody within Microsoft Game Studios was a fan of XBLA so not everyone was like on team XBLA some people thought it was a distraction some people thought it was going to cannibalize the whole games industry and shut everybody down there were a lot of detractors but for the people that were on board there were certain people internally that were fans and they opened some doors made some introductions and that's where Geometry Wars came from so Geometry Wars is a little game, a little offshoot from Bizarre Creations in the UK you know the super talented people right you you meet game creators for a job you guys have amazing jobs you get to meet game creators you know and and talk to them and and interview them you know that these people are not just like they're not creative only with a",
            "start": 2158.08
        },
        {
            "text": "for a job you guys have amazing jobs, you get to meet game creators, you know, and talk to them and interview them. You know, these people are not just like they're only creative with a racing game; they're creative people who right and love working on projects big and small. You know, these guys were heads down working on racing games for years, and a crew of them thought, \"You know what? We just want to do something quick and fun.\" It ended up being one of the coolest unintended side effects of X was that it provided this creative outlet for game creators to actually try and experiment with little stuff. Go blow off your steam; you got an idea, let's try to make it work over there exactly, and then we'll make a little money on the side, but it wasn't even about the money; it was about the creative expression. And so long-winded way of answering your question, the ecosystem at the outset was a little bit of this, a little bit of that; it was more of an emphasis as",
            "start": 2199.32
        },
        {
            "text": "the creative expression and so long-winded way of answering your question the the the the ecosystem at the outset was a little bit of this a little bit of that it was more of an emphasis as a proportion now in hindsight on retro and casual than it was on indie the ecosystem needed time to gate and develop right and really the part that I'm most proud of is what happened in 2006 2007 2008 in the hey days of XBLA when you give now it's not about people you know shipping their old games or it's not about the stuff that was on casual games and all that stuff that stuff was still cool but really it was giving the Indies and the indie industry time to go okay this is legit we can form up a studio we can form up a business model we can sell fund we can go attract the funding that takes a year or two years and then when you started seeing Limbo Braid Castle Crashers Castle you know you started seeing these games come out you know Shadow Complex these are the games that I'm most proud of on",
            "start": 2234.44
        },
        {
            "text": "or two years, then when you started seeing Limbo, Braid, Castle Crashers, Castle - you know, you started seeing these games come out. You know, Shadow Complex - these are the games that I'm most proud of on the platform. And that was that was the moment in time when I think the industry really X I think came into its own. I think the industry started to recognize the accomplishments and I think it began to things now honestly it actually started to fall apart again, uh like late in later years because I think Microsoft again lost its focus. Um, I think they've it's it's all come full circle now that Phil's back in charge. I think things are coming back around again and now they're refocused on Indies and things are getting better again. But there was a period of time where I think Microsoft lost their way uh and the service got messy and you know it got imprecise and that's where um you know again I think M I have to give props to Adam and the team at at at at PlayStation because they",
            "start": 2283.16
        },
        {
            "text": "lost their way uh and the service got messy and you know it got imprecise and that's where um you know again I think I have to give props to Adam and the team at PlayStation because they identified it they saw XBLA for what it was in some ways even more so than some people at Microsoft did and they said wow you know some of the most creative talented Innovative **** going on in our industry is the Indies and let's Embrace that when we go next generation and they were playing catch up with PS3 let's be honest I mean PS3 and PSN was playing catchup pretty much the whole way part of that there's a long story behind that I'm sure you know all about it about you know Japan was controlling it for a while and then they the San Diego guys were trying to help out but they weren't in control and it was in two places for a while and they finally got it it was too late like they made a ton of progress towards the end of PS3 when it came over to the States but for a long time",
            "start": 2326.12
        },
        {
            "text": "in control and it was in two places for a while and they finally got it it was too late like they made a ton of progress towards the end of PS3 when it came over to the States but for a long time Japan thought they knew what they were doing and you know there were some issues there yeah and I think they basically acknowledge that they don't now that the center their power is actually just south of here shifted it over to San Mateo and boom you know they've they've made such amazing progress but you know in the time between PS3 and PS4 you know you saw I got to give props right so Santa Monica and you know some of the first party Studios there was Flo there was some interesting stuff there uh that was you know John Hight and the guys that were doing some sort of first-party you know PSN Network the the competitor de la was trying to do some stuff not just oh two years later X ports but they were trying to do some of their own stuff that's where they were big on incubating things Sony",
            "start": 2368.56
        },
        {
            "text": "the competitor de blau was trying to do some stuff not just oh two years later X ports but they were trying to do some of their own stuff that's where they were big on incubating things Sony Santa Monica particularly the right of bringing people in and working with them and trying to make their game the best it could be yes yes and there were a few people that were leading the charge there and they they got some they got some bandwidths and some budget they did some great things but in PS4 the time between late PS3 and PS4 is when Adam and the team just went that's actually a competitive advantage and of course Microsoft got distracted on some other things for a while we know that regime and then they were all about you know Madden and Call of Duty and and uh you know entertainment in the living room and television sets and that's when XB kind of veered off and they went we're actually now Jonathan Blow you know let's go let's go grab Firewatch let's go get you know let's go get",
            "start": 2408.48
        },
        {
            "text": "living room and television sets and that's when Xbox kind of veered off and they went, \"Let's go grab Firewatch,\" let's go get you know, let's go get the key talent, the Lauren Landgraf, let's go get the people. And then that you know, the PS4 obviously, the famous now uh press conferences at E3 when they announced the two consoles or or pre before that actually before E3 when they anounced the conferences and Sony, you know, Sony as an active part of their presentation was like Indies, you know, our XA and call it XA but I mean them. And then what Microsoft had which was hey here's your Madden in Call of Duty and television sets, the Halo Network we're going to make for you yeah yeah Sports sport Sports and More sports iifa that Sizzle reel is still the best thing ever that those guys put together but it's come full circle again right. And and this is where I mean I think you know I I I talked to Ryan McCaffrey about this, we did an I on on XA um but uh I",
            "start": 2446.96
        },
        {
            "text": "The Epic History of Xbox Live Arcade - Kinda Funny Gamescast Ep. 90 (Pt. 3)\n\nthing ever that those guys put together but it's come full circle again right and and this is where I mean I think you know I I I talked to Ryan McFarland about this we did an episode on XA um but uh I Kev cut that out we didn't want to promote that my my my reach was you guys are still friendly no we're everybody should listen it's great but uh you know my my my call out to to Phil Spencer and the Xbox team is you know X was actually been decommissioned as a brand um in the on the Xbox one I don't know if you guys know that but I mean certainly you do I don't know if all your all your listeners do um fans do but um that's crazy like like I don't I I was searching for another example of a brand it's probably the most successful you're talking about a multi hundred million dollar business like X wasn't this little side note like this was a multi hundred million dollar business I mean you talk about the later years in Minecraft and all the things that happen on that platform it's probably the",
            "start": 2493.48
        },
        {
            "text": "\"wasn't this little side note like this was a multi hundred million dollar business I mean you talk about the later years in Minecraft and all the things that happen on that platform it's probably the most successful brand in modern memory in the games industry certainly that has been decommissioned like and it solves lots of problems that Microsoft has right now and so if you look at XBL Wednesdays and Summer of Arcade you know the ability to promote the curation the discoverability in the app store which is another huge passion of mine like discoverability is such a huge problem in our industry right now we've talked about we talked about that on the show over and over again which is a huge problem that that glut of garbage on these on these stores and XA was that that signpost that that badge of quality like when you especially some of arcade like if a game made it into the slot there you knew it was going to be good and you know you need that that curation you need that\"",
            "start": 2540.92
        },
        {
            "text": "that Badge of Quality, like when you especially some of Arcade games, like if a game made it into the slotting there, you knew it was going to be good and you know you need that that curation, you need that that brand to really represent that this is something that you should pay attention to and also cut through the BS in the marketplace right you've got games like Inside which are phenomenal, Inside is absolutely phenomenal, probably my game of the year so far and and it is it is absolutely a 10 out of 10 and it is merchandised where is it in the marketplace it's merchandised underneath Best Case it gets a little blip alongside Destiny 2 The Collection and Gears 4 and Forza Horizon 3 and maybe one time out of a hundred maybe it appears there and most of the time it's search results only what and what to to a bigger question with that is what surprised me about that I don't know if you have any insight into this because you're talking about using your your bucket of money to go buy these",
            "start": 2581.44
        },
        {
            "text": "and what to do with that is what surprised me about that I don't know if you have any insight into this because you're talking about using your your bucket of money to go buy these games or at least get some exclusive windows with them what surprised me with Inside specifically was and I guess this is kind of a mixture between the old Microsoft and Phil Spencer's new or old Xbox new Phil Spencer's new Xboxes I was shocked when Inside's trophies popped on EXO phase and PSN profiles literally two weeks after the game launch and I'm like you guys didn't even pay to keep this like that was that was a that I was like we're going to wait two years I got to plug in the Xbox some point and play this game and then it popped up and I was like that showed me a different kind of thing too where I was like this was literally on your stage at E3 like this was a game you guys were talking about and you have it for a month you know don't you guys so it seems like that's changed a little bit",
            "start": 2629.56
        },
        {
            "text": "I was like this was literally on your stage at E3, like this was a game you guys were talking about, and you had it for a month, you know don't you guys? So it seems like that's changed a little bit too. It has changed, I mean, it's really come full circle again. I don't work in Microsoft anymore, so I mean, I know Phil - I love Phil, I love Phil and his team, I love Aaron Greenberg; I worked with Aaron back in the day. We did we did a lot of really fun stuff together, the Pac-Man World Championships, bunch of other stuff, Side Stories if you want to hear about them someday. But um, I that that business as far as I can tell has come full circle right? So it went from uh we were ahead XA 360, we were ahead, to wow we're firing on all cylinders, to we got a little ahead of ourselves, we started jamming a bunch of stuff in there, and we also got a little ahead of ourselves in terms of being um too aggressive with terms, and that pissed a lot of people off. And then what happened was you know meanwhile Adam",
            "start": 2661.4
        },
        {
            "text": "of stuff in there and we also got a little ahead of ourselves in terms of being um too aggressive with terms and that pissed a lot of people off and then what happened was you know meanwhile Adam and the team at Sony are like we're over here and they did some smart things and they signed some exclusives and they did some stuff and then Microsoft's come back around because of Phil Spencer and his leadership and they've refocused and it's about Gamers and not about entertainment and they have now uh a state of they have a developer program in ID at Xbox and so it's very developer-focused, they're still focused on Indies and incubating Indies and such now I think they've now kind of taken their look back a little bit and kind of refocused and I think they realize how important Indies are but they haven't completely squared the circle yet in terms of rounding it back around to the consumer experience and this is the part I still still think they have some work to do on is from a consumer perspective",
            "start": 2702.44
        },
        {
            "text": "complet they haven't squared the circle yet in terms of rounding it back around to the consumer experience and this is the part I still still think they have some work to do on is from a consumer experience a dashboard experience and a marketing standpoint they haven't said okay here's our brand here's our curation here's our discoverability here's our summer of arcade here's our promotion here's all of the consumer facing side of that they've addressed or partially addressed on their way to addressing some of the developer Community stuff and so you know I think Phil Spencer's orientation and again I'm not Phil you should ask Phil but I mean Phil Spencer's always been of the mind at least from the days that I know him Phil Spencer's always been of the Mind mind of you know what this exclusive stuff like paying for exclusive just in general this with triple-A like I don't I think he's thinking okay first-party exclusives Gears Forza you know that stuff really important right important platform differentiators",
            "start": 2746.84
        },
        {
            "text": "for exclusive just in general this with trilogy like I don't I think he's thinking okay first party exclusives Gears Forza you know that stuff really important right important platform differentiators but in terms of multiplatform exclusives at least my observation just as a gamer no no expert knowledge here is that they seem to be kind of moving away from that like it's about games are it's about games for everybody and games you should be able to get to games like you you know you having this indie game that Premier is over here and I have to wait to year to play Firewatch or I have to wait a year to play whatever that's just it's is dumb so like why do that and so I think a lot of those you're seeing kind of the end result um with an inside or with a witness or with a Firewatch you're seeing the end result of some like back behind the scenes sort of Business Development deals yeah Playdead especially could probably because I I could I could have sworn because you were talking about",
            "start": 2789.52
        },
        {
            "text": "The end result of some like back behind the scenes sort of business development deals, yeah. Playdead especially could probably because I I could I could have sworn because you were talking about the terms I know Sony was getting aggressive with the terms and I thought that the story was with Playdead that they wanted Limbo exclusively didn't they wasn't Limbo first pitched to Sony and Sony was like we want the IP inside yeah no was it inside or was it was it Limbo was an Xbox exclusive I know that but before they before I might be confusing with Inside but I thought Playdead pitched Limbo to Sony first and Sony was like and Sony i i people can out there can me Sony usually wanted IP or whatever and was and and they were like we're not giving the IP up so then they just went to Microsoft who didn't I guess have the terms that batten down yet and then they both seemed to be having from the experiences from the people we've talked to like the the experience was more difficult with with Sony at",
            "start": 2830.28
        },
        {
            "text": "I guess we've had the terms that batter down yet, and then they both seemed to be having from the experiences from the people we've talked to, like the experience was more difficult with Sony at first, and then it got like you were saying, got easier, yeah, because then there was no publisher, you know, the idea of needing a publisher to publish still on Xbox Live Arcade in some way. You could sell, publish with Sony, and then it seemed, comp, it seemed like a war of escalation and then deescalation, and we've heard it from you know our other friends Dan who represents Axiom Verge and other guys, the complications with the first parties on these digital platforms were extreme. Um, it was, and you know anytime you do it's it's tough, and of course I have my own perspective on it, my I mean my perspective I'll tell you is is like it's hard anytime you create a new business right, and especially",
            "start": 2867.24
        },
        {
            "text": "anytime you do it's it's it's tough and of course I have my own perspective on it my I mean my perspective I'll tell you is is like it's hard anytime you create a new business right and especially if a business is new disruptive and successful right XBLA was never part of the plan so there was no Financial expectations behind it you know there was no uh it wasn't baked into the plan and the Xbox Live revenues and all that stuff so we launched XBLA in 2005 uh we did our entire first Year's numbers in three weeks so three weeks and what is the ripple effect then at Xbox then the ripple effect it was just the beginning of the fun believe me because anytime something like that happens it's un unintended consequences whatever but it it it happens it's it's it's a very challenging situation you think it's all just cracking champagne and awesome but it actually isn't you have detractors that are trying to uh well they were trying to kill it beforehand now they're trying to grab it um they're",
            "start": 2904.84
        },
        {
            "text": "think it's all just cracking champagne and awesome but it actually isn't you have detractors that are trying to uh well they were trying to kill it beforehand now they're trying to grab it um they're trying to take it for their own P&L right they're trying to grab the profit loss statement sorry the financial lingo um they're trying to grab the money they're trying to own it control it they're trying to steer it in certain directions there were a lot of people I had mentioned earlier the detractors right there were a number of detractors throughout the organization around the concept of XBLA amongst the detractors were people that thought that we were going to blow up literally destroy the retail model of console retail gaming for $60 we're going to erode price points and we were going to kill the entire industry and kill the console business there were literally people that said that at Microsoft pre-launch um there were other people that thought that we had no business picking",
            "start": 2951.08
        },
        {
            "text": "to kill the entire industry and kill the console business there were literally people that said that at Microsoft pre-launch um there were other people that thought that we had no business picking content, picking game content that we should be sort of you know agnostic so there were a lot of detractors but when you launch and you have that much success there's a tendency to pull it in a bunch of different directions internally there's everyone that kind of wants to use it not everybody but there's a number of different people in positions of power that want to do different things with it one of the things was um you know we had remember we're only 2 years, 3 years in the console business at this point this is 2004, 2005 we just launched Xbox uh 360 we were we just got Live launched in 2002 we just got EA on our platform in 2003 I mean we're like a year in on our EA relationship right and so we had not to just pick on specifically on EA but I mean as an example there",
            "start": 2988.04
        },
        {
            "text": "launched in 2002 we just got EA on our platform in 2003 I mean we're like a year in on our EA relationship right and so we had not to just pick on specifically on EA but I mean as an example there were people that were legitimately concerned that if we mismanage digital distribution of content or not give the Publishers whatever they wanted that we were going to piss them off and they were going to abandon the platform like they did with Dreamcast or not support it or whatever and so that was a legit concern internally hindsight it seems silly but at the time it was the mindset of people I understand that now I don't fault anybody but it was those were the times and so when I was there and the one thing that's cool is because when the Creator, Greg Canessa, is actually there running the team there's a lot of sort of default like difference to like hey well you know Greg knows what he's doing so he's going to pick the games and he's going to pick what's on the platform etc but then when I left I left",
            "start": 3031.88
        },
        {
            "text": "of sort of default like difference to like hey well you know Greg knows what he's doing so he's going to pick the games and he's going to pick what's on the platform etc but then when I left I left in 2007 um and when I left um it it got pulled in a bunch of different directions and so there was a lot of stuff we had in the pipeline we had over 140 games in the pipeline we shipped the first 75 while I was there um so we had a lot of games and we had again the magical time not correlated to me I had 35 people some of the best talent in the industry working on this right amazing people um that that was a generation we got Castle Crashers, Braid, Limbo, The Shadow Complex - it was around that 2007-8 period um it it was very focused and then what happened was you began to see it cuz there was I left and then there was a vacuum and then it started to get pulled in a bunch of different directions and that's around the same time that Microsoft went back to its roots",
            "start": 3076.48
        },
        {
            "text": "cuz there was I left and then there was a vacuum and then it started to get pulled in a bunch of different directions and that's around the same time that Microsoft, there was always going back to 99 and the original pitch for the OG Xbox that you've all read about and heard about this goes back to Bill Gates and Bill wanting to be it's a it's a it's an entertainment battle for the living room thing and entertainment's got to be part of it and you know it's all of that stuff um that never died it was always an undertone on Xbox every step of the way through OG Xbox and 360 Robbie Bach was always keeping an eye on it of course the guys like Jay Allard were like yeah sure we need to win with Gamers first and we need to stay focus on games and Gamers and that's why I think we had that magical moment for a number of years where we were able to stay focused and you had that integration between Hardware software and services that you know they talk about a lot with Apple like that seamless",
            "start": 3122.84
        },
        {
            "text": "Moment for a number of years where we were able to stay focused and you had that integration between hardware, software, and services - that's what they talk about a lot with Apple, like that seamless integration of all the different components was the key to success. And I think 360 was the high point of that. You then began to see after not just me leaving, but there was a change of the guard with a lot of people, right? Peter Moore and why though - but like, why do you leave and why do you see this start? Is it just that you're on to another adventure or was it... yeah, for I mean, for me it was. It was seven years at Xbox, I'd seen through two generations of consoles, I'd gotten Xbox Live Arcade off the ground and saw it through. I'm a builder, not a shepherd - I mean, just by personality, I'm more the guy to create something new, manage a team, staff up a team, manage a team, launch it, do something really innovative, see it through to a point to stabilize it, and then build...",
            "start": 3165.08
        },
        {
            "text": "I'm more the guy to create something new and manage a team, staff up a team, manage a team, launch it, do something really innovative, see it through to a point, stabilize it, and then build something else. And so for me, I wanted to go build something else. I tried to do that at Microsoft, just candidly, I tried to do that a number of times. My predisposition wasn't \"oh, I gotta leave Microsoft.\" Microsoft was amazing, but there was a ton of people on Xbox 360; it was a hit. We had a ton of people come in; everybody wanted a piece; everybody wanted to direct it. It was there was a lot of push and pull, and you know we had that moment where Phil Spencer was in control, and Peter Moore was there, and everything was aligned; the stars were aligned; we were launching; we were executing. And then this undertone, this undercurrent of not Phil's regime but the other regime, like that was... it's about casual, it's about connect, it's about uh entertainment, living room, and TV, and DVRs, and that",
            "start": 3205.04
        },
        {
            "text": "this undercurrent of not Phil Spencer's regime but the other regime, like that, was um it's about we it's about casual it's about connect it's about uh entertainment living room and TV and DVRs and that was the from my perspective it's after I left but my perspective that began to take hold and what sacrifices were made there was the focus on games Gamers Indies focus on you know some of the live features I think got deprioritized that we wanted to do that were gamer features and in priority in favor of doing connect features and we we remote sort of stuff and you mentioned when you came you know you're a hardcore gamer and that's why Xbox loses that PlayStation doubles down in that and that's why there's this different thing with play for Xbox One Bingo Bingo and then at the same time all that was happening and in my opinion they were defocusing uh Sony and it's it's F the yin and yang like it was exactly inverted when we were launching with 360 and PlayStation 2 was really they were",
            "start": 3249.68
        },
        {
            "text": "Happening and in that, in my opinion, they were defocusing uh Sony and its it's F the yin and yang like it was exactly inverted when we were launching with 360 and PlayStation 2 was really they were really cocky and they were commanding a bunch of sort of crazy terms from developers and doing a bunch of stuff behind the scenes and then Ken Kutaragi and the PlayStation 3, and you'll get a second job and all this stuff, and we were just sitting there going like at Xbox, we're like oh my God, yeah, we would never do that. And then shoes on the other foot years later. That's what I was going to say is that it seems to happen in this industry not that I know any other industry like I know this industry but like it seems like it happens in this industry over and over again where someone just **** it up, like like like it it doesn't even seem to be it doesn't even seem be like the Innovations on X the original Xbox were great but it didn't stop PlayStation 2 from selling literally",
            "start": 3299.8
        },
        {
            "text": "just **** it up like like like it it doesn't even seem to be it doesn't even seem be like the innovations on X the original Xbox were great but it didn't stop PlayStation 2 from selling literally yeah six times more right so like it was it was you know it's like it's the cartridge moment with N64 when they're like but you have all these relationships with these publishers they don't want to put their games on C so it's not going to make games for you anymore like you didn't have to do that but you chose to do that and it's the same thing with uh Dreamcast with no piracy controls it was the same thing with PlayStation 2 to PlayStation 3 with the second job and we can sell 10 million units without ever putting a game on it and all the **** the crazy **** they were saying about it for yeah and then and then it's the same thing with the Xbox One reveal and it's just it's this cycle that I've that doesn't take a deep **** thinking mind to identify where it seems like",
            "start": 3336.56
        },
        {
            "text": "for yeah and then and then it's the same thing with the Xbox One reveal and it's just it's this cycle that I've that doesn't take a deep **** thinking mind to identify where it's like it seems like it's it's not someone else being coming in stealing the thunder it's always someone just tripping and falling on their face and there's just someone else shrugging be like I guess it's us now I'm just going to keep walking I think a lot of I like a lot of it's just human nature a lot of his Underdog mentality right when you're behind and you're like you know well this is a more survival Instinct like you got to you got to catch up you got to you got to do something and you are at a console generation border and you have the you have some innovative ideas and you are it's a survival Instinct kicks in you're like we have to be successful here or we might have enough jobs like that kicks in and I think you know certainly with PlayStation 2 to Playstation 3 and us going back oh my God what",
            "start": 3369.48
        },
        {
            "text": "kicks in, you're like we have to be successful here or we might have enough jobs like that kicks in and I think you know certainly with PlayStation 2 to PlayStation 3 and us going back oh my God what and then I wasn't there for the when that happened on the other foot you know shoot the other shoe dropped but effectively what appears to be for me and I know some of the people that were in the room not all of them um they lost their way and at the same time PlayStation retrenched after PS3 and some of their difficulties and said we need to stay focused we want to innovate here here and here we want to embrace Indies we want to do this stuff they executed Microsoft didn't and we are where we are today now that mistake unfortunately now it's been recovered but that mistake is a generation and that mistake is 30 million units so we're talking I mean I don't know I I'm speculating what the Xbox One install base is, I think it's you know 20-25 million what whatever not enough I don't know",
            "start": 3405.48
        },
        {
            "text": "that mistake is 30 million units so we're talking I mean I don't know I I'm speculating what the Xbox One install base is I think it's you know 20-25 million what whatever not enough I don't know but it's not it's never going to catch up right so but I will again I will end the story on a positive note which is with Phil Spencer, he's back right because that guy is a gamer, he understands games, he's brought back a lot of the guys that were responsible for the 360, a lot of people still around you know, and Albert Penello, a lot of these great guys, and they are I mean look at look what happened when he took over, I mean he's like okay back compat okay refocus on live okay back to the backwards compatibility was such a coup man I still I still camp I I just was like they hug I still think that was the biggest moment at E3 that year we I remember talking about it there or whatever the specific thing of like you guys are actually sacrificing uh",
            "start": 3448.56
        },
        {
            "text": "I just was like, \"They hug.\" I still think that was the biggest moment at E3 that year. We I remember talking about it there or whatever. The specific thing of like you guys are actually sacrificing collection dollars and third-party dollars and collections and all these kinds of things to just do something very consumer-friendly that your opponent is just not going to do because of their investment in GaaS. So, like it's like it was a very strategic I think it was way more strategic than people gave it credit for where like it wasn't only good for Xbox consumers; it's something Sony literally will not do because of the $400 million they spent to make sure that they don't have to do it you know because they want you to buy the game again um yeah with GaaS and with PlayStation Now or whatever. The one question I want to ask you, I know this topic is running long but I don't care because it's fascinating. We were talking about unforced errors and pushing the ball too far. I'm curious as an",
            "start": 3489.44
        },
        {
            "text": "The one question I want to ask you, I know this topic is running long but I don't care because it's fascinating. We were talking about unforced errors and pushing the ball too far. I'm curious as an industry expert and a veteran of this industry, what do you make of not the modular consoles, because they're not here yet, we might get those in the future, but the iterative consoles that we're now going to get, and Scorpio, which I still don't really fully believe is not the next console completely, but uh, the Scorpio and the Pro. What do you what do you make of that? Because I feel like this is with Pro specifically, I feel like this is, I don't know who's asking for this console, Scorpio. I feel like Xbox saying like we lost and we actually need to reboot as quickly as possible. So what do you what do you make of all that? Yeah, I mean in general, I mean uh, I I would say a couple things. I would say first off um it is truly about enabling gameplay experience that could not otherwise exist I",
            "start": 3522.8
        },
        {
            "text": "what do you make of all that yeah I mean in general I mean uh I I would say a couple things I would say first off um it is truly about enabling gameplay experience that could not otherwise exist I completely agree with your comment again I'm a fan I listen to your your your show I know your guys' perspective on this I wholeheartedly agree with what you've been shouting from the mountain tops ever since the PlayStation conference that it is about it is not about Graphics processing power if you want to do that go be a PC Master race guy like great that's awesome but it is about enabling experience that we cannot otherwise have where I get excited is uh VR where I get excited is uh the Crackdown demo where they were like check out this Cloud processing power and you could never do this if you didn't have this Cloud processing power now we we haven't seen that game come out yet but I mean the promise of that is interesting to me right people using the tech in a different way to make the",
            "start": 3554.12
        },
        {
            "text": "didn't have this cloud processing power now we we haven't seen that game come out yet but I mean the promise of that is interesting to me right people using the tech in a different way to make the game better yes exactly people using the tech in a different way to make the game better is where I feel like it's at the this whole iterative console thing I think the way it's being uh presented uh to the to the gamer is confusing I think it's it's amazing to me like we're 30 years in in this business you think there's just kind of a book on like how to market things then we see Wii U and the naming mistake we see the PlayStation Pro we see we continue to see us make the same mistakes over and over and over again the benefits of console gaming again for me maybe I'm old school write me off I don't know but I grew up in the NES SNES days you know cartridge gaming Game Boy stick it in turn it on play that's awesome right now it's like okay I do this thing I turn it on I boot the thing I",
            "start": 3599.92
        },
        {
            "text": "I don't know, but I grew up in the NES SNES days, you know, cartridge gaming Game Boy. Stick it in, turn it on, play - that's awesome, right? Now it's like, okay, I do this thing, I turn it on, I boot the thing, I stick it in; it's a 50-gig install, I got to patch it, there's a firmware update, and I got three. I go to the store, and there's eight consoles - I know which one to buy. It's confusing. I don't understand why we don't just simplify and get it to the user experience it needs to be more about simplicity and customer experience. I'm a huge fan of Apple because I think they do a great job of this in a couple things, couple ways right? First, vertical integration of hardware, software, and services - right, it all comes from the same place; it all works together, that's a key principle. Second, principle is curation, which again we can get into more yeah, we're starting to, we're getting close to the next topic but but the but the third is simplicity, and you you go to Apple's website there.",
            "start": 3639.24
        },
        {
            "text": "The Epic History of Xbox Live Arcade - Kinda Funny Gamescast Ep. 90 (Pt. 3)\n\nprinciple is curation which again we can get into more yeah we're starting to we're getting close to the next topic but but the but the third is Simplicity and you you go to Apple's website there are eight or no more than eight products that they're ever selling at one point in time it's not about and they they're a whole they're you know one of the world's most successful and biggest sort of you know technology companies yet they've they're the masters of Simplicity explaining complex concepts to people in very simple terms and so I think the console industry still has a ways to go to learn from companies like Apple in terms of how you message and communicate to the user from a marketing standpoint from a product standpoint again it comes back to the experience for me and it's not about Graphics processing power I think what I think what's going on right now is confusing I love the concept of Scorpio but Scorpio feels to me like and I don't know because I don't know what it is yet",
            "start": 3686.24
        },
        {
            "text": "processing power I think what I think what's going on right now is confusing I love the concept of Scorpio but Scorpio feels to me like and I don't know because I don't know what it is yet but based on the promises and based on the E3 reveal and flops yeah and based on my based on my faith in Phil Spencer and team it's if it truly is six Teraflops and it is high quality VR Oculus style or Vive style plus VR out of the box without a side car and 12 cables and all this **** you have to deal with right now it's a mess like if it truly is that next Leap Forward then I'm in I'm all in but it can't be about 4K HDR thing about some TV I'm not going to buy for four years and some Nuance little thing that it doesn't the blacks are blacker there isn't yeah and and and what's that going to do I mean that's that's great but what is that going to do and and and there's like five people people that have that TV that can even show that so I don't I love I mean I saw actually for of Horizon Zero Dawn playing on the",
            "start": 3726.56
        },
        {
            "text": "that's great but what is that going to do and and there's like five people who have that TV that can even show that so I don't I love I mean I saw actually for of Horizon playing on the PC with HDR on it - It's amazing native 4K It's **amazing** but it's not it's not this Leap Forward right we all grew up in the in the eras where the earlier Generations were like wow PlayStation one to PlayStation two wow PlayStation two to PlayStation three in the HD era wow huge Leaps and Bounds right this is like Masahiro Sakurai's hierarchy we we got through all the days of like fundamental food and shelter and you know sticks and caves and now we're in these levels of the upper levels of the pyramid where we're talking about refinement it's less about Graphics Fidelity now it's about capabilities and immersiveness and experiences that you can't have elsewhere and so that's my answer to your question it's really about the experience that we can provide and until it is don't come out with another console",
            "start": 3771.36
        },
        {
            "text": "and experiences that you can't have elsewhere, and so that's my answer to your question. It's really about the experience that we can provide. And until it is, don't come out with another console because my consoles are awesome right now. I'm completely good with this. And the one part I love is back compat - not just back compat on Xbox One, but the idea of back compat meaning my library comes with me. Uh, XBLA obviously is a creative XBLA. I love the fact that every week I go in, I'm in the preview program and more and more max bla games are lit up on that right side that I can download. I have I you know obviously I work there, I have 150 XBLA games right, and just a couple at a time they're lined up. I didn't lose Joust, I didn't lose Robotron, I didn't lose Castle Crashers - they're there. Yeah, so I love this concept of being able to carry my collection with me over the years and having it cloud-based, so I don't have to worry about my local storage or do I have a 2 TB or a five GB 500",
            "start": 3813.28
        },
        {
            "text": "so I love this concept of being able to carry my collection with me over the years and having it cloud-based so I don't have to worry about my local storage or do I have a 2 TB or a five GB, 500 gigabyte or whatever like I recently made the leap to 2 terabytes on um actually on both both my consoles because 500 gig was too small like I wasn't buying games digitally because I don't want like I I play a bunch of games at one time and like eight retail games and I was now uninstalling things I was still playing because of my file size to get 2 terabytes I'm not doing that anymore so I have enough where I can load up everything and still have some casual stuff and some digital stuff and still have some room to spare so I'm now getting past that point but irrespective of that not everyone has the privilege of being able to buy a two terabyte hard drive like I do so having that cloud-based experience that transcends generations is super important and I'd love to see Sony do it I'm not I'm",
            "start": 3859.96
        },
        {
            "text": "the privilege of being able to buy a two terabyte hard drive, like I do, so having that cloud-based experience that transcends generations is super important and I'd love to see Sony do it. I'm not super into streaming; I've heard streaming tech pitches for 15 years, I've yet to see a successful implementation of it, um PlayStation Now included. Like, I just, I'm not a big fan of that. I'm a big believer in ownership of games - like I'm not a renter, I'm an owner. So I like having game collections, but digital is a great substitute for that - like give me the games, just make it cloud-licensed, right? Absolutely, so love it.",
            "start": 3904.72
        }
    ]
}