{
    "id": 2139,
    "video_id": "cOF4M-BipnM",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Could Final Fantasy XV Actually Be Good?!?! - Kinda Funny Gamescast Ep. 91 (Pt. 4)",
    "description": "We discuss the positive Final Fantasy XV coverage.\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/gamescast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1477573201,
    "duration": 1273,
    "transcript_chunks": [
        {
            "text": "this episode of the Kinda Funny Gamescast is brought to you by VideoBlocks what is VideoBlocks Greg yeah what is video block let me tell you it's an affordable subscription based stock media site that gives you unlimited access to premium stock footage what does that mean to us we used a whole bunch of this B-Roll at Kinda Funny Live, Kinda Funny Live one and two I did not use this no I super cool super awesome I'm a huge fan of all this stuff I've been a video editor almost my entire life been a big fan of it stock footage makes it super easy this stuff royalty free once you get it you can use it anything you want what's super cool is it's subscription based so when you get a subscription you can download as much as you want nice so that's super cool here's a monkey he's dancing around having a good time who doesn't want to put that in there there's audio stuff there's uh like after effects graphic stuff and then there's all the stock footage too so there's a whole bunch of",
            "start": 0.08
        },
        {
            "text": "having a good time who doesn't want to put that in there there's audio stuff there's uh like after effects graphic stuff and then there's all the stock footage too so there's a whole bunch of the you got pong pong right there we're blocking the guy get out of here with your pong you make a video Christmas C with this you'll blow your mom's face off oh my God Videoblocks is offering our fans a year subscription for only $99 that's a $50 discount off the usual price tag for our listeners only that's less than $10 a month get yours today at videoblocks.com gamescast that's videoblocks.com games cast not gamc they can't read it when you do it like that move your chair and your mic too the mic's in the way what's VC oh video blog video blogs video BLS video I'm sorry this topic as always brought to you by you you can go to kindafunny.com gamescast topic leave a topic for us to discuss on a future show just like my boy Jaron did Jaron speaking of your soul speaking of Square Enix here too",
            "start": 40.92
        },
        {
            "text": "brought to you by you can go to kinda.com/gamescast topic leave a topic for us to discuss on a future show just like my boy Jaron did. Speaking of your soul, speaking of Square Enix here too. How do you feel about all the positive Final Fantasy XV previews of the first 15 hours? Could it actually not suck? I never thought it was gonna suck so I mean that's one thing and I've said it before and I said it again I said this will be nothing less than good I've said that a million times right to my credit I never said it was going to be bad I just said it's not going to reach the expectations of a 10-year development cycle right and I feel like I was happy to see that I read a few of them I've been seeing a lot of the feedback people have been tweeting to me and I've just been kind of reading the websites and seeing that and I'm happy I don't want any game to be bad so I hope Final Fantasy XV is awesome I don't believe it like in terms of like in terms of like",
            "start": 102.24
        },
        {
            "text": "been kind of curious reading the websites and seeing that and I'm happy I don't want any game to be bad so I hope Final Fantasy XV is awesome I don't believe it like in terms of like in terms of like it being this amazing game but if it's good that's great I'm excited to play it I think we're going to get copies of it sooner rather than later and I and I I'm pleased to see it I'm not surprised I never said the game was going to be bad I am very surprised and I am very excited about all this there's been a whole bunch of previews out there's a really long one on IGN there's a super long one on Polygon Parish wrote one too Jeremy Parish is the one where I'm like alright IGN okay cool polygon great but Jeremy Parish he seems like a Colin type guy to me where it's like us gamers he's going to be yeah extra hard on on this because of the development cycle and because it's not the Final Fantasy that he knows and all this stuff but he seemed to be super into it and 15 hours is a is a large",
            "start": 148.92
        },
        {
            "text": "be yeah extra hard on this because of the development cycle and because it's not the Final Fantasy he knows and all this stuff but he seemed to be super into it and 15 hours is a large chunk of time to get a really good idea and like I love that it seems like everybody is super up on the battle system and that the combat uh it starts out awkward and you don't really like it which is an experience I had in the demos that have come out um but then as it goes on it gets deeper and it feels good and it feels like you're learning it as it goes and um I recently watched all the Final Fantasy XV anime and stuff so I'm already super invested in the story and I'm totally sold on that I mean I've been sold on this game for a long time but to hear that people like it is like oh man it just feels like a weight's been lifted like and we'll see how far this goes and like there is the thing of it's a preview cycle and it's very rare that games preview poorly you know especially on",
            "start": 191.52
        },
        {
            "text": "just feels like a weight's been lifted, like, and we'll see how far this goes, and like there is the thing of it's a preview cycle and it's very rare that games preview poorly, you know, especially on these, especially games like this, like. But I mean, this isn't a preview of you played 15 20 minutes of it for a let's play, you played 15 hours of yeah, but so I'm a little trepidacious just because like I know how this goes when it comes to to websites and stuff and I feel like it's you want to lean positive on on something like this uh. But for these guys to be saying this it means a lot to me and that was the thing I took away from the Polygon one of, like it starts like We've joked about how many reviews are going to start that way of like I was in just entering college when this happened and da D like the chips are stacked against this game and for him to come out play it and be like not only did I like it I was he's like I really like the story, I really like Noctis's story, I was",
            "start": 233.0
        },
        {
            "text": "and da D like the chips are stacked against this game and for him to come out play it and be like not only did I like it I was he's like I really like the story I really like Noctis's story I was like oh that's interesting because that's what's been interesting to me and the fact that you can see the Western RPG influence and all these different things I'm like okay you're because again that's the whole thing I've been as an outsider looking in as a non-Final Fantasy fan when he's never cared about the the franchise looking in I've always thought it's cool what you're talking about sounds cool but I'm worried about it getting in and it just being another really really nerdy RPG kind of thing and so like looking from the outside reading this I'm I'm still looking forward to playing it uh some of the the key things that I took away from a couple of these different articles I don't remember which is from which but uh it says that the game starts off with a sentence that just says this game",
            "start": 272.44
        },
        {
            "text": "of the key things that I took away from a couple of these different articles I don't remember which is from which but uh it says that the game starts off with a sentence that just says this game is for Final Fantasy fans and first timers alike I'm like awesome cool like I think that it's good that they're addressing that I think that it that's really kind of saying in a big way like yo we understand things haven't been great you know and I think that they're really trying to start something different and other thing that's really important is I think that the all three articles that I read are talking about how it feels like a good Western RPG and a good JRPG together and that's awesome because it's it there is the worries for people I calling that it's going to be not Japanese enough in terms of gameplay um I don't think there's any worry about it not being Japanese enough in terms of quite Japanese whatever but it's also like reading I I didn't want to watch too much because",
            "start": 303.48
        },
        {
            "text": "in terms of gameplay um I don't think there's any worry about it not being Japanese enough in terms of quite Japanese whatever but it's also like reading I I didn't want to watch too much because like we we got offered to play this 15 hour uh version of it and I was like I don't want to do that like that's way too much time for me to put into this game to potentially have to do it again yeah um but I I really like that the it seems like the the characters U especially again after watching the Final Fantasy XV anime and like being sold on this stuffy uh it seems like it's very light-hearted and like these are just Bros hanging out and is relationships between all of them and uh and they make jokes about the clothes that they're wearing it's like one of them keeps complaining about how hot it is and he's like dude you're wearing a leather jacket in the desert like I like that there's that type of kind of tongue and cheek but it's not so much a parody of itself it's more just like the characters are real",
            "start": 347.44
        },
        {
            "text": "dude you're wearing a leather jacket in the desert like i like that there's that type of kind of tongue and cheek but it's not so much a parody of itself it's more just like the characters are real and they talk to each other like we make fun of Kevin sleeping and stuff like it just I am so so jazzed about this and it's close it's getting so close so i mean this is shocking to me like the fact that all these sites are being so positive about I'm just like oh my God yes your dreams my could the NX be coming could the NX be good who knows this is so exciting anyway that's what I think Jorg Mihalyi destroy galaxy do you guys think that releasing only two weeks before Horizon Zero Dawn will hurt Persona 5 sales no no yeah i mean they're they're different audiences in the same audience at the same time if you're a hardcore enough gamer where you are looking forward to Persona 5 you're probably still looking forward to Horizon Zero Dawn and I would say if you're not to put any",
            "start": 388.76
        },
        {
            "text": "at the same time if you're a hardcore enough gamer where you are looking forward to Persona 5 you're probably still looking forward to Horizon Zero Dawn and I would say if you're not to put any one down but if you're top level mainstream gamer just own a PlayStation 4 for whatever and you're oh the Killzone guys are putting out Horizon which in Horizon's a new IP is going to be up hard to sell it to new people but if you heard about this open world RPG Western kind of thing I don't think Persona is necessarily for you yeah exactly time wise it's going to be tough trying to balance those as a guy who wants to both real bad trying to run through one or worry about the other and not or put one off till you're done because you I don't want to be playing two giant RPGs M um and speaking to Persona  Jerry says what do you think about Persona 5 not using the generic voice actors I feel like that question's a little you know loaded there I don't think that I I'm assuming he's",
            "start": 434.08
        },
        {
            "text": "to Persona Jerry says what do you think about Persona 5 not using the generic voice actors I feel like that question's a little you know loaded there I don't think that I I'm assuming he's referring to the Nolan Norths and Troy Bakers oh I didn't understand the question okay yeah I mean I just based on a couple other people responding to that that's what got got got you gotta I wouldn't call them generic voice actor Matt Mercer who's like the DM for Critical Role who has a huge following no he and who does a million video games not to leave that out too he's not a generic voice actor uh but even even uh speaking of them like if they were in this game I mean like yes when you get trained you get so familiar with them you start to be able to to differentiate like oh this character is this person you watching trailers is the game of Nolan or Troy you everybody yeah yeah uh but it's it's uh I I think that it's exciting that the Final Fantasy XV cast and the Persona 5 cast are not",
            "start": 470.84
        },
        {
            "text": "this person you're watching trailers is the game of Nolan or Troy you everybody yeah yeah uh but it's it's uh I I think that it's exciting that the Final Fantasy XV cast and the Persona 5 cast are not those guys but I think that it's a cool thing to be able to cycle we're going to get a whole new group of people and then you know have them distribute amongst all the games it's a lot of games and it is that thing where like I I I'm not familiar enough with the new these the new cast yet other than Matt but the one of the female voice actors got tweeted at and they included me saying you should get this girl on the show she's super cool and you went and look she has credits it's not like these people are just like duds they've just walked in like I've never voice act before they they've been voice acting they haven't been on yeah the Uncharted or you know Call of Duty stage level yet Trevor Stark says in honor of the Disney proposal video what are the best Disney games I mean DuckTales",
            "start": 517.48
        },
        {
            "text": "Voice acting, they haven't been on yeah the Uncharted or you know Call of Duty stage level yet Trevor Stark says in honor of the Disney proposal video what are the best Disney games? I mean DuckTales, yeah DuckTales. All the old Platformers, I mean Mickey's Haunted Mansion or whatever the hell it was, The Magical Castle, magical castle, yeah there was there is all those. The Genesis and Super Nintendo games, Aladdin and Lion King and all those. And I love them, yeah. But being completely honest, they they don't feel great to play like even the magical uh castle and all that stuff. Like it's there's something about them a little too floaty. I love the look, I love the music, I love everything about it. It's Disney so obviously I'm super into it. But like something about them it's like I feel like we remember those games more fondly than they actually are. I don't I didn't like them back then I don't like them now. The only reason I remember that Mickey game is because I got it for Christmas and I was like",
            "start": 555.84
        },
        {
            "text": "Remember those games more fondly than they actually are. I don't, I didn't like them back then; I don't like them now. The only reason I remember that Epic Mickey game is because I got it for Christmas and I was like, \"All right, thanks.\" And put it in. I was like bitter playing it because, like, I don't, I don't like Mickey. Don't you know me? My Mom and Dad, where's my Jurassic Park 2? We did that Aladdin let's play a year ago, and it was just so... it was broken feeling, you know? But I remember loving it when I was younger; sure, cuz you're a dumb little kid now. Speaking of just being a dumb little kid who grew up into a dumb man baby, maybe did did you get Epic Mickey going? Did you get was that something you liked so? Epic Mickey was one of those big disappointments for me where uh I remember when it was first announced this Mickey game the um the Game Informer cover and like all we got was an image and a name Epic Mickey which was the code name at the time um they stuck with it and then just...",
            "start": 599.6
        },
        {
            "text": "this Epic Mickey game the um the Game Informer cover and like all we got was an image and a name Epic Mickey which was the code name at the time um they stuck with it and then just an image of Mickey with a paintbrush and the castle and looked all dark for what you consider for a Disney game and the idea that it's about the lost and forgotten things from Disney's history and like the world you live in is Disneyland with a bunch of broken down rides and all this stuff and I'm like are you kidding me this sounds like the most Tim Gettys game of all time and it's super super cool and then the more you started hearing about there was music that dropped from it I'm like well this is great it was like remixes of the Fantasia paint thing where you mess around with a sorcerer and all that stuff I there's so much there like Disney's just has such a legacy and there's so much story characters and all this stuff and when you take um something like Disneyland which is kind of a",
            "start": 642.08
        },
        {
            "text": "that **** I there's so much there like Disney's just has such a legacy and there's so much story characters and all this stuff and when you take um something like Disneyland which is kind of an anthology of all the different things together already but you add that like the darkness factor of what are the forgotten things and and all this stuff it was so cool but then the game just kind of wasn't that great like it was such a six out of 10 but like it needed to be at least a seven out of 10 for me to be like **** yeah like I would have taken it you know I would have been like you know what great good enough but it it wasn't good enough um and then there was the hope that the the sequel would fix that and it didn't it didn't at all but uh that game I wish broke your heart I it did it did I remember being at E3 and it was first time I played it it was my first E3 that was when I knew Alfredo had you while you cried there's problems here surprise you didn't say Kingdom Hearts",
            "start": 683.52
        },
        {
            "text": "it did I remember being at E3 and it was first time I played it it was my first E3 that was when I knew Alfredo held you while you cried there's problems here surpris you didn't say Kingdom Hearts well Kingdom Hearts is the easy answer Kingdom Hearts obviously specifically one and two love them and those are such a weird thing when you think back to it Disney and Final Fantasy mixing together and I feel like as it went on it's it's just gotten more Disney and the Final Fantasy has kind of left it um in terms of characters at least like they're kind of just scattered around but in one and two they were really uh prevalent but trying to think out is there anything else cuz yeah I mean DuckTales was amazing yeah I was going to say there was there's a few good NES games from that from Disney or Disney licenses Disney to make them Capcom made most of the games um yeah I mean that's basically it by the time the I mean there was a **** ton of Disney games on PS1 and stuff but by that time",
            "start": 728.36
        },
        {
            "text": "or Disney licenses Disney to make them Capcom made most of the games um yeah I mean that's basically it by the time the I mean there was a **** ton of Disney games on PS1 and stuff but by that time I was just like I don't care Al a lot of those games are available as PS1 Classics mhm like Hercules yeah yeah yeah yeah Toy Story on the Super Nintendo I really enjoyed uh was it Mulan game I don't know I'm just don't there was Mo on game I'd be shocked if there wasn't that would have been great why not I like Mo on good movie so dope uh Lil Uzi Vert says how much do you guys want uh Kingdoms of Amalur Reckoning remaster I'd love that be **** amazing God can you I couldn't imagine there's no reason to do that if they're not gonna continue with the series you know so that would be great but that's that's just not going to happen What a Sad Sad state of affairs with 38 Studios Trey 3 Trey says why has Nintendo violated Paper Mario by removing the great RPG mechanics have you played Color Splash",
            "start": 766.72
        },
        {
            "text": "That's that's just not going to happen. What a sad state of affairs with 38 Studios, Trey (3) says. Why has Nintendo violated Paper Mario by removing the great RPG mechanics? Have you played Color Splash at all? No, so I I played it for a couple hours and it's cool. I like it. I feel like it's a kind of return to form for what modern Paper Mario is, which is a bit more action-oriented. It started with uh Super Paper Mario on the Wii. Great, yeah I love that one. Um but it's not Thousand-Year Door; it's not the original Paper Mario and N64; and it's not Super Mario RPG; uh or even the Mario & Luigi games on the GBA. And it's like somewhere along the line they combined them and then just kind of split off of the RPG stuff, like we got Sticker Star and that kind of sucked um on 3DS. And then the Paper Mario one I didn't play but it doesn't seem too favorable in people's opinions uh I like Color Splash though; I think it was cool; it really weirded it back to the like super quirky Paper Mario.",
            "start": 812.12
        },
        {
            "text": "gam one I didn't play but it doesn't seem too favorable in people's opinions uh I like Color Splash though I think it was cool it really weird it got back to the like super quirky um Paper Mario stuff where it's like there's all the special moves like a plunger and **** I'm like it's Nintendo being weird and I think that when Nintendo is weird in its kind of more B and C tier stuff like there's a lot of fun to be hadh so it's cool uh so I wouldn't say that they're what's the word he used violating Paper Mario um as much as that's just what Paper Mario is now like will there be a Mario RPG at some point where like the battle system actually matters I don't know I think that somewhere along the the line there they were like not enough people care about this um which sucks but there also there was a ton of those games though like between all the Mario and Luigi games on the GBA and DS and Super Mario RPG do you like Super Mario RPG yeah it's okay I mean what what super the original",
            "start": 859.6
        },
        {
            "text": "There was a ton of those games, though. Like between all the Mario and Luigi games on the GBA and DS and Super Mario RPG. Do you like Super Mario RPG? Yeah, it's okay. I mean what, what about the original Super Mario RPG on SNES was so weird because of who made it, and like that was I remember that was the most revolutionary thing about that game more than even the game itself, which people really love and I respect. I haven't played in many years, um but I always thought it was weird like Square Enix making a Mario game. I I remember I was like that's I don't understand that, um and it was it came out on a console that had a lot of great role-playing games so like when I think about the great role-playing games on Super Nintendo, that game never comes to mind to be honest, uh but the move away from RPG elements happens. I mean Mass Effect did the same thing and I think that that was really disappointing even though I think the Mass Effect games get better, I think the mechanically",
            "start": 903.04
        },
        {
            "text": "move away from RPG elements happens I mean Mass Effect did the same thing and I think that that was really disappointing even though I think the Mass Effect games get better I think the mechanically and in terms of like backend like systems Mass effects has only gotten worse um in that regard so it's sad to see that happened to franchises you like where the hallmark of the franchise to you is something that's important that's not important obviously to other players yeah so hopefully Andromeda gets back to that Austin Tex Perez says what are the coolest developer names mine are Undead Labs and the fun pimps Undead Labs is good Naughty Dog naughty Dogs good baller um I was thinking about what what was the one I was bringing up recently they made that um oh Hairbrain Schemes I love that name uh they made uh they showed us a game at at E3 oh it was like a what the **** was it called I don't remember anymore it was like the it was a downloadable game where you third person shoot like",
            "start": 939.12
        },
        {
            "text": "uh they made uh they showed us a game at at E3 oh it was like a what the **** was it called I don't remember anymore it was like the it was a downloadable game where you third person shoot like slashing things um God I love that I remember me like oh we hair from Hairbrained Schemes like that's a great great name of a studio I like uh Jaffe Bartlett Jones Detective Agency that's funny and goofy yeah for the longest time when he did that I thought that's what his game was I thought that was the name of the game and it was like oh no that's the studio oh that's weird but awesome that's that's a cool business card to hand definitely I've always been a fan of Neversoft I just thought it was cool and like the little the logo and the eyeball it was kind of experience with that sure of course of course yeah there's a I mean there's a bunch man yeah um Jason Jason AKA Rejuvenation says while playing BioShock collection and some have said this doesn't make sense but I've been playing BioShock",
            "start": 979.36
        },
        {
            "text": "\"Course, yeah, there's a I mean there's a bunch man, yeah, um Jason, Jason AKA Rejuvenation says while playing BioShock Collection and some have said this doesn't make sense but I've been playing BioShock Collection and some have said the same thing about Return to Arkham. My friend noticed how the new graphics and lighting takes away from the intended tone. Will this change how Rems are made, and if they need to stop doing this? I understand what he means; it's a weird sentence structure. He was saying that people are saying the same thing about both collections. I haven't played AR or Arkham, I have, I've only played Arkham Asylum. I haven't noticed it being brighter and not as grim and dark as Arkham Asylum was before reading his review; their whole thing was just like it - the brightness kind of reveals the flaws of um the game being developed on a last-gen system. Well, sure, it's an old game, yeah, yeah, but like when it's being brighter though, because it shows the graphics.\"",
            "start": 1019.52
        },
        {
            "text": "like really reveals the flaws of um the game being developed on a last gen system well sure it's an old game yeah yeah but like when it it being brighter though um because it when you see the graphs comparison it's significantly brighter it takes away not only from the tone of the game but it also like reveals the the flatness of the flowers and oh interesting okay yeah with with Bioshock I mean I know that game pretty intimately and I haven't I I mean I got about halfway through it before I had to abandon my run I'd like to get back to it to to play other things but um that said I always jack up the brightness on every game I play so so games are are I hate when it's like you know Max this out so you can just barely see the logo I'm like no I'm going to see the whole logo that's how I'm going to play the game that is such a callid thing to do because I'm just like I cuz I don't like playing like I don't except for in like certain games like horror or whatever like where you want",
            "start": 1060.72
        },
        {
            "text": "I'm going to play the game that is such a Caldwell thing to do because I'm just like I cuz I don't like playing like I don't except for in like certain games like horror or whatever like where you want Darkness or you want like like I'm like I don't find it fun to not be able to see what the **** going on so like so what I'm saying is that Bioshock probably always looked like that to me and it's so that's just what I know Bioshock to be I just like games to be a little bit more brighter and vibrant even if they're meant to be like these dark dire things like this isn't I don't find it exciting even even in Dead Space or a game I like where I'm like I can't see what the **** I'm going I'm like how is that fun you know like I just like I don't I don't care if the ambient light doesn't make sense I need to see the whole logo yeah that's fascinating about Batman cuz I didn't I haven't read any of the reviews I've just played Arkham Asylum and yeah I mean it looks like what I remember it",
            "start": 1102.2
        },
        {
            "text": "Sense I need to see the whole logo, yeah, that's fascinating about Batman because I didn't - I haven't read any of the reviews. I've just played Arkham Asylum, and yeah, I mean it looks like what I remember it to look like, which is what I expect out of a remaster if that makes sense. And that's always the interesting thing when we talk about it: when you get when you're like, \"Man, this game doesn't look great,\" and then you go, \"Look at The Legend of Zelda: Ocarina of Time,\" and then you look at the original Ocarina of Time - like, whoa, what I mean? So like, it's very fascinating. I don't know. Yeah, final question Colin: this is from James Saul, he says, \"Will Colin give Skyrim another go, and don't let him use 'it's not working on PS3' as an excuse with a little winky face.\" No, I'm not going to give it another go; the uh, the PS3 thing - I mean that's that's old news now, but that was what five years ago. Um, but there's just no time. I got I got I gotta pick and choose. Skyrim is not a game I mean I I think",
            "start": 1136.48
        },
        {
            "text": "the uh the PS3 thing I mean that's that's that's old news now but that was what five years ago um but there's just no time I got I got I gotta pick and choose Skyrim is not a game I mean I I think Skyrim I played Skyrim for 20 hours or so I mean when it came out I didn't it wasn't like just a jump you know jump in and jump out I intended I'm playing it further there was other things I think Arkham City came out that's that winter and and some other **** right around it it was 2011 right so it's a pretty busy time I think resistance three yeah resistance three was out so if I'm remembering the the timing right it could be the year after that anyway um it's just one it's a commitment and I don't have time like I have this whole slew of games VR has totally um I now have this triple assault going on right actually like a quadruple assault because civ6 comes out soon which I'm going to **** lose my my life to for a little while obviously um and uh VR has whole catalog of games I",
            "start": 1173.0
        },
        {
            "text": "going on right actually like a quadruple assault because Civilization 6 comes out soon which I'm going to lose my life to for a little while obviously um and uh VR has whole catalog of games I haven't I haven't even played Eve: Valkyrie yet in a while that was the game that sold me on VR and I don't even have time to play it uh and there's all these other VR games I want to try out PS4 has its own games with Battlefield coming out Etc and so on Last Guardian obviously comes out later and then Vita still has these games I want to play too so like I'm not just gonna like throw Skyrim arbitrarily onto this list I did it with Bioshock because I love Bioshock and even then it just became untenable you know so um I was reflecting to Greg recently that I'm sad that I'm not beating more games because I have I feel so under the gun to get from game to game that I'm not sitting there and enjoying these experiences so that the it would be the antithesis of what I want to do to throw Skyrim",
            "start": 1217.28
        },
        {
            "text": "because I have, I feel so under the gun to get from game to game that I'm not sitting there and enjoying these experiences so that the it would be the antithesis of what I want to do to throw Skyrim on the list especially because I don't even want to play Skyrim but I'm happy that people want to play it it's coming out in a couple weeks mhm ladies and gentlemen thank you very much for watching until next week I love you",
            "start": 1253.16
        }
    ]
}