{
    "id": 2124,
    "video_id": "HONQAWV5nxQ",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Nintendo Switch Reveal - Kinda Funny Reacts",
    "description": "THE \"NX\" IS FINALLY HERE! X gave it to us!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1476987497,
    "duration": 1623,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to a Kinda Funny Reactions for the Nintendo Switch X is giving it to you I'm one of your hosts Greg Miller alongside Colin Moriarty and Tim Gettys yes now Tim you said from the get-go you're going to be the NX's biggest Fanboy oh I know I am I don't know if you've checked the internet everyone is a Switch Fanboy this morning good good for them okay I'm **** I don't give a sh I'm not one of these like bandwagon **** that hates on that **** let's do it let's support this **** everybody come on let's **** do this switch I'll give it to you dumb name doesn't matter doesn't **** matter it's not the Wii there's we out of this **** there's no families I'm not seeing any families in this trailer it's all M Millennials who want to go to oh yeah really hot people I love hot people Greg I don't give a **** about families this is",
            "start": 0.12
        },
        {
            "text": "there's no families I'm not seeing any families in this trailer it's all Millennials who want to go to oh yeah really hot people I love hot people Greg I don't give a **** about families this is awesome this trailer is exactly what I needed to see now is all the bad news going to come crashing down are we going to hear about the battery are we're going to hear about how the online ecosystem sucks we're going to hear about how we're going to have to buy Super Mario 3 again sure we are but today today we have this and I'm very very happy about it does that look like a toy does that look like a toy well I mean the controllers yeah the The Joy-Con controllers do look like a toy but I don't but I don't I don't take issue with that the form pack like well the form factor is a little small but yeah the uh so I think it's great uh I I saw the uh the trailer today and and I was actually really impressed with it it's exactly what I envisioned you know we talk about something like like what",
            "start": 38.64
        },
        {
            "text": "yeah the uh so I think it's great uh I I saw the uh the trailer today and and I was actually really impressed with it it's exactly what I envisioned you know we talk about something like like what it was going to be removable controller attachable controllers all this um I think that I think the marketing was very smart uh the commercial is very smart for it I agree with you uh I think that that the bad news is going to be how powerful not powerful it is and it's probably not going to be very powerful which is might hinder third party support in the future and might hinder the the scope of games you're seeing for instance it was really cool to see Skyrim on there Skyrim came out five years ago so it doesn't look fantastic no right so so at first I was like is that Infinity Blade then I realized perspective da da da but yeah um but you know obviously Zelda looks fantastic we played The Legend of Zelda on Wii U all this I do take issue with the name I think the name is stupid um and uh obviously it wasn't",
            "start": 77.0
        },
        {
            "text": "\"Perspective, but yeah, um, but you know obviously Zelda looks fantastic. We played Z on Wii U all this I do take issue with the name. I think the name is stupid. Um, and uh, obviously it wasn't going to be called NX. Obviously that was its codename or Revolution. It wasn't clearly going to be called that. I am upset it's it's like come on guys after all this yeah it's a it's a little strange like and people are like well you know some people are like they love the name. I respect that, and some people are like it's better than Wii U and I'm like you could have called it the 'artist choke' and it would have been better than the Wii U in terms of naming so like so it's just you can't compare it like everyone's like it's better than the Wii name. I'm like no, it's not. The Wii was a great name for a system when it really came down to it cuz it made sense and it was something you typed into Google and it was unique. The Wii was type switch into Google have someone tweeted at me\"",
            "start": 116.44
        },
        {
            "text": "a great name for a system when it really came down to it cuz it made sense and it was something you typed into Google and it was unique the Wii U was type switch into Google have someone tweeted at me today who knows where you're going to come up here's my question for everybody before we jump off on naming thing right when was the last console that was named that didn't sound weird at first blush Xbox Scorpio PlayStation 4 yeah well that doesn't count but I remember not liking Vita and then V just is a terrible name to one horrible name but they all just become nomenclature me not to mention that this one Switch is I mean what they're doing here is smart the commercial shows that when you're talking to a mom it's easy to be like oh because it switches between TV and portable okay it's a DS and a Nintendo I get that yeah and you know it's it's a switch from the Wii U and all that **** for all the **** whatever it doesn't matter like you're right you could have called it anything",
            "start": 145.08
        },
        {
            "text": "Nintendo Switch Reveal - Kinda Funny Reacts\nDS and a Nintendo I get that yeah and you know it's it's a switch from the Wii U and all that **** for all the **** whatever it doesn't matter like you're right you could have called it anything like but I really believe that it's like I think that this is a enough away from what they have that I'm like all right cool good it could have been worse but then yeah I mean I think that that's the only negative thing that I really see is is just the name specifically because yeah it's a it's a move away from Wii U which was a confusing name I think doubl down confusing because of the tablet which seem like it connected to the Wii and all that kind of stuff but names do matter I do think that the name of the vita name did in some way not in a major way but in some way heard it and uh so I think a name is important I think a GameCube was a really powerful name Nintendo 64 powerful name um you know in Japan famicom or Super Nintendo these are good names for consoles and so um and I do",
            "start": 183.48
        },
        {
            "text": "I think a name is important. I think a GameCube was a really powerful name. Nintendo 64, a powerful name. Um, you know, in Japan, Famicom or Super Nintendo - these are good names for consoles. And um, and I do again think that the Wii was weird a name, but then the Wii became nomenclature became just part of our vocabulary. Switch, um, just struck me as weird. That's really the only negative thing I saw in this entire uh out of this entire thing. I'm I'm a little concerned about the Joy-Con controllers, yeah well just in the sense that it just seems like there's a lot of things that you can lose and I'm interested to see like like or break like what if one side so like there's all these kinds of things you have to worry about but we've never had to worry about that before because there's never been something like this. So I'm sure that there are going to be clever solutions to all these different problems. Um, I think it like I really think it's a cool a cool thing and I think a nice synthesis of what",
            "start": 219.84
        },
        {
            "text": "like this so I'm sure that there are going to be clever solutions to all these different problems um I think it like I really think it's a cool a cool thing and I think a nice synthesis of what Nintendo does well and um it's doubling down on this more mobile market or this more which I don't know is if it's a great idea this doesn't seem to me this doesn't scream to me to be something that's going to be a massive seller like Wii or anything like that but it's certainly going to do better than Wii U and and that's probably all that they can they can ask for so we'll do better than 3DS probably not it'll probably be more expensive than 3DS less accessible than 3DS um doesn't seem like they're even going after the 3DS Market based on the marketing so um I think they are with all the Mario Kart playing in the there's no I mean but but 35-year-old people are not the people that are buying 3DS's in in droves it's 10 year olds that are buying 3DS's so it's it's or their parents 3s well no I",
            "start": 257.6
        },
        {
            "text": "playing in the there's no I mean but but 35-year-old people are not the people that are buying 3DS's in in droves it's 10 year olds that are buying 3DS's so it's it's or their parents 3s well no I mean everyone had a DS and everyone had you know there were you know other you know even a PSP or something like that 3DS's sales are not up up you know in that stratosphere yet um so I just think that like based on the marketing it just seems like they're going after someone else and it seems like they're going after the multi-pillar approach again like they tried to do with GameCube and GBA and DS so this is another return to what we're talking about though of like this is talking to us this is talking to the 30s somethings who are into video games this is like try you know not the speech it's not the presentation but it's similar to PlayStation's approach right of hey here we are here's this thing we learn from our mistakes it's about games it's about games you'd want to play there is no",
            "start": 294.2
        },
        {
            "text": "not the presentation but it's similar to PlayStation's approach right off hey here we are here's this thing we learn from our mistakes it's about games it's about games you'd want to play there is no touch there's no one touching anything here there's no one wagging oh I know but I'm saying in the marketing we're giving you no touching no waggling it's just straight up real games you'd want to play with your friends Switch the controllers do whatever that cool rooftop party Switch Yeah Yeah I can't like the guy who like took it like oh my dog needs to go out to the park he's playing in direct sunlight I'm like okay let's see how this one's going to hold whatever you need to you need to do something trust me I've tried to play the Wii U trailer that was very similar to this in terms of like there's a poppy song playing there's a bunch of cuts of people smiling playing games and **** and it's like that was it's such a far cry from what we're seeing here",
            "start": 330.64
        },
        {
            "text": "trailer that was very similar to this in terms of like there's a poppy song playing there's a bunch of cuts of people smiling playing games and **** and it's like that was it's such a far cry and a lot of the features we saw on that didn't end up actually making it even to the console like they're doing we golf thing where you put the um the I don't think that ever actually happened and like there's a lot of things like that so this we'll see what goes on but my big takeaway from that is all a lot of the stuff that did make it through I didn't care about I never used so that doesn't matter the guys playing with the joy con controller on the side we're never going to do that so it like when we fly and we play Mario Kart we're bring in our Nintendo Switch Pro Controller that's fine that's a normal I want to know if they let me use my no I know but I'm I think it's funny that they call it out my big question one I mean there's a million big questions battery I want to know price but I",
            "start": 364.08
        },
        {
            "text": "a normal I want to know if they let me use my no I know but I'm I think it's funny that they call it out my big question one I mean there's a million big questions battery I want to know price but I want to know did the old controllers work will my old Pro Controller sync with it you'd imagine knowing Nintendo they would you think cuz like the Wii U you know from Wii to Wii U worked and I know that still got Wii in it or whatever but I would think my old Pro Controller would work with this one I don't know I mean I almost in a way hope not just to get away from the the Wii Moote and Wii stuff like that I know that sucks cuz we have so much of that **** but I feel like the those things kind of suck what I do want is USB on the on the device port it doesn't need to be on the actual device it's on the port uh maybe it's in well maybe on one of these next ones C if you see when you get to hold on I want to call it the right thing here when you get to the Nintendo Switch dock",
            "start": 400.96
        },
        {
            "text": "device it's on the port uh maybe it's in well maybe on one of these next ones C if you see when you get to hold on I want to call it the right thing here when you get to the Nintendo Switch doc if you can pause it I do believe I saw uh ports on that device cuz uh for the Smash Bros cuz that's really what's exciting to me so now that we have this there's a lot we can go off when it comes to the rumors that we've seen over the last year um yeah right AR wouldn't those be those look like USB to me kind of look like HDMI do they look like you have two HDMI outs and in well one in and one out why would that make sense yeah would I don't know it could be you'd assume it has USB right but we've heard about ports or enhanced ports of Smash Bros, Splatoon, and Mario Kart 8 just to start and in this trailer you see two of those so you see Splatoon and you see Mario Kart 8 but both of those have features that aren't in the current versions of the game looks better it has different um hairstyles",
            "start": 437.08
        },
        {
            "text": "you see two of those so you see Splatoon and you see Mario Kart 8 but both of those have features that aren't in the current versions of the game looks better it has different um hairstyles and stuff like that and Mario Kart 8 has King Boo who was not in in that game and has dual items so you can switch between the items kind of like Mario Kart Double Dash exactly exactly so I'm like I like that we're going to be getting these games it's going to give the Wii U amazing Wii U games another life that they totally need people didn't get to play yeah and um enhancing them is really exciting especially when it comes to things like Smash Bros cuz great we're going to get more Smash Bros the Smash Bros that's awesome but hopefully more characters hopefully more things going on Ice Climbers Ice Climbers you know the 3DS couldn't do it yeah 3DS couldn't do much it's your time switch your perspective yeah so I agree with Greg in the sense that I feel like that the the question is",
            "start": 483.52
        },
        {
            "text": "you know the 3DS couldn't do it yeah 3DS couldn't do much it's your time switch your perspective yeah so I agree with Greg in the sense that I feel like that the the question there's major questions they have to answer and they're gonna have to answer them somewhat soon and I'm sure that the investor meeting is going to be interesting because um you know I want to know how powerful it is now that the like I you could tell me the statistics and that's not going to be meaningful to someone like me that does understand stuff I just need to know where it sits on the on the paradigm uh like we knew that Wii U for instance was not as powerful as PS3 and Xbox 360 right but it was more powerful than the Wii and so we can kind of put it on that timeline my suspicion is that it's a similar thing where it's clearly not as powerful as PS4 Xbox One it can't be or that thing would cost way more money than it's probably going to cost but I'm sure it is more powerful than the PS3 and the Xbox 360 and so it",
            "start": 522.56
        },
        {
            "text": "clearly not as powerful as PS4, Xbox One; it can't be or that thing would cost way more money than it's probably going to cost, but I'm sure it is more powerful than the PlayStation 3 and the Xbox 360, and so it sits somewhere in that space. Um, my prediction is it's probably going to be $300, and uh, I think that's a totally affordable and reasonable price, and I'm all about it; like I, I, I want it. And even if you know we didn't even touch on the fact that that new Mario game is being shown off for the first time, which looks cool. Uh, good timing; let's talk about the Mario game for a second. So there's a lot to be seen here; essentially, we've got two separate gameplay clips of it, and it's not enough to really make too many conclusions, but there's the question of is it more Galaxy-like, is it more 3D World-like, or is it more Mario 64-like? Getting hints at Mario 64 more than anything, the camera kind of feels like 3D World or 3D Land, but since it's behind him and since it's such an",
            "start": 559.16
        },
        {
            "text": "is it more 3D World like or is it more Mario 64 like getting hints to Mario 64 more than anything the camera kind of feels like 3D World or 3D Land but since it's behind him and since it's such an open vast space I think that the second uh thing that we're getting might be like a hub world and the key things are they specifically show him doing a long jump and a triple jump which is like Mario 64, Mario Sunshine type deals we're going on here which is very exciting to me because we haven't seen that for so long and like that is like specifically talking to the Neo crowd that is specifically talking to the people like shut up it is what you want deal with it and I think that a lot of this trailer does that there's also a heart in the background of the um the Mario footage which is like the so there's a health system so it's not like 3D World where you're big and small and uh it's the two-hit system it looks like we're going to have another life thing so is this Mario 128",
            "start": 594.8
        },
        {
            "text": "is like, so there's a health system, so it's not like Super Mario 3D World where you're big and small, and uh, it's the two-hit system. It looks like we're going to have another life thing, so is this Mario 128 finally? I **** hope so. Yeah, I think I mean I think it'll be a launch game, and I I I I suspect that um well I mean I mean I have a lot I mean I was just thinking about on the way here even in my Uber like they kept the secret pretty well, like it's it's pretty it's pretty impressive from a just from an industry kind of perspective, like the name didn't leak, the console didn't leak, like the the idea about it leaked and there were some schematics and trademarks and all this kind of stuff, but really like I when I was watching the commercial it really reminded me that obviously they're going to do a big production for their marketing they're going to get a lot of people involved, but it's I always find it so interesting with the hundreds of people that probably were involved in this um outside",
            "start": 636.56
        },
        {
            "text": "a big production for their marketing they're going to get a lot of people involved but it's I always find it so interesting with the hundreds of people that probably were involved in this um outside of Nintendo they're a production company they hired all these people no one said anything um and you know not not that I'm sure the n would encourage them to say anything uh so I really like that it's nice to have a genuine surprise um so really when I look at the positives and negatives the pros and cons the only negatives I really see right now and I'm sure there going to be others as you said is the name and uh that's and just because I think names do matter like you can't people are saying like well the name doesn't matter the name I'm like you can't have it both ways the Wii U name certainly destroyed that console so or helped destroy it I mean other things help destroy it as well and so you have to be careful about that but maybe it doesn't matter I actually everyone's like why would",
            "start": 676.68
        },
        {
            "text": "destroyed that console so or helped destroy it I mean other things help destroy it as well and so you have to be careful about that but maybe it doesn't matter I actually everyone's like why would you name that I'm like I would have just named it the Nintendo personally but like like and gone back to you know and have a real name for it like uh uh an NES style thing but get people back in a using your name and that very bold and like you know like when your parents just be like are you playing nint my my parents still say that **** you know like playing the Nintendo and like to like bring that ubiquity back to that name I think would have been really cool um it was the same reason why we wanted the P like the Xbox and the PlayStation to just be called those things and those are good names everyone's like well you know is Xbox and Playstation good name I'm like yeah those are great **** names actually you know so so you know that's my only and like the pros and cons list the only",
            "start": 710.52
        },
        {
            "text": "everyone's like well you know is Xbox and PlayStation good names I'm like yeah those are great console names actually you know so so you know that's my only and like the pros and cons list the only negative and I see a lot of things to really be excited about I'm excited to pre-order it I'm excited to have it first day one and when I'm talking to your point with the online Network and all that stuff I I really think that this is going to be a virtual console machine for me almost primarily because they have a big list of of people that are supporting them both Publishers and developers but they had a similar thing for Wii U and other things too and it UL doesn't see that goes the big thing is I lost over before is Bethesda running Skyrim on this which was which is a a super kind of interesting thing um and shows you the direction I think that Nintendo wants third party support I mean this you see it it's like we got NBA 2K17 playing we got Skyrim and then we got the the Mario the Zelda Mario",
            "start": 743.6
        },
        {
            "text": "\"um and shows you the direction I think that Nintendo wants third party support, I mean this you see it, it's like we got NBA 2K17 playing, we got Skyrim, and then we got The Mario, The Zelda, Mario Kart, Splatoon - it's just like this shows off a lot of launch titles. It's my thing about Mario is I don't know, it looks a little rough right now to be ready for March, but I don't know. Real quick, I mean, to run through some of the call outs on their list here: Activision, Atlus, Bethesda, Capcom, EA, Square Enix, Take 2, Telltale, Ubisoft, Warner Bros., FromSoftware. Yeah, well, yeah, sorry, there's a million on there, level five too, but like the thing about the ones I'm calling out are the ones that this is and I granted I'm an optimist like you Tim, this looks amazing, I can't wait to... the first thing as soon as this was done I went to Amazon to see if I could pre-order it came up with an RF Switch for the N64. The thing about it though is this is the first time I've been telling a\"",
            "start": 777.28
        },
        {
            "text": "I the first thing as soon as this was done I went to Amazon to see if I could pre-order it came up with an RF Switch for the N64 um the thing about it though is this is the first time I was telling a friend this is the first time I think in a decade where I've entertained entertained the idea of playing a multiplatform game not on PlayStation cuz if like right right now Batman: Arkham Asylum I'm playing right and I'm getting of playing in 6 hours or whatever this would be **awesome** to have it and be ready to go I'm going to play Dragon Quest cuz I love Dragon Quest and that game is great but to have all my real progress carry back and forth it's like you know I'm never going to like trophies still are awesome and I love them or whatever but it's not like I'm getting anything out of that so got the Switch system on this and and that's that's the thing that I'm I'm super interested in other than some of the like I see names on here that Greg didn't highlight that I think are like even more",
            "start": 818.96
        },
        {
            "text": "so got TR system on this and and that's that's the thing that I'm I'm super interested in other than some of the like I see names on here that Greg didn't highlight that I think are like even more interesting like um you have like uh level five on here for instance which isn't a huge surprise like is it going to be something like uh you would expect or is it going to be something like a Nintendo console or a big game or Tales game or not a Tales game um something like White Knight Chronicles or something that's G to be proprietary maybe the Nintendo consoles like I get I get excited about some of the names that I didn't expect uh Spike Chunsoft dang RPA studio uh like uh you know even THQ Nordic is on here what are they going to bring over Darksiders or something new like they promised a lot of new games so when I see a lot of the things on here like yeah of course Square is coming over Capcom obviously um Activision Atlas but you know Atlas is",
            "start": 855.28
        },
        {
            "text": "new games so when I see a lot of the things on here like yeah of course Square Enix is going to be here it's awesome that Bethesda is coming over Capcom obviously um Activision Atlas but you know Atlas is already supporting Nintendo heavily um but when I see some of these other smaller names n for instance that have slowly moved away from PlayStation and started to democratize their games a little bit um with you know uh PC especially I get excited about a lot of that as well so I if you can get Persona 5 some definitive edition whatever on the NX and have it with you all the time you **** kidding me I mean that's the thing is like Colin you we always talk about and especially with the whole uh Xbox One S and the PlayStation 4 Pro conversations we've had for so long you talk about how it's like the power doesn't matter and all this stuff and I think that this is is finally getting to a point where it's like obviously this is not PS4 Xbox One level stuff and I I don't think we're going to",
            "start": 889.84
        },
        {
            "text": "the power doesn't matter and all this stuff and I think that this is is finally getting to a point where it's like obviously this is not PS4 Xbox One level stuff and I I don't think we're going to necessarily be getting um all of the multiplatform games I say optimism yeah yeah no no for sure but I I do think that like seeing something like Skyrim like you would assume this is Skyrim HD which is I mean it's a last gen game but it's for next-gen consoles now right yeah NBA 2K17 you imagine that it's the the current version it's like yeah those are smaller games in terms of they're not like pushing the limits and I think that's what we're going to be getting and games look better than the Wii U versions of the games we're getting and Wii U the games themselves the look of the Wii U games was never their issue like in terms of first party you know like the Mario 3D World and all those things like they are just they're beautiful games so to have them with a little bit more power and stuff",
            "start": 925.72
        },
        {
            "text": "their issue like in terms of first party you know like the Mario 3D World and all those things like they are just they're beautiful games so to have them with a little bit more power and stuff like I feel like that's really all that it needs like Zelda looks fantastic I mean that's the big thing I was like yeah Zelda will be the game I play but then like Skyrim right Skyrim doesn't move the needle of excitement for me at all on PlayStation 4 Xbox one cuz I played it on PS3 whatever I don't I'm not going to come home and sit down and play Skyrim again but to have Skyrim on a portable on a plane to be able to sit there and yeah sure because when I beat Zelda and I'm done enough in their open world whatever it's going to be I'd love to jump back in have a character that I just **** around with mhm I I mean for me the thing that is most exciting besides the new Mario game is that Joy-Con controller no I mean honestly it's that is not that it's the fact that yeah that exists and yeah",
            "start": 965.28
        },
        {
            "text": "with mhm I I mean for me the thing that is most exciting besides the new Mario game is that Joy-Con controller no I mean honestly it's that is not that it's the fact that yeah that exists and yeah that's fine that's an option but I'm never going to play with the weird ass Game Boy Advance SP like um put the joycon things together I think here's my my concern with it is is this is that I think you're going to get better battery life if you use it like this like like a Wii U gamepad cuz in my head what I want to do obviously is always have it with me and then always have the Pro controller with me but tethering them I have to imagine unless there is a USB out or whatever that I'm connecting to that way but even then it's going to drain so much power yeah we'll figure out the battery stuff later but when you look at it as a tablet like it looks like the right version of the Wii U gamepad oh yeah the one that like an adult version not the Fisher Price one this is not Fisher-Price this does look like",
            "start": 997.48
        },
        {
            "text": "you look at it as a tablet, like it looks like the right version of the Wii U gamepad, oh yeah, the one that's like an adult version, not the Fisher Price one, this is not Fisher-Price, this does look like a real device. The um, like when you have them all flimsy, that's pretty bad, but when you put them together it looks like it's going to be really solid, like I wish that the screen kind of took up a bit more of the thing itself, but it's like I think that that was a design choice to make sure that the controllers didn't feel like plastic, they felt like it connects and uh Colin, like the big issue you were worried about was the offset analog sticks, and like they nailed it, I'm a little concerned about the d-pad not being there, there's no traditional d-pad, which some people are going to be a little baby one up there, yeah, but that it's it's not it's not even on the right side, right, like that, that's that's the thing I'm like can you I doubt that's a real thing, yeah, like that button this little tiny dude, yeah I",
            "start": 1032.68
        },
        {
            "text": "yeah but that it's it's not it's not even on the right side right like that that's that's the thing I'm like can you I doubt that's a real thing yeah like that button this little tiny dude yeah I thought maybe it was just something like plus and minus yeah it's plus and minus yeah yeah so oh okay well I just thought those were starting select buttons or something what's interesting is like so yeah there's I mean the Wii U gamepad has the the plus and minus button so it's like there could be those but there's also four more buttons on the the thing so it's like I I don't know there's a million starts in select I mean there's only so much real estate for them to work with the the yeah I I always thought on Wii like the fact that the on Wii U the analog or the analog stick was above the buttons was was weird like it was like I I anyone who defended that I was like what are you talking about that's not the way we play games I remember as I said before playing Mass Effect 3 on it for",
            "start": 1072.16
        },
        {
            "text": "buttons was was weird like it was like I I anyone who defended that I was like what are you talking about that's not the way we play games I remember as I said before playing Mass Effect 3 on it for review at IGN and being like this sucks like why like why can't I you like who does that and they they clearly know that that sucks so like they won the day on that one because that's not how we play games we move up and that's huge the analog that's huge because this looks this looks great and this what's so awesome me about this is anytime we've talked about what do we want from the Vita 2 it's this for me every single thing I'm like I just want a big screen I want to be able to play it or to use a controller and play it thank you thank you for giving me that and you know what grownup buttons thank the Lord did you see the size of the buttons on the Pro Controller those are the biggest goddamn buttons I've ever seen I wish we had a picture of it they're amazing thank you yeah this",
            "start": 1108.44
        },
        {
            "text": "thank the **** Lord did you see the size of the buttons on the Pro Controller those are the biggest goddamn buttons I've ever seen I wish we had a picture of it they're amazing thank you yeah this will be marketing research this is actually really serendipitous for Sony in a way because the Vita is dead didn't work out for them and they're going to get some good market research first and spend a goddamn dime other than I'm I'm sure they're doing their own stuff right now but about does this matter is this going to work like they're going to have a litness test from the guys who really defined uh handheld gaming since 1989 uh putting out something that's a hybrid um that I think is going to be most appealing as a handheld I think that's obvious and uh they'll be able to watch and see and be like if this does well then we actually can move forward with whatever plans we have uh to make something that's more you know more equivalent with what you know PS4",
            "start": 1145.88
        },
        {
            "text": "be able to watch and see and be like, \"if this does well, then we actually can move forward with whatever plans we have to make something that's more equivalent to what you know as a PS4 in a handheld form.\" And if it fails, and they get the ****, we have to worry about that anymore. Like, we're not going to win. So, this is like creating a new, you know, hybrid market of like well, a little bit of mobile gaming, maybe skewing a little bit older, having a console-quality game on the go. It's a lot of different ideas. This is a really last-ditch effort for Nintendo, I think, obviously. Um, to make their hardware work again. If it doesn't work, that's the end of Nintendo Hardware, I think everyone knows that. But I do feel like this is going to work in some sort of way, unless the news that comes out about everything else which they're hiding right now, which is smart, um, is just disastrous. If the battery life is like 2 hours or if like...",
            "start": 1184.68
        },
        {
            "text": "of way unless the news that comes out about everything else which they're hiding right now which is smart um is just disastrous if the battery life is literally 2 hours or if like the which is awful if the you know the controllers are flimsy or things break or I'm really interested to see all of that as well but I think it seems like they have the catalog of publishers and developers lined up the device looks great the price is probably going to be right Nintendo's not stupid they usually nail that stuff pretty well and it does move away from the toys for children thing with the marketing um because Nintendo fans have aged up and grown up I mean I I I really I don't have kids I don't know but I have nephews and I have six nephews and nieces none of them give a flying **** about Nintendo you know you know but they all play games or you know like like uh they'll play Minecraft they're in Minecraft they're in the PlayStation they're in older games like my you know my brother's kids are",
            "start": 1220.56
        },
        {
            "text": "you know you know but they all play games or you know like like uh they'll play mine craft they're in Minecraft they're in the PlayStation they're in older games like my you know my brother's kids are really like playing retro games and stuff like that so I feel like it's a different environment I feel like the Nintendo fan is older the Nintendo fan the new Nintendo fan is the child of the Nintendo fan you know and so everyone has to scale up together and I think that this device might do that and that's what the thing shows right it's what we talk about is that we we our lives are so busy we move around so much that you don't have time to sit down all the time and play a game in front of a TV and that's what they're going going for I think that in a year the name I think is going to prove to be actually good I think right now it's just a shock after being ready for NX I think Switch is going to be good in the end will like that and I think it's going to be a really big success the",
            "start": 1256.96
        },
        {
            "text": "to be actually good I think right now it's just a shock after being ready for NX I think Switch is going to be good in the end will like that and I think it's going to be a really big success the console in general yeah for me like all Hyperbole and excitement aside because obviously I'm extremely excited about this I I just I'm shocked that Nintendo did this right like cuz even this part I was convinced they were going to **** up right you know I was convinced we're going to see this and I was going to be like ah almost but I'm not I'm like this is it like this trailer it is that PlayStation 4 message that we got years ago and I'm like holy **** I didn't know Nintendo had it in them because you combine this trailer with this device with this list of Publishers seeing Skyrim there which all right it's a 5-year-old game whatever it's a step in the right direction and it being a console experience on the go but not the consoles that you're the modern consoles the Wii U console like",
            "start": 1291.08
        },
        {
            "text": "All right, it's a 5-year-old game, whatever. It's a step in the right direction, and it being a console experience on the go but not the consoles you're used to - the modern consoles, like the Wii U console. Let's be realistic about this; that's all amazing. But when you add that with the idea that the Wii U and the 3DS are no more, and every first-party and second-party Nintendo game is going to be for one device... Yes! That could mean we get actual games like those things added together, and I'm just like, \"Thank you, yes, please!\" And I think it's going to be a fun place to get in as I said before. You know, because Greg and Tim and trophies obviously, and we like those kinds of things. Is I hope they have some sort of system like that, and we can all start at the same time again - uh, which we haven't really had since 2005 and 2008 respectively, when achievements and trophies started. It would be fun to get into that environment too and start doing that maybe for older games and",
            "start": 1326.64
        },
        {
            "text": "we haven't really had you know 2005 and 2008 respectively when achievements and trophies started it would be fun to get into that environment too and start doing that maybe for older games and retro games give you a reason to kind of stick around when game releases slowed down which they will traditionally for Nintendo consoles so um there's a lot to for them to nail that I think will be important for the longevity of the console but I think that um or the handheld whatever you want to call it but I think that it's it's certainly very appealing and I and and it wets my appetite for uh what's to come I mean a Mario a 3D Mario game like that on the go sounds really great I I I'm with I don't give a **** about Skyrim but like playing a Metroid game or a n or a Metroid Prime game or a um 3D Mario game or whatever on the go sounds fantastic and I and I still get way more excited about the older games that you can just bring around with you that you don't have to have a",
            "start": 1368.6
        },
        {
            "text": "game or a um 3D Mario game or whatever on the go sounds fantastic and I and I still get way more excited about the older games that you can just bring around with you that you don't have to have a modded PSP or any of those kinds of games I'm happy to buy those games again if I have to um as long as now I have an account system and stuff like that I'm sure all this information is going to come out we're really only five months away um so I think the timing is great so exciting when do you think the next dump the information we get a direct in December maybe so I'm not clear when the investor meeting is I think that it's early I think it's next Tuesday which is why like they had to get this out um which I think is obviously a very smart call so I imagine at the investor meeting usually there's not too much information from those but there's sometimes like one big thing um like I think they announced the 2DS and an investor meeting one time so big whatever but mean it's going to be",
            "start": 1403.48
        },
        {
            "text": "there's not too much information from those but there's sometimes like one big thing um like i think they announced the 2ds and an investor meeting one time so big whatever but mean it's going to be tidbits it's going to be little dollops of information as we go right Pac-Man was announced for Smash Bros at an investor meeting so like we do get game announcements I don't give a **** about the game announcements right now right like what i want to know is battery i want to know online i want to does it have onboard storage what how does it work with the internet it has we se 32 gab okay great somewhere it said that okay i don't remember where i saw 32 gab of storage is all it has that's what i saw but remember it's cartridge though yeah but what about downloadable games I don't know Battlefield one is twice that big they're not going the future Battlefield one isn't going to be on this I know but I'm saying well well first of all could be and second of all the the",
            "start": 1444.2
        },
        {
            "text": "know Battlefield 1 is twice that big they're not going the digital future Battlefield 1 isn't going to be on this I know but I'm saying well well first of all could be and second of all the the I'm just saying like a modern game I just deleted Doom off my PS4 yesterday that's all that's 60 gigabytes right like so that's awful if that's all they have for storage that might have been from a leak thing I saw I don't know that I didn't see I read this is the only official Nintendo word on top of this trailer and it doesn't mention that in there that would seem like a weird thing to TOS in they they have to have a lot of storage on this thing like that's that's it's it's super important you know like that's the way people play games now I understand they're going with the card proprietary or not proprietary maybe but a card system going back to kind of a cartridge style thing which is going to eliminate load times and all that kind of stuff and that's great I think that's smart I've",
            "start": 1484.52
        },
        {
            "text": "or not proprietary maybe but a card system going back to kind of a cartridge style thing which is going to eliminate load times and all that kind of stuff and that's great I think that's smart I've been reading a lot of things about how they wonder if a lot of future Tech is going to actually go revert back to that and get away from Optical Media or whatever but like um I don't I don't know enough about that to know if that's smart or not but 32 GB is not enough space well stick with me on this though what if it's not it's not a it's not built in it's just one of like CU, that was the thing with the 3DS having being able to pop in just an SD card that would be great I don't give a **** if it's 32 out out of the box but I get to put in whatever SD card I want on care yeah I mean that's that's totally different uh that's why we need to get a closer look at the cons the thing they could learn one thing from Vita though and and I hope and I hope they learn this as well is to get the bad",
            "start": 1518.44
        },
        {
            "text": "\"Totally different, uh, that's why we need to get a closer look at the cons. The thing they could learn one thing from Valtira though, and I hope and I hope they learn this as well is to get the bad news out now. You know, like don't wait until the month before to start dropping bombs really ruining people's excitement for the thing. I would I would do that as soon as possible if I were if I were them. I'd be like 'This is how powerful it is,' this is the battery life, this is the price, as soon as possible. Because then that gives everyone time to digest and marinate on it, and then and then the hype goes back up and everyone gets excited again. Regardless, because then they start seeing the games. If you do it the other way around, you're like 'Oh, how tantalizing Zelda is,' and all this, and by the way it's $400, and by the way there's no onboard storage of any consequence, and by the way the account system... I mean, Reggie, all we're saying is give him a break.\"",
            "start": 1549.52
        },
        {
            "text": "and by the way it's $400 and by the way there's no onboard storage of any consequence and by the way the account system I mean you got to do that first Reggie all we're saying is give him a **** sandwich you had a great thing here now you give us the bad news then you give us a whole bunch of games and we're all excited just get it out of the way just get out of the way then there are no excuses um so yeah pre-order as soon as po I'm going to pre-order as soon as as soon as humanly possible absolutely absolutely I'm back for now ladies and gentlemen what do you think good to have you call it on the Nintendo Switch let us know in the comments below share this video with your friends and until next time no it's been our pleasure to serve you X has given it to you",
            "start": 1585.72
        }
    ]
}