{
    "id": 1200,
    "video_id": "7xhlT7nlr3w",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Do Nintendo, Microsoft, And Sony Listen To Their Fans? - Kinda Funny Gamescast Ep. 36 (Pt. 3)",
    "description": "We question if The Big 3 actually do a good job of listening to their fans.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1442408401,
    "duration": 1469,
    "transcript_chunks": [
        {
            "text": "all right moving on that was a good discussion I like that this topic is brought to you by Patreon as always thank you to all of our Patreon users that are amazing thank you Kevin make sure that their names flow freely like the rivers remember when when Nicki asked you if you needed lower thirds and you're like no we have everything yeah this is probably one of them you needed right assume this was made but you know we'll have him make it later it'll be fine he's got nothing to do at home he's probably playing Metal Gear can you text him yeah hey Google cool um Nick Min Chung from Patreon says what are your thoughts on the big three's ability to listen to its customers we saw Sony listened to its customers during the PS4's launch by focusing on what Gamers wanted and asked for Flash Forward to now it seems like Sony's rarely listening to the feedback of its customers I.E UI updates friend notifications folders and let us change our damn name shui while Microsoft is doing",
            "start": 0.31
        },
        {
            "text": "Flash Forward to now it seems like Sony's rarely listening to the feedback of its customers, i.e., UI updates, friend notifications, folders, and let us change our damn name while Microsoft is doing everything he can do to win them back and Nintendo - oh Nintendo, why are you calling me Kevin? Get the **** out of this room. Doesn't really need to do anything right now since they're winning but Sony made one mistake with PS3. Do you think they'll make the same mistake again and can they afford to make that mistake again? And can they afford to make that mistake again in short, I know why these three companies operate the way they do at the moment, but I just want to hear you guys' thoughts on it, thank you men Chong. I think - and this isn't him; I've seen this on the internet before - I think the jump from PS3 to PS4 spoiled PlayStation fans a little bit. Sony is not ignoring you right now like we yeah Colin and I are always like or Colin mainly honestly let him let change let us change our names and",
            "start": 49.68
        },
        {
            "text": "PS3 to PS4 spoiled PlayStation fans a little bit Sony is not ignoring you right now like we yeah Colin and I are always like or Colin mainly honestly let him let change let us change our names and I I throw my support behind it right but like that's not them ignoring it we know they're trying to work it every time we talk to them they have some excuse of what's going on but Shuhei's been up front like we'd like to change it but it's complicated uh folders UI updates they just talked about 3.0 firmware you know Firmware War 3.0 that has a whole bunch of different updates and communities and all these different things people wanted out of it right so this and I know as the guy who blogs the Patreon comments I know this is a bit older I think PlayStation's still listening uh I argue to say they're the best at it right now in terms of responsiveness at least Shuhei is still out there on the front lines answering tweets sarcastically if need be or whatever but doing stuff Adam Boy being a face",
            "start": 88.88
        },
        {
            "text": "the best at it right now in terms of responsiveness at least Shuhei is still out there on the front lines answering tweets sarcastically if need be or whatever but doing stuff Adam Boy being a face and being able to answer stuff and being available for interviews and do these different things right I I do think you know I always go back to it that that February conference for the announcement and reveal of what PlayStation 4 was which we didn't know was going to be called PS4 at the time is still the most mind-blowing moment for me in my eight years of covering PlayStation and the fact of like I remember doing the interview with USA Today two days before and they were like what's going to happen I'm like well this is what I would do but they and I said but they never do what I would do and then they went out there and they did exactly what I would do hey everybody we're PlayStation we're listening sorry let's we're not going to be what we were at PS3 with the $599 US price kind of",
            "start": 126.48
        },
        {
            "text": "do and then they went out there and they did exactly what I would do hey everybody we're PlayStation we're listening sorry let's we're not going to be what we were at PS3 with the $599 user kind of thing you know what I mean like we're here we're apologetic we're on we're we're off the cell it's just a fancy computer here are all these Indies we're all about games and I see that strategy and that messaging still paying off to this day right like PlayStation 4 is still a runaway success it's still moved units and it's like we I was talking about moving without tons of exclusives nothing really this fall right with the exception of like Uncharted and The Last of Us blah blah blah but not like your AAA this is what you're buying us for kind of thing and I think that's the that's a virtue of speaking to the fans and still listening to the fans and doing that right like it's this weird thing of like you can't expect you know that big three to hear what you have to say and immediately respond",
            "start": 163.48
        },
        {
            "text": "to the fans and still listening to the fans and doing that right, like it's this weird thing of like you can't expect you know that big three to hear what you have to say and immediately respond turn on a dime right. And I mean, like I think it's interesting that there's this blue Vita what does that mean on this platform we all assumed was dead, you know what I mean or at least in its eight-year tail spin or whatever the hell is going to be the final story for Vita right? But they're still out there, they're still listening, they're still active, they still have the blog and they answer comments and you meet people there and they know what people want, they're trying to get it there but it's just not easy to turn that ship if that makes sense. Now the flip of that, of course, and I'll let Colin speak at some point in this conversation is the fact that Xbox has been also awesome at it you know what I mean, you want to talk about a 180 of like all right we said all the wrong things we're going to go",
            "start": 202.6
        },
        {
            "text": "at some point in this conversation is the fact that Xbox has been also awesome at it you know what I mean you want to talk about a 180 of like all right we said all the wrong things we're going to go back which was weird and we didn't like but then they go and they get Phil Spencer okay good that I said that I'm like that's not right sorry no they go and they get Phil in there and he comes out and we're about games and we're about Indies and you've seen their conferences get better and better with him at the helm and like here all these games here are all these things and then like we start talking about are they better at listening are they listening the same way this is one of those admitted things where I am a PlayStation guy so I'm dialed into that Community I know what's happening in that Community more I talk to those people more from the outside looking in at Xbox and maybe not even being outside we're doing so much",
            "start": 240.72
        },
        {
            "text": "so I'm dialed into that Community I know what's happening in that Community more I talk to those people more from the outside looking in at Xbox and maybe not even being outside we're doing so much more many more Xbox events I was just up there for the uh pre-pack showcase right and hanging out and talking to all those Indie devs they're there listening to they both these companies have smart people at the helm who are like we understand what we're doing now let's get out there let's do this Major Nelson's always been he was the you know very uh upfront I'm the face of this company before that was a thing before you talked about Community managers being front facing people and stuff and so the fact that he gets out there and does what he does and Jeff Rubenstein's over there now doing all that stuff too and then we have Nate you know out there helping make games and get games out there they are listening they are part of it both companies right now are extremely receptive to criticism",
            "start": 277.0
        },
        {
            "text": "that stuff too and then we have Nate, you know, out there helping make games and get games out there. They are listening; they are part of it. Both companies right now are extremely receptive to criticism, to praise, to this that and the other requests. But it's just not as easy as being like \"we want more friend slots.\" Like, all right, throw the switch. I think that's the biggest thing we talked about this before a couple weeks ago when we're talking about what features we want to see in the systems. It's not that easy and it's like all these things that seem simple, like \"oh why can't we just change their usernames.\" It's like that requires an entire infrastructure being changed and like being able to work with that in security flaws and all that stuff need to be figured out or else your **** gets hacked and then you get upset when PSN's down forever and all that stuff. But it's like, you know, every little thing there's a butterfly effect have to go back and like fix fix it from the the",
            "start": 312.96
        },
        {
            "text": "gets hacked and then you get upset when PSN's down forever and all that stuff but it's like you know every little thing there's a butterfly effect have to go back and like fix fix it from the the beginning so I do they're definitely listening and I also think that Nintendo gets way too much **** for like the way that you phrase this making it sound like they don't listen I think they totally do I think they're in a bad position right now they're trying to transfer over to the NX and stuff and like they did a lot of stuff but it's like seeing things like the Nintendo World Championships and seeing all of the stuff they're doing on YouTube like I was just showing Call to Day they're doing some new Nintendo YouTube series of M and Moto talking about Mario myths and it's just me and Moto like talk about Mario stuff and like a couple days ago there was another video of him like breaking down the first level in Mario and stuff and it's like that's what people want and it's like I like",
            "start": 346.6
        },
        {
            "text": "like talk about Mario stuff and like a couple days ago there was another video of him breaking down the first level in Mario and stuff and it's like that's what people want and it's like I like that Nintendo is and the directs like when they first came out everyone gave them so much **** as being the worst things ever then all of a sudden it was like the people that actually cared about the products the people that don't care about the products they're going to hate no matter what they're going to always yeah exactly but the the people that enjoy it that Smash Bros direct they did one of my favorite things to ever come from video games here's a game that I love and they're like here's a **** ton of stuff that's GNA excite you perfect yeah everyone else that didn't really care talking **** about it but it's like they don't matter and it's one of those things too of like especially with Nintendo Where and correct me if I'm wrong on this I don't want to get off uh screw this",
            "start": 384.88
        },
        {
            "text": "We question if The Big 3 actually do a good job of listening to their fans. It's like, about it, but it's like they don't matter, and it's one of those things too - especially with Nintendo. Where and correct me if I'm wrong on this; I don't want to get off uh screw this up because it's important when they talked about the new quote unquote Metroid game, the multiplayer one that isn't a real Metroid game. Didn't Reggie say \"we know this isn't the Metroid you want or expect\" or something like well later he said that in like interviews and stuff signifying again yeah this isn't the game I know I know what Metroid game you want; we hear you, it's just right now we're doing this but we hear you and we are listening. This is a thing, right? And I think that's the biggest thing - like we've talked about it before they're in that holding pattern where they're they're not doing that because they're working on the NX; the Wii U isn't the place and all this stuff and it's like that's an issue you know it's like they're obviously not listening but they're a corporation and like the same.",
            "start": 419.6
        },
        {
            "text": "They're working on the NX, the Wii U is not the place, and all this stuff, and it's like that's an issue you know, it's like they're obviously not listening but they're a corporation and like the same thing going to PlayStation with the names, imagine with Nintendo they released a system that just simply isn't working, that's not just oh we'll change some usernames, their whole system is the problem, yeah so it's like that's an even bigger all right guys we got to go behind the scenes we got to figure this out and then we're going to come out I'm hoping you know but you have to think that they're listening and this goes back to the other argument we talk about all the time of all the people and the government they're like talking crap about video games causing violence and all stuff when they die things are going to be over we look at all these things like the Teenage Mutant Ninja Turtles cartoon and Transformers cartoons and all this stuff where they're now being made by fans of The Originals so",
            "start": 455.92
        },
        {
            "text": "They die things are going to be over. We look at all these things like The Teenage Mutant Ninja Turtles cartoon and Transformers cartoons, and all this stuff where they're now being made by fans of the originals so they're better than the originals because like they are the people that are most passionate about these things happening. I feel like Nintendo you see that right now through their social media and their YouTube and all that. Their social media gets it, yeah. Where they're like these are fans of Nintendo, these are the people that... Audrey Drake you talk about bigger Nintendo it's like when you watch the directs they're made for the fans you know by fans doing all that stuff some of them aren't hits some conferences aren't hits for everybody that's just how it works. Like Nintendo's Direct wasn't good but that's also what they had to show they had The Metroid: Zero Mission direct, yeah it wasn't good but that's also what they had to show and that's the big thing when we talk about with companies you know I mean you talk",
            "start": 490.4
        },
        {
            "text": "yeah it wasn't good but that's also what they had to show they had the Metroid Prime blasting that's what they were doing and that's the big thing when we talk about with companies you know I mean you talk about especially like with stockholders and you know boards are right like you can't say everything you want to say there's a reason and like even with us like on a micro level obviously right not to compare us to any of these companies we're talking about we hear your criticisms of this show shows you want Da Da Da and there are wheels in motion and things are happening behind the scenes that we're just not ready to tell you about because we have a roll out plan you know what I mean it's not like it was where I think Sony at the launch of PlayStation 3 was so tone deaf in the way of like you'll get a second job this is going to be fine you want you need this system we don't need a functioning **** PlayStation store you know what I mean like all that dumb stuff where they learned a hard lesson",
            "start": 530.32
        },
        {
            "text": "get a second job, this is going to be fine, you want, you need this system, we don't need a functioning **** PlayStation store, you know what I mean, like all that dumb stuff where they learned a hard lesson, so the second part of the question is can people afford to ignore the fans again, hell no, you can't, I think this economy and like the way video games have shaken out THQ have shown that you need to be receptive to what people, and I don't think it's just video games, I think that just the the world that we live in now is so connected, and you have a complaint about an airline, guess what, yeah that airline's going to hear about it, and they if they don't respond, they look bad, yep, you know, and it's that with everything, you can tweet directly at people and say **** you, you shouldn't do that, but you can, so it's like if people aren't responding and people aren't like that's what news is these days is tweets, oh Nintendo replied about this, oh you know Xbox said that Sega said this",
            "start": 565.88
        },
        {
            "text": "that but you can so it's like if people aren't responding and people aren't like that's what news is these days is tweets oh Nintendo replied about this oh you know Xbox said that Sega said this 140 characters that are just people talking about on forums threads on threads on threads on threads of just you know 140 characters that somebody said and every single tweet is those companies listening so if you're not listening that's an issue yeah go for it Colin I don't know I mean I I agree with a lot of what you guys said I agree I disagree with something Greg said at the top which is that Sony's doing it better listening more than Microsoft I actually disagree I think Microsoft is clearly listening the most because they have to um the market wasn't was not responding to Xbox One well and they their entire plan with Xbox one even before it came out was changed based on feedback and I think they've been really exceptional about uh showing support for the Xbox one even though the",
            "start": 602.84
        },
        {
            "text": "They've been really exceptional about showing support for the Xbox one even though the Xbox One is languishing behind PS4, it's still selling very well in its own right, and also they update it every month. They think that their communication is really bad. I think Major Nelson blog, I think Xbox Wire, I think all these things are muddled and confusing and don't need to exist. I think they need to have like one place to go for the information. They're not regurgitating each other. The way they write about games is way too markety so I think that they have like a lot of problems on that front but where it really really matters because that's for people that really already exist and are established in the FR ecosystem, I think that they're front-facing stuff with Xbox One and turning it around and dropping the price and putting games in",
            "start": 647.28
        },
        {
            "text": "really already exist and are established in the FR in in the ecosystem I think that they're front-facing stuff with Xbox One and turning it around and dropping the price and putting games in and all this kind of stuff their first parties uh really powerful stuff I think PS4 I mean we're kind of used to it now I think Greg's right that uh we came to expect a lot of bad things from PlayStation and got used to it and I think PS4 has made a lot of people spoiled and I try to um keep that in mind when I get upset about the things that are going on with PS4 because I'm like this is just like let's not forget about what it was like during PS3 and um how much we struggle to get get anything on that system in terms of features and stuff like that so it's it's it's like night and day so like I'm my P I have I don't want to say infinite patience for Sony because I don't um my patience for the name changing thing for instance is long since past I don't believe for a second that's that problem",
            "start": 683.04
        },
        {
            "text": "my patience for Sony because I don't um my patience for the name changing thing for instance is long since past I don't believe for a second that's that problem can't be solved I think it's utter nonsense that they haven't solved it yet it's infuriating it's infuriating to a lot of people I think that they are being ignored by Sony on that front it is in every story on the PlayStation blog that talks about features it is all over the place there are forum posts with thousands of people posting on them that is the most upvoted thing on their own system about what people want they still haven't delivered it I think people have every right to be upset about that I don't care how hard it is to fix fix it you know I agree that needs to be fixed but they're responding to the common is what I'm saying right exactly it can't be the excuse that it's on every forum why can't have somebody in there every",
            "start": 725.2
        },
        {
            "text": "it you know I agree that needs be fixed but they're responding to the common is what I'm saying right exactly it can't be the excuse that it's on every Forum why can't have somebody in there every time on every post saying check this thing interview with whoever from whenever right exactly and also but also they they in like their reasons are don't even seem to be syncing up with each other just like just fix the **** problem you know like just fix it it's it's actually ridiculous now at this point so I understand why people are are you know upset with Sony about those kinds of things and I'm sure that there are technical ramifications about doing something like a name change but just figure it out you know and one of the things that one of the things that really I show showed me although I think part of it is marketing one of the things that really showed me that you can take a system and do things unexpected things with it is when is when Xbox One did backwards compatibility",
            "start": 757.8
        },
        {
            "text": "I think part of it is marketing one of the things that really showed me that you can take a system and do things unexpected things with it is when Xbox One did backwards compatibility it's like the Xbox one was not designed with that in mind and they did it and they did it on a software level you know like it wasn't a hardware fix they didn't release new Xbox Ones they figured it out mhm and it wasn't easy and it wasn't cheap and they did it and so like I'm that's that's the one thing I'm I'm I'm I'm getting pissed off about with Sony war is like just enough with the excuses these nice fixes with 3.0 are great but like this is not really what people are asking for so do people are people being heard and listened to yeah I think they are but are some things getting swept under the rug or like being like kind of shrugging and stuff like that it's like that's not good business either but I think there's a difference though specifically between the backward compatibility in this",
            "start": 793.72
        },
        {
            "text": "rug or like being like kind of shrugging and stuff like that it's like that's not good business either but I think there's a difference though specifically between the backward compatibility in this where the backers' compatibility that it's not something like that people were asking for that they wanted that you know and like I think before the Xbox one came out they would have asked for it but then once they said it's not happening it's not like people are like oh man please make things backwards compatible they're just like it's not going to happen so for them that's way more of like a that's a system seller thing that's a marketing pitch oh you can change your names on PSN that's not something that they're just going to you know devote time to because that's not you don't announce that at E3 and have people go crazy right I don't know about that at this point but that's the thing though is it's like the the hardcore would right the people that are already invested would and that's",
            "start": 832.44
        },
        {
            "text": "at E3 and have people go crazy right I don't know about that at this point but that's the thing though is it's like the the hardcore would right the people that are already invested would and that's important you should definitely cater to them but we wouldn't be talking about that on you know Gamescast in a couple months well we would but that's because but I mean this is I think it's the same thesis as your Nintendo argument that the directs are for the fans no and I'm totally with that but what what I'm saying is it's like we talk about this the Xbox thing it's like they you know they did it they did a huge thing we wouldn't be talking about the the name change being a huge thing at E3 you know Xbox I mean PlayStation wouldn't win E3 the same way we talked about Xbox winning E3 okay because yeah no I I don't disag I don't disagree with what you're saying there but I do think Sony is leaving millions of dollars on the table literally um by not allowing like people are",
            "start": 865.56
        },
        {
            "text": "E3 okay because yeah no I I don't disagree with what you're saying there but I do think Sony is leaving millions of dollars on the table literally um by not allowing like people are desperate you know what I mean and it's like one of those things where where like I don't even care like it's like whatever like my name is more Rigor that's fine but like people really like it's just every it's so funny like you're just tuned into the PlayStation audience it's just everywhere it's everywhere and it's like so I get why some people are like all right that's great but like there's like bigger system problems that we really like you to figure out at some point but I think I think a thing there though is you know the fact that it's not a one for one it's not like well why' you do this when you could have done that well I don't I don't agree with you at all on that front like I think that there are a finite amount of engineering resources and they devote them in ways that they feel",
            "start": 907.64
        },
        {
            "text": "when you could have done that well i don't i don't agree with you at all on that front like i think that there are a finite amount of engineering resources and they devote them in ways that they feel are most applicable so i don't agree with you there i do think that like do things do come out of the ether that affect things not coming out of the ether i think that that's obvious i mean that's that's business and and i and i i trust that this is just an example because it's an example where we all know for talking about for years i mean that's the thing we're talking about for years you should have seen like right before i left IGN when i wrote that like let us change our names thing that thing did like Juggernaut traffic like insane traffic got picked up all over the place uh you know spawn NeoGaf threads and all these kinds of things and it's like dude like but i agree with you like this isn't going to get new customers because new customers make their name",
            "start": 944.6
        },
        {
            "text": "uh you know Spawn Neo Gaff threads and all these kinds of things and it's like dude like but I agree with you like this isn't going to get new customers because new customers make their their name it's going to get it's going to make your your existing customer fan base happy and I think that is what Sony's good at doing actually is that Sony fans feel the love like they do feel the love they're not getting all of it but they but Sony but they get a lot yeah they do get a lot of love I think PlayStation blog uh specifically is a great example of how to talk to fans uh in Star contrast to the way Xbox talks to fans which is you know not nearly as good um in that respect and then we get to so I think Microsoft's really winning that race right now in terms of Optics in terms of listening because they have but they're doing a great job I think Microsoft's doing a slam up job right now of everything and they're going to have a great fall I think too um and then I think Sony's",
            "start": 978.6
        },
        {
            "text": "because they have but they're doing a great job I think Microsoft's doing a slam-up job right now of everything and they're going to have a great fall I think too um and then I think Sony's winning Without a Hitch which is which is interesting um Sony's like kind of doing with one arm behind their back their Studios not ready so it's it's really going to be extraordinary if Sony's PlayStation 4 is meteorically selling it's not even just selling well it's not even selling great it is it is out selling you know it is on pace with like PS2 I mean that's that's kind of an insane thing when you think about it right um and it's not going to end up where PS2 ended up because you have to remember PS2 of course was the DVD player PS2 was the first unit console unit that Sony made that really uh penetrated emerging markets in places like Brazil and it had a huge tale they were making them until like two years ago so it's like they were still selling so it's not going to get to",
            "start": 1018.04
        },
        {
            "text": "really uh penetrated emerging markets in places like Brazil and it had a huge tale they were making them until like two years ago so it's like they were still selling so it's not going to get to that point you still buy a new one on Amazon oh I'm sure you can it's crazy and So eventually the numbers are going to dip and but but PS4 is going to end up very respectively I will say about Nintendo that and this is something we brought up on Colin and Greg live just in a passing way but I think what Nintendo needs is New Blood and it seems like they might be getting it in in you know the way that they deal with social media and YouTube and all those kinds of things um I was I flo this idea and it's a crazy idea to Greg where I'm like is it time for Nintendo to say to me someone like Matsumoto like you can stay and we'll pay you but like you're not making games anymore like we need the new people we need to bring people now that played your games in to make these games you know what I mean",
            "start": 1054.32
        },
        {
            "text": "mamoto like you can stay and we'll pay you but like you're not making games anymore like we need the PE we need to bring in new people now that played your games in to make these games you know what I mean because like I was looking my example was I was looking at Star Fox which I think looks like it's like 15 years old and I'm like okay this is this is it like to me like like at some point I'm like okay this Visionary the greatest game designer ever Mamoto is a **** Legend a legend there will never be another like him that gave so much to the industry or whatever but I wonder if with the NX and all these kinds of things Nintendo should just be like we're we're bringing in a bunch of new people now and we're going to see what they can do because the Wii was a success with the with the mainstream but you know somewhat subpar attach rate and that that system died two years before it actually died because people just stop caring about then the Wii U obviously has not really been very",
            "start": 1088.64
        },
        {
            "text": "mainstream but you know somewhat subpar attach rate and that that system died two years before it actually died because people just stopped caring about then the Wii U obviously has not really been very successful um and 3DS is less successful than the DS Where I'm wondering I'm like should Nintendo just be open to more new ideas and and I'm excited to see that the Mario Kart Tour thing is just an example people would think that that's a religious but I it's just an example of saying like should Nintendo make a bold move and be like we're you know Moto you are welcome here forever but like we are going to start putting our resources into new teams and to new ideas and new new developers 20 and 30-y old 20 something and 30 something year old kids that grew up inspired by your games and now they can help save this you know this like what's happening here and I kind of see signs of that because I I do agree like the Nintendo Directs are a great example of um when I still think Nintendo",
            "start": 1132.36
        },
        {
            "text": "\"Help save this, you know, this like what we're talking about here and I kind of see signs of that because I agree like the Nintendo Directs are a great example of when I still think Nintendo Directs are a little weird, I think it's impersonal, I think that it's a cop-out in many ways. Uh, when you do things like that at E3, I like that it's their way to talk to people outside of the cycle where it's like we're doing a direct in February and it's about this, and I think that's great and I enjoy that they do that but when they do that stuff at E3, I'm like that's a cop-out, you know. So I think there's it's like it's like six of one half doesn't the other where I'm like you should be at the show this year, they'll be there, yeah, oh, I they'll there's no doubt that they'll probably put the NX out uh or reveal it for the first time in E3, you have to assume so like I think it's a mixed bag but I see a Nintendo that's trending back in the right direction.\"",
            "start": 1171.52
        },
        {
            "text": "No doubt that they'll probably put the NX out uh or reveal it for the first time in E3. You have to assume so, like I think it's a mixed bag but I see a Nintendo that's trending back in the right direction not necessarily in a direction that was going to make me a fan of theirs again because the mobile initiative with DeNA and all those kinds of things. But they're becoming a company that's becoming smarter. You can tell that Aonuma before he passed away unfortunately was starting to set the ship right again, and like kind of you know it's like an aircraft carrier when you have to turn it and it takes like a day, you know? It's like he's spinning the wheel and then you know he's been spinning the wheel and and and then he unfortunately passed away. But it seems like that the direction has been charted yeah they're still going that way. And so with Nintendo, what I would love to see them do is just I would love to see them trust their Western affiliates more. I think Nintendo.",
            "start": 1205.48
        },
        {
            "text": "has been charged yeah they're still going that way and so with Nintendo like what I would love to see them do is just I would love to see them trust their Western Affiliates more I I think Nintendo of America should be running that show you know like this is the biggest Market in the world this is a huge market for Nintendo a massive market for Nintendo and they should have a little more trust in maybe some of their Western Partners to be like we you know let let us figure some of these things out and so I think Nintendo is is on the right path and I do think that these social media moves and all these kinds of things um are making them a little more personal which is something that Nintendo had lacked for a long time and that was always so confusing because their games are the most personal you know and so there was like this this crazy dissonance between the nature of their games and the nature of them as a corporate entity and they need to be able to merge those two things",
            "start": 1239.28
        },
        {
            "text": "you know and so there was like this this crazy dissonance between the nature of their games and the nature of them as a corporate entity and they need to be able to merge those two things together there's no reason why they can't have I mean people like Reggie Fils-Aimé and all these kinds of things but Reggie I would I wouldn't consider in terms of Hardcore Gamers like core Gamers that like someone like Hideki Kamiya or Phil Spencer is like way more important to their companies than someone like Reggie is and there's no reason why Reggie shouldn't be the guy or or maybe not because everyone seems to hate Reggie now after the whole E3 thing but like like someone although I'm sure that will pass what was the E3 thing well just like where he was like walking around giving interviews and telling people you know oh about the VR isn't anything yeah you know what I'm saying where it's like they need to elevate their people the way Sony was wise enough to elevate their people it's so funny",
            "start": 1272.04
        },
        {
            "text": "people you know about the VR isn't anything yeah you know what I'm saying where it's like they need to elevate their people the way Sony was wise enough to elevate their people it's so funny you say that cuz to me like I feel like Nintendo's people are so much more recognizable they're recognizable but they're behind glass dude they're in a museum I can't talk and interact with them everyone can interact with Shuhei Yoshida and Adam Boyes and these different people and that's that's what I'm saying it's like you can't you can't Phil Spencer answers people's tweets like all day yeah Phil Spencer runs Xbox you're not gonna like talk to Shuhei Yoshida you know Mat Pat isn't gonna answer your texts or your tweets he's on Twitter answer my text I mean that's what I'm saying is like like why isn't Reggie Fils-Aimé on like like the like you're saying those guys make news from a social perspective that makes sense like Shuhei Yoshida is a guy you feel like you can go up and talk to because you can mhm you know I I've been in this",
            "start": 1308.6
        },
        {
            "text": "like the like you're saying those guys make new from a social perspective that makes sense like Shu is a guy you feel like you can go up and talk to because you can mhm you know I I've been in this industry for a long time and if I saw I I I've met Masahiro uh but I wouldn't feel comfortable just walking up to him be like hey hey dude you know like like but Shu but shui is like one of you know or Phil Spencer are like these guys are guys that are just kind of doing their thing and stuff and I think there's an organic nature to it that I think in the social media era is very very important um and I think that that's what I'm saying it's so ironic because Nintendo has these guys that are so obvious just let them off they're leash they're not going to do anything wrong you know that's there's there's too much there's too much control I think if if Nintendo got into a more personal space I think that because I think the NX is going to help them very much and I'm super interested also to",
            "start": 1345.52
        },
        {
            "text": "There's too much there's too much control. I think if, if Nintendo got into a more personal space. I think that because I think the NX is going to help them very much and I'm super interested also to see their first mobile game which is coming out this year um but I think that they're moving into a new space and it's going to be a space where it's that's going to make them competitive with Microsoft and Sony again and they need to be able to have um the proper tools to be able to go at at them so I think you're right. I think they're going to have a big E3, you know um and it's going to be an exciting E3 and I can't wait to see what the NX is all about and I hope they can win me back so yeah I think all three companies are doing great in my opinion you know and uh doing something's wrong but most of the things are right. I think I think everyone's kind of trending up, they're trending towards listening to consumers I think that's that's very important and it's going to be good for their",
            "start": 1381.2
        },
        {
            "text": "most of the things are right I think I think everyone's kind of trending up they're trending towards listening to consumers I think that's that's very important and it's going to be good for their products I think Nintendo I think Nintendo has nowhere to go but up at this point especially true good that topic brought to you by Squarespace Squarespace is how we made kinda funny.com and I'm in love with how it looks and how simple it was to make sites look professionally designed regardless of skill level no coding required intuitive and easy to use tools with state-of-the-art technology powering your site to ensure security and stability trusted by millions of people and some of the most respected brands of the world including kinda funny starts at $8 a month and you get a free domain if you sign up for a year start your free trial start your free trial site today with no credit card required at squarespace.com when you decide to sign up for Squarespace make sure to use the offer",
            "start": 1415.48
        },
        {
            "text": "if you sign up for a year, start your free trial, start your free trial site today with no credit card required at squarespace.com when you decide to sign up for Squarespace make sure to use the offer code kinda funny to get 10% off your first purchase Squarespace build it beautiful build it beautiful it's your favorite thing it's awesome",
            "start": 1448.04
        }
    ]
}