{
    "id": 1201,
    "video_id": "eks10AqqFRw",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Let's Play Shovel Knight Plague of Shadows - Kinda Funny Plays",
    "description": "Colin and Tim check out the new Shovel Knight DLC.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1442494801,
    "duration": 1565,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to Kinda Funny Games this is a let's play of Shovel Knight Plague of Shadows the free DLC on all the different platforms I'm Tim Gettys this is Colin Moriarty it's going to be here with you today no Colin we just we just did yes a recording of this game yes and uh we're not going to use it no no no because I got the the intro scene has this one jump I was looking at my email to make sure that this was free I'll look at it in a second I think it is uh the intro sequence has this one jump that's like absurd insane insane and I so the idea of playing Shadows when you when you download it is that you have already beaten Shovel Knight and then you choose him as your second character so it assumes that you have already played the game so we got through the intro sequence and now I'm back in town and here I'm trying to get in and this knight's not letting me in so I'm going to have to like leave he called me like he told me to get a bunch of names he called me said I",
            "start": 0.08
        },
        {
            "text": "now I'm back in town and here I'm trying to get in and this Shovel Knight's not letting me in so I'm going to have to like leave he called me like he told me to get me a bunch of names he called me said I had a bird face which I didn't really appreciate uh so I'm going to go back this way and this is a new part of town here we have never seen before so let's start here and see what this gentleman has to say hedge pupil I'm still guarding your secret entrance but I lost the key the locksmith should be here in a week or two maybe you could wait until then all right yeah let's wait a week or two wait we'll be back guys so one of the things you learn here is that when you hold down the attack button and then let it go you jump so Plague Knight can double jump so the biggest thing here is Plague Knight plays completely differently than Shovel Knight it's not just like a skin change or something it's like the mechanic this is a different game right and I'm not and I got to be honest I'm not like",
            "start": 37.56
        },
        {
            "text": "plays completely differently than Shovel Knight, it's not just like a skin change or something; it's like the mechanic - this is a different game right? And I'm not, and I got to be honest, I'm not like first blush not crazy about it so I want I want to keep playing and see if my if if I change. I'm just very stubborn in the way I like to play games right; that's just I mean that's a well about me. So it could just be me not willing to change, having found such Perfection with Shovel Knight which was my game of the year um way back in uh last year so way back yeah uh when we were still at IGN that was my Game of the Year by far. So um I I'm a little disappointed that it doesn't play more the way I wanted it to play but you know I mean that's to be expected so we're different though that's cool. So um This Woman's in the original mhm so we're talking to her so it seems like we'll go back to the world map again but it seems like you're basically going to the same stages I'm",
            "start": 73.0
        },
        {
            "text": "though that's cool so um This Woman is in the original mhm so we're talking to her so it seems like we'll go back to the world map again but it seems like you're basically going to the same stages I'm interested how they changed them up I found that when I fought Black Knight uh in the original intro stage or whatever that he was actually quite easy with projectiles I I'm really interested to see what they do with Plague Night stage me too seeing that you're you're him we were talking about this in our in the let's play we just recorded but so my favorite is Specter Knight your favorite is Tinker Knight Tinker Knight Y and yet they went with Plague Knight well I also I like I'm a fan of him I was always a fan of the the aesthetic of his level and stuff sure sure sure sure and I do think that the gameplay mechanics that he has are interesting and different enough from Shovel Knight to make this worth playing again potentially like cuz when I thought it just looking at the trailers",
            "start": 111.04
        },
        {
            "text": "that the gameplay mechanics that he has are interesting and different enough from Shovel Knight to make this worth playing again potentially like cuz when I thought it just looking at the trailers and stuff without really inspecting what this was I was like eh I don't really need to play through it again right right but this looks really different and they actually changed the levels so we got arcs into the air before it comes crashing down so I can do this and I so I can talk to her and and buy things I can research things I guess this is what the coins are for I have a bun new toys but we still need to build them we'll need 40 Cipher coins so Cipher coins so I don't have enough I have 28 cypher coins so far so it's cool there's like a whole little like new hub town to explore with all the same people this is pretty funny oh dear horse dude this this gentleman o long oh so he's the musician what you need science play me a song oh okay cool so those are the music that's the music",
            "start": 153.76
        },
        {
            "text": "people this is pretty funny oh dear Horse Dude this this gentleman o long oh so he's the musician what you need science play me a song oh okay cool so those are the music that's the music I found all right so let's get let's just get back into the business I'm G to go to I'm G to go to Shovel Knight who I actually have for science I like that instead of shy I like how he appears like that too so so so the game you know the stages seem to be the same I to interested to see what they do with uh some of the yeah his own stage so yeah he can double jump which is quite useful and he can also double jump and then explode and things like that um so Shovel Knight stage is by far the easiest stage in the game and so I'm interested to see if it's like absurdly hard like parts of the uh the intro even was there we go there we go all right so we're cruising so it's I thought it was like Metroid where the bombs kind of blow blow you up but it's not like that instead you hold X to charge and then",
            "start": 196.6
        },
        {
            "text": "Was there we go, there we go, all right. So we're cruising. So it's I thought it was like Metroid where the bombs kind of blow blow you up, but it's not like that. Instead, you hold X to charge and then you can jump, and when you release it, you kind of are a bomb yourself and kind of fly forward. Well, what I like here is that I'm automatically just walking around charging it a lot, which is the way you play like the later Mega Man games - you get the Buster so nothing seems that different so far on King Knight. The intro stage looks the same too until we got a little farther. Yeah, they would remix a lot of the different things like yeah this is the same God I played this game. Those are my favorite enemies, the rats. Yeah, they're so funny. The double jump definitely changes the dynamic of the game quite a bit. It's going to change like the thing is this projectile is going to change the boss battles. Yeah, but so far, I mean it feels it feels",
            "start": 266.68
        },
        {
            "text": "double jump definitely changes the dynamic of the game quite a bit it's going to change like the thing is this projectile is going to change the boss battles yeah but so far I mean it feels it feels nice it feels fine I'm not you know I'm still getting used to I'm still acclimating I guess it doesn't hurt people get this eat myself a chicken mhm I always thought it was a turkey it could be oh this is new what is this something bizarre up here got a lot of spikes going on yeah this is like an alternate route yes this is all I remember any of this that coin the funny thing is is like figuring out when you shouldn't double jump like when well when you shouldn't explosively jump cuz you can't really control yourself once you're in the air here we go I have to go back interesting I think I can go this way maybe I'm missing something but **** it oh they're back your friends are back propeller mice they're just so funny yeah they're a little ridiculous all right",
            "start": 319.56
        },
        {
            "text": "I think I can go this way, Miss. I'm probably missing something, but **** it. Oh, they're back, your friends are back, Propeller Mice; they're just so funny, yeah, they're a little ridiculous. All right, so we'll go back to once we came. I might need like a special item, yeah. The mice remind me of Batman Returns when the Penguin put the little jetpacks on the P.I can respect that in now-a-logy; see, so that was a difference, but everything else is the same and you want to just kind of force these things down. Yeah, beetles ready. I wonder if I can actually fit in there. I guess I can't get oh huh. Should we do it? Yeah, oh yeah. I can't into little space. I don't remember that in the original game really. Yeah, that was what's it do? It brings you to a special room or one of the treasures is like one of the weapons uh let's see. I remember that very well 'cause I thought it was like so clever. It's funny cuz a lot of this is made; it's like since the this particular stage has been very remix, very much it's",
            "start": 420.2
        },
        {
            "text": "Let's see, I remember that very well cuz I thought it was like so clever it's funny cuz a lot of this is made it's like since the this particular stage has been very remixed very much it's like still made for Shovel Knight you can actually like do things that you can never do mhm oh God you can like I wonder if you can like it just seems like the platforming is a little off because you don't have to um do not limited yeah exact exactly right these guys are funny I like their little swipe yeah the animations in this game are awesome cuz some of them are just so weird like I wonder if I I guess what I'm saying is like like I can just skip them yeah which is interesting yeah the anime I mean the dot art done by this guy named WYNC over there and uh just he's very very smart and knows exactly what he's doing super impressive I think one of the best in the business right now and clearly inspired by some of those great games we grew up with I like this I like this new this",
            "start": 493.44
        },
        {
            "text": "exactly what he's doing super impressive I think one of the best in the business right now and clearly inspired by some of those great games we grew up with I like this I like this new this new currency system though in ter like I like I like games that can be lots of things to do that are like optional but there and you can kind of **** around with I mean even the original Shovel Knight was like that like I feel like there was so much stuff in towns and all the secret like that the weird River yep thing whatever that was called where they do the weird dance for yeah yeah there's yeah see this is like so much easier to get back up there yeah like you don't back like you have to use those enemies to bounce yeah so that's what I'm saying is like there's just only so much remixing that seems to have been done which is fine like these guys you could just skip a lot of it this part will be interesting too cuz I'm not even sure that I yeah I guess I won't get it yeah and this",
            "start": 554.52
        },
        {
            "text": "that seems to have been done which is fine like these guys you could just skip a lot of it this part will be interesting too cuz I'm not even sure that I yeah I guess I won't get it yeah and this actually this is going to be really quite complicated oh **** yeah let's go this way yeah **** it yeah I'm interested to see how you do this yeah cuz usually you just Pogo right on them I guess this isn't too bad with the jump though yeah it's still going to be it's going to be still be pretty there we go oh that was good that was a pro maneuver that this is scary **** those green coins God damn worth it that was rough be out I'm say just skipping him not good for my currency I mean if I'm when I when it comes to Ven I played for real there I'll be playing it much more strictly I wonder what they what they say to each other what I like Shovel Knight a lot I like how he like isn't really even a king the name itself doesn't really even make any sense yeah so like the",
            "start": 597.96
        },
        {
            "text": "Let's Play Shovel Knight Plague of Shadows - Kinda Funny Plays\nColin and Tim check out the new Shovel Knight DLC.\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nMusic by Rakohus!: http://www.youtube.com/user/rakohus\n\nstrictly I wonder what they say to each other what I like Shovel Knight a lot I like how he isn't really even a king the name itself doesn't really even make any sense yeah so like the boss fights are a little bit you know they're like they're fighting the same but you just it's like when you play Proto Man or Bass and Mega Man opposed to Mega Man awesome Yep that was simple now to be fair you're a pro at these Shovel Knight games if you were to play King Knight with Shovel Knight would you have beaten that fast if I was played if I was to what do you mean if I was play if you if you were Shovel Knight right now facing off against that boss that would have been way easier than that I would I would even gotten hit okay yeah like I King Knight I had down to a science for sure drop the essence into my Dynamo decanter here Essences are volatile once the Essences are all distill together if my research is correct then we can craft the ultimate potion like I discovered",
            "start": 707.96
        },
        {
            "text": "\"Sure, drop the essence into my Dynamo decanter here. Essences are volatile once the essences are all distilled together. If my research is correct, then we can craft the ultimate potion. Like I discovered that his crown is a real gold. Do you think you fight Shovel Knight at some point? I hope so - that's what I was actually just wondering though. That's funny that you say that. I hope that that's the case. Let's see... What do I want here? Produce wall climbing flames. I'm going to, you know what? I'm not going to buy anything. I'm going to go buy some health and then we'll try Shovel Knight to close things out and see you play. We're going to go to Spectre Knight stage just play wait... but I thought we wanted to try to play Night Stage. We can't get there yet, it's not open. Gotcha! Yes, uh... how can I help you, Percy? I ran out of paper. I couldn't feel any more. Oh okay... So this is the music they made a glue joke to the horse which was funny. Where's the guy that like... who is this young man?\"",
            "start": 776.68
        },
        {
            "text": "Let's Play Shovel Knight Plague of Shadows - Kinda Funny Plays\ncan I help you Percy? I ran out of paper. I couldn't feel any more. Oh, okay. So this is the music they made a glue joke to the horse which was funny. Where's the guy that like who is this young man I picked up your special delivery want to take a look at settle the bill trying to sell that was for the when you go to the river the dancing thing of course my okay well **** all you yeah useless actually I never went this way I wonder if this is just an exit the back this is a really cool pixel art here is like and the animations are awesome yeah so we can't go that direction yet H man so we're never going to know what happens with Play Night **** with this guy see what oh oh god oh that was Spectre Knight stage let's see what we can do here this is a this is",
            "start": 831.52
        },
        {
            "text": "Let's Play Shovel Knight Plague of Shadows - Kinda Funny Plays\nColin and Tim check out the new Shovel Knight DLC.\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames.\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nMoney, **** it, leave me alone. I love the Mario 3 style you too, back and forth of where's he going to end up? Boom! All right, so Shovel Knight stage, let's see what we can do here. This is a this is actually a fairly tough stage um with the dis like when the lights disappear and stuff and this thing be like oh so even need those anymore? That's funny that you just blow those up in the real game you would use them as like pogos and and and stuff like that, you get them to jump up but you don't need that's funny very self-aware. All right, yeah **** you frog okay that's a bomb I think right bomb course see you **** you. It's hard for me not to play the way I I I'm like I'm like resisting not playing the very methodical way I'm playing CU I feel like it would be boring watch all right wasn't turning around oh so ith thought he wouldn't turn around until the exploded that's not true just wasn't playing right. So this is another guy we should just be able up hop right over and then",
            "start": 912.12
        },
        {
            "text": "Shovel Knight Plague of Shadows - Kinda Funny Plays wasn't turning around, oh so it thought he wouldn't turn around until the enemy exploded. That's not true; just wasn't playing right. So this is another guy we should just be able to hop right over and then here again we should be able to oh guess that enemy is in the way try again no you got to do it the right way, clever. I don't think I can make that jump, I think I have to go this way yeah I think you land on just the top so let's go in here and we'll just to be safe Shovel Knight's going to be tough actually with the projectile I'll be interested to see I love his animations man he looks so cool yeah he is very cool very cool definitely one of the cooler guys I've always had a weird obsession with like the Specter Knight, that design you must love Castlevania then I mean that he's that he's like Dracula's like second in command in every one of those games got that far fair enough all right that's what I need I needed that real bad actually I'm might even bother I",
            "start": 1001.32
        },
        {
            "text": "I mean that he's that he's like Dracula's like second in command in every one of those games got that far, fair enough. All right, that's what I need, I needed that real bad. Actually, I might even bother to get through this a lot in one piece. Come on, there you go. Yeah, I like those designs as well. This stage is very Castlevania-esque. Yeah, I mean, that was the point, right? Yeah. Presumably, come on, you son of a gun. I'm on SPH, though. You thought that was invincible, Lord. I think the stage is actually very clever in terms of just design, really cool. I wish this project went further. Yeah, it's a really weird like Arc puzzle. Sol here. So it's funny how remixed the intro was, but it doesn't seem like the stages are remixed at all. Not that I blame them; I mean, they're giving this away for free, and I wouldn't put you know an amount of work into it. Work that was alright my way.",
            "start": 1084.52
        },
        {
            "text": "seem like the stages are remixed at all not that I blame them I mean they're giving this away for free and I wouldn't I wouldn't put you know amount of work into it I work that was all right my way through I've actually never seen that happen before I thought it stopped guess not yeah the coin now I'm just trying I'm just really focused on Surviving are these um I want to be invincible yeah here **** that noise all right this part's going to be tough looking good oh oh man there's no way to control yourself I wish you could just pop a little bit there's no finesse let's try it again chopping or something down what the hell here you got to just go straight up double jump yeah the double Jump's key this part might actually be easier in some respects with it **** you crazy like the last second got to do it all right here we go so let's do this first no what I was **** it let's use yeah what do I have L it seems like they're pretty common and we'll have the checkpoint",
            "start": 1190.2
        },
        {
            "text": "like the last second got to do it all right here we go so let's do this first no what I was saying it let's use yeah what do I have L it seems like they're pretty common and we'll have a checkpoint so in case we die we shouldn't have to do that again yeah the animations are just beautiful in this play talking a lot of trash mm yeah this is going to be tough yeah this is like really hard you know what area effect there we go yeah I think you're going to have to just wait this is tough down on the ground patient trade blows it's kill me die for sure I okay got him yeah oh man that was clutch yeah that was crazy turned it around oh man I thought you were dead for sure me too well that's it I mean that's not it there's more but that's going to ruin it all for you guys play Shovel Knight: Plague of Shadows let me verify I'm going to go on my email right now while we watch this ending animation just want to make sure let's see",
            "start": 1359.32
        },
        {
            "text": "ruin it all for you guys play a Plague of Shadows shovel knight let me ver I'm going to go on my email right now while we watch this ending animation just want to make sure let's see see unfortunately yeah this is a free update it's awesome so I'm playing on PC with an Xbox One controller but you can play it on everything that it's available on it'll be available for free for you hopefully by the time you watch this we around that time mhm Tim yeah that's it I'm I'm proud of you than you did good thank you I appreciate did damn good I appreciate that thank you look at that yeah the animations are really cool um all right so that's uh Shovel Knight: Plague of Shadows thanks for tuning in I'm Colin this is Tim we'll see you next time on Kinda Funny Games goodbye",
            "start": 1516.72
        }
    ]
}