{
    "id": 1198,
    "video_id": "zMZXD45DkYo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Do You Need To Play Metal Gear 1-4 To Enjoy 5? - Kinda Funny Gamescast Ep. 36 (Pt. 2)",
    "description": "Tim and Greg try to convince Colin to jump into Metal Gear Solid 5.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1442322002,
    "duration": 1948,
    "transcript_chunks": [
        {
            "text": "today's sponsors LootCrate for less than $20 a month LootCrate gives the geeky new a special treat every month Luke rates a subscription box service with $40 worth of geek gamer and pop-culture gear collectibles apparel comics etc delivered to your mailbox every month this month are celebrating all the monsters you can fit in your pocket and the ones you need some crazy circle drawing skills to bring to the mortal realm this month's crate features an exclusive collectible they told us is the most important object in pretty much the whole universe plus awesome items from Blizzard Kidrobot and more you have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate and but when the cutoff happens that's it it's over go to LootCrate.com / KF games and enter code KF games to save $3 on your new subscription today so something I do like Metal Gear Solid 5 mm hmm my god mm-hmm I'm loving it I'm loving it so much I'm just when you started tweeting this week I was like yes",
            "start": 0.0
        },
        {
            "text": "save $3 on your new subscription today so something I do like Metal Gear Solid 5 mm hmm my god mm-hmm I'm loving it I'm loving it so much I'm just when you started tweeting this week I was like yes finally it's just it's so good yeah and it's good for all the reasons that I have been complaining about being scared about it don't all the Peace Walker stepfather yeah I don't like open-world we've discussed this so many times I don't like that I don't like the lack of the Metal Gear story that I've been hearing about I don't like how much **** that I have to do that's not just linear yeah playing it all that's out the window I'm like I love this game I'm having fun I want to keep playing it and the story so far is that I'm I don't think it's it's different and it's not as given to me piece by piece as I'm used to but it's like it's getting there it's all coming together you listen to those cassette tapes and I've been listening and I love that yeah I have issues with it I don't wait to",
            "start": 35.22
        },
        {
            "text": "by piece as I'm used to, but it's like it's getting there, it's all coming together. You listen to those cassette tapes and I've been listening and I love that, yeah. I have issues with it; I don't wait to do it because I don't listen to them. I'm listening to them now, 85 hours later, when I'm doing side ops, ah, yeah. But the side op for the 15th time, that's what I'm like. Tell me about Afghanistan, yeah, what's going on in the world? It updated, but what I don't like about it is you don't see their faces, like with the codec, so and a lot of the voices in this game, I'm like, you all sound exactly the same, yeah, a lot of it, yeah. Just a lot of the tapes, I'm like, yeah, I don't know who's talking. And Snake as well; it's like when he doesn't talk, he doesn't talk enough for me to like identify with The Voice at all. Anyways, like there's all those issues I have with it, but I'm loving it as a huge fan of the Metal Gear franchise right now. The reason you're not playing this is that you feel like you haven't played",
            "start": 89.64
        },
        {
            "text": "anyways like there's all those issues I have with it but I'm loving it as a huge fan of the Metal Gear franchise right now the reason you're not playing this is that you feel like you haven't played enough of the prequels or the prior games to be able to play this, those two reasons are that I just am not that interested in it and there's other games that I'd rather play, rather than play Mad Max, the Metal Gear, it just speaks to me more but yeah it's something that Greg and I were talking about that I thought would be interesting conversation which is like also I played just a very little bit of three and maybe like half of four and not I didn't play Peace Walker so I'm a huge fan of Metal Gear Solid 1 and 2 and I'm a huge fan of the original Metal Gear, which I think it's actually a fantastic game especially for its time but yeah it brought up a question to me of like I'm seeing a lot of people not playing having never played a Metal Gear game before",
            "start": 132.7
        },
        {
            "text": "I think it's actually a fantastic game, especially for its time. But yeah, it brought up a question to me of like I'm seeing a lot of people not playing having never played a Metal Gear game before this series with a 28-year history now, yeah, and 29-year history, and never play the Metal Gear games and then jumping into this one, yeah. And I was like it's not a right or wrong kind of answer because I think that it's a case-by-case kind of basis. I think there are some things that you obviously shouldn't jump into without having experienced other things first, and there are some things that you could do that and this might be a game for that. But it still strikes me as weird and inauthentic being either excited or wanting to play Metal Gear Solid 5 when I'm not even sure what happened in 3 at all, and then in 4, I have no idea what happened or how it ended, and I never played those games, yeah. So it's like that brought up a question which is an open-ended question without a right or wrong answer which is like",
            "start": 171.88
        },
        {
            "text": "and then in 4 I have no idea what happened and I never played these games, yeah so it's like that brought up a question which is open-ended question without a right or wrong answer which is like should people be allowed to jump into a series and is it more of a case but they should be allowed to whether they want but is it is it smart to be able to jump into a series and and the example that I wanted to use of which we just brought up is the great example, I didn't play Metal Gear Solid for one or two mostly cuz I heard Metal Gear Solid 1 isn't very good and which or two I just never got around to play and so I jumped into Metal Gear Solid 3 and I think I got something out of it and I enjoyed my time with it but I also know I was missing a lot right and so I don't talk about the earlier games in any authoritative way even though I spent more time with it than probably most people because I don't think that I'm in a position to do that, yeah and I think that it would be kind of inauthentic of me to",
            "start": 214.81
        },
        {
            "text": "Way even though I spent more time with it than probably most people because I don't think that I'm in a position to do that, yeah. And I think that it would be kind of inauthentic of me to be like, \"I'm a Witcher fan.\" You know? I don't know... two-thirds way through but now you could because you played that game. I think it's inauthentic to say, \"I'm a Metal Gear fan\" and not having played anything remember your Solid but only knowing what you've seen in Metal Gear Solid 5 trailers. If you sit down to play it, I think it's a different story. I think you could finish a game that's the fifth installment, the third installment for the first time, and then now I'm a fan of this franchise, this world. And I think that games, especially nowadays, they're designed to bring new audiences in playing the different Metal Gear games just from a gameplay perspective it's like this franchise specifically story-wise are you gonna be lost as hell? Yes, but it doesn't matter. You can have played all the games.",
            "start": 251.62
        },
        {
            "text": "different Metal Gear games just from a gameplay perspective it's like this franchise specifically story-wise are you gonna be lost as hell yes but it doesn't matter you can have played all the games you're still gonna be lost and also the story at least so far you don't need to play the other thing right they tell you everything pretty if there's something you need to know they usually like the whole like I mean they recap Ground Zero is right in mission the beginning of mission or no the bridge between mission one and two yeah yeah and it's like they give you enough like I did things I wasn't as fleshed out as it should have been share like I think I don't understand why Ground zeroes wasn't part of this game I'm happy it wasn't has already played it but it's like I feel like this kind of key oh you wish they would have just include something happy omission yeah it's you guys um but the the recap they did it does give you the the bullet points what you need to know and that's just",
            "start": 284.23
        },
        {
            "text": "of key oh you wish they would have just included something happy omission yeah it's you guys um but the the recap they did it does give you the the bullet points what you need to know and that's just from a story perspective but from a gameplay perspective it's such a different game from for I mean it's more similar to Peace Walker but even then it's different yeah and it's like I feel like you could be a fan of Metal Gear Solid 5 you know you don't need to be a fan of Metal Gear Solid to be able I mean this is what we always go back to when I talk about in the review right is the fact that I think Hideo Kojima took the heart come you know criticisms from all of them but especially for right because four and five are the perfect examples for what we're talking about here you and I fought tooth and nail at the old job to keep Metal Gear Solid 4 off every ps3 top 25 list and I'm the second opinion on the perfect-10 masterpiece and I still think it's a masterpiece but I think Metal Gear Solid 4",
            "start": 320.08
        },
        {
            "text": "Metal Gear Solid 4 off every PS3 top 25 list and I'm the second opinion on the perfect-10 masterpiece, and I still think it's a masterpiece but I think Metal Gear Solid 4 is a masterpiece for Metal Gear Solid 5 fans. Sorry, Metal Gear Solid fans, if you don't know anything about the metal gear series, no circumstance start with 4, you will have no idea what's happening why this matters why it's insane to go back to Shadow Moses we don't him yet all the moments in that game where I was like oh my god, like they're lost on you. I feel like the gameplay is plot-driven info yeah exactly not more so than any of the other percent in Metal Gear Solid 5 is the continuation of all the criticism from that whereas I always said Peace Walker was a great standalone story, you can draw in all you need to know is that you're the super-soldier, you killed your mentor, you were kind of in love with her there's a lot of questions oh my god there's a tape with her voice on it recorded last week.",
            "start": 358.15
        },
        {
            "text": "you need to know is that you're the super-soldier, you killed your mentor, you were kind of in love with her. There's a lot of questions. Oh my god, there's a tape with her voice on it recorded last week. What do you do? That's all you need to know, and that's explaining the very beginning. And one awesome animated cutscene or comic book cutscene - you're out there, and it's the same thing with five for the most part. Right? I'm just like... You wake up, and the prologue is meant to be completely disorienting, even if you have played this game, you don't know exactly what's happening. It's scary, it's frightening - you're terrified of what's happening - and then you get the little recap after that. If like we're on the story, and you go... And the hook to this game is the gameplay. It's not like Metal Gear 2 where I was like, if you weren't a fan, you're even more lost than usual. And who is Solidus, and what really happened? He was the president, but he has octopus arms - what the hell? This is the",
            "start": 399.8
        },
        {
            "text": "Metal Gear 2 where I was like if you were if you weren't a fan, you're even more lost than usual, and who is Solidus and what really he was the President but he has octopus arms, what the hell? This is the point of this game is to get people involved and getting them in there. And what's really interesting to me is like seeing our Facebook group like every day for the last two months someone made a new topic: \"Do I need to play through the first four Metal Gear games or whatever it is, not half but four plus Metal Gear games to be able to play this?\" And it's like it got to the point where people were getting upset, like guys check the freaking thing. Yeah, people are asking this every day. Maybe it's just cuz Facebook's a garbage pile and you can't keep track anyway there's threads everywhere how do I know what any of the global forums talk about? But the thing with that though is the fact that this is a question people are discussing whether or not because people do feel like in a",
            "start": 430.13
        },
        {
            "text": "how do I know what any of the global forums talk there but the thing with that though is the fact that this is a question people are discussing whether or not because people do feel like in a Metal Gear Solid 1-4 thing or it's like a pride point sure someone like you that's like very prideful of the games that you play and you know the legacy that all that has but I also just think from there's a lot of people who just want to enjoy this thing and they want to know can I enjoy it I mean the dozens of tweets I've gotten and I won't even say dozens a day of people who are like oh man your your Let's Plays and your review sold me on it's my first Metal Gear Solid game and I love it it's like great that's awesome you know I mean cuz that is always the concern that I'm like yeah you could jump in at Metal Gear Solid 5 but I've you know loved this story forever right now to your other point which are three would you",
            "start": 467.78
        },
        {
            "text": "the concern that I'm like yeah you could jump in the middle of Metal Gear 5 but I've you know loved this game and this is the story forever right now to your other point which are three right would your three was the one where it was coming out it was getting hyped and all this cool stuff and like this sounds like what I want right now I want a world to get lost in and I want all the stuff and jumping in and playing it like totally I'm enjoying it I was having a great time and I'm like I love Trish she's awesome I'm gonna have sex with her and I did and I was like I choose you, Pokémon, and I'm like gonna be my girlfriend and then Yennefer shows up and I'm like oh man you know for such a **** da-da-da-da-da and then I tell that to Christine which was a huge mistake because she went back and played one through three to get ready for five like she never played them before so she's like Miss Witcher right and she's like you don't even know and she dumps all this information on about the story on me",
            "start": 504.89
        },
        {
            "text": "one in two to get ready for three like she never played him before so she's like Miss Witcher right and she's like you don't even know and she dumps all this information on about the story on me that I was like didn't know any of that that was never explained in the game maybe if I would have gone back and read you know all the appendices or whatever mate I would have seen it or whatever but didn't know that but for me I'm still enjoying going forward but I am definitely not connected to it like you are right she's putting up YouTube videos every day debating choices and what happened here not was I was like oh I'm killing sure Tris you know I mean like it's just an easier thing for me because I don't have that investment yeah yeah I think I mean I think to me it's a case-by-case kind of basis and that's what I was saying like I don't know if there's a really a right or wrong answer like the right answer for me with Metal Gear Solid 5 is I have no business playing that game really at",
            "start": 542.51
        },
        {
            "text": "basis and that's what I was saying like I don't know if there's a really a right or wrong answer like the right answer for me with Metal Gear Solid 5 is I have no business playing that game really at the end of the day I'm like I don't like and to me it's like because I know Metal Gear Solid 1, I know Metal Gear Solid 2, Metal Gear Solid 3 got way too granular, Metal Gear Solid 4 which is not very good in my opinion and I really want to go back and play those games again and just experience it but I think also my mindset is based on what I think Metal Gear should be and not what Metal Gear has become in the sense that like I was dismayed and actually really disappointed and even more turned off when I heard that the game like has no story I was like how is that even possible it has just likes not the traditional yeah yeah but like that's the thing though and having played I'm like 15 hours in now like I'm right there with you like I'm lame Metal Gear",
            "start": 577.58
        },
        {
            "text": "is that even possible it has just like not the traditional yeah yeah but like that's the thing though and having played I'm like 15 hours in now like I'm right there with you like I'm lame until Metal Gear mainly for the story the gameplay is like second to me but it's like this is totally winning me over the other way where the gameplay is awesome and there is a story all those reviews scared me like even talking to Greg early on I was like man get it playing there is story it's like it's not like those things aren't there it is very Metal Gear like I was even telling Greg this last night like there's I was worried that there wasn't like that group you know like the enemies that you're like oh **** there's these scary things out there that I'm gonna have to fight they're they're you know they don't they're not and you said that they weren't there they're not but he's talking about the Skull Unit and their skull face and then there's the Skulls are enough yeah there is man there's not",
            "start": 611.21
        },
        {
            "text": "they don't they're not and you said that they weren't there they're not but he's talking about the Skull Face unit and their skull faces and then there's the Skulls are enough yeah there is man there's no Fortitude there's no yeah they're not like individual personalities but there is a group of them and it's like I don't think it's as dire as you think it might be cuz I mean at least it wasn't for me and I was worried I was so scared about not liking it because of those things yeah my intent is to get to it eventually and like it's not really a priority but for me I just need to play three and four I don't think I wanna play Peace Walker they just don't really want to but what's interesting about that is like you just you don't need to but I feel like I should not I might not need to but I feel like I should like I just feel like first of all going backwards at playing five is probably to be really difficult and in terms of gameplay mechanics especially the way",
            "start": 649.37
        },
        {
            "text": "like I should like I just feel like first of all going backwards at the playing five is probably to be really difficult and in terms of gameplay mechanic specially faint controls especially the way three fields although three is you know an improvement from one two and four obviously it's very different in terms of gameplay but it's just it was just one of those things where I was like like I I consider myself a Metal Gear fan up to a certain point in time and so I would I've always meant to go back and play those games again and this might be the good excuse to do it but I also think about you know I think about my own assumption to without having any context which was a great idea a great one and how I didn't like to GameOverGreggy's point I didn't really know what I was missing and ignorance is kind of bliss but no offense to The Witcher series which is based on you know polish novels and people really enjoy those games enjoy those stories and they're probably more coherent stories maybe",
            "start": 688.07
        },
        {
            "text": "is kind of bliss but no offense to The Witcher series, which is based on you know Polish novels and people really enjoy those games, enjoy those stories, and they're probably more coherent stories maybe even better told stories in Metal Gear. But no one's running around really worried wondering about like and dissecting the **** out of The Witcher or compared to the way that they do with Metal Gear. And so I, I like Metal Gear is like really almost an anomaly even amongst story-driven games in terms of how people are obsessed with it. They have different interpretations of the same exact things that are happening. So I want to be able to go back and play it. It struck me as a bizarre game for people to jump into without any context, and I understand people are doing that and are enjoying it. I'm glad people need to do what they need to do, but it doesn't it's not like Castlevania or something where Mega Man, where it's like it doesn't really matter like it stores a story if",
            "start": 724.67
        },
        {
            "text": "are enjoying it I'm glad people need to do what they need to do but it doesn't it's not like Castlevania or something where Mega Man, where it's like it doesn't really matter like it stores a story if you care but it doesn't really matter yeah over and over it's not like that but it's still somewhere along the line there was the break between gameplay and story with Metal Gear and I think that he's Walker that well I think even it was like it was for that took the Phantom Pain, was the one where it's it I think you saw the branching path of where they wanted it yeah for like one two and three you see the very clear line for was the one where they changed the gameplay entirely made it an action game and then it was a story game like you you needed to play the other ones to get that at least one into three helps a lot and you'd have to play that then Peace Walker was just alright we're gonna take the gameplay elements of four and give it a standalone story and this is kind of just the",
            "start": 761.75
        },
        {
            "text": "one into three helps a lot and you'd have to play that then Peace Walker was just alright we're gonna take the gameplay elements of four and give it a standalone story and this is kind of just the continuation of that so really Peace Walker is the one that you you need to play in order to understand any of the story and stuff like that all that like the obviously if you play through all of them you're gonna get the little details here and there that make it more complete but I mean at least so far there's nothing that I'm like oh man I'm happy I played through all the other Metal Gears to know all this respect that I think I just respect that like I think people give a Kojima I guess what I'm saying is that I feel like this is my way of respecting what Kojima has done which is to say like I don't want to just I don't want to just run to the end you know like there's middle chapters that might not be that pertinent that I still feel like are important for me to understand and a lot of",
            "start": 804.41
        },
        {
            "text": "I don't want to just run to the end, you know, like there's middle chapters that might not be that pertinent that I still feel like are important for me to understand. And a lot of people give Kojima games credit for its kind of over-the-top storytelling; it's all like that, but I think that's part of his charm. I think that's almost 90% of what makes him charming, you know. There are games that play better than Metal Gear, they're games that look better than Metal Gear, and I'll talk about all of them. Well, not me type though; that's the thing, man. Like five plays so well, and it's beautiful – like I don't think it's getting enough credit for how amazing it looks. I mean, I've watched Greg play, and I think it's a pretty game. I don't think it's like amongst the best-looking games; I think it's a very pretty game in its own right. And my personal pain is that I don't think it's as polished as all of the other games look, and I don't really... I don't care about that either – that's not really what matters to me.",
            "start": 846.08
        },
        {
            "text": "in cooking game and my personal pain is I don't think it's like the Metal Gear Solid peel and all of the games looks and I don't and I don't really I don't care about that either that's not really that's like one of the least important things to me is the way a game looks it is it's fun but this is more of me like not casting any judgments or Paul's on anyone but rather to say like I kind of respect the legacy of these games too much and I still feel like I need I want to put Metal Gear Solid 3 back on my Vita and just get through it you know and four I played half of it maybe even a little more and I was like well I just take the time take like the week it would really take me but it did it to get those games out of the way and then maybe you take a look at Peace Walker and just see or I could just watch like a video that recaps the story whatever but I just feel like I want to be more authentic it reminds me a lot of like I said there's like examples of things that I think you can get away",
            "start": 879.2
        },
        {
            "text": "watch like a video that recaps the story, whatever, but I just feel like I want to be more authentic. It reminds me a lot of like I said there's like examples of things that I think you can get away with and things that you can't get away with in terms of story and like jumping in and whatever it's like you wouldn't see Return of the Jedi without seeing The Empire Strikes Back, mm-hm, there wasn't any sense to it. You'd have no context. You'd annoy yourself trying to figure out what the heck is going on. You can pretend that you do, but you don't, and you don't know any of these characters. You know what happened to Boba Fett, like I need these guys at all. And I think that's a relevant point, so I think there are relevant ways to look at both things and to kind of try to pay homage to the entirety of the story, whatever. I hope my hope is that in Metal Gear Solid 5 with people that are jumping into it fresh and decide to",
            "start": 911.99
        },
        {
            "text": "both things and to kind of try to pay homage to like that they'll hold the entirety of the story whatever I hope my hope in Metal Gear Solid 5 with people that are jumping into it fresh and decide to play it without having played the other games is that they do take the time to go back and look at the other Metal Gear games. They will last about 10 seconds, yes. Nick Scarpino did on the plane trying to figure out how to control metal yeah just don't hold on and that's what I'm saying like that might be a problem even for me so you know I think was like a higher tolerance within some of this stuff for some people cuz I just want to I want to see things through but you know I just don't believe you should play Uncharted without playing Uncharted. I don't think you should, you know, but you can play like the Killzone games because they're not really story heavy or like you know you would you really play you can't play like I know the only thing is what's happening with Drake and Elena right",
            "start": 941.51
        },
        {
            "text": "like the Killzone games because they're not really story heavy or like you know you would you really play you can't play like I know the only threat is what's happening with Drake and Elena right now the rest they're all like Indiana Jones type things John I totally disagree I don't think oh I don't think you I don't think you appreciate especially two to three but I think one that's one I think Killzone has more story in terms of like two to three I need to know they just killed what was his name the guy they assassinate on the steps or whatever and then they put their head in their hands and then we pick up right after that and that's why Helgen is even more intense than you yeah but it's it but I I know point one carry like I feel really wow what about what about the blue SAP like no you want to know what's happened no I understand that but I I mean I wouldn't compare I'm charged a story kills I'm sorry at all I told them to agree with you on that but in terms of like its",
            "start": 974.93
        },
        {
            "text": "no you want to know what's happened no I understand that but I I mean I wouldn't compare I'm charged a story kills I'm sorry at all I told them to agree with you on that but in terms of like its gravity and and so I thought I think that like if you don't know who Nathan Drake is or Naughty Dog you know if you just jump in Uncharted 3 you don't know why Eli is there you don't know why Chloe's back and all those kinds of things and you know I don't know I just feel like there's just certain things that you have to kind of respect the story in the through-line you should see it all you know but if you don't want to that's fine that's what I'm saying it's like it's not really a judgment call it's like do what you want I'm just saying that like I'm trying to kind of formulate more this set of rules my own head in terms of like how you should approach story driven things and kind of pay respect to it and have the fullest",
            "start": 1011.02
        },
        {
            "text": "saying that like I'm trying to kind of formulate more this set of rules in my own head in terms of how you should approach story-driven things and pay respect to them and have the fullest understanding possible because doing so would add to your enjoyment of the game. And so, I think people can enjoy Fallout through that having context from the other games, because they're so different. The same thing with New Vegas, and probably with four - The Elder Scrolls games are interconnected, but really not so. I guess it's just a case-by-case kind of basis thing. But I just don't like my own internal feeling when I'm like, \"Yeah, I want to play Metal Gear Solid 5,\" and then I go, \"Would you think of four? Where do they get three?\" I hate it for that reason.",
            "start": 1040.33
        },
        {
            "text": "internal feeling I'm in authenticity when I'm like yeah I want to play Metal Gear Solid 5 and I go would you think of four where do they get three I'm like I hate it for and I don't you know it's like so like why are you excited about it yeah yeah like that's like my own internal kind of struggle with it so I do intend on playing Metal Gear Solid 3 and 4 and maybe Peace Walker before I get to this game just so i can feel complete yeah about that yeah I'm with you on that like I I like playing through everything like I'm a completionist in that way when I get into something I want to do all of them like I got on Metal Gear really late in the game like I didn't play until I didn't start playing no your song until leading up to four and I've played through all of them but I was like I need to play through all of them to get there I'm happy I did but I just think it's different with this one so I don't know and I with what about something like Final Fantasy there's no connection at all no I",
            "start": 1077.25
        },
        {
            "text": "through all of them to get there I'm happy I did but I just think it's different with this one so I don't know and I with what about something like Final Fantasy there's no connection at all no I mean that's that's oh I'm saying return quests like these games that really have like very ancillary connections to each other at best no I don't think that all that's what I'm saying it is a case-by-case basis if some I'm trying to think like a good example like a Resident Evil 4 I feel like you could play you could play all the reasonable games individually but I do think that like you could not understand the full through line between all of them which exists without having played all of them but I do think forwards the entry point for a lot of people mm-hmm so again like yeah we could sit here all day and I'm sure I'm trying to think of like like Grand Theft Auto's in example words like it doesn't matter which ones you played or whatever but I do think that I just find it interesting when",
            "start": 1115.74
        },
        {
            "text": "all day and I'm sure I'm trying to think of like, like Grand Theft Auto's in example words, like it doesn't matter which ones you played or whatever, but I do think that I just find it interesting when when a story-driven game with a lot of war comes out and either I'm drawn to it without having an experience where I watch what Metal Gear a lot of other people being drawn to it I'm like that's very interesting to me, but I got to be honest like the more I hear about my don't care the more I want to play it and I'm like that's that should I think so I think it's just I'm coming from a perspective of a Metal Gear fan that an old MGS fan that would sacrifice gameplay for story if that like I had a choice and I think that they did have a choice and I think they did sacrifice the other way and that to me is like just sounds a little disappointing, I want I like I don't necessarily I was in charge you meddle your Solid 4's exorbitant cutscenes because they exist and I was complaining",
            "start": 1155.07
        },
        {
            "text": "and that to me is like just sounds a little disappointing, I want, I like, I don't necessarily, I was in charge you meddle your Solid Fours exorbitant cutscenes because they exist and I was complaining about them one of the ones I saw were boring, I mean if you have something to say then say it you know, like, and then take the time to say that's fine, so I'm almost disappointed that because I think you're right that Kojima really took Metal Gear Solid criticisms to heart and five seems to be a total exact polar opposite, okay, I think that that's just in some ways though it's not like a real it's not fair to say that as the end all be all because it's just like in certain ways it is different but it's not like they took it out it's not like it doesn't exist and I feel like they talked a lot about five being more of a TV show season as opposed to a movie and I definitely get that this feels like an HBO show, this feels like it's being drawn out longer",
            "start": 1192.21
        },
        {
            "text": "I feel like they talked a lot about five being more of a TV show season as opposed to a movie, and I definitely get that this feels like an HBO show - this feels like it's being drawn out longer, but it's still quality, it's still there. So, I mean, I haven't beat it yet, so I can't say that like that, it's the really great season of TV, but so far it's been an awesome half-season, you know? Yeah, my friend is a huge fan of Metal Gear Solid - yeah, well, I mean, we'll see. We've already seen how it's all Panda people love the game and I'm happy about that. I'm gonna... I'm not happy, you know. It's funny because everyone hates Konami but they'll still show up for the money in their pockets - that's a whole other topic of like how we have no testicular fortitude in this industry in terms of like companies do shitty things and people get upset about EA, what they'll be at the next Mass Effect game is another great example of a game they have no business playing unless",
            "start": 1234.12
        },
        {
            "text": "industry in terms of companies doing shitty things, people get upset with EA. What they'll be at the next Mass Effect game is another great example of a game they have no business playing unless you play them in order. Metal Gear though - either one when they actually mean like, hey, you want to support Hideo Kojima right and buy it and say this is a Hideo Kojima game? Right, how do you punish Konami? I don't know if you punish them on this one as much as the next one that comes out, which is Metal Gear Solid 6 or whatever. Metal Gear: Raiden isn't in any way connected to Kojima; that would be the one right? Yeah, no... we don't do that. Oh, I agree, I'm not necessarily blaming anyone for that either because I understand what people just draw out of the game is. But I do think about that a lot where I'm like you know everyone just bitched about Mass Effect 3 forever talk crap about Bioware and EA, and then everyone's excited about Andromeda... I don't like okay like you",
            "start": 1276.72
        },
        {
            "text": "about that a lot where I'm like you know everyone just bitched about Mass Effect 3 forever talk **** about Bioware and EA and then everyone's excited about Andromeda I don't like okay like you weren't you just really so angry they didn't want everybody yeah you know that's why I always say like these companies don't really care because they know that people don't really stick by what they say in this industry they do and I industries they do you know like if you buy if you buy a shitty Nabisco cracker or something or Oreo or whatever like you're not gonna buy more Oreos like yeah like so it's it is interesting to watch that happen but I brought up Mass Effect as an ancillary example that's that's a great example of something you have no business playing unless you play them in order you know I mean like that that's like absolutely the way I feel so that I guess that would be one polar opposite example would you agree with that like you can't jump into Mass Effect Iceborne",
            "start": 1310.8
        },
        {
            "text": "know I mean like that's absolutely the way I feel so that would be one polar opposite example, would you agree with that? Like you can't just jump into Metal Gear Solid 5 if you've never played one of them - I played three hours of it and I was like this is boring as ****. And stop lying, so you have no context of like... I watched the recap videos, I had the context. I mean I know who Big Boss is, I knew what I was getting into. Like I knew who the villain was from the first one - that's weird to me. Yeah, like that's actually a great example of a game where you're better off knowing the series. So I think there's that's what I'm saying it's like we had a whiteboard or... I'm like we got magnets and be like this is these are the only games you can play in order - Final Fantasy doesn't really matter right, they're not connected to each other. Final Fantasy games are connected to each other, we can probably get around that",
            "start": 1351.1
        },
        {
            "text": "you can play Metal Gear Solid: Portable Ops or Final Fantasy doesn't really matter right they're not connected to each other final you know you can like these games are connected each other we can probably get around the story and then these games kind of really are intimately connected with each other and you probably should play them in order I think it's just a case-by-case basis but it seemed like an interesting topic to talk about I'm actually interested to see like what people want to leave comments or ever about how they would stack series and specific orders like that like how do you feel about people like having ownership over something in terms of Metal Gear Solid and then jumping into it you know as opposed to jumping into a cold mm-hmm if people think that there are examples of that because I don't really have an answer I guess that's the whole point of the topic is I don't really know because I think which is a great example of me bucking my own internal trend because I want to play a game and I think I got",
            "start": 1390.04
        },
        {
            "text": "Answer, I guess that's the whole point of the topic. Is I don't really know because I think which is a great example of me bucking my own internal trend because I want to play a game and I think I got something out of it but to Greg's point Christine got more out of it cuz she understood me more and so should I have just played the other two first what I have liked which were three more you know yeah that's the interesting thing like for as much as people like Metal Gear would they have liked it more. I mean I think a perfect example is the Fast & Furious series no jokes where people that watch six or seven love them and they're like oh this is great like the other ones sucked but this is great but it's like if you watched all of them you enjoy six or seven so much more because you know all the stupid characters you know all the ways that things connect and all that so I think they would enjoy more it would be a better game but sure as hell really so it's like right it's the thing of how",
            "start": 1423.04
        },
        {
            "text": "stupid characters you know all the ways that things connect and all that so I think they would enjoy more it would be a better game but sure as hell really so it's like right it's the thing of how much better compared to how much time you need to invest into something that's antiquated and not good yeah that's that's it is an interesting question like yeah if for instance I went back and played three if I would enjoy Metal Gear Solid 5 right now I probably would okay that's that exists in a vacuum in a bubble if I had some sort of way to quantify how much more I'd enjoyed if I would enjoy 10% more if I played three and 15% more if I played four and 20% where my play piece work that's worth it you know that's so I guess that that's actually interesting way to put it like would you have joy you enjoyed Mass Effect to a lot your a game right it's fantastic game baby would have enjoyed 10% more if you had contact work more context right of Transistor one and so was it worth it for you to skip",
            "start": 1457.69
        },
        {
            "text": "you enjoyed Mass Effect to a lot your a game right it's fantastic game baby would have enjoyed 10% more if you had context work more context right of Metal Gear Solid one and so was it worth it for you to skip it to not get that extra 10% I don't know that's a case-by-case basis yeah what do you say about Metal Gear what about it the percentage thing just got I don't think you need I think you could jump in have a great time I think you know enough but I also think that part of this is just in your head I think you know that you don't have the time or a designer to play it right now so you're making all these hurdles like well I'm gonna go back and play three and four you're not and so then any time you play Metal Gear Solid 5 you know I haven't had time to go back to play and this is an insult by the way I haven't had time to go back and play three or four it's like Persona almost right well I'm gonna do it when the Vita is dead because you know what a time sink it's gonna be and the Vita",
            "start": 1495.4
        },
        {
            "text": "by the way I haven't had time to go back and play three or four it's like Persona almost right well I'm gonna do it when the Vita is dead because you know what a time sink it's gonna be and the Vita never died and then you finally were like alright I'll play it it was not what I want to play right now so now you're out of it you're playing Hideo Kojima's Metal Gear Solid V so it's another great example two of those games are somewhat interconnected and like in terms of like some a few of the characters or yeah and like the whole idea and the whole story it's not in other words it's it's a little more enhanced than Tales and that Tales has like arts and gels and all these kinds of things that you use but they're not really connected or ever but it's like I almost felt a little shitty going to Persona for like playing I'm like I'm kind of like that's ridiculous but I was almost like my kind of like a poser like people have been talking about this series forever I mean you would oppose oppose every time you're wearing a Metal Gear Solid shirt",
            "start": 1530.38
        },
        {
            "text": "like I'm kind of like that's ridiculous but I was almost like my kind of like a poser like people been talking about this series forever I mean you would oppose oppose ever you're wearing a Metal Gear shirt and making Hideo Kojima jokes already without having played it right that's that's the barrier to entry there as somebody who loved Persona 3 I do not I did not get it other than oh it's Igor that's all I got out of it you want to be playing Persona 4 I guess I guess that was like a connection yeah and I guess a lot of because I'm saying it's not really out of a personal judgment or an internal judgment of myself but more of I want to just respect I have so much respect for people that do take the time and do know what they know and do new things what I would consult the proper way however you want to put it where they do they have played the Persona games they have played the Metal Gear games they really know it and stuff and then I just jump in and I'm like a **** you **** you know like and I",
            "start": 1566.29
        },
        {
            "text": "it where they do they have play the Persona games they have played the Metal Gear games they really know it and stuff and then I just jump in and I'm like \"you **** you know\" like and I don't wanna be that guy either you know so I try to like kind of rein it in a little bit because I like I like respecting people that take the time you know whether or not that's a good use of your time again this is all yeah very hypothetical you know but I video games but I wanted a book video game you know I know it's funny but video games are serious like we had no very serious we take the serious business well there are serious as we take them yeah like I said you wouldn't jump you wouldn't run a Jedi without playing Empire Strikes Back or without what you want to see Jedi without seeing Episode IV first then I mean I know that the quality isn't here but you look at one Metal Gear Solid it very much is like Episode One of Star Wars oh good well in the end does that hold on but it doesn't so just a small quality",
            "start": 1600.98
        },
        {
            "text": "then I mean I know that the quality isn't here but you look at one Metal Gear Solid 5, it very much is like Episode One. Oh good well in the sense that... does that hold on but it doesn't so just a small quality sight in the sense that like yeah there's characters and there's a bunch of things that relate like Guy. Oh yeah R2-D2 is there? No, yeah C-3PO is - no one gives you context like you don't need to know that those things are eventually gonna be things that do stuff. This is a game that especially with Metal Gear the fact that it's now it's in the 80s and it's like alright we know what happens in the 2000s, we know what happens here this is such just a game that just happens you know I'm obviously I'm not saying that Episode 3 or at all Watto even Water was there yeah but but what I'm saying is it's like you can watch don't watch it's gone and I don't think that you get much more out of it having watched the other ones you know yeah I mean I guess it's a fair analogy to be fair one is before all",
            "start": 1634.52
        },
        {
            "text": "like you can watch, don't watch it's gone and I don't think that you get much more out of it having watched the other ones, you know, yeah, I mean, I guess it's a fair analogy to be fair, one is before all the other ones, so I mean, it's, it's you would then go to two, three, four, five and six, it's just that that was the order that they were made, I understand what you're saying, in other words, like, don't jump into it out of context, so I don't necessarily agree with your analogy, yeah, well, I mean, I understand what you're saying, yeah, main, but I don't know if that's the best analogy to use because one was made after four, five and six, but it is still the beginning, you would still be able to go to two, three, four, five and six from, yeah, I mean, I guess that's the thing, is there is stuff that happened before this one, but it's, ah, it's just like one of the Star Wars spin-off films, almost, that's like, I don't I",
            "start": 1679.97
        },
        {
            "text": "four five and six from yeah I mean I guess that's the thing is there is stuff that happened before this one but it's ah it's just like one of the Star Wars spin-off films almost that's like I don't I understand what you're saying and I think you're right that's why I was saying I wanted to just talk it out because I don't really know the answer mm-hmm you know but I do like to I really do appreciate and respect why some Pete I'm sure that I don't I don't think it's you guys I'm sure I wouldn't really be upset about this either but I'm sure there are Metal Gear fans that are quite upset that oh yeah those are the trolls but I don't necessarily think that that that's trolling I think that's saying like I put the time in in like these games are made for you know like a person's opinion could very well validly be like this was a game that was made for like we've been waiting for this well you're describing his band Wagoner's right but you're not gonna do put on a metal your shirt and hat",
            "start": 1716.24
        },
        {
            "text": "Very well, validly be like this was a game that was made for like we've been waiting for this. Well, you're describing his band Wagner right, but you're not gonna put on a Metal Gear Solid shirt and hat and be like, \"Man, I've always loved Big Boss.\" You know what I mean? Like that's not what you're doing. Why that's the point is that I just try to respect that - did you because I they're they're an IP that I feel very passionately about - with that like Persona 5 for instance which again is only gonna be a standalone story, you know I'm excited and interesting about it but I don't I'm not like beating the drums. I might be what the **** do I really know about Persona? I don't know anything about it, you know so it's like it's I'm excited I'm excited to see it I'm excited other people are excited about it even though there's stammering going on time so we're just kind of spinning our wheels here. I mean the last thing I want to say about this is I think it's interesting.",
            "start": 1754.4
        },
        {
            "text": "excited other people are excited about it even though there's stammer on time so we're just kind of spinning our wheels here I mean the last thing I want to say about this is I think it's interesting that I think a lot of this conversation is just because there's a five at the end of the title if it was just Metal Gear Solid: Phantom Pain then would you feel differently about it not unless my mind was erased about all the other games that came before it you know but what I'm saying is like with influences like Peace Walker doesn't count just because there's not a well no peace walk I don't like I don't want to play Peace Walker because I know that it's it's again not the Metal Gear that I want you know like it's very numbers driven and like it's got like a non-linear kind of thing going on in terms of like going to missions and building things up and and as opposed to like just a beginning and an end yeah yeah and like that's kinda this is a plot but in that campaign but",
            "start": 1788.48
        },
        {
            "text": "in terms of like going to missions and building things up and and as opposed to like just a beginning and an end yeah yeah and like that's kind I'm sure this is a plot but in that campaign but that's what I loved about Metal Gear was like this is what's happening I'm on Shadow Moses that's done this is what's happening on Big Shell that's done you know your ride and that's done like all these guys you know like like all these kind of things both being like alright now get an S-Rank it's like what the **** are you talking about yeah like why and that's just me being a old Metal Gear fan and not a new Metal Gear fan you know that's that's the thing so it's like I don't want to get an S-Rank that's the point oh that you don't need that isn't that's there for you to replay it's not even the goal tell Nick that the other day I'm like don't even worry about that yes anyway get my way through Metal Gear Melek doesn't mean if you want to go back and platinum if that's when you go back worry about",
            "start": 1825.98
        },
        {
            "text": "tell Nick that the other day I'm like don't even worry about that yes anyway get my way through Metal Gear Solid: Peace Walker doesn't mean if you want to go back and platinum if that's when you go back worry about what's funny is like the fact that peace walker is the game you should play to be set up for the story but it for what you're gonna skip so I don't understand just and also just you don't play metal yeah that's fine that's a fine answer but I but I mean I don't know I don't think it's that easy that's what I'm trying to talk it out I don't I know but I think that's what I'm saying I think after talking it out for this long I think the answer is you just don't want to play Metal Gear it doesn't interest you it is peace walker yeah you saying you don't want to play a piece water so you don't wanna play five and that's disappointing and yeah it's just what I've heard about the game has been disappointing to me not that the gameplay is grimy I think it's awesome that they've married gameplay I'm",
            "start": 1863.59
        },
        {
            "text": "play five and that's disappointing and yeah it's just what I've heard about the game has been disappointing to me not that the gameplay is grimy I think it's awesome that they've married gameplay I'm finally to the game but well I guess they didn't really build on Peace Walker so what are you did before but yeah it's a I guess it's more about like what I'm looking for when I'm getting or what I'm set what I'm hearing or just two different things and so yeah maybe it's not for me but I'd like it for to be for me because like Metal Gear Solid was one of my favorite games of that generation Metal Gear Solid 2 is it maybe my favorite ps2 game so I'm sure so there's there's a difference when we get to the end of the year and if you haven't played it then you'll have to play it cuz we all have to sound off when we go like this is what we need game of these are our picks for a Kinda Funny Game of the Year like we all have to play a little bit of each piece or at least have presentations why we think",
            "start": 1894.88
        },
        {
            "text": "when we go like this is what we need game of these are our picks for a Kinda Funny Game of the Year like we all have to play a little bit of each piece or at least have presentations why we think it's presentations hello I'm gonna I'm already prepped prepping my PowerPoint for the Hideo Kojima HD release I'm sure it's coming it's coming",
            "start": 1930.16
        }
    ]
}