{
    "id": 397,
    "video_id": "RK6Hzkya1Vw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Nick Scarpino",
        "Portillo"
    ],
    "title": "Would You Be Justin Bieber? -  The GameOverGreggy Show Ep. 42 (Pt. 4)",
    "description": "Support us here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1411542004,
    "duration": 813,
    "transcript_chunks": [
        {
            "text": "Nick, yes, what's your topic? I, my topic normally comes from the community but since we didn't do one last week and CU we're all out of order. CU we had there was so much going on last lot of Patreon stuff guys, but we're going to get back to it. Uh, I thought up my own topic today. Um, this will probably be a very quick one. Uh, but remember if you have topics for me now that everything's sort of settled down first please uh go if you want to support us at patreon.com/kindafunny but then follow me on Twitter @Nick_Scarpino and let me know what your topics are for the show and we will choose between it between two topics every week. My topic remember you can still go to patreon of funny and you can get the perk that just guarantees your topic on the show, that is true that is awesome too cuz we're trying to add a fifth topic we are uh we're GL for which would have been a sixth topic today, that's a long one. We'll see what's going on, that might be a goal. We should do one show that's 24 topics yeah 24 hours",
            "start": 1.1
        },
        {
            "text": "to add a fifth topic we are uh we're Greg for which would have been a sixth topic today that's a long we'll see what's going on that might be a goal we should do one show that's 24 topics yeah 24 hours of topics oh my God can we take breaks for peeing you now you're thinking me I'm going to float this milestone out there we get we get up a little bit more if the if the money keeps coming you know do what you want to do don't worry what about 20 or 25,000 we do a 24-hour GameOverGreggy show oh I love that live streamed I'm down for that but we have to what is that I've I've done 24 hours on Twitch it's rough yeah oh yeah you hit that wall that no that is awesome though that wall like we can have a oh yeah we have to rotate in that's to that's that's not Terry we've already been talking for 18 hours right now so it's like what's going on 6 hours my topic today comes from me uh remember uh uh follow me at Nick Scarpino if you have talkers but this topic is just near and dear to my",
            "start": 39.16
        },
        {
            "text": "for 18 hours right now so it's like what's going on 6 hours my topic today comes from me uh remember uh uh follow me at Nick Scarpino if you have talkers but this topic is just near and dear to my heart it's something I've always wondered if you had the opportunity to be Justin Bieber would you be Justin Bieber yes it's something that I've always wondered would you be this 20-year-old on the car right over on the car right over it's something I've always wondered no I mean this the kid has a great career right but he's taken a lot of flak lately he's been uh you know the first thing about what was six months ago he got caught in a Brazilian wh house coming out of that like they took the pictures of him and he's like he had his little cool ball cap on down but you can still tell it was him cuz he his little legs and then uh and then he got punched in the face by Orlando Bloom like punched out by Orlando Bloom right after Comic Con and I had just seen Orlando Bloom and I was like dude",
            "start": 86.56
        },
        {
            "text": "cuz he's little legs and then uh and then he got punched in the face by Orlando Bloom like punched out by Orlando Bloom right after Comic Con and I had just seen Orlando Bloom and I was like dude if you had done that before I wish you didn't punch me in the face I'm like man punch me in the face Orlando Bloom you're so beautiful I'm British um but the kid's taking a lot of flack but he's super talented right so I'm going to what he's millionaire but you know he's going to self-destruct knowing all that would you be him yeah so he's already self-destructed I mean he's on that thing but that's kind of what he was from the not from the beginning but from almost the beginning he was you know that that self-destruction Hollywood whole thing but I think everyone hates him you know it's like an easy win to like make fun of Justin Bieber and everyone jumps at him I'm not a fan of his music I'm not a fan of like his acting like baby baby yeah I'm not I'm not a big fan of that stuff but I I",
            "start": 127.48
        },
        {
            "text": "an easy win to make fun of justin bieber and everyone jumps at him i'm not a fan of his music i'm not a fan of like his acting like baby baby yeah i'm not i'm not a big fan of that stuff but i i do respect the fact that i think that he's more talented than a lot of people give him credit for like he can actually play a lot of instruments like he plays guitar he plays drums and he can do all these things that takes skill you know and it's it blows me away in people like oh he's a talentless little little prick and blah blah blah and i'm like he's probably a little prick but he's not talentless he's got talent i mean the thing about i mean the answer is for me 100% yes yeah of course you'd want to be him but wouldn't you you're going to be him like you're not going to be you anymore like i'll clean up his act from right now for the rest of his life which might end in a drug overdose one day wow",
            "start": 165.72
        },
        {
            "text": "Would You Be Justin Bieber? -  The GameOverGreggy Show Ep. 42 (Pt. 4)\nis where be him you're going to be him like you're not going to be you anymore like I'll clean up his right now from right now for the rest of his life which might end in a drug overdose one day wow you're jumping to some conclusions aren't you does he do drugs has that been confirmed I don't know I mean even though did do that great deposition did you see that deposition did that was awesome oh my God where he's like telling the lawyer off and don't talk about Selena even like a deposition I'm what do you mean he being deposed I don't remember hats hats he got a hat fight wear hats he wears those pants he wears like they're not pant if I can't change it then no I guess do you want to or would you what is the question I like my life a lot I wouldn't give up my life if I said Greg you're going to stop in you you get the opportunity remembering that you were Greg but you can't really like oh God no that's a nightmare no way if you can remember that it used to have all this but I can't",
            "start": 211.32
        },
        {
            "text": "going to stop in you you get the opportunity remembering that you were Greg but you can't really like oh God no that's a nightmare no way if you can remember that it used to have all this but I can't change the horrible Justin Bieber yeah choices he makes I thought it was just like I wouldn't trade being me to be him yeah that's what I'm saying but like wanting to just I mean would I be okay to have what he has I'm not saying anyone of course everyone wants to be a millionaire and everyone and everyone knows who you are and you're I'm talking like right now he knocks on your door and you guys just Friday something in that's not even the same question that's not even the same question Savage you know what I mean Lindsay Lohan what was it called training no switching places Friday it's true it was Freaky Friday okay let's just get back on track based on the original thing you proposed of me jumping into Justin Bieber and just becoming Justin Bieber and not remembering Greg Miller or no I'm",
            "start": 249.72
        },
        {
            "text": "it was REMC no okay let's just get back on track based on the original thing you proposed of me jumping into Justin Bieber and just becoming Justin Bieber and not remembering Greg Miller or no I'm not going to do any of that stuff and I'm not going to but now you'll know that you sort of did it but you won't be able to like you will you'll be in his life you'll be him you'll have his addictions you'll have his problems but you'll you know you remember you made the conscious choice and you do know that Greg Miller exists I do I do that I don't want to do that wait okay what if he gets to be Greg Miller no that'd be fascinating oh my goodness I don't think he he couldn't exist cuz he's how much patreons for that I want to see Greg Miller in those little 30,000 uh and Justin Bieber switch places can you beat Justin Bieber for Halloween no I can't pull that off it'd be a terrible costume I hate the **** shitty ass costumes people put on like what are you I'm Justin B we're going to",
            "start": 295.12
        },
        {
            "text": "places can you beat Justin Bieber for Halloween no I can't pull that off it'd be a terrible costume I hate the **** shitty ass costumes people put on like what are you I'm Justin B we're going to have to talk about that I'm head like you don't look anything like Justin Bieber but you **** suck you **** suck offend need to save that topic that was going to be my Halloween topic as we get closer to Halloween is I cannot stand when people have to explain their Halloween costume to you and it happened one year my like it was like the third or fourth year I worked at IGN everyone came as Infamous characters and I was like okay that first off that was me I organized that group everyone was three people including me there only 15 people at that party so it was a vast majority of people were like see I can't be held responsible that you don't understand video games or care did you get Caleb's Eco costume no of course not you didn't give him **** you the but everyone got my Die Hard",
            "start": 341.76
        },
        {
            "text": "like see I can't be held responsible that you don't understand video games or care did you get Caleb's Eco costume no of course not you didn't give him **** you the but everyone got my Die Hard costume and they're like oh you're John McClane from Die Hard because you chose something that everyone would then Damon walked in his bear Jew and they're like there's two John M that was Die Hard too that is one of my favorite photos though of you rubbing you and Damon rubbing lotion on each other it's amazing yeah I was like any more baby oil that was back when you you're not going to find the why didn't you just Google Judge Reinhold Kevin Savage well not your whatever for his Al photography you have chimed in on this I'm just no that's simple I mean yeah the money and stuff it's cool but I mean if I have to have his drug addictions and yeah deal with I don't know if he has drug addictions you said that earlier your thing all his demons will say I'm just going to go and put my money in",
            "start": 381.16
        },
        {
            "text": "if I have to deal with his drug addictions and yeah, deal with I don't know if he has drug addictions, you said that earlier. Your thing is all his demons will say I'm just going to go and put my money in the pot, it says that he has something along those lines, I just don't know, that's just something I don't want to do, it's not worth the money. All right, yeah, all right, good enough, just figured this would be a short topic, it, I mean, I think it's, yeah, cuz it's a no-brainer. We have to wait what idiots like, I mean, like oh yeah, no whatever. Well, my first answer is yes, you think mine but when he started throwing up the bad stuff and I can't change it, ex you, I mean if I could jump into Justin Bieber's life and then just control it from here on out, yeah sure okay, yeah get back together with Selena Gomez stop stop doing whatever I'm doing that's bad, yeah stop being a dick work with Justin Timberlake for sure there you go it's all done that's that's I'd be JT oh JT for that come on",
            "start": 425.92
        },
        {
            "text": "Selena Gomez stop stop doing whatever I'm doing that's bad yeah stop being a dick work with Justin Timberlake for sure there you go it's all done that's that's I'd be JT oh JT for that come on son I don't want I don't want to be Justin like I just want to be his friend this is the thing back in the day you remember you kids of course were probably in your diapers NSYNC was a big deal NSYNC was sweeping the nation and it was similar to this Bieber thing in a way that it was popular for the guys to hate on NSYNC at the time right they the boy in my in my age we were of the age group that we were we were okay in my age bracket we had all been burned by New Kids on the Block you learned early on that the girls like New Kids on the Block the boys did not the boys don't sing the stuff you don't want to be a part of that you don't be associated with boy like them you don't want to try doing that stuff you do not want to be associated with a boy band that is for boy bands are for girls",
            "start": 465.16
        },
        {
            "text": "don't want to be a part of that, you don't be associated with boys like them, you don't want to try doing that stuff. You do not want to be associated with a boy band - boy bands are for girls. It really only worked for Marky Mark right? You know we want to like Guns N' Roses, we don't want to like New Kids on the Block. I couldn't get out of it. Did you see me three times trying to just stop you from even going down that list? You're listing the New Kids on the Block and you just committed that's why I love you. You know what's funny is, God damn New Kids on the Block - Bulldog over here. I said Mark Wahlberg, and then I realized very quickly that he was not the one in New Kids on the Block. Donnie Wahlberg, Mark Wahlberg was Marky Mark and the Funky Bunch, The Funky Bunch. Anyways, sorry, continue. But yes, not popular - all of us can admit the music was amazing. You're doing the \"bye bye bye\" for you. You're close, it's been a while going to be me. You know, you know what's so embarrassing? Can I just",
            "start": 510.16
        },
        {
            "text": "but yes not popular all of us can admit the music was amazing we you doing the byebye bye for you're close it's been a while going to be me you know you know what's so embarrassing can I just interrupt your stirring rendition of whatever you're saying for my story uh there is there is a CD player in my car still which I never use and it's so embarrassing when I hit the wrong button when people are riding in my car cuz CD that plays us insane no strings attached oh my God is that why you just leave it on am fuzz whenever you drive us home it's true it's just it says like am 1801 or whatever what the **** are you doing here Nick what were we just talking about we weren't ready to be NSYNC fans in my age bracket but I remember watching one of the MTV Total Request Live behind-the-scenes No, behind the scenes of some TRL finale photo shoot or whatever and they walking around interviewing all like it was all these different celebrities from TRL at tables",
            "start": 543.68
        },
        {
            "text": "scenes No behind the scenes of some total request live like finale photo shoot or whatever and they were walking around interviewing all these different celebrities from TRL at tables, like chilling out waiting to do their photo shoot or whatever. And in sync was there, and Carson Daly's like walking around doing interviews, and Justin like Carson Carson comes over like \"what's behind you?\" That's Jennifer Lopez, and he's like \"yeah yeah it is, yeah I know Jennifer Lopez.\" Like that's Jennifer, and they're hamming it up. Finally, Caron goes \"hey Jennifer,\" and she looks around, all the instinct... like and they're hiding. And I was like, I told my friend if Justin Timberlake wasn't famous we'd be friends with him, and so that's still true. That hangs, I I still hold out for the hope that one day we will be friends with Justin Timberlake. He's not going anywhere; he's a badass; he's going to be a dynamo for the rest of his life. But will he come sit in this illustrious room where",
            "start": 596.68
        },
        {
            "text": "Would You Be Justin Bieber? -  The GameOverGreggy Show Ep. 42 (Pt. 4)\n\nhope that one day we will be friends with Justin Timberlake he's not going anywhere he's a badass he's going to be a Dynamo for the rest of his life but will he come sit in this illustrious room where Aisha Tyler has been Michael Rosenbaum I mean I'm here now Alf he's got the same hair yeah just close your eyes and imagine that Justin Timberlake sitting right next to you right now how's that feel feel good about to break is that a perk we can add that's I I don't know if that's how the perks work I think we need like a million dollars to we just make one just totally half ass like yeah whatever $100,000 we can just like goddamn it no put it on right now $100,000 we'll get Justin Timberlake to come on this show right now I just want people to buy an $11 tier for Kevin to yell at me so let's set our bar there something for everyone on the GameOverGreggy Show Ladies and Gentlemen especially patreon.com game I will tell you though I was of the Mind back in the day where I was",
            "start": 638.2
        },
        {
            "text": "me so let's set our bar there something for everyone on The GameOverGreggy Show Ladies and Gentlemen especially patreon.com game I will tell you though I was of the Mind back in the day where I was like this is so stupid this boy band thing was stupid 98 Degrees boy was the one with Nick Lachey 98 degrees what was the other ones it was Backstreet Boys but there's another one Work and then thisn this 'N Sync crew came out and like one of them had like faux dreadlocks with like laces in his hair and I was like who are these kids? It wasn't Justin it was a it was Chris uh yeah JC Chasez uh Lance Bass like couldn't sing or dance and you're like what's happening with this guy he's not it was Joey Fatone oh Joey couldn't sing dance that's right Joey was always like Lance got it down oh yeah Lance could move good for him good for him uh you did have J.C. which I'm gonna say I'm gonna put right there my money was on him to break out I everyone thought he was",
            "start": 681.56
        },
        {
            "text": "Lance got it down, oh yeah Lance could move good for him, good for him, uh you did have J Shaz which I'm gonna say I'm gonna put right there my money was on him to break out, I everyone thought he was didn't work he had that single it didn't work, did not work now he's judging people doing things hey right still making money The Voice what show is he on something not voice he's on some show at one point I don't know there's like 50 of them now yeah at one point though I do remember thinking this I was like I'm going to buy this CD and start listening to it because it's funny and then what at some point it always goes from this is not funny anymore I'm legitimately actually enjoying this and I've gained an appreciation for these people's voices they can dance and I appreciate that there is some Michael Jackson influence happening here and that is radical so yeah now I'm a huge fan and then of course that led me to be a huge fan of Justin Timberlake and I've seen that man in concert by the",
            "start": 724.4
        },
        {
            "text": "Michael Jackson influence happening here and that is radical so yeah now I'm a huge fan and then of course that led me to be a huge fan of Justin Timberlake and I've seen that man in concert by the way he's a badass like his concerts are awesome did you think about talking to him about coming on The GameOverGreggy Show then uh we weren't doing it at the time but I actually got to meet him because Tim Gettys' mom no you didn't I did Tyson's Mom oh wait I've seen this photo actually yeah knows him remember I I composed well there you go then so yeah next time I'm going to get him on it $18,000 Mark now bring Justin Timberlake come on the show I'm pretty sure we can get him I mean he's not very busy no he's like running MySpace or something now something like that by Napster yeah something like that",
            "start": 765.16
        }
    ]
}