{
    "id": 257,
    "video_id": "Hu2Q8pee-w0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Crazy Planet Facts - The GameOverGreggy Show Ep. 17 (Pt. 4)",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1396508401,
    "duration": 1367,
    "transcript_chunks": [
        {
            "text": "colin is it my turn take us home so i like i like science very much now i'm not i'm not much of a math guy i'm not much of a you know a hard science guy you know i understand a little bit of it i like reading more about it about the theories i like chemistry especially in physics i think those are very interesting but i also like astronomy a lot and i've always been really fascinated by specifically the planets in our solar system and as you grow up you're kind of fascinated by them right you're kind of fascinated by space and astronauts and all this kind of stuff space travel obviously we're all kind of nerdy we like sci-fi a little bit to varying degrees and so i have a very simple question for you is like what's your favorite planet eurasia's gotta get it out there goats uranus mm-hmm earth we're on it earth it's my favorite planet it supports life we're on it it's got nice colors yeah i gotta give a shout out to earth too yeah it's a good place it's it's the most aesthetically",
            "start": 3.44
        },
        {
            "text": "earth we're on it earth it's my favorite planet it supports life we're on it it's got nice colors yeah i gotta give a shout out to earth too yeah it's a good place it's it's the most aesthetically pleasing i think we've got the most blue and the green the white i go close second mars just because there's the red planet i don't like mars Martian what's on mars we don't know right we just landed that face we got a rover yeah we got some rovers on there we got some satellites we're sending the uh suicide mission to Mars which you know we talked about but we're not sending it well yeah a private company is doing it yeah are they actually doing that yeah Mars what is it called Mars One or something like that i would say Pluto but not anymore now i know you hear about Pluto great episode of Nova about Pluto and how it was removed from being a planet what really is annoying Saturn with its high flute and **** oh i got a ring around me everybody look at me",
            "start": 50.48
        },
        {
            "text": "Pluto great episode of Nova about Pluto and how it was removed from being a planet. What really is annoying Saturn with its high pitch and **** oh I got a ring around me everybody look at me do something that's so cool it's just ironic though because like yeah but four planets have rings around them, but we just couldn't see them. Yeah you know Saturn's are so prominent Jupiter has rings Uranus has rings and Neptune has rain. Jupiter is the biggest of all the planets right yes by far yes you can fit all the other planets in Jupiter yeah big shout out to Jupiter for that. Big shout out to Jupiter. Jupiter is a might be a failed star it might have been a binary system I also have the coolest name Jupiter yeah God of War sounds badass God of War is Ares no there's Roman and Roman god yeah um yeah Jupiter there's only one God of War was that Mario all right let's not get out of there Mars might have been the God of yeah because it's red yeah it's a red planet Jupiter was what ooh speed let's",
            "start": 90.4
        },
        {
            "text": "Jupiter, there's only one God of War - was that Mario? Alright, let's not get out of there. Mars might have been the god of... yeah, because it's red, yeah, it's a red planet. Jupiter was what? Ooh, speed! Let's look at this stuff. This will be fun, you guys. Talk amongst yourselves. Who's the messenger of the gods? That's why what's your favorite planet? Neptune - I don't know. Neptune's a good planet, you see, like underrated though. Who the... dude, who cares about Neptune? I remember in high school, I couldn't remember; I named all of them, couldn't remember Neptune started asking all my friends, \"I'm like, name all the planets,\" and like five people named all of them but Neptune - they're like, \"Oh, ****, I don't know what that last one is.\" And there you go. You know, that's why my very mother just baked me... yeah, I never needed that. It was my my what is it? My very energetic mother just bake made me... just I don't know. Can we all name them? I don't think I could name all of them - Venus, Earth, Mars.",
            "start": 134.08
        },
        {
            "text": "needed that it was my my what is it my very energetic mother just bake made me just i don't know can we all name them i don't think i could name all of them Venus Earth Mars Jupiter Saturn Uranus Neptune there you go that's that's exactly how i was going area my area i got to give a shout out to like i liked all the plans for different reasons sorry Jupiter was the uh the Zeus oh so the god of the gods the god of the gods yeah um that makes sense Mercury's cool because you know it's right it's tiny planet heavily cratered um very dense uh very close to the sun barely see it right i like that Venus is interesting because Venus has a runaway um a runaway uh what do they call it um greenhouse effect agree a greenhouse gas they have like a run away a lot of problems there too though like so Venus even though Venus is further away from the sun is actually much hotter than Mercury uh because of the runaway greenhouse effect there like that is an example of like it's like Star",
            "start": 168.96
        },
        {
            "text": "like so Venus even though Venus is further away from the Sun is actually much hotter than Mercury uh because of the runaway greenhouse effect there like that's an example of like it's like a star sound effect it's also the size of the wrong way Earth obviously we're here on Earth Mars is cool because Mars is a parallel to us and we have like a strange fascination with that planet I understand that we'll go home we could live there closest to we haven't gotten to it uh right now men haven't stepped down that's why that's why we're super stoked soon soon um then we have the asteroid belt which was a planet not anymore how long does it take to get to Mars when was it a planet nine months uh it was a planet before it got destroyed what what yeah like the asteroids aren't just there for special reasons it's the same reason why there are rings around them around the planets because those are dwarf moons did we ever know it was a planet I mean it wasn't a planet in our lifetime",
            "start": 222.0
        },
        {
            "text": "for special reasons it's the same reason why there are rings around them, around the planets, because those are dwarf moons. did we ever know it was a planet? i mean it wasn't a planet in our lifetime okay no no like billions of years ago sorry we'd die if we saw something like that and then we come to the gas giants right so now the planets are no longer made of rock and mineral, now they're made of gas. jupiter is huge, it's huge, very stable planet with a **** ton of moons, like 60 moons you know and that that to me is like awesome on its own like come on that's baller and uh and and it's got its own ring we didn't know that until we went there with i think voyager um so do we need to like redesign what we look at like all the kids at the science fairs right now are really **** up and not putting rings on jupiter no because i don't think like that's not it's the the red spot is its prominent feature you know you want to focus on the red spot of course you might be the death star",
            "start": 261.04
        },
        {
            "text": "not putting rings on jupiter no because i don't think like that's not it's the the Red Spot is its prominent feature you know you want to focus on the Red Spot of course you might be the Death Star growing up Jupiter yeah oh because yeah i see i say Saturn's cool because of the rings obviously also a ton of moons also has Titan which might be the the body other than Earth most likely to support life which is very cool um back to Jupiter Jupiter has what is it Io which is the the ice planet or the ice moon that they think might have a full ocean underneath it that could support life which is pretty cool are we ever gonna find life on any of these planets a microphone that's an R system probably not maybe Mars maybe Titan maybe Io i mean those are those are the targets but they're certainly life and others there's a lot of hot women on Venus no none nope why are they from Venus it's just an analogy well who came up with that where'd that come from Colin the guy who wrote the guy who",
            "start": 303.28
        },
        {
            "text": "life and others there's a lot of hot women on Venus no none nope why are they from Venus it's just an analogy well who came up with that where'd that come from Colin, the guy who wrote \"Men Are From Mars\" that guy was a big book in the 90s looking at some uh images here I'm looking at the uh the scale of how big Jupiter is compared to everything else it's big it's huge it's not small that's why they're saying like so when a when a star turns on it gets it gets big enough and hot enough and some people think that Jupiter was a failed star like a brown dwarf right like a star that just didn't turn on because if you think about tattoos a good example is Tatooine's in a binary system two stars right and we might have a great example and we might have we might have had a well Sirius is a real example right like Sirius is really a binary yeah but we all know Tatooine right um so maybe we would know system and then you get to the blue",
            "start": 345.2
        },
        {
            "text": "we might have we might have had a well sirius is a real example right like Sirius is really a binary yeah but we all know Tatooine right um so maybe we would know the system and then you get to the blue planets so like you know Uranus is on a nice green sea green color what's interesting about Uranus was that it was there was an ancient collision with another huge body that sent its axis on the side I like Tim can't even it's Uranus but is do you think if we had to right now lives depend on it the four people at this table would know more about the planets in our real solar system or in Star Wars I would know more about the real sols I 1000 would know more about Star Wars you know and about individual planets you can't name any of the other if you could name another can you name another planet in Tatooine's system because I can can you guys name another another another planet in that system there's another planet in that system yeah there's other planets Dantooine there's another",
            "start": 386.64
        },
        {
            "text": "planet in Tatooine's system because I can, can you guys name another another another planet in that system there's another planet in that system yeah there's other planets Dantooine there's another planet in that Dagobah where's Dagobah thereby's in the Dagobah system well that's easy Uncle Ben where's Hoth Hoth's in another system far flung Padmé Padmé is a woman but but but yeah so I feel like there's a lot of diversity in the you know I it's hard for me to pick a planet I really like Uranus' story you know a lot because there's this ancient collision with it like Uranus you know if you look at the planets that rings right you're killing me stop saying it Uranus the rings go around like normal right yeah but like Uranus' rings go around the other way like you know vertically and it's because and its axis is actually vertical so it's actually sticking out it's because it was knocked like really hard by another object it's cool that we have like so something big went into the Uranus",
            "start": 435.04
        },
        {
            "text": "and its axis is actually vertical, so it's sticking out. It was knocked really hard by another object. It's cool that we have evidence of something big going into Uranus - yeah, something really hard hit Uranus. We know it was a planet, but we've never seen it like this. It's just cool that the asteroid belt is five billion years old, and the universe is 13.7 billion years old. There's all this cool evidence about cosmic stuff that happened - that's what I'm really fascinated by. It's the same thing with the rogue planet that hit Earth back in the day, giving us the moon. We realized that because the moon is made of the same stuff as the Earth, and we only knew that when we sent Apollo astronauts there",
            "start": 479.12
        },
        {
            "text": "earth back in the day that gave us the moon and we realized that because the moon is made of the same stuff that the earth is and we only knew that when we sent the Apollo astronauts there and so what they think is I think they call it Theia, I think is the planet that knocked into the Earth probably disintegrated or kept going out of the system and then like all the dust like went around into a ring and then became the moon that's why the moon is getting further away by two inches every year because it's been you know it's flinging itself out technically you were blowing my mind right now so there's a lot of questions you're saying in 50 years we won't have the moon anymore no I'm not saying that everybody quote me and and what's so funny to me about Pluto is Pluto's a cool planet Pluto we've never really seen I mean Pluto so why why did Pluto get downgraded so Pluto's a dwarf planet because it the the the definition of planet is that it has to be a large body that clears",
            "start": 517.2
        },
        {
            "text": "pluto we've never really seen i mean pluto so why did pluto get downgraded so Pluto's a dwarf planet because it the definition of planet is that it has to be a large body that clears its orbit and the orbit of Pluto crosses into the orbit of Neptune because you guys remember when you were kids Pluto was actually closer to the Earth than Neptune was for a while then they crossed back over so because Pluto doesn't have its own elliptical orbit around the sun but rather crosses into another orbit it is not a planet plus there are bigger bodies in the outer solar system than Pluto that we just didn't find at the time Pluto is actually not the biggest dwarf planet how many planets do we know about dwarf planets yeah i think there's like 10 or 12 dwarf planets that are of some significance there's one in the asteroid belt two but you know what they like being called little planets little planets yeah yeah um but what's so funny to me is that we in 2006 we sent this",
            "start": 553.2
        },
        {
            "text": "Of some significance there's one in the asteroid belt two, but you know what they like being called little planets, little planets, yeah, yeah. Um, but what's so funny to me is that we in 2005, we sent this before Pluto was downgraded, before anyone everyone stopped giving a **** about Plut**o**, we sent New Horizons, which is a probe like a Pluto, Pluto's so tiny, Pluto's like the size of the moon. Well, we've never really seen it when you ever look at pictures of it, it's like two pixels, yeah, and like we don't really know anything about it, you know Charon or Caron, depending on how you say it is, is a is uh it's moon and we've never seen it either. We just know it's there because of like the way the planet wobbles and in fact they wobble around each other around a center, a point in the middle which means that one and the other are like not that much different in size, they actually like rotate around a center space, what's the center space is that another planet? No, it's just like a point in between them.",
            "start": 594.16
        },
        {
            "text": "one and the other are like not that much different in size, they actually like rotate around a center space. What's the center space? Is that another planet? No, it's just like a point in between them, like a central axis. But what's funny is that New Horizons is still going to Pluto, and it arrives next year really. And that's like what's so cool is that we're finally going to see this dwarf planet you know, like I'm really excited about it. What if we get there and you see cities? What proportion do they use to get something that far out in space? Is it solar? Yeah, it's solar, but like they use you know what they call gravity assist. So like they'll send, I think with New Horizons, they actually sent it into the inner solar system and then it like swings around, like it'll swing around Venus and get a gravity assistance shot. It's like certain space... I was gonna go Star Trek where they go back in time to save the whales, but what are the other Angry Birds spaces? So anyway",
            "start": 636.96
        },
        {
            "text": "around Venus and get a gravity assist, shoot. It's like certain space I was gonna go Star Trek where they go back in time to save the whales but what are the other Angry Birds spaces? So anyway, I just want to talk about the planets. Give a shot that was insane. Are you watching Cosmos? The amount of facts and names, should I watch Cosmos? Yeah, Neil deGrasse Tyson's awesome; he seems like a badass. I have such a crush on him, man. I really do. Like, he's so smart. Like I love listening to them talking. Did you want to watch Carl Sagan's Cosmos? Right, I try to it's a little dated but so good though, dude. Scientists say we'll never know what happens on the moon that's not true but uh but it's cool because it's not only about the planets in space it's about life and like how our life comes from the last episode it was really cool a lot of it was about dogs and like the diversity of dogs and how the diversity of dogs that we found are",
            "start": 674.56
        },
        {
            "text": "in space it's about life and like how our life comes from the last episode it was really cool a lot of it was about dogs and like the diversity of dogs and how the diversity of dogs that we found are only like 25,000 years old or something like that like not old at all like the wolf was 25,000 years old and then portillo is today and like everything that happened in between with dogs between like wolves and now are like happened in that short time period based on forced evolution right and they're talking about natural selection about how this happens naturally over longer periods of time it's very fascinating that's clear you gotta start watching it wait so like dogs I know dogs so not wolves not crazy stuff just normal dogs when did those first come like they were domesticated over time like what they were basically saying was like during like you know when Cro-Magnon was like roaming Europe whatever they'd have these wolves at bay and the wolves would be there",
            "start": 716.8
        },
        {
            "text": "over time, like what they were basically saying was like during, you know, when Cro-Magnon was roaming Europe, whatever. They'd have these wolves at bay and the wolves would be there; it was actually really well explained, very eloquently. Like, where they said the wolves wanted food, they were afraid of fire for instance, right? So, like, they would keep them away but then they would realize that the humans realized that the Cro-Magnon realized that they could encourage the wolves to protect them and bark and do all these things if they fed them. And then, like, created this sort of system where one is being protected and taking care of, and the others being taken care of. Like, this caused the rapid domestication of dogs from wolves out of nowhere; it's interesting. And that because they were able to natural selection happens over a huge period of time, like the Galapagos islands or",
            "start": 757.2
        },
        {
            "text": "of nowhere interesting and that because they were able to like natural selection happens over a huge period of time like the Galapagos Islands or like the finches on all these different islands right and how like they all have different beaks to deal with different things wherever that happened naturally over millions of years but the humans were able to make you know because they found like a a specific mutation and a wolf like very quickly they were able to breed that wolf and keep that mutation so it wasn't natural at all so it happened really quickly now I heard a rumor that the first wolves looked like Patalis, that's true yeah okay certainly they're all gigantic polar bears one of the things you talked about was polar bears about like the mutation that inevitably happened when polar bears have white fur technically clear fire and like that that was and that was wait what yeah and that was and that was technically a mutation like that",
            "start": 794.56
        },
        {
            "text": "\"mutation that inevitably happened when polar bears have white fur, technically clear fire and like that, that was and that was wait what yeah and that was and that was technically a mutation like that. What they think happened is that there were normal bears, like you know during the ice age, the ice caps, you know the you know the the ice sheets like went further north and south so like down to like Washington D.C. or whatever, and they assumed that like bears like at some point had a mutation where they were like where pigment like or what would you call them, um albinos, and uh that that actually benefited them because the snow like that would guard them as opposed to a black bear on white snow right and so that mutation actually stuck and that is what a polar bear is. Yeah he's crazy go back to the clear part yeah the the polar bears for I think it's technically clear right it's a little it's the absence of color no it's I think it's like translucent, like you can see through it so they look\"",
            "start": 834.16
        },
        {
            "text": "the clear part yeah the the polar bears for I think it's technically clear right it's a little it's the absence of color no it's I think it's like translucent like you can see through it so they look white because they themselves are super white I think it's because like you always see them in a white environment I'll look real quick I'm going to I've seen are you gonna get it's reflecting reflect refracting man science man I'm telling you science is cool sometimes **** I love I love studying history I just wish I wasn't so ignorant of the foundation of science where I could have I I should have paid closer attention to math because math is the foundation for everything and like you can't do **** in science without math because a lot of what a lot of people don't know about me is that when I I major in history I love history more than anything in the world and I would have definitely majored in that but I was really into botany actually like I really loved plants and like all this",
            "start": 874.64
        },
        {
            "text": "when I majored in history, I loved history more than anything in the world and I would have definitely majored in that but I was really into botany actually like I really loved plants and all this weird stuff like you can only go so far with observation and reading before you really need to get down into the chemistry and biology and stuff and I couldn't do it, sure yeah yeah so yeah I pay attention to math kids each hair shaft is pigment-free and transparent with a hollow core that scatters and reflects visible light much like what would happen or what happens with ice and snow so snow obviously is clear because it's just water but it appears white because it refracts light is what they're saying here you don't know that either no I thought snow was white, so is this guy not blue Colin? You want to handle that one, that was a doubt the sky only appeared you know the makeup of the atmosphere science man I'm happy there's people figuring that out for me shout out",
            "start": 917.52
        },
        {
            "text": "colin you want to handle that one that was a doubt the sky only appeared you know the makeup of the atmosphere **** science man i'm happy there's people figuring that **** out for me shout out to meanwhile you're debating carl's jr's double jack cheeseburger they're just remarkably smart people out there man like really like i like reading books about science like i i think stephen hawking's books are really really really good um and there's other books there's a book called the black hole war which is like excellent about the discovery of black holes and all the competing theories and stuff like that but when you and you can read those books those are layman books and i read them but man there's some books that are really technical i was reading a book about like the nuclear bomb and the manhattan project and stuff just getting really into the minutia of math and physics and particles and atoms and atomic science you know atomic math and all this kind of",
            "start": 961.76
        },
        {
            "text": "manhattan projects and stuff just getting really into the minutia of math and physics and the particles and the atoms and and atomic science you know atomic math and all this kind of like that's too much for me man yeah i wish if i can go back and change something i wish i paid better attention in math you know math god yeah math and science are what really matter i hate it man honey mad like i'm so happy i cheated through math because i don't care like that's just so crazy i'm so happy you exist but but i'm not one of the people that know it and like we can say we don't care but you know who makes all the **** money the mathematicians and the scientists you know they make all the money the engineers yeah you know like the people that like computer sciences they hate their lives no they don't i know people that i went to school i went to college with a bunch of people like major or electrical engineers and all that kind of stuff they are **** rolling in it you know and they're",
            "start": 1002.0
        },
        {
            "text": "don't I know people that I went to school with, I went to college with a bunch of people like majoring in electrical engineering and all that kind of stuff, they are rolling in it you know, and they're like totally thrilled and happy. I went to school with pharmacists that are making a ton of money. I went to school with like people that really study and really work hard you know. I loved history because it was interpretive. See, I know I know a bunch of pharmacists and doctor retired people now, and like they're just drug dealers, they seem to be happy with that because like I don't know, I guess they feel like that's what they want to do, that's what makes them happy so that's cool. I've never met someone that likes math, that's like doing accounting or something and like whatever the hell this is, the happy yeah yeah they're like I have money okay then whatever real math is accounting. I remember I remember looking at an",
            "start": 1043.68
        },
        {
            "text": "or something and like or like whatever the hell this is the **** happy yeah yeah they're like I have money okay then whatever real math is **** accounting I remember I remember looking at an accounting textbook in high school and it was like an accounting math class I was like are you **** kidding me like this is this is your debits and your credits it's so easy like maybe it gets harder I'm sure it does but like it was so easy like laughably easy now they have Excel spreadsheets yeah I think that do they matter advanced dollars was what did me and yeah advanced what algebra I'm like whatevs and then they're like oh here's this advanced **** I'm like some I somehow went all the way I think we talked about this before but I somehow went all the way up to higher math which was college level math like calculus no it was we had I did pre-algebra in the seventh grade then algebra and eighth yeah and pre-calc calc what what that's like skipping no pre-calculus calculus and then we",
            "start": 1077.76
        },
        {
            "text": "level math like calculus no it was we had I did pre-algebra in the seventh grade then algebra and eighth yeah and pre-calc calc what what that's like skipping no pre-calculus calculus and then we had higher math which was where geometry fall into that yeah I'm sorry geometry with seventh grade geometry white geometry was seventh grade seventh grade geometry I did geometry in tenth grade yeah I I basically had to cheat not cheap but like my friends helped me all the way through I was actually in like I think I had it was in physics AP Physics uh AP Biology were you like do the Hauser no I had no idea what I was doing that was the thing that mystifies me when I think back to my high school career I have no idea how I had close to a 4.0 grade point average and was like not failing every class I just had no idea how I passed a higher level college grade math I feel like in a lot of ways you and me are similar even if you don't want to admit it yeah I feel like one of us will",
            "start": 1114.64
        },
        {
            "text": "class I just had no idea how to how I passed a higher level college grade math I feel like in a lot of ways you and me are similar even if you don't want to admit it yeah I feel like one of us will destroy the other soon probably you me because I'm slower and older you're really old um but like we're really good at like not actually doing the work but looking at what work needs to be done and doing that so like for me the most work I would ever do in any class was the first week when you get the syllabus and you look at the syllabus and plan out okay this is exactly what I need to do to get an A guess what gotta **** 10 A's because that's all I did yeah everyone else stressing out about all the other stuff I'm like I just need this okay I'm going to do just this it was fun yeah that was not me I would just copy off of Clay Wilkinson's homework I had a shout out to Clay Wilkinson Clay Wilkinson used to let me copy obviously at first he was like stop and then I was like come on dude",
            "start": 1161.04
        },
        {
            "text": "not me I would just copy off of Clay Aiken's homework I had a shout out to Clay Aiken, Clay Aiken used to let me copy obviously at first he was like stop and then I was like come on dude and he would let me know I didn't know you knew him if I was invisible if I didn't Clay Aiken is running for Congress in South Carolina what yeah that's true apparently we have a dribble thing that was true there was a terrible incident like a real one or is it like I like Richard Gere's journalist I think some guy was like okay would you **** a gerbil no Avenger will go up your ass or and have no one know about it or no this is this this is the Goat Simulation from earlier today yes show but see what works here is this actually happened to Clay again and he was like you know what this did not happen to Clay this happened to him and he was like you know what I'm not going to do it I'll let everyone think it and that's what happened in his career so everyone thought he did",
            "start": 1202.56
        },
        {
            "text": "this did not happen to Clay Aiken this happened to Clay Aiken and he was like you know what I'm not going to do it I'll let everyone think it and that's what happened in his career so everyone thought he did that with the gerbil I think Tim's pulling do you know what I'm talking about here no there's a huge thing of like Clay Aiken and putting gerbils up his ass no I don't know that's a Richard Gere everything they just every generation picks somebody okay well he was picked and it's not hold on this is a conspiracy here these people are just being picked randomly there is someone giving these people options and they're choosing the option we talked about earlier okay okay that's what's happening is that someone the devil it's a losing game Colin yeah well I'm telling you Khan you got to go you got to stop the Journal of your butt well ladies and gentlemen that's how The GameOverGreggy Show works for friends come together each week bringing a random topic to the table we do one in the very beginning",
            "start": 1257.28
        },
        {
            "text": "the Journal of Your Butt Well, Ladies and Gentlemen, That's How The GameOverGreggy Show Works for Friends Come Together Each Week Bringing a Random Topic to the Table We Do One in the Very Beginning and Then Make an Awkward Call Back to It in the Very Last Second of the Show If You Like That Make Sure You Like Us on YouTube Subscribe to the Channel Share us with Your Friends Remember that if you don't want the show broken up every Friday we post the MP3 version for one dollar on GameOverGreggy.bandcamp.com You get to listen to it however you like Then over on YouTube the next week we start parceling it out day by day topic by topic until Friday we get to the big show It's all free there Don't give us any money We don't mind but go buy a t-shirt why not Tim, you like these t-shirts? Like you said, \"parcel\" Yeah that was fun Thank you I'm glad I entertained you Yeah they're fun t-shirts too Yeah exactly So Ladies and Gentlemen until next time have a great day Follow us all on Twitter Go",
            "start": 1295.52
        },
        {
            "text": "you said parcel yeah that was fun thank you i'm glad i entertained you yeah they're fun t-shirts too yeah exactly so ladies and gentlemen until next time have a great day follow us all on twitter go love yourself and your mother yeah what was it what's the what's the saying what i don't know kick the d don't kick the d you want to suck the d and kick the p the Care Bears slogan yeah interpret at your leisure you",
            "start": 1334.0
        }
    ]
}