{
    "id": 1390,
    "video_id": "wXMnp7UmfWQ",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Chris Watters",
        "Colin Moriarty"
    ],
    "title": "Chris Watters (Special Guest) - Kinda Funny Gamescast Ep. 47",
    "description": "Special guest Chris Watters joins us to discuss Star Wars Battlefront, his book The Gamer's Bucket List, We try to predict who will win big at The Game Awards 2015, Will we ever stop playing video games? (Released 11.27.15)\n\n\nCheck out Chris' book here:\nhttps://t.co/ilU68CGHok\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1449237602,
    "duration": 5650,
    "transcript_chunks": [
        {
            "text": "Hey guys, Kinda Funny is having a holiday sale. That's right, if you go to kindoffunny.com slash store for the next week from Black Friday until the next Friday, you can get 10% off everything in the entire store. That's all the beautiful shirts that you know and love. That's the cups, the mugs, the stickers, all of that stuff is there, and the Let's Him Host shirts there for this week only. You need that, you need that in your life. Oh, are these all the T-shirt Tuesday shirts that we exclusively had only on those Tuesdays? Yeah, they're back for one week only, all of them in one place. Buy them for you, buy them for your sister, your friend, your neighbor, whoever you wanna buy them for, even people you don't know. It's gonna be great, 10% off, kindoffunny.com slash store. This episode's brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six to eight items of",
            "start": 0.0
        },
        {
            "text": "brought to you by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then this is the subscription box for you. For less than $20 a month, you get six to eight items of gamer and pop culture licensed gear, apparel, collectibles, unique one of a kind items, and more. Make sure to head to lootcrate.com slash kfgames and enter code kfgames to save $3 on any new subscription. Not that long ago, and depending on where you live, not so far away, Loot Crate blasted off into a voyage across the galaxy, searching the far regions of space to find universally awesome gear. Using December's Star Wars The Force Awakens loot as the launchpad, we landed on some equally cosmic items from Halo 5 and more. With an exclusive Funko Pop and an exclusive shirt in this month's crate, this is the loot you're looking for. Remember, you only have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate, and when the cutoff happens, that's it, it's over. So go to",
            "start": 39.28
        },
        {
            "text": "this is the loot you're looking for. Remember, you only have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate, and when the cutoff happens, that's it, it's over. So go to lootcrate.com slash kfgames and enter code kfgames to save $3 on your new subscription today. The kind of funny games cast as always. I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. And today we're also joined by one half of the other coolest dudes in video games duo, Chris Waters from GameSpot.com. Hey guys. Hey, how are you? Oh, I'm great. I'm Chris Waters. I'm Tim Gettys. I'm the guy who's the coolest dude in video games. And I'm Greg Miller. And I'm Colin Moriarty. And I'm Tim Gettys. And I'm Greg Miller. And I'm Colin Moriarty. And I'm Greg Miller. And I'm Greg Miller. Oh, I'm great. I'm great. Thank you for coming to our home. It is my pleasure. Thank you for welcoming me in here. Please, it's a pleasure. What do you think? It's great. You",
            "start": 75.26
        },
        {
            "text": "And I'm Greg Miller. Oh, I'm great. I'm great. Thank you for coming to our home. It is my pleasure. Thank you for welcoming me in here. Please, it's a pleasure. What do you think? It's great. You guys keep it nice and clean, which you know, as a matter of course. That's Kevin. Someone has to still clean the house. Yeah, this week is what I said. Tonight's my night. Yeah, we'll see. Tonight, can we make it happen? Yeah. I believe in you. Thank you for coming. Okay, that's enough. Sorry. We're gonna live it on up in this country. So why are you here today? I'm here on a book tour. What? I wrote a book about video games. That's exciting. Yeah. What's the title? It's called the Gamer's Bucket List. I'm doing this. 50 video games to play before you die. The lower third is risen. People see it now. You can get it right now on Amazon. Links in the description. Good. Yeah. We're gonna talk all about that in the second topic of this show. That's a tease. In the business, we call it a tease.",
            "start": 117.66
        },
        {
            "text": "now. You can get it right now on Amazon. Links in the description. Good. Yeah. We're gonna talk all about that in the second topic of this show. That's a tease. In the business, we call it a tease. First off, we gotta get through a bunch of like, just bookkeeping and stuff. PSX, it's happening soon. PSX is happening. If you're watching this or listening to this, if you're a patron, you're listening one week before. If you're listening to this on a Monday or any day after that, you are listening to it the week of PlayStation Experience. It's here in San Francisco. December 5th is the day. That's Saturday. PSX is happening. Sony's got a whole bunch of cool stuff. Good for them. The big news, 5 p.m. Saturday. PS, I love you. XOXO. Come there. We're in the main stage, main theater. We're the only podcast there. Please come out and support us. We have a whole bunch of surprises and shenanigans ready to happen. Shenanigans. Really? Yeah, I'm bringing shenanigans in finally. So restrained.",
            "start": 158.18
        },
        {
            "text": "only podcast there. Please come out and support us. We have a whole bunch of surprises and shenanigans ready to happen. Shenanigans. Really? Yeah, I'm bringing shenanigans in finally. So restrained. All these stuffy suits in this thing. We're going to get in there and like Sean Layden will tear his scarf off and we'll tell him, this is our show now, Layden. And then yeah, Jillian's, we have a kind of funny meet and greet and partner with Just Cause 3 and Jillian's 8 o'clock on Saturday. All ages, free to get in, free food, bring money for booze. And you don't need a PSX ticket to get in. No, if you're just bumming around San Francisco and you're in for sure come, yeah. So everything's Saturday. To be clear, you need a PSX ticket to get to the podcast. We had switched gears. We were talking about Jillian's. It was unclear. If you're somebody who can't keep it straight in your head, like Kevin, yes. You need to come to PSX and see the podcast at PSX where I tear Sean Layden's scarf off.",
            "start": 197.08
        },
        {
            "text": "about Jillian's. It was unclear. If you're somebody who can't keep it straight in your head, like Kevin, yes. You need to come to PSX and see the podcast at PSX where I tear Sean Layden's scarf off. Sean Layden's scarf off. Sean Layden's scarf off. Daniel Dwyer getting in me. The spirit of the Irish, you know what I'm saying? Oi! Yeah, PSX you need a badge. Meet and greet you don't. Yeah. It's impeccable, right? Two exclusive shirts. Two exclusive shirts will be there. And they're good. They're very good. Limited quantities. Reveal them at the PSX panel for PSI Love You. Thank you for saying that because I was about to ruin this surprise, Greg. No, no surprises will be ruined. But speaking of shirts, there's also a sale going on for Black Friday, which if you're listening to this, no, yeah, you'd be listening to this either on Friday or over the week that the sale is occurring. Oh, so it's a week long sale. It's a week long sale from Friday to Friday. 10% off everything in the store.",
            "start": 234.54
        },
        {
            "text": "you'd be listening to this either on Friday or over the week that the sale is occurring. Oh, so it's a week long sale. It's a week long sale from Friday to Friday. 10% off everything in the store. And the most important thing, we're bringing back all of the T-shirt Tuesday exclusive shirts from the last year. They're coming back. There's a Let Tim Ho shirt, which is this month's T-shirt Tuesday. And I like it a lot. Are we putting that up on Tuesday? Or are we just putting that up? Putting it up on Friday. Gotcha. At the wholesale, because I don't want to be messing with people. I want them to be able to order. KindaFunny.com slash store. Is your self-esteem directly tied to the sales numbers of that shirt? Yes, entirely. Is Portillo still the best selling shirt we have though? Mm-hmm. That's where our self-esteem's at. Yeah. A loaf of a dog getting more views and more sales. Yeah, so check it out. KindaFunny.com slash store. So yes, if you want this show early, you go to Patreon.com",
            "start": 277.08
        },
        {
            "text": "where our self-esteem's at. Yeah. A loaf of a dog getting more views and more sales. Yeah, so check it out. KindaFunny.com slash store. So yes, if you want this show early, you go to Patreon.com slash KindaFunny Games Cast. Every week we talk about video games and stuff that we like. It's broken out topic by topic over on YouTube.com slash KindaFunny Games. You know the drill by now. Let's get right into it. Topic one of the day. Star Wars Battlefront. Ooh. Who here's been playing it? Me. You? You raised your hand. Kevin's raising his hand. Chris is raising his hand. Kevin, put your hand down. Colin is the only person in the room not raising his hand. So your only real experience with it was the Let's Play you did with Juan X Carpino. Right. Yes. I don't have anything to say about it. Nothing to say. You've been watching Greg play it though. Are you gonna put me? That was funny. I was pulling you out of the conversation and I brought you back. You know, I did. My whole thing on it is",
            "start": 312.52
        },
        {
            "text": "to say. You've been watching Greg play it though. Are you gonna put me? That was funny. I was pulling you out of the conversation and I brought you back. You know, I did. My whole thing on it is I'm interested in that. It's settling in a lower Metacritic score than I thought it was gonna get. And it seems like people like it, but also have complaints that it seems pretty shallow. It's not a very hardcore shooter. But when I watch Greg play it, all I can think about is like, what a waste. This would have been an awesome single player game. Look at these models, look at these environments and the places they go and stuff like what a fucking waste. That's the only thing I can think of. That's all I have to say. I'm out. Now call in. So inherent in that though, is part of you looking at it and saying, holy crap, this looks awesome. Oh yeah, it looks amazing. You just want it in that single player format. But yeah, that's the thing about this game. I was playing it this weekend when I was",
            "start": 351.34
        },
        {
            "text": "saying, holy crap, this looks awesome. Oh yeah, it looks amazing. You just want it in that single player format. But yeah, that's the thing about this game. I was playing it this weekend when I was away with some friends and anyone who was in the room was just kind of watch. And like, these are people who are not necessarily down with watching video games. And they're like, it just looks so damn good. Right. Yeah. Christine was watching me play last night while she was packing for this trip and she was looking over and she was just like, this game is beautiful. This game is spectacularly pretty. The way the grass moves on indoors, you move around. Authentic is the word that I go to. It feels so, so, so Star Wars. And I love that so much. The thing, Colin, that I want you to know is there is not like a campaign mode, but there is single player missions. Yeah, that I know, but that's not. But they're worth doing. The problem is I do wish that there was like a story that kind of brought",
            "start": 385.68
        },
        {
            "text": "is not like a campaign mode, but there is single player missions. Yeah, that I know, but that's not. But they're worth doing. The problem is I do wish that there was like a story that kind of brought you through the things and it was a little bit more, I wish there was more there, but really it is just random missions as if you were playing them out of order and without any story or context. But like they're fucking awesome. And the tutorial missions, like the Endor chase and like the X-wing thing. I did the X-wing one last night. I liked it. It's like, hey, all the fun shit that you want to do, here, you just get thrown right into it. And the survival modes, I haven't even played online at all. I've just done the single player stuff and I haven't had a great time with it. It's definitely shallow. It definitely is not a super, super deep shooter game. Like it's interesting to me that like, it feels like a old school, like PS2 era game. And the way that the weapons systems work. It",
            "start": 422.78
        },
        {
            "text": "shallow. It definitely is not a super, super deep shooter game. Like it's interesting to me that like, it feels like a old school, like PS2 era game. And the way that the weapons systems work. It does feel like a Battlefront game compared to a Battlefield game, which I thought it was going to be a little bit more updated feeling than it is. Yeah. So I wonder campaign wise, like obviously a single player campaign is a whole different undertaking. That's a whole different scope of the project. What if they had done something like Titanfall where they are using the maps that you see in the competitive multiplayer using sections there and just kind of like scripting some waves of enemies and like loosely tying it together along sort of some kind of story involving an elite rebel squad or a specific imperial detachment. Like would that have done it for you? Yeah. Anything, it's just, I don't like multiplayer games. So I mean, it's just my bias against multiplayer. And I just see a studio",
            "start": 456.02
        },
        {
            "text": "imperial detachment. Like would that have done it for you? Yeah. Anything, it's just, I don't like multiplayer games. So I mean, it's just my bias against multiplayer. And I just see a studio as talented as DICE, obviously with a lot of online bonafides making the game. Yeah. Something that, you know, Titanfall, I mean, is another game that's clearly suffered at retail and in longevity because of its lack of single player functionality in terms of like something meaningful. I mean, just because you can play a game by yourself doesn't mean it has a campaign or something that's worth delving into. I mean, this is not the spirit of the game though. So I understand that I'm looking for something that's not really there. But what I had mentioned on Colin and Greg, which I think would be fun and interesting and something that maybe they'll consider doing is like now the assets exist. Now this engine's obviously running in this particular way in this particular universe. Why not let, you",
            "start": 502.9
        },
        {
            "text": "and interesting and something that maybe they'll consider doing is like now the assets exist. Now this engine's obviously running in this particular way in this particular universe. Why not let, you know, they're clearly gonna, they already said they're gonna make more battlefronts. So why not let DICE continue to do that and shift that shit off to another studio that can make, that can take a lot of those assets and just make a single player campaign for the next game or whatever. Because it's, I really feel like Battlefront is going to not benefit from having, not having a robust campaign in the same way that people complain about Titanfall. It's just that it's Star Wars, so it's going to sell 15 million copies or whatever and be totally fine. It's just, you know, I think there's more that could have been done here, especially considering the game isn't quite as deep as I expected it to be from, anecdotally from what I've been hearing from people. Like those are the two things I",
            "start": 536.42
        },
        {
            "text": "that could have been done here, especially considering the game isn't quite as deep as I expected it to be from, anecdotally from what I've been hearing from people. Like those are the two things I hear is there's just not much meat on the bone and it's not very hardcore. You know, like it's a very casual kind of shooter. And compared to some of the other shooters, people play like COD or something like that. Well what's interesting is like, is that good enough, right? Like you, I'm right there with you. I don't play multiplayer games, right? That's not really what I get into. I don't get into shooters all that much either. And like, it was, I forget what trailer it was where we were watching it. I was like, damn, that actually looks kind of interesting. And then I watched you guys do your Let's Plays, like damn, that looks fun. And then when it got here and I popped it in, for me, and like, I gotta pull back at the curtain here. Like right now we're recording this right before",
            "start": 572.58
        },
        {
            "text": "do your Let's Plays, like damn, that looks fun. And then when it got here and I popped it in, for me, and like, I gotta pull back at the curtain here. Like right now we're recording this right before Thanksgiving, right? So I'd beaten, I'd Platinumed Fallout and then it was like, I don't want to start Tomb Raider yet because I'm going away for Thanksgiving. So what do I, oh yeah, Battlefront. Oh, Battlefront, sounds great. And now it's just like, yeah, I pop in, I play a match and then somebody needs me for something else I go do something. Or I sit there and like the night one, Kevin and I sat down and played like the hours melted away. I haven't had that experience in a while where Christine came out and tapped me on the shoulder. I'm like, yeah, what's up? She's like, I'm going to bed. Like what, what time is it? What are you talking about? I'm like, all right, cool. I'm like, I'll be in a little bit. And then it was another, it was another two hours before Kevin and I were done",
            "start": 599.4
        },
        {
            "text": "Like what, what time is it? What are you talking about? I'm like, all right, cool. I'm like, I'll be in a little bit. And then it was another, it was another two hours before Kevin and I were done because he wanted to get his jet pack. And it was just like classic Kevin. You got to get that jet pack. I'm missing it so bad from the beta. Oh, it's the best. And that's the thing is like, it's just right now, it's that perfect level of like, it is, it is definitely a light, you know, first person shooter. It isn't, you know, getting in and trying to play Call of Duty or something online for me, which has been a turnoff. But this one is I'm getting in, I'm competitive, I'm there and I feel like I'm making progress and I'm having fun and I'm just playing Deathmatch. I haven't tried any last night, Christine was watching. So when does somebody become Vader? I'm like, ah, it's a different mode. Not even now, I'm just running around shooting stuff. You're not trying to fly X-wings? No, I'm",
            "start": 631.04
        },
        {
            "text": "night, Christine was watching. So when does somebody become Vader? I'm like, ah, it's a different mode. Not even now, I'm just running around shooting stuff. You're not trying to fly X-wings? No, I'm just running around shooting stuff for now, having fun, trying to unlock that Han blaster everybody has, that's awesome. Well, I stick there, but it's like, there's something, it's easy enough to wrap your head around and get good at and go. Now, the thing about it is when I come back, maybe by the time this posts, am I still playing Battlefront? I don't know, you know what I mean? Have I moved on to something else or is it still that fun Bazooka Joe distraction, right? Of like, well, I got 30 minutes, why not play a little bit? I think it's an interesting, occupying an interesting space because it is a big budget, triple A shooter, right? And the other ones you see sort of in that space, your Halo, your Call of Duty, you know, those games, like those games are intimidating to people, I",
            "start": 663.38
        },
        {
            "text": "it is a big budget, triple A shooter, right? And the other ones you see sort of in that space, your Halo, your Call of Duty, you know, those games, like those games are intimidating to people, I think. Those games are, oh man, like, what do you think of, if you're someone who doesn't play multiplayer shooters a lot, you know, those have the strength of a campaign going for them. But in terms of like competitive play, in terms of a multiplayer shooter kind of pace and feel, I think that Battlefront casting the net wide is a great thing. I think that people who see these commercials of the X-wing coming up outside of a building and like jumping out, like I think those people exist in the millions. Like I have like maybe like 10% of my friends that I grew up playing with video games still actively play video games today. But a lot of them are like all of a sudden texting me about this game, about Battlefront. Same thing with me, my friend Po, right? Who doesn't own a current gen console,",
            "start": 695.94
        },
        {
            "text": "play video games today. But a lot of them are like all of a sudden texting me about this game, about Battlefront. Same thing with me, my friend Po, right? Who doesn't own a current gen console, hit me up, he's like, so is this Battlefront game gonna be awesome? Because he's a Star Wars fan and it looks awesome and it's right there for him. And so yeah, it is awesome for him. And I think that the visual spectacle, the fact that it is so Star Wars, the fact that it's backed by dice, like it just sounds incredible. And then also, you know, there are bullet tracers and stuff you can see in Battlefield, but seeing blaster fire, like that just gives, like the fact that it's a neon line streaking across, it just gives the battlefield such a great feel. I think that it's a success in a lot of ways and I've been having a good time with it, but yeah, it's a good question. Am I gonna be digging it in two weeks? I don't know. And that's the thing, that's the thing that I honestly don't have an",
            "start": 737.8
        },
        {
            "text": "and I've been having a good time with it, but yeah, it's a good question. Am I gonna be digging it in two weeks? I don't know. And that's the thing, that's the thing that I honestly don't have an answer for. I would think no, that I'll jump in and I'll go into Tomb Raider and then play more Assassin's Creed and da-da. But I still, I'm gonna have those moments where it's like, I got 45 minutes. Like what do I, you know, I'm not gonna go and try to do something in Tomb Raider. I could easily sit here and do that. And it's fun because, it's interesting I should say, because like the night one when I was out there and you were talking to me about it, Colin, right? We were having this conversation about multiplayer shooters and how there's no story. And I was saying, well you know, I've always thought part of multiplayer shooters is taking these maps, these basic tools, and making your own story, right? And I think that's part of those moments you remember. And now as I go back to these",
            "start": 775.58
        },
        {
            "text": "thought part of multiplayer shooters is taking these maps, these basic tools, and making your own story, right? And I think that's part of those moments you remember. And now as I go back to these maps for like the seventh, eighth, dozenth time, you know what I mean? It is that thing of like, oh, remember when I had that kill streak right over there? So if I run over, oh wait, and there's a guy who always hides over it, you know what I mean? Like getting those little things of like, fuck, I'm enjoying this and like totally starting to love like these little things about it. That's cool, but that's not, the thing about, I mean, that is cool. And I love watching these little vines people put up or these short videos of people I saw someone, I think it was Ryan Albert put up a video of Luke force pushing a snow trooper into a tie fighter, which I like that was flying by. And I was like, that's fucking cool. I mean, there's a lot of cool moments, but what you're saying is not unique to",
            "start": 806.48
        },
        {
            "text": "force pushing a snow trooper into a tie fighter, which I like that was flying by. And I was like, that's fucking cool. I mean, there's a lot of cool moments, but what you're saying is not unique to Battlefront. And so that's a unique thing to just any game you play online. So it's, I'm curious as an outside observer, I'm a huge Star Wars fan. I'm a fucking massive Star Wars fan, but as an outside observer who has no interest in playing this game, I'm interested in two things. I'm interested in seeing the legs on this game. The game's clearly gonna sell, but we saw a significant, again, Titanfall is really the ancillary to this in terms of a game that had no single player offerings that made people wanna keep the game for a long period of time. And I know that people point at Call of Duty and are like, well, who cares about the campaign? Well, a lot of people do. When we talked to the guys that I played the campaign in Call of Duty every year, I have for years. So it's like, that's all",
            "start": 835.76
        },
        {
            "text": "are like, well, who cares about the campaign? Well, a lot of people do. When we talked to the guys that I played the campaign in Call of Duty every year, I have for years. So it's like, that's all I play. I don't care about anything else. So, cause it's like, I always say, it's like my weekend action movie and they're fucking finally made games. But when we talked to the guys from Sledgehammer at when we did GameStop Expo, they were like, well, you'd be surprised like how many people were actually like you. And I was in the minority and they're like, our statistics show that it's actually more than you think. So I'm interested to see the legs of this game. And I'm also interested to see as a side of that, how people are already reacting very negatively to the season pass, not surprisingly. And a game that is seemingly somewhat shallow on the outside are gonna be injected with a lot of content. Now it's gonna rub people the wrong way. So I'm interested to see how that all unfolds. But",
            "start": 877.4
        },
        {
            "text": "And a game that is seemingly somewhat shallow on the outside are gonna be injected with a lot of content. Now it's gonna rub people the wrong way. So I'm interested to see how that all unfolds. But I'm also interested to see now that the text there, the text been there, I mean, DICE is using, familiar engine and stuff like that. But now that the, like we said, the universe is there and the confines of the Star Wars universe are there, how bulky will the next game be? Because they have a lot of shit that's done already and how much will they be able to expand now with episode seven and Rogue One and all that kind of stuff that they are able to inject in this game when the time comes. So I'm, as an outside observer, I'm just interested to see how this does. Cause this is clearly gonna make a lot of money, but is it going to win a lot of goodwill from the gamer in the long run because of its shallowness when there are more hardcore shooters out there? Cause you look at Call of Duty, I",
            "start": 911.5
        },
        {
            "text": "a lot of money, but is it going to win a lot of goodwill from the gamer in the long run because of its shallowness when there are more hardcore shooters out there? Cause you look at Call of Duty, I have not played the new Call of Duty yet in any substantial way. I did two videos for our site, but I have not sat down and played it. But it has a campaign, it has zombies mode, which is gonna be awesome. And it is awesome for a lot of people. And then it has a whole online suite and it's the same price. So it's like, you know, you have to, and the online component of Call of Duty is certainly deeper, just that section. So it's, I can understand why people are a little upset or a little skeptical. But what's interesting is back to the question of will they vote with their wallet? And it's also back to the financials of EA, right? They've got me and on paper, I shouldn't give two shits about this game. I don't like multiplayer games and Star Wars is fine. You know what I mean? Like you guys",
            "start": 941.12
        },
        {
            "text": "back to the financials of EA, right? They've got me and on paper, I shouldn't give two shits about this game. I don't like multiplayer games and Star Wars is fine. You know what I mean? Like you guys were like, let's do, let's watch each movie and do a review. I'm like, I don't wanna do that. I don't wanna watch them again. You know what I mean? But like, I enjoy it. I like it fine. I'm not like a hater, but it's like, I'm into this game, impose into this game. And your friends are asking you about this game. So it's like, if they bring those people in, then we get down to the fact of like, yeah, what if then the people who are like complaining right now, it's not that deep data, if they stick around. Think about how many people stuck around with Destiny when that was, that was vanilla, right? And not that they're the same thing. Obviously there was customization in Destiny, this, that, and the other. I'm not saying exactly the same thing, but if you get over that hump and you stick",
            "start": 977.44
        },
        {
            "text": "right? And not that they're the same thing. Obviously there was customization in Destiny, this, that, and the other. I'm not saying exactly the same thing, but if you get over that hump and you stick with it, maybe it works out. I don't know. I think there's a question here about like, what keeps people engaged in a shooter? Is it a deep unlock tree? Is it being able to prestige over and over again? Is it a hardcore mechanics? Like something that you would see, I guess, in a battlefield, you know, in terms of like the, just the interplay and the drastically different roles you can play within that game. Or is it like for, so for Battlefront, what would its longevity look like? It would look like someone who has 30 minutes, 45 minutes one night, just being like, look, I want to get in there. I want to blast somebody. I want to like get in an AT-ST for a hot minute and blast some people and get blown up and then be done. Like, I think this is like, but I I'm immersed in this rich world",
            "start": 1008.64
        },
        {
            "text": "I want to blast somebody. I want to like get in an AT-ST for a hot minute and blast some people and get blown up and then be done. Like, I think this is like, but I I'm immersed in this rich world of Star Wars. And I think that that is a value at that we shouldn't discount in terms of people's ongoing satisfaction and enjoyment with the game. Like people are going to be hyped about Star Wars well through December, well into the new year. And even though it's, you know, the new trilogy, still they're going to be coming back to that old, like Star Wars feel to like have their lightsaber moment, you know, have that stuff. I think I wouldn't be surprised if we saw a little more longevity out of this than Titanfall, just because of the Star Wars appeal. Yeah. I mean the license, I think is the most important part. And that's, I think why it's so shallow of a product. The fact that so much attention was given to the little things and to the beams and to the music and to the, like the look",
            "start": 1046.08
        },
        {
            "text": "most important part. And that's, I think why it's so shallow of a product. The fact that so much attention was given to the little things and to the beams and to the music and to the, like the look of everything that like each map needs to be exactly right. And it is, you know, and like I think that that's where the DLC is going to come in and I give those people that the new little fresh, like, Oh cool. None of the reasons you just play for a week, especially like the release in the Jack or whatever planet in December, right? When people are gonna be watching force awaken, seeing that planet for the first time, like people can be stoked. Yeah. It's, you know, for Titanfall, which was a hardcore shooter, right. In terms of like the skill trees and this, that and the other, like for me, it, I remember when I regen the first time and like, it was such a turnoff to me, you know, that it's prestige or whatever. And then you start back at zero and then it's like, all right, to get to the",
            "start": 1086.16
        },
        {
            "text": "I remember when I regen the first time and like, it was such a turnoff to me, you know, that it's prestige or whatever. And then you start back at zero and then it's like, all right, to get to the next level, do this. You have to get like 50 shotgun kills and this, that and then I was like, I don't want to do this. Like I was progressing and making something. So like right now I am set on getting to level 15, getting my jet pack, but more importantly, being able to buy the head with the girl who has the ponytail. That's what I want. I want out of the stormtrooper helmet and this weird ass helmet the rebels have. And I want my ponytail bopping around. You know what I mean? Like that's totally goofy and shallow weird. But like at the end, when I have it, where I've unlocked the jet pack, the ponytail, whatever else I talk about a Twilight here. Is that what you're talking about? Wraps around. That's what you're talking about. It's just a totally normal girl ponytail. The crazy heads are",
            "start": 1122.34
        },
        {
            "text": "ponytail, whatever else I talk about a Twilight here. Is that what you're talking about? Wraps around. That's what you're talking about. It's just a totally normal girl ponytail. The crazy heads are way later. I just want a ponytail. That's like level 40. I'm like that's deep. That's a deep investment. When Adam Kovik was here, we made, we, we chose for both this. I'm just like some 55 year old old lady running around the blaster and I want her. I love that they have these old people. They've seen some shit man in the empire. They got to know what's up. Yeah. I think, I mean, I think to the points you guys are making, I think that the game was, I don't want to say focus tested because I'm not sure it was, but we, but it was definitely, it's definitely a lowest common denominator shooter. And I think that's, what's going to, at least that's my impression of it. And I played, I mean, I played it for that time on a let's play. I was way too good at it considering that I'm not a",
            "start": 1154.7
        },
        {
            "text": "shooter. And I think that's, what's going to, at least that's my impression of it. And I played, I mean, I played it for that time on a let's play. I was way too good at it considering that I'm not a multiplayer guy. So I'm like, yeah, this is, this is, you know, I'm not saying I was great at it, but I'm like, I I'm, this is not Call of Duty. Didn't feel good to be good though. No it did. And that's the thing. I think you're right. That this probably is a more casual game aimed at a more casual audience. It's not an insult. It's to say that, yeah, this is probably the void it's trying to fill. And I think it's going to fill it very successfully monetarily. And we'll see like, you know, Star Wars is definitely going to benefit from, you know, being part of the light guys for the next six years. So it's not like people are going to forget about it. And then it will have more legs and tight folks, tight fall and sell very well. So it's, this is certainly going to proliferate more than",
            "start": 1190.9
        },
        {
            "text": "years. So it's not like people are going to forget about it. And then it will have more legs and tight folks, tight fall and sell very well. So it's, this is certainly going to proliferate more than that game, but yeah, I'm just, I also understand people's reservations about it. And I do think the season passion is getting a little out of control now. And people are going to speak with their wild and buy these things. And that's great, but there is something unsavory about it, but it's the same way I felt about Batman. And, and it's, you know, so I get people's complaints about it as well, but is it, does it look fun in like, kind of just, even if it's a femoral, it still seems like something that's, that's, you know, there it's fan service over the top fan service at the end of the day. I mean, the battle of Hoth is fun, but I'm also like, why are there a wings and tie interceptors here and show like, what is going on here? You know? So it's, it's, it's a lot of, no, I am definitely",
            "start": 1221.78
        },
        {
            "text": "I mean, the battle of Hoth is fun, but I'm also like, why are there a wings and tie interceptors here and show like, what is going on here? You know? So it's, it's, it's a lot of, no, I am definitely not. I guarantee you knowing Star Wars nerds like I do, I am not the only one that's wondering why, why there's X-wings fighting, you know, when we have snow speeders fighting, cause they're atmospheric craft snow speeders can't go into space, Kevin. So it's. Especially when the tie fighters can just fly over the snow speeders and shoot them. Cause the snow speeders can't go real high. So it is like, it is like a, it's like something Colin would have made up when, you know, when I was, you know, eight years old and playing with my toys or my, my, you know, my blocks and making these like, that is what it is. And that's awesome. It is awesome. But at the same time, what I, we've seen the battle of Hoth so many times, you know, in, in, in rogue squadron games and all that kind of stuff.",
            "start": 1256.34
        },
        {
            "text": "that is what it is. And that's awesome. It is awesome. But at the same time, what I, we've seen the battle of Hoth so many times, you know, in, in, in rogue squadron games and all that kind of stuff. It's like these are, and going back to the PC games, and we've seen these battles many times. So it's hard for me to say, like, I would like to do that again, but I'd like to do it again. And I would like to just do the ad-ads and the snow speeders and just have it out as opposed to this maelstrom of nonsense that's basically going on over the planet. It's like insane. It's like completely insane. Vader's like running around, Luke's running around, dressed as he's dressed. It looks like in Jedi. It doesn't make any sense. Don't we understand that, Kevin? I think he has his green lights there, but we shouldn't even build until Shadows of the Empire. Have you, how do you feel about the Emperor's move? His mobility? Have you seen this move? So his move is like a dash. Well, yeah, so he's",
            "start": 1291.56
        },
        {
            "text": "but we shouldn't even build until Shadows of the Empire. Have you, how do you feel about the Emperor's move? His mobility? Have you seen this move? So his move is like a dash. Well, yeah, so he's walking around, but he has a dash move that's like a psycho crusher. Like he's like M bison. He just twirls and like, but he's wearing a long cloak. So it like furls out all around him. Like he's doing some sort of pirouette. It's the silliest looking thing. I laugh every time I see it, but it's kind of delightful. Well, he's down there fighting on Hoth. He doesn't have anything better to do with this. Yeah, exactly. You know, it's good for true morale to see the big brass getting dirty. The one thing that I'm happy about, like talking about the casual thing, is I think that they nailed the getting people to the fun parts fast and having them, have it be pretty easy to understand and grasp and do cool shit. Like when you're flying the X-wing, it just makes sense. And you can, you're like,",
            "start": 1327.7
        },
        {
            "text": "people to the fun parts fast and having them, have it be pretty easy to understand and grasp and do cool shit. Like when you're flying the X-wing, it just makes sense. And you can, you're like, there's a, in the tutorial missions, there's like a canyon run thing you do. And it's like, you start getting ballsy and like trying to find little holes to squeeze through and like turn the ship and stuff. And it's fun. And the same thing with the indoor chase and like all the, and you can just jump in and play as Vader or the Emperor and just fuck shit up. And it's like within five minutes of turning the game on, you could play as Vader if you want, just fuck things up and understand how to do it. And the controls are pretty simple. Well, if you get lucky and grab the little blue ghost coin faster than your teammates do. Well, no, no, I'm talking about like in the missions. Oh, in a different mode, yeah, you totally can. And it's like, that's cool. I like, cause I was worried that you'd have",
            "start": 1366.74
        },
        {
            "text": "than your teammates do. Well, no, no, I'm talking about like in the missions. Oh, in a different mode, yeah, you totally can. And it's like, that's cool. I like, cause I was worried that you'd have to fucking level up and do all this other shit. Oh yeah, yeah. I had a fun battle between Luke Skywalker and Boba Fett. There's a mode where you choose a hero and then you have like, you play like one-on-one versus AI or versus your buddy. And then you have like AI people accompanying you. You have your like squad you're fighting with of just random soldiers. And then it's like kill confirmed in Call of Duty. They drop tokens, you have to pick them up. But like we're inside this hangar. And so like Boba Fett, obviously super mobile, jet packing all around. But Luke is actually also quite mobile. He jumps really high and it was just this like epic duel of Fett versus Skywalker, like trying to pin each other down and like totally absurd, but I don't know how, I don't know if I'm like, that's",
            "start": 1400.22
        },
        {
            "text": "He jumps really high and it was just this like epic duel of Fett versus Skywalker, like trying to pin each other down and like totally absurd, but I don't know how, I don't know if I'm like, that's gonna be fun five times. Yeah, yeah, yeah. It was fun once. Yeah, no, that's a good point. And again, Luke never even encountered Boba Fett. So I'm just saying. Non canonical. Doesn't when he gets eaten by the pit, remember? And remember that Boba Fett of course was a clone who was in the program. Doesn't he reflect the blood? Oh, right, yeah. I was gonna say, I thought that was Han though. I know what. I heard that Han shot first, was it? Yeah, he did. Did you hear that Boba Fett is just a clone that is in program. There is a trophy in superstar Wars on PS4 and Vita for Han to shoot first a Greedo in the game and then the parentheses says, yes, it's possible. And I don't think anyone has it yet. That's awesome. See how it goes down. Yeah, no, I'm just always being facetious. There's a",
            "start": 1436.62
        },
        {
            "text": "a Greedo in the game and then the parentheses says, yes, it's possible. And I don't think anyone has it yet. That's awesome. See how it goes down. Yeah, no, I'm just always being facetious. There's a shoot first silver in a battlefront for getting the first kill. I got it. Good. All right. Killed myself. So Chris, you wrote a book. I wrote a book. What's it called? It's called the gamers bucket lists. Where can people get it? 50 video games to play before you die. Get it on Amazon at the link right here. It's in the description. I think Greg is gesturing to. Or you just go to Amazon, you search. It's there on Amazon too. Yeah, it's in my Twitter profile as well, CT waters. You can find the link there. It's a list book. Good, there's two things I love, lists and video games, not books. I was about to put books in there. This is two out of three though. Yeah, so we're good. Maybe open your eyes to some books situation. This one I will, it's a list. Yeah, so basically I got this",
            "start": 1483.46
        },
        {
            "text": "I was about to put books in there. This is two out of three though. Yeah, so we're good. Maybe open your eyes to some books situation. This one I will, it's a list. Yeah, so basically I got this opportunity to write this book through a publisher and they were like, yeah, you're just gonna have to pick 50 video games from all video games ever and make your list based on sort of what parameters you want it to. Did you say no problem then hang up and go, this is a huge problem. Like, oh my God. Yeah, I mean, I'm sure we've all written lists in our time. Once or twice. So the key is to like, you have to like set your parameters. Like what am I going to put in this book? So the stuff that I wanted to put in was like I wanted to write it in a way that you guys would read it and you'd read about Red Dead Redemption. And even though you've played that game, you've read so much about it, you'd read it and be like, yeah, that game was really awesome. But then also you pass it to your mom when",
            "start": 1527.16
        },
        {
            "text": "Red Dead Redemption. And even though you've played that game, you've read so much about it, you'd read it and be like, yeah, that game was really awesome. But then also you pass it to your mom when you're home for Thanksgiving. And she's like, it's a cowboy game. She reads like, she reads 300 words about it and she like kind of understands the experience. Like there's no, I steer away from like jargony terms. Like I didn't mention the word rogue-like when I wrote about Spelunky, you know, like I wanted this to be super accessible because that's kind of a niche that it is like, it's like 12 bucks, like Barnes and Noble's going to, like it's the kind of thing that I imagine is put by a register and people are just like, Oh sure, my kid likes video games. Yeah. Yeah. And so I think that like, so it's that broad, it's a broad appeal kind of book. It's not, it's not a history lesson per se. It's not a sort of here are like the most significant games in history and you know, if there's a",
            "start": 1568.4
        },
        {
            "text": "so it's that broad, it's a broad appeal kind of book. It's not, it's not a history lesson per se. It's not a sort of here are like the most significant games in history and you know, if there's a significantly awesome game and then the sequel is like a little bit more awesome, I'll choose a sequel, you know? So like, So Uncharted 3 confirmed in the book. No. No, it's Uncharted 2. Damn it. One of the restrictions I put in there for myself, for my sanity was about online connectivity. Cause I wanted people to be able to like, I want it to be somewhat future proof. Obviously any list book is kind of like immediately outdated in video game world. More or less, but like, if the primary way that like a game excels is online, I left it out. So like no MMOs, no like Call of Duty and Battlefield are like, you know, even though they have some campaigns, like primarily like my enjoyment of those games has come from the online shooting, multiplayer competition. So I left them off the list, but",
            "start": 1602.94
        },
        {
            "text": "are like, you know, even though they have some campaigns, like primarily like my enjoyment of those games has come from the online shooting, multiplayer competition. So I left them off the list, but even still it was hard to narrow it down. Yeah. So what were the parameters you set up other than online stuff? I just sat down and was like, what, like if I was going to talk with someone about like the greatest games, what would I start with? And that was another thing, like taking ownership of like, I'm the author of this book. These are all my opinions. Yeah. There's no committee to vet this against. Yeah. Like I am obsessed with Rocket League and have been since Shillong. I'm going to put Rocket League in there because I also feel like I can back that as like one of the greatest sports games ever created, you know? And so just sort of like brainstorming, coming up with, you know, a lot of them are like really popular titles, but then there's some other ones that sort of, you know, go",
            "start": 1651.52
        },
        {
            "text": "ever created, you know? And so just sort of like brainstorming, coming up with, you know, a lot of them are like really popular titles, but then there's some other ones that sort of, you know, go a little bit in different directions. Like I put her story in there because I think that that's like such a fascinating way to like feel investigative. Like there's a lot of investigation in games, but like if you're putting on detective mode and just looking for the highlight thing, you don't like feel like an investigator. Or it's LA noir where I went down the list of every name till they were like, that's the name. I'm like, yeah, it is. You're goddamn right it is. I knew it. I'm such a detective. So I wanted to, you know, put that alongside Skyrim and Civilization V in terms of just like here is the broad diversity of gaming sampled. Like you read this book, you're gonna see that there's just like so, so many awesome things about games. What were the controversial picks that you put on",
            "start": 1685.88
        },
        {
            "text": "is the broad diversity of gaming sampled. Like you read this book, you're gonna see that there's just like so, so many awesome things about games. What were the controversial picks that you put on list? Well, I haven't like received, the book is out now. It came out on Tuesday the 24th, the physical copy. I haven't received a deluge yet of like, yet, why isn't that on there? But I did put my Twitter handle in the book, like reach out to me, like, let's talk about stuff that's in there or not in there. I don't know if I, like I anticipate, okay. So I did, I was talking with some of my former coworkers on the reviews team at GameSpot, Kevin Van Orr, Tom McShea, Carolyn Pettit. And I was like, I'm putting a God of War in there. And they were like, God of War II sounds great. But I put God of War III. Nice. Much to their consternation. But like, I felt like, you know, that's a new, the next console generation. The spectacle of that series is a lot about it. You know, so like I was having",
            "start": 1726.32
        },
        {
            "text": "War III. Nice. Much to their consternation. But like, I felt like, you know, that's a new, the next console generation. The spectacle of that series is a lot about it. You know, so like I was having these arguments with myself and making it like, okay, what is the person on Twitter gonna say? What, you know, when I talked to Colin about it, what is he gonna come at me with? Like, I cannot believe that you put such and such game on there. So I did that to an extent, but also had to just be like, look, this is gonna be fun to read. It's gonna be fun to read about great games. It's not comprehensive. That is impossible. Yeah. So what, I'm curious, I have a few questions. What is the oldest game on the list? The oldest game on the list is Tetris. Tetris. And what is the platform distribution? Do you touch like everything from, so Tetris, so like NES era through Genesis, Super Nintendo, and then all the way up to PS4 and Xbox One? Yeah, so there's not a ton of Genesis, Super Nintendo",
            "start": 1770.4
        },
        {
            "text": "Do you touch like everything from, so Tetris, so like NES era through Genesis, Super Nintendo, and then all the way up to PS4 and Xbox One? Yeah, so there's not a ton of Genesis, Super Nintendo stuff. Like I also was kind of, kind of had in mind like accessibility, like, you know, not every game I write about needs to be like downloadable from Steam or something like that. But I wanted it to be kind of reasonably plausible that people were gonna get access to it. So like, I didn't put Dreamcast games on there, but that's also cause I didn't, I don't like personally have a ton of experience with Dreamcast. So that sort of fed into it. But yeah, there's like, you know, there's Super Mario World and there's a Super Metroid and Mega Man 2 from that era. But then also, you know, stuff like Super Meat Boy. So like I'm looking at, you know, platformers like Sonic that I like really enjoyed on the Genesis when I was a kid. But like, all right, what was cool about that game? Like fast",
            "start": 1814.62
        },
        {
            "text": "like Super Meat Boy. So like I'm looking at, you know, platformers like Sonic that I like really enjoyed on the Genesis when I was a kid. But like, all right, what was cool about that game? Like fast platforming, like Super Meat Boy does like precision fast platforming incredibly well. That fills this niche really well. I don't need to, you know, I don't need to go into the past to pull something from that. I try to cover my bases. I had this like Excel spreadsheet with like all these different attributes and different columns listed about the games just to try to make sure the net was covered to some degree. Did you talk to anyone, like, was it just you coming up with this or did you kind of go back and forth with some people? I came up with like maybe 80% I've had the list and then I was like, oh crap, I only have like 10 slots left and so I started asking people, my friends I mentioned earlier, some of my good friends who still do play games passionately, like what would you want",
            "start": 1859.4
        },
        {
            "text": "like, oh crap, I only have like 10 slots left and so I started asking people, my friends I mentioned earlier, some of my good friends who still do play games passionately, like what would you want to see on the list? I didn't like take to Twitter and ask or anything, but I did, you know, do research in Peru's like, all right, what games am I forgetting? What genres am I trying, like not representing? So yeah, it was mostly me, but I mean, and I made the final decision on all of it because what I had to submit to the publisher was the table of contents and then 300 words on each game and then they sort of populated the book with all these nice screenshots. Was hoping to have a copy here today, but there was some shipping goofs. God dang it, goofs. Out there in the shipping verse, but yeah, yeah, it was really fun. It's kind of like, yeah, cause like I found myself writing about these games and I'm like, okay, yeah, let me write about like brothers, a tale of two sons, which is a game",
            "start": 1902.4
        },
        {
            "text": "yeah, it was really fun. It's kind of like, yeah, cause like I found myself writing about these games and I'm like, okay, yeah, let me write about like brothers, a tale of two sons, which is a game that like really moved me personally, but then write about, you know, Skyrim and like, write, writing about that game and there's been so much said about it. You so meant so many books, blogs, videos, whatever, written about it, but writing about it again, it sort of resonated with me like, oh right, this is a game that people take for granted as one of the best games ever, but like actually writing about why it is the best, like I felt myself getting hyped for these games as I'm typing them up and I like tried to put that into the writing too, cause like I want you to read this, a passage on a game and get hyped for it, even if you know, you've played it before or if you've never heard of it. Who would it be? Yeah, definitely. Do you have any questions, Portal? I mean, yeah, it's",
            "start": 1946.78
        },
        {
            "text": "on a game and get hyped for it, even if you know, you've played it before or if you've never heard of it. Who would it be? Yeah, definitely. Do you have any questions, Portal? I mean, yeah, it's interesting. I guess for me, when we were at IGN and we would do lists, it was always the thing I hated the most, cause we would inevitably be locked in a room, Con and I would barter and trade down to get the list to where it is and then we'd bring in other people and they'd be like, what about this game? What about that game? I guess the argument was always, well, we didn't play that so we can't back it or whatever. You know what I mean? But like I said, when it's just your list, it's pretty easy. Yeah, when it's your list, like the buck stops here. I didn't put this one on there because I had some reasons or cause, oh, it just filled up. I don't know, you know, there's no sort of like, there's no consensus that needed to happen. And so I think that like, yeah, people are gonna have fun",
            "start": 1988.16
        },
        {
            "text": "some reasons or cause, oh, it just filled up. I don't know, you know, there's no sort of like, there's no consensus that needed to happen. And so I think that like, yeah, people are gonna have fun seeing what I chose and they're also gonna have fun writing me on Twitter and being like, you son of a bitch. Is there a ranking to it or is it just a hundred? So I wrote in the forward that like, I chose 50 and like narrowing that list down was hard enough. I could not rank top like one through 50. So I literally, I chose Spelunky first cause that's like probably my all time favorite game. That's what jumped in my mind when you got the book. I'm making this and Spelunky's on it. Oh yeah. Okay. Yeah, yeah, yeah. Spelunky was, I was like, that has to be on there cause- You can go for it. Spelunky's incredible. So I put that first and then literally Googled random, like number randomizer and then randomized the rest of the list. And that's the order of the book. But yeah, there's like, there's",
            "start": 2022.84
        },
        {
            "text": "incredible. So I put that first and then literally Googled random, like number randomizer and then randomized the rest of the list. And that's the order of the book. But yeah, there's like, there's extra little bells and whistles in there. There's a forward from Craig Schistamus from Screw Attack. We know. Who I like collaborated with on it a little bit. And then there's like a list at the end of the book of all the games with like five stars and like rate it yourself, keep track of the ones you've played. Oh, that's really cool. And ones you haven't played. There's a little history of gaming with some like Wikipedia facts and stuff like that in there. Yeah, yeah. So it's a fun little, I think it's a fun little like gift book. It's a fun little holiday thing. And it's just kind of a neat like, like survey of like, yeah, like video games are really, really great. And I wanted it to, you know, be accessible to people as well. So. How cool is it to know you're gonna have a book in",
            "start": 2068.08
        },
        {
            "text": "neat like, like survey of like, yeah, like video games are really, really great. And I wanted it to, you know, be accessible to people as well. So. How cool is it to know you're gonna have a book in bookstores? It's, yeah, it's pretty cool. I mean, I have some experience, like, I don't know if you guys know that I like, my face is in target a little bit. Oh, I've seen you. I've tweeted you some pictures. It's just like, have you guys seen this? Yeah, yeah. Yeah, I just want, I just hear Chris's voice. I'm like, what the hell is happening? I look over and it's just like the little screens. It's like, you should buy Wii U. Like, okay. Should you? I never said that. Yeah. Yeah. But like, so I have some experience of people like tweeting pictures of me in a store at me, but like, that's like a short video we did through GameSpot. But this is like something that I made, I wrote. And like, I'm like reading through and it's like, yeah, I did a good job with this. And so, yeah, I'm super",
            "start": 2106.9
        },
        {
            "text": "a short video we did through GameSpot. But this is like something that I made, I wrote. And like, I'm like reading through and it's like, yeah, I did a good job with this. And so, yeah, I'm super excited. Was it hard to balance your time? You know what I mean? Like we're, we're, we know the life of having a nine to five then coming home to work on a passion project, but ours is, was yelling at a camera and then why are we edited or whatever? I feel like a book and going back and forth with a publisher and doing all this different legwork and trying to pick your list, did it like consume everything for awhile? It did for awhile. Yeah. It was actually a really short turnaround. I started at the beginning of August and I had to submit my draft by like Labor Day weekend. Oh, wow. So that's like five weeks I had. So I literally like in pen, I like penciled out a calendar and was like, okay. So like Tuesday night I come home, we have to go to the grocery store, I can't work that night.",
            "start": 2148.26
        },
        {
            "text": "like five weeks I had. So I literally like in pen, I like penciled out a calendar and was like, okay. So like Tuesday night I come home, we have to go to the grocery store, I can't work that night. Wednesday night, like two, I can write two to three, you know, and like I'm working with my wife to like clear up our schedule. Like I need this Saturday, I can write like, I can write like seven to nine depending on how it goes on Saturday. So it was, I had to rigorously schedule it. And I was talking with another friend of mine, Laura Parker, who's an author and writes for a bunch of outlets, the New York or New York Times and stuff. And she was writing a book herself and she was just like, how, like how do you have any sort of, how do you marshal your thoughts? How do you start in on a book? It was a little easier because this is like a very clearly formatted, like I can write one, I can get it done in a night and I can have that ticked off. I don't have to like structure a chapter or",
            "start": 2186.2
        },
        {
            "text": "It was a little easier because this is like a very clearly formatted, like I can write one, I can get it done in a night and I can have that ticked off. I don't have to like structure a chapter or something like that. So that definitely helped with the quick turnaround, but yeah, it consumed a lot of my life for a very brief amount of time. And then like, okay, now I'm just gonna wait. And then here's the final proof edit. Oh my God, I have to spend all weekend looking at this thing and fixing errors. Okay, and then it's gone. You're just gonna wait to hear from us. And now it's sort of book tour, like go around and promote it. And then, well, I don't know what's gonna happen after that. Where else are you going on the Today Show? It seems like when people have books, they go on the Today Show. I feel like I should get some, you know, some CBS leverage here, but it's like a separate thing. It's separate from the work endeavor. You know, like you guys know, personal products sometimes",
            "start": 2224.92
        },
        {
            "text": "Show. I feel like I should get some, you know, some CBS leverage here, but it's like a separate thing. It's separate from the work endeavor. You know, like you guys know, personal products sometimes have to be. So I did another podcast with some friends, video game apocalypse last night. Gonna go on some more podcasts in the coming weeks. So yeah, the gamer's bucket lists. It's exciting, and the link's in the below. Definitely, check it out. Oh, you're putting the graphic rack up too. Yeah, can you do that Kevin? Kevin, get in. I love the graphic hand gestures. It just slides on in. And thank you guys for having me on to talk about it. I really appreciate it. Congratulations, it's awesome. It's huge news. Thank you. I'm excited to look at it. I really do love lists, so I'm excited to break it down. I disagree with you, because that's the best part of this. That's gonna happen, yeah. Ladies and gentlemen, this topic, brought to you by tipsyelves.com. If you need a holiday sweater, an",
            "start": 2259.74
        },
        {
            "text": "it down. I disagree with you, because that's the best part of this. That's gonna happen, yeah. Ladies and gentlemen, this topic, brought to you by tipsyelves.com. If you need a holiday sweater, an ugly Christmas sweater, you should definitely go there. Kevin, sweater me. Oh, Lord almighty. All right, so this sweater. Only Kevin would mess up tossing in his sweater. Only Kevin would mess up tossing in his sweater, and then almost tear it apart. Oh God, can you do something with that, Kevin? So this is the one that they sent Nick. No, no, this is Greg, Greg Millers. I get to wear this thing? You get the sexy Santa Centaur. Look at that six pack. Thank you. So that's yours. Should I put it on? No. Just hold it up? Just hold it up, people, no. The red hooves are a nice touch. Yeah, they are. This one here is Nick's, the Feliz Navi dog, which might be my favorite. Can you hold this, Chris? Damn, that seemed real genuine. Good work, Kevin was definitely amused. It was like legit. He legit",
            "start": 2296.28
        },
        {
            "text": "This one here is Nick's, the Feliz Navi dog, which might be my favorite. Can you hold this, Chris? Damn, that seemed real genuine. Good work, Kevin was definitely amused. It was like legit. He legit cracked him up. You didn't see it until now. Colin's amazing Ninja Turtle style gingerbread cookies. These are heavy, thick sweaters. Real sweaters. Here's my beautiful, beautiful reindeer's getting it on shirt. So me, so me. So yeah, if you want these shirts or a bunch of other ones, you should go to tipsyelves.com. You can get 20% off the entire site if you use the code, kind of funny games. It's going to be a good time for everybody. They have a whole bunch of stuff. They have like college, like collegiate shirts and stuff too. They also have like themed- What does that mean? Like, I don't know. Like Mizzou shirts? Can I get a Mizzou shirt there? I don't know about Mizzou, but like there's definitely like college shirts. You should check it out. They don't want to be wearing Mizzou shit",
            "start": 2343.1
        },
        {
            "text": "Like Mizzou shirts? Can I get a Mizzou shirt there? I don't know about Mizzou, but like there's definitely like college shirts. You should check it out. They don't want to be wearing Mizzou shit anymore. A lot of people are. We're taking it back. They're on Shark Tank. Oh, cool. I love Shark Tank. I'm out. Tipsyelves.com. Use the promo code, kind of funny games. It'll be fun. Let me know what you buy. Did they succeed on Shark Tank? Are we promoting these? Are we kind of promoting Mr. Wonderful? Yes. Wow. Feels good, doesn't it? Shark Tank's a good show. Oh, Shark Tank's great. I've seen, Mark Cuban is on there and he tells people about how much money he wants to give them or not. Yeah, it's a wonderful show. I'll give you $10,000 for 5% of your business. All right, third topic of the day. I want us to predict the Game Awards winners. Greg Miller. Yeah. Yeah, before we even get into the topic, if it's still time, which no, it should be. Yeah, it'll be good. No matter when you're",
            "start": 2393.5
        },
        {
            "text": "day. I want us to predict the Game Awards winners. Greg Miller. Yeah. Yeah, before we even get into the topic, if it's still time, which no, it should be. Yeah, it'll be good. No matter when you're listening to this, you should still be able to vote. I mean, if it's voting up until... Try to vote for me. Yeah. Go to thegameawards.com, click on nominees, click on Trending Gamer, and if you can still vote for me, vote for me there. Go to the library. If anyone is still logged in, vote for him there. Go to your mom's house. You vote by hashtag TGA Greg Miller or going on their site and then clicking this and going to their Facebook wall. I don't understand Facebook. And remember other hashtags include TGA Greg Miller's Ego and TGA PewDiePie. No, don't do the PewDiePie. The PewDiePie one is detrimental to what we're doing. You're welcome to do TGA Greg Miller and then in a separate hashtag, TGA Greg Miller's Ego. So what I wanted to do, I thought it'd be fun. The Game Awards are coming on",
            "start": 2435.68
        },
        {
            "text": "to what we're doing. You're welcome to do TGA Greg Miller and then in a separate hashtag, TGA Greg Miller's Ego. So what I wanted to do, I thought it'd be fun. The Game Awards are coming on either tomorrow, if you're listening to this as the breakout or next week if you're listening to this on Patreon. I wanted to go through each of the different categories, go through the nominees and kind of say who we think is gonna win. So not who we think should win. Okay, so we're predicting what will really win the category. Gotcha. Yes. And so the upfront here is nominees for the Game Awards are selected by a jury of 31 international media. In some cases, the jury's provided advanced review code of upcoming games in order to meet the Game Awards judging deadlines. Games must have been commercially released by Tuesday, November 24th to be eligible for awards. Esports nominees were voted on by an advisory panel consisting of Esports, Media Insights. By Mitch Dyer, Yoda won. So the people voting",
            "start": 2479.46
        },
        {
            "text": "released by Tuesday, November 24th to be eligible for awards. Esports nominees were voted on by an advisory panel consisting of Esports, Media Insights. By Mitch Dyer, Yoda won. So the people voting on it is this like collection of high ups at all the different, you know, gaming journalism companies. Talmadge Blevins is on this panel. He is. Ben Howard of GameSpot. And Howard of GameSpot. Ben Howard. Oh, Ben Howard. I thought you said Ben Howard. And Howard of GameSpot. So that's the guy Howard we have around. He's got opinions. So that's cool. Got a couple of our friends doing some stuff there. Let's start big. Game of the year. We're starting with the granddaddy of them all. The only way to go. Give me the nominees, Tim. Bloodborne, Fallout 4, Metal Gear Solid V, The Phantom Pain, Super Mario Maker, and The Witcher 3 Wild Hunt. So see, this is tricky order wise. Cause you want, cause the way that these awards have worked in the past, if something wins in one category, it's like not",
            "start": 2519.42
        },
        {
            "text": "Mario Maker, and The Witcher 3 Wild Hunt. So see, this is tricky order wise. Cause you want, cause the way that these awards have worked in the past, if something wins in one category, it's like not going to sweep necessarily. I feel like they, part of their voting ethos is like, well, if we give this one, you know, best action adventure, then let's not give a game of the year. We've still honored it, but we can give something else game of the year. I think it's Metal Gear. I think it's Metal Gear. Cause then I can see them not giving Metal Gear like the random ass other things. Fallout. And you're a winner for random ass other thing. I'm going to say Fallout 4. See, here's my thing. My dilemma is I think it'll be Super Mario Maker. I agree. And I think it's going to be cause Fallout and Metal Gear are going to divide the votes and then your Nintendo diehards will go through with Nintendo. Yes. We agree. Someone chronicle these guesses. Tally them down. Someone tell them. Tom Hawkins.",
            "start": 2566.02
        },
        {
            "text": "Gear are going to divide the votes and then your Nintendo diehards will go through with Nintendo. Yes. We agree. Someone chronicle these guesses. Tally them down. Someone tell them. Tom Hawkins. Put these on the boards, Tom. Developer of the year. Bethesda Game Studios. CD Projekt Red. From Software. Kojima Productions. Yeah, right. Nintendo. It's gotta be CD Projekt. I think it's going to be CD Projekt as well. I agree. Just cause they really impressed. No one knew that they were capable. Great game. Free DLC. They were the first thank you letter this year to fans and their game and all this stuff. I definitely think that that's where you honor them. I think all that's good, but I really do think it's so much simpler. It's like they delivered a game no one knew that they were capable of making. It's the same thing I always say about Techland with Dying Light. No one knew that they could make this game. Yup. I think they win almost by default. Even with The Witcher 2 being so great,",
            "start": 2608.1
        },
        {
            "text": "making. It's the same thing I always say about Techland with Dying Light. No one knew that they could make this game. Yup. I think they win almost by default. Even with The Witcher 2 being so great, the stuff that they were promising in The Witcher 3, just like, oh my god, it's going to be this big. And then, do you remember the sensation you got? I don't know, I didn't play it much before release at all, but people who would play it would come back and would have that look in their eyes of like, holy shit, they did it? It's like Polish dude, damn. Yeah, it's really cool. There's an Eastern European Renaissance in games right now. It's really, really cool to watch with Metro and with Witcher and with Dying Light and all that kind of stuff. There's a lot of games coming out of there that are really good. Best independent game. Axiom Verge gets the next vote for sure. Of course. Her story. Ori and the Blind Forest. Which isn't an independent game. Rocket League. Oh. Undertale. It's",
            "start": 2652.66
        },
        {
            "text": "are really good. Best independent game. Axiom Verge gets the next vote for sure. Of course. Her story. Ori and the Blind Forest. Which isn't an independent game. Rocket League. Oh. Undertale. It's gotta be Rocket League. But I'm curious about the criteria for this. Microsoft published Ori. That's not an independent game. But if it's an independent developer that they publish from, that's probably there. But then Tomb Raider is an independent game. You know what I mean? I'm with you, I'm just saying. I'm with you, Rocket League. I think Rocket League took over the world by storm. Rocket League might be my personal game of the year. And I think it's gonna win game of the years for sure. I've said that too. I know you guys like it. I've been beating the drum of that game for a long time where I'm like, this game's really gonna fucking blow people away. I legit think that game's gonna win game of the year for my big outlets for sure. Yeah, I would say Rocket League got that list. That's a",
            "start": 2691.58
        },
        {
            "text": "I'm like, this game's really gonna fucking blow people away. I legit think that game's gonna win game of the year for my big outlets for sure. Yeah, I would say Rocket League got that list. That's a great list of games though. Ori was also one of my favorites. That's like the first Metroidvania I ever 100%ed. And I think it's because of the movement in it. Just felt good to go around and backtrack and stuff like that. I just like, I liked it. I just hate. It's a good topic though, not to belabor the point, but it reminds me of back in the day at IGN, we used to have conversations about, well, we used to give downloadable game of the year. And then we were just like, well, it's just a game. And the same thing with independent games. It's like, why are we stigmatizing them basically as independent games? Especially when I will contend that one of those games is decidedly not independent. I think they're just doing it to make sure, to give these guys an award. It's just downloadable",
            "start": 2738.3
        },
        {
            "text": "independent games? Especially when I will contend that one of those games is decidedly not independent. I think they're just doing it to make sure, to give these guys an award. It's just downloadable small game of the year. That'd be a better way. Small studio that you small studio game of the year. I really think that a few of those games can go head to head with the games that you listed in game of the year. What is Undertale? I don't know if I know what that is. So Undertale is like a, it's kind of a JRPG or an RPG kind of looking thing. It's looks like it's a shining force or an early final fantasy in terms of the viewpoint. But the thing is you like in your monster, it's very, has modern sensibilities. It doesn't, it's not like, I don't know if it's set in the modern day, but like when you meet a monster, you can like try to like figure out what the deal is with this monster. And like, they have weird personality stuff going on and you can like, you can beat the game or get",
            "start": 2775.8
        },
        {
            "text": "when you meet a monster, you can like try to like figure out what the deal is with this monster. And like, they have weird personality stuff going on and you can like, you can beat the game or get through conflicts by, you know, fighting and doing weird attacks or by like having conversations. And it has this very subversive feel to it that takes a lot of these sort of RPG genre staples and just like makes it as if someone wrote it in like, I don't know, wrote it off of some very sort of modern, my words are failing me, but like. This is why you're a writer. Yeah. These books are terrible now. I haven't actually played it myself. You're doing a great job because we all want to go. I don't know what it is. But yeah, that's why it's been gaining a lot of attention is because it's a sort of creative and subversive take on an RPG. Best mobile slash handheld game. Downwell. I don't know what that is. Do you? Oh yeah, I've been playing Downwell. Is this mobile? Is it one of your touchy",
            "start": 2813.12
        },
        {
            "text": "of creative and subversive take on an RPG. Best mobile slash handheld game. Downwell. I don't know what that is. Do you? Oh yeah, I've been playing Downwell. Is this mobile? Is it one of your touchy touch games? Yeah, yeah. Get out of here. No, you hold it vertically and basically your dude is always falling down a well. You can move left or right and you can like, you can arrest your descent by shooting or you can just keep plummeting and there's just various enemies that you kind of try to get through and there's power ups you can get along the way. But you know, and every time you start, you start a new Twitch kind of thing, really challenging, but kind of cool. I like it a lot. Wake me when it's on Vita and has a platinum trophy. Fallout Shelter, Lara Croft Go, Monster Hunter 4 Ultimate, and Pac-Man 256. What a terrible fucking list. They ignore all these awesome 3DS and Vita games that came out this year for this nonsense. Danganronpa, another episode. Right in. It's gonna be",
            "start": 2854.14
        },
        {
            "text": "and Pac-Man 256. What a terrible fucking list. They ignore all these awesome 3DS and Vita games that came out this year for this nonsense. Danganronpa, another episode. Right in. It's gonna be Fallout Shelter. Yeah, I think so. Because everyone played Fallout Shelter. Yeah, I played Lara Croft Go and it's cool, but it's like, it never really reached the like challenge that I wanted it to. I agree. It was always like almost awesome. Pac-Man 256, I think is fucking great. Did any of you play that at all? It's super cool. It's just Pac-Man, but like on Vita. It's like Crossy Road Pac-Man, right? Yeah, and it's just insane. The visuals are crazy. It's like a rave. But yeah, I think Fallout Shelter is the winner there. Best narrative, her story, Life is Strange, Tales from the Borderlands, The Witcher 3 Wild Hunt, or Until Dawn. Life is Strange will win. You think so? Yeah. Tales from the Borderlands is a critic darling as well though. I think Life is Strange being new IP is gonna, like I",
            "start": 2901.3
        },
        {
            "text": "Witcher 3 Wild Hunt, or Until Dawn. Life is Strange will win. You think so? Yeah. Tales from the Borderlands is a critic darling as well though. I think Life is Strange being new IP is gonna, like I think Tales from the Borderlands is gonna be a little hurt by the fact that it takes place in the Borderlands universe, which. And it was funny, but was it a great narrative? Was it a great story? Yeah, I see the argument. Do you think Until Dawn gets a chance? No, I think it's, I think. Unfortunately not. I think it's, I think I'm saying the winner will either be her story or Life is Strange. Cause Life is Strange is definitely one people love as well. I'm gonna, before we give our answer for that one, I'm gonna skip. I'm gonna skip ahead a bit. What? To, there was a topic called Games for Change. The fuck does that mean? Cybele, her story, Life is Strange, Sunset or Undertale. What does that mean though? I'm assuming it means like. They didn't wanna say social justice games. They made a",
            "start": 2944.38
        },
        {
            "text": "The fuck does that mean? Cybele, her story, Life is Strange, Sunset or Undertale. What does that mean though? I'm assuming it means like. They didn't wanna say social justice games. They made a step forward, yeah. But they, yeah. I don't know. So do you think that would affect the story one? You know, like would maybe her story Life is Strange win this? No, cause I mean if we're reading into Change correctly, then if I'm going down your argument road and we're reading into the Change correctly, then Change is Life is Strange, her story would be story. Okay. Or narrative, is that what it was? Yeah, that's narrative. You don't think that Witcher 3 will get it? Yeah, cause with her story and with Until Dawn, I feel like maybe it's not so much the narrative as like the narrative structure, like the narrative mechanics and the way it unfolds. As opposed to like, if you were to just sit down and read the story of it, is it cool? But you know, that's all tied up in that. Yeah, I agree with",
            "start": 2987.86
        },
        {
            "text": "the narrative mechanics and the way it unfolds. As opposed to like, if you were to just sit down and read the story of it, is it cool? But you know, that's all tied up in that. Yeah, I agree with that. Until Dawn's one of my favorite games of the year by far. But it's not because of the nature, it's the nature of the story, but not the substance of the story. It's very tropey, I mean that's the idea of the game. 4.0, bitch. So I think, yeah, thanks Emily. What a fantastic game, but yeah, I don't think it's, the nature, it's not like fucking Children of the Corn or Rosemary's Baby or something where it's like a really brilliant horror story. It's as tropey and teen horror as it gets. So I think Chris is right. I think that it doesn't win any points. I think it wins like the uniqueness points. I think it's probably the most unique game I've played this year. And when you're talking about story, I mean, Witcher is a great game, but like we always talk about it's super dense. Like, you",
            "start": 3033.76
        },
        {
            "text": "I think it's probably the most unique game I've played this year. And when you're talking about story, I mean, Witcher is a great game, but like we always talk about it's super dense. Like, you know what I mean? Once you get Siri, what is happening? What is going on in the game? I played that game for so long, doing nothing in that game, like just doing side quests. I don't even know what the fuck the game's about anymore. I mean, that's like, so I don't know if I have, I forgot what I was even supposed to be doing after a while. I don't even know what's going on. I feel like for like volume of narrative, cause there's so many cool little side stories about little creatures and people in towns and stuff. And they all like have a spark of life to them in a way that like other open world narrative games like don't necessarily have. But yeah, again, like in terms of kind of like a cohesive narrative experience, maybe it's not that. Yeah, it's definitely, I'm sorry. Well, just final say,",
            "start": 3073.2
        },
        {
            "text": "games like don't necessarily have. But yeah, again, like in terms of kind of like a cohesive narrative experience, maybe it's not that. Yeah, it's definitely, I'm sorry. Well, just final say, Life is Strange or Her Story. I'm gonna go Life is Strange. For what, what are we talking about? Best narrative. I would say Life is Strange. Yeah, I'll go Life is Strange. I didn't play the game, but I just know people are like crazy about. Is Her Story in the Games for Change category as well? That one doesn't make sense for me. I don't know what that means. I'm gonna go Life is Strange for that one and then Her Story for this one. Okay, cool. Best art direction, Batman Arkham Knight, Bloodborne, Metal Gear Solid 5, Ori and the Blind Forest, The Witcher 3. Ori. I don't see what's super special about the art direction in any of those games. They have beautiful art. Bloodborne looks like a prettier Dark Souls and it looks like a Castlevania game. I mean, I love the way the game looks. I think",
            "start": 3101.24
        },
        {
            "text": "the art direction in any of those games. They have beautiful art. Bloodborne looks like a prettier Dark Souls and it looks like a Castlevania game. I mean, I love the way the game looks. I think that Witcher obviously really set a bar very high. That's why I always say Fallout 4 is a game made in a vacuum. I mean, it's obvious. I mean, there's no excuses for it to look like Fallout 4 anymore. I think Ori wins. I think Ori is a good one. I do think Metal Gear Solid 5 has a very defined art direction in terms of camera work and all that stuff that I think puts it in a league. But is that what they mean? Art direction? I don't know. Cinematography is an art. Is Bloodborne in any other categories? It was Game of the Year. Right. I don't think it's gonna be Game of the Year. So I think they wanna give Bloodborne an award. So I think this might be Bloodborne. For art direction? Yeah. I think that that like, I don't know. I've actually like someone in the office has been playing the",
            "start": 3143.04
        },
        {
            "text": "they wanna give Bloodborne an award. So I think this might be Bloodborne. For art direction? Yeah. I think that that like, I don't know. I've actually like someone in the office has been playing the expansion and just like the creature design in there. Like it does feel like, like it does feel distinct to me from the Souls proper games. And it does feel just like every scene and that just like drips with this style. I don't know. I mean, I definitely was super, I wasn't a huge fan of Demon's Souls or Dark Souls. And when I got Bloodborne, I expected more of the same and it did put its hooks into me. Cause as I was saying, it's faster. So it's like a little tinge of arcadiness in that that made me wanna play it more. I like fast moving games. And I will say that the game is the most beautiful Castlevania game I've ever seen before. And if Konami didn't have its head so far of its ass, it would go to a studio like from software and be like, can you do this, you know, for one of our",
            "start": 3180.2
        },
        {
            "text": "Castlevania game I've ever seen before. And if Konami didn't have its head so far of its ass, it would go to a studio like from software and be like, can you do this, you know, for one of our great IPs, because it is such a beautiful Gothic eerie game. And when you look around, just to look around that city and something like this, this is a Castlevania game. And this is like, this is a Castlevania game begging to be fucking made. So I do agree with you that it has a great style, but I don't, but Ori, when I think about Ori, I just see like, you know, art direction, like the essence of, yeah, it's, I don't know. It's a, that's a tough one, but I agree with you. It's a pretty nebulous question. Best score slash soundtrack, fallout four, halo five, metal gear solid five, Ori in the blind forest, Witcher three. Metal gear, that fucking cadre googoo is in that shit. That's the weird thing. That's the only one really with the license stuff going on. I think because the license stuff, I'd",
            "start": 3224.24
        },
        {
            "text": "Witcher three. Metal gear, that fucking cadre googoo is in that shit. That's the weird thing. That's the only one really with the license stuff going on. I think because the license stuff, I'd give it to metal gear, but if it's just score, I'd give it to halo. What's the one right before halo? Fallout. Yeah. Fuck. Fallout has some weird, I've noticed like just weird eighties sensibilities. I can't almost explain it where, where it's, I don't even know how to explain. I can hear in my head, like the, the weird shimes and like when you see an eighties horror movie or something like that, it's like very ambient music that just like comes and goes like very quickly. They do that in like Fallout all the time. It reminds me of watching like a, like a thriller in the eighties or something like that. I don't know why I can't explain it any more than that. Maybe I'll try to capture it or something next time I see it. But if they, if they are including soundtrack, I mean it's gotta be metal",
            "start": 3264.62
        },
        {
            "text": "that. I don't know why I can't explain it any more than that. Maybe I'll try to capture it or something next time I see it. But if they, if they are including soundtrack, I mean it's gotta be metal gear because that soundtrack is really good. Yeah. See, I'm going halo five because I don't see them giving halo other stuff. And I do think that halo, halo has always been a game that is scored moment to moment. Like there's songs scored specifically for levels and for moments and stuff. Whereas metal gear, I mean five, some of the other games have distinctive themes and stuff. Five I think just has the freaking cigar song. Yeah. Halo is what I picked. It's great. I love it. But I think halo is thinking. I'm going metal gear. Yeah. Best performance. Ashley birch as Chloe. Chloe price. Chloe from life. Strange Camilla, London as lower craft. Doug cockle is Geralt. Oh, Geralt Geralt. No, which are hard G Mark Hamill as the joker Batman, Arkham Knight and Viva safer in her story. Fuck life is",
            "start": 3308.26
        },
        {
            "text": "life. Strange Camilla, London as lower craft. Doug cockle is Geralt. Oh, Geralt Geralt. No, which are hard G Mark Hamill as the joker Batman, Arkham Knight and Viva safer in her story. Fuck life is strange. See, I would, the Hamill one's a curve ball, but you have to wonder how many people are going to vote for him and how many people are going to be like, come on. Yeah. Are we really? I mean, we need to think about who the people are voting for. They're not, they're not voting for, for Mark Hamill. I don't think then it's Ashley. It's life is strange. Okay. Then just games for change. Then what do you think? Raider like is, does tomb Raider appear on, I'm coming back to that logic of yeah, what is going on tip the nod to tomb Raider or something like that. Tomb Raider is like falling off a commercial cliff right now. So I wonder if they do want to, bring some notice to it or whatever a game that's going to be, that's getting critical darling. That's just not selling. I wonder if they",
            "start": 3350.74
        },
        {
            "text": "a commercial cliff right now. So I wonder if they do want to, bring some notice to it or whatever a game that's going to be, that's getting critical darling. That's just not selling. I wonder if they do want to try to give it a knife. I feel so bad for crystal. I'll just reiterate that. I feel really bad for them, but I feel like Ashley Burch is some, someone that people want to get behind. It sucks. Yeah. Yeah. They put that game on the die. I, I think that's like a strong call. Although I do think that like the fact that her story is just the actual actress, the novelty of that could carry the day. So I'm gonna go with that one. Okay. Okay. Best shooter called it would be black ops three destiny, the taken King Halo five splatoon or star Wars battlefront destiny. Yeah. I say destiny as well. I don't think it's the story drive, but it's one of those for sure. Yeah, that's for sure. I mean you talk about critics like all of our friends in our echo chamber are talking about it and",
            "start": 3398.5
        },
        {
            "text": "as well. I don't think it's the story drive, but it's one of those for sure. Yeah, that's for sure. I mean you talk about critics like all of our friends in our echo chamber are talking about it and we're on it and like this is made so many improvements from destiny. This is what I wanted from destiny vanilla. Here we are. I get really choked up man. It's not to come together, but then it did yeah. I'm down with the taken King that like revitalize that in a way that almost tempted me back in almost almost best action adventure game, assassin's creed syndicate, Batman, Arkham knight, metal gear, solid five or in the blind forest rise of the Tomb Raider, metal gear, metal gear. This is where you give metal gear. It's you. Oh, show rise of the Tomb Raider. Right. Although I raise again, we're just guessing what we think is going to win. I didn't play metal gear, so that's role playing game. Bloodborne. What is it? What is multiplayer role? Role playing. Okay. I'm sorry. Bloodborne,",
            "start": 3437.82
        },
        {
            "text": "we're just guessing what we think is going to win. I didn't play metal gear, so that's role playing game. Bloodborne. What is it? What is multiplayer role? Role playing. Okay. I'm sorry. Bloodborne, fallout for pillars of eternity, the Witcher three undertale. This is where bloodborne wins. Really? Yeah. Over fallout. Yeah. Cause I think fault is going to win game of the year. So yeah, this, this seems to make the most sense. I wouldn't call it a role playing game really, but I think this is, this is where it's got role playing sensibility. So does Madden. So it's, it's not, it's an action game. Um, but yeah, that's what they're going to call it. I'm going to, I'm voting fallout here. Follow me. I'm going for the Witcher three. I think that role playing, uh, you're playing that role of Geralt now it's super literal, but like, I do think that that kind of, uh, the, the narrative heaviness of that over something like, uh, bloodborne and then, uh, fallout, I feel like, I don't know. I",
            "start": 3487.74
        },
        {
            "text": "Geralt now it's super literal, but like, I do think that that kind of, uh, the, the narrative heaviness of that over something like, uh, bloodborne and then, uh, fallout, I feel like, I don't know. I think something about putting, you know, being able to play it first person with a gun in front of you will make people not think role playing. Hmm. Best fighting game. Guilty gear. Third sign mortal combat X rises incarnates rising thunder, mortal combat X. I'll say, I don't know. I think, I think the best, the best fight, I mean, people guilty. Here's a very hard, guilty. Here's a very hardcore fighting game. I don't even know what the, that's the thing I think it'll work against you. You'll get more on the moral combat. Is one of those. Isn't like Seth Killian's new thing, right? That's not even out yet. Okay. Yeah. Mortal combat. Best family game. Disney infinity three Lego dimensions, Skylanders, superchargers, splatoon or Mario maker. Splatoon. You don't think you'll put Mario",
            "start": 3528.86
        },
        {
            "text": "not even out yet. Okay. Yeah. Mortal combat. Best family game. Disney infinity three Lego dimensions, Skylanders, superchargers, splatoon or Mario maker. Splatoon. You don't think you'll put Mario maker? No, I think it's Mario maker unless Mario maker wins. I think it's Lego. I think that the way they did the toys for life stuff with the Lego integration and just having all the different properties mixed in there is, is like kid catnip. I'm saying splatoon. Yeah. It seems like a safe one. Yeah. I think that if you saw anything that going on with, with Dan Reichert and Patrick Klepek or whatever with Mario maker, it's not a kid's game. Is it? It's making grown men want to kill themselves. Oh my goodness. Fueling blood feuds across the nation. Did you watch him like finish the apocalypse or whatever it was yesterday? Oh, he did. I just watched it. I watched the GIFs that he retweets and that's enough for me. They're great, man. I fucking love watching that shit. Best sports slash racing",
            "start": 3574.14
        },
        {
            "text": "whatever it was yesterday? Oh, he did. I just watched it. I watched the GIFs that he retweets and that's enough for me. They're great, man. I fucking love watching that shit. Best sports slash racing game. All right. Rocket league FIFA fours of motor sports, six NBA, two K 16 pro evolution soccer rocket league rocket rocket league. Although I think MBA will win. So I'm going to, I think rocket league is the, I, I I'm going to say MBA will win. That game is extraordinary. I think I voted for rocket league for best like in independent thing. Is that right? That was a category earlier. It did come up earlier independent. Yes. So it was that's yeah, it was cause I was the, that was the one that Colin was all, it was, it wasn't kind of, you're right. You're right. I'm about the orry part. So it's FIFA Madden and NBA. What was the other one? It's Forza, Forza and evolution soccer. Yeah. Oh, was he, was FIFA and pro evil and pro evil. Oh yeah. I think NBA, I think that that's, that's a",
            "start": 3622.94
        },
        {
            "text": "So it's FIFA Madden and NBA. What was the other one? It's Forza, Forza and evolution soccer. Yeah. Oh, was he, was FIFA and pro evil and pro evil. Oh yeah. I think NBA, I think that that's, that's a series that like really, I don't know, they did like perennially at game spot conversations. We not, not a ton of us are like sports game players, but it's like you look at that game. It's like, how could you possibly make a better basketball game? I don't know. I'm holding strong with rocket league. Most anticipated game, horizon, zero Dawn, no man's sky, quantum break. The last guardian uncharted for no man's sky will win horizon's the right answer, but no man's guys. I'm saying charted uncharted for is like, it feels closer. I think no man's sky is a little tired in terms of anticipation. Like people been on that anticipation tip for a while. I think that they will want to make a new anticipation kind of target. I think horizon horizon looks fucking awesome. Oh my God. Doesn't it look",
            "start": 3663.62
        },
        {
            "text": "Like people been on that anticipation tip for a while. I think that they will want to make a new anticipation kind of target. I think horizon horizon looks fucking awesome. Oh my God. Doesn't it look so awesome. I'm just going to read this one and I'm gonna let Greg Miller, whoever wants to add shit into it. E-sports player of the year, Kenny Kenny S shrub who plays counter-strike global offensive, Lee faker saying yuck who plays league aloof aloof Meister, Kajab, jur who plays counter-strike Peter PPD dagger who plays Dota two that guy and Syed sumal sumal with an odd with a number one as an awesome male, a son to male who plays Dota two. Oh, I'm voting that dude. It's a male. He's like a 16 year old kid. He won the international with evil geniuses. And he was like, uh, I don't know if people were super stoked about that. I'm going to mail. He just said a bunch of words that are also written down. So he knows I'm with him. Do you watch E-sports? No. I watched the international",
            "start": 3713.1
        },
        {
            "text": "if people were super stoked about that. I'm going to mail. He just said a bunch of words that are also written down. So he knows I'm with him. Do you watch E-sports? No. I watched the international though. Cause I was like, all right, this I'd need to like time for me to get boned up. I was, I got totally into it. Cause it was just like, I think the broadcast level was enough that it allowed me, like it did what a good broadcast does. It like makes it accessible to like, I was watching the new stream a little bit, you know? And it was like, okay, they're explaining it in some basic terms. Some of the stuff's going over my head. That's okay. I can get a loose handle on the action and see what's going on. I can supplement it by like asking a coworker and like, if I don't pay attention for 10 minutes and I come back and like, I watch some more like, that's okay too. Like, you know, it was kind of like able to be that kind of casual sports-esque viewing experience for me because of the",
            "start": 3765.94
        },
        {
            "text": "10 minutes and I come back and like, I watch some more like, that's okay too. Like, you know, it was kind of like able to be that kind of casual sports-esque viewing experience for me because of the sort of, uh, and also the continuity of it year or like over weeks, you know, you could sort of get an idea of a team's momentum and that like gave me just like a toehold in terms of conception of the broader context. Yeah. I don't understand it at all, but I do think it's cool that they're one of the nerds awarding these people. Um, and then there's also esports team of the year who we have no insight. No idea. Evil geniuses. Okay. They're on the list. But now that's fine. Gaming SK telecom and team Solomid. Yeah, I know I've heard of them. Esports game of the year. We got call of duty, advanced warfare, counter-strike global offensive, Dota two, birthstone and legal legends. Yeah. If they've, if they're given awards to Dota two for those teams as I'm confident they are, I think leagues a",
            "start": 3803.58
        },
        {
            "text": "warfare, counter-strike global offensive, Dota two, birthstone and legal legends. Yeah. If they've, if they're given awards to Dota two for those teams as I'm confident they are, I think leagues a good call because way more people play league people. I think then Dota. Is that right? You don't know. You have no idea. I don't even acknowledge that these games. Here's my anecdotal evidence. I made a Dota. We had a trivia night at PAX prime and that I ran and we had a Dota question and like afterwards, like 50% of the teams that came up were like, why don't you ask us about league? Huh? No one plays Dota. Yeah. I'm sure. We were in Seattle. So yeah, anecdotally way more people. I'm one of the, uh, I'm one of the old men that refuses to believe anything's happening around them right now with this stuff. So it's just like, I'm going down with the ship. Kevin, you understand what I'm saying? That's going to be a long slow descent. I'm standing on the, on the starboard side, Kevin waiting",
            "start": 3848.18
        },
        {
            "text": "this stuff. So it's just like, I'm going down with the ship. Kevin, you understand what I'm saying? That's going to be a long slow descent. I'm standing on the, on the starboard side, Kevin waiting for the ship to crash, but it probably never crashed. We're always gonna have single player games, right? On consoles. Remember when consoles were going to die? That was the thing that was going to happen at one time. Remember when mobile gaming was going to kill everything? Trending gamer. We got our boy total biscuit, Christopher Monte Cristo Nichols, who I don't know who he is. I probably should. Do you know? Okay. We don't want to promote the competition. No, we should look into these people. Greg Miller. Yeah. Markiplier who I'm a big fan of and Pewdiepie. And for the record, we like all these guys that we know who I think is going to win. Why I heard news today that Greg is murdering everyone right now. I want, I want to let you know that like you're apparently murdering. I'm aware of",
            "start": 3894.14
        },
        {
            "text": "guys that we know who I think is going to win. Why I heard news today that Greg is murdering everyone right now. I want, I want to let you know that like you're apparently murdering. I'm aware of the murder going up of that fucking very much. No one can take their foot off the fucking gas. Cause again, any of those motherfuckers confirmed, except for maybe Chris, just cause I don't know who he is. He might be able to can just be like, vote for me. Exactly. It's over. That's the problem. Last night, somebody tweeted at me and he's like, Oh man, you're doing great. You have 56% of the vote closest behind you. And then the added total biscuit. Don't tell him. He's a very busy man. If he doesn't know, it's like, they don't, you know, don't worry about it. I'm going to say Pewdiepie is going to win, but I think that I'm pulling for my boy, Greg, obviously, you know, I'm pulling for my boy. I don't want Greg to get, I don't want Greg to get his hopes up. And I also want to jinx you because",
            "start": 3940.46
        },
        {
            "text": "win, but I think that I'm pulling for my boy, Greg, obviously, you know, I'm pulling for my boy. I don't want Greg to get, I don't want Greg to get his hopes up. And I also want to jinx you because I think that the numbers might indicate that you might win. And again, total biscuits right behind me. He's the guy who won last year. So that's the concern. Also, I like total biscuit on his podcast. Do you think he would win two years in a row? Well, if the vote is the one, this is you're talking about engineering here and I appreciate it. But if the critics were voting on this, there's not a shot in hell with Greg Miller. I made enemies left and right. Your association with me alone would lose you. I'm really, really interested in this and I'm pulling for you so hard. I think this would be so awesome. If you want to put it right there. Remember what you were going to do. If you win. No, I see. That was a joke. What is it? I said, Colin said he'd give me $2,000. Well, for what that I",
            "start": 3980.66
        },
        {
            "text": "be so awesome. If you want to put it right there. Remember what you were going to do. If you win. No, I see. That was a joke. What is it? I said, Colin said he'd give me $2,000. Well, for what that I said, I'd get up and say, what was an inside job? It calls like, I'll give you $2,000 cash if you do that. My father's a New York City firefighter. All right. And I'm still telling you, if you need to go up there, Jeff, he is listening. I'm not going to do that. You don't have to disqualify me or throw up my votes. That is not going to happen. Oh, man, that is so great. Miller winning that is going to be an inside job. $3,000. Oh, it's going up. Final final one. Best fan creation. We got GTA five targets. The hoodoo up by hoodoo operator, real GTA, like corridor digital. Oh, portal stories. Mel, my prism studios, super Mario maker, e-reader levels by bad boys. 78 slash. They call me shaky Twitch plays dark souls with Twitch community. This is cool. Dark souls. One was really cool. That's",
            "start": 4020.9
        },
        {
            "text": "my prism studios, super Mario maker, e-reader levels by bad boys. 78 slash. They call me shaky Twitch plays dark souls with Twitch community. This is cool. Dark souls. One was really cool. That's the only one I really know. So I like this is the thing. And the e-reader levels are cool. Like some guy in Mario maker remade all of the remember that you reader and the GBA and had all those like exclusive Mario three levels. They like remade was obnoxious. It was that whole great level stuff. So that's cool. Says reader right in the toe. What the hell? I'm gonna, I want corridor digital win. Cause that real GTA video was on another fucking level. Yeah. I feel like it's got a, I feel like GTA that like community of people generating content out of that has been so felt, felt pretty strong this whole year. I think GTA has to get a nod here. Yeah. I don't know what the targets thing is by hoodoo operator, but I'm just going to go with the quarter one. Cause I like them. We'll see how right we",
            "start": 4073.38
        },
        {
            "text": "year. I think GTA has to get a nod here. Yeah. I don't know what the targets thing is by hoodoo operator, but I'm just going to go with the quarter one. Cause I like them. We'll see how right we are. How many hashtag Colin was right. Tweets will we have to use the goddamn hashtag. You guys are getting a little lackadaisical out there. I don't like it. Your boy Colin and predicted fallout four to a T. Did he not Kevin? Did he not? Let's never forget that. Let's never forget. Your boy called your boy calling him called rocket league a year out a year out. Let's not forget. Yeah. I'm wrong about a lot of shit, but we don't have to worry about any of that. There's no hashtag for that. What would it even be? I can't, I can't, I can't recall who said that tomb Raiders sales were going to get cannibalized by falling. Oh me, your boy calling him, but that was an easy one, but that was, you know what I'm saying? Kevin, that was an easy one. That was as obvious as the fucking sky is blue in the",
            "start": 4116.98
        },
        {
            "text": "by falling. Oh me, your boy calling him, but that was an easy one, but that was, you know what I'm saying? Kevin, that was an easy one. That was as obvious as the fucking sky is blue in the day. As long Tomb Raider was going to suffer mightily because of fallout four. But what are you gonna do? There's nothing you do about it. Yeah. When it comes on PS worldview, it's going to be fun. Probably not. Probably no one's probably gonna care there either to be honest with you, but that's the, I'm going to, I want to reiterate, I really feel bad. I rarely feel bad for developers. I really feel bad for crystal. Can you imagine them looking at it? Like Microsoft hasn't said a fucking thing about that game sales. Did you see that? Like the joke tweet that someone, I forgot who said this, but they're like, wow, that's crazy. The embargo for the review of tomb Raiders a year out. That is funny. I feel, I feel bad for them because imagine that game is getting critical acclaim across the board and",
            "start": 4160.34
        },
        {
            "text": "like, wow, that's crazy. The embargo for the review of tomb Raiders a year out. That is funny. I feel, I feel bad for them because imagine that game is getting critical acclaim across the board and it's just the nature of when it came out and we had Aaron Greenberg on the, on the podcast, his podcast and he has some great explanations as to why they can't move it. And I appreciate that. But that game was sent to die. And I feel, I don't feel bad for square cause I'm sure there was a lot of money made on the deal, but I feel really bad for, for Chris. Do we have American numbers or those? We're not going to get, we're not going to get American numbers until next month. And then we're going to have to, the NPD game that you have to play is a tough game because, and it's a fun game. I'm obsessed with it. I'm actually completely obsessed with the NPD. It goes Mega Man 2, NPD, Mega Man 3. I've been obsessed with NPD for years. Like, and we used to get real numbers and, and, and, and, you",
            "start": 4196.26
        },
        {
            "text": "with it. I'm actually completely obsessed with the NPD. It goes Mega Man 2, NPD, Mega Man 3. I've been obsessed with NPD for years. Like, and we used to get real numbers and, and, and, and, you know, that's kind of stopped. And Nintendo is really the only one that reports the numbers, which I respect. I respect that they say exactly what they sold, even though, and they, and we was getting tanked and like, they're still saying, and I, I think that's really cool, but we will have to figure out like, say tomb Raiders, like number five, right next month. And then you have the numbers for number three and then you're like, okay, it can't be any higher than this, but then at number 10 is rock band or whatever. And it's sold this many copies. And you're like, so it's gotta be somewhere in there somewhere, but then it's only in the United States and the Xbox one strongest here. So then you have to kind of extrapolate those numbers. It's a whole, there's NeoGaf threads dedicated to this that",
            "start": 4232.86
        },
        {
            "text": "somewhere, but then it's only in the United States and the Xbox one strongest here. So then you have to kind of extrapolate those numbers. It's a whole, there's NeoGaf threads dedicated to this that go down the rabbit hole so far that you're like, it's, it's awesome. I read all, I, I go, I like to sit in bed for hours and I just read people's charts and their conspiracy. Was that what that like glow and like acrid smell and like, chanting was all about. It's like your NPD alter. It is. I love, I love sales data. I love that in the UK and in Japan, they report data and they don't report data here numerically. And also MPD is becoming useless anyway. Like the, it's not accounting for retail sales and all that kind of stuff. Then you have to guess about retail. There was a whole fight about halos. People got mad at me on the Facebook, our Facebook fan page, because I said, Halo's launch was soft and I'm like, but it, but it was compared to Halo four and Halo three and Halo two, but we",
            "start": 4268.14
        },
        {
            "text": "halos. People got mad at me on the Facebook, our Facebook fan page, because I said, Halo's launch was soft and I'm like, but it, but it was compared to Halo four and Halo three and Halo two, but we are just anecdotally figuring the show. We don't really know because then, because then Microsoft releases stuff being like, it's the most played game today on X-Men. Like what the fuck does that mean? That people have played 2.8 billion hours of Halo in the first week of release. Like someone just say what the fuck a game sold, please, for your boy, Colin M. Can they just release some sales numbers? You're in rare form Colin M. Just send me a text, just a number. That's all I need. Ladies and gentlemen, as always, the last topics brought to you by the kind of funny forums, go to kind of funny.com slash games, cast topic to leave a post about what you want us to answer on this beautiful, beautiful show for all the beautiful, beautiful kids, the big kids, as we call them during the extra",
            "start": 4304.5
        },
        {
            "text": "slash games, cast topic to leave a post about what you want us to answer on this beautiful, beautiful show for all the beautiful, beautiful kids, the big kids, as we call them during the extra extra life. Valiant villain says, Hey gentlemen, my question today is this. Do you think you'll play video games forever with the rise of VR and mobile gaming seems to be headed in a different direction with big series like metal gear and which are coming to an end gaming, stepping into a new age. And when I seem to be slowly narrowing my interest in. So again, I ask, will you be a gamer forever? Yes. Yes. Yes. I mean, that's my biggest concern. Why I want to die young is that I don't want to get to the point where I can't use the controller, keep my fingers up or move. By that point, there's going to be like other controller inputs are going to be there. Sure. That's what I'm holding up for. Remember when we played, remember when we played infamous second sun using our eyes? Yeah. I didn't",
            "start": 4352.32
        },
        {
            "text": "to be like other controller inputs are going to be there. Sure. That's what I'm holding up for. Remember when we played, remember when we played infamous second sun using our eyes? Yeah. I didn't remember that actually. That was really weird. Wasn't it? Yeah. And that was just a test. That was a test. Sony was doing, but it was cool. Like you could, you could replace the right left hand, the left analog stick with, with your eyes by like looking at the screen. So it was right. You're fucking me up. Well, you hesitated. And then I said it, you know, I don't know my light from my right from my left. You don't know a lot. I'm telling you the story. I was once driving and I'm driving and post shotgun and po goes, all right, make a left here, whatever it was. And I did this on the wheel and he goes, are you fucking kidding? We were like, we were college students. Yeah. Wait a second. I want to re I will always be a gamer. I will always play the games that we grew up with and that we're",
            "start": 4393.64
        },
        {
            "text": "he goes, are you fucking kidding? We were like, we were college students. Yeah. Wait a second. I want to re I will always be a gamer. I will always play the games that we grew up with and that we're playing now. I don't agree that the nature of gaming is changing. Like I, I, I think that it was, I was, I was fearful that it was, and I was always kidding around before about going down with the ship. Cause I'm not gonna this mobile free to play race to the bottom fucking garbage. I'm not playing that stuff. And what we've seen this generation is I'm sorry, there is a Renaissance and console sales. And what we were talking about before was that, you know, PlayStation four at about 30 million shift more than that now, because the numbers reported September 30th is about to pass N64 after two years on the market, it's, its next target is super Nintendo and Genesis. It's like pretty incredible how quickly it's selling Atari, 2,600 and then slowly it's gonna be 50 and then 60 and then 70.",
            "start": 4428.32
        },
        {
            "text": "years on the market, it's, its next target is super Nintendo and Genesis. It's like pretty incredible how quickly it's selling Atari, 2,600 and then slowly it's gonna be 50 and then 60 and then 70. And then, I mean, this, the console is not gonna stop Xbox one and a PS4 combined are selling 60% better than their predecessors at this point on the market. So, so I do think that it's not going to stop anytime soon. And I think VR is gonna have more hardcore sensibilities. I think what people are afraid about with VR is that it's also gonna have non-gaming implications, which I think is gonna help proliferate it. So. Absolutely. I think the non-gaming implications are gonna be how VR gets into people's homes and how people like get their fire lit about VR. I mean like, they're like so many production companies in Hollywood are already working on VR stuff just because the applications beyond gaming are really gonna be the thing that makes that thing catch on. I think that gaming is",
            "start": 4469.8
        },
        {
            "text": "many production companies in Hollywood are already working on VR stuff just because the applications beyond gaming are really gonna be the thing that makes that thing catch on. I think that gaming is changing, like gaming is broadening. And I think that the console sales speak to that. Like there's a broader market of people who are like, yeah, spend money on a console, but then there's also people who are not paying a dime and they're playing free to play stuff and they're playing on their phone. And I think that it's just gonna continue, you know, evolving and the games that we see now, we're gonna see a lot of those in 50 years, but we're also gonna see a lot of different stuff and it's gonna be frigging cool. Yeah. I'm really interested. I'm never gonna stop playing games, but at the same time, I think me playing games, I've already stopped. Like, I feel like I hit that point where things just aren't the same anymore. Like I grew up being in love with these things and like them",
            "start": 4507.2
        },
        {
            "text": "same time, I think me playing games, I've already stopped. Like, I feel like I hit that point where things just aren't the same anymore. Like I grew up being in love with these things and like them all being these fresh new experiences. And I feel like it's been a really long time since I've been like, I, before it was my life playing the games. Now I just, my life is the games and I like the games, but playing them is not so much the, my de facto standard of what I need to do. And I hope that that changes, but I don't see it changing. Well, yeah, the parameters of your life change. As you grow older, your job situation, your family situation, your living situation, all this changes and gaming. I think there are so many different ways for gaming to adapt to that, you know, like, yeah, like I like, did I beat the Witcher 3? No. Is it like one of my favorite games of the year? Yeah. Am I ever gonna beat another open world adventure game in my life? Very possible. I will not. I mean,",
            "start": 4542.92
        },
        {
            "text": "like I like, did I beat the Witcher 3? No. Is it like one of my favorite games of the year? Yeah. Am I ever gonna beat another open world adventure game in my life? Very possible. I will not. I mean, just cause the, like the trend on those things, it's like, you gotta put 200 hours into it. Am I gonna play another 200 matches of Rocket League? Probably, but you know, like that's all gonna depend on what kind of time I have available. And I think that there, yeah, there's a, gaming is articulated enough that you can fit it in if you want to. And so, you know, as long as you're getting the kind of satisfaction, you're finding the kind of satisfaction you like from games, there's no reason to stop. Yeah, definitely. Can't stop. Won't stop. Zavy Alonzo says, Hey guys, I was wondering, what was that special game that made you love a genre that you weren't too fond of? For me, it was Lunar Silver Star Story Complete on PS1. First JRPG that hooked me until the end. Rub the shows, keep up the",
            "start": 4582.08
        },
        {
            "text": "that special game that made you love a genre that you weren't too fond of? For me, it was Lunar Silver Star Story Complete on PS1. First JRPG that hooked me until the end. Rub the shows, keep up the good work. It's a fantastic game. That's a fantastic game, man. Working Designs back in the late 90s was doing work, dude, like to get some of these games over. It's right there in the title. Yeah, it is. And you know, Lunar Silver Star Story and Eternal Blue, whatever, these are games that we never dreamed we were gonna get in that form, especially because of their heritage on Sega systems. So it's, that's a great example of a game that they get people in JRPGs. I want to say that Medal of Honor, the original Medal of Honor is probably the game that got me in the shooters. I'm a huge shooter fan now. I don't play them online, but I like playing single player shooters a lot. And I have a soft spot for resistance and I have a soft spot for a singularity and even third person shooters like",
            "start": 4625.52
        },
        {
            "text": "fan now. I don't play them online, but I like playing single player shooters a lot. And I have a soft spot for resistance and I have a soft spot for a singularity and even third person shooters like Vanquish. And I wasn't a shooter guy. I was a role playing game in an action and a side scrolling guy when growing up in the late eighties, early nineties, and into the nineties and was a huge into them. My PS1 was like my fucking RPG machine. And when I played a Medal of Honor, I'm like, this is awesome. This is a really, really, really awesome. And it made me appreciate shooters and made me want to play them. So I would say that that's probably the example. That's still a really special game. Yeah. I'm gonna go with Fire Emblem because up until then I was like, I like platformers. I liked, you know, light RPGs, like Pokemon and stuff like that. I didn't even follow fantasy, but I'd never really gotten into the strategy stuff at all. And it wasn't until Melee when I found out Marth and",
            "start": 4666.4
        },
        {
            "text": "you know, light RPGs, like Pokemon and stuff like that. I didn't even follow fantasy, but I'd never really gotten into the strategy stuff at all. And it wasn't until Melee when I found out Marth and Roy were characters from a franchise I didn't even know about. I was like, I like these characters. They're the ones I use. I want to know what game they're from. And I started playing it. I was just like, holy shit, this is a whole type of game. I didn't even know existed. And then since then there's, you know, I played a whole bunch of dabbling, final fantasy tactics and tactics, ogre and all that stuff. Classic games. And it's cool. That genre is so amazing. And it's probably one of my favorite types of gameplay that I didn't even know existed until a couple of years ago. Yeah. We don't get many of them anymore either, which is a shame. Valkyrie Chronicles coming to PS4, which is a, Yeah. Which is huge. That's going to be the next, the next big one we get, I think. For me, Advance Wars.",
            "start": 4700.76
        },
        {
            "text": "many of them anymore either, which is a shame. Valkyrie Chronicles coming to PS4, which is a, Yeah. Which is huge. That's going to be the next, the next big one we get, I think. For me, Advance Wars. I was not a fan of like turn-based strategy like that or whatever. And I just never found a game that clicked for me. I tried different things in, that was a PC thing too for a long, long time, but Advance Wars on DS, man, that was it. Or no Game Boy Advance. Thank you. Sorry. I think I might've ended up playing again on my DS. Game Boy Advance. That was, I mean, I, I remember being downstairs with the light on, trying to get the more light on the screen to play, to see where it's at and the fog of war and all that shit. That was awesome. I can't say that it like particularly ignited a lasting passion for RTSs. But when I played Comet Crash on PlayStation 3, I got so, so into it. It was this, yeah, it was this like one screen, you know, that you don't scroll around the map. You like,",
            "start": 4736.44
        },
        {
            "text": "passion for RTSs. But when I played Comet Crash on PlayStation 3, I got so, so into it. It was this, yeah, it was this like one screen, you know, that you don't scroll around the map. You like, you're basically a floating spaceship and you're building structures that automatically generate units that will just automatically stream towards the enemy. So it was like, it was part RTS and part like, it was more like tower defense and tower offense. So you would build your generators and you would also build your defensive turrets in a way that would create a maze for the other units to go through. And I just got so, so into that game. A couple coworkers of mine did as well. And so, you know, that's, there's nothing like having a coworker next to you in their desk and like to like get you fired up about a game because you can play with them. They're right there. Comet Crash. Yeah. That was, that was a fascinating game. That's a, that's a deep gut. I appreciate that you even know that game.",
            "start": 4774.02
        },
        {
            "text": "up about a game because you can play with them. They're right there. Comet Crash. Yeah. That was, that was a fascinating game. That's a, that's a deep gut. I appreciate that you even know that game. Cause a lot of people, a lot of people just. I knew you would like that one. I love PSN. I love PSN deep cuts more than anything in this world. Chrono 206 says, what are the chances for a Ninja Gaiden collection slash Ninja Gaiden four announcement? Thanks and keep up the good work. Do you have any insight into this? No, it's minimal. I think, I think that, well, he's talking about Ninja Gaiden, like the re-imagining of Ninja Gaiden. I think it would have happened. I mean, we already kind of did get the re release on last gen. Yeah. And Sigma games and all that kind of stuff. We're coming out and, and the thing about Ninja Gaiden that I think, you know, about the Xbox Ninja Gaiden games were that people really loved that first one. It was brutally hard. I mean, that game was really good,",
            "start": 4818.24
        },
        {
            "text": "and, and the thing about Ninja Gaiden that I think, you know, about the Xbox Ninja Gaiden games were that people really loved that first one. It was brutally hard. I mean, that game was really good, but I don't think that there was a lot of diminishing returns. I think with that series for a lot of people. I think it was just up to three people love too. Yeah. People like two, but I think that it reminds me of Devil May Cry a little bit where I think that people or even on Emusha, where I think people are like, all right, like we don't really need this anymore. Of course we do need more on Emusha, but I think that what I would like to see Tecmo do with that IP is go back to the originals because Ninja Gaiden one, two, and three on NES are like really exceptional games. They're a mixture of Mega Man and Castlevania, basically in their mechanics, very fast games though. But you know, the sub weapon, up B kind of thing like to use your sub weapons. It's a very Castlevania game. It's very",
            "start": 4861.4
        },
        {
            "text": "Mega Man and Castlevania, basically in their mechanics, very fast games though. But you know, the sub weapon, up B kind of thing like to use your sub weapons. It's a very Castlevania game. It's very inspired by that, but it's more inspired by Mega Man in terms of its stage layout, stuff like that. And it's brutally fucking hard. And I would, I mean, so that was always been Ninja guidance. The hallmark is the difficulty. The first Ninja Gaiden games fucking really hard. These are really hard games. And I'd love to see them like go back similar to what Capcom did with Mega Man nine and 10 and go back and make those games again to like do something a little simpler, a little cheaper. They can probably make a game like that for a million dollars or less. So it's, I'd prefer to see them do something like that. I don't think you're going to see much more Ninja guide. And you saw a little bit of a Renaissance with it on Vita actually, but yeah, I don't, I don't think so. I don't think that's",
            "start": 4902.0
        },
        {
            "text": "like that. I don't think you're going to see much more Ninja guide. And you saw a little bit of a Renaissance with it on Vita actually, but yeah, I don't, I don't think so. I don't think that's in the cards. You can't ever count out a name like that, that has some kind of cache in video game history, right? And that's just because of the fiendish love for nostalgia that runs through the whole industry. But I do think that they will have to do something like Tomb Raider ask, like it'll have to be some kind of rebooting element to it. It'll have to take some kind of modern form that takes, you know, the, the challenge and the nimbleness of, you know, Ryu Hayabusa and then, and yeah, makes, makes it a, maybe it's a platformer, 2d platform, maybe it's an open world game. I don't know, whatever. There had, they need some strong game design gimmick and then attached the name to it. It's the name is not going to lead that development. I don't think. Yeah. I think the conundrum is, I mean, it",
            "start": 4934.6
        },
        {
            "text": "There had, they need some strong game design gimmick and then attached the name to it. It's the name is not going to lead that development. I don't think. Yeah. I think the conundrum is, I mean, it reminds me a little bit of Strider where they, they made that, you know, Capcom put out that, that Strider almost 2.5 HD castle or Metroidvania kind of game. And I actually thought it was like really underrated. I thought that game was fucking awesome. I think that you need to go back to its core and then figure out what made it good to begin with and then go from there. I'm with you though. In the sense that Tecmo Koei doesn't really need to do this because it reminds me a little bit of valve to a much lesser degree. We were talking about half-life three and like the imperative of doing it. Like there's no reason for them to make that game. They will, but there's no reason for them to actually do it. And I think with Tecmo Koei, they found some moneymakers in dead or alive. They found",
            "start": 4976.24
        },
        {
            "text": "Like there's no reason for them to make that game. They will, but there's no reason for them to actually do it. And I think with Tecmo Koei, they found some moneymakers in dead or alive. They found moneymakers even in the Autelier games and stuff like that, where it's like, you don't need to take too many risks. This isn't a huge publisher to make a game like Ninja guide and to make it viable. Like they don't really, when you think about it, they don't really make triple a games anymore. Like real, you know, if you don't count them as so games and stuff like that, which I don't, I don't, I think they're a games, but I don't think Omega force makes triple a games. You have to wonder the viability of even a studio, a company like that investing the money because to make it, to make a proper Ninja guide and game that this person's probably envisioning would cost 30, $40 million, maybe. So it's, it's, you know, it's not a cheap investment. I mean, I actually, I disagree with you guys. I",
            "start": 5011.04
        },
        {
            "text": "Ninja guide and game that this person's probably envisioning would cost 30, $40 million, maybe. So it's, it's, you know, it's not a cheap investment. I mean, I actually, I disagree with you guys. I think that there is definitely a chance of us getting more because I think that there is like a hole for that type of game that we're not really getting so much in this generation. Like there's bloodborne and stuff like that, but that's different than, Oh way different. Than the like the devil may cries and those things and like this generation, like the Bayonetta and stuff. And when you're looking at like the PS4 and Xbox one, there's not enough, like there isn't too much for those hardcore motherfuckers. Sure. I wouldn't be surprised if sometime we saw an announcement, I don't think it'd be a Tomb Raider esque reboot, but at least like a reboot of the Xbox franchise with platinum. Sure. But remember to that point, you could be right. But remember that the trends in these kinds of games",
            "start": 5041.94
        },
        {
            "text": "a Tomb Raider esque reboot, but at least like a reboot of the Xbox franchise with platinum. Sure. But remember to that point, you could be right. But remember that the trends in these kinds of games Bayonetta two wouldn't have happened if it wasn't on the Nintendo console, then no one else wanted it. So I didn't want it. The, you know, if you look at games like DMC, like a Ninja theory is not going to do another DMC game. They could have very easily didn't sell that well. They re-released devil may cry for HD. I don't think it did that well. They're exploring games like dark side, which is more of a Zelda esque game. It's still a third part person action game. You're right. But I don't, I don't know if it's going to be a Ninja guy. I wouldn't mind seeing it. I like Rio Hayabusa or Ryu. Lone desk 42 says, hi guys, what do you think of the positives and what do you think are the positives and negatives about backwards compatibility for the Xbox one? I don't know if there's many",
            "start": 5077.14
        },
        {
            "text": "Ryu. Lone desk 42 says, hi guys, what do you think of the positives and what do you think are the positives and negatives about backwards compatibility for the Xbox one? I don't know if there's many negatives. There's no negative for the consumer. Yeah. There's a lot of negatives for the publishers and there's, and these are robbed them of all their HD remakes stuff. Yeah. That, and I think it's also had, it's got blow back on Sony now because we'll a studio, like we talked about mass effect, right? There's gotta be a mass effect trilogy, HD, HD, HD. We released on PS4 for in time for Andromeda yet. There's no need for that on Xbox. So does, does, does EA put in the work to release that only on PlayStation? They're like cutting their audience in half. I think the optics of it is really bad actually for them to even fuck with that. It makes it put Microsoft. That's why I think that that was the biggest announcement in E3. Cause that really fucking put Sony on the ropes in terms of what",
            "start": 5110.82
        },
        {
            "text": "actually for them to even fuck with that. It makes it put Microsoft. That's why I think that that was the biggest announcement in E3. Cause that really fucking put Sony on the ropes in terms of what they're doing with, with Gaikai and PlayStation now and stuff like that. And, and didn't show tone deafness, but showed a pretty shrewd changing of strategy on Microsoft's part that they're actually going to sacrifice the dollars they can get from HD remakes by making Xbox alive. How much that actually would affect sales though. Like just like the fact that you could play the old one on it, would that really affect an HD version of those games being made? Well, they're already in HD. So that's what I'm saying. The, the, yeah, I do because if you could get mass effect, one, two, and three for $30 combined an Xbox alive, or you can buy them for $60 on Xbox one on a disc like that. I mean, that's going to look bad, but I mean, if there's like added stuff and it's like, you know, the",
            "start": 5155.1
        },
        {
            "text": "for $30 combined an Xbox alive, or you can buy them for $60 on Xbox one on a disc like that. I mean, that's going to look bad, but I mean, if there's like added stuff and it's like, you know, the definitive edition and it's more, I don't know personally, I'd want that stuff. Like I would too, but I mean, you can predict this pretty, pretty easily how that's going to go down. You know, I think, but I mean, I think it's like also just the ease of use of how people buy games. Like, yeah, the people that are like real thrifty motherfuckers are like, well, I could buy it like this, but majority of people are just going to see the $60 game on the storefront and be like, Oh, I want that. Yeah. Yeah. It'll definitely distract some, but I don't think it'll attract a majority. Let's see. Let's end on this one. A Chetty says, Hey guys, every once in a while, I'll see a games journalist tweet a link to an article on a competitor's site. I don't quite understand why someone would want to drive",
            "start": 5193.06
        },
        {
            "text": "on this one. A Chetty says, Hey guys, every once in a while, I'll see a games journalist tweet a link to an article on a competitor's site. I don't quite understand why someone would want to drive traffic to a competitor's site, especially if their outlet has already posted an article about the topic. Can you talk about the strange competition between gaming media sites or maybe the lack thereof? Thanks and keep up the fantastic work. I thought this was an interesting one to have with you on the show. I work for a games media website. So like speaking personally, if I am tweeting something from a competitor's site, it's because I mean, I don't, maybe to my employer's chagrin, I don't necessarily scour to be like, do we have this version of the site? I mean, if it's a news article, yeah. But if it's like, if it's a feature and then we're not going to have that feature on our site. And so I'm going to link to that, to that site because I find it interesting. And because like, for me,",
            "start": 5228.26
        },
        {
            "text": "But if it's like, if it's a feature and then we're not going to have that feature on our site. And so I'm going to link to that, to that site because I find it interesting. And because like, for me, it's about, and for, I think of a lot of my coworkers, it's about just like being kind of a well-rounded like consumer of media. Like I, you know, I tweet GameSpot stuff a lot, but I don't want to be only tweeting GameSpot stuff. I want to be perceived as I am an omnivore of, you know, games media coverage. I do check out other sites. I do follow other links and I'm interested, you know, where interesting content is. You know, I'm gonna, I'm gonna show the stuff that I do and the stuff that my coworkers do that I think is cool, but I'm definitely also like down with sharing stuff that you guys do and other people do that is interesting. Yeah. I think, I mean, honestly, I think it's definitely just the generation we're in now of it all right. Like I think the walls and the barriers have",
            "start": 5268.9
        },
        {
            "text": "do and other people do that is interesting. Yeah. I think, I mean, honestly, I think it's definitely just the generation we're in now of it all right. Like I think the walls and the barriers have fallen away. Like now it very much is everybody's people. I remember when I started at IGN and like, we hated GameSpot and GameSpot hated us and like Brad Shoemaker and I'll joke around about it now how like they weren't supposed to talk to us at events and like, we'd be next to each other and we wouldn't say anything, do you know what I mean? And like, now Brad's a friend. And he's super cool. And it's like, man, that was weird that when we started, it was so old school that it was like for real, Jets and Sharks kind of shit. Like don't react. It was odd. Yeah. But like every, yeah. And speaking of Jets and Sharks, I total anytime I see like IGN people on the street, I like to pull this move. It's just really funny. Exactly. But now it's one of those things where I think like the industry is",
            "start": 5312.12
        },
        {
            "text": "of Jets and Sharks, I total anytime I see like IGN people on the street, I like to pull this move. It's just really funny. Exactly. But now it's one of those things where I think like the industry is like, there's the site. And then there's you and like you have the fact that you go and hang out with all these people who work at different places and you want to support your friends and everybody moves around too. The business is very incestuous now. It's incestuous. Yeah. And I also think, you know, people, people, you know, not to, not to, you know, go too far into it or whatever. People, one of the people that I really admire is Jason Schreier at Kotaku. And I think he does great work. I think Gawker overall is shit. And I mean, and I, and I've said that, I've said that pretty openly. Like I think that that site relax or that, that body of, of sites lacks scruples. I think that they are going way overboard with the way they attack people. They, they, you know, they out people and",
            "start": 5344.24
        },
        {
            "text": "Like I think that that site relax or that, that body of, of sites lacks scruples. I think that they are going way overboard with the way they attack people. They, they, you know, they out people and they do all sorts of fucked up shit, but that doesn't reflect the way I feel about Jason's work. You know what I mean? I think Jason and Patrick over there are doing great work and I'm friends with them and I linked to their stuff. So you can have an intellectually honest conversation about like, I think Gawker is garbage, but I don't think Kotaku is garbage. And I don't think the people that work there are garbage. I think that there are some of the best people in the industry. And so you have to look at things like selectively and find the people that you trust in your life. It doesn't necessarily mean you endorse the outlet. And it doesn't mean necessarily that you endorse everyone that works there. When I worked at IGN, my opinions run very, very, you know, not parallel to many",
            "start": 5381.76
        },
        {
            "text": "necessarily mean you endorse the outlet. And it doesn't mean necessarily that you endorse everyone that works there. When I worked at IGN, my opinions run very, very, you know, not parallel to many people's at my site. And they still let me write and still let me say what I needed to say. And I still do those things to this day. So I think it's part of being intellectually honest is finding the people that you like and linking to those things and pertinent stories. When someone breaks a big scoop, it might be easiest to go to your site and then link out to the citation of that, but maybe it's better and more honest to link to the original source. So that's, that's the kind of stuff that I, you know, that's kind of how I feel about it anyway. Yeah. I'm a big fan of just supporting people. So it's like any way you can actually support the individuals, I think that's a good thing. And like when 99% of this stuff is just the exact same news story said by 10 different people in slightly",
            "start": 5415.12
        },
        {
            "text": "So it's like any way you can actually support the individuals, I think that's a good thing. And like when 99% of this stuff is just the exact same news story said by 10 different people in slightly different ways, it's like, it doesn't matter. But whenever someone does a creative feature, not even creative, just a feature that I'm like, oh, this is interesting for whatever reason. I like sharing that stuff. And even when it's like videos and things like I had a different experience. Cause I was in the video team at IGN, but like it got really weird sometimes when the, instead of our competitors being GameSpot, it was our competitors being YouTube. And like, if I post like I got pulled aside sometimes for just like, oh, I like, why are you promoting this YouTube channel? It's like, this has nothing to do with what we're doing. But then that was like old school kind of, that was the old school of the new school. Like there's been phases, you know, and like the, now people get it. Now",
            "start": 5449.28
        },
        {
            "text": "has nothing to do with what we're doing. But then that was like old school kind of, that was the old school of the new school. Like there's been phases, you know, and like the, now people get it. Now people are like, oh, this is the era of collaboration. This is the era of everybody kind of like being friends with each other. Cause that's how people kind of grow. And if you're not doing that, if you're being a dick and you're just like, what I say is all that matters, your shit's not good. Or I'm not even going to talk about your stuff. You're going to fall behind and you're not going to go anywhere. Like it's, I think very important for you to support the people that are you think are doing cool things in your area of expertise, because like, yeah, that's what is going to make you grow. And that's going to make those people look at you in a different way. Like today, Buzzfeed put out this, this is the start of their new like 12 part series that you can buy on iTunes and get it early",
            "start": 5483.6
        },
        {
            "text": "And that's going to make those people look at you in a different way. Like today, Buzzfeed put out this, this is the start of their new like 12 part series that you can buy on iTunes and get it early and stuff. And this is the first Buzzfeed motion pictures. Like it's like a movie that they're putting out. I'm like, I support that. Like, I'm excited to watch it. And I tweeted about it. I was like, you should go support this. See if this is cool. And like, I like that. I like that there's people doing different things and like, you know, you guys are going to tell me not to do that shit. Cause why would you? Well, I think you're, you have free will, so you can do whatever you want, but it's. Everyone has free will in this company, except Kevin. Yeah. I think, I think you just have, I agree with you. It reminds me a little bit of, you know, like it, things have changed. I've been in this industry and Greg has, you know, long enough to know that it's changed radically into the way we",
            "start": 5521.16
        },
        {
            "text": "with you. It reminds me a little bit of, you know, like it, things have changed. I've been in this industry and Greg has, you know, long enough to know that it's changed radically into the way we look at our competitors. And I agree that the old way of doing things is dying. So like people have to get on board or, or perish. And so to Chris's point, like, if you see a great article, you should support it. That's why I was so bummed about Grantland. Like, and I used to say, even when I worked at IGN, I used to be like, Grantland is the best website on the internet. You know, like, and like I said that as an employee of another website, that's just me being honest with the way I feel it doesn't mean that I hate the things that I used to do. It means that this is fucking good. And so then you find the individuals like Bill Simmons, for instance, and you can follow them around. It's becoming about individuals and about, you don't need an audience of millions anymore to survive and to, to,",
            "start": 5551.8
        },
        {
            "text": "find the individuals like Bill Simmons, for instance, and you can follow them around. It's becoming about individuals and about, you don't need an audience of millions anymore to survive and to, to, to reach people and stuff. So I think it's, I think it's all positive, but I think people have to remember to not throw the baby out with the bathwater sometimes with this shit, you know, and that's what I was, that's my Gawker example, where I was so disgusted with what they did to that guy from Condé Nast. I thought it was like one of the fucking most disgusting things that I've ever seen in my life, but that's not Jason's fault. You know what I mean? And so, you know, that's kind of where I stand on that. Ladies and gentlemen, this has been the kind of fun. The games cast, the first ever episode 47. In fact, Chris, thank you so much for joining us. You guys, it's been awesome. This has been really fun. Thank you for hosting me once again. You guys for having me. Buy his book. Yeah. It's",
            "start": 5587.0
        },
        {
            "text": "47. In fact, Chris, thank you so much for joining us. You guys, it's been awesome. This has been really fun. Thank you for hosting me once again. You guys for having me. Buy his book. Yeah. It's on Amazon. It's really fun. Read. I think you're going to like it. You're going to laugh. You're going to feel good in your heart. You're going to cry so many emotions. You might feel emotions, man. There's some emotional video games. There definitely is. Thank you guys. As always. Thank you. You know, yeah, here we are. I got to go lay down my back. Yeah, things are happening. Bye. Love you.",
            "start": 5616.96
        }
    ]
}