{
  "id": 2132,
  "video_id": "0SLm2BlJL3Q",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "Nintendo Switch vs. PlayStation Vita - PS I Love You XOXO Ep. 58",
  "description": "A Best Friend wants to know if the Switch is the final nail in the Vita's coffin, but Greg and Colin want to know if that happened a long time ago. (Released 10.25.16)\n\nVote for the worst PSN name of the year: https://goo.gl/forms/JmuWPk2iaT8fLcDs2\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://youtu.be/HPHXnClP4fg\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
  "published_at": 1477411200,
  "duration": 6459,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to PS I Love You XOXO episode 58. I'm one of your host, Greg Miller, alongside he only does everything, Colin Moriarty. It's good to be here with you today. It's good to be here with you today as well, C. How have you been? I haven't talked to you at all. I'm fantastic. Yeah, no, I mean, I've never been fantastic life, but not no, things are good. Everything's fine. What you been playing? Uh, not too too much. Uh, I've been playing Civilization 6, uh, primarily. You got it. Um, and uh, it's not on PlayStation, is it? Good though. It's excellent. Ex, uh, it makes my my I have an Origin very capable Origin laptop right here that plays games just fine. Plays played. We played Battlefield 1. I like the highest settings on it. It was incredible. I have Civ 6 running at medium settings, um, across the board, makes my laptop run so hot. It is incredible. I I really only like I played for an hour or maybe 90 minutes at a time and I like shut it off. I'm like, I don't this thing's going to combust you.",
      "start": 0.5
    },
    {
      "text": "The board makes my laptop run so hot. It is incredible. I I really only like I played for an hour or maybe 90 minutes at a time and I like shut it off. I'm like, I don't this thing's going to combust, you know? So, uh, so that's an issue. But uh, have you blown have you used the compressed air? Someone told that's what someone told me to do, but I don't have any compressed air. You go, they'll have it around the corner store. Go over there, get some. What are they compressed air from 1987 at that store? You you know they do. They're going to have it all set to go for you. Someone told me to do that. I don't know if it's going to work, but yeah, some something what do you have to lose? Um, and then on I've been play messing around a little bit with Dragon Quest Builders on Vita and uh, how far you now? Not much further in Chapter 2. No, I'm in Chapter 2. I'm pretty deep. I'm about to beat it. I think it's because what I playing on the plane rides? Um, it's interesting. The I'm now we've been doing these ongoing",
      "start": 61.2
    },
    {
      "text": "Much further in Chapter 2. No, I'm in Chapter 2. I'm pretty deep. I'm about to beat it. I think it's because what I playing on the plane rides? Um, it's interesting. The I'm now we've been doing these ongoing impressions of Dragon Quest Builders, you and I. I'm saving it of course for the road whenever I go try not to play it at home. So we, you know, a lot of the Chapter 1 impressions we talked about the fact of they there these challenges that are part of the trophies, but how would we know about them when we be the chapter? You get to see them, whatever weird loading system. Sure. The Chapter 2's world is so much different than Chapter 1 in terms of how I was talking about it being baby's first Minecraft in Chapter 1. The difficulty starts to ramp up a bit in terms of like, well, now it's not as easy to find all these different things. You have to go this way and do that thing. Interesting. Uh, and then Battlefield 1 I played uh, quite a bit. Yeah. Um, I'm really I'm playing on Hard and uh, I'm looking",
      "start": 100.0
    },
    {
      "text": "To find all these different things. You have to go this way and do that thing. Interesting. Uh, and then Battlefield 1 I played uh, quite a bit. Yeah. Um, I'm really I'm playing on Hard and uh, I'm looking for all of the field manuals and I'm doing all the challenges. So I've only so I'm taking my time and kind of backtracking a little bit. Um, so I'm only done with the first vignette. There are four of them, I think, or five. Um, game's excellent. And uh, you know, I think the the hallmark, the essence of Battlefield has always been the the destructible environments, these these wide open environments that don't funnel you but give you options. That's all there. Uh, the first uh, mission or the first vignette I played was a British tank group that is in a tank called Best and they're trying to basically get from point A to point B. And so you play like five different chapters with them. And now it's a quick aside as somebody who hasn't jumped into the single player beyond the pro the prologue to get us into",
      "start": 134.72
    },
    {
      "text": "Point A to point B. And so you play like five different chapters with them. And now it's a quick aside as somebody who hasn't jumped into the single player beyond the pro the prologue to get us into play multiplayer. So I had my feet wet. When you say you played the this first vignette, that's the it's not nonlinear, right? You everybody starts with this tank people or do you get to pick where you start? Uh, Tim and I were talking about it like you can jump from story to story. So I don't know. I I started where the prompt put me. Like they're numbered, but it seems like you can jump to them. I don't know if that necessarily played order or not because the what I'm playing, it's not spoilers because World I don't know if you know World War I happened, but the particular campaign you're fighting in in the in in that first vignette takes place like a month before the war ends. So I don't I don't think that they're in any way L like in any way on a timeline from 1914 to 1918 necessarily, but I could be wrong. Um, but",
      "start": 178.0
    },
    {
      "text": "First vignette takes place like a month before the war ends. So I don't I don't think that they're in any way L like in any way on a timeline from 1914 to 1918 necessarily, but I could be wrong. Um, but what I like about it, what I want to get props to, the gun plays great. The game's fun. Um, the technology is very impressive. Like these, you know, you really are I mean, this has always been Battlefield's thing, but it really destroying these building, you really are destroying. Yeah. And it really is kind of amazing to look back at what you've done uh, as you play through these big maps. But um, the emotional resonance of this particular game is unlike I've ever seen in a a military shooter in terms of the story, in terms of connecting with the characters. Yeah. The what I like about it is the the the prologue of the game, you basically play as these guys until you're dead. Like you're you're just supposed to die multiple times. Everybody to die. But when you die in the campaign, like it just puts",
      "start": 211.36
    },
    {
      "text": "The prologue of the game, you basically play as these guys until you're dead. Like you're you're just supposed to die multiple times. Everybody to die. But when you die in the campaign, like it just puts up like the date says like you died today or whatever. Like that particular character as if, you know, it's not supposed to happen that way for this particular character. But the cutscenes very emotional. The the I really felt with Battlefield 1 with this particular tank group, this just group of four guys, like a lot of emotion. It's really quite fascinating. You feel a lot of fear like for them. And and I like that this game really puts a lot of context into the games we play, um, by making death, uh, you know, you you die like in any other game, but the game slows down and when you're dying and you know what's happening, it's kind of like weighty. Reminds me a little bit of The Last of Us in that way where when you're killing guys and and GS in that game, you you feel you're very aware that you're doing it.",
      "start": 253.64
    },
    {
      "text": "Happening, it's kind of like weighty. Reminds me a little bit of The Last of Us in that way where when you're killing guys and and GS in that game, you you feel you're very aware that you're doing it. So it's uh, it's cool. I think people are really going to dig it. I think it's obviously the game to beat this fall. So we'll see. This is going to be the week you hang it up, right? And join me on the battlefield of Titanfall. No, we get in our mechs. We run around in our Titans. We're going to do something. Get the shotgun. Get the Boost. Climb over stuff. I can't wait. My priority is is uh, things are going to start slowing down a little bit. We have The Last Guardian coming later and a few other sporadic games. But this is going to give me a little bit of time to kind of figure out what I want to do. So I'd like to get through Battlefield. I'd like to jump back to Tomb Raider if I can. I mean, this is the plan. I don't know if this is going to happen or of course not. Something will pop up. I'm sure some",
      "start": 294.24
    },
    {
      "text": "I'd like to get through Battlefield. I'd like to jump back to Tomb Raider if I can. I mean, this is the plan. I don't know if this is going to happen or of course not. Something will pop up. I'm sure some other games pop up. I want to spend a lot of time with Civ 6 because I really enjoy it. Um, and then somewhere in there Call of Duty is going to be played. I don't know necessarily that I'm even going to get to Titanfall. Um, and I don't really care to be honest with you. So I I be I'm curious, but there are other games I'm more curious. You come watch me like you did last time. Yeah. So, um, yeah, that's basically it. I think for um, you know, I've been I've been like trucking very slowly through that game Virginia with Aaron. Oh, really? Still going very slowly. Like very slow. I've I've beaten Virginia. I enjoyed Virginia. What's your take on Virginia? So on yet? Yeah, no, you didn't go back and platinum it. I'll tell you what, because I was I did Platinum Job Simulator. Oh, and that's what I was looking for. Somebody asked a",
      "start": 329.24
    },
    {
      "text": "What's your take on Virginia? So on yet? Yeah, no, you didn't go back and platinum it. I'll tell you what, because I was I did Platinum Job Simulator. Oh, and that's what I was looking for. Somebody asked a question about that if you were going to do it because the trophies are easy. Apparently they're all Golds. Uh, yeah, all Golds. How much time do you have to sing in to do it? Um, I want to say it would take you no more than 5 hours. Yeah, but maybe even less. Sure. You have to just beat the game. Do everything in the game for all four types job types. And then you have to just go back each each one has like a special thing. Like at the at the convenience store, you have to like scratch the scratch off tickets until you win. At like, uh, the um, what's another example? Something happens at the auto shop, of course. And something happens at the office. Like you have to take a statue and put it into the grinder and stuff like that. So easy. Just time consuming a little bit. Yeah, it's not it's not it wasn't bad. I did say that",
      "start": 364.08
    },
    {
      "text": "Happens at the office. Like you have to take a statue and put it into the grinder and stuff like that. So easy. Just time consuming a little bit. Yeah, it's not it's not it wasn't bad. I did say that it was an unsatisfying platinum in the sense that it was easy, which are usually unsatisfying platinums anyway. But um, just hearing the ding and not seeing the prompt. Yeah, I hate that. Kind of a little disappointing, right? Right, right. No, Virginia I was enjoying playing through. It's a very interesting experience. A very different kind of game. It it was it's it reminded me a bit in terms of me getting uh, the urge to go buy it in the same way I got the urge to go buy Gone Home where it was strictly people saying this game's awesome. Don't read stuff about it. Just go play it or whatever. And jumping in, I had no idea what I was getting into. Played it in two sittings just because I was tired the first time. And the more and more that game builds, I don't want to rooting for people and things. It was like",
      "start": 403.88
    },
    {
      "text": "Had no idea what I was getting into. Played it in two sittings just because I was tired the first time. And the more and more that game builds, I don't want to rooting for people and things. It was like, oh my God, oh my God, oh my God, this is really cool. This is interesting. What's it going to be? Am I playing? What is the exact story we're getting? And then getting to the end, I wanted a spoiler cast. I tweeted out about it. I got some different links, looked at some videos, read some stuff. But then I was like, all right, cool. Now I'll go back and get the trophies because it was, you know, it's an easy Platinum. And you go back and you look and it's like, it's one of those where I'm going to have to watch the even reading the trophy road map. I'm like, okay. And then it was like, I'm going to have to watch the video. And I look at the video and it's an hour and a half. And looking at an hour and a half long video, I was like, I can't justify this. I can't I don't want to be the guy sitting there hitting play",
      "start": 439.24
    },
    {
      "text": "Video and I look at the video and it's an hour and a half. And looking at an hour and a half long video, I was like, I can't justify this. I can't I don't want to be the guy sitting there hitting play, watching and like, all right, cool. And then coming back up and doing that and then hitting play. And I'm like, I don't do this. It's not worth it. Can't do it. Enjoy the game too much to put it through some kind of grinder like that. If you didn't know, PS I Love You XOXO is KindaFunny.com's PlayStation podcast. It is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. Pacific Time on podcast services and YouTube.com/KindaFunnyGames. So please subscribe to the YouTube channel. Go to KindaFunny.com. Subscribe to the other YouTube channel. Watch love and sex stuff. If you see Kevin, throw cupcakes at him. If you like us on iTunes, like us there and leave us little reviews. If you don't like us on iTunes, don't say a goddamn word. Just stop listening to the show and go",
      "start": 467.84
    },
    {
      "text": "You see Kevin, throw cupcakes at him. If you like us on iTunes, like us there and leave us little reviews. If you don't like us on iTunes, don't say a goddamn word. Just stop listening to the show and go away. Colin, yes, let's begin the show with what is and forever will be Roper's Report. Time for some singular possessive news. There are 11 items on a Baker's Dozen. Number one, The Last Guardian has officially gone gold and is ready for manufacture in anticipation of its release on December 6th. Initial word came by way of Sony producer John Yoshino who tweeted out that the game was finished before deleting his tweet. However, Shu Yoshida followed it up with a tweet of his own stating the following quote, \"I've waited a very long time to say this. The Last Guardian has gone gold. I'm so excited for all for you all to finally experience.\" A note for people that don't know, going gold means the game is basically done, ready for for manufacture. Yeah, now they can go distribution. Now, do you think the tweet was",
      "start": 508.04
    },
    {
      "text": "You all to finally experience.\" A note for people that don't know, going gold means the game is basically done, ready for for manufacture. Yeah, now they can go distribution. Now, do you think the tweet was deleted because, oh no, I wasn't supposed to say that, or because Shu was like, no, this is my moment, get out of here. Probably the former. You'd have to assume. I don't I don't think Shu would make someone delete a tweet so he can write the same thing. Well, you never know. He could have just written it and he would have still gotten 10 times more pickup. You never know. Shu's crazy. So congratulations to Studio Japan. It only took you 10 years. I'm excited to play. I want to know what the I want to know how it all ends. I want to know what the hell this game is going to be. I I I'd be lying to you if I said I was excited about it, but I'm but I'm I'm curious. Yeah, and I said it on Colin & Greg Live, my prediction, 5 hours. Um, and uh, I suspect will resonate with a group of people and disappoint a yeah, it'll",
      "start": 552.6
    },
    {
      "text": "I was excited about it, but I'm but I'm I'm curious. Yeah, and I said it on Colin & Greg Live, my prediction, 5 hours. Um, and uh, I suspect will resonate with a group of people and disappoint a yeah, it'll resonate with your cable. I just don't think it can live up to any sort of expectation. I feel this is this is almost gospel, but we'll see what happens. I don't know. I've not gone hands on with it at all. Number two, as predicted, Rockstar did indeed announce the new Red Dead game. The third game in the Red Dead series is Red Dead Redemption 2, which when looking at the trailer, the title and more seems to indicate that it's either a prequel or a sequel to Red Dead Redemption. The game is set for launch on PlayStation 4 and Xbox One, no PC, in the fall of 2017, meaning we have to wait a whole year for the game. Rockstar's brief press release says the following quote, \"An epic little burp coming up there.\" It said that in the press release? No, that's just me. Quote, \"An epic tale of life in America's unforgiving",
      "start": 586.72
    },
    {
      "text": "Rockstar's brief press release says the following quote, \"An epic little burp coming up there.\" It said that in the press release? No, that's just me. Quote, \"An epic tale of life in America's unforgiving Heartland. The game's vast and atmospheric world will also provide the foundation for a brand new online multiplayer experience.\" End quote. Additionally, Sony has confirmed that it's worked out some sort of special arrangement with Rockstar that will net PS4 gamers some content early if they play Red Dead Redemption 2 on PlayStation 4. On the PlayStation Blog, Sony wrote quote, \"We are pleased to announce that PS4 players get first access to earn select online content in the vast open world of Red Dead Redemption 2.\" Unquote. That's all we know for now. Uh, important to note too, uh, and this is an interesting wrinkle, commercials for the game played during uh, Sunday Night Football and during Walking Dead, um, which I think is strange. They're crazy. They want to sell more than GTA somehow. Booty Pop 88 says",
      "start": 631.76
    },
    {
      "text": "Wrinkle commercials for the game played during uh, Sunday Night Football and during Walking Dead, um, which I think is strange. They're crazy. They want to sell more than GTA somehow. Booty Pop 88 says, \"What's up, Colin and Greg? I was curious of what you guys think of having seven playable characters in Red Dead Redemption 2. I know you guys have said you would prefer just one character and a more focused story. I know I freaked the out when they announced three characters for GTA 5, but that turned out awesome. So do you think they could hit gold again with Red Dead Redemption 2? Thanks, Dustin. PS, I am lovable.\" Did we in the end love the three characters of GTA V? I loved GTA 5. I had a great time with GTA 5. I totally feel more connected to my silent protagonist of GTA 3, uh, my 80s guy, Ray Liotta, whose name I suddenly Vincent, no, somebody, whatever. I don't remember. It's been literally years since I play. And then CJ. I liked I liked having I still like having one character, one",
      "start": 668.96
    },
    {
      "text": "80s guy, Ray Liotta, whose name I suddenly Vincent, no, somebody, whatever. I don't remember. It's been literally years since I play. And then CJ. I liked I liked having I still like having one character, one protagonist and one thing. I think GTA V was fun and different and I loved Trevor and I loved Michael, but at no point was I like super invested. I felt really in those characters, let alone when like Trevor's total psychopath and rapist and all these different things. Um, in terms of seven playable characters for Red Dead 2, God no, please don't do that. Please under no circumstance make all seven playable. Please God no. Yeah, I don't think they would do that. It would be interesting to see a little Battlefield 1. We were just talking about a little vignettes. Yeah, but I don't necessarily think that that's necessary. What I loved about Red Dead Redemption period was being John and going out into the woods and getting all these pellets and like feeling ARPG is of going through and",
      "start": 716.24
    },
    {
      "text": "Think that that's necessary. What I loved about Red Dead Redemption period was being John and going out into the woods and getting all these pellets and like feeling ARPG is of going through and doing these different things and making a story around it and making a legacy around that. I don't I don't I don't like being broken out of the game like I was in GTA 5 and shot over here and gone down here. Nor do I think I'd want to be vignettes necessarily when I I that's an open world. I want to exist in that world. I want to make changes. I want to kill people and have that resonate and matter and do these different things. I know you want to kill people for sure. I want to kill people. And man, we'll see. Top of the list, Tim Gettys debating what it is is is who who knows at this point. It's not even really worth doing. Sure. I think seven playable characters is too much. It'd be interesting to see if they bring some of that multiplayer stuff into it though. I agree. Uh, Los Cry says, \"Hi, Colin, Greg, big fan",
      "start": 754.28
    },
    {
      "text": "Worth doing. Sure. I think seven playable characters is too much. It'd be interesting to see if they bring some of that multiplayer stuff into it though. I agree. Uh, Los Cry says, \"Hi, Colin, Greg, big fan from Cuba. We welcome your imports for the first time in a long time.\" Really from Cuba? Yeah. My question is simple. With the news of Red Dead Redemption 2 confirmed for fall 2017, do you think there is a possibility of a Red Dead Redemption 1 HD coming to the PlayStation 4? I would like to hear your thoughts about it. Keep up the great work. Blah, blah, blah, blah, blah. And if you ever find yourself in Miami, it would be a pleasure to buy you guys a drink. It's a doubtful. I Red Dead Redemption, uh, is available on PlayStation Now, I think. And I think that that's going it's about to. And I think that's going to be a resolution. I I assume that, you know, there's not an impetus for them to do it, especially on Xbox One because it is already backwards compatible with Xbox One from Xbox 360. So then putting all those",
      "start": 791.04
    },
    {
      "text": "A resolution. I I assume that, you know, there's not an impetus for them to do it, especially on Xbox One because it is already backwards compatible with Xbox One from Xbox 360. So then putting all those resources in a one port, um, for PS4 seems a little silly. Also, Rockstar does not have any legacy of doing that with their games. So, um, there are no HD collections for, you know, they they've re-released like Grand Theft Auto the trilogy, their PS2 Classics and and the PSP games are playable on Vita or whatever. Like, but they don't they don't really seem to go through jump through hoops. Although they did recertify them, um, to get trophies on GTA 3, Vice City, and San Andreas, and then Bully and uh, The Warriors and stuff. So they they are going down that road in a way, but not not was like, you know, the tipping point between generations. So that's why probably saw one next-gen an old-gen version. But yeah, I'm with you. I just don't you're talking about one platform really matters and counts now unless they",
      "start": 829.04
    },
    {
      "text": "Point between generations. So that's why probably saw one next-gen an old-gen version. But yeah, I'm with you. I just don't you're talking about one platform really matters and counts now unless they wanted to put together a definitive edition. But then the ball would have been in motion. I think you would have seen a dual announcement of that. Get now, you know, get the re-released HD Crazy definitive edition of Red Dead and also get the beta for Red Dead Redemption 2 or some crap. Yeah, well, they could have done with what Ubisoft did with South Park where they you got or with what Activision with Call of Duty: Modern Warfare where you get that game for pre-ordering the new game and that's the only way you can get it, whatever. But they didn't do that. Number three, some new interesting details about PlayStation 4 Pro have emerged. For starters, the new PlayStation 4 will contain one extra gigabyte of RAM, according to IGN, quote, \"We felt games needed a little more memory, about 10% more, so we added about 1",
      "start": 870.04
    },
    {
      "text": "4 Pro have emerged. For starters, the new PlayStation 4 will contain one extra gigabyte of RAM, according to IGN, quote, \"We felt games needed a little more memory, about 10% more, so we added about 1 gigabyte of slow conventional DRAM to the console.\" End quote. Sony's Mark Cerny told the website this memory will be used for non-gaming purposes, apparently freeing up some of the console's core RAM for other purposes. In addition, GameSpot confirms that PlayStation 4 Pro will come with a swappable hard drive just like PlayStation 3 and the original PlayStation 4 before. So little tidbits leaking out in uh, anticipation of its November release. Bart 546 wrote into KindaFunny.com/psq just like you can to get your question read on PS I Love You XOXO and says, \"Oi, Gregness. I wanted to try this one again. I'm a physical media kind of guy and avoid downloaded games whenever possible.\" You're wrong. \"I don't mind that the PlayStation 4 Pro doesn't have a uhh a UHD Blu-ray Drive. However, do you think that because",
      "start": 904.44
    },
    {
      "text": "A physical media kind of guy and avoid downloaded games whenever possible.\" You're wrong. \"I don't mind that the PlayStation 4 Pro doesn't have a uhh a UHD Blu-ray Drive. However, do you think that because of this the Pro will be unable to play 4K games from a disc and therefore limit 4K gaming to streaming/download only, just like the video content?\" I don't know enough to have the answer to that question. That's why we usually dodge PlayStation Pro questions because we're not Scott Lowe the Tech Tower. However, no, I I mean, I'm going to go out on limb and say no, I don't think you have to worry about that. I understand what you're talking about with the video content, but when you're talking about a video game machine that's touting 4K, I don't think they'd be stupid enough to paint themselves in a corner where the disc-based stuff can't do it. But again, we're not those guys. Number four, United Front Games, the independent Canadian studio best known for Sleeping Dogs, has officially closed down. The",
      "start": 944.84
    },
    {
      "text": "corner where the disc-based stuff can't do it but again we're not those guys number four United Front Games, the independent Canadian Studio best known for Sleeping Dogs, has officially closed down. The studio had a special connection to the heritage of PlayStation last generation as before launching Sleeping Dogs the studio created ModNation Racers and LittleBigPlanet Karting, which were both PS3 exclusives. We wish nothing but the very best to all those who were affected by the closure and hope everyone lands on their feet soon. As I said on Colin and Greg when this was announced, or this news wasn't really announced but just kind of came forward, this is an independent studio in British Columbia. Been around for a while. I feel like Square Enix is partially responsible for this. Um, Square Enix of course funded Sleeping Dogs. Sleeping Dogs ended up being a critical hit and I think commercially did pretty well. They re-they relaunched it on the new consoles and they and they should have made a sequel.",
      "start": 983.16
    },
    {
      "text": "funded Sleeping Dogs. Sleeping Dogs ended up being a critical hit and I think commercially did pretty well. They re-they relaunched it on the new consoles and they and they should have made a sequel, a direct sequel. Instead they made Triad Wars, which is this tryhard MMO that clearly was going to fail. It was a stupid **** move. I think it ruined the studio, but of course that's just an absolute conjecture. I don't have any insight into that. I haven't even spoken to anyone at United Front Games in three years probably. They on the two or four for Sleeping, yeah, because we went out to lunch with them, yeah, and they're very nice guys, great folks. But uh, so I feel a little disappointed in that. They were working on a game called Smash + Grab, I think, which was on Steam Early Access, which I think was taken down. Um, the right move for them would have done the safe thing, which was Sleeping Dogs, which would have been out by now probably. So or the safer thing in ModNation Racers 2 and cut down the",
      "start": 1019.24
    },
    {
      "text": "taken down. Um, the right move for them would have done the safe thing, which was Sleeping Dogs, which would have been out by now probably. So or the safer thing in ModNation Racers 2 and cut down the load times and be the definitive kart racer of all, 'cause that's what ModNation Racers was on the way to being, ladies and gentlemen. Load time sucked, sure, but the play, create, share of kart racing, say magnifi. So who knows who's ultimately responsible for this, but but I can't help but wonder if Triad Wars was the massive misstep and that was seemed to have been a Square Enix thing, right? And that's always the dangerous thing when you start talking about being an independent studio or a studio of anyone where you get into bed and you put a lot, a lot, a lot, a lot, a lot of resources into a project that is something different. Like when this Triad Wars MMO is super weird and little bit, I mean to the point LittleBigPlanet Karting was a failure too. I mean critically and I mean commercially obviously as",
      "start": 1055.6
    },
    {
      "text": "something different. Like when this Triad Wars MMO is super weird and little bit, I mean to the point LittleBigPlanet Karting was a failure too. I mean critically and I mean commercially obviously as well. But I can't imagine how few copies. That's all exactly. And so I mean like, but that obviously they get their paycheck from Sony. But then maybe just, you know, is Sony not working with them anymore? Has the contract work dried up there? They feel like they have to do this thing. They have to go this way hoping that they make enough money than this and have enough interest in the Sleeping Dogs universe to get to Sleeping Dogs 2. And I'm not sure. I suspect that they were doing contract work up until the end. So it doesn't obviously bode super well for full independence. Like you don't see Insomniac, I don't think, doing contract work for number five. And I'm not saying there's anything wrong with contract work. That's how you make money in the industry when you're coming up, but it speaks to a level of",
      "start": 1092.68
    },
    {
      "text": "think doing contract work for number five. And I'm not saying there's anything wrong with contract work. That's how you make money in the industry when you're coming up, but it speaks to a level of stability. Play Game Dev Story, it's all about that. Number five, the NPD Group has revealed the top 10 bestselling games across both retail and digital channels in the United States for the month of September 2016. And it appears sports games are all the r. Oh, the bestselling games were in order: NBA 2K17, Madden NFL 17, FIFA 17, NHL 17, BioShock: The Collection, Destiny: The Collection, Grand Theft Auto V, Overwatch, Forza Horizon 3, and Call of Duty: Black Ops III. It's worth noting that Overwatch and Forza Horizon 3 contain incomplete data with Overwatch lacking Battle.net sales and Forza Horizon 3 lacking all digital sales. So it's safe to assume both games would have charted higher. As a reminder, Xbox One outsold PS4 for the month for the third consecutive cycle. A lot of brand new non-sports games",
      "start": 1124.04
    },
    {
      "text": "all digital sales. So it's safe to assume both games would have charted higher. As a reminder, Xbox One outsold PS4 for the month for the third consecutive cycle. A lot of brand new non-sports games on that list. Yeah, I mean what I was most interested in was BioShock outselling Destiny. Yeah, but everyone has Destiny, exactly. And that's just The Collection too, right? That them their attempt to rebundle it and get you in if you hadn't gotten in yet. Heartened by the BioShock sales though. Yeah, I still think we're gonna get BioShock 3. Number six, I'm sure you're gonna get BioShock 3. K, not gonna let go of that. And by we know there are three BioShock games, but I mean BioShock 3. Number six, will The Order: 1886 ever get a sequel? The PlayStation 4 exclusive third-person shooter launched in early 2015 to a tepid critical response, but developer Ready at Dawn thinks the franchise could and by the sound of it should go on. And in conversation with Game Informer, as distilled by GameSpot, Ready at Dawn's",
      "start": 1163.44
    },
    {
      "text": "to a tepid critical response, but developer Ready at Dawn thinks the franchise could and by the sound of it should go on. And in conversation with Game Informer, as distilled by GameSpot, Ready at Dawn's creative director, a friend of ours, Ru. I always **** this up. Ru Weerasuriya said, 'Is there a future? Yes, that IP has a future. It's definitely built in that IP. That future is already something that was built from the very get-go, from the first day we started working on it. As you know, since you played the game, for the ones who played out there, there's a larger storyline. There is a macro story that keeps going. It's an IP that is actually bigger than the storylines we have created. So there are legs to this IP, definitely.' Ellipsis. 'We feel that The Order showcased the fruits of our labor on technology. That was one of the biggest focuses for the team, having come from PSP and jumping directly to PS4. The first game was more than anything a launch platform to build upon. The Order was never written as a'",
      "start": 1202.36
    },
    {
      "text": "was one of the biggest focuses for the team, having come from PSP and jumping directly to PS4. The first game was more than anything a launch platform to build upon. The Order was never written as a one-off story. There is a lot more to tell, as you can see by the way the game ends. Um, unfortunately, I think that he says everything here in terms of, 'We feel The Order showcased the fruits of our labor on technology. That was one of the biggest focuses for the team.' I know, and that's the and that's the problem because under there is a five-hour game that should have been 10 hours and that would have made all the difference because I don't think the game played badly and I don't think the game was uninspired. The story and the setting were great, really, really great. But there's not enough there and it just becomes vanilla. The backend systems are not exciting enough. The trophy systems uninspired. There's not enough there and the game does end in a very tantalizing way. People have been asking me, the game",
      "start": 1239.56
    },
    {
      "text": "becomes vanilla. The backend systems are not exciting enough. The trophy systems uninspired. There's not enough there and the game does end in a very tantalizing way. People have been asking me, the game was on sale for like seven bucks or something like that recently and they're like, 'Is it worth it at that?' I'm like, 'Yes, absolutely. I think if you get to get The Order for under $10, definitely worth it.' Necro Ambulet wrote in KindaFunny.com/psq, just like you can. It says, 'Hey Greg and Colin, this past week Game Informer conducted an interview with the leads of Ready at Dawn who addressed the issues The Order: 1886 had and mentioned they are sure that The Order IP will live on in the future. Now that Sony owns that IP and if Sony chooses to do a sequel, what studio do you think Sony would let handle that IP? I would like to personally see it go to Naughty Dog to do a sequel, but at the moment their plate seems full. Before E3, everyone was so sure that Sucker Punch was going to be doing a Spider-Man game,'",
      "start": 1278.88
    },
    {
      "text": "IP. I would like to personally see it go to Naughty Dog to do a sequel, but at the moment their plate seems full. Before E3, everyone was so sure that Sucker Punch was going to be doing a Spider-Man game, but now it is unclear on what they are doing. Would just like to hear you guys' opinion on what The Order's future is, if any. Keep up the great work, Alex. I personally would like to see Ready at Dawn get another crack at it. Me too. Ready at Dawn is an incredibly talented studio. Those God of War games on the PSP are great. They made me a God of War fan actually, because I just I'd never connected with the PS2 versions for some reason. Um, I like those guys. Like you said, they're friends of ours. We know them. We've talked to them. I've known for years. We just saw them at gam gam. They came by and showed that new multiplayer game of theirs, Deformers, right? I played that and that's fun. Totally different for them, but this is one of those things where they have the tech now. They understand what people want and what",
      "start": 1316.84
    },
    {
      "text": "multiplayer game of theirs, Deformers, right? I played that and that's fun. Totally different for them, but this is one of those things where they have the tech now. They understand what people want and what they don't want. And I think that if you were able to, they have the engine set up. Let's go for it. Let's go. Let let them go back and have another crack at this and see what they can do, 'cause they're a studio that deserves to have their own IP that matter just to a wide audience, right? 'Cause it was for a while, 'All right, we're going to do God of War. We're going to do Daxter. We're going to work on other people's projects.' It's like, 'All right, well, let's let's make something that's your own. Let's make your own home here.' Yeah, I agree. I would like them to get another crack. I suspect that they might, yeah. Um, and I don't know. I mean, I've I've heard, I mean, you read things every once in a while, hear things that Ready at Dawn, well, that The Order actually sold pretty well and maybe made its money back. Um, so I just feel",
      "start": 1353.2
    },
    {
      "text": "And I don't know. I mean, I've I've heard, I mean, you read things every once in a while, hear things that Ready at Dawn, well, that The Order actually sold pretty well and maybe made its money back. Um, so I just feel like that part of, so it's it's complicated because I think it's a shame the way that game came out. I think that that game wasn't well served. I think it was clear it wasn't going to be good. Um, and I was, you know, and I'm proud of myself for sounding the clarion call very early and a lot of people gave me a lot of **** for that until the game came out and then they all realized that I was right. Um, and what I agree with you, they're nice guys and they're talented and they have they have the chops. I think they just focused on the wrong things. And so they have the engine. They have the characters, the world, presumably tons of assets. Um, so write the game and make it and make it a 10 to 15-hour game. I don't need multiplayer. Have some interesting backend upgrade systems and all these kinds of",
      "start": 1385.64
    },
    {
      "text": "the world, presumably tons of assets. Um, so write the game and make it and make it a 10 to 15-hour game. I don't need multiplayer. Have some interesting backend upgrade systems and all these kinds of things. Make the game a little meatier. Give it a little more replay value and set it on the world. The Order: 1887, you know, like I I would like to see that and I don't think anyone else should handle it and I don't think anyone else will handle it. But the thing about it is, I think I'd like to see what they bring to the sequel knowing what they screwed up with the original. Because yeah, when you say Sucker Punch, Sucker Punch is where they leave the story inside The Order, right? With him, you know, Galahad staring out over the city, ready to go out **** up some dick wolves and all these other people. Very interesting that would work as an open world game of him running around doing that. But that's inherently no longer The Order anymore. And so I'd rather see what The Order is supposed to be rather",
      "start": 1426.72
    },
    {
      "text": "very interesting that would work as an open world game of him running around doing that. But that's inherently no longer The Order anymore. And so I'd rather see what The Order is supposed to be rather than see it given to a new studio to see them reboot it and do everything. I'd like to see that Assassin's Creed I to Assassin's Creed II jump. I don't need to see an open world in that. It's it reminds me of The Last of Us. Give you can give us these expansive environments if you want. Give us options in which to handle the combat. Um, but when I think back on playing The Order: 1887, I was like, there there's something seriously wrong with this game. But but it's all or The Order: 1886. But there's something seriously wrong with it. But I I'd like to see more. It's one of those rare kind of things. Number seven, it looks like MachineGames is indeed working on a new Wolfenstein game, at least according to another tantalizing rumor. As you may remember, something called The New Colossus was briefly teased inside a",
      "start": 1465.76
    },
    {
      "text": "looks like MachineGames is indeed working on a new Wolfenstein game, at least according to another tantalizing rumor. As you may remember, something called The New Colossus was briefly teased inside a trailer for a different game, Bethesda's E3 conference. This was in the uh DOS prompts, yep, when it was starting up. Uh, and the DOS prompt, the reason that for people that need context, the reason that it's it seems to point to the Wolfenstein is that it's basically id's games from Commander Keen all the way down and it has The New Order and The Old Blood, which was the the last Wolfenstein game and the DLC. And then it said The New Colossus. Um, and it says uh, GameSpot dug up an interview with Two Left Sticks conducted with voice actor Brian Bloom, who plays Wolfenstein protagonist BJ Blazkowicz. There he said, quote, 'If you look at Bethesda's E3 2016 lineup, there was a title hinted at in a cool way. It sparked a bit of wildfire, that subtle, very simple DOS language going through the the titles. Perhaps we're'",
      "start": 1500.32
    },
    {
      "text": "quote, 'If you look at Bethesda's E3 2016 lineup, there was a title hinted at in a cool way. It sparked a bit of wildfire, that subtle, very simple DOS language going through the the titles. Perhaps we're working on that as we speak.' And tell us, Bloom. New Colossus likely refers to the Emma Lazarus sonnet that appears in the Statue of Liberty, something alluded to by BJ Blazkowicz at the end of Wolfenstein: The New Order. Almost certainly the the next one, yeah. Um, and it should be clear up before MachineGames makes Wolfenstein. So it's not only showing id's games, but id properties, since Wolfenstein was id property in the early 90s, in case you need a little history l. Number eight, sounds like Square Enix is pleased with the Western reception of recent Dragon Quest titles and intends to continue to publish them outside of Japan. MCV interviewed Noriyoshi Fujimoto, the series producer, about this and other things related to Dragon Quest. Fujimoto said that while Dragon Quest isn't well known in the West as",
      "start": 1536.96
    },
    {
      "text": "them outside of Japan. MCV interviewed Noriyoshi Fujimoto, the series producer, about this and other things related to Dragon Quest. Fujimoto said that while Dragon Quest isn't well known in the West as it is in Japan, it's important to the history of the gaming industry and newcomers, quote, 'may be surprised to the sheer breadth of the universe in terms of variety and depth,' end quote. As such, Square Enix is, quote, 'committed to bringing more Dragon Quest titles in the in the West,' end quote, with the belief that the games will continue to succeed more and more. Dragon Quest Builders just launched in the West on PS4 and Vita. Dragon Quest Heroes launched on PS4 last year and Dragon Quest XI is coming for PS4 sometime in the future. Um, are you stoked about XI? I'm **** super stoked about XI. XI is is going to be a PS4, Switch, and 3DS game. Yeah, Switch, which indicates to me that it's got to be soon is since 3DS is going to wane and die very quickly, um, in Switch's uh shadow, similar to how GBA died in DS's",
      "start": 1576.8
    },
    {
      "text": "to be a PS4, Switch, and 3DS game. Yeah, Switch, which indicates to me that it's got to be soon is since 3DS is going to wane and die very quickly, um, in Switch's uh shadow, similar to how GBA died in DS's shadow. Uh, interesting thing about Dragon Quest Builders is interesting wrinkle. Dragon Quest Builders sold a half a million copies in like a few days in Japan. So let's go, you're gonna get a sequel to that game. Dragon Quest Heroes has a sequel as well. So you're gonna they're gonna they're really ramping it up. I think it's a smart universe to explore. The ironic thing about it is that it's all about iconography. It's similar to Zelda actually, with the Hyrule Warriors on Wii U. These these those that are outside of Dynasty Warriors or Samurai Warriors or whatever are all about iconography and very little about story. Dragon Quest and Zelda have nothing like the stories are **** stupid. It's really about, oh, the moon's going to crash in the earth. It's really, well, that's true, but it's really about the the",
      "start": 1610.68
    },
    {
      "text": "story. Dragon Quest and Zelda have nothing like the stories are **** stupid. It's really about, oh, the moon's going to crash in the earth. It's really, well, that's true, but it's really about the the the monsters, the weapons, the lore, like the continuous lore from the beginning to the end. Um, and it's Kinda Funny that that resonates more than something that could be story driven in that universe that might resonate just as well. Like what if it was Final Fantasy Builders, you know? Um, just some food for thought. But I'm I'm super I've been a Dragon Quest fan long time and I'm really excited that people are are getting into it. Uh, you know, recently, better late than never. Yeah, you know, if you weren't around in the Dragon Warrior days, you go, **** you're **** poser. Yeah, yeah, yeah, no big deal. Will Dragon Quest XI have the building mechanics I like so much? No guarantee it won't. Number nine, I don't think you'll like Dragon Quest XI. Number nine, get purple goo from fighting the octopus men. No, but",
      "start": 1652.0
    },
    {
      "text": "will Dragon Quest XI have the building mechanics I like so much? No guarantee it won't. Number nine, I don't think you'll like Dragon Quest XI. Number nine, get purple goo from fighting the octopus men. No, but you'll fight the octopus then. Number nine, when it comes to mod support, both Skyrim Special Edition and Fallout 4 are being given less storage space to work with on PlayStation 4 compared to Xbox One. What a surprise. Bethesda has confirmed that game mods can only take a gig of space on PS4, five times lower than Xbox One's 5 gig threshold. Likewise, Fallout 4 mods can only take 900 megs of space on PS4 while being allotted two gigs on Xbox One. I'm sure this won't end incredibly poorly with the game self-destructing on the PlayStation platforms. We'll see what happens. Number 10, I thought this was just an interesting piece of of, I don't know, you you'll see. Number number 10, when Titanfall 2 launches for PlayStation 4 on October 28th, it will come packing PS4 Pro functionality directly on the disc, which is",
      "start": 1693.04
    },
    {
      "text": "piece of of, I don't know, you you'll see. Number number 10, when Titanfall 2 launches for PlayStation 4 on October 28th, it will come packing PS4 Pro functionality directly on the disc, which is to our knowledge the first game confirmed to do so. Word comes by way of the game's producer, Drew McCoy, who confirmed the news on Twitter to an inquiring gamer asking about potential Pro support. So as far as I know, uh, I don't know of any other game that has Pro support endemic to the disc. Patches ****. Um, because Rise of the Tomb Raider does, but I don't know if it's disc-native, if there's going to be a patch. An interesting wrinkle. Yeah. Number 11, wrap-up. Amnesia Collection is coming to PlayStation 4 at an undetermined time in the future. VR shooter Lethal VR is coming to PlayStation VR at an undetermined time in the future. Suda51's The Silver Case, which people are super excited about, is coming to PlayStation 4 in early 2017 by the way of NIS America's quirky discovery game Small Radios",
      "start": 1736.52
    },
    {
      "text": "VR at an undetermined time in the future. Suda51's The Silver Case, which people are super excited about, is coming to PlayStation 4 in early 2017 by the way of NIS America's quirky discovery game Small Radios Big Televisions is coming to PlayStation 4 on November 8th. And finally, shooter platformer Seraph is coming to PlayStation 4 on November 1st. And that is it for the news. Colin, you know that I love a good VR shooter, which Lethal VR on PlayStation VR sounds like it might be, but it's so far away. If I wanted to know what came to the digital and physical mom and pop shops this week, where would I go? You go to the official upcoming list of or official list of upcoming PlayStation 4, PlayStation 3, PlayStation Vita, PlayStation VR, sometimes PSP software by the Kinda Funny co-founder. Buckle in because we got a lot of games starting with big. Buckle in. Big Buck Hunter Arcade comes to PlayStation 4 digital. Big Buck Hunter will bring the arcade experience to your living room with a fast-paced,",
      "start": 1781.84
    },
    {
      "text": "because we got a lot of games starting with big. Buckle in. Big Buck Hunter Arcade comes to PlayStation 4 digital. Big Buck Hunter will bring the arcade experience to your living room with a fast-paced, addictive arcade shooter. The all new control and aim mechanics will make this a must pick up and play arcade shooter experience. Travel around the globe and take down wild game and whitetail and Moose Adventures or try your aiming in speed skills and epic bonus challenges. Don't mind if I don't. If this is a PlayStation VR game, I might do it. Get in there. That's yeah, I was thinking the same thing. Try to hug the deer. Carnival Games VR comes to PlayStation VR. It's out on the 28th. So this is a 5, 6, 7, Thursday release. Carnival Games VR brings an immersive virtual reality experience allowing you to explore the park, interact with patrons, and play up to 12 different games. Enter a themed Carnival alley where you can play a game and earn tickets for virtual prizes or unlock another game. Bad English.",
      "start": 1828.12
    },
    {
      "text": "explore the park, interact with patrons, and play up to 12 different games. Enter a themed Carnival alley where you can play a game and earn tickets for virtual prizes or unlock another game. Bad English. I'd love to unlock another game inside of this game. Dragon Ball Xenoverse 2 comes to PlayStation 4 digital and Retail. Dragon Ball Xenoverse 2 gives players the ultimate Dragon Ball gaming experience. Develop your own Warrior, create the perfect Avatar, train to learn new skills, and help fight new enemies. Restore the original story of the Dragon Ball series. Can't wait. Got to restore that story of Dragon Ball when he's uh not beating Superman, Goku. The 28th is a Friday. I'm sorry. The Elder Scrolls V: Skyrim Special Edition comes to PlayStation 4 digital and Retail. This is out on the 28th, which is a Friday. Winner of more than 200 Game of the Year Awards, Skyrim Special Edition brings the Epic Fantasy to life in stunning detail. The the special edition includes the critically acclaimed game",
      "start": 1864.56
    },
    {
      "text": "is a Friday. Winner of more than 200 Game of the Year Awards, Skyrim Special Edition brings the Epic Fantasy to life in stunning detail. The the special edition includes the critically acclaimed game and add-ons with all new features like remastered art and effects, volumetric God Rays, which I've been waiting forever, Dynamic Depth of Field, screen space reflections, and more. I feel like that's all made up. Yeah, our game's got screen space reflection, you know how it is. You got volumetric God Rays, yeah, of course. Like, oh, sign me up, here's 60 bucks. Exile's End comes to PlayStation 4 and Vita digital. When the scion of the most powerful corporation in the galaxy goes missing on a remote mining planet, a team of mercenaries is dispatched to investigate. Among them is Jameson, an old soldier with a dark past. Inspired by early 90s cinematic platform, Exile's End plays out as an exploration driven side-scrolling adventure through a massive mining complex on a moody, lonely alien world. Sounds interesting. Adventure.",
      "start": 1903.32
    },
    {
      "text": "by early 90s cinematic platform Exile's End plays out as an exploration-driven side-scrolling adventure through a massive mining complex on a moody, lonely alien world. Sounds interesting. Adventure game, yeah. Farming Simulator 17 comes to PlayStation 4 digital and retail. Take on the role of a modern farmer in Farming Simulator 17. Immerse yourself in a huge open world loaded with a harvest of new content. Explore farming possibilities over hundreds of acres of land, including a detailed new North American environment. That's what it's all about. You got to have that detailed new North Am. Ready for this one? Get ready for this next one. Yeah, I'm ready. Forestry 2017: The Simulation comes to PlayStation 4 digital. Someone tweeted this at me, excited for your rereading of this write-up. It's out digital. It's an 8th release, so it's a Friday. Forestry 2017: The Simulation takes you to the forest. Take over the tasks of a professional woodcutter and enjoy working in the woods. Control huge machinery, fell",
      "start": 1943.92
    },
    {
      "text": "it's an 8th release, so it's a Friday. Forestry 2017: The Simulation takes you to the forest. Take over the tasks of a professional woodcutter and enjoy working in the woods. Control huge machinery, fell the trees, arrange the timber, and comb through your wood. Sell the wood and earn money to expand your company. Oh my God, sounds great. Sounds **** terrible. It sounds simpler than Farming Simulator. Farming Simulator always sounded interesting. I'd be the same. Oh yeah, 100% exact same logo. I got what I wanted. I got the, I got a code for Farming Simulator years ago. You remember there's a Let's Play up on Kinda Funny, and man, that game was complicated as hell. I had no idea what I was doing. This one sounds easy. Chop down the tree, chop it into smaller pieces, sell it to the people. What could go wrong? Buy more trees. Do I have to plant the trees? No. Do I have to irrigate them? No. I'm all right. Ginger: Beyond the Crystal comes to PlayStation 4 digital. No, says a world destroyed by a crystal explosion, a",
      "start": 1985.72
    },
    {
      "text": "buy more trees. Do I have to plant the trees? No. Do I have to irrigate them? No. I'm all right. Ginger: Beyond the Crystal comes to PlayStation 4 digital. No, says a world destroyed by a crystal explosion, a mysterious threat hanging over its inhabitants, and a goddess who creates a hero. This is Ginger: Beyond the Crystal. Ginger must reestablish the connection with the goddess by purifying corrupted crystals that have spread throughout the worlds. It won't be easy. The worlds are full of enemies and traps across 15 different levels. Come on with that name, Ginger the ****. Infinite Air with Mark McMorris comes to PlayStation 4 digital and retail. Mark McMorris Infinite Air is a fresh welcome into snowboarding for newcomers and a challenging step into untracked territory for seasoned boarders. Get ready to shred custom-built runs and show off gnarly tricks across vast personalized terrain parks and 100-plus square miles of backcountry. No scrolling down, doing that one. Just Dance 2017 comes to PS4 and",
      "start": 2026.24
    },
    {
      "text": "to shred custom-built runs and show off gnarly tricks across vast personalized terrain parks and 100-plus square miles of backcountry. No scrolling down, doing that one. Just Dance 2017 comes to PS4 and PS3 digital and retail. Just Dance 2017 is more fun and easier to play than ever. Shake your hips and wave your hands with the Just Dance Controller App. If you have a smartphone, you don't need PlayStation Move or Camera. Or Camera. Kaga's Revenge comes to PlayStation 4 digital. Kaga's Revenge is a 2D-based game with lots of platforming action and puzzles. Battle alongside our two heroes, the Samurai Kuuru Tegi and the street fighter Broccoli Joe. Broccoli Joe, all across feudal Japan in their new adventure. Broccoli Joe, that fighter's good. Lithium: Inmate 39 comes to PlayStation 4 digital. Lithium: Inmate 39 is a horrifying puzzler. It tells the story of a psychiatric patient who must find his way back to his origins, discovering his past and uncovering the secrets buried within his mind. Oh, Minecraft",
      "start": 2067.12
    },
    {
      "text": "39 is a horrifying puzzler. It tells the story of a psychiatric patient who must find his way back to his origins, discovering his past and uncovering the secrets buried within his mind. Oh, Minecraft: Story Mode - The Complete Adventure comes to PlayStation 4 retail. Prepare for the adventure of a lifetime as Jesse. You'll embark on a perilous adventure across the Overworld, through the Nether, to the End, and beyond. While at EnderCon, in hopes of meeting Gabriel the warrior, you and your friends discovered that something is wrong, something dreadful. That's as far as that play, that's Episode One. Sounds thrilling. Monster Jam: Crush It! comes to PlayStation 4 digital. Crush It! takes fans back into authentic, real-life stadiums for racing and freestyle events, including the site of Monster Jam World Finals, Sam Boyd Stadium. Choose your offici, choose your favorite official Monster Jam trucks such as Grave Digger, Max-D, Monster Mutt, and many more. I had a Grave Digger poster on my wall. I went and saw them at Nassau",
      "start": 2116.24
    },
    {
      "text": "Sam Boyd Stadium. Choose your offici, choose your favorite official Monster Jam trucks such as Grave Digger, Max-D, Monster Mutt, and many more. I had a Grave Digger poster on my wall. I went and saw them at Nassau Coliseum. Is Bigfoot still kicking around, or is it just Grave Digger now? I don't know. Couldn't tell you. Don't know anything about it. Don't. I remember that it was really loud. That's all I remember. Oh yeah, it was definitely terrifying for sure. And I was also curious how the Islanders could possibly play there when there's dirt all over the place. Did they have the Dragon one yet? They see one that transforms into the dragon and like picks up other cars and like shoots fire out of its nose. The real thing. I mean, that's all it does. It can't eat them or anything. Don't really understand the fascination with it. Appreciate you bringing me, though. Remember, you go there, you get the exhaust kicked up. You, you're not getting pure oxygen anymore. You're getting high as hell as watching these trucks run things over.",
      "start": 2154.24
    },
    {
      "text": "it. Appreciate you bringing me, though. Remember, you go there, you get the exhaust kicked up. You, you're not getting pure oxygen anymore. You're getting high as hell as watching these trucks run things over. Nobunaga's Ambition: Sphere of Influence - Ascension comes to PlayStation 4 digital and retail. The newest release from the historical simulation game Landmark series, Nobunaga's Ambition. Experience the reality of officer life in the Warring States period and watch her with your own eyes the fighting that brought the end of an era. I will witness it with my own eyes. Party Golf comes to PlayStation 4 digital. It's out the 6th, so that is a Wednesday. They release tee off simultaneously to a psychedelic 2D world with satisfying simple physics. Except it's a frenetic free-for-all to get in the hole. That's, I mean, that's just normal. It's instant fun with endless variety. There are trillions of gameplay combinations, from giant banana balls to turbo power-ups. The number of ways to play is practically endless.",
      "start": 2187.04
    },
    {
      "text": "mean, that's just normal. It's instant fun with endless variety. There are trillions of gameplay combinations, from giant banana balls to turbo power-ups. The number of ways to play is practically endless. Trillions, huh? Trillions. Man, did you ever play the 100ft Robot Golf? It's supposed to be terrible. Oh yeah, well, but yeah, it was one of those. We got our codes, but it was during the glut of VR games. I haven't, I haven't gotten jumped into Robot Golf. Metacritic 54. No, okay, that's scores ranging from Hardcore Gamer give it an 80. The, the, the biggest website you would actually ever heard about here, it's PlayStation LifeStyle gave it a 75, and then IGN gave it a 50. Destructoid gave it a 40. GameSpot gave it a 50. Gotcha. Not surprising, I guess. Sherlock Holmes: The Devil's Daughter comes to PlayStation 4. Well, there's a big bias against golf in the industry, let alone the bias against 100ft robots. That's true. There's a huge bigotry against the 100ft robot race. Sherlock Holmes: The Devil's Daughter comes",
      "start": 2224.0
    },
    {
      "text": "a big bias against golf in the industry, let alone the bias against 100ft robots. That's true. There's a huge bigotry against the 100ft robot race. Sherlock Holmes: The Devil's Daughter comes to PlayStation 4 digital in retail. Sherlock Holmes: The Devil's Daughter is a fantastic adventure with unique gameplay that blends investigation, action, and exploration for an extraordinary experience that will test the limits of your nerves and intelligence. Track down evil in the darkest corners of London and the human soul while playing as the great detective as you untangle a web of intrigue leading to the final stunning revelation that Sherlock Holmes is the Devil's Daughter. You thought you were looking for the Devil's Daughter, but no, sir. So deep, man. Yeah, hey man, we wrote this description in game when we were on. SNOW comes to PlayStation 4 digital. SNOW is the only free-to-play open-world winter sports game, so it's got to be the best. Explore a massive mountain, customize your character with",
      "start": 2275.24
    },
    {
      "text": "when we were on. SNOW comes to PlayStation 4 digital. SNOW is the only free-to-play open-world winter sports game, so it's got to be the best. Explore a massive mountain, customize your character with clothing and equipment from the biggest brands, and compete in events to be the best. That, uh, image, uh, certainly looks like a PlayStation game. So I don't know if a snowboarder like this, no texture, and then just SNOW written over it. Spider: Rite of the Shrouded Moon comes to PlayStation 4, NVYVE Digital. Crossby, you are a spider on the hunt, spinning webs to trap your prey. Explore an abandoned mansion, discover hidden passages, and leave the place covered in cobwebs. Unravel the story of the family who once lived at Blackbird Estate and solve puzzles left behind by a mysterious secret society. But you're a spider, why would you want to? Sounds interesting. Well, I'm like, I'm like this, I'm like Charlotte's Web spider, but I don't have like a girl and a pig to talk to. I'm just caught in this house, so I",
      "start": 2310.04
    },
    {
      "text": "a spider, why would you want to? Sounds interesting. Well, I'm like, I'm like this, I'm like Charlotte's Web spider, but I don't have like a girl and a pig to talk to. I'm just caught in this house, so I got to do something because I'm a dcing. I got to have my babies. I **** out my babies, then they get caught in the breeze and they go away, and then I make the pig girl. Sounds about that. Sounds like the story. Tether comes to PlayStation VR digital. In a magical skyborn world, take on the role of a powerful Spirit Guardian charged with restoring life and balance. Command the Peeps, your loyal servants, to fight, feed, build, and sacrifice themselves for the greater good and a quest to release your entombed brethren. A big cry. Titanfall 2 comes to PlayStation 4 digital and retail. It's out on the 8th, which is a Friday. In single-player, an aspiring pilot and a veteran Titan combined forces to save their own lives and combat a powerful enemy against all odds. Multiplayer offers brand new Titans, expanded",
      "start": 2349.68
    },
    {
      "text": "a Friday. In single-player, an aspiring pilot and a veteran Titan combined forces to save their own lives and combat a powerful enemy against all odds. Multiplayer offers brand new Titans, expanded pilot abilities, and deeper customization to elevate the fast-paced and exciting gameplay fans expect from the series. Weeping Doll comes to PlayStation VR digital, and it's out on the 7th, which is a Thursday. Some is just a doll in a chair, a very ordinary family, a beautiful home. But who's crying? Search the home, scour every room, and scrutinize over every detail to piece together the story that has been kept locked away. That's a **** creepy ass image. But who's crying? I'm John Kennon. Say, said John Kones. Wick, PlayStation 4 digital, out the 7th, which is a Thursday. Wick is a survival horror game where ghost stories are brought to life. Explore a local legend about the long-lost children in the in the woods who can still be seen, but only by those who dare to enter alone by candlelight. Okay, Windlands VR.",
      "start": 2390.48
    },
    {
      "text": "stories are brought to life. Explore a local legend about the long-lost children in the in the woods who can still be seen, but only by those who dare to enter alone by candlelight. Okay, Windlands VR. Windlands VR comes to PlayStation VR digital. A first-person grappling hook exploration game. Soar through the ruins of a fallen world and discover the secrets of the Ancients. Windlands has been developed primarily for virtual reality headsets, but is also a great experience for those without headsets. It doesn't say that, though. It says PSVR only. Well then, not maybe not a great experience. It says PSVR only, but it only says PSVR. I wouldn't trust it. We, we're not done yet. World of Final Fantasy comes to PlayStation 4 and PS Vita digital and retail. This is the Chibis. Embark on an adventure unlike any before to an all-new World of Final Fantasy with charming, stylized visuals for both the young and the young at heart. Players will capture, customize, and evolve iconic Monsters by",
      "start": 2434.52
    },
    {
      "text": "adventure unlike any before to an all-new World of Final Fantasy with charming, stylized visuals for both the young and the young at heart. Players will capture, customize, and evolve iconic Monsters by stacking them to form adorable yet strategic monster towers. You excited for that one? Yeah, yeah. I asked for a code two weeks ago. They, they reached out. They're like, \"You want it?\" I'm like, \"Yeah.\" And that was the end of that. Well, cool. We're just checking. You keep talking ****, Moriarty. And finally, Yomawari: Night Alone comes to Vita digital. A young girl walks her dog at dusk when an accident occurs. After coming home, the girl's sister runs into the night to find the dog. Neither returns. Now you must help the girl brave the town in the dead of night and to find her missing loved ones. NIS sent me this today. I'll be interested to see what it's all about. Um, and that is it for the games, CoMo. I'm not calling you a liar. I'm calling the PlayStation Blog a liar. Can you please give me with your internet computing",
      "start": 2473.08
    },
    {
      "text": "be interested to see what it's all about. Um, and that is it for the games, CoMo. I'm not calling you a liar. I'm calling the PlayStation Blog a liar. Can you please give me with your internet computing device? I'm pretty sure Batman: The Telltale Series - Episode 3 is out. Yeah, they don't do that episodic stuff because it's counted as downloadable content or add-on content. Yeah, Batman comes out this week. That's stupid. Batman: The Telltale Series - Episode 3 is out this week. I can't wait. Batman ended so well. Can't wait to pick it up and see what's happening. Colin, yes, time for topic of the show. Guess what, Colin? In between episodes of PS I Love You XOXO, Nintendo announced the Switch. They sure did. Are you familiar with the Switch? I am, top level, because we have a whole reactions up over on KindaFunny.com. What do you think of the Nintendo Switch? I think it looks great, right? I think it's going to inevitably have problems, battery power, but I, I'm very, I'm very tantalized by it. Yes, so are the PS I Love You XOXO listeners and viewers. People like",
      "start": 2512.24
    },
    {
      "text": "I think it looks great, right? I think it's going to inevitably have problems, battery power, but I, I'm very, I'm very tantalized by it. Yes, so are the PS I Love You XOXO listeners and viewers. People like Kur4, or Kur4. Maybe Kur4 if the four is counting as name, but you can't tell. You never know. Kur4, Kur. Maybe it's Steve Kerr or his fourth child. Steve Kerr's fourth child. He wrote in, or she wrote in, to KindaFunny.com/psq, just like you came to be part of the show, and says, I'll get into the thing very quickly. Is the Nintendo Switch the final nail in the Vita's coffin, and will it be the start of an exodus from Vita Island? I love my Vita, but with a busy work schedule and a significant other eating into my gaming time, it's probably my main gaming machine. As a Sony fan, I was surprised when Switch was shown that I feel I might have to jump ecosystems. With the Vita lacking AAA titles and Switch seeming the obvious replacement for people in my situation, it would break my heart to give up my",
      "start": 2558.52
    },
    {
      "text": "was shown that I feel I might have to jump ecosystems. With the Vita lacking AAA titles and Switch seeming the obvious replacement for people in my situation, it would break my heart to give up my passport to Vita Island and walk away from the connected PlayStation ecosystem. As much as I hate to say it, the Switch appears to be the first look to have the potential of killing off the alien Vita marketplace. If people like myself jump to Nintendo for our handheld, we might never look back. What do you guys think, Kur4? I don't think it really matters. Isn't the Vita the nails in the Vita coffin? The coffin has been buried. We are all here, grave robbers. We love our Vitas. We play our Vitas. We enjoy our Vitas. Yeah, but it's dead. We've said that forever. Does that matter? Should that matter to you? No, we said in this show it doesn't matter to you. These games keep coming out. There's not the triple-A, no. Freedom Wars. Does it matter? Are you, do you really need another Uncharted on it? No, because you're getting",
      "start": 2615.2
    },
    {
      "text": "no, we said in this show it doesn't matter to you. These games keep coming out. There's not the triple-A, no. Freedom Wars. Does it matter? Are you, do you really need another Uncharted on it? No, because you're getting Danganronpa, Monokuma running through, doing stuff. You're getting Dragon Quest Builders. You're moving the blocks around. Things are happening underneath. These are the worms going into the Vita's body and eating it and then making it something new. Well, I just want to be clear about one thing. You're not allowed to leave Vita Island. So I like how people are like, \"Oh, I'm going to band.\" Well, yeah, good luck. Uh, because you don't leave once you're there. You don't, don't leave Vita Island. Number two, no one gets out alive. Um, not even the V Lola won't allow it. None of us will allow it. You're not, we're all going down. I'll blow that **** Island to smithereens. It'll be ****. What's the, what's that island where we blew up all the nuclear bombs? It'll be that island. Three Mile Island. No, that's not a, that we didn't",
      "start": 2661.64
    },
    {
      "text": "I'll blow that **** Island to smithereens. It'll be ****. What's the, what's that island where we blew up all the nuclear bombs? It'll be that island. Three Mile Island. No, that's not a, that we didn't throw, we didn't blow bombs on Three Mile Island. I love it that there's that whole, that island, uh, what the **** was it called? Long Island? I mean, that would make a lot of sense, but no. Uh, well, I don't know. Someone will tell me. Um, where the Manhattan Project was. No, no, Manhattan Project was, was Manhattan. That was, is no, it was New Mexico where they blew that bomb up. Oh, there's no is in New Mexico. In the 50s, they were blowing up bombs because there's like all this great footage of them like they displaced all these Natives and stuff and like watch the explosions with them. I can't, I don't know why I can't remember the name of. They watch the explosions with the Natives. Come on, all these guys are like, \"Where are we going? We just need you off the island for a little bit.\" Then they turn them around like, \"That's",
      "start": 2698.04
    },
    {
      "text": "the name of. They watch the explosions with the Natives. Come on, all these guys are like, \"Where are we going? We just need you off the island for a little bit.\" Then they turn them around like, \"That's our island.\" I know, like, \"Great, wasn't that cool? Go back there and live and we'll come check in on what the effects were on you.\" Bikini Atoll. That's what I was thinking of. They watched it with the N. General's arms around him. They've all got binoculars. The Bikini Atoll, I think, is what it, what was. All right, cool. Um, I don't, I do, I, I'm 1,000% behind the Switch. I'm very excited for the Switch. I said in our Switch reaction, right? This is the first time, and it's all hyperbole because again, there's a million things that can happen. What are they going to do for memory? What's the battery life going to be? What's third-party support going to be? This is the first time, though, in a decade I've ever considered like, \"Oh man, if like, then if Batman: Arkham whatever came out on Switch and on PS4, would I play",
      "start": 2736.24
    },
    {
      "text": "be what's third-party support going to be? This is the first time, though, in a decade I've ever considered like, \"Oh man, if like, then if Batman: Arkham whatever came out on Switch and on PS4, would I play, which would I play it on?\" Because of how much I travel, right? Like I was playing on the plane all these games, and it's like, \"These are fun. I like Dragon Quest Builders, but man, I can't wait to get home to Titanfall 2, to Lara Croft, to Batman.\" And if I had the ability to take that on the road, that'd be awesome. And clearly, that's what Vita was originally marketed as in a way, and what we hoped it would become, and it never did become it. So this is kind of, I think, the evolution of the Vita's plan, what the Vita should have been in a way. Not that I want PlayStation to give up on what PlayStation was doing. Yeah, I think that that's the big, the big takeaway is that this can be, first of all, yeah, I mean, Sony's done with the Vita, basically. That, you know, they'll, it'll be alive for a few more years, I think. I, I, I wouldn't",
      "start": 2795.16
    },
    {
      "text": "that that's the big, the big takeaway is that this can be, first of all, yeah, I mean, Sony's done with the Vita, basically. That, you know, they'll, it'll be alive for a few more years, I think. I, I, I wouldn't be surprised if you saw Vita games through 2018. Um, oh yeah, because they're, they're out there. People are buying them. There's, there's us, the dedicated fan base that are buying Vita games. But it will be interesting, I guess, to see if, if Switch came in and took even that limited piece of the, it's possible because, you know, I think that there's valuable marketing that Sony's going to be able to look at for free, um, from Nintendo. First of all, Sony's certainly R&D-ing new stuff, right, all the time. So what they can see here is like, \"All right, we, maybe we release a new handheld, you know, PSP, a new PlayStation Portable, a new Vita.\" But is it worth it? Well, let's watch, see what Nintendo does. If Nintendo's thing bombs, then surely ours will bomb. If it does really well, then there's still a market for dedicated handheld",
      "start": 2828.64
    },
    {
      "text": "a new Vita. But is it worth it? Well, let's watch, see what Nintendo does. If Nintendo's thing bombs, then surely ours will bomb. If it does really well, then there's still a market for dedicated handheld gaming. Although Switch is not dedicated hand. We'll see. By the way, yeah, from the Bikini Atoll, please tell me there and the Natives are like, \"Yeah, let's watch it together.\" It's kind of sad. Of course it is. From the Wikipedia, it says, \"Between 1946 and 1958, 23 nuclear devices were detonated by the United States at seven test sites located on the reef inside the atoll, in their air, underwater. They had a combined fission yield of 4.2 megatons. The testing began with the Operation Crossroads Series in July 1946. Prior to nuclear testing, the residents initially accepted resettlement voluntarily to another atoll, believing that they would be able to return home within a short time. Rongerik Atoll cannot produce enough food, and the Islanders starved. When they cannot return home, they were relocated to another atoll for",
      "start": 2865.12
    },
    {
      "text": "that they would be able to return home within a short time. Rongerik Atoll cannot produce enough food, and the Islanders starved. When they cannot return home, they were relocated to another atoll for 6 months before choosing to live on Kili Island, a small island one-sixth the size of their home island. Some were, were able to return to Bikini Island in 1970 until further testing revealed dangerous levels of strontium-90. The Islanders have been the beneficiary of several trust funds created by the United States government, which as of 2013, covered medical treatment and other costs and paid $550 annually to each individual. When you are a Native and the United States government comes around, say no. It's always a bad deal. It's always a raw deal, as they say. Now, Colin, yeah. ZiggyWhyGiggyX with Ziggy backwards says, \"Hello, Colin, Greg, Zachary here, and I'm writing in to KindaFunny.com/psq, just like everyone should, after watching the trailer for the new Nintendo Switch. Now that it seems as if they are",
      "start": 2906.72
    },
    {
      "text": "integrating portability with the console with a beautiful-looking screen. Do you feel Sony might keep up with the console race coming into a shiny new cycle with the Switch and the rumored monster known as Scorpio? Do you think we can expect a revival of the beloved Vita with a new PlayStation V? The V could stand for 5. And the Vita, where they have released a new version of the PlayStation and the Vita to go hand in hand like they originally intended. Maybe even replace the DualShock with the Vita as well. Does this seem like a possible future to you guys? Do you have any thoughts on my theory?\" Possible, but unlikely. I think I, I just, I'll reiterate what I said before, that I think that there's valuable, there's just valuable field evidence that Sony's going to be able to garner from",
      "start": 2946.0
    },
    {
      "text": "on my theory possible but unlikely I think I I just I'll reiterate what I said before that I think that there's valuable there's just valuable field evidence that Sony's gonna be able to garner from the Switch if PlayStation 5 or whatever the next PlayStation is is surely R&D'ing as well sure and maybe there is going to be some sort of component with that it seems like Sony's wanted to democratize a little bit and go towards like well we you know now you can use PlayStation Now on PC Remote Play on PC um or maybe not PlayStation Now but Remote Play on PC you can then cycle through your PlayStation and send it to your PC but it's I don't think it's native to PC whatever whatever whatever the case might be it seems like Sony's investigating different ways to play PlayStation devices I think that they would be **** smitten if they saw a market in which they can have another handheld and a console successful and have them be one and the same but the problem is is that and this is",
      "start": 2991.4
    },
    {
      "text": "think that they would be **** smitten if they saw a market in which they can have another handheld and a console successful and have them be one and the same but the problem is is that and this is the thing that I think one of the pieces of bad news the aforementioned pieces of bad news I think we're going to hear about about Switch is that it's just not powerful sure um Zelda looks fantastic but Zelda's also running on a Wii U right so you have to like I think the sweet spot for the pricing of Switch is $300 and to get all that technology into that device for $300 it just cannot be very powerful so if you're looking at Sony pushing the boundaries as they usually do with technology and you wanted something similar like that then I just think that it's not practical and not feasible right now I think that they're probably pretty focused on the Home console Market but I wouldn't expect I don't I I I don't I don't know what to expect considering Pro's coming out Scorpio's coming out",
      "start": 3029.12
    },
    {
      "text": "now I think that they're probably pretty focused on the Home console Market but I wouldn't expect I don't I I I don't I don't know what to expect considering Pro's coming out Scorpio's coming out next year which seems like a new console yeah so I don't know where all this sits and like where all this lays I think Sony's going to be kind of have to by nature be more reactionary to both what Nintendo and Microsoft are doing now they put themselves in that position I and I agree with that but I think I think for Sony it's done I know we always you always talk about it I think that they are crazy enough to put out another Vita but I think the ship is sailed I think they're internally doubling down on PlayStation 4 and VR and these are the platforms we're about going forward and I think even if Switch comes out and it is this huge success right and it I don't know what we garner that number as it's not going to sell as much as the Wii if it actually gets competitive you know in terms of",
      "start": 3064.28
    },
    {
      "text": "if Switch comes out and it is this huge success right and it I don't know what we garner that number as it's not going to sell as much as the Wii if it actually gets competitive you know in terms of what the first year of PlayStation 4 was versus the first year of Switch something that effect I think that they look at and they're like man yeah we should have committed more to Vita maybe we'd be in a different spot but I don't think it changes their course them thinking man **** for PlayStation 5 we have to do this I think they continue to go the horsepower route and then I think Nintendo does get to run away with this and I know you've talked about it before why should they give up the portable uh gaming handheld market right why give up that floor to somebody but I just don't think that it's there anymore for a dedicated handheld and so that that's what you see with this thing right where it's going to be they've already started stressing it right that no no no this is a console",
      "start": 3096.68
    },
    {
      "text": "it's there anymore for a dedicated handheld and so that that's what you see with this thing right where it's going to be they've already started stressing it right that no no no this is a console but you can take it on the go cuz that's going to be their out when oh man this thing sucks I only get an hour and a half battery life on a plane with it well well you you know it's meant to be played at home like that'll be their answer to it uh I think it'll just if anything they'll be like that's an interesting direction they went but we're going to continue to go chase what a PC could do but on your TV and without the hassle of everything else well see this next year will be very interesting this next calendar year 2017 really will be super super interesting to see how it all plays out with new console for Microsoft I think even more than the Switch and you know like the Switch is the reaction of investors from the Switch was not positive interesting so um I think stock went down 6% after it",
      "start": 3132.04
    },
    {
      "text": "console for Microsoft I think even more than the Switch and you know like the Switch is the reaction of investors from the Switch was not positive interesting so um I think stock went down 6% after it was announced yeah um which erases quite a bit of value in a company that big so but I mean like that can turn around pretty quick right the the the takeaway I took right as I went to Missouri I hung out with my friends who have real jobs and adult responsibilities like children and you know the kids downstairs is playing an original Wii my friend hasn't played anything since his GameCube and we were talking about it and they all knew about the Switch they had heard about it on the news they thought it was cool they wanted to know what I thought of it and I thought and that was a two three days after the announcement of it I was like damn that's actually pretty powerful my prediction on Switch is that it's going to be fine it's not going to I mean if it out sells Wii U it must out sell Wii U",
      "start": 3162.4
    },
    {
      "text": "the announcement of it I was like damn that's actually pretty powerful my prediction on Switch is that it's going to be fine it's not going to I mean if it out sells Wii U it must out sell Wii U if it sells in Wii U numbers it's it's over it's game over for Nintendo and hardware just completely game over um I I what I said was that I think it'll do somewhere in between GameCube and N64 so you're looking at somewhere like lifetime so I think it'll do somewhere between 25 and 35 million units which is respectable um but not extraordinary I just I I don't I'm not a believer that Nintendo has a dedicated market to it nearly the size that it used to anymore and people have to remember that the dedicated Nintendo market has indeed seemed to have shrunk constantly since the 80s yeah um and I know people are kind and this is in the console market not in the handheld market but you know you're going from what 60 million NES to 50 million something like that SNES is to 30 something million N64s",
      "start": 3197.84
    },
    {
      "text": "people are kind and this is in the console market not in the handheld market but you know you're going from what 60 million NES to 50 million something like that SNES is to 30 something million N64s to 20 something million GameCubes and then up to 100 million Wiis and then back down to like 13 million Wii U's it's just not good you know and even with handhelds Game Boy at about 100 million and then DS at at GBA I don't know 50 something million I don't know what it was I don't remember anymore but then DS 150 million then 3DS down to like 60 million so it just seems like there's these anomalies but otherwise the number the trajectory is down um I just don't know that Nintendo has Nintendo has a very ardent hardcore fan base I'm super excited about this Switch I'm gonna buy it day one for sure regardless of the bad news I really want it I think it's just a neat idea and I want to support it but um they need to do much more and the problem with them is that they're in a weird space",
      "start": 3236.12
    },
    {
      "text": "for sure regardless of the bad news I really want it I think it's just a neat idea and I want to support it but um they need to do much more and the problem with them is that they're in a weird space right now because they're making their mobile games which I think is smart they're making the new device which is going to kill the Wii U which is fine it's gonna kill the 3DS which might not be fine for them and then it leaves them in a strange spot where they're not really they're not gonna have the power to compete they're not going to have the third party support to compete yeah I just don't see it doing much better than traditional Nintendo hardware does but I'd like to be proven wrong the price is going to be very important I I hope my hope behind it right in the fact is the fact that everyone seems invigorated on this idea whereas that was not the case with Wii U Wii was a slow burn on that and then it got away from us right and it does like what we why PlayStation 4 was",
      "start": 3277.56
    },
    {
      "text": "that everyone seems invigorated on this idea whereas that was not the case with Wii U Wii was a slow burn on that and then it got away from us right and it does like what we why PlayStation 4 was successful based on one trailer it seems as if Nintendo is doing what PlayStation did and saying we're about games again we're about the game or we about you you know there were no kids in there there was no touchscreen and waggle crap it was like kids of your contemporaries who wanted to go to a party on the rooftop and bring their pretty funny memes with like the girl being like Oh Lindsay brought her Switch again all we want to do is hang out and talk Lindsay so we'll see I mean people are like I I I I really do enjoy watching people drink the Kool-Aid on everything that's announced in the video game industry you know like I think there's you know I think the Switch is a terrible name um and but I think that that doesn't it might matter but it might not we the it didn't matter it doesn't matter",
      "start": 3314.68
    },
    {
      "text": "game industry you know like I think there's you know I think the Switch is a terrible name um and but I think that that doesn't it might matter but it might not we the it didn't matter it doesn't matter sometimes I think there are a lot of ingenious names in the Nintendo ecosystem I think N64 is an ingenious name I think GameCube is a **** awesome name I think Wii is a great name Wii U was a mistake because no one knew what the **** it was made it seem like it was tenuously or intimately involved with the Wii and it wasn't and so the name matters but uh about the market share and the market share available to this device is what's going to be most pertinent I don't know that that has a ceiling nearly as high as what people think um we'll see and it's coming out again in the middle in the middle ground and mid-gen consoles that come out in the middle typically don't do well so okay that's it topic of the show was brought to you by Uber and I want to give a shout out before I even read the ad to",
      "start": 3355.96
    },
    {
      "text": "ground and mid-gen consoles that come out in the middle typically don't do well so okay that's it topic of the show was brought to you by Uber and I want to give a shout out before I even read the ad to Kevin Coello who put up the clock that I asked for last time for every show but this show what's the time code for this ad Kevin Coello huh 56:55 yeah 56:55 I'll show you 56:55 ladies and gentlemen this is brought to you by Uber we've all taken jobs to earn extra cash back in the day Colin Moriarty worked as a landscaper remember that Colin I do uh but now Uber's got a better way for you to earn extra cash and a little money on the side it's so much easier today thanks to Uber Uber is the ultimate side hustle they say driving with Uber is a new way you can earn extra cash whenever you want it's not just another J.O. they spelled out J.O. the Uber ad is always an interesting read it's a journey if you will Colin it's a totally flexible way to earn of course you can turn it off and on just like it's",
      "start": 3393.36
    },
    {
      "text": "another J.O. they spelled out J.O. the Uber ad is always an interesting read it's a journey if you will Colin it's a totally flexible way to earn of course you can turn it off and on just like it's because it's your car you just turn on the app and you say you want to work now you work for as long as you want take as many rides you want you turn it off you get out Colin do we like Uber oh my God we really do love Uber we ride Uber all the time and that's not they didn't pay us to say that I would say that I ride Uber with all due respect to Uber too much I think we both do that 100% And I think the fact is like that's always the cool thing when you talk to an Uber driver is the fact that they're doing it to earn extra cash I was in Columbia this guys like well I just sent my third daughter to college so I had to start driving Uber or whatever and it's this whole thing it's like it was homecoming weekend he was going he was going to go for 12 hours and then go home but if he wanted to",
      "start": 3442.2
    },
    {
      "text": "to college so I had to start driving Uber or whatever and it's this whole thing it's like it was homecoming weekend he was going he was going to go for 12 hours and then go home but if he wanted to go home early he could if you didn't want to go home if you didn't want to ride at all or drive at all he didn't have to uh if you have a few spare hours here and there you can drive Uber and earn some extra money so listen if you enjoy earning extra cash if there's something special you'd like to buy your car can start making you money go ahead right now get your side hustle on sign up to drive with Uber today go to uber.com/drive now that's uber.com/drive now uber.com/drive now when they spell out words I get it but who who hasn't heard of Uber at this point I don't know someone someone out listening to this podcast we talk about it enough as is I don't think people that listen to this podcast even pay attention what we're saying half the time that's 100% correct I agree with that 1,000%",
      "start": 3476.44
    },
    {
      "text": "to this podcast we talk about it enough as is I don't think people that listen to this podcast even pay attention what we're saying half the time that's 100% correct I agree with that 1,000% Colin yes let's check in with Trophy Time I mean there's nothing that interesting going on here I mean there's a game there's a game that I've not even seen announced yet called Bridge Constructor coming to PS4 and Vita we can check in on those I'm Vita I'm constructing Bridges and Just Dance 2017 I'm just interested to see what those are I also want to see Nobunaga's Ambition: Sphere of Influence - Ascension just for shits and giggles okay other and we'll do Big Buck Arcade as well why don't we just read this the rest of the show so let's do Bridge Constructor on PS4 and Vita uh 18 bronze 10 silver three gold and a platinum uh let's see Car Insignia West Central so you get trophies for cars can drive on all the island one's Bridges Island two so there's different Islands Greg got it and there are",
      "start": 3519.72
    },
    {
      "text": "gold and a platinum uh let's see Car Insignia West Central so you get trophies for cars can drive on all the island one's Bridges Island two so there's different Islands Greg got it and there are different three main islands on there's a bunch of different things cars tanks tank trucks can drive on all of these Bridges complete all optional levels completed all levels with trucks is a gold Trophy called Solid Ground with an exclamation point up there there's trophies for scores there's trophies for the support the weight support so like 15,000 I don't know man I don't know about this it's a little boring Just Dance 2017 19 this is the PS4 version 19 bronze seven silver four gold and a platinum complete your first song get three stars on the song spend 500 Mojo spend 5,000 Mojo I probably won't get that one reach max level Pray for Moo Finish First on all the dance quests with a superstar difficulty you do this one gonna pass you excited no Big Buck Arcade trophies on PS4 38 bronze seven",
      "start": 3558.92
    },
    {
      "text": "get that one reach max level Pray for Moo Finish First on all the dance quests with a superstar difficulty you do this one gonna pass you excited no Big Buck Arcade trophies on PS4 38 bronze seven silver three gold and a platinum I like these You're Mine get 10 head shots in the Whitetail Adventure this a little gruesome about getting head scoring head shot on a deer poor guy just out there 25 head shots and 50 head shots killed 10 deer by shooting them in the heart killed 25 deer by shooting them in the heart kill 50 deer by shooting them in the heart remember they introduced a few years ago in these games the ones where it was like you saw X-Ray Vision you could see their heart I'm assuming that's what's happening here kill 10 trophy Animals by shooting them in the head kill 25 trophy Animals by shooting them in the head let's see killed 10 Critters in Whitetail Adventure killed 30 Critters in Whitetail Adventures killed all the critters in Whitetail Adventure what do they call the kill all",
      "start": 3617.72
    },
    {
      "text": "by shooting them in the head let's see killed 10 Critters in Whitetail Adventure killed 30 Critters in Whitetail Adventures killed all the critters in Whitetail Adventure what do they call the kill all the critters Jesus Critter Gumbo yeah uh let's see how do these sell you think call versions of Big Buck Hunter probably pretty well yeah and then finally Nobunaga's Ambition: Sphere of Influence - Ascension 10 bronze 13 silver five gold and a platinum step by step proof of having completed a mission okay first battle proof of having joined your first battle what I don't have proof proof of having been promoted to train oh so this is the trophies are proof every one of these trophies is proof ah and I'm going to x out of this for proof of me being bored your Trophy Time question of the week comes from KindaFunny.com/psq where you can ask your question and it comes from Kevin White4 what's up Colin and Greg Trophy Time question here for you I recently downloaded and absolutely",
      "start": 3661.84
    },
    {
      "text": "week comes from KindaFunny.com/psq where you can ask your question and it comes from Kevin White4 what's up Colin and Greg Trophy Time question here for you I recently downloaded and absolutely loved the beautiful Zelda ripoff that is Oceanhorn when looking through the trophy list it appeared to be relative a relatively easy Platinum without too much grinding involved as I was marching towards completing the game as well as all the trophies I realized something that I thought very interesting the platinum trophy could be achieved without beating the game during my final battle with Oceanhorn the last trophy that I needed popped on my screen parenthesis kill 50 spawn followed by that beautiful notification of the platinum trophy again this happened during the final battle of the game is this something you've seen often over the years it seems to me that actually finishing a game should factor into obtaining a platinum but since I only have four Platinum so far I don't have anywhere",
      "start": 3715.4
    },
    {
      "text": "this something you've seen often over the years it seems to me that actually finishing a game should factor into obtaining a platinum but since I only have four Platinum so far I don't have anywhere near the same level of experience that you two do it would be very interesting to hear your thoughts on this thanks for all you do and keep up the Fantastic Work Kevin in a game with a narrative or a campaign I cannot think of an example where you do not get a trophy or beating it so therefore you would need it for the Platinum my my my thing is it's he's getting the kill 50 spawn in the final battle with Oceanhorn in the final it's like it's I understand that it's not beating the game but it is right there it is on the precipice if you've gone that far you've basically beaten it you're going to beat this boss you assume and roll the credits yeah I don't think it's a big deal but it's unusual I've never that the thing sure there's an of course there is of course there is I just can't",
      "start": 3758.84
    },
    {
      "text": "to beat this boss you assume and roll the credits yeah I don't think it's a big deal but it's unusual I've never that the thing sure there's an of course there is of course there is I just can't think of it probably some maang game where you just that's different I mean like like in a game in a game with a camp like that game has a a campaign yeah I've never heard of that interesting could be the only one I don't know yeah but if you have one ladies and gentlemen let us know in the comments below or tweet Kinda Funny Kevin and say hey Kinda Funny Kevin it's good to see you maybe you should get a haircut don't mention the trophy thing at all he'll understand he'll understand what this is about wink wink nudge nudge Colin's check in with listeners hello listeners uh uh we have a piece of physical mail call already sent to the Kinda Funny P.O. Box of course P.O. Box 541, San Francisco, California 941 it's on the Twitch page if I read too quickly loose leaf huh October 13th, 2016",
      "start": 3796.56
    },
    {
      "text": "of physical mail call already sent to the Kinda Funny P.O. Box of course P.O. Box 541, San Francisco, California 941 it's on the Twitch page if I read too quickly loose leaf huh October 13th, 2016 from The Who doer hey whoever reads this I was cleaning up around the house and found my old PS1 box I opened it up for a quick nostalgia trip and found this little booklet that I never seen I asked my older brother where it came from and he said it came with our PS1 it's kind of weird to hold this book and know that it is literally as old as I am it's actually because my brother that it's actually because of my brother that PlayStation is my in my blood I'm actually writing this the day before the launch of PlayStation VR anyways I don't want a cool little treasure like this to be locked away in a dusty closet you guys can have it or just give it away on Colin & Greg Live someone out there will appreciate it thanks for all the laughs and happy early birthday to Colin much love from Ottawa",
      "start": 3835.08
    },
    {
      "text": "in a dusty closet you guys can have it or just give it away on Colin & Greg Live someone out there will appreciate it thanks for all the laughs and happy early birthday to Colin much love from Ottawa, Ontario, Canada Bill Abdu I can't read how I wrote his last name The Who doer P.S. who the hell writes who the hell handwrites letters still what's so funny about what what do we got here what is this this seems like it's just a booklet that teases game like contemporaneous to when the console was purchased what it looks like 1997 or so this is a I looked at it briefly this is a PlayStation One thing yep okay and what I'm so what I'm looking at here first of all it's just so I remember all these games and what what what's so funny about this is just we thought these games were pretty show it here show it here show some stuff here so so little thing you got here packed in with your PlayStation One youum not even a DualShock there's a little bit of there's a little bit of a like ver you know",
      "start": 3885.68
    },
    {
      "text": "show it here show some stuff here so so little thing you got here packed in with your PlayStation One youum not even a DualShock there's a little bit of there's a little bit of a like ver you know they do a little Never Underestimate PlayStation you might remember that from a different podcast we used to do yeah I don't remember um and then that's kind of cool parts of your brain and then NFL GameDay 98 I remember looking at that Patrick Finel NHL FaceOff 98 MLB 98 it's so real **** yeah NCAA the Multi-Tap oh you needed the Multi-Tap sir Gran Turismo the original right there come a long way yeah sure has Jet Moto remember Jet Moto I'm surprised Jet Moto never came back yeah cool bers see Blasto, Blasto Phil Hartman was the voice of Blasto in case you didn't know that now you do Armored Core which was a FromSoftware game I believe steel rain right Armored Core was from I think so I do believe so let's see Spawn: The Eternal oh man there was a game for you Bushido Blade which I",
      "start": 3931.6
    },
    {
      "text": "Armored Core which was a FromSoftware game I believe steel rain right Armored Core was from I think so I do believe so let's see Spawn: The Eternal oh man there was a game for you Bushido Blade which I **** hated that was a Square game oh here we go the Analog Controller with the divots cardinal sin Crash Bandicoot look at the Naughty Dog logo Universal Intelligent Cube Intelligent Cube I think I could be wrong about this I feel like Intelligent Cube was one of the games that was created on Net Yaroze don't forget about the popular rapper of course they got that for Christmas in 1997 no touch no touching Final Fantasy VII you're skin soft I know Wild Arms there you go memory cards Frontier so this is so funny Final Fantasy Tactics one of the great games of all time SaGa Frontier the game I got after Final Fantasy Tactics **** terrible so yeah this this must be I'm going to say this was summer 1997 the sports games are 98 yeah and uh Final Fantasy VII, Tactics, Tactics was turn of the uh turn",
      "start": 3984.52
    },
    {
      "text": "Final Fantasy Tactics was terrible so yeah this this must be I'm going to say this was summer 1997. The sports games are '98, yeah. And uh, Final Fantasy VII Tactics, Tactics, Tactics was turn of the uh, turn of the the year. Final Fantasy VII was uh, late summer 1997. Now look, ahead of their time, they already they were already advertising the PlayStation merch that now now you can get through PlayStation. Oh, PlayStation Underground, remember that? PlayStation Underground, your demo discs in there, your merch, you get all this stuff. God, I wish I oh, it's a familiar looking hat. It is, possibly our landlord wears it. And then some Greatest Hits there, Crash Bandicoot GameDay '97 Greatest Hits. That's what the kids were going to get. Pretty cool, man. Keep only PlayStation offers the Greatest Hits library that feature some of the best games, yeah, ever made at all-time low prices, just $4.99. Build your PlayStation game library quickly, period. That's a statement. Build your PlayStation game library quickly. New titles, okay, yeah.",
      "start": 4041.04
    },
    {
      "text": "the best games, yeah, ever made at all-time low prices, just $4.99. Build your PlayStation game library quickly, period. That's a statement. Build your PlayStation game library quickly. New titles, okay, yeah. There you go, huh? I'm going to go put it up here on the little shelf. That thing has the late '90s aesthetic. Oh yeah, just the weird it looks like it looks look this, you know, they would have printed that on a poster and just put it in your put it in your room. Oh, I would have totally had that in my room. Put it up here. Cool. Thank you for sending that over, appreciate you. I like how he wrote, \"Please don't kill me, USPS.\" It's probably because it was too heavy for a stamp. I think he meant like, don't crush it, don't fold up the page. Do you write anything else in here? Any other notes? No, no other notes. But why'd he write that? Wasn't on the inside of the envelope. Yeah, I think it was just a joke for our for our USPS. It was it was a little thing for not a funny joke. We make those all the time, so that's fine.",
      "start": 4089.28
    },
    {
      "text": "why'd he write that wasn't on the inside of the envelope? Yeah, I think it was just a joke for our for our USPS. It was it was a little thing for not a funny joke. We make those all the time, so that's fine. Colin, my pen shot out at me. Yes, you're right. I do make funny jokes all the time. No, I said I said no, that's not the opposite of what I said. Thank you for the compliment. No, I I don't mean like I meant both. What? All right, here we're going to go. Thank you so much, Sir Kev La, wrote in KindaFunny.com/psq and says, \"Hi guys, with the PlayStation VR out now in the wild and being promoted in the mom and pop shops, what are your opinions on the physical retailers charging people to try PSVR? My local Game, put in parenthesis British version of GameStop, sent out a tweet advertising for people to try PSVR for five.\" He puts a little 'L' in front of this number. I'm going to say five. No, I don't. We know the real answer, it's 5 pounds. Min Euros? Min 5 pounds. Great. 5 min Euros for 15 minutes, 10 pounds for 30.",
      "start": 4131.8
    },
    {
      "text": "for five. He puts a little 'L' in front of this number. I'm going to say five. No, I don't. We know the real answer, it's 5 pounds. Min Euros? Min 5 pounds. Great. 5 min Euros for 15 minutes, 10 pounds for 30 minutes. Personally, I was disgusted by this. Why not just let people try, make bookings and try it for free? It would be great marketing for them. I tweeted back at the store stating my opinion and their response was along the lines of, quote, \"If people purchase PSVR, then they get their trial money back.\" Rather than getting into a Twitter debate with them, I just stopped following them. But I did see other people agreeing with me and continuing the debate. I would like to hear your thoughts on retailers charging for trying PlayStation VR. Ridiculous. Many thanks, Kevin. It's completely ridiculous. I agree with Colin, but I the whole thing is like I feel it's it's a weird choice. It's within their right and you did the correct thing of, okay, unfollow them, don't support them, make that statement of this is a",
      "start": 4181.2
    },
    {
      "text": "Colin, but I the whole thing is like I feel it's it's a weird choice. It's within their right and you did the correct thing of, okay, unfollow them, don't support them, make that statement of this is a dumb business, this is a dumb decision that's anti-consumer and anti-people trying this technology. So I'm not going to support you for that reason. Don't flame them, don't be jerks, but make it very clear, vote with your wallet. I can see I can see wallet with pounds in it. I can see a little bit where they were coming from with this. So especially with they like, well, specifically with getting the money back. So the idea is like if you would put the money down, then you're like, oh, I guess I might as well just buy the buy it and then I get my money back in a way. I mean, it's kind of stupid, but it's totally antithetical to put pushing hardware. If I was Sony, I would have called them like, what the **** are you guys doing? Exactly. And you understand too, of course, that it gets rid of the look, you lose a",
      "start": 4217.76
    },
    {
      "text": "antithetical to put pushing hardware. If I was Sony, I would have called them like, what the **** are you guys doing? Exactly. And you understand too, of course, that it gets rid of the look, you lose a PlayStation VR demo is more hands-on, more in-depth than, all right, cool, go play the N64 hooked up that TV and you'll or even the PlayStation demo station, right? This is, all right, let me put it on, let me explain what you're getting, let me explain how you do this. You need a person there, so you don't want looky-loos or, all right, cool, I'm just going to I'm going to come over and do this and never do it again. Like Sony did their own tour, of course, where they did that where you just, you know, sign up and come get a make a booking and come play it. But maybe the Game doesn't have it, the reason the resources to sit there and walk through the 100 people who just want to try it for no reason. But I agree, it's not a bad I think it's a crazy there's no there's not a good look whatsoever. So I I I uh when I",
      "start": 4254.96
    },
    {
      "text": "to sit there and walk through the 100 people who just want to try it for no reason. But I agree, it's not a bad I think it's a crazy there's no there's not a good look whatsoever. So I I I uh when I saw that floating around the past few days, I thought it was I was quite disturbed by it simply because it's it doesn't seem logical to get hardware, push hardware. Like you want people to just play it and try it. If they don't like it, they don't like it. Yeah. Um, these companies are going to be looking for ways to nickel-and-dime everyone forever and and uh until they just don't **** exist anymore because we'll be buying games digitally. So goodbye. Next question comes from Son of Marah over KindaFunny.com/psq. Hey guys, I've been wondering this for a while and wanted your input. Ever since VR got announced, something kept bugging me about the fact that there would be two environments of gaming that the first parties would develop for. My question is this, do you think PSVR could have a major hand in",
      "start": 4287.24
    },
    {
      "text": "something kept bugging me about the fact that there would be two environments of gaming that the first parties would develop for. My question is this, do you think PSVR could have a major hand in the lack of first-party developed games for the PlayStation 4 or is there something else going on with the management of PS4 first party first party titles? Thanks guys, Jeff, AKA Son of M. No, I don't. I don't think that VR has anything to do with it because I think Northwest Studio and London Studio are obviously going to be VR-centric. You assume Polyphony will put it in Gran Turismo, et cetera. Um, Evolution obviously put in a Driveclub before they were shut down. But um, the fact is is that most we know what most of the first parties are doing or we assume that they're going to be doing something AAA. So Sucker Punch and Naughty Dog are working on something we don't know. But everyone else basically we know what they're doing. So and they're not VR games. I think the first party trickle of games is just to the",
      "start": 4329.76
    },
    {
      "text": "Punch and Naughty Dog are working on something we don't know. But everyone else basically we know what they're doing. So and they're not VR games. I think the first party trickle of games is just to the fact that I think it's harder to to develop for PlayStation 4 than people thought. And not that it was going to be a cakewalk, but I think they thought it'd be up to speed quicker, their games would be out faster, everything would be great. When there's going to be new hurdles, new learning curves, new different things. And I yeah, I don't think I think it's from what I understand from the way it's always been explained to us, the way Sony works by Shu or somebody else, and I don't think they're blowing smoke, is the fact that it's they want the first parties working on what they want to work on. So I don't think anybody's coming in be like, all right, time to make a **** VR game. I think they're probably saying, you know, hey, if you're interested in this technology, let's talk about it, blah blah blah. But I",
      "start": 4370.44
    },
    {
      "text": "think anybody's coming in be like, all right, time to make a **** VR game. I think they're probably saying, you know, hey, if you're interested in this technology, let's talk about it, blah blah blah. But I don't think that's at all what's happening here. We've seen people. I don't think so either. Young Blas says, \"Hi Colin and Greg, hello. Quick question, with the I'm sorry, will the Vita memory card ever drop in price? Currently, the 3 gigabyte is $80 on Best Buy, while a regular 3 gigabyte card is worth $0. I hope they announce a new Vita that supports regular cards. Love you guys, David.\" That will never happen. That and he also David is oh, he I see what he's saying. Don't listen to him at all. Um, I don't think it'll ever happen that they're going to drop these prices until like they're trying to. But I mean, like, when is I mean, they're already clearing out where they're not selling those units in so many stores, right? Like it's so hard to find a Vita in a new box ready to go. I don't understand what's taking so",
      "start": 4401.92
    },
    {
      "text": "is I mean, they're already clearing out where they're not selling those units in so many stores, right? Like it's so hard to find a Vita in a new box ready to go. I don't understand what's taking so long for them for all these retailers to be like, I'm ready to clean this out and be done with it. I don't know. I don't know. I'm surprised by it too. I don't understand why they did that. It was such a damaging thing to the console, 100% to the handheld. And I guess the thing I was saying when I that I don't think they'll ever do that more is I don't think they're going to announce a new Vita that supports regular cards. That's for sure not going to happen. That was what he topped off. We'll find out, you know, some information. No, I don't. You're not going to do it, Colin. I just I'm just not I'm just not not convinced, pardon the double negative, that they're not going to make another handheld talking about. I think I you're saying that they're not going to release another handheld with proprietary memory. I hope",
      "start": 4443.24
    },
    {
      "text": "Pardon the double negative that they're not going to make another handheld talking about. I think I you're saying that they're not going to release another handheld with proprietary memory. I hope they announce a new Vita. I'm assuming he means like a PSP Go. Oh, kind kind of a lateral move. I don't think they're going to make like a slim. They made a slim, yeah, exactly. And that's what it was. DJ Mutton Shops writes into KindaFunny.com/psq and says, \"Hey guys, hey, if PS I Love You XOXO had trophies that revolved around the show, what trophies would you have?\" He has an example. He says there'd be a silver trophy name, \"Anime Tit Lovers Vengeance.\" Description, \"PSN's worst name of the week gets banned from PSN.\" He says, \"Thanks, babies.\" I don't think that's part of the trophy uh, off top of my head, because it's going to be rewarding you, the viewer or listener, right? There'd be one for a it would be a Baker's Dozen and it would be, \"You've listened to 14 shows where I've screamed at Baker's Dozen.\" That's one I put out.",
      "start": 4479.36
    },
    {
      "text": "to be rewarding you, the viewer or listener, right? There'd be one for a it would be a Baker's Dozen and it would be, \"You've listened to 14 shows where I've screamed at Baker's Dozen.\" That's one I put out there. Bronze, of course, is garbage. You know, Baker's Dozen, 13. Is that the joke? That's the joke. Remember, I never say Baker's Dozen on a 13. I say it around every other one but not 13. You haven't done 13 in a long time. I intentionally don't actually, as I told you. Well, that only proliferates it, you know. I know. I don't think you do, 'cause you just said even though that's not what it is. Yeah, but you're not you're not in here, you're not know you don't know what's going on. I understand exactly what's going on. I don't think you understand what's going on. I think you're a little tired. Think you're a little I'm great. I slept on a plane today. I'm **** D. I'm sure you're feeling good. You like it now? The shirt? I don't know. I just you like my Beetle Bailey shirt? I feel like it kind of looks like a woman's",
      "start": 4523.96
    },
    {
      "text": "I'm great. I slept on a plane today. I'm **** D. I'm sure you're feeling good. You like it now? The shirt? I don't know. I just you like my Beetle Bailey shirt? I feel like it kind of looks like a woman's shirt. Well, I you said that when I walked in. I don't understand why. And I'm not I'm not fighting what I what about it makes it look like I you have a womanly body. But other than that, that's probably I mean, right there is probably the real problem. I mean, you know, if you want to wear women's shirts, that's cool. I don't know. I just don't oh, don't be wrong. If this if it turn if it nets out that you go to go to the Missou store right now, look at the men's shirts. If I'm sure it's not a woman's shirt. If it I'll tell you right now, if I was if women's shirts look this good on me, I'd **** be rocking bles left and right. I just uh could here's the problem too. It looks like a Michigan shirt. Well, I mean, it's a throw it says I mean, it says Missou. I understand that. But just no, I know. No, no, no, no, no, it's a",
      "start": 4558.6
    },
    {
      "text": "left and right. I just uh could here's the problem too. It looks like a Michigan shirt. Well, I mean, it's a throw it says I mean, it says Missou. I understand that. But just no, I know. No, no, no, no, no, it's a throwback. When you get when you get done and Kevin, if you want to no, you don't edit the show, so I'm not going to make any more work for myself. Google every bu Beetle Bailey Missou. You'll see big old Beetle Bailey wearing the shirt. It's fine. That's what he does. Beetle Bailey, Sir Mort and Muum. Checkmate, Northeastern. You didn't make Beetle Bailey. He's always up to shenanigans in the Army. We don't make much of anything actually. Come to think of it, I don't even know what the **** we were talking. Oh, trophies. Do you have any dumb trophies we'd have on this show? No, please go to the forums, KindaFunny.com/forums. Tell us your trophies. You're more interesting than us. You're you're more fascinating than us. Oh my God, how long is this next thing you're about to read? This is so I'm looking through this",
      "start": 4594.44
    },
    {
      "text": "forums, tell us your trophies. You're more interesting than us. You're you're more fascinating than us. Oh my God, how long is this next thing you're about to read? This is so I'm looking through this is up for a topic of the week, but it didn't work out. But that is a great thing. SF DJ, your topic was ginormous and it was an early it was in the early running for topic of the week and then it fell out. But this brings us to an interesting point. It's a criticism of the show, but really, ladies and gentlemen, it's a criticism of you. One of you. Oh, we're fine in this. Don't worry about us. Never mind. Hat's nope. I was going to say hats. Ha. Hat. Hat-Shaped Hat. **** intercap. How hard is it to intercap? Hat-Shaped Hat says, \"Love the show. Have listened to every episode since the very beginning. Please, please, please change up the type of questions you read from the people. I feel there is a constant rotation of the same questions read over and over. Number one, hey guys, I just bought a PS4. Please tell me",
      "start": 4641.72
    },
    {
      "text": "up the type of questions you read from the people. I feel there is a constant rotation of the same questions read over and over. Number one, hey guys, I just bought a PS4. Please tell me what games I should like. Number two, when something like that we haven't we did a whole episode about the Vita and we never had to do it again. Hey guys, sometimes I don't like gaming. Do you ever feel like not gaming? Well, I ever like gaming again? When have we talked about that recently? Well, it sounds like a bunch of **** nonsense. Number three, hey guys, I love trophies. Don't you love trophies too? But don't you hate it when the games don't have enough trophies? Four, hey guys, this game was delayed. That sucks. In insert Shigeru Miyamoto quote about delayed games, which gets used so much that the dude should be collecting royalty checks. Any anyway, why do you guys think games get delayed? Number five, hey guys, there are too many games coming out. How should I decide to spend my money? Love the show, but I really don't",
      "start": 4686.2
    },
    {
      "text": "royalty checks. Any anyway, why do you guys think games get delayed? Number five, hey guys, there are too many games coming out. How should I decide to spend my money? Love the show, but I really don't think we need to revisit these topics for at least another year. Thanks. I don't disagree, but I also don't remember what when are these listen? Hat-Shaped Hat, I don't know what you're talk. I really don't understand the criticism. I don't think we get these again. This is we were we were tired to have those questions. We would call people out for the, I just got a PS4. I just got a be like, I don't no, I'm not anymore. You're just Google Google for God's sake. I hear what you're saying, but I don't necessarily what when I don't even remember even talking about half of those things like from a reader question perspective. Yeah, they pop up I think occasionally in different ways. I mean, this is really a criticism of you. That's what I'm saying. Ask better questions. No, I mean of you. Oh, of me. Yeah, no, you pick the questions. Yeah, I",
      "start": 4730.16
    },
    {
      "text": "they pop up I think occasionally in different ways. I mean, this is really a criticism of you. That's what I'm saying. Ask better questions. No, I mean of you. Oh, of me. Yeah, no, you pick the questions. Yeah, I pick the best I can. I've jumped into that. I've jumped in there and gotten plenty of questions that weren't in that in that. Well, again though, you're we're both don't turn it around on me all of a sudden, you stupid ****. Be on my side for once in a fight, will you? Ask better questions. Don't ask really long questions. Don't people are always like, I see that you're once again ignoring my Dark Souls question. Yes, we don't play Dark Souls. Why would we talk about Dark Souls? We don't care about Dark Souls. I know this was going to hurt you at a core place in your body, but you will hurt many of them. I just don't care. Many of them out there now don't care about Gran Turismo and I don't like LittleBigPlanet that much. I do though. I can. And God of War is kind of like a fun game, but Kratos sucks. But he",
      "start": 4773.96
    },
    {
      "text": "don't care. Many of them out there now don't care about Gran Turismo and I don't like LittleBigPlanet that much. I do though. I can. And God of War is kind of like a fun game, but Kratos sucks. But he looks better than this new one though, for talking for being real. And I kind of miss BigBig and Zipper Interactive. No, you don't. You you just want to miss them. You don't really miss them. Remember Pursuit Force? Yeah, it was good. It was fun. H Deviants? Yeah, exactly. Here we go. Yeah, I remember I I can understand missing Zipper because you were **** all up in that SOCOM. You were playing SOCOM left and right. I was all up in that Unit 13, son. Written by very own that doesn't make any sense. Written by our very own friend friend and founder of Podcast Beyond, Jeremy Dunham. That's fine to be up in the one game that was a deviation from what they made. I don't think that makes you a Zipper for an afternoon at least. No one was up in MAG for an afternoon. Massive Action Game. Never forget. Never let them tell you",
      "start": 4810.72
    },
    {
      "text": "that was a deviation from what they made. I don't think that makes you a Zipper for an afternoon at least. No one was up in MAG for an afternoon. Massive Action Game. Never forget. Never let them tell you that's not what it stands for. Mr. J says, \"Hi Colin and Greg. I was browsing the new games on PSN profiles and noticed a game called 8 Days. It reminded me of a game called 8 Days developed by Sony London for the PS3 that got canceled in 2008. To say that I was disappointed would be putting it lightly. So my question is, what game cancellation was the most disappointing to you? Thanks. You guys are awesome. I don't even know have a PlayStation anymore, but I still listen to the podcast.\" The Getaway 3. Oh, really? I was going to go Warrior's Lair. That was disappointing because we **** played it. Yep. And that shows you how long if you don't remember this one. It was on Vita. They it was one of the ones that got towed around. There was an earthquake when you played it one time. Uh, it was going to be it was",
      "start": 4849.44
    },
    {
      "text": "shows you how long if you don't remember this one. It was on Vita. They it was one of the ones that got towed around. There was an earthquake when you played it one time. Uh, it was going to be it was going to be a a Diablo on Vita. That's right. A Diablo on Vita where you made your own lair and then you could go fight other people. You could also just run and play and it would be a Diablo. And I was like, yes, it was on stage E3. I will play this forever ever. This would be a great game. And there's times where I'm like right now, what do I want to play in Vita? I'm kicking around looking for something. I'm like an action RPG like that, a little dungeon crawler running around, getting all this loot. That would totally fit the bill right now. Another one is Six Days in Fallujah, which was a Konami game that was done as well. That was uh, yeah, pretty much done. I think it was a tactical shooter. Um, and uh, it took place in Iraq and it was too offensive for all the **** crybabies out there. So um, that you know, want to cry",
      "start": 4894.08
    },
    {
      "text": "that was uh, yeah, pretty much done. I think it was a tactical shooter. Um, and uh, it took place in Iraq and it was too offensive for all the **** crybabies out there. So um, that you know, want to cry about literally everything that happens in the world. So the Kevin Kelly is the world. Exactly. Um, so the uh, continued pacification of uh, everyone uh, forced us to not be able to play that game. Now whether it would have been good or not, I don't know. But I would have been interested to play a game contemporary. Sure. We we when that game was supposed to come out, we were still winding down in Iraq. So it would have been contemporary to the war we were we were in. And I still I'm still interested and excited to see games that take place in Iraq and Afghanistan. And I think that we will eventually get them. Colin, you want to break somebody's heart? I'd love to. We're going to call it Ry Jacker. Hi Colin, Greg, hello. He said, wait for Colin to say back and you fell right into it during Paris Games Week last year.",
      "start": 4927.12
    },
    {
      "text": "you want to break somebody's heart? I'd love to. We're going to call it Ry Jacker. Hi Colin, Greg, hello. He said, wait for Colin to say back and you fell right into it during Paris Games Week last year. Was announced that Dreams would have a beta in 2016. Seeing as the year is almost over, do you guys think this is still going to happen or do you think the development of Dreams is in a rough spot? Love you guys, greetings Wes. Yeah, I don't I don't know what's going on with Dreams. It ain't gonna happen. And I saw this thing. Well, I think a beta will happen, but it's not going to happen this year. Well, that's what he saying. Yeah, by 2016, the I saw this. I forgot to put in the Roper Report. It wasn't really a big piece of news that Media Molecule was like, office now. H um, I guess apparently Guild in Guildford maybe or something or is that where they are? They're in Bristol, something like that. I don't know. These all made up. They're all in London. But um, I I'm concerned for them and I'm concerned about that game.",
      "start": 4967.0
    },
    {
      "text": "or something or is that where they are? They're in Bristol, something like that. I don't know. These all made up. They're all in London. But um, I I'm concerned for them and I'm concerned about that game. Yeah. Um, they came and showed us to showed us at GDC. Nice people, you know, we love them. Um, obviously a lot of talent working on the game. I just I just do not understand the argument that this game is going to be interesting to almost anyone. I I I just unless they really turn a corner with it and really have something compelling to show in terms of its functionality. This isn't LittleBigPlanet and it's way harder to wrap your mind around the LittleBigPlanet. And um, it's been in development for so **** long. And I just feel like it's going to come out and bomb. I mean, that's that's that's my feeling on it. I I hope I'm wrong because when you when you also think about the big exclusives coming up, it just never comes up. We talk about Days Gone, God of War, Horizon, Detroit, et cetera. And we talk about we",
      "start": 5006.0
    },
    {
      "text": "on it I I hope I'm wrong because when you when you also think about the big exclusives coming up it just never comes up we talk about Days Gone, God of War, Horizon, Detroit, etc. and we talk about we and other people talk more about Sucker Punch's unannounced we don't even know what the **** it is game more than Dreams because yeah Dreams is so it's fog you're trying to grab at it and understand what it is and you don't and you can't it's cool Tech but is that going to translate to a cool game? It's but a dream but a dream and I think that's I mean is it in I first off I don't think that there's going to be a beta in 2016. Don't hold your breath. There is that chance I guess of PSX or like and guess what the beta starts now you can get into it right now or go sign up a Dreams and it'll be available later. I don't see that happening. LittleBigPlanet 2 was 2011 or was it 2010? Somewhere in there, 2010 or 2011. Then they made Tearaway. When was Dead Space 2? Because it was the same time as that. Oh God, I",
      "start": 5052.44
    },
    {
      "text": "later I don't see that happening. LittleBigPlanet 2 was 2011 or was it 2010? Somewhere in there, 2010 or 2011. Then they made Tearaway. When was Dead Space 2? Because it was the same time as that. Oh God, I don't even remember. It doesn't matter. The point is is that by the time by the time Dreams come out it's it's something like seven years since they put out a game on Console. I know I know they put Tearaway on Console. It's not Tearaway. I mean all right enough with the um that was a doubling down on a game that people didn't really want to play and I respect their artsiness and I respect their talent, their talent exactly. But I just feel like they got to make a game, you know? Like I I I just don't understand I just don't understand what they're doing. I think the reaction that we've had to it and that the industry at large and then even the audience has had to it is one of the reasons they are dark on it because I think they whether it's Media Molecule or Sony talking to them that when we talk about this",
      "start": 5088.56
    },
    {
      "text": "at large and then even the audience has had to it is one of the reasons they are dark on it because I think they whether it's Media Molecule or Sony talking to them that when we talk about this game next time we have to explain what the **** is happening in it and what the game is and who the character is and what the story is and all these different things and then okay you can build your own too and you can use it to do whatever you want to because that's right now that's how they came out of the gate and that's really hard to explain around. Yeah, and it's funny because the Move controller like there's going to be VR I'm sure in it and and **** like that but because they're they're weird and they're going to do weird and they're going to push themselves and they're going to do that. But it's funny we talked about The Order: 1886 earlier in the show and and I think there's a there's a there's a correlation between these two games when you focus too much on one aspect of the game and",
      "start": 5130.08
    },
    {
      "text": "it's funny we talked about The Order: 1886 earlier in the show and and I think there's a there's a there's a correlation between these two games when you focus too much on one aspect of the game and forget that there's a game to be played your game suffers. And I feel like that happened obviously with The Order: 1886 with its its emphasis on its technical kind of fidelity and with Dreams there's an emphasis on the creation tools and the weirdness of the game because that's what Media Molecule is. And it's almost as if you know when we saw him in GDC they're like the tools are done now we're going to make the campaign. And I'm like but guys like that's what they're going to **** play, you know? A lot of these people are not like Dreams is going to sell millions of copies so people can make their own games. It sounds tedious as hell, I'm sorry. And I just don't feel like a lot of people, you know? I don't feel like everyone that bought LittleBigPlanet did that. I feel like a minority of people",
      "start": 5162.68
    },
    {
      "text": "own games it sounds tedious as hell I'm sorry and I just don't feel like a lot of people you know I don't feel like everyone that bought LittleBigPlanet did that I feel like a minority of people that bought LittleBigPlanet made anything, you know? So I just I'm just confused about what they're doing and I feel like you know I feel like it's not going to happen but I feel like there must have been a time when there was a chance that this game was going to have its plug pulled, you know? Because I just feel like um Sony's not being very good about **** or getting off the pot with a lot of these exclusives, right? And they really really need to get it under control. Um but I also think they're wise in that sense to keep Dreams dark and to really see where they're going and God if it doesn't come out next year man I mean you're you're starting to get in a like scary territory at that point where it's like wow this game has been in development for long time. Yep, so we'll see what happens. I wish",
      "start": 5198.68
    },
    {
      "text": "out next year man I mean you're you're starting to get in a like scary territory at that point where it's like wow this game has been in development for long time. Yep, so we'll see what happens. I wish them the very best. I love them. I mean God when I was in at Gamescom last time I went out to dinner with some of them. They were great people. Um but I just I just fear you know it seems like they need to be guided and like shepherded in a certain direction. There's nothing wrong with making a game. It doesn't have to be you know what I mean? Like I want new things, I want different things but like that's what you always say some sort of familiarity exactly. Yeah, and that's the whole thing of like it doesn't Dreams gets me excited because it's Media Molecule and I know what they're capable of and what how uh clever, quirky, interesting, beautiful their games. All right, but when they come out and just talk about building levels I'm like great like I wasn't good at that in LittleBigPlanet and this",
      "start": 5235.72
    },
    {
      "text": "how uh clever, quirky, interesting, beautiful their games. All right, but when they come out and just talk about building levels I'm like great like I wasn't good at that in LittleBigPlanet and this looks way more complex than that and I don't I'm never going to make any way more comp never going to make anything in here. Yeah, so they have a lot to figure out and I feel like it's maybe an example of biting off more than you can chew, you know? I mean remember that we saw this game at the PlayStation 4 reveal. So we have a question now that depending and who you talk to might tie into what we just talked about with Dreams. Seinfeld and 4 says hey Colin and Greg I've been a fan since Beyond: Two Souls so I have had the pleasure of following both careers for a long time. I remember the impact your reaction had on in and then ended up changing **** Infamous 2 ultimately. I believe your vocal outcry changed the Studio's Direction and brought it more in line with your expectations. My question is do you",
      "start": 5275.4
    },
    {
      "text": "had on in and then ended up changing **** Infamous 2 ultimately. I believe your vocal outcry changed the Studio's Direction and brought it more in line with your expectations. My question is do you think since leaving IGN that you guys are as influential, more influential, or less influential towards impacting change in the industry? Personally I think you are more influential since your audience has grown. I.E. helping keep the Vita alive through your advocacy. Andrew Jelly Hamilton, Ontario, Canada. Honestly I think at best we're as influential. Um I think the worst we're not as influential. Yeah, I don't think that there's any world in which we left the biggest website Gaming website in the world and became more influential. I I think that we're probably as influential with a different group of people and I think we have a very hardcore audience. I think we I think we absolutely I don't I don't think that in any stretch imagination we make or break games or or they sink or swim based on us but",
      "start": 5315.04
    },
    {
      "text": "people and I think we have a very hardcore audience. I think we I think we absolutely I don't I don't think that in any stretch imagination we make or break games or or they sink or swim based on us but we certainly drive lots and lots of people towards games we like and I think everyone knows that. So and that's what it comes down to and I'm not saying everyone at the audience, I'm saying Publishers and developers know that 100%. Um so I but I don't do this for my own influence. I do it because it's fun so I don't give a flying **** if I have any influence or not. But I but I you know um Guacamelee was controllable on a d-pad because of me. You know Cole got changed because of you. Mhm. And you were the first person to see the redesign Cole, the redesign Cole. Yeah, they should. And um so we've definitely tangibly changed things and have been used in the past. I don't mean used in a negative way but used in the past to be like what do you guys think of this before we do anything with it? Um and",
      "start": 5359.88
    },
    {
      "text": "tangibly changed things and have been used in the past. I don't mean used in a negative way but used in the past to be like what do you guys think of this before we do anything with it? Um and we've definitely changed and tweaked things based on our feedback in the past and that is really quite cool. Like I noticed in Axiom Verge that I was in the credits for that. I didn't do anything other than just I really liked it so I talked a lot about it and they appreciated that and that helped them um you figure out and and and I don't mean to be like a dick about it but I made Taco Master chart that month right that it came out. And so the the the question is fascinating. I agree with Colin's assessment but I think the real question has to be asked to you the audience what you think of it because what we've never known really what our power, influence or whatever the hell it is, you know what I mean? I agree with you that if I think we're probably the same is what I would honestly say and I think it's",
      "start": 5400.4
    },
    {
      "text": "never known really what our power, influence or whatever the hell it is, you know what I mean? I agree with you that if I think we're probably the same is what I would honestly say and I think it's because our influence only goes as far as you the audience allows it to go let alone it only influences the people who are dialed in enough to the community they're making games for to understand and care, right? Like yeah we freaked out about Cole and that was a big thing and then yeah Taco Master, sure. Axiom Verge, sure. It's because those people are so in love with their games and so in love with the creation, so invested in their project that when you guys tweet at them and say like what's happening right now with Overcooked where I get tweets all the time of like thank you Greg for talking about Overcooked. They include you every so often too because your Aaron's conversations. Thank you guys for talking about Overcooked, right? Like I'm you know doing it because of you. Oceanhorn, Oceanhorn when I",
      "start": 5437.24
    },
    {
      "text": "they include you every so often too because your Aaron's conversations. Thank you guys for talking about Overcooked, right? Like I'm you know doing it because of you. Oceanhorn, Oceanhorn when I was talking about Oceanhorn that first week it came out everybody's tweeting at me including the developer. They see that, they know that that's when the Vita stuff starts happening. Like it happens because we command in a a a very very dedicated community of best friends that is by far not the biggest internet community, right? But it is the same thing that'll help me win trending gamer of the year over PewDiePie because you guys are so into us and like us and hang out with us and are best friends and interact with us on that level that you'll go out and be helpful, you you'll be positive, you'll start your own hashtag of PS I Love You XOXO or I'm sorry PS We Love You XOXO and sing you guys do that all by yourselves. You sing a lot of developer single out a press person every week to tell hey you're",
      "start": 5476.0
    },
    {
      "text": "your own hashtag of PS I Love You XOXO or I'm sorry PS We Love You XOXO and sing you guys do that all by yourselves. You sing a lot of developer single out a press person every week to tell hey you're awesome and we love your work and the um like that's the influence. That's The Power of Kinda Funny and that's what whenever I do an event whenever I see a uh press person or a developer for the first time they talk about how awesome what we're doing is because of you because of how you guys interact with them if that makes sense. Yeah, I think I talked about this recently with someone where there definitely back end things that have changed based on our feedback but in terms of like the final product and the ev like the evangelizing of a product that we like um there are certainly games that have benefited from that um like Ni no Kuni is a massive one that I identified very early and I'm super proud of that. Catherine obviously um Dragon's Crown, etcetera and so on. But the thing is is that those games",
      "start": 5512.88
    },
    {
      "text": "benefited from that um like Ni no Kuni is a massive one that I identified very early and I'm super proud of that. Catherine obviously um Dragon's Crown, etcetera and so on. But the thing is is that those games were awesome with or without me and if it wasn't for me banging the drum someone else would have banged the drum. And so so I I never sit and like look in the mirror and like you fuckingly yeah really helped Catherine sell or something like that because you really liked it. I'm like no I just really liked Catherine. I had a platform to tell people Catherine was awesome. Someone else would have told them Catherine was awesome. I don't think it would have materially changed anything. So I never really take my own my own influence very serious. I mean the the not the opposite but I think the influence side of that the opposite way is Rocket League, right? Where you saw Rocket League and you came and told our audience Rocket League was awesome but then as soon as Rocket League got into everybody else's hands",
      "start": 5549.96
    },
    {
      "text": "that the opposite way is Rocket League, right? Where you saw Rocket League and you came and told our audience Rocket League was awesome but then as soon as Rocket League got into everybody else's hands that's when it went Wildfire. Oh yeah, it was a Colin was right example to the max but it was so obvious exact that it only took a Daniel Dwire to start evangelizing or someone else and and suddenly everyone realized that it was. So so there are games that are hit and misses and and so yeah I think Spec Ops: The Line probably sold more copies because of me. I think but like how many more, you know? And like and I don't care about any of that. What I care about is does the audience trust us to tell them when something's good or bad from our hearts because it's really a subjective sort of thing anyway. I think Spec Ops: The Line is brilliant. There are people that are going to play and there are people that I'm sure have played it on my recommendation that didn't like it. That's kind of the hit or miss",
      "start": 5588.36
    },
    {
      "text": "think Spec Ops: The Line is brilliant. There are people that are going to play and there are people that I'm sure have played it on my recommendation that didn't like it. That's kind of the hit or miss nature of it but you can trust it. I'm telling you the truth. I never have a a horse in the race. I don't own stock in these companies. I don't really give a flying **** how well Ni no Kuni sells, you know? Except for the fact that we're getting a sequel. And when I think back and back and back and and Namco Bandai offered me that early build of the game and I'm sure other people got it too and everyone ignored it but I put it in and I played it so I was just the first to tell you. Yeah, you know? But again once you realized it that thing spread like wildfire, word of mouth, not because of me. So I take honor in any part I play in in the success of a game and unfortunately we also have parts I'm sure as small as they are to play in the failures of games as well. But um and that's just the kind of natural",
      "start": 5628.92
    },
    {
      "text": "in any part I play in in the success of a game and unfortunately we also have parts I'm sure as small as they are to play in the failures of games as well. But um and that's just the kind of natural equilibrium that you kind of strike into something like this. But again that doesn't matter to me. I just want people to trust what we say and know that it comes from the heart. So when we tell you a game's good or game we like a game um you know that it's not because we're sponsored by them because if we're sponsored by something you would know and then you should take it with a grain of salt which is why for when I talk about Bloodstained for instance I'm like well I'm friends with EA, you know? Like we have Team Fat **** in the game, you know? Like you should know that it's going to be great. But we thought Mighty No. 9 was gonna be great too. So did we? No. Okay, just making it sure. Um so a game so bad that I refuse to finish it. So uh like I literally I took it out of my my PS4. I was like",
      "start": 5662.76
    },
    {
      "text": "we thought Mighty No. 9 was gonna be great too. So did we? No. Okay, just making it sure. Um so a game so bad that I refuse to finish it. So uh like I literally I took it out of my my PS4. I was like we're done never playing this again again. So we appreciate that you guys trust us and that's what's important. It's not the influence and that's and that yeah and that yeah exactly. It all comes back to it. Colin, you ready to meet your best friend? Yes, this is PS I Love This Best Friend XOXO. It's where one of you beautiful people goes over to KindaFunny.com forums, puts your PSN name into the PS I Love This Best Friend list. We read it on the show. You get friend requests from the other best friends and messages of love and support. This one comes from Reuben. That's not his PSN name. Greetings from Canada. I've been a big fan of Farming Simulator for a few years now. Parenthesis thanks Greg and Tim for your Timeless let's play of Farm Sim 15 dedicating hours to putting together a massive thread on the forums",
      "start": 5700.2
    },
    {
      "text": "been a big fan of Farming Simulator for a few years now. Parenthesis thanks Greg and Tim for your Timeless let's play of Farm Sim 15 dedicating hours to putting together a massive thread on the forums for the newest installment but have yet to find any PSN friends to try the multiplayer aspect with with Farming Simulator 17 coming out on October 25th the day PS I Love You XOXO will post. I will be forever grateful if you guys could help me find some best friends to farm with. My PSN name is Blacky Moo, B L A C K I E M O. Thanks guys, Reuben. Everybody if you want to farm send Reuben AKA Blacky Moo some love and if you just want to say hey maybe play different games with me you can do that as well. We actually have a forgotten PlayStation game this week. Uh this week's forgotten PlayStation game comes from True Apple J over on the Kinda Funny forums. He says hey Colin and Greg, my forgotten PlayStation game is Champions of Norrath coupled with it sequel Return to Arms with EverQuest Next getting",
      "start": 5743.88
    },
    {
      "text": "comes from True Apple J over on the Kinda Funny forums. He says hey Colin and Greg, my forgotten PlayStation game is Champions of Norrath coupled with it sequel Return to Arms with EverQuest Next getting canned earlier this year. I think it's I think it's fair to pay a little homage to two of the best Dungeon Crawlers in the PS2 era. These two games along with Baldur's Gate: Dark Alliance and its sequel made for some of the best gaming experiences I've ever had. PS2 Classics where you at? RP EverQuest. What do you think of that one? That's a that's a fine one. Not my kind of game. I mean I was never into them. I only got into the light versions of those games like Gauntlet on N64 for instance was a **** really good game. But I typically but that's like a that's like Dungeon Crawler light baby baby like mixed with an arcade game really. I don't typically get into those kinds of I remember them and I respect your decision. Good PlayStation gem. I don't know about Warriors Orochi would have been on there too.",
      "start": 5792.72
    },
    {
      "text": "with an arcade game really. I don't typically get into those kinds of. I remember them and I respect your decision. Good PlayStation gem. I don't know about Warriors Orochi would have been on there too. Uh PSN's worst name of the week this week comes from I Nom Nom Awesome. It's a walk but stick with him. Hey guys, I've been listening to you for years but this is my first time riding in. My current PSN name is I Nom Nom Awesome but that's not the name I'm submitting. Neither am I submitting my previous PSN account that got banned for the name of Eat You Are Crap, Eat Your Crap. Bear with me here but the actual names I want to submit are the names I used to use on Xbox 360. Every time someone reported me for the inappropriate name Xbox made me change my name. I went through nearly 200 names before they permanently banned me. Examples of my banned names include Eat You Are Crap, Drink You Are Piss, Don't Lick Me There, Scrotum Hair FTW, Yum Scrotum Hair, Scrotum Bumps FTW, Twist My Titties, I Tangled My Balls, I",
      "start": 5836.96
    },
    {
      "text": "banned me examples of my banned names include Eat You Are Crap, Drink You Are Piss, Don't Lick Me There, Scrotum Hair FTW, Yum Scrotum Hair, Scrotum Bumps FTW, Twist My Titties, I Tangled My Balls, I Tongue Juicy Vagge, I Tongue Titties, I Have Great Balls, My Pink Your Ass, parenthesis this name got me a report and I had to change it in less than an hour and parenthesis My PP Your Ass. But hey at least Xbox gave me plenty of chances to change my evil ways. I never learned. I've always wanted to submit for the segment so hopefully being on Xbox doesn't disqualify me. PS to demonstrate my current PlayStation devotion I have 38 platinums. I Nom Nom Awesome. Sho, he let these people change their names. I Nom Nom Awesome will not be stopped and you could have made a lot of money if you charged them every time like these Xbox 360 people did. It's got to be close, right? We got to be close to this now they changed. You think it's PSX this year? I don't know. I don't want to get my hopes. I'm so **** tired of this",
      "start": 5886.68
    },
    {
      "text": "these Xbox 360 people did. It's got to be close, right? We got to be close to this now they changed. You think it's PSX this year? I don't know. I don't want to get my hopes. I'm so **** tired of this ****. All we do is get our hopes up and it's so ridiculous. Just let us change our **** names. It is literally 10 years since PS3 came out. Yeah, it's time. I guess so. But maybe it's just less what you do matters with such a dumb **** excuse. Uh Jericho, who by the way I've I've it's coming to my attention just in the fact that I work with Jericho every week. I don't give him enough props in the show. Of course Jericho compiles your questions over on the PS I Love You XOXO forum and he is the one who then goes through, listens the show early and makes the nice uh Forum thread every time. So thank you Jericho. Uh if you remember uh we were doing the whole vote over there on the forums for the worst PlayStation name of the Year taking all the ones from the 50 episodes compiling them in then going and doing",
      "start": 5940.88
    },
    {
      "text": "uh if you remember uh we were doing the whole vote over there on the forums for the worst PlayStation name of the Year taking all the ones from the 50 episodes compiling them in then going and doing like round robin bracket kind of thing tournament to come down to the final four. Jericho writes in and says he says it in German but he basically says Mr. Miller, Mr. Moriarty, today is the day the Kinda Funny Best Friends have chosen the finalists of the best worst PlayStation Network name of the year. Year one. I imagine the Fanfare in the background while these words are being spoken. 60s style. Think of Fallout's Fallout Boy instruction videos in the grand finale. We come together to pick one of the following names and Crown it the winner of this title, the first title. So from episode 13 your first finalist is Not Gay But $5 Is $5. From episode 17 your second nominee is Come Honor Chest_Honor like For Honor. Come Honor Chest_. Episode 34 Don't Shoot I'm Gay. Episode 48",
      "start": 5979.16
    },
    {
      "text": "13 your first finalist is Not Gay But $5 Is $5. From episode 17 your second nominee is Come Honor Chest_Honor like For Honor. Come Honor Chest_. Episode 34 Don't Shoot I'm Gay. Episode 48 and 50 Anime Tit Lover. I ask you all of my best friends out there to go to the forums, open the thread of this week's episode and click on the link to the big election which is way more important than any other election in the world. Parenthesis the joke is real and vote. Vote or Die as they say or Join or Die as Colin tattoo says. Uh what I will do is put the Google Form link, the Google Form link I should say into uh this week's description on YouTube so you can get it there too or you could go it's a tough decision to KindaFunny.com forums and jump in there. I have my pick but I'm not going to say it. I don't want to skew the results. I've done that before where I I made sure my Extra Life T-shirt that I wanted to win happen so I won't do that here but I will tell you that the worst PSN name of",
      "start": 6019.16
    },
    {
      "text": "it I don't want to skew the results I've done that before where I I made sure my Extra Life T-shirt that I wanted to win happen so I won't do that here but I will tell you that the worst PSN name of the week is to you by Movement Watches at PS I Love You XOXO. We teamed up with brands that are or we team up with brands that are trying to do something new. We love innovation and companies that are changing the industries they're in. So when Movement, when Movement introduced themselves and sent over some watches, pow, we were really impressed. Now I'm supposed to wear this watch, Colin. Well, I'm not supposed to, I wear the watch, but I wear it when I'm in my suit. I'm not just going to wear it around, right? It's the black-on-black one. I like it. It's got the red stuff. What do you got for me, Kev? 141. Thank you, Kev. Look at you being a JW 141. I like. Now you got a watch too, right? Yes, you like it? Yes, pretty. I like the the the watch, the band. I want to kind of change, to be honest. You can do that, I bet.",
      "start": 6070.36
    },
    {
      "text": "you, Kev. Look at you being a JW 141. I like. Now you got a watch too, right? Yes, you like it? Yes, pretty. I like the the the watch, the band. I want to kind of change, to be honest. You can do that, I bet, with Movement Watches. It's apparently the case. That's not even a setup. No, no, not at all. No. Uh, let me tell you, ladies and gentlemen, a little bit about Movement Watches. The company started out with two broke college kids that wanted to wear stylish watches but couldn't afford them. They did some research and found out that big watch brands were passing huge retailer markups onto the consumer. Movement decided that by selling online, they were able to cut off the middleman and provide the best possible price. Movement Watches start at just $95. At the department store, you're looking at 400 to 500 bucks. Movement has grown organically purely by supporters like you. So join their more than 1 million social media followers and get a Movement Watch today. Go to MVMTWatches.com and use the promo code XOXO.",
      "start": 6109.24
    },
    {
      "text": "has grown organically purely by supporters like you. So join there are more than 1 million social media followers and get a Movement Watch today. Go to MVMTWatches.com and use the promo code XOXO and they'll give you 15% off your entire purchase. Again, MVMTWatches.com, use the promo code XOXO. What do you got for me? Can you hear the... this leather smells like my hockey equipment, but not like worn hockey equipment, like new hockey equipment. Brought me back. You know how smells so intimately tied to memory? Yeah, brought me right back to the hockey arena. I'm back there in Missouri, staying like hockey tape, actually, with my friend Ashley. She was a Mizzou softball player, no big deal. Her husband, baseball player, no big deal. They so you know these kids are coming out, they're they're going to be playing all kinds of sports now. They're going to be playing all sorts of crazy kind of sports, right? Last time I was there, of course, because baseball drafts everyone, that's why I understand. No, they're big in.",
      "start": 6146.68
    },
    {
      "text": "all kinds of sports now. They're going to be playing all sorts of crazy kind of sports, right? Last time I was there, of course, because baseball drafts everyone, that's why I understand. No, they're big in. They're they're big in the baseball. They're playing the soccer, doing this. The Gibson now taking up hockey. He's taking up the hockey. They got to drive him down to Jeff City so he can get on the ice out there. She didn't know that skates needed to be sharpened because nobody in Missouri plays hockey. So he was out there. No one in Missouri plays hockey. Yeah, yeah, well, at least in Columbia, I guess. But it's out there now. He's out there now. He's playing. Do he play? What position? I he's he's what, six, seven? He's not they're not playing anything. Okay, I was playing in the travel team the time seven, so I'm not **** impressed. You understand what I'm saying? Again, though, I mean, do you understand though, they're trying to bring hockey to a place in the country that doesn't do it. So I mean, just give him a.",
      "start": 6191.48
    },
    {
      "text": "not **** impressed. You understand what I'm saying? Again, though, I mean, do you understand though, they're trying to bring hockey to a place in the country that doesn't do it. So I mean, just give him a second here, you know what I mean? This is very much like when the government took the natives and let them watch the bomb be dropped on their own home. They gave a little beer, little Tiki. Here we go, guys. Like, oh man, this this going to be cool. I don't know, just watch their entire life obliterated in a nuclear F. Ladies and gentlemen, this has been PS I Love You XOXO, episode 58. Remember, this is KindaFunny.com's PlayStation podcast. So keep the mics on. Go to KindaFunny.com. Look at all the other videos. Listen to all the other podcasts. Subscribe to the YouTube channels. Rate us on iTunes. Rate us on Google Play. Wherever the hell you get it. If you get a weird bug on iTunes through the podcast app that says this episode's unavailable, apparently that is a known bug with the podcast app. We don't know what.",
      "start": 6221.6
    },
    {
      "text": "Play, wherever the hell you get it. If you get a weird bug on iTunes through the podcast app that says this episode's unavailable, apparently that is a known bug with the podcast app. We don't know what we can do with it on our end. It doesn't seem like much. You restart the app, you update your iOS, it works. It worked for me. I've gotten it too. It's annoying. It's an iOS thing. We're looking into it. I don't want to hear about Google. I don't want to hear about what they do. Thank you, Kevin. Remember, you get it on SoundCloud too, if you wanted to get it that way. No, Kevin, I said I don't want to hear about it. Episodes post every Tuesday, 9:00 a.m. YouTube and podcast services around the globe. Every episode of PS I Love You XOXO ends in a song in a segment we call Singing a Shoey. This is where one of you talented **** goes to KindaFunny.com/PSM and submits a song you created. Remember, I need an MP3 link to put at the end of our MP3 and a YouTube link so I can annotate at the end of our YouTube video to.",
      "start": 6258.8
    },
    {
      "text": "**** goes to KindaFunny.com/PSM and submits a song you created. Remember, I need an MP3 link to put at the end of our MP3 and a YouTube link so I can annotate at the end of our YouTube video to you. This one comes from Skiz. Skiz says greetings and salutations, Colin, Greg, and all the Best Friends and even big Kev dog. My name is Jamie, but I go by Skip (pronounced Skip). It's something from a movie called Hedwig and the Angry Inch or a variation of everywhere but the real world. I don't... he's going back to Skiz again. Uh, I've been making music by myself at home for the past several years and put several finished projects up online as well as editing a few videos together. The coolest thing that has come out of that was being able to see my analytics on SoundCloud of how many people have listened to my music, not that many, and seeing.",
      "start": 6302.16
    },
    {
      "text": "as editing a few videos together. The coolest thing that has come out of that was being able to see my analytics on SoundCloud of how many people have listened to my music, not that many, and seeing where in the world they are. That statement alone still blows my mind, where in the world they are. I may be young at 26, but I remember a time growing up where I personally couldn't connect with anyone in the world at will. To know that I, a real life human being somewhere out there in the world, actually listened to something I created and maybe even liked it, blew my mind. I'm sure you guys can relate with this awesome community you have built. I'm very happy for you guys and thank you for all the hard work, dedication, and risk-taking for the benefit of all of us. Long story short, you guys inspire me. I've only uh been a real avid fan for the past year and some change, but year and some change, but the amount of joy you guys bring to me is the Best Friends can like you cannot be quantified.",
      "start": 6349.12
    },
    {
      "text": "me. I've only uh been a real avid fan for the past year and some change, but year and some change, but the amount of joy you guys bring to me is the Best Friends can like you cannot be quantified. I listen to every episode of PS I Love You XOXO, and at the very end of every episode, I always think to myself that I really should try to get one of my songs on there. So here it is. This is a song I made almost 3 years ago when I was 23. The project it is called is Songs About 23, and I worked on it the whole year of my life. It isn't very polished and it isn't extremely conventional, but it represents me and where I was at that time. So this is Skiz. The song is Mea. The album, Songs About 23. Until next time, it's been our pleasure to serve you. Pleas.",
      "start": 6391.52
    }
  ]
}
