{
    "id": 2143,
    "video_id": "Axhf_Q1rgbs",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Unboxing a Ghostbusters Proton Pack - Kinda Funny Reacts",
    "description": "Greg's living the dream and unboxing his new Proton Pack that lights up and makes noises. Thanks, Ted House, for building it!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1477670401,
    "duration": 786,
    "transcript_chunks": [
        {
            "text": "What's up everybody, it's me, Greg Miller, and you know that I have an unhealthy obsession with Ghostbusters. I have my own Ghostbusters outfit I wear all the time and cosplay with. I have a Proton Pack that I bought off of Andy Eddie, one of the Bay Area Ghostbusters, but uh, it's an older Proton Pack and it doesn't light up and it doesn't do a whole bunch of stuff. And that's where, ladies and gentlemen, Ted House enters the picture. Ted House, you probably know, he's one of the Kinda Funny Best Friends. He goes by the name the Hip Albatross on Twitter. We talk to him on Twitch all the time. Kevin, you know the Hip Albatross? Yep, you do know him, not like personally, but you heard of uh, Ted, of course, a fellow ghost head like myself, has his own Proton Pack, has his own jumpsuit just like me, and he was getting ready to make a Proton Pack that lit up and made noises and did all this stuff, and he said, \"Hey Greg, would you like to buy one?\" And I said, \"Yes, I would.\" Ted House, Hip Albatross, he did it. So in here is a",
            "start": 0.12
        },
        {
            "text": "ready to make a Proton Pack that lit up and made noises and did all this stuff, and he said, \"Hey Greg, would you like to buy one?\" And I said, \"Yes, I would.\" Ted House, Hip Albatross, he did it. So in here is a Proton Pack Ted House assembled for me that makes noises. Now, if you're one of these ghost heads out there who gets all mad when the people don't make their own Proton Packs and they they I I just don't have time and I wouldn't be good enough. Kevin, do I have any arts and craft skills? No, God no, I don't. So it's one of those I had to have Ted step in. So we want to give a few shout outs. Of course, follow Ted at the Hip Albatross on Twitter, all one word. He had help from the Arizona Ghostbusters. You can follow them on Instagram, _Ghostbusters. Uh, Jeff is in the movie Ghostheads the documentary just like I am, so check that out. Uh, the blueprints for this one came from gbfans.com. All I've drank is coffee. Also, Ted House, the Hip Albatross, is streaming for Extra Life, so go toss him",
            "start": 37.52
        },
        {
            "text": "just like I am, so check that out. Uh, the blueprints for this one came from gbfans.com. All I've drank is coffee. Also, Ted House, the Hip Albatross, is streaming for Extra Life, so go toss him a follow on Twitch. He's just Hip Albatross3. That's also his PSN. Hard to believe, Kevin, there was so many Hip Albatrosses. He had at 3 door. So we to going. I haven't seen it, hopefully it's not broken. Big C-Dog, you containers cracked a little bit. I saw the containers crack, but I also saw there's a lot of bubble wrap in there. Ted House knows how to pack pack a Proton Pack. All right, that's done. Oh, Kevin, it's a big moment. Oh, cutting the Sky Cam in a second. Sky Cam it up. What do we got in here? All right, we got some documentation in the first chord for the Proton Pack. Let's see what the Hip Albatross has included in here. And as I pointed out, I think in the intro, but I've already did the intro once, I didn't like it. I'm paying him for this. This is not just something he's giving me. This is far too nice first",
            "start": 77.16
        },
        {
            "text": "in here. And as I pointed out, I think in the intro, but I've already did the intro once, I didn't like it. I'm paying him for this. This is not just something he's giving me. This is far too nice first off to do this period, let alone to give it away. So here we go. It's a Proton Pack operator guide. So you decided to wear an unlicensed nuclear accelerator on your back. Here's a rundown of the simple operations and uses. There will be instructions for maintenance included as well. Oh my God. All right, he's talking. He switched the power to operate 0C. I need 0C batteries. Kevin, do we have those sitting around? No, I'm going to assume they're in here. Uh, and two AA batteries. Oh, they're already installed. Any included replacements? The Hip Albatross, come on now. Uh, the two toggles. We'll get the toggle. Everyone wants to see it. Here's my stuff here though. I mean, what's the worst, what's the worst that could go wrong, right, Kev? Mhm, yeah, it'll be fine, probably. Uh-huh, uh-huh. Greg Miller, this is your Proton Pack.",
            "start": 134.96
        },
        {
            "text": "wants to see it. Here's my stuff here though. I mean, what's the worst, what's the worst that could go wrong, right, Kev? Mhm, yeah, it'll be fine, probably. Uh-huh, uh-huh. Greg Miller, this is your Proton Pack. These instructions should serve you well, but as a fellow Ghostbuster, I know you don't really need a tutorial. True. I hope this lets you live your childhood dreams, as that's why I joined the Arizona Ghostbusters and genuinely started costuming at my local conventions. I know this prop was a long time coming, but know that I put the utmost love into it, into because you put the love in your content. I didn't do it all by myself. My fellow, the my fellow members of the Arizona Ghostbusters helped me immensely by acquiring parts and installing electrical in the Neutrona Wand. That'll come into play later on. gbfans.com is where I downloaded the specs for building it, and it was an invaluable resource to make the screen accurate hero pack. If you have any questions, you can call me. Remember, don't cross the",
            "start": 176.12
        },
        {
            "text": "gbfans.com is where I downloaded the specs for building it, and it was an invaluable resource to make the screen accurate hero pack. If you have any questions, you can call me. Remember, don't cross the streams. We won't. Also, I got buttons. I got I got buttons and stickers in here. Those will go on my laptop. You see those soon. Phoenix Comicon, here we go. Kev, you slide a little. Look at the frame. There you go. There it is. I'm going to I have a feeling it's going to have to be pulled out long before anything happens. Oh dear. Oh dear, Kevin. All right, hold on. All right, Kevin, hold on. Hold on, Kevin, it's happening. Hold it, Kevin, it's important not to panic. Do not panic. All right, holy Kevin, are you panicking? I'm starting to pan. I'm panicking. Oh my God, Kevin, we have the tools. We have the talent. Slide that on there. Oh my God, Kevin, I got power core. Oh my God, Kevin, it's already so much cooler than the one I have. Not that I'm putting down the one I have, Kevin, it's just that it's not it's not, you know, so",
            "start": 217.48
        },
        {
            "text": "on there. Oh my God, Kevin, I got power core. Oh my God, Kevin, it's already so much cooler than the one I have. Not that I'm putting down the one I have, Kevin, it's just that it's not it's not, you know, so important question. Did you bring your suit today? I did not bring the suit today. I just came from a meeting. Am I supposed to wear the first off? Guess what though? Here's the thing, Kevin, you're you're underestimating the fact of when can people see me wear this all of it at once. Calling Greg live Monday, October 31st, Halloween, my favorite holiday. Come on, get this out of here. Get this out of here. Oh dear Lord. Oh my God. Not only does it have the Proton Pack in here, Kevin, shoot at it. I am. It's got the comforter. It's got the Real Ghostbusters. Is this it's the sleeping bag? I had this. Ted House, now I have it again. I will mail it back to if you want, but I will also take adorable photos of little Portillo snuggled up in a thing that I used to go to the overhead Camp. I was waiting for you to set the",
            "start": 274.88
        },
        {
            "text": "have it again. I will mail it back to if you want, but I will also take adorable photos of little Portillo snuggled up in a thing that I used to go to the overhead Camp. I was waiting for you to set the thank you. Look at it. Oh, look at Fat Ray. Oh my God, I ain't afraid no ghost. Oh my God, Kevin, now this is a blast from the past. This is worth it enough on its own. All right, do this, do this, do this. Got some batteries left in there, I think. Put it. I mean, cuz it's rare, Kevin, you you you get something, you buy something that you know you're going to wear the next four decades of your life. You know what I mean? That is very rare. Cuz it's one of those like, oh, look at that. Oh, holy God damn, Ted. God damn. Holy Kevin, that's a good looking Proton Pack. Is it cool or is it not cool? It's really cool to a very small group of people. You know, what are you one of those groups though? I am. Yeah, you know what this means, Kevin, as somebody who's you've dawned for Let's Plays before, Kevin, my secondary suit. Yep, that",
            "start": 333.36
        },
        {
            "text": "small group of people. You know, what are you one of those groups though? I am. Yeah, you know what this means, Kevin, as somebody who's you've dawned for Let's Plays before, Kevin, my secondary suit. Yep, that means next time you do it, you get the back the Proton Pack. I used to pack. Oh my God, I'm very excited, Ted. Oh my God. All right, so let's see how we light everything up here now. Okay, power on the lights. This is like so intricately detailed on how to do it. There's two do on the two. Oh, here we go. Those are what been toggled on on the B bottom here, bottom the pack on the frame. These two toggles will turn on the speakers. A white dot in each one will indicate if the audio is on. I think that means it's on when you hear the iconic power down noise when you act when you activate both switches. Oh, maybe the batteries aren't in it. No, I think he said the batteries were in it, right? He's oh, they are installed and maybe they got jostled at though. Let's keep moving. We'll see what happens. Pick up the Neutrona",
            "start": 398.76
        },
        {
            "text": "batteries aren't in it. No, I think he said the batteries were in it, right? He's oh, they are installed and maybe they got jostled at though. Let's keep moving. We'll see what happens. Pick up the Neutrona Wand. Got it on, which is three silver switches, one black button, and one red button. Flip the switch labeled line through. I see what he's saying. Oh, oh, oh, no, Kevin. All right, flip the switch L to turn on the pack lights at any time. Got it. Flip the switch to activate the Neutrona Wand. Move the paper. Hold on, is doing it. All right, I'm going to flip this switch now. Kev, have you ready? Yep. Oh, Doctor Kevin, look at the Neutrona Wand. It's got a little dial there for things too. Oh, oh, son. Now flip the switch labeled activate up to turn on the power. The little red button at the end of the wand. It's vibrating. It's it's glowing too. Oh, it looks cool from the front. Yes, yes, Kevin, yes. We have the power. We have the tools. We have the talent. Holy. Now I can intensify. No, do it again. Do it again. All right, turn turn off lights.",
            "start": 469.6
        },
        {
            "text": "glowing too. Oh, it looks cool from the front. Yes, yes, Kevin, yes. We have the power. We have the tools. We have the talent. Holy. Now I can intensify. No, do it again. Do it again. All right, turn turn off lights again. Going. I'm going to push the button labeled intensify for a real showstopper. Oh, that's it was already pressed when it came on. So hold on, dude. I could have never built this. I am not nearly Ted. Not a chance in hell. Power on the Proton Pack. Powered on. Audio play. Operating your Proton Pack. Uh-huh. There are six bolts that hold the shell of the frame. Two on the top left, two. They can easily be unscrewed and tightened by hand. Okay, okay. I think those are the bells and whistles here. Please don't break the screen. I'm not going to break the screen. I'm worried about the Proton Pack though. You know what I mean? I'm sure it'll be fine. It looks sturdy as I didn't wear my backpack to work today, cuz I knew I'd be wearing this one home. And let me tell you, the Uber driver is not going to know what to make of",
            "start": 532.6
        },
        {
            "text": "mean. I'm sure it'll be fine. It looks sturdy as I didn't wear my backpack to work today, cuz I knew I'd be wearing this one home. And let me tell you, the Uber driver is not going to know what to make of it. You could always just put it in the blue bin again. Kevin, when you have a Rolls-Royce, you don't park it in the garage. Sure, Kevin, do I look as cool as I feel? Cuz I feel pretty cool. Yeah, you look pretty dope. Yeah, we got to set. That's what it comes down to. No, you look great. Turn turn it on. Let me see. Let me see like the that part. Yeah, there it is. There it is. There, Tim. All my dreams have come true. Tim, the Hip Albatross did it. Tim, you're you left. You left before Tim already left, but I got it. Here it is. Is this is amazing. Thank you so much, Ted. Thank you, the everybody follow, send love and support to the Hip Albatross. Uh, on Twitch, follow him there. Hip Albatross3. He's doing that there. Extra Life. So are we, of course, KindaFunny.com/ExtraLife. I'm assuming he's on our team. Thank you to the",
            "start": 610.96
        },
        {
            "text": "and support to the Hip Albatross. Uh, on Twitch, follow him there. Hip Albatross3. He's doing that there. Extra Life. So are we, of course, KindaFunny.com/ExtraLife. I'm assuming he's on our team. Thank you to the Arizona Ghostbusters. I'm just going to look at myself for a while while I talk. Thank you, the Arizona Ghostbusters. Everybody follow them on Instagram at AZ_Ghostbusters. Thank you, gbfans.com, where they have all the blueprints, where you could get one of these made yourself if you have talent like our good friend Ted does, cuz God knows I don't have this kind of talent. Kev, now here's the big question. Kev, I didn't look at the hook. Oh, damn, it's not even a hook. I thought it was a hook. It's not though. You slide right in there. It's it's awesome. It's everything I've ever wanted. You excited for this Halloween? I've I'm always excited for Halloween, but this one, very excited for this Halloween. Yeah, wait till I walk in on Monday in this thing. Huh? Colin Moriarty won't believe his eyes. I mean, he'll",
            "start": 695.12
        },
        {
            "text": "Halloween. I've I'm always excited for Halloween, but this one, very excited for this Halloween. Yeah, wait till I walk in on Monday in this thing. Huh? Colin Moriarty won't believe his eyes. I mean, he'll already have seen it though. Just let me have this, Kevin. Yeah, you're right, he won't believe it. Ted House, thank you so much. Ghostbusters fans around the world, thank you so much. Until next time, no, it's been our pleasure to serve you.",
            "start": 755.24
        }
    ]
}