{
    "id": 2146,
    "video_id": "caPXNVjYW-k",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Civilization 6 Impressions - Kinda Funny Gamescast Ep. 92 (Pt. 1)",
    "description": "Colin gives his thoughts on what he has played of Civilization 6.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1477918803,
    "duration": 1451,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by MVMT Watches. That's, you know, MVMT Watches. It was founded on the belief that styles shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion, buffering high quality minimalist products at revolutionary prices. We got ours, they're legit. One Kevin Coello says that his is sexy as hell and it fits really well. Those are paraphrased quotes, but it kind of gets the spirit across. The company started by two broke college kids that wanted to wear stylish watches but couldn't afford them, so they started their own watch company. Kind of sounds like when we left IGN to do our own thing because, you know, we wanted to do our own thing. I respect that. MVMT Watches starts at just $95. At a department store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic",
            "start": 0.08
        },
        {
            "text": "store, you're looking at hundreds of dollars. MVMT figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price. We're talking classic designs, quality construction, style, minimalism. Over 500,000 watches have been sold in over 160 countries. Here's the deal: you can get 15% off today with free shipping and free returns by going to MVMTWatches.com/kinda. The watch is a really clean design. Seriously, Kevin's making compliments, everybody's loving him. Now's the time to step up your watch game. Go to MVMTWatches.com/kinda. Join the movement. That's a tagline I like a lot. What's up, guys? Welcome to the first ever Episode 9 of the Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. It's good to be here. Doing well, thank you. I'm good. Good. Me and you went to Twitter today, Greg. We did. That was fun. Met the new Zara of Twitter gaming. Uh-huh. Seems like a nice guy. He",
            "start": 37.44
        },
        {
            "text": "and Greg Miller. It's good to be here. Doing well, thank you. I'm good. Good. Me and you went to Twitter today, Greg. We did. That was fun. Met the new Zara of Twitter gaming. Uh-huh. Seems like a nice guy. He is a good dude. Yeah, rest in peace, Rod. He was a good guy. Guy. Rod didn't die, he just went somewhere else. Yeah, Rod was great, but this new guy, I like him. Gaming going places. Yeah, yeah, yeah. What you been playing recently? Tetris. Lots of Sparcade Tetris. You're addicted. Over 450 of you sent me Sparcade friend requests. Thank you very much for uh, continuing the addiction I have to the Tetris on Sparcade. Uh, I've taken a lot of money from all of you and I appreciate that and I want you to keep bringing all your money at me. I'm up 20 bucks on Sparcade. Is that it? Put after all of this, you're up 20 bucks? Well, a lot of kids don't play. I mean, I mean, you can play it for free, so the majority of our fans just play it for free. Only only the wily ones like your Joey Noelle's come out here and actually put money down and",
            "start": 94.96
        },
        {
            "text": "of kids don't play. I mean, I mean, you can play it for free, so the majority of our fans just play it for free. Only only the wily ones like your Joey Noelle's come out here and actually put money down and then get smoked. How's that going with with the rivalry between the two of you? Well, now it's all screwed up 'cause one of the the downsides to Sparcade is that they put all your in your friends tab is all your friend requests and then the people challenging you to games. So I currently have 430 friend requests burying all the games I need to do, but I found last night that if I sit there and just spam like this, it'll go through and catalog them a little bit faster. But I'm working on some Greg Miller trickery to get through there and do that. But yeah, I've been playing a lot of that. Uh, last night I played Batman Episode Three. Very good. Very good ending. They continue to manipulate the Batman story and what you think you're going to get. It's very, very interesting. I like what they're doing with the",
            "start": 137.72
        },
        {
            "text": "Batman Episode Three. Very good. Very good ending. They continue to manipulate the Batman story and what you think you're going to get. It's very, very interesting. I like what they're doing with the three of them. What are what's your kind of take on it on each one? Episode One was very, I I think not by the numbers, but it was okay. This feels like a normal Batman game. This feels like a normal Batman story. And then the end, there's like this revelation of like, oh, is that really what it's going to be? Or is it going to be a cliffhanger where we come back and they undo that immediately? They didn't undo it. Episode Two continues then to spread it out and get really interesting with the lore, really change it up to some stuff we haven't seen before in a Batman narrative. Then Episode Three continues on that and again ends in a very, very interesting spot. The twist ending here, I didn't see coming. Uh, I and I'm it's it leaves me a lot. Episode One ended, I was like, oh, that's cool. I'm interested to see where it ends.",
            "start": 173.0
        },
        {
            "text": "again ends in a very, very interesting spot. The twist ending here, I didn't see coming. Uh, I and I'm it's it leaves me a lot. Episode One ended, I was like, oh, that's cool. I'm interested to see where it ends. Episode Two ended, I was like, ****, I can't wait to play Episode Three. And Episode Three ended, I'm like, I can't wait for Episode Four because it's putting in such a different where we haven't played Batman before when we've played a Batman game before. Uh, and then also Titanfall. Uh, I got Titanfall 2. Uh, was excited to jump into multiplayer. Servers aren't live yet. I was hoping I could jump on with some of the reviewers or people who were still playing. I guess that's come and gone already, that window. So now I'm just waiting until Friday when it's out for everybody and I can play on servers there. But I played single player for a while and I was a bit disappointed. I we've talked about it a million times. I'm not first-person shooter guy. I'm usually not shooter narrative guy. And then we talk",
            "start": 210.12
        },
        {
            "text": "but I played single player for a while and I was a bit disappointed. I we've talked about it a million times. I'm not first-person shooter guy. I'm usually not shooter narrative guy. And then we talk about shooter. I mean, like for me, Titanfall has always been the weird one. Titanfall One especially, where I was drawn to the multiplayer, really enjoyed it, put a month and a half into it. Don't listen to Colin and had a great time. Regen, as they say. Uh, but had a like that actually a draw me and what I liked about it. So I was like, okay, single player, this will keep me going and blah, blah. And I jumped in and just not it didn't click for me to I played a couple hours last night. I'll get back to it. I'm sure this weekend waiting for the servers to go live. But once servers go live, that's really where it's at for me. Yeah, we had a a review over at YouTube.com/KindaFunnyGames by one Alfredo Plays. Yeah, you should check that out. And he had come when I talked to him more about it like uh, through text when",
            "start": 246.44
        },
        {
            "text": "for me. Yeah, we had a a review over at YouTube.com/KindaFunnyGames by one Alfredo Plays. Yeah, you should check that out. And he had come when I talked to him more about it like uh, through text when he was working on it. He was saying like, yeah, I don't know if single player is like great, but then all the other reviews were like, this single player is awesome. And that's why I'm not ready just to be done with it. It's it is this interesting mix of, you know, you are this guy, you get bonded to your Titan early. You're not supposed to have this Titan. Now you do. And like, there's this interesting like dialogue choice in it where you're playing, you get to pick how the guy responds or what questions he'll ask. And the the the interaction is funny. The robot, of course, very robot robotic, right? Answering the questions very literally, doing all these different things. There's some chances for fun stuff there. But it is this interesting uh, mix of like, I, you know, everybody when Titanfall originally came out,",
            "start": 281.72
        },
        {
            "text": "questions very literally, doing all these different things. There's some chances for fun stuff there. But it is this interesting uh, mix of like, I, you know, everybody when Titanfall originally came out, they're like, oh man, a single player campaign would have been great. You jump into this and it's interesting to see how they break you apart from the Titan, put you back together. There's bosses that are in their Titans that you need to go the other Titans. People show up in their Titans are talking **** to you through your comms. You're eavesdropping on their conversations. It's very interesting. But it's beautiful. Like the thing about it is, it's beautiful. It's running really well well on PlayStation 4. The wall running is as fun as I remember. The shotgun is as good as I remember. It looks so crisp and clear. I can't wait to get into multiplayer and have that challenge. And I want to, you know, play more of the single player campaign to see if it turns that corner 'cause I was looking through trophies and",
            "start": 318.36
        },
        {
            "text": "clear. I can't wait to get into multiplayer and have that challenge. And I want to, you know, play more of the single player campaign to see if it turns that corner 'cause I was looking through trophies and a lot of the trophies seem to be single player oriented, which surprised me. I was expecting to be the opposite where I'd play through a lot are hidden, but it seems like the majority are single player. H, very cool. Yeah. Uh, I got to do a Let's Play of Sonic Mania. That's now also on YouTube.com/KindaFunnyGames. And uh, my God, that game, it's everything I could ever want. I was talking to you about this on our uh, drive over here, but it reminds me a lot of Mega Man 9 and 10 in the way that they're just they seem to be nailing it. Like, don't say that this this no, in in in terms of like the what it did is for the franchise, this is in Sonic 4. You like, this isn't Sonic 4 Episode 1. This is it seems like it's made by people that really, really, really care about nailing um, the aesthetic, the feel, the the level design,",
            "start": 351.08
        },
        {
            "text": "this is in Sonic 4. You like, this isn't Sonic 4 Episode 1. This is it seems like it's made by people that really, really, really care about nailing um, the aesthetic, the feel, the the level design, everything about what made the the other ones so great. So I'm super stoked about it. It was a lot of fun. It felt perfect playing. We got to uh, debut the exclusive news of um, Tails and well, we knew they were going to be playable. It was the first time we ever seen them playable for Tails and Knuckles. And uh, there's a new stage. And uh, you should definitely check it out if you're if you like Sonic at all. It's like they're nailing it. Like, this is going to be the Sonic game I think that will ever happen again. Like, this this is it. This is their last hurrah. And then other things will happen after that. But uh, it's I had a lot of fun with it. Um, check it out. Uh, Spring 2017. Right now the time about PS4, Xbox One, and uh, PC. But I'd be shocked if it doesn't end up on that their Switch. That Switch ball coming at you.",
            "start": 387.08
        },
        {
            "text": "I had a lot of fun with it. Um, check it out. Uh, Spring 2017. Right now the time about PS4, Xbox One, and uh, PC. But I'd be shocked if it doesn't end up on that their Switch. That Switch ball coming at you. Yeah, that's a new thing. You can't throw up the X. I love it. Uh, this is the Kinda Funny Gamescast. Each and every week we get together, talk about video games, all things we love about them. You can get it early on Patreon.com/KindaFunnyGames or you can get it late on YouTube.com/KindaFunnyGames. Either way, I love you a lot. You're a really cool person. You do a lot of cool things just like Stephen Enzler, once again, producer of this show. Shout out to you, my friend. You are doing God's work. Speaking of God's work, Colin, Civilization 6. Yes. Uh, just real quick before we get into that, uh, we have a Sparcade uh, sponsorship coming up, so I just want everyone to know. No, we talked about that in the last Gamescast with Greg. Greg, of course. Yeah, Sparcade. We're doing a let's uh, sponsorship event. Let's",
            "start": 425.92
        },
        {
            "text": "a Sparcade uh, sponsorship coming up, so I just want everyone to know. No, we talked about that in the last Gamescast with Greg. Greg, of course. Yeah, Sparcade. We're doing a let's uh, sponsorship event. Let's Play H in December. It looks like there'll be details about it. But good call. So just to be perfectly transparent about that, of course. Uh, also a shout out to Battlefield 1. Uh, still playing it. Uh, still pretty early, but the game's really great. Um, also uh, playing World of Final Fantasy, although I don't have any thoughts on it as of yet. I think it's a little up to I'm surprised it's for children, to be perfectly honest. Um, so Civilization 6. I played Civilization 6 for five, six hours so far. Would have played much more, but my laptop, I use an or a really kind of beefy Origin laptop. We all have them. Um, ran Civilization 5 perfectly at high settings. I have it set on medium settings for Civilization 6 and the computer runs really, really hot. So like, I'm actually afraid to use to play it for more than about",
            "start": 474.6
        },
        {
            "text": "Civilization 5 perfectly at high settings. I have it set on medium settings for Civilization 6 and the computer runs really, really hot. So like, I'm actually afraid to use to play it for more than about 90 minutes at a time because the computer, I've never felt the computer this hot in my life. Um, are you leaving on your balls? Well, I like to leave it on my lap and then I was playing it kind of like holding like a book almost with my left hand, using the mouse my right hand, like lying down on the couch. It's just not ideal. Um, so I probably would have played two or three times more more than that, but it's just not really working out for me 'cause that was the way I played Civ 5, which was just incessantly. So uh, early impressions of Civilization 6 are very positive, I think. Um, the game is excellent. I mean, I didn't expect anything more from that than that. And and people have to remember Charles Annett, who we used to work with at IGN, is the one who introduced me to Civilization. Uh, he was a PC editor",
            "start": 514.2
        },
        {
            "text": "I didn't expect anything more from that than that. And and people have to remember Charles Annett, who we used to work with at IGN, is the one who introduced me to Civilization. Uh, he was a PC editor there and he works at Apple now. And he was like, you'd really, I know you don't like PC games and stuff, and you'd really like this game. And so um, I gave it a go in Civilization before Civilization 5 even came out, and I fell in love with it. So it was really my entrance. I I was familiar with the Civilization series. Civ 4 especially, I know was a lot of people's favorites. But um, that was a game I spent I I I don't think in the last five years I played a game more hour-wise than Civ 5. Um, I don't think it's even close. So I've played Civ 6 many, many, many times less uh, in terms of, you know, fewer hours than than Civ 5. But um, the game is familiar. Uh, I like uh, some of the additions that they've made. Uh, specifically um, creating Wonders and other kind of things for your cities or if you're your Capital Cities and",
            "start": 551.24
        },
        {
            "text": "5. But um, the game is familiar. Uh, I like uh, some of the additions that they've made. Uh, specifically um, creating Wonders and other kind of things for your cities or if you're your Capital Cities and then your ancillary cities that require um, blocks of land. So in other words, you'd have your city, it could be your Capital, it could be uh, it could have a massive population, lots of production, uh, giving you science and and and all sorts of things, culture. But it's on one block. It didn't really make any sense. And so they've they've kind of spread that around a little bit to make to give it more of like a like a sprawl, the city. Um, so I went and built like um, uh, these Hanging Gardens. The Hanging Gardens, if they're built for people that don't know, I mean, this is going to be so nerd. People that don't even know Civilization, but there are things called Wonders that you can build. Uh, you have to basically get to them first. So like one Civilization might be able to build a pyramid. This is like very good",
            "start": 588.04
        },
        {
            "text": "know Civilization, but there are things called Wonders that you can build. Uh, you have to basically get to them first. So like one Civilization might be able to build a pyramid. This is like very good for, you know, could be good for their culture or their religion or whatever. The Hanging Gardens, I don't remember what they did, but I remember I needed a block near a river in order to have them. And like then I had a like raise a farm that I had there in order to make room for it, which wouldn't have really been necessary in the previous game. So there it gets a little more micromanaging um, in that particular regard. Uh, combat feels familiar. I mean, obviously there there are some new uh, wrinkles to combat into the way units stack and stuff like that. But um, um, if you're into combat and most people that play Civilization are, you don't have to fight at all in Civilization, of course. Um, but if you do that, you'll find some differences there. Uh, I like the idea of the Builder in this particular game feels",
            "start": 629.08
        },
        {
            "text": "play Civilization are, you don't have to fight at all in Civilization, of course. Um, but if you do that, you'll find some differences there. Uh, I like the idea of the Builder in this particular game feels and acts differently. Um, you're basically using a Builder not only to get resources like one-time resources at a particular block, but also to create a farm. Once you do that with the, you know, with the Builder, obviously, then the Builder then disappears. Um, so you have to continue to create Builders and stuff like that. So the map I'm playing on right now, I'm playing on a randomized obviously map, uh, small map at normal difficulty, uh, just to get my the hang of the game. Uh, I'm playing as some African tribe. I don't remember. It was a randomized thing. You can pick obviously all sorts of Leaders with different benefits and deficits. And um, you know, so far so good. I think it's a really, really, really great game. I don't have in-depth knowledge. I'm in the mid game really, so I don't really have in-depth",
            "start": 664.76
        },
        {
            "text": "benefits and deficits. And um, you know, so far so good. I think it's a really, really, really great game. I don't have in-depth knowledge. I'm in the mid game really, so I don't really have in-depth knowledge at the end game. Obviously, you can win in a bunch of different ways: a scientific win, you can have a military victory, et cetera, and so on. The AI doesn't seem very smart or savvy, but I am playing on a lower difficulty level. Um, and it's kind of cool just to investigate um, from a Civilization fan, you know, more of a newer Civilization fan's perspective, the the different Civilizations that you can build and and the Leaders you can have. So um, and kind of their benefits and their deficits, whatever. So I uh, I dig it so far. I'm looking to get I'm looking forward to getting back into it. I wish that my laptop ran it a little more stably. It runs it stably, it's just I just don't know that a laptop should be as hot as this laptop is getting. They're made for it. It's just how things go. So um, 'cause you know, like we",
            "start": 701.28
        },
        {
            "text": "it a little more stably. It runs it stably, it's just I just don't know that a laptop should be as hot as this laptop is getting. They're made for it. It's just how things go. So um, 'cause you know, like we played Battlefield 1 on laptops uh, at high settings and it wasn't like that at all. So I feel like it's, you know, Civilization isn't necessarily graphically intensive, although it is in its own way, but it is very um, processing intensive. Yeah, when when the if you're playing on and I'm playing on a small map, if I'm playing on a global map with a bunch of different continents and a **** ton of different Civilizations, every turn that it has to process in the turn-based kind of ecosystem, I mean, I can't imagine how intensive on the processor that is. And I'm scared of what I'm seeing now on this smaller map for my laptop. So hopefully I can figure that problem out and play more of it. But um, you know, obviously I recommend it. I think everyone knows that Civilization 6 is going to be great and that the",
            "start": 738.44
        },
        {
            "text": "map for my laptop. So hopefully I can figure that problem out and play more of it. But um, you know, obviously I recommend it. I think everyone knows that Civilization 6 is going to be great and that the changes that they've made um, might seem minor to some. And I certainly can't trace the lineage from Civilization 1, 3 and 4 to 6. Um, but from Civilization 5 to Civilization 6, there certainly are big differences. Um, but at the same time, a very familiar game. And what I always said about Civilization 5 was for as much as I played it, and I'm going to feel the same way about Civ 6, you never really quite know what you're doing in some ways. Like that's the funny thing about the game where I'm like, and I've talked to people about this and they share that where I'm like, the game is so complicated and so complex that you don't you understand what you're doing and you know, building units, researching science, creating your Civics and your religion and kind of crafting your society. But at the same",
            "start": 776.68
        },
        {
            "text": "and so complex that you don't you understand what you're doing and you know, building units, researching science, creating your Civics and your religion and kind of crafting your society. But at the same time, you're quite not really, you know, at least, you know, I'm not really like sure like, is this really the right thing I'm supposed to be doing right now? I don't really know, you know? Um, should I go for animal husbandry or should I go for pottery? You know, you don't the choices you have to these are the hard choices. One cool thing that I don't think was in Civ 5 that is really cool too is that so you you for people that are familiar with Civ, they know you learn your science and and and all sorts of things and it takes time. It's all turn-based. So like you can say like, uh, I want to learn how uh, I want to learn ship building. So it's going to take me 14 turns to learn ship building, which is in in the game hundreds of years. And um, you basically are able to like take those 14 turns, but it will only",
            "start": 811.16
        },
        {
            "text": "to learn ship building. So it's going to take me 14 turns to learn ship building, which is in in the game hundreds of years. And um, you basically are able to like take those 14 turns, but it will only take seven turns if you have founded a city on the coast. So like the game will like you have like the big you have like this big schematic obviously as games do of like this science leads to three three sciences, which leads to these nine sciences and so on and so forth. You start like branching off and it'll tell you like it'll take 14 turns unless you do this or it'll take 10 turns or 30 turns unless you do this thing, unless you kill three Barbarian hordes, unless you, you know, um, create a trade route with a neighboring city or something like that. So I like that little thing too because then it makes you think a little more strategically about how you're investing in science because uh, for instance, I skipped ship building and then actually went out of my way to build a city on the coast so that I",
            "start": 850.28
        },
        {
            "text": "you think a little more strategically about how you're investing in science because uh, for instance, I skipped ship building and then actually went out of my way to build a city on the coast so that I would save those turns and went and and and research something more advanced. Um, but again, I play it at a very elementary level, I think, compared to the people that are like really, really, really in the Civ 6. And I just saw that a professional Esports company of some sort, the first Civ 6 professional player was signed to a contract, which I thought was weird. I'm like, who the **** is watching this? Civ 6 is like, like, who the hell is possibly watching that stuff? But anyway, that those are my early thoughts. I think it's really um, really cool. Questions you go for. First off, too, for transparency's sake, we did videos with Civ 6 as well, hosting and interviewing stuff. So with a grain of salt, uh, do you recommend it for noobs? People just jumping in? It seems no more or less complicated than Civilization 5 in",
            "start": 890.52
        },
        {
            "text": "did videos with Civ 6 as well, hosting and interviewing stuff. So with a grain of salt, uh, do you recommend it for noobs? People just jumping in? It seems no more or less complicated than Civilization 5 in its own way. So yes and no. I mean, I jumped into Civ 5 and I had no idea what the **** was going on, but I clearly I think you'll know pretty quickly if it's for you or not. Yeah, like everyone out there, I think that I I was so into the minutia of like, create your government and you can only have you can be like kind of religious or kind of like autocratic, but you can't be both, you know? Or like you can't, you know, like you you be warfaring or you can be mercantile or you can do all sorts of things. Like I when I started figuring and then it's like the science things like how you how you draw from like masonry to building a spaceship, you know, is really cool. And I like the idea of like depending on how you research because it's all based on like real themes and real eras. So like you can reach the",
            "start": 925.4
        },
        {
            "text": "masonry to building a spaceship you know is really cool and I like the idea of like depending on how you research because it's all based on like real themes and real eras so like you can reach the Renaissance in 800 literally 400 years 500 years before the Renaissance began if you're doing things right you know and I loved that so if you're into that sort of thing or you could be really late you know you could be you could be in like 1900 fighting on Horseback you know like depending on how things go so I like I like that particular thing so if that kind of thing strikes you then it's a fine place I think to jump in but if not then I don't think you should play Civilization at all I don't think that necessarily this is any different on a core way than Civilization V was at least to me I'm sure the Civilization nerds out there see many more differences than I do but I don't see that many differences yeah it it's one of those franchises that it seems really daunting and it is like because",
            "start": 965.08
        },
        {
            "text": "the Civilization nerds out there see many more differences than I do but I don't see that many differences yeah it it's one of those franchises that it seems really daunting and it is like because like you were saying like it's super complicated but it's definitely not my type of franchise but I played Civ 4 and I got addicted for a while and I I had to cut myself off I'm just like I can't like this is going to be a bad thing if I have to put this much time into this just cuz like I was like it was a point in my life where I'm like I need to be focusing on you know school and work and **** then but for you being so addicted to Civ 5 and putting as many hours as you did like all these games kind of hit us at different times in our lives do you think that you'll put as many hours into Civ 6 or do you think that this is just going to be more of kind of like a nice little step back into the world for a little bit just to get a taste and then bounce out remains to be seen I mean I think",
            "start": 1005.08
        },
        {
            "text": "or do you think that this is just going to be more of kind of like a nice little step back into the world for a little bit just to get a taste and then bounce out remains to be seen I mean I think it's like a perfect football game like uh like Sundays I'll sit on the couch for like as I will this Sunday for the entire day from 10:00 a.m. to 10 p.m. and watch football um and when I I when Civ 5 came out that's all I did was sit on the couch and play it like I I put the mouse on the on the arm of the couch and just sit there and watch TV or whatever and it was one of those games where I hadn't had an experience like this in quite some time where I really did lose track of time I'm constantly looking at the clock when I'm playing games because I don't want to spend like my entire **** day playing a video game but it was one of those things where I just forgot and then I looked up and it was two in the morning or something I'm like oh **** like here we are you know um so it is one of",
            "start": 1038.8
        },
        {
            "text": "playing a video game but it was one of those things where I just forgot and then I looked up and it was two in the morning or something I'm like oh **** like here we are you know um so it is one of those games I agree it's it's acutely addictive to people that that um well I I guess any game can be addictive I mean I was addicted to Tetris at one point in my life like it's you but it is acutely addictive to people that think the way I think and like the things I like in terms of um and maybe you felt the same way in terms of like just uh it's a game all about gaming the system as best you can it's like all that's really what it is it's like how much how much production can you possibly eek out of these people how much gold can you possibly get a turn to start buying tiles or buying units or just saving it or using it to buy people off or can you get into a fight with this this this other country and then make them pay you reparations for 50 turns you know like and then you just have",
            "start": 1071.96
        },
        {
            "text": "or just saving it or using it to buy people off or can you get into a fight with this this this other country and then make them pay you reparations for 50 turns you know like and then you just have all this money coming in or like are you going to get pincered and attacked do you attack the wrong country and especially if you're running on higher difficulty levels and then you get **** um you're not paying attention to the other side of the map you might not even really know what's going on the side of the map you notice that these guys have an Air Force and it's 1 700 mhm you how the **** is that possible and they can just level you know so and the chase for the bomb or the chase for the space in the space race and getting into space which is a way to win uh the game so I think that it's it's it definitely has the makings of that the thing about Civ 5 I think it came out at a certain time where there you know has all the same trappings as Civ 6 but it also came out at a time as",
            "start": 1110.96
        },
        {
            "text": "it's it's it definitely has the makings of that the thing about Civ 5 I think it came out at a certain time where there you know has all the same trappings as Civ 6 but it also came out at a time as far as I recall where there wasn't much else I wanted to play the the unfortunate thing for Civ 6 is that there's plenty of other games I want to play right now so I think it's going to be one of those games similar to Civ 5 where I you know I don't even remember like I use Steam so seldom that I think I've downloaded Civilization and I think I bought it like three different times cuz I'm like I don't even remember my I don't even know what the **** email addresses is attached to I have no idea I'll just go make a new Steam account and buy the game again so like the CL you know the old game probably had 40 hours and then the next one had 0 hours and then the new one you know I bought it and I bought the I got the the uh the expansion and all sorts of things like that just speaks to me",
            "start": 1147.04
        },
        {
            "text": "probably had 40 hours and then the next one had 0 hours and then the new one you know I bought it and I bought the I got the the uh the expansion and all sorts of things like that just speaks to me in a very specific way um and so now I'm a little smarter now now I have my name my name you know all you know so I have but the only games I was looking at my list the only games I have are Civilization games I have like Beyond Earth or whatever I have Civ 5 I all the DLC of Civ 6 that's good enough so I recommend it I think people that know and like already know about Civ 6 I don't think you need anyone to tell you to buy it um as far as I'm concerned I think I have more to explore and more to jump into I think that there are there's much for me to learn I like reading about the game a lot too and and learning how to play it better because for as much time as I put into I've not put in as much time into a game and been so ignorant about it at the same time you know like where it's like there",
            "start": 1176.12
        },
        {
            "text": "and learning how to play it better because for as much time as I put into I've not put in as much time into a game and been so ignorant about it at the same time you know like where it's like there really are systems like if you jump you can jump into these grids and these spreadsheets and all this **** where I'm like I have no idea what the **** any of this is and they do hide them from you because I don't think any one knows what they really are you know but like you can like go in and like really look at your economy and be like I you know like um but managing farms and and and luxury items your guys you people get really **** upset if you take if you take a capital city or another city from another country they **** hate you you know and you have to do things to like make them happy like give them luxury items give them entertainment the Wonders are a big part of that too right making them happy in this game I remember them very cool you know so I I think uh I think folks",
            "start": 1211.44
        },
        {
            "text": "happy like give them luxury items give them entertainment the Wonders are a big part of that too right making them happy in this game I remember them very cool you know so I I think uh I think folks out there will like it and um is it a good fora in a c I don't see why it's bad for innive I don't think there is such a thing as a good for in like it's complicated are you going for military victories are you going I almost always go for military victories but the but the because for the way I work it's the way that I understand the most like I just don't have the pedigree with this particular game or I maybe even the ability to think deep enough in this particular way to to craft I I mean you can get a scientific Victory pretty easily or something like that but you know you can win in like weird ways like I think there's a way to win religiously like so I don't that doesn't that's fun but that's like so nuanced like I I I can understand like bludgeoning people with bombs you know pretty",
            "start": 1245.44
        },
        {
            "text": "ways like I think there's a way to win religiously like so I don't that doesn't that's fun but that's like so nuanced like I I I can understand like bludgeoning people with bombs you know pretty easily course you can um so America but I also try to play sometimes I play games totally passively totally like in a mercantilist kind of like trade way and just be like I don't want any problems with anyone you know but if but if someone like **** with me then you just you **** crush them that was one of the cool things from when I was doing the interviews and getting to see the game so long ago was like I you know I I wanted them always to pick Teddy Roosevelt and go through and be him and the you know you talking about earlier the pros and cons of it but as you expand out that map I really like the Fog of War where the map fills in and goes from just being like looking like a normal map to being colorful and you seeing what's happening but when you run into Cleopatra like deciding how",
            "start": 1283.48
        },
        {
            "text": "like the Fog of War where the map fills in and goes from just being like looking like a normal map to being colorful and you seeing what's happening but when you run into Cleopatra like deciding how you talk to her let alone then also what your stats are already because she'll look at you differently if you're a military super strong or weak or something like that the interplay between people and like Gandhi and stuff that's really interesting my dude yeah like and and and the the cool thing about the game too I mean this is diplom this is diplomacy it's like the uh it's like uh Molotov-Ribbentrop or what is it um Molotov-Ribbentrop or whatever that guy's name is the the the German-Russian uh agreement like non-aggression agreement that the Germans just broke and just invaded Russia anyway like you can have things like that in this particular game Ribbentrop-Molotov Ribbentrop that's what it is you're just saying words mutton chop mutton chop was the short name for it basically the Russians",
            "start": 1319.48
        },
        {
            "text": "you can have things like that in this particular game Ribbentrop-Molotov Ribbentrop that's what it is you're just saying words mutton chop mutton chop was the short name for it basically the Russians and the so or the Soviets and the Germans the Nazis got together in the 30s and we're like we're not going to **** with each other and even there was even some invitation to have everyone be in the same Axis Powers which obviously Russia wasn't ended up being into and then they just the Nazis are just like we're just going to invade anyway well you can do **** like that in the game if you want like you can open borders and agree to have open borders with someone and just stage troops inside and then just start attacking them that's not going to work out well for you if they have other allies and stuff but you can play the game in a very bold way like that if you want so I think that that's a I like it the game lets you do what you want and I think it's really cool and I think what I",
            "start": 1352.8
        },
        {
            "text": "and stuff but you can play the game in a very bold way like that if you want so I think that that's a I like it the game lets you do what you want and I think it's really cool and I think what I was disappointed when I when I played CivRev Plus on Vita was I was like it's just not deep enough like that I played it I played it very like a very cursory kind of way but I'm like it's just not deep enough it's not Civ yeah like it's Civ is minutia yeah it's all the little things like it's cool to see look at the top of the screen and see plus signs with numbers after everything because you're doing really well you're getting Faith you're getting culture you're getting money you're getting all sorts of things Prestige but I don't know but there's also much to learn for as much as I play Civ I also read I go jump into the forums and I I don't have an account there but I read you know like lurking just because like there are people that really know how to play this game oh yeah you know",
            "start": 1385.92
        },
        {
            "text": "I also read I go jump into the forums and I I don't have an account there but I read you know like lurking just because like there are people that really know how to play this game oh yeah you know and and uh I don't after all these scores of hours basically with it so um but nonetheless it was really cool you know it snuck up on me too K didn't make the games available make the game available to a lot of people and so um it really I kind of it was just floating I'll get and then the code just popped in my inbox I was like **** a man like here it is it's time it's fantastic you know so there you go",
            "start": 1419.52
        }
    ]
}