{
    "id": 2124,
    "video_id": "HONQAWV5nxQ",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Nintendo Switch Reveal - Kinda Funny Reacts",
    "description": "THE \"NX\" IS FINALLY HERE! X gave it to us!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1476987497,
    "duration": 1623,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Kinda Funny Reaction for the Nintendo Switch. X is giving it to you. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Moriarty. It's good to be here with you today. It's good to be here with you today. And over there, the pure one, Tim Gettys. Yes. Now, Tim, Tim, you said from the get-go, you're going to be the NX's biggest fanboy. Oh, I know I am. I don't know if you've checked the internet, everyone is a Switch fanboy this morning. Good, good for them. Okay, I'm ****. I don't give a sh. I'm not one of these like bandwagon **** that hates on that ****. Let's do it. Let's support this ****, everybody. Come on, let's **** do this Switch. I'll give it to you, dumb name. Doesn't matter. Doesn't **** matter. It's not the Wii. There's Wii out of this ****. There's no families. I'm not seeing any families in this trailer. It's all Millennials who want to go to, oh yeah, really hot people. I love hot people, Greg. I don't give a **** about families. This is",
            "start": 0.12
        },
        {
            "text": "there's no families. I'm not seeing any families in this trailer. It's all Millennials who want to go to, oh yeah, really hot people. I love hot people, Greg. I don't give a **** about families. This is awesome. This trailer is exactly what I needed to see. Now, is all the bad news going to come crashing down? Are we going to hear about the battery? Are we going to hear about how the online ecosystem sucks? We're going to hear about how we're going to have to buy Super Mario 3 again. Sure we are. But today, today we have this and I'm very, very happy about it. Does that look like a toy? Does that look like a toy? Well, I mean, the controllers, yeah, the Joy-Con controllers do look like a toy, but I don't, but I don't, I don't take issue with that. The form factor is a little small, but yeah, the uh, so I think it's great. Uh, I, I saw the uh, the trailer today and, and I was actually really impressed with it. It's exactly what I envisioned. You know, we talk about something like, like what",
            "start": 38.64
        },
        {
            "text": "yeah, the uh, so I think it's great. Uh, I, I saw the uh, the trailer today and, and I was actually really impressed with it. It's exactly what I envisioned. You know, we talk about something like, like what it was going to be, removable controller, attachable controllers, all this. Um, I think that, I think the marketing was very smart. Uh, the commercial is very smart for it. I agree with you. Uh, I think that, that the bad news is going to be how powerful, not powerful it is, and it's probably not going to be very powerful, which is might hinder third party support in the future and might hinder the, the scope of games you're seeing. For instance, it was really cool to see Skyrim on there. Skyrim came out five years ago, so it doesn't look fantastic. No, right. So, so at first I was like, is that Infinity Blade? Then I realized perspective, da da da. But yeah, um, but you know, obviously Zelda looks fantastic. We played Zelda on Wii U, all this. I do take issue with the name. I think the name is stupid. Um, and uh, obviously it wasn't",
            "start": 77.0
        },
        {
            "text": "perspective, da da da. But yeah, um, but you know, obviously Zelda looks fantastic. We played Zelda on Wii U, all this. I do take issue with the name. I think the name is stupid. Um, and uh, obviously it wasn't going to be called NX. Obviously that was its Dolphin or Revolution. It wasn't clearly going to be called that. I am upset. It's, it's like, come on, guys, after all this. Yeah, it's a, it's a little strange. Like, and people are like, well, you know, some people are like, they love the name. I respect that. And some people are like, it's better than Wii U. And I'm like, you could have called it the **** artist choke and it would have been better than the Wii U in terms of naming. So like, so it's just, you can't compare it. Like everyone's like, it's better than the Wii name. I'm like, no, it's not. The Wii U was, the Wii was a great name for a system when it really came down to it, 'cause it made sense and it was something you typed into Google and it was unique. The Wii was, type Switch into Google. Have someone tweeted at me",
            "start": 116.44
        },
        {
            "text": "a great name for a system when it really came down to it, 'cause it made sense and it was something you typed into Google and it was unique. The Wii was, type Switch into Google. Have someone tweeted at me today, who knows where you're going to come up. Here's my question for everybody before we jump off it on naming thing, right? When was the last console that was named that didn't sound weird at first blush? Xbox Scorpio? PlayStation 4? Yeah, well, that doesn't count. But I remember not liking Vita and then Vita just is a terrible name to one, horrible name. But they all just become nomenclature. Not to mention that this one, Switch, is, I mean, what they're doing here is smart. The commercial shows that when you're talking to a mom, it's easy to be like, oh, because it switches between TV and portable. Okay, it's a DS and a Nintendo. I get that. Yeah. And you know, it's, it's a switch from the Wii U and all that **** for all the ****. Whatever. It doesn't matter. Like, you're right, you could have called it anything.",
            "start": 145.08
        },
        {
            "text": "DS and a Nintendo. I get that. Yeah. And you know, it's, it's a switch from the Wii U and all that **** for all the ****. Whatever. It doesn't matter. Like, you're right, you could have called it anything. Like, but I really believe that it's like, I think that this is enough away from what they have that I'm like, all right, cool, good. It could have been worse. But then, yeah, I mean, I think that that's the only negative thing that I really see is, is just the name specifically because, yeah, it's a, it's a move away from Wii U, which was a confusing name. I think doubled down confusing because of the tablet, which seemed like it connected to the Wii and all that kind of stuff. But names do matter. I do think that the name of the Vita name did in some way, not in a major way, but in some way, hurt it. And uh, so I think a name is important. I think a GameCube was a really powerful name. Nintendo 64, powerful name. Um, you know, in Japan, Famicom or Super Nintendo, these are good names for consoles. And so, um, and I do",
            "start": 183.48
        },
        {
            "text": "I think a name is important. I think a GameCube was a really powerful name. Nintendo 64, powerful name. Um, you know, in Japan, Famicom or Super Nintendo, these are good names for consoles. And so, um, and I do again think that the Wii was a weird name, but then the Wii became nomenclature, became just part of our vocabulary. Switch, um, just struck me as weird. That's really the only negative thing I saw in this entire, uh, out of this entire thing. I'm, I'm a little concerned about the Joy-Con controllers. Yeah, well, just in the sense that it just seems like there's a lot of things that you can lose and I'm interested to see like, like or break. Like, what if one side? So like, there's all these kinds of things you have to worry about. But we've never had to worry about that before because there's never been something like this. So I'm sure that there are going to be clever solutions to all these different problems. Um, I think it, like, I really think it's a cool, a cool thing and I think a nice synthesis of what",
            "start": 219.84
        },
        {
            "text": "like this. So I'm sure that there are going to be clever solutions to all these different problems. Um, I think it, like, I really think it's a cool, a cool thing and I think a nice synthesis of what Nintendo does well. And um, it's doubling down on this more mobile market or this more, which I don't know is if it's a great idea. This doesn't scream to me to be something that's going to be a massive seller like Wii or anything like that. But it's certainly going to do better than Wii U. And and that's probably all that they can, they can ask for. So, will it do better than 3DS? Probably not. It'll probably be more expensive than 3DS, less accessible than 3DS. Um, doesn't seem like they're even going after the 3DS market based on the marketing. So, um, I think they are with all the Mario Kart playing in the, there's no, I mean, but, but 35-year-old people are not the people that are buying 3DSs in, in droves. It's 10-year-olds that are buying 3DSs. So it's, it's, or their parents. 3DS. Well, no, I",
            "start": 257.6
        },
        {
            "text": "playing in the, there's no, I mean, but, but 35-year-old people are not the people that are buying 3DSs in, in droves. It's 10-year-olds that are buying 3DSs. So it's, it's, or their parents. 3DS. Well, no, I mean, everyone had a DS and everyone had, you know, there were, you know, other, you know, even a PSP or something like that. 3DSs sales are not up, up, you know, in that stratosphere yet. Um, so I just think that like, based on the marketing, it just seems like they're going after someone else. And it seems like they're going after the multi-pillar approach again, like they tried to do with GameCube and GBA and DS. So this is another return to what we're talking about though, of like, this is talking to us. This is talking to the 30-somethings who are into video games. This is like, try, you know, not the speech, it's not the presentation, but it's similar to PlayStation's approach, right? Of, hey, here we are, here's this thing. We learn from our mistakes. It's about games. It's about games you'd want to play. There is no",
            "start": 294.2
        },
        {
            "text": "not the presentation, but it's similar to PlayStation's approach, right? Of, hey, here we are, here's this thing. We learn from our mistakes. It's about games. It's about games you'd want to play. There is no touch. There's no one wag. Oh, I know. But I'm saying in the marketing, we're giving you no touching, no waggling. It's just straight up real games you'd want to play with your friends. Switch the controllers, do whatever that cool rooftop party Switch. Yeah, yeah. I can't like the guy who like took it like, oh, my dog needs to go out to the park. He's playing in direct sunlight. I'm like, okay, let's see how this one's going to hold. Whatever you need to, you need to do something. Trust me, I've tried to play the Vita in direct sunlight. I know. So last night, I uh, watched the Wii U trailer that was very similar to this in terms of like, there's a poppy song playing, there's a bunch of cuts of people smiling, playing games and ****. And it's like, that was, it's such a far cry and a",
            "start": 330.64
        },
        {
            "text": "trailer that was very similar to this in terms of like, there's a poppy song playing, there's a bunch of cuts of people smiling, playing games and ****. And it's like, that was, it's such a far cry. And a lot of the features we saw on that didn't end up actually making it even to the console. Like, they're doing Wii Golf thing where you put the, um, the, I don't think that ever actually happened. And like, there's a lot of things like that. So this, we'll see what goes on. But my big takeaway from that is all a lot of the stuff that did make it through, I didn't care about. I never used. So that doesn't matter. The guys playing with the Joy-Con controller on the side, we're never going to do that. So it like, when we fly and we play Mario Kart, we're bringing in our Nintendo Switch Pro Controller. That's fine. That's a normal. I want to know if they let me use my, no, I know. But I'm, I think it's funny that they call it out. My big question, one, I mean, there's a million big questions. Battery. I want to know price. But I",
            "start": 364.08
        },
        {
            "text": "a normal. I want to know if they let me use my, no, I know. But I'm, I think it's funny that they call it out. My big question, one, I mean, there's a million big questions. Battery. I want to know price. But I want to know, did the old controllers work? Will my old Pro Controller sync with it? You'd imagine knowing Nintendo, they would. You think? 'Cause like the Wii, the Wii Motes, you know, from Wii to Wii U worked. And I know that still got Wii in it or whatever. But I would think my old Pro Controller would work with this one. I don't know. I mean, I almost in a way hope not just to get away from the, the Wii Mote and Wii stuff like that. I know that sucks 'cause we have so much of that ****. But I feel like the, those things kind of suck. What I do want is USB on the, on the device port. It doesn't need to be on the actual device. It's on the port. Uh, maybe it's in, well, maybe on one of these next ones. See if you see when you get to, hold on, I want to call it the right thing here. When you get to the Nintendo Switch Dock,",
            "start": 400.96
        },
        {
            "text": "device. It's on the port. Uh, maybe it's in, well, maybe on one of these next ones. See if you see when you get to, hold on, I want to call it the right thing here. When you get to the Nintendo Switch Dock, if you can pause it, I do believe I saw uh, ports on that **** 'cause uh, for the Smash Bros. 'cause that's really what's exciting to me. So now that we have this, there's a lot we can go off when it comes to the rumors that we've seen over the last year. Um, yeah, right. Are, wouldn't those be, those look like USB to me. Kind of look like HDMI. Do they look like you have two HDMI outs and in? Well, one in and one out. Why would that make sense? Yeah, would. I don't know. It could be. You'd assume it has USB, right? But we've heard about ports or enhanced ports of Smash Bros., Splatoon, and Mario Kart 8 just to start. And in this trailer, you see two of those. So you see Splatoon and you see Mario Kart 8. But both of those have features that aren't in the current versions of the game. Looks better. It has different um, hairstyles and",
            "start": 437.08
        },
        {
            "text": "you see two of those. So you see Splatoon and you see Mario Kart 8. But both of those have features that aren't in the current versions of the game. Looks better. It has different um, hairstyles and stuff like that. And Mario Kart 8 has King Boo, who was not in in that game and has dual items. So you can switch between the items kind of like Mario Kart: Double Dash!! Exactly, exactly. So I'm like, I like that we're going to be getting these games. It's going to give the Wii U amazing Wii U games another life that they totally need. People didn't get to play. Yeah. And um, enhancing them is really exciting, especially when it comes to things like Smash Bros. 'Cause great, we're going to get more Smash Bros. The Smash Bros. That's awesome. But hopefully more characters, hopefully more things going on. Ice Climbers. Ice Climbers. You know, the 3DS couldn't do it. Yeah. 3DS couldn't do much. It's your time, Switch your perspective. Yeah. So I agree with Greg in the sense that I feel like that the, the qu, there's major questions",
            "start": 483.52
        },
        {
            "text": "you know, the 3DS couldn't do it. Yeah. 3DS couldn't do much. It's your time, Switch your perspective. Yeah. So I agree with Greg in the sense that I feel like that the, the qu, there's major questions they have to answer and they're going to have to answer them somewhat soon. And I'm sure that the investor meeting is going to be interesting because, um, you know, I want to know how powerful it is. Now that the, like, I, you could tell me the statistics and that's not going to be meaningful to someone like me that does understand stuff. I just need to know where it sits on the, on the paradigm. Uh, like we knew that Wii U, for instance, was not as powerful as PS3 and Xbox 360, right? But it was more powerful than the Wii. And so we can kind of put it on that timeline. My suspicion is that it's a similar thing where it's clearly not as powerful as PS4, Xbox One. It can't be, or that thing would cost way more money than it's probably going to cost. But I'm sure it is more powerful than the PS3 and the Xbox 360. And so it",
            "start": 522.56
        },
        {
            "text": "clearly not as powerful as PS4, Xbox One. It can't be, or that thing would cost way more money than it's probably going to cost. But I'm sure it is more powerful than the PS3 and the Xbox 360. And so it sits somewhere in that space. Um, my prediction is it's probably going to be $300. And uh, I think that's a totally affordable and reasonable price. And I'm all about it. Like, I, I, I want it. And even if, you know, a, we didn't even touch on the fact that that **** new Mario game is, is being shown off for the first time, which looks **** cool. Uh, good timing. Let's talk about the Mario game for a second. So there's a lot to be seen here. It essentially, we've, there's two separate gameplay clips of it. And it's not enough to really make too many conclusions. But there's the, the question of, is it more Galaxy like? Is it more 3D World like? Or is it more Mario 64 like? Getting hint to Mario 64 more than anything. The camera kind of feels like 3D World or 3D Land. But since it's behind him and since it's such an",
            "start": 559.16
        },
        {
            "text": "is it more 3D World like? Or is it more Mario 64 like? Getting hint to Mario 64 more than anything. The camera kind of feels like 3D World or 3D Land. But since it's behind him and since it's such an open, vast space, I think that the second uh, thing that we're getting might be like a hub world. And the, the key things are, they specifically show him doing a long jump and a triple jump, which is like, that is Mario 64, Mario Sunshine type deals we're going on here, which is very exciting to me because we haven't seen that for so long. And like, that is like specifically talking to the N64 crowd. That is specifically talking to the people like, shut up, it is what you want, deal with it. And I think that a lot of this trailer does that. There's also a heart in the background of the, um, the Mario footage, which is like the, so there's a health system. So it's not like 3D World where you're big and small. And uh, it's the two-hit system. It looks like we're going to have another life thing. So is this Mario 128?",
            "start": 594.8
        },
        {
            "text": "is like the, so there's a health system. So it's not like 3D World where you're big and small. And uh, it's the two-hit system. It looks like we're going to have another life thing. So is this Mario 128? Finally, I **** hope so. Yeah. I think, I mean, I think it'll be a launch game. And I, I, I, I suspect that, um, well, I mean, I mean, I have a lot. I mean, I was just thinking about on the way here, even in my Uber, like, they kept the secret pretty well. Like, it's, it's pretty, it's pretty imp, like, just from a, just from a industry kind of perspective, like, the name didn't leak, the console didn't leak. Like, the, the idea about it leaked and there were some schematics and trademarks and all this kind of stuff. But really, like, I, when I was watching the commercial, it really reminded me that obviously they're going to do a big production for their marketing. They're going to get a lot of people involved. But it's, I always find it so interesting with the hundreds of people that probably were involved in this, um, outside",
            "start": 636.56
        },
        {
            "text": "a big production for their marketing. They're going to get a lot of people involved. But it's, I always find it so interesting with the hundreds of people that probably were involved in this, um, outside of Nintendo, they're a production company. They hired all these people. No one said anything. Um, and you know, not, not that I'm sure Nintendo would encourage them to say anything. Uh, so I really like that it's nice to have a genuine surprise. Um, so really when I look at the positives and negatives, the pros and cons, the only negatives I really see right now, and I'm sure there are going to be others, as you said, is the name. And uh, that's, and just because I think names do matter. Like, you can't, people are saying like, well, the name doesn't matter, the name. I'm like, you can't have it both ways. The Wii U name certainly destroyed that console. So, or helped destroy it. I mean, other things helped destroy it as well. And so you have to be careful about that. But maybe it doesn't matter. I actually, everyone's like, why would",
            "start": 676.68
        },
        {
            "text": "destroyed that console. So, or helped destroy it. I mean, other things helped destroy it as well. And so you have to be careful about that. But maybe it doesn't matter. I actually, everyone's like, why would you name that? I'm like, I would have just named it the Nintendo personally. But like, like, and gone back to, you know, and have a real name for it. Like, uh, uh, an NES style thing. But get people back in a using your name and that very bold. And like, you know, like when your parents just be like, are you playing Nintendo? My, my parents still say that ****, you know, like, playing the Nintendo. And like, to like, bring that ubiquity back to that name, I think would have been really cool. Um, it was the same reason why we wanted the, like the Xbox and the PlayStation to just be called those things. And those are good names. Everyone's like, well, you know, is Xbox and PlayStation good name? I'm like, yeah, those are great **** names, actually. You know, so, so, you know, that's my only, and like the pros and cons list, the only",
            "start": 710.52
        },
        {
            "text": "everyone's like, well, you know, is Xbox and PlayStation good name? I'm like, yeah, those are great **** names, actually. You know, so, so, you know, that's my only, and like the pros and cons list, the only negative, and I see a lot of things to really be excited about. I'm excited to pre-order it. I'm excited to have it first day one. And when I'm to your point with the online network and all that stuff, I, I really think that this is going to be a virtual console machine for me almost primarily because they have a big list of, of people that are supporting them, both publishers and developers. But they had a similar thing for Wii U and other things too. And it ultimately doesn't see that goes. The big thing is I glossed over before is Bethesda running Skyrim on this, which was, which is a, a super kind of interesting thing. Um, and shows you the direction I think that Nintendo wants third party support. I mean, this, you see it, it's like, we got NBA 2K17 playing, we got Skyrim, and then we got the, the Mario, the Zelda, Mario",
            "start": 743.6
        },
        {
            "text": "um, and shows you the direction I think that Nintendo wants third party support. I mean, this, you see it, it's like, we got NBA 2K17 playing, we got Skyrim, and then we got the, the Mario, the Zelda, Mario Kart, Splatoon. It's just like, this shows off a lot, a launch line different. I'm a, it is my thing about Mario is, I don't know, it looks a little rough right now to be ready for March. But I don't know, real quick, I mean, to run through some the, the call outs on their list here, right? Activision, Atlus, Bethesda, Capcom, EA, Square Enix, Take-Two, Telltale, Ubisoft, Warner Bros., FromSoftware. Yeah, well, yeah, yeah, sorry, there's a million on there. Level-5 too. But like, the thing about the ones I'm calling out are the ones that this is, and I granted, I'm an optimist like you, Tim. This looks amazing. I can't wait to, I, the first thing as soon as this was done, I went to Amazon to see if I could pre-order it. Came up with an RF switch for the N64. Um, the thing about it though, is this is the first time I was telling a",
            "start": 777.28
        },
        {
            "text": "I, the first thing as soon as this was done, I went to Amazon to see if I could pre-order it. Came up with an RF switch for the N64. Um, the thing about it though, is this is the first time I was telling a friend, this is the first time I think in a decade where I've entertained, entertained the idea of playing a multiplatform game not on PlayStation. 'Cause if like, right, right now, Batman: Arkham Asylum, I'm playing, right? And I'm getting of playing in six hours or whatever. This would be **** awesome to have it and be ready to go. I'm going to play Dragon Quest 'cause I love Dragon Quest and that game is great. But to have all my real progress carry back and forth, it's like, you know, I'm never going to like trophies still are awesome and I love them or whatever. But it's not like I'm getting anything out of that. So, got trophy system on this. And and that's, that's the thing that I'm, I'm super interested in other than some of the like, I see names on here that Greg didn't highlight that I think are like even more",
            "start": 818.96
        },
        {
            "text": "so, got trophy system on this. And and that's, that's the thing that I'm, I'm super interested in other than some of the like, I see names on here that Greg didn't highlight that I think are like even more interesting. Like, um, you have like, uh, Level-5 on here, for instance, which isn't a huge surprise. Like, is it going to be something like, uh, you would expect? Or is it going to be something like a Ni no Kuni or a big game or Tales game? Or not a Tales game? Um, something like White Knight Chronicles or something that's going to be proprietary, maybe the Nintendo consoles. Like, I get, I get excited about some of the names that I didn't expect. Uh, Spike Chunsoft, dang. RPA studio. Uh, like, uh, you know, even THQ Nordic's on here. What are they going to bring over? Darksiders or something new? Like, they promised a lot of new games. So when I see a lot of the things on here, like, yeah, of course, Square Enix is going to be here. It's awesome that Bethesda is coming over. Capcom, obviously. Um, Activision, Atlus. But, you know, Atlus is",
            "start": 855.28
        },
        {
            "text": "new games. So when I see a lot of the things on here, like, yeah, of course, Square Enix is going to be here. It's awesome that Bethesda is coming over. Capcom, obviously. Um, Activision, Atlus. But, you know, Atlus is already supporting Nintendo heavily. Um, but when I see some of these other smaller names, N for instance, that have slowly moved away from PlayStation and started to democratize their games a little bit, um, with, you know, uh, PC especially, I get excited about a lot of that as well. So I, if you can get Persona 5, some definitive edition, whatever, on the NX and have it with you all the time, you **** kidding me? I mean, that's the thing is like, Colin, you, we always talk about, and especially with the whole, uh, Xbox One S and the PlayStation 4 Pro conversations we've had for so long, you talk about how it's like, the power doesn't matter and all this stuff. And I think that this is, is finally getting to a point where it's like, obviously this is not PS4, Xbox One level stuff. And I, I don't think we're going to",
            "start": 889.84
        },
        {
            "text": "the power doesn't matter and all this stuff and I think that this is is finally getting to a point where it's like obviously this is not PS4 Xbox One level stuff and I I don't think we're going to necessarily be getting um all of the multiplatform games I say optimism yeah yeah no no for sure but I I do think that like seeing something like Skyrim like you would assume this is Skyrim HD which is I mean it's a last-gen game but it's for next-gen consoles now right yeah NBA 2K17 you imagine that it's the the current version it's like yeah those are smaller games in terms of they're not like pushing pushing **** and I think that's what we're going of be getting and games look better than the Wii U versions of the games we getting and Wii U the games them the look of the Wii U games was never their issue like in terms of first party you know like the Mario 3D World and all those things like they are just they're beautiful games so to have them with a little bit more power and stuff like",
            "start": 925.72
        },
        {
            "text": "their issue like in terms of first party you know like the Mario 3D World and all those things like they are just they're beautiful games so to have them with a little bit more power and stuff like I feel like that's really all that it needs like Zelda looks fantastic I mean that's the big thing I was like yeah Zelda will be the game I play but then like Skyrim right Skyrim doesn't move the needle of excitement for me at all on PlayStation 4 Xbox One cuz I played it on PS3 whatever I don't I'm not going to come home and sit down and play Skyrim again but to have Skyrim on a portable on a plane to be able to sit there and yeah sure because when I beat Zelda and I'm done enough in their open world whatever it's going to be I'd love to jump back in have a character that I just **** around with mhm I I mean for me the thing that is most exciting besides the new Mario game is that Joy-Con controller no I mean honestly it's that is not that it's the fact that yeah that exists and yeah",
            "start": 965.28
        },
        {
            "text": "with mhm I I mean for me the thing that is most exciting besides the new Mario game is that Joy-Con controller no I mean honestly it's that is not that it's the fact that yeah that exists and yeah that's fine that's an option but I'm never going to play with the weird ass GBA SP like um put the Joy-Con things together I think here's my my concern with it is is this is that I think you're going to get better battery life if you use it like this like like a Wii U GamePad cuz in my head what I want to do obviously is always have it with me and then always have the Pro Controller with me but tethering them I have to imagine unless there is a USB out or whatever that I'm connecting to that way but even then it's going to drain so much power yeah we'll figure out the battery stuff later but when you look at it as a tablet like it looks like the right version of the Wii U GamePad oh yeah the one that like an adult version not the Fisher-Price one this is not Fisher-Price this does look like a",
            "start": 997.48
        },
        {
            "text": "you look at it as a tablet like it looks like the right version of the Wii U GamePad oh yeah the one that like an adult version not the Fisher-Price one this is not Fisher-Price this does look like a real device the um like when you have them all flimsy that's pretty bad but when you put them together it looks like it's going to be really solid like I wish that the screen kind of took up a bit more of the thing itself but it's like I think that that was a design choice to make sure that the controllers didn't feel like plastic they felt like it connects and uh Colin like the big issue you were worried about was the offset analog sticks and like they they nailed it I'm a little concerned about the D-pad not being there's no there's no traditional D-pad which some a little baby one up there yeah but that it's it's not it's not even on the right side right like that that's that's the thing I'm like can you I doubt that's a real thing yeah like that button this little tiny dude yeah I",
            "start": 1032.68
        },
        {
            "text": "yeah but that it's it's not it's not even on the right side right like that that's that's the thing I'm like can you I doubt that's a real thing yeah like that button this little tiny dude yeah I thought maybe it was just something like plus and minus yeah it's plus and minus yeah yeah so oh okay well I just thought those were starting select buttons or something what's interesting is like so yeah there's I mean the Wii U GamePad has the the plus and minus button so it's like there could be those but there's also four more buttons on the the thing so it's like I I don't know there's a million starts in select I mean there's only so much real estate for them to work with the the yeah I I always thought on Wii like the fact that the on Wii U the analog or the analog stick was above the buttons was was **** weird like it was like I I anyone who defended that I was like what are you talking about that's not the way we play games I remember as I said before playing Mass Effect 3 on it for",
            "start": 1072.16
        },
        {
            "text": "buttons was was **** weird like it was like I I anyone who defended that I was like what are you talking about that's not the way we play games I remember as I said before playing Mass Effect 3 on it for review at IGN and being like this sucks like why like why can't I you like who does that and they they clearly know that that sucks so like they won the day on that one because that's not how we play games we move up and that's huge the analog that's huge because this looks this looks great and this what's so awesome me about this is anytime we've talked about what do we want from the Vita it's this for me every single thing I'm like I just want a big screen I want to be able to play it or to use a controller and play it thank you thank you for giving me that and you know what grownup buttons thank the **** Lord did you see the size of the buttons on the Pro Controller those are the biggest goddamn buttons I've ever seen I wish we had a picture of it they're amazing thank you yeah this",
            "start": 1108.44
        },
        {
            "text": "thank the **** Lord did you see the size of the buttons on the Pro Controller those are the biggest goddamn buttons I've ever seen I wish we had a picture of it they're amazing thank you yeah this will be marketing research this is actually really serendipitous for Sony in a way because the Vita is dead didn't work out for them and they're going to get some good market research first-hand market research done and spend a goddamn dime other than I'm I'm sure they're R&Ding their own stuff right now but about does this matter is this going to work like they're going to have now litmus test from the guys who really defined uh handheld gaming since 1989 uh putting out something that's a hybrid um that I think is going to be most appealing as as a handheld I think that's obvious and uh they'll be able to watch and see and be like if this does well then we actually can move forward with whatever plans we have uh to make something that's more you know more equivalent with what you know PS4",
            "start": 1145.88
        },
        {
            "text": "be able to watch and see and be like if this does well then we actually can move forward with whatever plans we have uh to make something that's more you know more equivalent with what you know PS4 is in a handheld form and if it fails and they like get the **** we have to worry about that anymore like we're not going to win um so this is like creating a new you know it's an interesting hybrid Market of like well a little bit of mobile gaming maybe skewing a little bit older having a console quality game on the go it's a lot of different ideas this is a really last-ditch effort for Nintendo I think obviously um to make their Hardware work again um if it doesn't work that's the end of Nintendo Hardware I think everyone knows that um but I do feel like this is going to work in some sort of way unless the news that comes out about everything else which they're hiding right now which is smart um is just disastrous if the battery life is literally two hours or if like the which is awful if",
            "start": 1184.68
        },
        {
            "text": "of way unless the news that comes out about everything else which they're hiding right now which is smart um is just disastrous if the battery life is literally two hours or if like the which is awful if the you know the controllers are flimsy or things break or I'm really interested to see all of that as well but I think it seems like they have the catalog of Publishers and developers lined up the device looks great the price is probably going to be right Nintendo's not stupid they usually nail that stuff pretty well and it does move away from the the toys for children thing with the marketing um because Nintendo fans have aged up and grown up I mean I I I really I don't have kids I don't know but I have nephews and I have six nephews and nieces none of them give a flying **** about Nintendo you know you know but they all play games or you know like like uh they'll play Minecraft they're in Minecraft they're in the PlayStation they're in older games like my you know my brother's kids are",
            "start": 1220.56
        },
        {
            "text": "you know you know but they all play games or you know like like uh they'll play Minecraft they're in Minecraft they're in the PlayStation they're in older games like my you know my brother's kids are really like playing retro games and stuff like that so I feel like it's a different environment I feel like the Nintendo fan is older the Nintendo fan the new Nintendo fan is the child of the Nintendo fan you know and so everyone has to scale up together and I think that this device might do that and that's what the thing shows right it's what we talk about is that we we our lives are so busy we move around so much that you don't have time to sit down all the time and play a game in front of a TV and that's what they're going going for I think that in a year the name I think is going to prove to be actually good I think right now it's just a shock after being ready for NX I think Switch is going to be good in the end will like that and I think it's going to be a really big success the",
            "start": 1256.96
        },
        {
            "text": "to be actually good I think right now it's just a shock after being ready for NX I think Switch is going to be good in the end will like that and I think it's going to be a really big success the console in general yeah for me like all hyperbole and excitement aside because obviously I'm extremely excited about this I I just I'm shocked that Nintendo did this right like cuz even this part I was convinced they were going to **** up right you know I was convinced we're going to see this and I was going to be like ah almost but I'm not I'm like this is it like this trailer it is that PlayStation 4 message that we got years ago and I'm like holy **** I didn't know Nintendo had it in them because you combine this trailer with this device with this list of Publishers seeing Skyrim there which all right it's a 5-year-old game whatever it's a step in the right direction and it being a console experience on the go but not the consoles that you're the modern consoles the Wii U console like",
            "start": 1291.08
        },
        {
            "text": "all right it's a 5-year-old game whatever it's a step in the right direction and it being a console experience on the go but not the consoles that you're the modern consoles the Wii U console like let's be realistic about this that's all amazing but when you add that with the idea that the Wii U and the 3DS are no more and every first party and second party Nintendo game is going to be for one device **** yes that could mean we get actual games like all those things added together and I'm just like thank you yes please please yeah and I think it's going to be a fun place to get in as I said before you know because Greg and earning trophies obviously and we like those kinds of things is I hope they have some sort of system like that and we can all start at the same time again uh which we haven't really had you know 2005 and 2008 respectively when the achievements and trophies started it would be fun to get into that environment too and start doing that maybe for older games and",
            "start": 1326.64
        },
        {
            "text": "we haven't really had you know 2005 and 2008 respectively when the achievements and trophies started it would be fun to get into that environment too and start doing that maybe for older games and retro games give you a reason to kind of stick around when the games are game releases slowed down which they will traditionally for Nintendo consoles so um there's a lot to for them to nail that I think will be important for the longevity of the console but I think that um or the handheld whatever you want to call it but I think that it's it's certainly very appealing and I and and it wets my appetite for uh what's to come I mean a Mario a 3D Mario game like that on the go sounds really great I I I'm with I don't give a **** about Skyrim but like playing a Metroid game or a Metroid Prime game or a um 3D Mario game or whatever on the go sounds fantastic and I and I still get way more excited about the older games that you can just bring around with you that you don't have to have a",
            "start": 1368.6
        },
        {
            "text": "game or a um 3D Mario game or whatever on the go sounds fantastic and I and I still get way more excited about the older games that you can just bring around with you that you don't have to have a modded PSP or any of those kinds of games I'm happy to buy those games again if I have to um as long as now I have an account system and stuff like that I'm sure all this information is going to come out we're really only five months away um so I think the timing is great so exciting when do you think the next dump the information we get a Direct in December maybe so I'm not clear when the investor meeting is I think that it's early I think it's next Tuesday which is why like they had to get this out um which I think is obviously a very smart call so I imagine at the investor meeting usually there's not too much information from those but there's sometimes like one big thing um like I think they announced the DS and an investor meeting one time so big whatever but mean it's going to be",
            "start": 1403.48
        },
        {
            "text": "there's not too much information from those but there's sometimes like one big thing um like I think they announced the DS and an investor meeting one time so big whatever but mean it's going to be tidbits it's going to be little dollops of information as we go right Pac-Man was announced for Smash Bros. at an investor meeting so like we do get game announcements G I don't give a **** about the game announcements right now right like what I want to know is battery I want to know on online I want to does it have onboard storage what how does it work with the internet it it has we saw 32 GB okay great somewhere it said that okay I don't remember where I saw 32 GB of storage is all it has that's what I saw but remember it's cartridge though yeah but what about downloadable games I don't know Battlefield 1 is twice that big they're not going the digital future Battlefield 1 isn't going to be on this I know but I'm saying well well first of all could be and second of all the the I'm",
            "start": 1444.2
        },
        {
            "text": "know Battlefield 1 is twice that big they're not going the digital future Battlefield 1 isn't going to be on this I know but I'm saying well well first of all could be and second of all the the I'm just saying like a modern game I just deleted Doom off my PS4 yesterday that's all that's 60 gigabytes right like so that's awful if that's all they have for storage that might have been from a leak thing I saw I don't know that I didn't see I read the this is the only official Nintendo word on top of this trailer and it doesn't mention that in there that would seem like a weird thing to toss in they they have to have a lot of storage on this thing like that's that's it's it's super important you know like that's the way people play games now I understand they're going with the card proprietary or not proprietary maybe but a card system going back to kind of a cartridge style thing which is going to eliminate load times and all that kind of stuff and that's great I think that's smart I've",
            "start": 1484.52
        },
        {
            "text": "or not proprietary maybe but a card system going back to kind of a cartridge style thing which is going to eliminate load times and all that kind of stuff and that's great I think that's smart I've been reading a lot of things about how they wonder if a lot of future tech is going to actually go revert back to that and get away from optical media or whatever but like um I don't I don't know enough about that to know if that's smart or not but 32 GB is not enough space well stick with me on this though what if it's not it's not a it's not built in it's just one of like cuz that was the thing with the 3DS having being able to pop in just an SD card that would be great I don't give a **** if it's 32 out of the box but I get to put in whatever SD card I want on care yeah I mean that's that's totally different uh that's why we need to get a closer look at the console the thing they could learn one thing from Vita though and and I hope and I hope they learn this as well is to get the bad",
            "start": 1518.44
        },
        {
            "text": "totally different uh that's why we need to get a closer look at the console the thing they could learn one thing from Vita though and and I hope and I hope they learn this as well is to get the bad news out now you know like don't wait until the month before to start **** dropping bombs really ruining people's excitement for the thing I would I would do that as soon as possible if I were if I were them I'd be like this is how powerful it is this is the battery life this is the price as soon as possible because then that gives everyone time to digest and marinate on it and then and then the arc goes back up and everyone gets excited again regardless because then they start seeing the games if you do it the other way around you're like oh how how look how tantalizing Zelda is and all this and by the way it's $400 and by the way there's no onboard storage of any consequence and by the way the account system I mean you got to do that first Reggie all we're saying is give him a ****",
            "start": 1549.52
        },
        {
            "text": "and by the way it's $400 and by the way there's no onboard storage of any consequence and by the way the account system I mean you got to do that first Reggie all we're saying is give him a **** sandwich you had a great thing here now you give us the bad news then you give us a whole bunch of games and we're all excited just get it out of the way just get out of the way then there are no excuses um so yeah pre-order as soon as possible I'm going to pre-order as soon as as soon as humanly possible absolutely absolutely I'm back for now ladies and gentlemen what do you think good to have you Colin on the Nintendo Switch let us know in the comments below share this video with your friends and until next time no it's been our pleasure to serve you NX has given it to you",
            "start": 1585.72
        }
    ]
}