{
    "id": 2122,
    "video_id": "K6tVAKMNrj8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Nick's Crazy London Vacation - The GameOverGreggy Show Ep. 150 (Pt. 3)",
    "description": "Nick tells the story of his epic London vacation.\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1476860400,
    "duration": 1259,
    "transcript_chunks": [
        {
            "text": "Tim, what the heck is Video Blocks? Video Blocks is the best thing ever. Do you love stock footage, Greg? I do. I love stock footage. Legitimately, this is like my favorite thing ever. Kinda Funny Live, I don't know if you this not this footage, but a second ago there's footage that I used. Look at this. Now we're just now we're here. We're newscasting. We're doing fancy stuff. Now I'm flying above. It's fantastic. All all the footage you've seen here you can get for get on Video Blocks. It's super awesome. In addition to to video stuff, there's also Audio Blocks and Graphics Blocks. You music you hear that fun nasty beat underneath us? That's that's a Video Block. Yeah, it's from well, from Audio Blocks technically. So ladies and gentlemen, you can get your yearly subscription today for only $99 at videoblocks.com/Greggy. That's videoblocks.com/Greggy for this for this discounted offer. Not that that's not a real thing. What if I had Video Blocks that gave my voice? I would change that one out. I",
            "start": 0.04
        },
        {
            "text": "that's videoblocks.com/Greggy for this for this discounted offer. Not that that's not a real thing. What if I had Video Blocks that gave my voice? I would change that one out. I love this. Look at that. That's a monkey. He's making jokes. This doesn't the nothing we're saying plays for the people listen to the podcast. Go listen to watch the YouTube video. There's a bunch of crazy ass stuff behind us. Nick, what's your topic? Uh, my topic is just the trip that I went on. Tell me all about it. Uh, it was fun. My, you know, uh, every once in a while my wife looks me deeply in the eyes and says, \"It's time to go on an adventure.\" And that is what we did. Uh, so the trip was actually basically centered around us traveling to Morocco, but in order to acclimate to the time zone, we decided to stay in London for a few days. And since I'd never been to London, um, I thought it was a great opportunity to do so. Uh, not the least of which we took that opportunity to um, actually see the Harry",
            "start": 35.76
        },
        {
            "text": "to stay in London for a few days. And since I'd never been to London, um, I thought it was a great opportunity to do so. Uh, not the least of which we took that opportunity to um, actually see the Harry Potter play as well. So I was like, \"I'm gonna go. I'm going to London for the first time.\" I got this idea. I'm like, \"It would be awesome to see this play. It's the original cast. I've already read the book. It's a phenomenal uh, play.\" It's not a book, excuse me, a play. Um, and I really want to see how they do it. If somebody's just joining us, you are a huge Harry Potter fan. I'm a huge Harry Potter fan. Um, to the point where it's I don't think I think my I I don't know if I lost some credibility in my wife's eyes when she saw me in line for this play or if I gained more because I was like, \"We have to be in line like two hours beforehand.\" And she's like, \"Why? We have assigned seats.\" And I'm like, \"I don't know. I just want to be around it.\" Yeah, so we went a couple hours ahead of time. She's like, \"We don't need to\"",
            "start": 92.12
        },
        {
            "text": "line like two hours beforehand. And she's like, \"Why? We have assigned seats.\" And I'm like, \"I don't know. I just want to be around it.\" Yeah, so we went a couple hours ahead of time. She's like, \"We don't need to stand in line.\" Like, did you wear a robe? Uh, I did not wear a robe, but oh ****, I forgot the shirt. I got a dope ass shirt. Was it heather gray? No, they were sold out of those, but uh, actually they weren't sold out, but they they had heather gray shirts with all the House logos on it. Oh wow. But to be fair, um, I couldn't rectify buying a Ravenclaw House logo because I really wanted that Gryffindor logo. So I was like, \"I'm not gonna do it.\" We come back, this is kind of a spoiler, so if anyone hasn't read the play, um, well, you're screwed now. I'm gonna spoil this for you. Uh, in the play there is a a moment where it's it's hinted at that the Dark Lord might come back through a lot of different things that have happened in the play. That's it's possible that Voldemort might be back, right? And doing so, um, the",
            "start": 128.24
        },
        {
            "text": "it's it's hinted at that the Dark Lord might come back through a lot of different things that have happened in the play. That's it's possible that Voldemort might be back, right? And doing so, um, the Death Eaters rise again and they have this dope ass Death Eater logo on on a black shirt. And I'm like, \"I have to get that.\" So I got it and it's amazing. It's really intimidating and when I wear it, you guys are all gonna be scared of me. It's gonna be amazing. Okay, that is one way that could go. Scared of me. I'm a Death Eater of my heart. Um, so we get to London, uh, and I thought you were a rug muncher. Whoa. I still am. The uh, so we get to London and uh, the crazy thing is I I kind of sprung a little bit on these tickets, um, on the ticket arrived ahead of time. So how did you get them? Cause we were originally trying to work. Okay, so I was originally trying to reach out to everyone we knew to try to figure out if anyone could get me a ticket. And then Daniel Radcliffe and he's like, \"Don't never call me.\"",
            "start": 170.0
        },
        {
            "text": "trying to work. Okay, so I was originally trying to reach out to everyone we knew to try to figure out if anyone could get me a ticket. And then Daniel Radcliffe and he's like, \"Don't never call me. Where did you get my number from? Why are you in my bedroom? I did one Comic-Con thing with you. Stop calling me. And why are you calling me when you're in my bedroom?\" All this is very over his bed. Nick's on the phone. \"Can you get me into the are you still Harry Potter?\" Uh, you still. So the thing about the play is though, it's it's it's two parts. It is two two hour and 15 minute roughly parts. So it's 4 hours and some change of Harry Potter. Now my wife, unlike me, not a huge Harry Potter fan by stretch of the imagination. And she proved this to me as we were walking into the theater. She's like, \"Now what happened again in Harry Potter?\" And I'm like, \"It's too late. It's too late. You're just gonna have to figure it out and Google it as we go.\" Um, but it's part one and part two of the same day. And we were so we had to see it",
            "start": 211.8
        },
        {
            "text": "in Harry Potter. And I'm like, \"It's too late. It's too late. You're just gonna have to figure it out and Google it as we go.\" Um, but it's part one and part two of the same day. And we were so we had to see it the same day because we were only there for a Sunday and then it didn't run Monday, Tuesday. It was so did you need to buy two tickets in or is there an intermission? There's an intermission between. So what happened was originally I bought what I thought was two tickets. Now on the site it said, \"Hey, we gu like two tickets equals uh uh you get to go into part one and part two.\" So one ticket is part one and part two. So if you buy two, you get two tickets to both parts, if that makes sense. It's very confusing. So I was like, \"Okay.\" And I bought the cheapest tickets that were there thinking these are really cheap. These are like half as much as the other tickets, but maybe I'm just lucking out of here. And sure as **** to get there and it's just one set of tickets. It's not two set of tickets. It was",
            "start": 252.0
        },
        {
            "text": "cheap. These are like half as much as the other tickets, but maybe I'm just lucking out of here. And sure as **** to get there and it's just one set of tickets. It's not two set of tickets. It was unfortunately mislabeled. The person who put who was selling the tickets back mislabeled them. So like, \"Oh, what a bummer.\" You know, I'm like, \"This sucks, but I'll call StubHub and I'm sure they'll just refund my money and we won't get this see the show, but it's not a big deal.\" I called StubHub and the person on the other end was like, \"Wa G, what's wrong with the?\" Actually, they were Irish. It was more like, \"Daniel, oh oh, we guaranteed.\" They guaranteed the ticket. They were like, \"We stand by these tickets. You bought two tickets. That's our fault and the seller's fault, not your fault. So when you come on Sunday, come by our office, which is only a block away from the theater, and pick up your new tickets.\" And I was like, \"Okay, but.\" And they're like, \"They're actually like better tickets than the ones you bought, so you can or you\"",
            "start": 288.92
        },
        {
            "text": "which is only a block away from the theatre and pick up your new tickets. And I was like, \"Okay, but.\" And they're like, \"They're actually like better tickets than the ones you bought, so you can or you can get a refund.\" I was like, \"The no-brainer. I'm gonna go pick up these brand new tickets.\" Cause they were on like the floor, like right, you know, 10 rows back from. Oh my God, it was amazing. Um, so we get there jet lagged as **** and I'm like, \"I don't know how we're gonna be able to do this.\" Like, I've already read the play. I know what's gonna happen. And like, there's no way we're gonna be able to sit through this. The we get into the the the area or the theatre for the first time. Look at it's this beautiful historic Palace Theatre in London. And you see this like the train station setting. I'm like, \"I'm getting a little I'm getting a little psyched up for this.\" Yeah, you are. I'm getting a little psyched up for this. Then it starts and there's kind of a dance number. And I'm like, \"Okay, okay, they're\"",
            "start": 326.0
        },
        {
            "text": "I'm getting a little I'm getting a little psyched up for this. Yeah, you are. I'm getting a little psyched up for this. Then it starts and there's kind of a dance number. And I'm like, \"Okay, okay, they're dancing right now, but I can get that.\" Not traditionally found in Harry Potter play, but I'll get through this. Then the play starts itself and holy ****, hold on to your underpants, Greg Miller. This show is **** phenomenal to watch largely because it's actually it's a a narrative show. It's a Harry Potter show, but it's a magic show as well. So they're not actually going out there like and then ****, you know, **** Birds come out of their hands or anything like that, but they do ridiculously cruel **** like everything you read in the book they actually do, including swimming Dementors. There's a point where whoa, whoa, whoa, whoa, whoa. How do they swim? Yeah, they swim. No, they they in water. You would love it. It's it's all it's all through fly tricks. So it's all done with projection and they fly",
            "start": 358.84
        },
        {
            "text": "a point where whoa, whoa, whoa, whoa, whoa. How do they swim? Yeah, they swim. No, they they in water. You would love it. It's it's all it's all through fly tricks. So it's all done with projection and they fly people up and flip them over. So they're actually going down in the air. And like the first time you see the Dementors, by the way, which like the act the second act break, it **** blows you away. Cause they're like like it's they're out in the like, \"Oh ****, there's Dementors.\" I'm like, \"Okay, it's gonna be like a a lighting trick or whatever.\" Nope, **** Dementor come flying from everywhere. Giant 10 to 15 foot Dementor coming and they swoop down and like suck the soul out of people's eyes in front of them. Like this lighting effect. And then they grab them and then pick them up and they're gone. We got to go to London. Let's go to London, dude. Now that effect was awesome. The second effect that was **** amazing was they do this effect where they I don't know if you guys are familiar at all, but like they",
            "start": 401.0
        },
        {
            "text": "go to London. Let's go to London, dude. Now that effect was awesome. The second effect that was **** amazing was they do this effect where they I don't know if you guys are familiar at all, but like they do the Floo where you get like uh the fireplaces where you can travel through the the fast. Yeah, one of the ways they do that is you call up like a number and you go into the phone. And I'm like, \"How the **** are they gonna do that?\" Literally walk up to a phone and their backs turned toward the the the audience and they pick up the phone and then a second later the their **** robe just gets sucked through the phone and they're gone. That's it. And you're like, \"**** that is amazing.\" But the effect that blew me away and I was like, \"How the **** are they gonna do this?\" Was they turn back time. And it's it's a part of the the narrative is that they have a Time-Turner and the whole thing gets all **** up and that's how Voldemort is able to potentially come back. And I'm like, \"All right.\"",
            "start": 440.48
        },
        {
            "text": "time. And it's it's a part of the the narrative is that they have a Time-Turner and the whole thing gets all **** up and that's how Voldemort is able to potentially come back. And I'm like, \"All right, this is gonna be crazy.\" They have this little little Time-Turner, right? And they start using the thing. And as they're using it, like obviously they do the thing where it goes like this and it's like hovering and everyone's hands are around it, but it's hovering them. And I'm like, \"Whatever, I've seen that before on the internet.\" Right? And then all of a sudden the whole set goes a different color and all these clocks you didn't know were built into the set start spinning back. And I **** you not, do you remember when you jumped into the water in uh in Mario 64 and that that that tidal ripple effect in the water? The whole **** set goes like it just shakes like and it does that ripple effect and then boom, you're back in time. And I'm like, \"Every time it happened, I'm like, this is **** amazing.\" And",
            "start": 476.92
        },
        {
            "text": "the water. The whole **** set goes like it just shakes like and it does that ripple effect and then boom, you're back in time. And I'm like, \"Every time it happened, I'm like, this is **** amazing.\" And then they do **** like they do the Transfiguration. Like they drink the Polyjuice Potion and they like and they go like this and all another **** head comes up and it's the other actor. Like they're just there. It's all trap doors and stuff, but it was so flawlessly done that I'm like, \"Holy ****, that was amazing.\" And then we get the three-hour break in between the two parts. And I'm like, \"3 hours?\" Yeah, I was like, \"I'm dying.\" We went, got lunch and like walked around the the West End area, came back. And then like we started I think the show started at 1:00. It didn't finish till 9:00. So it was like it was a lot of Harry Potter, but it was really well worth it. And the show is beautiful. The cast is amazing. Um, and being able to see that uh the cast like the original cast of it was is something",
            "start": 510.56
        },
        {
            "text": "like it was a lot of Harry Potter, but it was really well worth it. And the show is beautiful. The cast is amazing. Um, and being able to see that uh the cast like the original cast of it was is something special. So if you can do it and you have the money for it, it was expensive. That sounds so cool, but it was **** tight, man. Clips of this? I don't know. Probably. I'm sure some people tried to film it, but I mean, it doesn't really do justice. Yeah, and you know, the guy that like a lot of the actor, I mean, the actors are all pros. They're all like phenomenal stage actors from London. The young guys were great too. Everyone was great. Um, so we did that. That was the first day. Then the second day, I'm like, \"We're really tired. We're gonna flew it all around London.\" Uh, and then I start getting obviously people start picking up that I'm in London. So all the best friends out there are like, \"Hey, you know, if you're around, we should do something.\" And I'm like, \"Nah, it's not really my thing. It's more Greg's thing.\" Like,",
            "start": 552.36
        },
        {
            "text": "start picking up that I'm in London. So all the best friends out there are like, \"Hey, you know, if you're around, we should do something.\" And I'm like, \"Nah, it's not really my thing. It's more Greg's thing.\" Like, and then my wife literally goes like this after like the third or fourth tweet. I'm like, \"Should I do like a thing? Like a meet and greet?\" And she goes, \"What would Greg Miller do?\" And I'm like, \"Well, Greg Miller would already had five meet and greets. So I already **** that up. Had one in the, you know, one on the plane, one in the airport.\" Uh, so I was like, \"Yeah, I'll see.\" I called up Tom Hawkins and uh, well, actually text him. Oh, to Tom. I was like, \"Hey, man, if you're in town, like, let's grab let's grab dinner.\" And he was like, \"You know, a lot of people want you to do meet and greet.\" I was like, \"Well, sure. All right.\" And as I'm like typing it, he sent me the image of like what he wanted to use. And I'm like, \"All right, I got to use this image, cause how wildly offensive is that?\" Um, and there it was, you as like a a",
            "start": 590.28
        },
        {
            "text": "right. And as I'm like typing it, he sent me the image of like what he wanted to use. And I'm like, \"All right, I got to use this image, cause how wildly offensive is that?\" Um, and there it was, you as like a a palace guard or something. Pal guard. Just Kevin, insert that image right here. There you go. No, he just said no. Wasn't there a debate if that was Tom Hawkins or not? Yeah, somebody's like, \"Oh, Nick made an image.\" I'm like, \"Nick did not make that image circumstance.\" Like a Nick. I mean, the fact that you did, I wouldn't have believed you did a meet and greet, but the fact that you did, I'm like, \"I think Nick made the image his own.\" The image that I wanted to make originally that I was that I had in my brain, but Tom Hawkins made one that to it was gonna be me uh with my face on Arnold Schwarzenegger's body. **** like what? Like from Commando, obviously Commando, uh invading London basically and being like, \"The America the Americans are coming back for revenge.\" You know what I mean? Taking down London. Yeah, that",
            "start": 622.88
        },
        {
            "text": "like what? Like from Commando, obviously Commando, uh invading London basically and being like, \"The America the Americans are coming back for revenge.\" You know what I mean? Taking down London. Yeah, that would they would have sent some Bobbies out to get gone over. Well, um, so London was amazing. Uh, and then we went to Morocco. Uh, how was Morocco? Morocco was uh very different. Yeah. Um, and very surprising what you discover about yourself when you're when you're immersed in a culture so completely different than the one that you're used to. Yeah. Uh, namely we flew in at night. Uh, it is very intimidating at first because it is an Arab country. Like it is. There there are not too many tourists specifically in Fez where we where we flew into. And so you're driving through this area that looks, you know, obviously it's a completely different country than than anything that we're that we're used to seeing in the media as far as um, you know, the Middle East is concerned. But you can't like for me personally and",
            "start": 664.28
        },
        {
            "text": "it's a completely different country than anything that we're that we're used to seeing in the media as far as um, you know, the Middle East is concerned. But you can't like for me personally, and this was very telling, I was like, \"I can't shake this feeling that this is a dangerous place to be.\" Um, especially as a white American. I'm like, \"This is I just this doesn't feel right.\" And I was I wasn't freaking out so much is that just all my cultural biases and and and kind of inherent latent racism? Well, sure. When I mean, you're talking about a Middle Eastern country, right? When do we see them in Jarhead? When things are about to go south. We only ever told that anyone who speaks that language or or believes in the Muslim faith is is is bad, right? Um, and so I'm like, \"Wow, this is kind of weird this this visceral reaction I'm having.\" And coupled with the fact that it is a very different environment than we live here. Like all the houses are walled off. Um, everyone I mean, everyone there's no real tourism",
            "start": 707.28
        },
        {
            "text": "visceral reaction I'm having and coupled with the fact that it is a very different environment than we live here. Like all the houses are walled off. Um, everyone I mean, everyone there's no real tourism in that in the outskirt area of Fez. Um, so we get there. We go to this beautiful Riad, which is a it's kind of like like a an old school uh house that's built that has been built out to be a hotel basically. We stay there. And I'm like, \"Oh, this is crazy, but we'll just get a good night's sleep and tomorrow morning we'll we'll just kind of go into the City and try to try to immerse ourselves as best as we can with this kind of like weird freaking out that I'm doing.\" Wake up the next day, go out. Everything's amazing. Everything everyone's nice. Everyone's cool. Like I mean, it's it's it's still kind of a, you know, it's still a very intense environment to be in because we were in the Medina, which is like uh which is basically the Central City, The Old City that's walled off and there these high walls very",
            "start": 742.0
        },
        {
            "text": "know it's still a very intense environment to be in because we were in the Medina, which is like uh which is basically the Central City, The Old City that's walled off and there these high walls very claustrophobic, but it's just where people live and that's where they they sell stuff and that it's how it's it's just their life, right? You go out to that and you feel I felt stupid. Like I felt silly for going into this environment and being I mean, it's intimidating no matter what because you don't speak the language and not a lot of people speak English, but we had a guide that that we. Oh, you got a guide. That's awesome. What was his name? Uh, I cannot remember actually because he introduced himself to me and I thought it so quickly. You're like, \"I was like.\" And then I was like, \"Oh ****, I didn't catch his name.\" And then too late too late to too late. Um, did D catch it? No, she didn't catch it either. Um, but also again, another one of those like it was it was a hard name to remember. Yeah, uh, the guy that we",
            "start": 784.84
        },
        {
            "text": "name. And then too late too late to too late. Um, did D catch it? No, she didn't catch it either. Um, but also again, another one of those like it was it was a hard name to remember. Yeah, uh, the guy that we hired at the next trip was Muhammad. So that was lot that was a little easier. I was like, \"Muhammad, I can remember that one.\" That's a fairly common name. Um, but yeah, so the first day we were in Fez, we actually got a tour of the City, which is like the older City that's built the high walls and all that stuff. And we kind of went slowly but surely down into the belly of that um, into like this crazy Tannery. You can see pictures on my social media. Like where they actually make leather and tan leather. It's **** crazy and smells like gyro meat. And they give you like mint leaves so that you can smell them if if the smell is too overwhelming. But I'm like, \"No, I'm a man and I like meat.\" So I just dealt with it. Um, made you hungry for all that Jack Link's beef jerky you left behind? I noticed it's gone by the way.",
            "start": 817.12
        },
        {
            "text": "if the smell is too overwhelming. But I'm like, \"No, I'm a man and I like meat.\" So I just dealt with it. Um, made you hungry for all that Jack Link's beef jerky you left behind? I noticed it's gone by the way. Whoever ate that is, you know, you know exactly who ate it. Whoever ate that. I just threw it out. You don't leave food for two weeks out. It's beef jerky. Doesn't matter. Um, I was actually I bought some beef jerky thinking of you on my flight back from Canada and I it said in the back, yeah, refrigerate or eat within like five days or something. Like, really? I didn't know that. Kevin might have saved your life. He probably saved he probably saved my life at the expense of his own colon. Um, so Fez, three days. And then we drove across the country to Marrakech. And that was actually probably the best part of the whole trip. We just got to see a lot a large portion of the country. We stopped off for the best meal that I've had, which was just like in this small little town. Um, when you say the best meal you had on the",
            "start": 855.36
        },
        {
            "text": "trip. We just got to see a lot a large portion of the country. We stopped off for the best meal that I've had, which was just like in this small little town. Um, when you say the best meal you had on the trip or ever? On the trip. Okay, right. Which was just very like, you know, lamb. You've been to Morocco. You're competing with England. So we're not really talking about the B Bing. You know, the food in England actually wasn't. But everyone says the food in England is terrible. I'm like, \"It was totally fine to me.\" It was just I don't know. It was like I mean, we we just found you have bangers and mash? No, we didn't have any bangers and mash. We just you did have some cheeky Nando's. Oh, I did have Nando's. Yeah, I had Nando's. Oh, how was it? It was okay. It was serviceable. I mean, the problem with Nando's is it's it's it's like a an El Pollo Loco, right? It's a little bit better than that. I would say. I don't know if you guys have ever been to the Market Broiler, but it's like that where they're like, \"We kind of make the meat fresh.\" I",
            "start": 897.04
        },
        {
            "text": "an El Pollo Loco, right? It's a little bit better than that. I would say. I don't know if you guys have ever been to the Market Broiler, but it's like that where they're like, \"We kind of make the meat fresh.\" I guess it tastes okay. I can understand why people would like it. Um, I get why like it's a cultural thing. Like if it were there, we would go to it a lot and we'd be like, \"It's just Nando's.\" Right? I guess get you'd figure out what to get. You'd get it over kind how you go to Starbucks. Exactly. Like with Starbucks isn't great, but we go to Starbucks all the time. Yeah, best Nando's. Um, so yeah, I guess it's cheeky. Uh, then Marrakech, which was a lot more um, a lot more touristy. A lot more like it's like I I kind of likened it to like the the main area that's square. Is it's like Disneyland, but if they didn't give a **** if you had a live cobra like out and about. Perfect. And there's no rides. It's just a ton of people, ton of lions and **** cobras. And there's pictures of me with snakes around my neck, not cobras, but",
            "start": 933.16
        },
        {
            "text": "if you had a live Cobra like out and about perfect and there's no rides it's just a ton of people ton of lions and f*** cobras and there's pictures of me with snakes around my neck not cobras but there's a Cobra in the background just a Cobra kick at it did you do the Cobra-La chant when you were there I did it in my brain but I didn't want to be super offensive I like Cobra all our G.I. Joe fans see if I did that in the Square that might be misconstrued I was like I'm not going to do that different cultural norms yeah um but the best the best part of the trip was we went out to the desert for for a night and I'm like this is going to be f*** awesome right we're going to sleep in the middle of the desert um we're going to ride a camel it's going to be amazing it's going to be so f*** quiet and we get there and the first thing we do is ride these amazing camels and it it's an experience because camels are very high up in the air and I'm like I hope to God I don't have to actually",
            "start": 977.0
        },
        {
            "text": "quiet and we get there and the first thing we do is ride these amazing camels and it it's an experience because camels are very high up in the air and I'm like I hope to God I don't have to actually like pilot this thing well turns out they were they were tethered together so they could just the guy could just walk all of them and I was like I kind of feel stupid cuz I'm not actually guiding this camel with my own two hands but then at the same time I don't want to just die so I'll stay on the camel um and at night time I'm like this is going to be so great it's going to be so quiet and then as the sun went down I'm like what is that that I hear are those Marina douchebags that are the camp nothing but Americans drinking beer all night just screaming loud dude bring me another beer y I'm like oh my God are you f***ing kidding me you came all the way across the country to do exactly what you did in your home state in America go f*** yourself real quick all the way across the world oh",
            "start": 1017.08
        },
        {
            "text": "like oh my God are you f***ing kidding me you came all the way across the country to do exactly what you did in your home state in America go f*** yourself real quick all the way across the world oh country I'm sorry the world my apologies um so that was a little bit ruined but it made up for the next place we stayed at there was um they actually had a little animal preserve like a little and it was amazing they who you get to hang out with I got to hang out with again I think think I'm in love with them and I think I might send might send money back for their lives to be just a little bit better two camels and all the animals have names that start with P and the camel's names were Pumpkin and Pickles yep yep and they are the sweetest they are the sweetest f***ing things on the planet I got to feed them they make this sound when they eat like py just like pory big porties and they have these be they have eyelashes so they're very like feminine looking very cute were any of them",
            "start": 1053.12
        },
        {
            "text": "I got to feed them they make this sound when they eat like py just like pory big porties and they have these be they have eyelashes so they're very like feminine looking very cute were any of them smoking cuz that's my exposure to Camel no you know oddly enough the whole time I didn't see one Camel smoking weird weird it was crazy um used to be this thing called Joe Camel you're very young I understand if you don't remember pictures of him and Jay-Z next to each other and it's like that's kind of weird they do look like each other damn with the glasses have you seen this I have not seen Google it Jay-Z Joe Camel there's a picture of Jay-Z wearing sunglasses and Joe Camel's wearing the sunglasses and it's just like goddamn it's one of those um what's the Reddit called the Reddit like lookalikes or whatever okay it's hilarious next time you next time you get Totally Looks Like Totally Looks Like yeah next time you get a Joe Camel thing look at his face his like nose and it looks like a",
            "start": 1093.48
        },
        {
            "text": "or whatever okay it's hilarious next time you next time you get Totally Looks Like Totally Looks Like yeah next time you get a Joe Camel thing look at his face his like nose and it looks like a f*** and balls it turns out that they hit a f*** and balls on Joe Camel's face for years no f*** my wife just text me pictures of Pumpkin and Pickles all right you're going to see them you have to hold on did you tell her you were doing this topic and you need pict so just randomly out of the blue here's remember Pumpkin and Pickles she's like I wish we were back with Pumpkin and Pickles those are two camels for sure which is which I don't know I couldn't tell I didn't pay that close one's a female one's a male if I saw the balls I figured out I think Pickles was the dude you don't even know that was out with him uh but yeah Camel's my new best friends awesome was an amazing trip uh and then we uh flew back to London for one night just to to stop over fly over lay over rather uh and then",
            "start": 1132.92
        },
        {
            "text": "that was out with him uh but yeah Camel's my new best friends awesome was an amazing trip uh and then we uh flew back to London for one night just to to stop over fly over lay over rather uh and then flew back that's awesome I tell you the one thing I did learn from this trip is are you guys familiar with Ryanair yeah oh yeah the terrible air yeah terrible you think United's bad it makes United look like first class they're like Spirit Air in Europe isn't this super cheap Ryanair you pay for it was like 75 bucks a ticket to get from London and Morocco and you pay for everything so the point I was like can I have a water and the's like yeah it's going to be 5 pounds I'm like what no I'll just sit here and be dehydrated that's f***ing absurd um yeah they wanted to charge I think the thing with Ryanair was they originally they wanted to charge for bathroom yeah they wanted to charge you and like they I apparently couldn't get away with that yeah no uh that's that's probably legal but",
            "start": 1171.92
        },
        {
            "text": "with Ryanair was they originally they wanted to charge for bathroom yeah they wanted to charge you and like they I apparently couldn't get away with that yeah no uh that's that's probably legal but anyway so I took a couple Ryanair flights that was one of those like Jesus Christ but um anyway trip overall amazing success uh one thing I did learn was London is amazing we should all go very soon there's lots of people over there that love us I know we wanted to go I mean I I'll say I mean I'll say it openly we almost did just oh yeah we talked about talked about the the whole reason you went on that trip right is that we were going to originally tack on of the back of EGX but that fell through the last minute and so you just had a vacation we tried worked out well yeah yeah we'll get back we'll get over there probably for the best cuz then we would have had to go to Europe it's a joke it's a joke I was like geez I like Europe I've been to Europe three times it's a lovely place so",
            "start": 1211.68
        },
        {
            "text": "back we'll get over there probably for the best cuz then we would have had to go to Europe it's a joke it's a joke I was like geez I like Europe I've been to Europe three times it's a lovely place so I'd like to go back yeah yeah",
            "start": 1246.36
        }
    ]
}