{
    "id": 2101,
    "video_id": "M0h5oA10hKI",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Let's Play PS VR: Battlezone - Kinda Funny Plays",
    "description": "FULL DISCLOSURE\nPLAYSTATION PROVIDED US WITH PLAYSTATION VR FOR REVIEW PURPOSES.\n\nPlease note, video is captured at a lower resolution than what the player sees when using PlayStation VR\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1476028802,
    "duration": 531,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm Tim Gettys, this is Greg Miller, and he is in virtual reality. I'm in the Battlezone in my Mech. Shout out to PlayStation, thank them for, you know, they gave us this PS VR. Full transparency, all that stuff. Is that the messaging we're saying? We're just saying if the FTC is watching, we're acknowledging the fact that this clearly, we didn't buy these somehow ahead of time. PlayStation sent us this and the games. Does it influence our coverage? Of course not. We've always been in the tank for PlayStation. Why would this suddenly change it? So speaking of tanks, oh yeah, there you go. Got VR high five. It's probably not a good idea. Hey, you have to do all the work. That's what I'm saying. I have not played this game yet. You, we're speaking highly of it. I, what I had said is I, we played it, you, I thought you played with me at PSX. One of our, one of, one of the best friends works on this game, so he called us over to do it and hang out with him and see it. It's this arcade, you know, dude out here running",
            "start": 0.08
        },
        {
            "text": "you played with me at PSX. One of our, one of, one of the best friends works on this game, so he called us over to do it and hang out with him and see it. It's this arcade, you know, dude out here running around, shoot stuff. Yeah, exactly. Lot of Tron going on this video. So I, and like I played it there and enjoyed it, and then I started the tutorial here and then had to bail out. So I'm jumping back in now to play it with you and show you a little bit of it. But it's a really cool, fluid, uh, tank game, you know what I mean? That I think that's one of those things I think so many people have been excited for when you talk about PlayStation VR, right? You see, yeah, exactly, right? I can imagine that looked really cool. Oh yeah, see that's the other thing is like, you know, you see all these, these videos, they do not do it justice. Exactly. Yeah. And of course, all our descriptions tell you, of course, that the, the best visuals are in the headset. The visuals you're seeing right now are lower quality, but again, as we",
            "start": 40.88
        },
        {
            "text": "not do it justice. Exactly. Yeah. And of course, all our descriptions tell you, of course, that the, the best visuals are in the headset. The visuals you're seeing right now are lower quality. But again, as we pointed out, it's not like the VR headset is also 4K or something. Yo, pretty low resolution. Like it's distractingly low. Yeah, yeah. Like, AR, I'm even here like trying to read that. I get to get right on it. But I can, I can also, when I do that, I can also act like a snake. You have a whole other, you know, reality that you could be normal in, Greg. Yeah, but no, you're still Greg Miller. I appreciate that about. Thank you. Nothing's going to change me, you know what I mean? Mhm. So what is it, the, what is this game? Uh, you're going to see in a second. We're getting out. This is calibration, teaching the controls. The idea is think that I'm driving this tank car that I'll get to choose here in a second. And then I'm in the cockpit looking around this way. And then I'm still shooting and driving, uh, with the sticks.",
            "start": 76.0
        },
        {
            "text": "idea is think that I'm driving this tank car that I'll get to choose here in a second. And then I'm in the cockpit looking around this way. And then I'm still shooting and driving, uh, with the sticks as you'd expect. But it's basically, we're in this kind of, no, no. And this, we were talking earlier about like, uh, you know, you were talking about how, uh, and one of the other ones, there was a story and there was all the stuff and we weren't necessarily expecting that same deal here. Like this is what works about VR is that it's always a trip, I feel, when you get into it. And this is, this game does an excellent job of, holy crap, I'm no longer in the studio. I am in this car. I am in this tank right now, driving around, shooting around, about to shoot some stuff. But you get to see, go through. I got machine guns, I got missiles. I'm going to go after these guys and kill a bunch of too. Yeah. Oh, they're shooting at my boy Greg Miller. Nah, I'm switching over the Big Miss. Suck it, Reds. Big Miss, as I call them.",
            "start": 125.28
        },
        {
            "text": "guns, I got missiles. I'm going to go after these guys and kill a bunch of too. Yeah. Oh, they're shooting at my boy Greg Miller. Nah, I'm switching over the Big Miss. Suck it, Reds. Big Miss, as I call them. Really good lighting effects. It's one of those when you drive up on stuff that explodes, like I, the cockpit gets all orange, you know what I mean? If that makes sense. It's so crazy because like I was just doing other Let's Plays of a couple other games. And so now to look at this, it's, it just, it's kind of boring looking. Whereas when you're in it, it's so intense and so crazy. Like we were talking about a Super Hyper Cube. Um, that's a game where if you were to watch it, it's pretty generic. And when you have it on, there's just colors all around you and there's so much particles. I think particles are the key thing. Particles make a lot of sense. You remember Mark Cerny, of course, that the PlayStation 4 announcement event. It was all about them particle physics going to happen. We like, why it doesn't make sense? Only Rez",
            "start": 161.56
        },
        {
            "text": "thing. Particles make a lot of sense. You remember Mark Cerny, of course, that the PlayStation 4 announcement event. It was all about them particle physics going to happen. We like, why it doesn't make sense? Only Rez making sense. And here we are in Battlezone. Anything can happen back things. But it's, I, what I like about, I mean, this is why VR works and is so different, right? In the fact that there is depth of field, right? Like when I kill the, when I kill this guy, I got to look down at my little radar that's in my tank and actually understand where I'm going. And granted, like that, that, you know, having a tank HUD like that made sense. But it feels like it's right there, you know what I mean? Like I feel like I should see my hand as I reach out to touch it. Oh man, tell you what, I can't wait for the Batman Arkham tank combat. Just kidding. I don't want to be in that crap ever again. Damn son, shots fired. What's interesting about Battlezone and why I think it's going to get the so much press at launch and like that",
            "start": 202.36
        },
        {
            "text": "combat. Just kidding. I don't want to be in that crap ever again. Damn son, shots fired. What's interesting about Battlezone and why I think it's going to get the so much press at launch and like that we're not doing justice right now because we're running through the campaign. We're shooting things. Awesome. Uh, this is a multiplayer game online. So it is going to be that like right now, sure, I'm running around shooting these guys. That's all well and good. When you get your PlayStation VR unit, other people are going to have Battlezone. You're going to be able to jump out there and do that. Yeah, it sounds like it's going to be between this and Rigs in terms of the actual competitive, sure, scene. And that Rigs is going to be super interesting. I played Rigs and I enjoyed Rigs, but it definitely made me car sick the first time I played it here. Having this, this is just an additive view. And it might have been too that Rigs was my, you know, the first time I played something like this. So I need to give it a shot.",
            "start": 245.68
        },
        {
            "text": "the first time I played it here. Having this, this is just an additive view. And it might have been too that Rigs was my, you know, the first time I played something like this. So I need to give it a shot again. Don't worry. I scared, scared. I like the vibe of this game. No, right. Good colors. Obviously, level one is not going to be super exciting. But it's got what you want. What like, you know, I feel like you talk about it in this launch wave. So much stuff, I feel like is going to be tech demos. Mhm. And this is a game that actually feels like a game. Here's your campaign. Here's your online. Go do this. Yeah. Is it going to hold my attention forever? No, I don't think most stuff here will. But I think it's going to, I think this has more legs than probably Arkham does, right? An hour plus 90 minutes of going through, get all the Riddler Trophies, which I'm going to do. But once I'm done, I'm done. It just becomes a piece for me to show people what I have. If I'm buying a unit and I need something to play over and over",
            "start": 279.84
        },
        {
            "text": "get all the Riddler Trophies, which I'm going to do. But once I'm done, I'm done. It just becomes a piece for me to show people what I have. If I'm buying a unit and I need something to play over and over again, something with online multiplayer and a reason to go after each other, not an experience. Yeah, but even like this, this is like, it sounds so stupid, I guess. But like, this is really well done in terms of like, how do we use the, you know, 360° space we have in this game? And here I am looking through the top of my cockpit as I shoot up. There you go. Two, one, boom. So what I want to do is jump into the next one. See what it's like, you know what I mean? You see here, my success, my data, my pickups. Did good. You completed that objective. You know how I do it. You know how I like it. I like objectives because I knock them out just like I knock out Kevin when he talks ****. Damn, he talk **** a lot. Talk ****, get shot. Kevin, is he asleep? No. Oh, I love the Greg couldn't even see you over there with your eyes",
            "start": 328.28
        },
        {
            "text": "knock them out just like I knock out Kevin when he talks ****. Damn, he talk **** a lot. Talk ****, get shot. Kevin, is he asleep? No. Oh, I love the Greg couldn't even see you over there with your eyes closed, looking like a, I don't even know, jellyfish. So now I'm going to do this. Oh, it's kind of creepy when you're in here with nothing going on, you know what I mean? Always whenever there's a moment of silence, I don't trust it. Destroy. Like even not scary games get really scary. Let's see. I got some teammates here. Light skirmishes approaching fast. Got my Bros back here. Got the bad guys over here. You get them bad boys back, bo, back. Reminds me a bit of the multiplayer in Star Fox. Okay. I feel like everything reminds you of Star Fox. It's not true. Okay. Just say you sound like one of them haters in the, in the comments. I'm not being a hater. I'm just saying it seems like you've only played two games and you talk about them all time. And maybe you should play something like Patapon or DC Universe Online.",
            "start": 372.16
        },
        {
            "text": "the comments. I'm not being a hater. I'm just saying it seems like you've only played two games and you talk about them all time. And maybe you should play something like Patapon or DC Universe Online to really, you know, expand your game. Ple. Oh God, what happened? Doing something violent. No, I don't know. It's really disorienting watching someone else play. That's what I'm saying. So here's my thing. I'm feeling a little motion sick right now. Is it because I just spent the last 30 minutes playing in VR? I don't think so. I, because I was getting motion sick walking. What was last game we, oh, we did all the different demos. Yeah. I was, I was in the exact same boat where watching you play, I was like, oh God. But this, this is like what I always talk about with driving where if I'm in the backseat of a car, I'm prone to get sick. But if I'm in the front and I know what's coming, it's not a big deal. When I'm in control of the Mech here, when I'm in control of the battle tank, I'm all set. When I'm in the Battle",
            "start": 440.96
        },
        {
            "text": "prone to get sick. But if I'm in the front and I know what's coming, it's not a big deal. When I'm in control of the Mech here, when I'm in control of the battle tank, I'm all set. When I'm in the Battlezone, Battlezone, get in the Zone, AutoZone. But anyways, yeah, this is it. Blow stuff up, gets cool stuff, cool. Looks great to me. Good. Awesome. Stay tuned right here, youtube.com/KindaFunnyGames. Way more PS VR content. And check out PS I Love You XOXO, where Greg and Colin give their review of The Thing. Eventually on Gamescast, we'll talk about it. You know how we do. We're going to be talking about this thing forever. It's pretty nifty. And if you're the Goddamn government, yeah, we get it. PlayStation sent this. We didn't buy it. Chill out. Jeez. Jeez. Oh, thanks, Obama.",
            "start": 486.48
        }
    ]
}