{
    "id": 2086,
    "video_id": "m7G7MkA33sQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Remembering The Nintendo 64 - Kinda Funny Gamescast Ep. 88 (Pt. 1)",
    "description": "We celebrate the Nintendo 64's 20th anniversary.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1475499603,
    "duration": 1281,
    "transcript_chunks": [
        {
            "text": "This episode of the Kinda Funny Gamescast is brought to you by MVMT Watches, the company started by two broke college kids that wanted to wear style watches but couldn't afford them. So they decided, whatever, we're just going to start our own watch company. That's kind of like us. We're like, you know what, we see all these other people making YouTube videos, we can do it too. Let's start Kinda Funny. MVMT Watches start at just $95. At a department store, you're looking at hundreds of dollars to get a watch. I remember one time me and Nick Scarpino went to uh that there Nordstrom's trying to get me a watch. Yeah, let me tell you, it was cool but it was expensive. Here, MVMT Watches, they figured out that by selling online, they're able to cut out the middleman and retail markup, providing the best possible price, classic design, quality construction, and style minimalism. We just got a bunch of them. Colin got a black and blue one, Nick got this real sleek one, and Greg Greg got a fancy red and",
            "start": 0.12
        },
        {
            "text": "best possible price, classic design, quality construction, and style minimalism. We just got a bunch of them. Colin got a black and blue one, Nick got this real sleek one, and Greg Greg got a fancy red and black one to complement his fancy red and black suit. Now, over 500,000 watches were sold in over 160 countries. You can get 15% off today with free shipping and free returns by going to MVMTwatches.com. Now, you might not know this, MVMT, it's MVMT. You've probably seen it before, they're kind of a big deal. So go to MVMTwatches.com/kinda and you can get 15% off today. Now is the time to step up your watch game. Go to MVMTwatches.com/kinda. Join the movement. See what they did there? I liked it. What's up, guys? Welcome to the first ever Episode 88 of the Kinda Funny Games. 88 miles per hour, bro. I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, Colin. I'm sorry you have to be here with us in general. I don't know, it's in between us. ****, are we touching them?",
            "start": 32.96
        },
        {
            "text": "Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, Colin. I'm sorry you have to be here with us in general. I don't know, it's in between us. ****, are we touching them again? Are we doing that thing? What do we, what did we say last? We got, what do we, we did something last week. We threatened him. Don't you **** with us, you piece of ****. Don't remember? Pull each one of these beard hairs out one by one if you on me. How you guys doing? Great. I'm fine, thank you. Good. What a day we've had. Is it has Benedict Dynamite? It feels like it's like 4:30. I, it's 1:50. Like, holy crap. Feels like a lot's been done, but not much has been done. I've done a lot. There's been a lot of email stuff. So many told you about that Patreon thing. You need to do things happen. Do a Patreon thing. Yeah, remember we got to do the little logo, change our logo. Done. See, there you go. That's how things get done at Kinda Funny. I did a podcast having a fire **** potato, man. Yeah, watch on her YouTube",
            "start": 100.04
        },
        {
            "text": "Yeah, remember we got to do the little logo, change our logo. Done. See, there you go. That's how things get done at Kinda Funny. I did a podcast having a fire **** potato, man. Yeah, watch on her YouTube channel, not called Hit or Miss Movies. Nope, Hit or Miss Movies. Branding, branding problems right there. Anyway, she might be coming to the GameOverGreggy Show soon. Yeah, might be. That's a yes, she's coming. She's definitely coming. Thanks for support on Patreon.com/KindaFunny. If you want to support this show, you can go to Patreon.com/KindaFunnyGames, get the show early. Or if you don't want to support the show monetarily, but do want to support it visually, you wise, you can go to YouTube.com/KindaFunnyGames and watch it topic by topic, day by day until the whole episode's distributed on YouTube and MP3 services around the globe. Speaking of that, please go on iTunes and rate, subscribe, do all that stuff. Really would appreciate it. We've been noticing in the top 10, Gamescast has always been there. Now it's",
            "start": 137.92
        },
        {
            "text": "around the globe. Speaking of that, please go on iTunes and rate, subscribe, do all that stuff. Really would appreciate it. We've been noticing in the top 10, Gamescast has always been there. Now it's starting to get bumped to 11. I don't like, I don't like that one bit. This Fireteam Chat. Well, like, suck my dick, Fran. Guess what, Sean Finnegan, Fran, it's on. Sean, I know you're cool. It, yeah, Destin, we're totally fine with it. But the rest of you ****, it's over with. We're coming hard now. It's like you feared Destin. This Destiny train train isn't going to **** be on the tracks forever, if you know what I'm saying. All right, Chuck ****, except you, Destin, you're cool. Yeah. Are we hiring Destin soon? Wait and see. Wait and see. Are we hiring Sean Finnegan? Never. Any day, friend, please come. I'd love to interview you. You're welcome here anytime. What would you hire Fran Mirabella for? Anything. Anything. Wow. Yes. Kevin's personal assistant's been doing a lot of twitching. He could be our Twitch guy. Yes, he could. He could. I hope",
            "start": 183.0
        },
        {
            "text": "here anytime. What would you hire Fran Mirabella for? Anything. Anything. Wow. Yes. Kevin's personal assistant's been doing a lot of twitching. He could be our Twitch guy. Yes, he could. He could. I hope that never happens. Um, guys, what have you been playing recently? Just to start off, get your blood flowing, get getting the getting it percolating. I talked about a little bit on PS I Love You. I went through with the man, the myth, the legend, Po. Went to Chicago this weekend, bought him a PlayStation 4 Slim, housewarming gift, birthday gift, overdue if you ask me. Uh, and then immediately downloaded Overcooked, downloaded my save. We went back at it because you remember when Po was out here visiting for the Weezer concert, we were we were balls deep, as Colin Moriarty would say, in Overcooked and having a great time. We were getting really, really good at it. And then he left and I'm not going to play alone. I didn't want to cheat on him with somebody else. I kept the save in pristine shape. Went to Chicago, downloaded",
            "start": 235.2
        },
        {
            "text": "we were getting really, really good at it. And then he left and I'm not going to play alone. I didn't want to cheat on him with somebody else. I kept the save in pristine shape. Went to Chicago, downloaded there. We played through that, finished the over the the Overcooked campaign there, the co-op campaign. Now I'm short, I think I counted out six or eight uh courses for the perfect three stars. Once I get those, which my boy Colin Moriarty has agreed to help me with, once I get those, I get the gold trophy, 100% Overcooked trophies. Damn, that's what, that's how you do it. I'm excited. Now, Colin, how confident are you in getting these three stars with me? I'm not confident at all because you you you not even confident I'm going to play with you. You've been held down by someone we'll call Aaron. She's been an anchor on you in terms of how how hard, how high you could fly and it Overcooked, because the game brings out visceral anger. And I can imagine, man, it really does. I can, I'm like, I can't, we can't play this together. Like,",
            "start": 278.44
        },
        {
            "text": "in terms of how how hard, how high you could fly and it Overcooked, because the game brings out visceral anger. And I can imagine, man, it really does. I can, I'm like, I can't, we can't play this together. Like, it's it's not fair to her because I'm like, you know, I'm like, she's not good. She's having fun with it. You're trying to get these three stars. That's the kind of fire I needed or something. **** onions. But you haven't been the glacier levels yet with the ice skating and stuff. Tell me, how many how many fish have you fried? What is the fish and chip situation on your dire, dire fish and chip situation? I haven't gotten that far. I know that I don't move on until I get three stars. Your that's your huge blunder. I've done seven or eight stages. Hug. Because I we needed Po and I needed to finish the marathon. We didn't need, we didn't, not to mention you, Po, he's a redhead, could even perfect stage. It's a classic gaming blunder because you you don't move on to the next stage until you're short, like you're your most",
            "start": 321.16
        },
        {
            "text": "didn't need, we didn't, not to mention you, Po, he's a redhead, could even perfect stage. It's a classic gaming blunder because you you don't move on to the next stage until you're short, like you're your most practiced at the stage you're on at the time. Sure. So if you get two stars there, then you should just stay on that stage until you get three stars and you never have to go back to it. You understand? You don't understand. I I just described your anchor. Po is my anchor as well. Po does Po's still playing Assassin's Creed III on PS3. This kid is not ready for Overcooked, you know what I mean? I but I he's what I at the time, that is the Swiss army knife I had. So yeah, I used it to cut off my arm. That's what you do in these situations. But here I am, you an Overcooked talent for sure. You've got a mind for video games. Uh, you're telling me Mari can't assemble a burrito in Overcooked? He can assemble a burrito in Overcooked. I'm not worried about it. What do you do with the tortilla in Overcooked? Nothing. You just",
            "start": 358.84
        },
        {
            "text": "uh, you're telling me Mari can't assemble a burrito in Overcooked? He can assemble a burrito in Overcooked. I'm not worried about it. What do you do with the tortilla in Overcooked? Nothing. You just put it down. Boil some rice, cook the the chicken or the steak in the thing. We go. Why don't they they just the the problem with Overcooked is they're just not efficient enough in the way that they're going about cooking. Like, why is it so complicated? Why did no one ever asks why the kitchen is built in a massive square where no one can pass each other? Moving platforms, ice. Why not cut all the if you're going to if you know you're going to make a lot of mushroom soup, then prepare the mushrooms the night before, that morning of. And then you don't have to run back to the dispensary, you know, to the dispensary. Uh, and get, I don't know if they actually, I don't know if they sell mushrooms at the dispensary. I don't know that that's legal. Uh, anyway, uh, yeah, I I'll I'll be glad to help you when when when if when the",
            "start": 400.28
        },
        {
            "text": "uh, and get, I don't know if they actually, I don't know if they sell mushrooms at the dispensary. I don't know that that's legal. Uh, anyway, uh, yeah, I I'll I'll be glad to help you when when when if when the time comes that I'll actually help you. Came back from my Overcooked hiatus, dominated Overcooked, excited to finish this off soon. Last night, jumped in, did Batman Episode One because I needed to do my save. I've played Episode One, obviously. I I host The Telltale Show. Again, take what I take what the grain of salt, they don't pay me. But I I host The Telltale Show, did Episode One as a crowd play at Comic-Con. Had a good time. Uh, but then I never had my my canonical save, you know what I mean? **** is a crowd play? Crowd play. We we went so Comic-Con sometimes Telltale debut new when Greg does a let's play at of meet and greet. Oh, okay. It's actually a really good, well done there. A few hundred people there watching me do it and they all wanted Bloods. They all wanted Batman to be really mean and really, really",
            "start": 441.2
        },
        {
            "text": "meet and greet. Oh, okay. It's actually a really good, well done there. A few hundred people there watching me do it and they all wanted Bloods. They all wanted Batman to be really mean and really, really angry. And I didn't, that's not my Batman. So I played through last night to set that up. Then I finally played Episode Two of Batman: The Telltale Series. Blown away. I like Telltale Episode One. I enjoyed, obviously. But then replay, replaying any Telltale Game, I'm always like, all right, like, oh, this is what's coming. This, oh, I forgot this part. Okay, blah, blah, blah, blah. There were also, of course, it's a Telltale Game on a console. There were all these like, everybody had an echo at one point. Like, they were talking in a cave. I was like, what the hell's going on? Sound effect was missing on Episode One. I was like, whatever, keep making your games on the same engine. Let good. Episode Two, though, first off, worked well. I didn't have any glitches or anything like that. But then really awesome story, a really great",
            "start": 483.64
        },
        {
            "text": "like whatever, keep making your games on the same engine. Let good. Episode Two, though, first off, worked well. I didn't have any glitches or anything like that. But then really awesome story, a really great fight scene. It see, it's one of those, I think that they hit their stride in Episode Two of what they were trying to do in Episode One. It was shorter than others, but super enjoyable. Awesome choice at the end that like, it was that thing where when I tweeted about like the bar fight was awesome. That's not spoiler, don't worry. Somebody was all crybaby about that last night. Bar fight was awesome. And then it was like, and what a great final choice. Everybody like, all my responses were asking me which I chose. And that I think that's a great sign of like how that's going to shake out. Awesome. Yeah, then I played some Hot Shots Tennis as well last night. We'll talk about that shortly, Greg. But first, I want to talk about something very near and dear to my heart. That's the Nintendo 64. 20th year",
            "start": 519.32
        },
        {
            "text": "Yeah, then I played some Hot Shots Tennis as well last night. We'll talk about that shortly, Greg. But first, I want to talk about something very near and dear to my heart. That's the Nintendo 64. 20th year anniversary a couple days ago here in the United States on that beautiful September 6th, 1996. Can console made its way into our hearts if we lived in America. Came out in Japan June 3rd earlier that year. Now it's one of those consoles where a lot of people have really, really, really fun memories of like Greg Miller. Um, and then there's a lot of people that I think kind of pick on the console a little bit too much where it's fantastic. And comparing it, the fun machine, it was the fun machine. Literally on the box said the fun machine. And like, I think that they kind of gave people what they they said they would. A lot of fun to be had. They the machine for sure. Um, recently because of this anniversary, I've seen a lot of things on the internet, a lot of pictures, a lot of memes. And I'll uh people were",
            "start": 551.4
        },
        {
            "text": "they would. A lot of fun to be had. They the machine for sure. Um, recently because of this anniversary, I've seen a lot of things on the internet, a lot of pictures, a lot of memes. And I'll uh people were posting old advertisements where it was like Toys R Us things of how much it cost. And it's crazy to look at like N64. Like at the the thing I was looking at was like $150. And like, yeah, some of the games were 40, some of the games were like 70. And it's just crazy. There was such a range. And like, that's half the console if you're if you're getting some of the the like the the latest WWE game was like super or WWF was uh expensive. Yeah, but it was worth it. But yeah, so I was kind of looking into it and like reading through NeoGAF and looking at everyone's kind of memories and stuff. Were they haters or were they having fun with it? Oh, they having great fun with it. Uh, but I appreciate them because they kind of tend to talk about the uh more underrated or less talked about games. Like, obviously we know",
            "start": 596.6
        },
        {
            "text": "were they having fun with it? Oh, they having great fun with it. Uh, but I appreciate them because they kind of tend to talk about the uh more underrated or less talked about games. Like, obviously we know about Mario 64 and Ocarina of Time, Majora's Mask, all this stuff. Do we know about Tom Clancy's Rainbow Six? I mean, it was awful. That's the things. Yeah, N64 also known for a lot of question ports of games that were better on other systems due to the limitations of of what it had. But I kind of just wanted to to talk about it for a while. I feel like this might be, depending on how it goes, one topic or two topics. Whoa. Yeah, the you're talk, this could be the bloated fish, as they call it. Be the bloated fish or blowfish, depends on how much you want to be a hater, Greg. I'm not going to be a hater at all. I love my N64. Don't do that at all. No, I mean, N64 starts uh, you know, when I was, I put it on my Christmas list one year early on. Gave the Christmas list to Mom and she said, N64, you've always been a Sega",
            "start": 635.68
        },
        {
            "text": "love my N64. Don't do that at all. No, I mean, N64 starts uh, you know, when I was, I put it on my Christmas list one year early on. Gave the Christmas list to Mom and she said, N64, you've always been a Sega kid. Don't you want that new Sega Saturn? And I said, you're right, Mom. Yeah, I want the Sega Saturn. She bought me a Sega Saturn. Almost drove me out of video games. Uh, and then eventually, yeah, went to high school. And when I went to high school, that was right as uh N64 was really hitting its stride in terms of multiplayer stuff that I would care about, right? Uh, I was just back into wrestling or getting back into wrestling when the Attitude Era was just starting. Uh, and they were had the, you know, WCW vs. NWO game was out. And everybody, nobody would shut up about how amazing this game was. And you'd go play at somebody's house, you're like, holy ****, this is great. And then GoldenEye. And then getting it for whatever Christmas it would have been years later, getting it for a Christmas, having Mario",
            "start": 677.32
        },
        {
            "text": "go play at somebody's house, you're like, holy ****, this is great. And then GoldenEye. And then getting it for whatever Christmas it would have been years later, getting it for a Christmas, having Mario 64. Like, I like that's the one that's like seared in my memory of, you know, a cold Chicago December where it's just bleak and terrible outside and there's snow on the ground out there. It it's snow and I'm **** Mama Penguin losing his baby penguin. You're like, no, I'm talking, but you're with me. No, I'm joking. Yeah, well, no, that's what it was though, is that I remember I those are intrinsically linked, sitting on my bed in my pajamas that I got, probably got for Christmas. Uh, my bed was pushed right up to the window that looked out at our backyard and the snow falling there while I played the snow level or the Arctic level, whatever, in Mario 64. And yeah, sliding down and trying to get all the coins like in the perfect succession, seeing them the Penguins and all that stuff. And that's one of those",
            "start": 714.28
        },
        {
            "text": "level or the Arctic level, whatever, in Mario 64. And yeah, sliding down and trying to get all the coins like in the perfect succession, seeing them the Penguins and all that stuff. And that's one of those memories of like, ****, that's awesome. But then N64 goes on to really, I feel, define my high school experience where I got it early on at the urging of Mike O'Brien. And then that was the thing where we every that solidifies that group of high school friends because I'd been with, you know, Po and all those idiots from, you know, kindergarten through eighth grade. And then you go to high school and you meet new kids and you're looking for that new connection. And for me, it was the N64. It was and, you know, WCW NWO. And then the talk of how amazing WrestleMania 2000 was going to be. And then GoldenEye. And then seeing that Smash Bros. commercial for the first time, like, what is this going to be? Yeah. And getting that game. And then every it was like such a bonding experience for these new friends I had",
            "start": 750.32
        },
        {
            "text": "then seeing that Smash Bros. commercial for the first time, like, what is this going to be? Yeah. And getting that game. And then every it was like such a bonding experience for these new friends I had met in high school where every Friday night, you know, before we had licenses or whatever, school would end and Mike's mom would pick us up and we would drive out there and we would get slices of cck C Nick's pizza for dinner and some Dr. Peppers and go home and play N64 in his basement, watch ECW and then play more. And I would to come home to like Sunday. It was like that really weird thing that I didn't have before because yeah, those there there were those sleepovers, obviously, in junior high or whatever. They like the, you know, big blowouts or whatever. But not like a full weekend long, usually for me. And then not with that degree of independence where it was like, you're in high school, you're, you know, some when especially when people start getting cars, right? I just like call your parents like, I'm",
            "start": 792.48
        },
        {
            "text": "and then not with that degree of independence where it was like, you're in high school, you're, you know, some when especially when people start getting cars, right? I just like call your parents like, I'm not coming home. Don't worry about it. Okay, no big deal, you know what I mean? And we would sit there and just play these games till our eyes bled. And we made a Smash Bros. championship belt. And we were so, so into it. And it was all, I feel, based around that N64. And the fact that it was four player and it was easy to jump into. And I had a blue controller that I carried with me because it was my controller. And that's the one I wanted to use. That's what I wanted to play with. And then even getting to, you know, since it it was the system that I not that I feel like you had to baby other consoles, right? Or whatever. But N64 was this durable **** that I was I would toss in a backpack, right? And like when I was in plays in high school, when we were like, you know, leading up to it and you're there for like",
            "start": 828.6
        },
        {
            "text": "or whatever. But N64 was this durable **** that I was I would toss in a backpack, right? And like when I was in plays in high school, when we were like, you know, leading up to it and you're there for like eight hours after school, bring it there. And then we would take over the Spartan Theater, which was like a, you know, a projector of this size where everybody would just be there. And then the teacher would know to come in and be like, all right, we need these people for the next scene or whatever. You all leave. But we'd be in there and we'd be playing GoldenEye on this giant. Yeah, playing. I mean, that's kind of the thing is like that generation, like there was the Saturn and the unfortunate people that got that. But then there was the PlayStation and the N64. And it really kind of just just splintered between both had amazing games. But the PlayStation was RPGs, which the N64 had none of any real consequence. And uh N64 was multiplayer games. And PlayStation had a couple. I mean, had like Twisted Metal,",
            "start": 865.44
        },
        {
            "text": "both had amazing games. But the PlayStation was RPGs, which the N64 had none of any real consequence. And uh N64 was multiplayer games. And PlayStation had a couple. I mean, had like Twisted Metal, had the F, yeah, Crash Team Racing, things like that. But it, you know, was not known for its multiplayer games. Whereas N64 is like unrivaled. Uh even that goes all the way from Mario Kart and Smash Bros. and the millions of first party games that they made down to like other weird things like Snowboard Kids or um like or the WWE games and stuff like that where it was really just fun, quirky, like the Pokémon Stadium mini games. Like there's so many. Every game was thinking about multiplayer as like a the couch multiplayer experience, which back then was just that's what video games what were, you know. Yeah, I really like N64. Um, you know, it it was it was hard to live alongside uh PS1, I think, for it in some ways. And it certainly played second fiddle to a PS1 for me and a lot of other people. I mean, it was outsold",
            "start": 899.8
        },
        {
            "text": "sold three to one uh globally. So I mean, it's by PS1. So obviously the N64 lost that battle. But um I think that there's a lot of interesting stuff in this genetics that I think are really important um to the way we play games now. Uh and um you know, for for all the things it did wrong or all the weird things that I think it did, the backwards kind of looking things that I think it did, the cartridges for instance, I think were a huge mistake. Um and lost them a lot of support from a lot of third parties. That's why you didn't have role playing games from Square on there. They why would they do that, you know? Um when they can put Final Fantasy VII to their vision on a few discs on, you know, would never fit on a cartridge unless the cartridge had a $500 chip in it or something like that. So and I'm making",
            "start": 945.72
        },
        {
            "text": "know um when they can put Final Fantasy VII to their vision on a few discs on, you know, would never fit on a cartridge unless the cartridge had a $500 chip in it or something like that. So and I'm making that up, I don't know. Um but uh N64 had a great um you know, which I think is in contrasting the PS1. I they had a great first-party ecosystem. We weren't really worried or thinking too much about Sony own games or whatever. We looked at Sony games as things like Spyro and things like uh Crash. But these weren't even made by Sony own studios, nor were they published by Sony. So it's like we ecosystem didn't really exist in the way we know it now until really the PS2 ever started getting going. They had Japan Studio and all these kinds of things and Polyphony making games. But that wasn't really the the the the onus on PS1 as it was on N64. So to me, N64 was a secondary console that I had sitting alongside my PS1 on myself, sh. And when something came along that I wanted to play, I played it on N64. But most",
            "start": 987.64
        },
        {
            "text": "the onus on PS1 as it was on N64 so to me N64 was a secondary console that I had sitting alongside my PS1 on myself sh and when something came along that I wanted to play I played it on N64 but most of my time was spent on PS1 I agree with you guys that the multiplayer aspect of it was really cool and that that was one of the things that really you know when I think about my N64 memories of which I have many um many many of those memories are of playing uh the games we've beaten to death already GoldenEye um you know I've told the story before about how we only had three controllers so the person that lost the match had to use a steering wheel um to play and you got really **** good at playing GoldenEye with a steering wheel and a pedal um and we know we work worked around those kind of limitations um I think the Expansion Pack uh was uh really kind of brilliant I know that some people were were mad about it but the idea that was really a modular console um and I thought that was",
            "start": 1028.44
        },
        {
            "text": "of limitations um I think the Expansion Pack uh was uh really kind of brilliant I know that some people were were mad about it but the idea that was really a modular console um and I thought that was pretty cool too it was frustrating for some people uh my friend in colle or in high school borrowed you know when I was a senior it was like 2000 I wasn't playing N64 anymore um I remember him borrowing my Expansion Pack so he could play Majora's Mask never got it back so thanks for that uh and uh how will you ever play Donkey Kong 64 again never I'll never play Donkey Kong 64 yeah didn't talk about the Zeldas so um yeah so my earliest memory of it apart from playing it in those early days was the anticipation of Quest 64 so to your point about uh roleplaying games PS1 dominated absolutely dominated and is easily easily easily the most dominant PS or JRPG system in existence ever it will never be surpassed it SNES was like the leadup to the PS1 which was just every week man there was",
            "start": 1064.48
        },
        {
            "text": "dominated and is easily easily easily the most dominant PS or JRPG system in existence ever it will never be surpassed it SNES was like the leadup to the PS1 which was just every week man there was something coming out even if even if it was so amazing for someone like me who loved those games um Quest 64 I remember in the summer of God what was it like 97 98 something like that uh we were anticipating this game which ended up being garbage because it was just a role playing game we're like oh we're going to get a playing game on the console and then um really what I remember about it is is um summers at my friend Cory's house who's still a buddy of mine today uh on Long Island he uh play Mario Kart and Mario Party and all these kinds of things and go in the pool or um you know uh we didn't really play wrestling games or anything like that we weren't really into that but um and then the Zeldas I think are really the touchstones I think Ocarina of Time in 98 and then and then Majora's",
            "start": 1108.2
        },
        {
            "text": "really play wrestling games or anything like that we weren't really into that but um and then the Zeldas I think are really the touchstones I think Ocarina of Time in 98 and then and then Majora's Mask which was made very quickly and and put out in 2000 I think are the touchstones and I think Majora's Mask is is if you were to make a top 5 list of games I think it's one of the best games of all time um and I I I really kind of just in a nostalgic way kind of tie that console to some really great memories both single player and multiplayer but really the friends I had a pretty I think I think people overblow N64's catalog of great games I don't think it has an amazing like this a huge group of amazing games I think it has a really good core group of games that that's stuck that's stuck and that are really important to gaming um but also the N64 hardware itself having for controller ports I think was really cool something they tried to start doing with the multitap on SNES so they",
            "start": 1154.96
        },
        {
            "text": "and that are really important to gaming um but also the N64 hardware itself having for controller ports I think was really cool something they tried to start doing with the multitap on SNES so they understood what the what the console was made for this also sells more peripherals and all that kind of stuff the Rumble Pak I think is really important the way you held the controller uh the use of something that is not a D-pad was really kind of foreign to everyone um unless you're playing analog stick in general like yeah I mean I'm saying unless you were what I was going to say is unless you were using like these weird quirky PC controllers and stuff that might have to you because I had one of those but um and I don't know why because I was playing like Yoda Stories or something but uh but you know I remember getting the N64 like holding N64 for the first time and being like why don't you hold it like this and I hated the N64 controller I think it sucks but there's a lot of interesting things",
            "start": 1191.0
        },
        {
            "text": "I remember getting the N64 like holding N64 for the first time and being like why don't you hold it like this and I hated the N64 controller I think it sucks but there's a lot of interesting things in the genetics of that controller that I think are very important for radio including the Rumble and including the analog stick so um we and we owe them a great kind of debt for this console um and I think it's well remembered for a good reason I just think that you know the PS1 obviously you know frankly shits on it um but that's from a game that's from a dirt like just an incredible catalog of games there are many many many many many more great games on on PS1 than they're on are are on N64 but I think when you put them next to each other they were great compliments to each other and I don't think you could have a really full experience without having them both from 96 to 2000 or so I don't think you could have this amazing experience without really playing both of them yeah I think that",
            "start": 1225.16
        },
        {
            "text": "think you could have a really full experience without having them both from 96 to 2000 or so I don't think you could have this amazing experience without really playing both of them yeah I think that was really cool they had their exclusives they had they really did have unlike today where you have a few big on they really were big exclusives on both of them",
            "start": 1266.56
        }
    ]
}