{
    "id": 2133,
    "video_id": "mFRwpuEIicM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What's Matt Scarpino Up To? - The GameOverGreggy Show Ep. 151 (Pt. 2)",
    "description": "Matt Scarpino tells us about MIdlife Ballers.\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1477378802,
    "duration": 1695,
    "transcript_chunks": [
        {
            "text": "Hey Tim, hey Greg, what's Video Blocks? Video Blocks is awesome. It's stock footage. See it here. W it's a eag that was in Colin's intro in a Kinda Funny Live One. I used Video Blocks extensively in Kinda Funny Live One and Two and Two. But no one would know if you used Kinda Funny Live. This was one, this was in the intro to one. I've before, but anyways, Video Blocks is awesome. And in addition of video, there's also audio stuff, there's graphics stuff. If you're a nerd like me that edits a lot of videos or you you're just like looking at cool pretty vistas, yeah, here they are. You know, you Video Blocks is an affordable subscription-based stock media site that gives you unlimited access to premium stock footage. This is what you use. You're a longtime customer. How long you been a customer roughly? Uh, I don't know, a couple years. I think they've only been around a couple years. There's a monkey, he's dancing around telling jokes. Wow, okay. They have a library of over 115,000 video clips, After Effects templates.",
            "start": 0.12
        },
        {
            "text": "know a couple years. I think they've only been around a couple years. There's a monkey, he's dancing around telling jokes. Wow, okay. They have a library of over 115,000 video clips, After Effects templates, motion backgrounds and more. Video Blocks is offering our fans a year subscription for only $99. This is a $50 discount off the usual price tag for our listeners and viewers only. That's less than $10 a month, Tim. That's how math works. If you want to get it, get your yearly subscription today for only $99 at videoblocks.com/greggy. That's Video Blocks, V.I.D.E.O.B.L.O.C.K.S.com/greggy for this discount. Give one of them pullbacks. Greg. Matt, what's your topic? Oh, I'm sorry. Wow, that's a lot. Yeah, it's heavy. It's amazing though, 'cause when I listen to it on the r, I'm so excited 'cause I love you. Thank you. No, I mean it, 'cause it's just education and interest and you also it's so quick too. I don't think that fast. I never think that fast. So this is I love it. Thank you very much. No, it was, um, well researched.",
            "start": 36.96
        },
        {
            "text": "I mean it, 'cause it's just education and interest and you also it's so quick too. I don't think that fast. I never think that fast. So this is I love it. Thank you very much. No, it was, um, well researched. Uh, did I have a top? I don't know what you I did have a topic. Well, you invited me back to I mean, it's not as serious as no, I no, that's why we break it up that way. Thank God. Yeah, no, I mean, 'cause this is I I just I feel guilty now that I don't know enough. So now I have to go you got to go learn. I got in a class, I think. Yeah, apparently we after Google think you could call her and just after we stretch and get all that gas out, we can like vote correctly. Yeah, because I I just don't want to be I don't want to make the wrong opinions on the election. Oh, I bet she does right after her almond. You want to tell mix stories? You want to talk about Midlife Ballers? I mean, I was excited, uh, when I forced Nick to have me on the show, uh, today for come on, Kevin, get it together. 45 **** minutes. He's over here like amazing.",
            "start": 103.96
        },
        {
            "text": "mix stories. You want to talk about Midlife Ballers? I mean, I was excited, uh, when I forced Nick to have me on the show, uh, today for come on, Kevin, get it together. 45 **** minutes. He's over here like amazing monologue. I start talking, you drop your keys. Was a fine monologue. It was a yeah, 45 minutes. I mean, there's a timer right there. No, I didn't I wasn't correcting you on the time. Oh, I'm I apologize. Saying it was fine. So when did I come on the show last? I know it's horrible. Like it's like still in the spare bedroom. It was a long time ago. Yeah, that was the last time. I think it was earlier this year. Yes. So when in in that it was yeah, it was uh, I don't know, 10, 11 months 'cause we August something. Yeah, somewhere in there. And uh, it was an idea. This this show was an idea, Midlife Ballers. And so I was excited to come back and tell you how things are going. How's it going? How so Midlife Ballers in a nutshell, you're ripping off our formula. It's a podcast. Podcast. Actually, we started doing that. We started.",
            "start": 151.44
        },
        {
            "text": "to come back and tell you how things are going. How's it going? How so Midlife Ballers in a nutshell, you're ripping off our formula. It's a podcast. Podcast. Actually, we started doing that. We started ripping it off and went, there's no **** way we can do this much ****. Like, you know, Chris and I, producer Chris is actually here for those of you that give a ****. Chris, he's in the back. Um, yeah, he doesn't have a fancy microphone like Kevin, but he does throw it down when it's time. But it's super fun, uh, and it's really hard to be an adult to have adult responsibilities. Like Jason has kids and he's always getting new jobs. Like last night he texted me and said, I think I'm the general manager of the restaurant now. And I went, how did that happen? Weren't you just like a bar manager? And he said, no, I'll tell you later. And um, so his schedule constantly changes and just trying to get the show together. But we figured out how to make it better for us if that makes sense. And then uh, we decided to maybe.",
            "start": 194.0
        },
        {
            "text": "tell you later. And um, so his schedule constantly changes and just trying to get the show together. But we figured out how to make it better for us if that makes sense. And then uh, we decided to maybe try Patreon. So let's check it out then. So Midlife Ballers YouTube channel podcast you're making. Yes. You started off, you wanted it to be weekly. It is still weekly. Is it really? 'Cause I remember when episode one went up, there was a long s like it wasn't going up that often. The pilot, just the pilot. Did you get did you get an official set? You still have the concrete wall? We had two videos that came up okay to like say this is coming. And then once we started, it was 30. We're episode 38. So it was 38 weeks ago. We've shot some doubles, which I don't like doing where you like do two episodes in the same day because by the end of it, I'm just like, I mean it, I can't I I like it to be sympathize fresh. No, I know you guys and I appreciate that. And also like I could, you know, love and sex stuff is kind of like that.",
            "start": 234.88
        },
        {
            "text": "by the end of it, I'm just like, I mean it, I can't I I like it to be sympathize fresh. No, I know you guys and I appreciate that. And also like I could, you know, love and sex stuff is kind of like that where you would want to be more efficient. But it's actually better if we don't let Jason talk that much or me. 'Cause then at the end of it, Chris will start making faces at me and I'll go, man, I need another Red Bull. 'Cause this is like, I can't I'm not funny. I can't do another beatbox. I can't do anything. But it's better to do and it's exciting 'cause you know, he fights the traffic and we have to clear our schedules. And then we get there and even Chris two episodes ago, um, something happened where he was **** crazy angry. It was like a client or something. Something went bad. Somebody **** something up. And by the middle of the episode, he was laughing and it was like he was relaxed. And then he was throwing us stuff that we could talk about. It was so it's it's more therapeutic and it's fun for us. But then.",
            "start": 273.92
        },
        {
            "text": "the middle of the episode, he was laughing and it was like he was relaxed. And then he was throwing us stuff that we could talk about. It was so it's it's more therapeutic and it's fun for us. But then, you know, a lot of people are like, hey, we would love to support you on Patreon. When's that going to happen? And is like, why don't we just try it? And I was like, well, because if you look at the Bible of online content written by Kinda Funny and Tim Gettys, we're not supposed to launch that. And he's like, **** that. Let's let's just do it. Let's just do let's do us and figure out. No, I didn't say ****. Well, that sounds like I I literally went around him because we don't have I would have told you to do that day one. Why not? No, well, I mean, 'cause I well, I'm I'm a little more conservative because I want to see where it's going. And then and then ultimately I wanted more. And Chris goes, no, no, no, no, no, let's just let's just do the podcast. Let's just get this together and get it right. And so far we have.",
            "start": 314.32
        },
        {
            "text": "to see where it's going. And then and then ultimately I wanted more. And Chris goes, no, no, no, no, no, let's just let's just do the podcast. Let's just get this together and get it right. And so far we have like we hit our NE we have a little the tier system and and uh people are starting to donate a little bit. Wait, hold on. So the Patreon is live. Yeah, it launched a week and a half ago, two weeks ago. Now you got Tim mad because you missed you launched the Patreon without talking to me about the launch of the Patreon. Bad news. You missed B. I didn't read all of the book. Yeah, no, looks like you didn't even get it from the library. P. Page one on Tim's book is always talk to Tim Gettys. Okay, here's the thing though. Never anyone to we okay, so it it yes, it launched and we were excited. And honestly, you guys are so busy. Dude, I got the Patreon spiel down to a science now. Do you know how many launches we've helped at this point? All all of them. Every single Patreon that exist. What are we doing? What are we doing right?",
            "start": 353.08
        },
        {
            "text": "busy. Dude, I got the Patreon spiel down to a science now. Do you know how many launches we've helped at this point? All all of them. Every single Patreon that exist. What are we doing? What are we doing right? Well, this is what I'm saying. That's why I want that's why we wanted to try it and make sure that it was all working and everything was organized. So now that it's up, it's only been a week and a half. And this episode's going to drop when it drops. And then we haven't even done like the exclusive stuff. I mean, we literally just got one guy that gave us a tier where I have to now like give him 'cause one of our tiers is I do live beatboxing for them so they can have a I know, right? And I like and uh, and so I have to come up with like it's a limited. Thank God. 'Cause I think producer Chris was like, no, no, if people give us like 10 bucks a month, you got a beatbox. And I was like, that's not happening because I'm not going to just spend all day just, you know, ticking and drooling on a microphone. We need to.",
            "start": 397.44
        },
        {
            "text": "if people give us like 10 bucks a month, you got a beatbox. And I was like, that's not happening because I'm not going to just spend all day just, you know, ticking and drooling on a microphone. We need to make it maybe give me a motivation for that. And then do I is it like a ringtone? Anyway, so we had fun coming up with all give me some beatbox right now. A sample. Um, well, normally when I open the show, Colin gave you 10 bucks. It's not 10 bucks. Give give you whatever the hell ****. Can you hear this, Kevin? Uh, okay, so earlier I thought you might want that. And so I was like, what would I do if I was sitting next to Colin? And so I popped on Spotify and got a little 311 in my ear. And it was like, yeah, yeah, that's my light one too. That's like fantastic. I love you so much. So that was for you 'cause I missed you from last time. I appreciate that. Yeah, Chris was 'cause we we were sharing a room. So I was like in the shower listening to as many 311 as I could to get like what if they asked me to be I got.",
            "start": 436.12
        },
        {
            "text": "missed you from last time. I appreciate that. Yeah, Chris was 'cause we we were sharing a room. So I was like in the shower listening to as many 311 as I could to get like what if they asked me to be I got to I got to do it for my boy 'cause he's probably going to rant 55 minutes about politics. And I don't vote. So this is going to be a **** horrible conversation. I didn't mean to alienate you with the first. No, you didn't alienate me. But like I was so in like I just want I want to vote for you 'cause I want to see. Yeah, we all want to vote for fix it or really break it. Either way, it'd be going to kill somebody with that wrist right there. Why wouldn't you want to vote for me? What did I do? Are Dark Knight? I don't know. I just feel we can't lose you. Yeah, I don't know. Me and you I think agree on a lot of things. You're not the president I would vote for. To be fair, no one at this table is someone that I would be still president. I'm just saying, Nick, you wouldn't even show up. Like awesome president. Like wake me.",
            "start": 497.48
        },
        {
            "text": "you're not the president I would vote for. To be fair, no one at this table is someone that I would be still president. I'm just saying, Nick, you wouldn't even show up. Like awesome president. Like wake me up at noon. You would kill yourself. Give me a list of **** that you need. Yes, assassinate himself. No, he would just under the stress. He would just they find him his office. No, there would be **** thrown out of the Oval. Like was just flying. And then there'd be a little guy with like a cool qua. And he's like, God damn it, Steven. Maybe maybe his assistant. Now, are you talking about Mel Gibson over there? Yeah, it's like me Gibson. I asked him where you know Mato was. Yeah, right. ****. He is not too old for this **** on that light board. Okay, I I I want him to keep growing it out until he can actually legit whatever that is. A little switchy switch that you don't don't use. Anyways, yeah, so can we do the show? Yeah, no, this is what I was going to ask you. Is this a taste of Midlife Ballers? What is when I.",
            "start": 531.92
        },
        {
            "text": "legit whatever that is. A little switchy switch that you don't don't use. Anyways, yeah, so can we do the show? Yeah, no, this is what I was going to ask you. Is this a taste of Midlife Ballers? What is when I beatbox? No, this what everything that just happened. What what is Midlife Ballers? You still haven't sold it to the kids. You haven't told them what they're getting into. We should give them a taste of Midlife Ballers. Um, I mean, Midlife Ballers is what it needs to be at that moment for us. Jesus God, what the **** does that? It's the Batman of podcast. Don't help him. Don't it is. I have to I sort of invited him on the show. So I feel obligated. I feel like when I was like, hey, what can I be on the show? And you were like, hold on, I have to call Greg. Yeah, it's Greg's show. Okay, Greg just got back to me. Yes, you're allowed in the building. You're funny. I I don't book people. I don't book guas on other people's shows. Okay, I don't book ass period. I don't I I still don't know like he came back from Morocco and.",
            "start": 572.2
        },
        {
            "text": "allowed in the building. You're funny. I I don't book people. I don't book guas on other people's shows. Okay, I don't book ass period. I don't I I still don't know like he came back from Morocco and was like, I'm walking my dogs and I'm talking to him. And he's like, yeah, this and that. And I go, yeah, on the Patreon channel is doing well. And I goes, hold up. Wait, you on Patreon? And I was like, yeah, you were out of town. Well, I would have expected for you to have waited for me to come back in town and then coordinate. I thought about all that. We could have helped you on the launch and push more people toward you know, 'cause we believe in you. But we're doing that now. No, I mean, you're making me question it. We kind of want decisions. What do you mean questioning my decisions? If he's he's questioning if he backs you. Here's what I need Tim for for Matt, Midlife Ballers and everyone watching. Top three Patreon tips. Top three Patreon tips. Uh, Chris is taking notes. Make your most valuable thing your cheapest thing.",
            "start": 609.04
        },
        {
            "text": "you. Here's what I need Tim for for Matt, Midlife Ballers and everyone watching. Top three Patreon tips. Top three Patreon tips. Uh, Chris is taking notes. Make your most valuable thing your cheapest thing. So whatever at a dollar, the entryway, the gateway drug into the Patreon should be the most our bonus episode. I think our bonus episodes of the shows are our most valuable thing. Sure. Okay, so you do that. Um, second off, don't have too many tiers. Make sure that it's all M. We have you want to focus on you never even looked at your Patreon. The to one tier, it's $1,500. The $1 to $15 tiers are the most important. Okay, and those should all be content focused. Should all be about they should all be based on stuff you're already doing. Correct. That's what we're doing. Good. Great. Okay, so you're do doing exclusive. It's early stuff, early videos, early audio, early goodness. And then I don't know. I mean, then we came up with some fun options that people want. And so far we've gotten, you know, like the other day I got a I.",
            "start": 645.44
        },
        {
            "text": "early stuff, early videos, early audio, early goodness. And then I don't know. I mean, then we came up with some fun options that people want. And so far we've gotten, you know, like the other day I got a I got a $100 a month subscriber. That's and uh, he is going to get all kinds of cool stuff including the beatbox. So I have to come up with some I like the making it up as you go $100 tier cool stuff. You know, we'll figure it out. No, no, no, I mean, I mean, I got to give uh, producer Chris credit. I mean, like we really kind of spent a couple weeks going back and he did a lot of research. Also, like we shot a little video intro video and we were very specific and we did a whole night of sh. There's a lot of footage of me running around half an like at one point we were a little drunk and there's we Jason and I are in like robes. And of course, then I talked and I was like, we she break fat person. Like I was like, really? And he's like, we can't use that. And I was like, just keep it in the can just in case that.",
            "start": 696.36
        },
        {
            "text": "I are in like robes. And of course, then I talked and I was like, we she break fat person. Like I was like, really? And he's like, we can't use that. And I was like, just keep it in the can just in case that podcast and saying it that. Yeah, no, no, no, I meant the the video of me running around tucked. You totally could. You just blur you Mosaic out that. I mean, I know he knows how to do it. But no, there's no shoke. I was like, let's not do that. Let me lose a little bit of weight. And remember also, we were coming out 'cause I I'm eight weeks after my surgery. So I just had my I just had hernia fixed. Yeah, I just I'm hernia. Yeah, what happened? Hern. I uh, actually I was sitting on the toilet and I sneezed. Is that true? Mhm. Wow. Ripped up. The universe works in unusual. Literally, literally. I had been I had been lifting a lot. My wife said, let's move to Northridge. And then let's move back. But we hadn't moved back yet. And so I was moving a lot of boxes. And I and I'm like going back and forth. And I'm lifting. And I'm gaining.",
            "start": 737.48
        },
        {
            "text": "my wife said, let's move to Northridge. And then let's move back. But we hadn't moved back yet. And so I was moving a lot of boxes. And I and I'm like going back and forth. And I'm lifting. And I'm gaining weight because it's fun. And then all of a sudden, I had this I had a cough 'cause I have bronchitis. And sometimes I I sat down pooping. I was well, of course, I poop. I poop like I mean, it's like like five, six times before noon. So I was on the toilet in the guest bathroom. And I was about 'cause you're blowing it up. Uh, if you really must know, because in our 1940s house, if I **** in the main bathroom, they re after the earthquake in Northridge, they redid the plumbing. And there are two 90-degree turns. And the guy from the plumbing company said that toilet's always going to have issues if you're **** loading it up with butt wipes and man turds. And so I was like, then then that's **** horrible. So where can I ****? He's like, **** in that toilet 'cause it's a straight run to the to the street. And used to piss my.",
            "start": 782.28
        },
        {
            "text": "with butt wipes and man turds. And so I was like, then then that's **** horrible. So where can I ****? He's like, **** in that toilet 'cause it's a straight run to the to the street. And used to piss my wife off. She's like, why are you **** in the guest bathroom? And I was like, a, because there's a window. And B, because I need of all my travels, he was the most human. Like I just shot that ****. I just shot him right out. Put into space. Yeah, yeah, God. So but that was the truth 'cause form follows function. So I was like, this is my toilet. And so uh, yeah, I was just sitting there. And I was like, like that. And it just went just popped out of my belly button. And then after after dial back 'cause I I had a hernia as a baby. I don't remember. I tried to lift my mom. I imagine what is a hernia in what did it pop? Is it intense pain immediately? Is it no, not at all. It it literally happened. And then I was 'cause you know, in some of those moments, uh, it's better if I don't wear a shirt. Of course. Oh, oh, I know. I overheat.",
            "start": 823.16
        },
        {
            "text": "it intense pain immediately? Is it no, not at all. It it literally happened. And then I was 'cause you know, in some of those moments, uh, it's better if I don't wear a shirt. Of course. Oh, oh, I know. I overheat when I poop. Some get naked. If I can get naked, I get naked. That's no, this is what like what three, four episodes ago, we covered The Squatty Potty, which I've got some on order because we're going to test that and do a market research on it. 'Cause I I hit the block. The I I tried it with my wife. She has a little stool to get up to her closet. And and almost fell. Anyways, it's it's was too high. It needs to be lower. And I'm also fatter now. So I can't really roll like those those drawings don't do angled this way a little bit. It's just 14. You need 14 inches. Or there are women and men that can stand on the top of the toilet. That is not me. Or you can go out and just **** in the woods. I felt like just get out there and **** in the woods. Wait, what? Stand on top of the toilet? Yeah, that's if you've seen.",
            "start": 869.8
        },
        {
            "text": "top of the toilet. That is not me. Or you can go out and just **** in the woods. I felt like just get out there and **** in the woods. Wait, what? Stand on top of the toilet? Yeah, that's if you've seen these these EP. There are there are like sketch bits online. I researched it where people are perched on the top of their toilet. Like I'm not even that's not a joke. I non I was listening to Daniel Tosh the other day on I think it was Spotify. And he has a great joke about how you he's like, did you know you could sit the other way on the toilet? Oh, yeah. And he eats spaghetti. And yeah, yeah, he goes, hold on, hold on a minute. That's great. Yeah, that's a that's a funny sketch. I don't actually sit that way. But um, no, I no one says that way. That's why. No, I mean, I but you can you have to take your pants off all the way. But yeah, I had my shirt off and I sneezed. And then I looked down and there was like a little like nubbin sticking out of where I used to have a belly button. So what don't like this story? Why?",
            "start": 909.4
        },
        {
            "text": "the way. But yeah, I had my shirt off and I sneezed. And then I looked down and there was like a little like nubbin sticking out of where I used to have a belly button. So what don't like this story? Why? No, but for Tim's own visual picture, how deep is your belly button? 'Cause something could pop out of my belly button. I I would not. Well, first of all, it was right above the belly butt. So essentially what happens in an umbilical hernia is you get a little tear. And then a little tiny skin pops out. It's not at one point somebody's like, oh, your intestines. No, your intestine is not going to pop out of a little tear. But after a year and a half of working, it ripped to two fingers. So then I had a little bit more mushrooming. So the guy's like, we might want to fix this. And I was like, let's **** rock this. So weeks ago. No, no, you a couple incredibly fun parts where you could get drunk and then make me push it back in. Oh, that's the other thing. So the guy forgot than he grab like, I don't want to do this. The.",
            "start": 949.2
        },
        {
            "text": "weeks ago. No, no, you a couple incredibly fun parts where you could get drunk and then make me push it back in. Oh, that's the other thing. So the guy forgot than he grab like, I don't want to do this. The doctor, the first doctor that I saw at Kaiser in Woodland Hills, who was this guy on his cell phone, young kid. And they were like, you got to see the specialist because he's like like the ER doc from like, you know, whatever Saudi Arabia or something. No, he he was like a battlefield tech like in the military. And then he came back. So he's like super young and has this cool technique. So he's on his phone. And he's like, oh, let me see. Uh, and for those of you watching, I'm touching Colin's belly. He said, yeah, it's umbilical. Okay, let me try. And then he popped it back in. And it made a little sound in my ears. And I was like, whoa, sourness in my tummy. And he's like, cool, just keep pushing it back in. And we'll figure it out. Eventually, you should lose some weight and and and and uh, and don't sneeze. And then and you get it.",
            "start": 987.76
        },
        {
            "text": "I was like, whoa, sourness in my tummy. And he's like, cool, just keep pushing it back in. And we'll figure it out. Eventually, you should lose some weight and and and and uh, and don't sneeze. And then and you get it back in. And then we're good. No, I'm not even kidding about that. And so he pushed it. He pushed it back in. I was like, great. So I'll just do that. And then it got worse. And then I Then I then we get to the point where I couldn't push it back in. And so I have to lay down and rest and ice it and push it back. There's all in a book that you can you can read. You can research online to manage book similar to Tim's Patreon book. Yeah, I jumped to the end. And it just said, don't get a. Anyway, so I got the surgery. The amazing part about this is he gets the surgery. And I was like, oh, let me see the scars, right? And he lifts up his shirt. And I'm like, this is interesting because for the first time, I **** you not, in probably 0 years, Matt has chest hair now because he can't shave. Nope. This area because the.",
            "start": 1030.28
        },
        {
            "text": "and he lifts up his shirt and I'm like this is interesting because For the First Time I **** you not in probably ten years Matt has chest hair now because he can't shave nope this area because the scars are too new I guess I assume I chose not to shave when I was with you on Sunday when we were watching the show but I have since remedied that oh it's your bald again yeah but I just trim it I can't stand here we're not going to look at it online it's disgusting I need cuz I'll block the camera I want to see the scar let me block the camera Kevin only keep it on the wide go why doesn't he block the camera and Flash all of you guys why don't you take your pants off right now all right go ahead show show me the scar here uh I can't even do no it's not they're laparoscopic scars super tiny and then well they were bigger before and then there's I got a dimple here and there was four dots around them cuz that's how they put the mesh in okay okay so they like mesh that's not bad at all no no no",
            "start": 1068.6
        },
        {
            "text": "well they were bigger before and then there's I got a dimple here and there was four dots around them cuz that's how they put the mesh in okay okay so they like mesh that's not bad at all no no no it was the way it's the way to get it repaired cuz there's no external scar way to do it like if you're going to have it problem you don't want to have a cut because then the Stitch won't cuz they stitched internally and then cauterized and did all this cool **** but the fun thing was when I was going in cuz they gave me the joy juice right I know anti-anxiety and then the med and she was hot like she this the anesthetist the yeah anesthesiologist anesthesiologist was a pregnant woman so I was like I hope you're hope that's going to stay in there doc but I get in there and I'm like loopy I'm loopy and so I'm like hey thinking Tim Gettys' Playbook right what am I going to do I get into the surgical unit and I said and I was like Hey so do you guys record this surgery on video and",
            "start": 1109.08
        },
        {
            "text": "I'm loopy and so I'm like hey thinking Tim Gettys' Playbook right what am I going to do I get into the surgical unit and I said and I was like Hey so do you guys record this surgery on video and they were like yeah we do and I was like cool so I have this podcast called Midlife Ballers and it would be awesome if I could have a copy of it and you know what they said is that for work and I was like yeah it's for work and they were like no but we'll give you photos and I was like I'll take those I can put those on my show too so I got so my wife sitting next to me and the nurse comes up two hours later goes oh here are those photos you requested and it literally she was like are you **** nuts and I was like I have no idea what I I I guess yes you're a content creator cuz I want cuz in my mind I was like Chris will cut this in where they shoot the video where it's going into my belly and blowing it up and we can do a react to my video I mean it was all in my head but they wouldn't release",
            "start": 1149.16
        },
        {
            "text": "I was like Chris will cut this in where they shoot the video where it's going into my belly and blowing it up and we can do a react to my video I mean it was all in my head but they wouldn't release it for legal reasons **** Kaiser I know it was awesome and it was 45 minutes we need to go in there and sneak in there and get it it's probably on F those drugs are the best huh I've been under those drugs a few times I literally I I was sometimes when you're having surgery the best looking at the looking at the clock I counted backwards from five I was like oh I'm stoned done and then you woke up done yeah out of my mind but you know when I had the surgery the **** launch of the studio yeah he was having a that's why I couldn't come the very day that's when I saw your little exclusive thing you walking around like I can't go and there's a bar bartend then then he was on these incredible pain medications and called me every 15 minutes cuz he forgot that he called me already oh you want to",
            "start": 1193.32
        },
        {
            "text": "walking around like I can't go and there's a bar bartend then then he was on these incredible pain medications and called me every 15 minutes cuz he forgot that he called me already oh you want to talk about constipation too that **** pain meds I was on holy shit I hate that **** I won't do it four days and the other problem is anything in your abs here like I couldn't I didn't want to even like blow my nose it hurt so bad there was so much pain and so I was like I don't know I'm going sh **** when it's time and I just I just I **** worked **** man well not really I mean it was really painful to go back to what you were saying week ago whenever you were saying about poop poops painful poops painful poops Tim are you ready for any of this cuz I feel like these are all hurdles you've never had to go over in your life any kind of surgery any poop pains all this stuff stuff oh I've I've had poop pain my entire life I've had constipation problems since day one cuz you're too tense I was",
            "start": 1230.96
        },
        {
            "text": "had to go over in your life any kind of surgery any poop pains all this stuff stuff oh I've I've had poop pain my entire life I've had constipation problems since day one cuz you're too tense I was going to say he isn't he carries it all he's nervy I I can think I can with this stuff what I can't there's certain things in my life like you know people have like issues I can't deal with like eye stuff like needles and eyes scary movies I'm like nah that needles in general like something about like veins just I don't like the idea of veins well you can't get a surgery then like whether it's cuz they stab you all especially the woman that put my my central line in she couldn't get it she's like that vein's got a 90° angle I got to go to the other hand and she pulled it out and it spattered everywhere and I was like hey I have good let's be **** Pro about that and she's like I'm sorry and then stabbed this **** hand and I was like okay so we're done then I had to pee like Nick Scarpino in",
            "start": 1273.16
        },
        {
            "text": "and I was like hey I have good let's be **** Pro about that and she's like I'm sorry and then stabbed this **** hand and I was like okay so we're done then I had to pee like Nick Scarpino in the middle of an episode and I was like **** what am I going to do and she's like oh you can pee we just have to walk behind you with all the **** so then I was like with those **** yeah I was just like and then I get in the bathroom they have all these Hooks and I sit on the toilet I'm like now what am I going to do cuz now I can't reach the stuff to unhook it so then I had to call her back in and it was I mean I've told the story on the show before but that happened to me and there was one time I was like dehydrated or some **** so I had to go to the **** ER and uh they're like I don't remember this story was I prob I don't know they rehydrated me like with the whole IV thing I had to go pee eventually I was there for hours that's good though and uh they're like oh cool great go",
            "start": 1314.68
        },
        {
            "text": "remember this story was I prob I don't know they rehydrated me like with the whole IV thing I had to go pee eventually I was there for hours that's good though and uh they're like oh cool great go to the bathroom so I go to the bathroom and I pee it all out and I faint mid piss and then they're like next thing I know I wake up and I'm like back in the bed I'm like what the **** and they're like you straight up passed out in the bathroom did you pee on yourself everywhere yeah you pissed on yourself how did you get so dehydrated I don't it was probably drank like 10 100 thousand sodas in **** Kevin you had to be there what happened I don't remember thanks I was young having tell me everything about **** milking this cat his best friend brother I wasn't there his beloved yeah it was bad though but I do that was it was the only time in my life I've ever like blacked out like I've ever had a moment where there's something that happened I'm like I don't know what that that was like",
            "start": 1347.52
        },
        {
            "text": "bad though but I do that was it was the only time in my life I've ever like blacked out like I've ever had a moment where there's something that happened I'm like I don't know what that that was like cuz I was just back I'm like I was peeing a second ago and she was like it was a while ago and you were peeing everywhere so did they just find you and I mean your captain which is a fire yeah I was going to say in my mind it's like Backdraft and then you're just sitting there like that's my brother you go just grabbing his dick trying to get you like Kevin's trying to get on top of Tim's dick trying to put it it's a fire hose these are some deep deep Backdraft quotes it just popped into my all I remember from Backdraft is when they had sex on top of the fire hose and he brought down like and then uh Donald Sutherland when he's like all creepy and Everything Burns or something burn them all but I I'm okay with like the pain I'm okay with the idea I'm okay with shots even it's just that",
            "start": 1389.4
        },
        {
            "text": "then uh Donald Sutherland when he's like all creepy and Everything Burns or something burn them all but I I'm okay with like the pain I'm okay with the idea I'm okay with shots even it's just that when I like when I know that it's going into my vein thinking about that or seeing it it's just like **** that if they were just to pop me in the back or some **** I'd be like whatever go for it like I can take that but the idea of the veins like even looking at them just it just bothers me I really like it and in addition to that belly buttons there's something about belly buttons umbilical cords like this whole idea it really creeps me out and I'm just super not into it so this this whole thing very very Troublesome to me popping out you having to pop it back in it's like this is only body worse is if it was Kevin if it was Kevin's body and I knew that these things were happening to Kevin So Soft oh my God why would that be worse cuz he you would fear or why is there fear I would fear",
            "start": 1431.8
        },
        {
            "text": "worse is if it was Kevin if it was Kevin's body and I knew that these things were happening to Kevin So Soft oh my God why would that be worse cuz he you would fear or why is there fear I would fear it because he does like my body you know how you made him poke things yeah Kevin no I mean that was recently like and and Nick wanted to even though he said no I knew wanted to in his **** Heart of Heart now he's got like plates and **** it's **** DuPont it's a mesh and I can't do anything with it cuz the guy's like if you break this one you it's bad and you he said a healthy 40-year-old takes years to grow the tissue into the mesh yeah so and I was like **** what is that three four years for me cuz I'm just yeah it's horrible but it's getting getting to the point now are you restricted can you move can you lift no I'm good now I'm good now um there are internal stitches that sometimes still poke weird and then um I can lift now up to 50 lb okay and in about another couple of",
            "start": 1474.0
        },
        {
            "text": "can you move can you lift no I'm good now I'm good now um there are internal stitches that sometimes still poke weird and then um I can lift now up to 50 lb okay and in about another couple of months I can maybe mountain bike he said a year but I'm going to try to where is that on your scale of worries Matt well my producer mountain bikes every day and wants me to go with him and that's how I lost all my weight the first time cuz I'm jovial right now Tim I don't know if you know like I'm the biggest I've ever been which is exciting but um I'd like to be able to tie my shoe without holding my breath so you know or or slip-ons just throwing that at you know what I I'll go back to slip I got my thongs I got Myers my flaps those flops Yeah Boy And my and my comfortable shorts from Target oh you love shorts and my and then I used to wear those button-up shirts and one of my one of my guys on a crew once was like nice blouse and I'm like okay I'm not going to wear that again but I have so",
            "start": 1520.88
        },
        {
            "text": "you love shorts and my and then I used to wear those button-up shirts and one of my one of my guys on a crew once was like nice blouse and I'm like okay I'm not going to wear that again but I have so many of them so I have wear them you I have to because then I can unbutton like card I can just like pop it open and I'm now cool cuz one three buttons it's the three button no no no no it's the he knows it's the work ones I wore him to put this studio together look at your video I have one on in the video about it all right no I know I just wish I looked better but I'll work on it you look great well I'm excited yeah I'm excited to be here okay these nice cameras I look good on the camera you look great on the camera that was a sample of Midlife Ballers go to their YouTube channel or Patreon for all that Patreon for Midlife Ballers it better be patreon.com midlife Ballers it is okay good no hyphens no dashes no backlashes underscore Scarpino Tim what's your topic before we even get to",
            "start": 1567.12
        },
        {
            "text": "for all that Patreon for Midlife Ballers it better be patreon.com midlife Ballers it is okay good no hyphens no dashes no backlashes underscore Scarpino Tim what's your topic before we even get to my top I do want to say one last thing about his topic you need to just make your beatboxing just a show a love and sex St style show where it's just weekly and just choose a different song every week and just do that cuz people would love to hear that that shit's funny as hell you're good at it you're good at it yeah but I want it super tight because super that's hello just you yeah brother that's right when you know how to a bunch of Stewart Copeland over here lot of **** going on over there that's that's out okay you know what Chris took that down Chris we're going to do another show you heard it from the god of Patreon he said no don't shake your **** head edit that **** take a day to do all of them choose when we finish this GameOverGreggy Show we'll punch you in on your face and",
            "start": 1607.92
        },
        {
            "text": "it from the god of Patreon he said no don't shake your **** head edit that **** take a day to do all of them choose when we finish this GameOverGreggy Show we'll punch you in on your face and you just beat box out like 10 songs no big deal really **** good for me to do Thriller Ghostbusters bunch of **** **** you can keep it trendy when Star Wars comes out in December do the Star Wars theme song **** I'm sure people react to this tonight why is our video happening because Kevin's doing things whenever Kevin does something okay well thank you very much he's got literally literally two buttons to push that's all he's got to do for this show but he has the option to hit but he has the option to do and that's the problem you give him the option he's going to take it",
            "start": 1654.72
        }
    ]
}