{
    "id": 2144,
    "video_id": "MFsAvu07X8M",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Power Rangers vs. Voltron Commentary - Kinda Funny Reacts",
    "description": "Go watch the video now! https://youtu.be/HNIyztmU8dk\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1477756801,
    "duration": 375,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm Tim Gettys. This is Greg Miller. Hi. Here you're looking at Ismahawk's latest Minute Matchup. We're talking the Power Rangers Megazord versus Voltron. Me and Greg were both featured in this video. There I am. I'm right, I'm right there. It's me, the fat one. No, I'm not the P one. I'm Hunk. Hunk, you idiot. I don't know, whatever. That was the thing that was the funny thing about Blue. Yeah, you're about to see yourself over here in the Blue Ranger one. Yeah, that was the thing about that was interesting about this, uh, including the entire Voltron cast and everybody who worked on the production and all the Power Rangers, only Anthony Carboni knew anything about Voltron. That's how popular Voltron is. We all knew Power Rangers, of course you did. Look at this. Power Rangers are awesome. Dream come true. I got to morph. Yeah, that's being the Blue Ranger. Not so much my dream come true. Mean, Blue's my favorite color though. That's my thing. I like, I'm not a Red guy, you know, the, I'm definitely not a Black guy.",
            "start": 0.12
        },
        {
            "text": "Got to morph. Yeah, that's being the Blue Ranger. Not so much my dream come true. Mean, Blue's my favorite color though. That's my thing. I like, I'm not a Red guy, you know, the, I'm definitely not a Black guy, but I'm a Blue dude for sure. You are a Blue dude. But Xavier Woods, uh, we got, uh, Danny Shephard himself, Ismahawk. We got Mario Takahashi from Games. We got, uh, this, this girl, Tara Magu, I think her name is, Pink Ranger. And then you guys on the Voltron team, sure. Anthony Carboni, iJustine, the guy from Corridor Digital whose name I can never remember, and thank you, Nico. Yeah, yeah. Oh, and then, uh, the guy who actually is a Power Ranger, Yoshi, the actual current or last season Blue Ranger. Yeah, very cool. And you left off your team. Danny Shephard is your Red Ranger. I said that. You said it was a Danny Shephard video. I said Danny Shephard. You said Danny Shephard. So here's things get crazy. There's the giant robots. They're doing CG. Yeah, damn. That's us right there. It's me on green screen. You didn't get to do any of the",
            "start": 37.4
        },
        {
            "text": "I said Danny Shephard. You said Danny Shephard. So here's things get crazy. There's the giant robots. They're doing CG. Yeah, damn. That's us right there. It's me on green screen. You didn't get to do any of the green screen stuff like I did. No, no, no. You weren't as cool as me. You didn't get to be in a cockpit. You didn't get to move the handlebar. There other people in in the cockpit. That's what stunt doubles are for. I'm just there. You're just face. Uh, but this is my favorite scene in the entire thing. Max and Brian. We got Brian Altano and Max Scoville as Bulk and Skull. Little musical cues and all that stuff. So perfect. It's so Altano and it's so Bulk and Skull. Yeah, that's great. One of my other favorite scenes is when the Voltron first, the the big ass robot, I don't know what the **** it's called, the formed Voltron, that is Voltron, steps his foot down. All the Power Rangers like, oh ****. It's like, damn, this is an impressive ass video. Well, I mean, that's what Danny does, of course. You know, Danny, he's the guy who",
            "start": 85.56
        },
        {
            "text": "That is Voltron steps his foot down. All the Power Rangers like, oh ****. It's like, damn, this is an impressive ass video. Well, I mean, that's what Danny does, of course. You know, Danny, he's the guy who did, well, Ismahawk in general, I should say, are the guys who did Nightwing: The Series. We brought them on Up At Noon back in the day. Kind of were there like that was their big breakout, Nightwing: The Series. And since then, yeah, they've done a bunch of these that are really, really well done. I of Flash versus Quicksilver. They've done that one. Deadpool versus Deadpool is really good. Yep. All their Minute Matchups been super awesome. This one obviously the most ambitious. I think this the best because we're in it. Oh, that that too. But I think this might like be some form of record of like craziest collaboration between people. When you look at all the people in people they brought in, it's super, I mean, it's an honor for me to be even alongside these people so that it's super cool and be honored to be beside me.",
            "start": 125.12
        },
        {
            "text": "Between people. When you look at all the people in people they brought in, it's super, I mean, it's an honor for me to be even alongside these people so that it's super cool and be honored to be beside me. The most ambitious thing ever. They're like, there's CG robots fighting. Yeah, hell yeah, hell yeah, hell yeah. Super, super dope. Jeremy, shout out to Jeremy. He's the other one of the other Ismahawk guys. Um, very talented behind the camera and he definitely made us look damn good. Um, we're kind of talk over this whole thing because we want you guys to go check it out on their channel, youtube.com/Ismahawk. Uh, support them. This is such a cool video and I I want them to grow. They're the type of channel that, man, this guy just like lives and breathes creating cool stuff. So I I hope that, uh, he gets a lot of love and support. I love the cockpit shots of the Power Rangers. Like, what what's crazy to me is how good this looks compared to the original Power Rangers Movie. Oh yeah, in '95. You think this looks better? Oh my.",
            "start": 157.2
        },
        {
            "text": "Support. I love the cockpit shots of the Power Rangers. Like, what what's crazy to me is how good this looks compared to the original Power Rangers Movie. Oh yeah, in '95. You think this looks better? Oh my God, this Megazord looks way better, way better. Like the, if you Google, everyone Google search Power Rangers Megazord, uh, Movie and just see what happens. It's like, it's bad. Like to, I I think I could come up with CG that looks like that. Damn. But you don't know anything about do it. I definitely could do. I would do claymation, claymation are big. Yes, yes. So we got them fighting, fighting the skies and doing a whole whole bunch of fun shenanigans and whatnot. Uh, there's a couple fun moments. This movie or this, uh, video very, uh, tongue in cheek and parody and kind of, that's what I mean, that's what the Voltron and Rangers, a lot of the, let me clarify that, that's what Power Rangers were. Nobody watched Voltron. I have no idea if that there was a moment where Danny was like, can you guys sing the Voltron theme song?",
            "start": 200.88
        },
        {
            "text": "Rangers, a lot of the, let me clarify that, that's what Power Rangers were. Nobody watched Voltron. I have no idea if that there was a moment where Danny was like, can you guys sing the Voltron theme song? And everyone's like, no. Voltron, the friendly robot. He's got a heart as big as a big robot. Yep. He's running around and punching things. So we got the swords. We got a bunch of cool stuff happening. So there's a whip. Xavier Woods gets a bunch of cool lines. Cockpit things are happening. Now, don't ruin the whole thing. Don't tell them everything that's being said. I want them to know. They they're going to watch it over at youtube.com. They don't, you don't need to tell them everything. What's bad though, Greg? What is bad about this? What's bad? It's I'm dropping some exclusives here. Some real damn exclusives. Who wins this? Us? Team Voltron, the original people, which is **** ****. The Power Rangers should have won. And guess what? The whole internet agrees because all the comments are saying this is bull **** ****.",
            "start": 242.72
        },
        {
            "text": "This us team Voltron, the original people, which is **** ****. The Power Rangers should have won. And guess what? The whole internet agrees because all the comments are saying this is bull **** ****. The Power Rangers should have won. So if you stay to the end of this video, you'll see that there's a nice little Easter eggy thing. So you can experience that for yourself. But I'm telling you right now, they're working on a director's cut. It's going to be a tighter edit with the addition of the Green Ranger and the Dragon Zord. Oh, really? Oh yeah, it's going to be awesome. Rangers going to win there. Like they **** should have in the beginning. Hell yeah, they are. Now, as a member of Team Voltron, I will tell you, yes, I hope the Power Rangers win. They are the better team. They are the better team. It's absolutely true. Anyway, here you go. That's Danny. Look, look at it. No, that's Danny. That's move for a second. Why did you, what do you do with the beard, man? Their video was sponsored, not not our video.",
            "start": 288.44
        },
        {
            "text": "True. Anyway, here you go. That's Danny. Look, look at it. No, that's Danny. That's move for a second. Why did you, what do you do with the beard, man? Their video was sponsored, not not our video. You can tell like how long he's been working on this video from the beard. I've had, I've seen this before. His next Minute Matchup is going to be Jesus, look at him. That's not Jeremy. I don't even know what they're talking about here. Anyways, ladies and gentlemen, youtube.com/Ismahawk. They are super talented guys. They're super awesome. Please go so show some support on this video. Share it with all your friends so they can do way more cool stuff and hopefully they invite us back to some things. I was talking to them recently about getting you involved in another one. It's going to be good. Is it The Blob versus somebody? Clark Kent versus somebody? It may or may not involve Batman.",
            "start": 331.84
        }
    ]
}