{
    "id": 2142,
    "video_id": "RvHSvRU6x0k",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Matt Scarpino"
    ],
    "title": "Matt Scarpino Returns! (Special Guest) - The GameOverGreggy Show Ep. 151",
    "description": "Special guest Matt Scarpino joins us to discuss the election, Midlife Ballers, car speakers, and Westworld. (Released to Patreon Supporters 10.21.16)\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/greggy\n\nThanks to Video Blocks for sponsoring this episode. Go to http://www.videoblocks.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1477638030,
    "duration": 7832,
    "transcript_chunks": [
        {
            "text": "Hey Tim, hey Greg, what's Video Blocks? Video Blocks is awesome. It's stock footage. See it here, W, it's a Eag that was in Colin's intro in a Kinda Funny Live One. I used Video Blocks extensively in Kinda Funny Live One and Two and Two. But no one would know if you used in Kinda Funny Live. This was one, this was in the intro to one I've before. But anyways, Video Blocks is awesome. And in addition of video, there's also audio stuff, there's graphics stuff. If you're a nerd like me that edits a lot of videos or you you're just like looking at cool pretty vistas, yeah, here they are. You know, you Video Blocks is an affordable subscription based stock media site that gives you unlimited access to premium stock footage. This is what you use. You're a longtime customer. How long you been a customer roughly? Uh, I don't know, a couple years. I think they've only been around a couple years. There's a monkey, he's dancing around telling jokes. Wow, okay. They have a library of over 115,000 video clips, After Effects",
            "start": 0.12
        },
        {
            "text": "I don't know, a couple years. I think they've only been around a couple years. There's a monkey, he's dancing around telling jokes. Wow, okay. They have a library of over 115,000 video clips, After Effects templates, motion backgrounds and more. Video Blocks is offering our fans a year subscription for only $99. This is a $50 discount off the usual price tag for our listeners and viewers only. That's less than $10 a month, Tim. That's how math works. If you want to get it, get your yearly subscription today for only $99 at videoblocks.com/greggy. That's Video Blocks, vdeoblocks.com/greggy for this discount. Give one of them pullbacks, Greg. What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the Producer Seducer Nick Scarpino. Age, it's such a rare occasion you wear the Producer Seducer shirt available at KindaFunny.com store on the show. Should wear it more often. Are you doing the little like arm sleeve rollup thing? Yeah, I did. You're so **** trendy.",
            "start": 36.96
        },
        {
            "text": "occasion you wear the Producer Seducer shirt available at KindaFunny.com store on the show. Should wear it more often. Are you doing the little like arm sleeve rollup thing? Yeah, I did. You're so **** trendy. Nick Scarpino, you look like a greaser, huh? Well, the thing is, I haven't worked out, but if you roll the T-shirt, your arms look bigger. I like it. You shave the hair on that arm? Did I shave the hair? No, it's back right there. Hipster. Do you shave it usually? It is. I usually have my wife n it. She starts here and then goes, it goes a whole back. She starts here on on the, that's where it ends. Okay. And then it, but it starts really, the back is really the main, the pièce de résistance. What's it going to take to get you to go some Halloween as Wolverine? Cause you would be such a **** dope ass Wolverine. If only we would almost threw one here except somebody didn't want a whole bunch of extra work for no reason. It was you. Next year we're going to throw a badass Halloween party and I'll go as Wolverine. All",
            "start": 124.16
        },
        {
            "text": "we would almost threw one here except somebody didn't want a whole bunch of extra work for no reason. It was you. Next year we're going to throw a badass Halloween party and I'll go as Wolverine. All cool. What are you gonna go as? You have to go as Cyclops then. I don't think as a Cyclops, just wi middle your forehead. Okay, that was one way to go. Jubilee. Yeah, exactly. Yeah, of course you Jubilee. Thank you. Over there, the pure one, Tim Gettys. I'm not off the like let Nick off the hook with this though. I'm liking it. The rolled sleeves, it's it's good. I first saw that with one rul rah rah here and uh and I saw that and then after that all the cool kids are doing it. I'm seeing it left and right. So the fact that you're doing it, it's good. Thank you. Appreciate. Good luck. You should start doing it. He only does everything. Do you want to do you want to roll your T-shirt? Going to roll it up dramat very dramatically. Uh, it's good to be here. Go Islanders. Uh, and uh thank you for having me on my own show. It's a",
            "start": 167.76
        },
        {
            "text": "everything. Do you want to do you want to roll your T-shirt? Going to roll it up dramat very dramatically. Uh, it's good to be here. Go Islanders. Uh, and uh thank you for having me on my own show. It's a pleasure. Well, this is my show. This is The GameOverGreggy Show. It's our show. Is it? I think Colin, Greg, is our show. That's more, I feel that's more like my show. Love and Sex Stuff is their show. PS I Love You is our show. Love and Sex Stuff, never mind, discontinued, done. No, I just like episodes with the same costumes. That was my favorite part of. And here, the Midlife Baller himself, Matt Scarpino. Hello everyone. Making your glorious return to the show. One of the few super excited two appearances. Number Deuce. Gary Vee, Gary Vee, you and you. Yes, in the new studio that you bu. I did build this. No, Damon's only done one. You can see by the video. Andrea did one. She's done a lot of Gamescast. Yeah, we're never getting Michael Rosenbaum back. Popular now. He's too popular now. No, now we got him when he was like, I don't",
            "start": 213.28
        },
        {
            "text": "one. You can see by the video. Andrea did one. She's done a lot of Gamescast. Yeah, we're never getting Michael Rosenbaum back. Popular now. He's too popular now. No, now we got him when he was like, I don't know what Prest onv now. Now he's got, he's on a season two of his very popular TV show. He makes 100 episodes. They get that thing in syndication. We never see him again. It's over. That's sad. Yeah, then he's not really in the community. No, no, don't don't throw stones. He still tweets back at the kids and me and every so often. Oh, okay. All right, calm down. He's a Rangers Fan. He needs to come back on the show. Now, if somebody had missed your episode before, you are of course Nick's brother still. Yeah, always since I've known him. Yeah, that's how it'll be. The I've known Nick again, this is my joke from last time, about 37 years. Yeah, roughly, give or take a few. Are you 30? No, almost January. You're almost 37. 37. I know. Yes. And I'm almost 41. Isn't that **** weird? It's weird to be 40, especially cause I share your",
            "start": 262.48
        },
        {
            "text": "about 37 years. Yeah, roughly, give or take a few. Are you 30? No, almost January. You're almost 37. 37. I know. Yes. And I'm almost 41. Isn't that **** weird? It's weird to be 40, especially cause I share your problems of pooping. But I'm older than you. So as Chris can attest, he's like, my God, he goes through so many CVS butt wipes in a day. Three to four packs. But I like to be show ready at all times. What do you do when you go on a plane with those things? Do they have to have their own suitcase? Um, you have, it's very awkward when you're in the line and you're like, here's my laptop, here's my butt wipes. They just say baby. They say fresh wipes. Um, they say CVS Fresh. Everybody knows. And you don't have a baby with you and the baby comes out of your other pocket. And here's my baby. No, it's super awkward cause I'll go to the CVS by my house and I usually buy all the single packs. And so I have the little basket and I always have to buy something else. Why don't you just buy them off Amazon like bulk in the",
            "start": 299.92
        },
        {
            "text": "I'll go to the CVS by my house and I usually buy all the single packs. And so I have the little basket and I always have to buy something else. Why don't you just buy them off Amazon like bulk in the single pack? I might have to do that cause the woman's like, do you take care of somebody that like older? Do you take care of an older woman? Do you have an incontinent animal? And I'm like, no, I **** like a FedEx. Like all the time. Like a FedEx driver. No, I don't know. I'm I'm delivering. This is what we deal with. I'm delivering the package all the time. It's horrible, horrible. A FedEx. I like that. I'm going to figure that one out. Reverse. Here's what popped into my head. What popped into my head was UPS and Brown. Like, what **** can Brown do for you? Like brown. So then you went to FedEx. Then I said FedEx for some ungodly reason. Too obvious. Yeah, FedEx. I think FedEx drivers have to poop in the bushes a lot and then they have to use a little wipes there. I would **** in the back of the truck. I had to.",
            "start": 343.8
        },
        {
            "text": "for some ungodly reason. Too obvious. Yeah, FedEx. I think FedEx drivers have to poop in the bushes a lot and then they have to use a little wipes there. I would **** in the back of the truck. I had to. You guys ever seen the bus drivers toilets? The like the public toilets? The only bus drivers. Yeah, yeah. Like the little booths that they like key in on. Is they're all in the city. Like the bus will just pull over and D will just run out real quick and open a little door and that's just ****. Okay, that's weird. It's weird to know it. Where's it's like either in a like a public building or a little stone structure out in the middle nowhere. Think was a, it's like camouflaged in the rest of the stone structures and just like a little dude walks out and he gets back on his bus. There's one by the Marina in in the Marina. I saw a guy going in. What I respected about him a few weeks ago, I was walking the dog and he knocked before he went in just in case he was walking in on another driver also pooping. Good.",
            "start": 387.16
        },
        {
            "text": "in the Marina. I saw a guy going in. What I respected about him a few weeks ago, I was walking the dog and he knocked before he went in just in case he was walking in on another driver also pooping. Good for. They got a poop. Everybody Poops. Some favorite book. I get that for everyone that has just vibrate are fun. Something sounded weird. No, I got just caught in staro between two star. I'm sorry. I'm sorry. I just heard a vibration over here and I didn't know what it was. If you didn't know, ladies and gentlemen, this is The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table. He's bring a random topic of discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you can get the show early along with a bunch of exclusive goodies and perks and things like that. If you don't have any bucks to toss our way, no big deal. Head over to youtube.com/kindafunny where we post the entire show topic by topic, day by day until it goes up as",
            "start": 424.52
        },
        {
            "text": "and perks and things like that. If you don't have any bucks to toss our way, no big deal. Head over to youtube.com/kindafunny where we post the entire show topic by topic, day by day until it goes up as one big thing the following Friday on YouTube and podcast services around the globe. You demanded to go first. I did. Because I think it's an important one to go first, especially because I wanted to get there as as soon as possible. Some weeks ago on the show, before Nick went to Europe, uh to see Harry, uh we uh we talked a little bit about the election and I wanted to touch base with you guys one more time before we're going to touch base again right before the election. Okay, so the election's in three weeks from the day the day we're we're recording this. So in three weeks, we'll touch base on it one last time. And for context, this is being recorded before the final debate tomorrow. Exactly. Exactly. The part tomorrow. The final debate's in Las Vegas tomorrow. Um, Tim, keep up with this timeline. He has",
            "start": 462.56
        },
        {
            "text": "last time. And for context, this is being recorded before the final debate tomorrow. Exactly. Exactly. The part tomorrow. The final debate's in Las Vegas tomorrow. Um, Tim, keep up with this timeline. He has documents, ladies. Is that your election binder? That's my election. This is my, this actually, how great would they be if he had every year a different notebook? It's my notebook. You know, he has a notebook for every different thing. Like one for the elections, one for the Jets, one for the, one for the sausages, one for his low protein, his low carb diet right now, one for the poops about that come out of the low carb diet. Um, so I wanted to just touch base. I wanted to just propose last time when we did it. I I gave you guys a few stats of where the election was was sitting now and then kind of got your thoughts on it. I want to talk about two things in particular when you guys are done because I want to uh touch based on something that I think has not been not been touched upon too much. But there are two",
            "start": 505.4
        },
        {
            "text": "on it. I want to talk about two things in particular when you guys are done because I want to uh touch based on something that I think has not been not been touched upon too much. But there are two articles or two people talking about things that I want I want to discuss in a little while. But before we go, I want to see or before we go there, I wanted to see what you guys think of what's happening here. I went to 538 today. We talked about them last time. It's Nate Silver's website. They're predicting like a pretty on point predicting website. Uh, gives it 87.6% chance that Clinton will win. Jesus, which is up significantly almost 40 points in a month. Uh, they predict that the popular vote will be 49.7% Clinton, 4.7% Trump, 6.1% uh Johnson. Um, there's a 6.7% chance that Clinton will win in a landslide. And there's a 91.7% chance that Clinton will win in the the win the popular vote. That's wild. And that does as of as of when when did you get those stats? This morning. Okay, crazy. Uh, seven polls came",
            "start": 546.08
        },
        {
            "text": "and there's a 91.7% chance that Clinton will win in the the win the popular vote. That's wild. And that does as of as of when when did you get those stats? This morning. Okay, crazy. Uh, seven polls came out recently. NBC News has Clinton plus six. Rasmussen plus one for Clinton. CBS News plus nine for Clinton. LA Times plus two for Trump. Monmouth has Clinton up one. ABC/Wall Street Journal has Clinton up four. And NBC/Wall Street Journal has Clinton up 11. Uh, ABC News and Washington Post have unfavorable ratings at 63% for Clinton and 57% for Trump. Uh, and strong moral character, 45% think Clinton has a strong moral character. 30% think Trump has a strong moral character. Qualified to be president, 59% think Clinton is qualified to be president. 39% think Trump is qualified to be president. Um, um, 6% of Americans think that uh you cannot trust Hillary Clinton. Um, so those are some of the interesting statistics that I dug up recently. So where we where do we all sit right now? Have a question. So 538, how accurate",
            "start": 585.68
        },
        {
            "text": "think that uh you cannot trust Hillary Clinton. Um, so those are some of the interesting statistics that I dug up recently. So where we where do we all sit right now? Have a question. So 538, how accurate were their pollings and all their, you know, surveys and **** going into this? So like over the last year, because I feel like, you know, with politics, they've always been doing this stuff and they're usually fairly accurate. But I feel like every time we've talked about this election in the last year, uh, it's always just been that like this is unpredictable and that all the they, everything's wrong and Trump kept winning. Were they one of those people? Did they get things right? Or I don't know. I did not read. So my suspicion is that they probably got most of the primaries right. But primaries are much more unpredictable. As far as I know, in 2001, which is when they really made a name for themselves, they got every state right in the general election. Um, I think Indiana might have been the difference",
            "start": 630.36
        },
        {
            "text": "more unpredictable. As far as I know, in 2001, which is when they really made a name for themselves, they got every state right in the general election. Um, I think Indiana might have been the difference there or something like that. But they got 40, at least 49 states right, which is good. That's how they made their name. And ESPN bought them later. Primary politics, way more unpredictable. So I don't know exactly. Um, that. But they're basically just reading the tea leaves and the polling. They're not doing their own unique polling. They're just looking at everything, all the information and then make. And people should go. It's really interesting. They have very interesting aggregate of uh like all these kind of graphical ways of looking at the election. It's very interesting. And and this and it's swung completely to Clinton. And I agree, they it's pretty clear Clinton's going to win. Um, but I'm curious what uh what you guys what what what are the thoughts? How's everyone feeling after the the sexual uh tapes",
            "start": 672.08
        },
        {
            "text": "to Clinton. And I agree, they it's pretty clear Clinton's going to win. Um, but I'm curious what uh what you guys what what what are the thoughts? How's everyone feeling after the the sexual uh tapes with Billy Bush came out and the the WikiLeaks stuff with Julian Assange and and John Podesta and all that kind of stuff? Have you guys been keeping up with this? And and and do we still feel as we did a few weeks ago that there were some differences at the table that Trump or Clinton would win? I'm curious what everyone thinks about that. I mean, after the the second debate, I think that it really furthered my thoughts on the whole situation in terms of I feel like the second debate was even more than the first where it was an absolute victory for Clinton. And uh if if you're not even looking at that side, it was a definite loss for Trump. Like um I feel like he was really, he even at some point said, this feels like a three-on-one. And I feel like it was that way. It's like I felt like even the the",
            "start": 703.56
        },
        {
            "text": "side, it was a definite loss for Trump. Like um I feel like he was really, he even at some point said, this feels like a three-on-one. And I feel like it was that way. It's like I felt like even the the moderators were against him. And I don't think that that's necessarily a bad thing. Um, I feel like they they kept making points because he just wasn't answering the questions. And so they they would keep badgering him to answer the questions. And uh unfortunately, I think that he can use that as an advantage because all he needs to say is bring it up like, oh, it's a three-on-one. And then all the people that are rooting for him are just going to be like, yeah, you know, like that that is what makes him win. But it's like really that that isn't a victory that matters. Um, it unfortunately could be a victory that does matter if there's enough of those people that that see it that way. I hope there's not. But that's where I'm at. Well, that's what he's been running on the entire time, right? Is that that whole",
            "start": 742.12
        },
        {
            "text": "that does matter if there's enough of those people that that see it that way. I hope there's not. But that's where I'm at. Well, that's what he's been running on the entire time, right? Is that that whole just ability to spin doctor things and just kind of turn things back around on people while not actually answer any questions? And I think that people are starting to get kind of tired of that. But it's weird though, because as as the sort of moderates get tired of it, the hardcores get more uh solidified in their beliefs about him, right? And like it just that like all like I just read another news story. One of the women that came out against Trump had to leave the country because she was being harassed so badly by his followers or supporters rather. And it's like, granted, that's a whole of the situation that that warrants uh its own investigation. But that's that's insane. That's insane that people who are uh like that on that level and a lot of people draw that par this parallel. I don't",
            "start": 783.48
        },
        {
            "text": "the situation that that warrants uh its own investigation. But that's that's insane. That's insane that people who are uh like that on that level and a lot of people draw that par this parallel. I don't necessarily draw the parallel, but I can see where they get it from where they're like, this is sort of a Hitler-esque tactic that you're rallying your base so much that they that people are scared of them. And that is a very, very frightening thing. And kind of very, very glad that Trump's losing uh a lot of ground simply because it was funny at first. But really, the man has not answered one question yet. Really, he has no stance on anything. He's racist. And apparently it's up for debate, but he's a womanizer. So is he? Well, he treats women like **** apparently. But I mean, I don't know that that's that those are the accusations, right? No one like he is saying no. There are multiple women that have come out of the woodwork and said he does treat them like, you know, he he has at one point either sexually",
            "start": 816.88
        },
        {
            "text": "are the accusations, right? No one like he is saying no. There are multiple women that have come out of the woodwork and said he does treat them like, you know, he he has at one point either sexually harassed them or molested them in some way. Um, and we've obviously heard him that he's suing the New York Times. You've also obviously heard him um defend himself. But it's hard to defend yourself when you have a recording of you saying horrible things. Now, granted, I think the're recording like, I'll give him a little bit of the benefit of doubt for the lock the quote unquote locker room talk because we are all guys and we say stupid **** like that when we're in each other's confidence. And if someone were to record that and take it out of context, I could understand how would be pissed. I would be screwed. But I think he takes you just say it on your podcast. Yeah, exactly. Oh, I'm not running for president. That's you're not running for president. But if you did, you actually could probably get all the",
            "start": 856.12
        },
        {
            "text": "but I think he takes you just say it on your podcast. Yeah, exactly. Oh, I'm not running for president. That's you're not running for president. But if you did, you actually could probably get all the way to the to the primaries if you wanted to. Why? Cause I like to grab the whatever was time. It's horrible. I mean, I don't even use that the phrasing. And I mean, I don't go to lock rooms anymore. I not phrasing grabbing his wife's ****. Thank God she doesn't listen to the show. Um, so I don't know. But again, I I'll be the first person to say I have I have way more paid attention to the negative on Trump than the negative on Clinton. Which is funny because depending on which news outlet you're watching, it's either one is the the the second coming of the devil or the other is second coming of the devil. Like they're all like, you know, if you watch Fox, it's all about how Clinton, all the WikiLeaks with Clinton. And if you watch CNN, it's how Trump is literally Hitler. Um, so I I I don't really I don't really know.",
            "start": 891.24
        },
        {
            "text": "they're all like, you know, if you watch Fox, it's all about how Clinton, all the WikiLeaks with Clinton. And if you watch CNN, it's how Trump is literally Hitler. Um, so I I I don't really I don't really know. All I know is that in no **** world that I want to live in and no reality that I want to live in is Trump our president. And that terrifies me. And the fact that he is, the fact that we would even think about electing that **** living Muppet is is just beyond me. You know, like think about who this person is. He has been an ongoing joke in mainstream American culture for the last 30 years. Ever since I was born in the 80s, he was this joke of of an investor billionaire guy, this crazy guy. And to think that if you had told me 20 years ago that guy was going to be running for president and might get it, I'd be like, you're out of your **** mind. Go check yourself into a whacko bin. Um, he did win the match against Vincent McMahon and shaved his head. So that's true. Yeah, that's true. And he also",
            "start": 932.32
        },
        {
            "text": "get it, I'd be like, you're out of your **** mind. Go check yourself into a whacko bin. Um, he did win the match against Vincent McMahon and shaved his head. So that's true. Yeah, that's true. And he also helped that that McAllister kid find his way. Did that too. Um, so that's he's helped many many Apprentice get on their feet. Yeah, and that's the thing too. Us, this this is my problem is I have my ballots. I have my mailing ballots. And so I have to figure out this weekend, not necessarily this weekend, but that's the the designated time my wife has has said we are voting. Um, I'm sure Matt's familiar with this. You're you're only other married person here. I don't know what you're talking about. You get I got a Google email, like a Google message calendar invite saying it's time to we're going to vote on Saturday. Oh, no. Yeah, I I have a little place. Yeah, there's a place in my neighbor. I don't I don't I'm not I like to I like to go out on the day election day. I don't want I don't want to mail it in. I want I",
            "start": 972.88
        },
        {
            "text": "oh no. Yeah, I I have a little place. Yeah, there's a place in my neighbor. I don't I don't I'm not I like to I like to go out on the day election day. I don't want I don't want to mail it in. I want I want to we live in an awward. You go to some rando somebody's house. You old working it. They don't ask for anything. Which one are you? You point at your name. Go vote. Okay, great. Yeah, but there's no voter fraud. Yeah, uh so I mean that's the thing. I I got I got to make the decision. I don't know if I can vote for Clinton. So I might have to go third party. I don't know. We'll see if Gary Johnson wasn't so **** crazy. Cause Clinton's, I don't trust her either, man. I mean, like like she's done some crazy ****. There there there's a lot of speculation out there as to whether she's had a guy killed. Like there's **** like that that you're like, ****. It's it's but it also could be **** that Trump didn't molest these women. Like, but I mean, like, but that those aren't hand in hand. It's like I feel like that the",
            "start": 1007.08
        },
        {
            "text": "like that that you're like **** it's it's but it also could be **** that Trump didn't molest these women like but I mean like but that those aren't hand in hand it's like I feel like that the Trump stuff it's like clearly you're not voting for Trump right so it's like then with Clinton it's more about questioning all that stuff and deciding whether or not you well and that's what I have to do I have to actually go back and I haven't really paid too closely attention to to to her platform so I have to go back and actually look I've never really I don't think I voted Democrat yeah I did I vote for Obama so um Obama I'm not against voting Democratic a Democrat um I just don't I just there's something about the Clintons that I just don't trust you know there's something about a governor of Arkansas that rises to be president of the United States and has like there's lots of conspiracy theories as to him being tied to drug runners and **** like that and then all of a sudden the a",
            "start": 1048.2
        },
        {
            "text": "of Arkansas that rises to be president of the United States and has like there's lots of conspiracy theories as to him being tied to drug runners and **** like that and then all of a sudden the a whistleblower for the DNC gets killed outside of outside of the party headquarters it's like this this crazy **** that's happened underneath the Clinton's kind of iron rule so I'm not saying that it's good right or wrong to vote for them but it does give you pause like on both sides and I don't know whether or not it's that these two people are particularly despicable or that there's just so much free free information running out there that we know everything now and that every candidate that's running is **** crazy like the **** that I've heard Gary Johnson say you're like that's interesting that's one word crazy **** um but you know I don't know so I gotta do my research this weekend and probably vote for Clinton Greg no change got to stop Trump vote in Clinton gave her money",
            "start": 1085.32
        },
        {
            "text": "that's one word crazy **** um but you know I don't know so I gotta do my research this weekend and probably vote for Clinton Greg no change got to stop Trump vote in Clinton gave her money after that first debate liked her performance uh from everything I saw in the little thing of debate too I was in Canada at the time seems like she did well there too but again it was more just give Trump all the rope in the world to hang himself and then everything else continues and you're just like this is some kind of waking nightmare I don't know how this is still happening what's going on you feel crazy right cuz you're like I don't understand how other people can look at that and be like yeah like it's a **** psychopath like he is a megalomaniac socio psychopath like sitting on stage with a we've given him a **** microphone and people are like yeah this guy speaks for me it's like Jesus Christ like is really that there's that much of this country that that is completely Prejudice",
            "start": 1120.56
        },
        {
            "text": "a we've given him a **** microphone and people are like yeah this guy speaks for me it's like Jesus Christ like is really that there's that much of this country that that is completely Prejudice bigoted and racist like they're and they're they want to get behind this guy it's **** we'll get into that in a minute because that's the stuff I want to talk about in a little while but um so you both your points because you guys were talking about the debate you guys are actually in the significant minority of people that think that Clinton won that debate um you're talk bring the pundits the thing I saw from all my friends was Clinton now incredibly biased e friends the the the uh I walked away from both debates thinking that they were both draws um and those were both those were unpopular opinions I was actually really surprised when I walked away from the second debate and I'm like I seem like that was actually one of Trump's stronger performances but I'd still call it a draw because",
            "start": 1162.04
        },
        {
            "text": "opinions I was actually really surprised when I walked away from the second debate and I'm like I seem like that was actually one of Trump's stronger performances but I'd still call it a draw because Clinton is is a strong performer when I was watching a lot of the pentry and reading a lot of the things especially from a lot of liberals they were like that was Trump's best performance and Clinton clearly didn't win that debate um I I don't think those things are like I think that was one of his better performances I think that she's still completely tra she's she's out she outclasses him a lot looks like he was very he was very strong and I actually think I have to watch it again and I I will cuz I'm I'm weird but uh he had her frazzled like multiple times and it that sh the **** he was doing BR though no but the **** was he was doing was working so what makes me which yeah I like Satur lives threat to get her uh arrested was like the most like wow shots fired thing ever that's a",
            "start": 1200.48
        },
        {
            "text": "doing BR though no but the **** was he was doing was working so what makes me which yeah I like Satur lives threat to get her uh arrested was like the most like wow shots fired thing ever that's a guy that's running for to be president and anyone can look at that and be like yeah yeah yeah I I mean I I tweeted out about that too I found that quite troubling uh Tim's referring to when uh Trump said that he would have a special prosecutor looking at Clinton if he was elected it seems um a bit of a totalitarian kind of thing to do uh that's your the right of course the president prerogative of Congress to do that kind of thing but I don't think that you should be threatening your opponent in a presidential in a presidential race to jail um it does wreak of totalitarianism uh Matt do you have any thoughts because we you weren't here our last time obviously what do you think is gonna what what what your feelings here's the thing I mean I have not been P I'll be honest with you I I I actually",
            "start": 1239.76
        },
        {
            "text": "thoughts because we you weren't here our last time obviously what do you think is gonna what what what your feelings here's the thing I mean I have not been P I'll be honest with you I I I actually don't vote really what yes that's why I was really okay don't count Jesus God look at that no cuz your eyes just like oh no no I'm just call to a dark place for did you see him went to no like literally that is your prerogative I don't believe in compulsory voting so that's your prerogative right so my my problem is that I have been actually paying attention a little bit now but I still I don't know who I would vote for cuz I'm scared of both choices like really primary choices like I don't know like some of me thinks like if Hillary Clinton did get in trouble do you think she would just go home and be like what do you what would you do buddy since you you know you kind of had this Helm and he's like I would just get a **** no but you know what I mean like basically would she actually make her own",
            "start": 1283.96
        },
        {
            "text": "what do you what would you do buddy since you you know you kind of had this Helm and he's like I would just get a **** no but you know what I mean like basically would she actually make her own decisions or not and basically would she or I don't know it's just it's a mind **** I can't believe Trump is actually running either I can't believe that well I mean that's the thing with pres like you don't expect a president to know everything and that's why they put together a team team but I mean is he just running to make her look better I I don't does he really want to be president I don't know it's a mind **** for me who Trump yeah I don't know I mean that would he really be I mean if won what **** would he do because he's a liar and even if he said that later no one would believe him even if he even if he said later he like I started this as a joke but now it's real who the **** cares it doesn't matter it's a reality and it's a possibility and everyone should realize that yeah",
            "start": 1325.28
        },
        {
            "text": "even if he even if he said later he like I started this as a joke but now it's real who the **** cares it doesn't matter it's a reality and it's a possibility and everyone should realize that yeah no I uh I know you can judge me no I'm not judging I it's on I I didn't expect that from why what would you have expected for me to come out swinging no not to have like a solid opinion or whatever I I expect you to vote I mean I might Scarpino is not very political family here's my well that's not lately that's not true that's true you and I don't give a **** sometimes but let's get Dad on the show and conell fall asleep everyone will fall asleep we I think everybody fall as like this I love my I love Patreon will just Pro pause for like 10 minutes while people are like is this really an exclusive holy **** yeah they like so I learned a lot about taxes today and spreadsheets spreadsheets I know spreadsheets yeah I'm sorry go I something I want to like talk to you guys about so both of",
            "start": 1362.08
        },
        {
            "text": "holy **** yeah they like so I learned a lot about taxes today and spreadsheets spreadsheets I know spreadsheets yeah I'm sorry go I something I want to like talk to you guys about so both of you brought up the idea of being scared of both the the people I don't really like being scared of Trump I understand but being scared of Clinton like she just seems like more of the same to me where it's just all right she's just more of the same that we've always had and it's like have we been scared before of this stuff like well no it's it's not necessarily be scared it is it is one of those of just of just looking at her knowing that a she's a career politician B she has um she is going to be more of the same and that is a scary thought because more of the same has led us to the biggest economical crisis uh since the Great Depression uh the house you know the housing crisis um and she's got huge ties to Wall Street and to Bankers things like that so you don't you you look at her and you",
            "start": 1402.88
        },
        {
            "text": "crisis uh since the Great Depression uh the house you know the housing crisis um and she's got huge ties to Wall Street and to Bankers things like that so you don't you you look at her and you think sure we're going to put another uh president in the office but is there anything is there any good that's going to come out of that or is it just going to be stasis is it going to be you know are we going to see something that we all thought Obama was going to be or is it just going to be Obama you know not to say that Obama was good or bad and I know that's not the topic but you know um I mean personally I think he actually people give Obama a lot of **** and I think he'll be remembered far better than people think of him right now um but for Clinton I mean you look at it you're like maybe she'll do some good stuff maybe she won't do some good stuff but ultimately she's still backed by money somewhere and that money is going to have an influence and that influence you better believe is",
            "start": 1442.4
        },
        {
            "text": "she'll do some good stuff maybe she won't do some good stuff but ultimately she's still backed by money somewhere and that money is going to have an influence and that influence you better believe is not going to go toward the American people and that's that's the thing I think that's so frustrating is that when you look at a candidate like Trump if it just wasn't Trump that person could actually potentially affect real change because he's not biased he not influenced by anyone no one's got you know they're they're not stuffing dollar bills into his pocket he can do whatever the hell he wants now granted I think Donald Trump probably has a lot of friends who are in high places that would pull favors for him so I don't think he's that candidate but it's just disappointing to see that to see us get that close and then when he opens his mouth he spouts out some of the most outrageous **** you've ever heard someone say and that person could be the most powerful person on the planet and",
            "start": 1478.0
        },
        {
            "text": "us get that close and then when he opens his mouth he spouts out some of the most outrageous **** you've ever heard someone say and that person could be the most powerful person on the planet and don't and make no mistake I I happen to think the president of the United States is probably the most powerful person on the planet so think about that in terms of think about what I just said and then think of Donald Trump's face and tell me that it doesn't wake you up at night and terrify you you know especially when he's when he's homies with Putin just hanging out over with shirtless on a horse with with Putin just chilling practicing Judo that's what they do that's what they do apparently Russia if you didn't know Judo Russia hot bed for Judo activity Tim Gettys shirtless horseback riding uh so I'm I'm of a similar mind that I was last time I think Clinton's going to win um and uh the polls are the polls historically and politically signs Titan before an election so I'm interested to",
            "start": 1510.68
        },
        {
            "text": "uh so I'm I'm of a similar mind that I was last time I think Clinton's going to win um and uh the polls are the polls historically and politically signs Titan before an election so I'm interested to see the polls in about two weeks and of course the polling like the snap polling that happens after the debate tomorrow especially if if Trump's desperate and I think he's going to be desperate I think I think today tomorrow is going to be pretty crazy um but uh you think that's you think we've seen the last of it of the chaos of like the like ACC no because so there's a there's no definitely not there's a few there's a few things that i' I you know I've been talking to people recently and you know people that are into this stuff like I am and starting to draw some preliminary conclusions um and you know no one's no one's gone to the ballot box yet I think that there are definitely shy Trump voters we went into we went into that last time and so I think that you can probably safely add",
            "start": 1548.2
        },
        {
            "text": "and you know no one's no one's gone to the ballot box yet I think that there are definitely shy Trump voters we went into we went into that last time and so I think that you can probably safely add three or four points to whatever Trump's going to pull at and that's what he's actually going to get because there people that are afraid to admit that they're going to vote for him and every Clinton voter is known so there are no secret Clinton voters um now people can swing from independent or from Johnson or Jill Stein or something and vote for her or vote for him I don't know I don't know what's going to happen but I think it's pretty safe to assume that she's going to win um if she doesn't the polling is so catastrophically wrong that we shouldn't even poll anymore that's like the we were talking about last time about the UK and Brexit and all those kinds of how those polls were wrong those polls were wrong by four five six points these polls will be wrong by like 10 points that means",
            "start": 1583.6
        },
        {
            "text": "talking about last time about the UK and Brexit and all those kinds of how those polls were wrong those polls were wrong by four five six points these polls will be wrong by like 10 points that means that the polling is basically just a guess um at that point so there's something to be concerned about there um that said what's becoming clear is that no one likes Hillary Clinton like and and what I mean by that is that Hillary Clinton has this ceiling that's not even 50 points like she's not even getting half of the American people to vote for her um people are vote she's Hillary Clinton is going to be president because of who she's running against she would have lost almost any reasonable candidate and that's and that's becoming so clear and I was talking about that with someone recently where I was like we knew as as conservatives that this moment was going to happen and we just thought we would have a better Champion um than what we ended up having a champion so so terrible that I",
            "start": 1616.72
        },
        {
            "text": "where I was like we knew as as conservatives that this moment was going to happen and we just thought we would have a better Champion um than what we ended up having a champion so so terrible that I actually left the Republican party over it um because I can't possibly uh be with Trump I just why did you do this to is Mitt Romney why Mitt Romney came in or just any almost anyone else so um and I always challenge people like I like Hillary Clinton she's not that bad I'm like name one thing she did as a senator one thing one thing yeah know like no to be fair I couldn't name one thing any Senator done well there's Landmark legislation or or things that people did like what what what did Hillary do other than carpet bag to my home state and use it to a political game she did **** nothing so like that disturbs me like for a lot of New York conservatives and there are many of us she is a disturbing figure even though New York's goingon to vote for Hillary Clinton it's gonna be New York City",
            "start": 1649.24
        },
        {
            "text": "that disturbs me like for a lot of New York conservatives and there are many of us she is a disturbing figure even though New York's goingon to vote for Hillary Clinton it's gonna be New York City that's goingon to vote for Trump is Long Island is almost certainly going to go for Trump you know like and Upstate obviously is going to go for Trump as well the one thing that I feel like is missing though in this election is and I think that this is important information this is what I wanted to talk to you guys about is a lack of empathy for the people that vote for Trump now this is something that's actually starting to annoy me um in a major way I'm not saying that I support Donald Trump because I don't I don't support a lot of the things that's coming that are coming out of his mouth I think he's clearly xenophobic I think he's clearly sexist and I think he's clearly has bigoted Tendencies I think that's obvious but to Parlay that on an entire group of people tens of millions of",
            "start": 1687.32
        },
        {
            "text": "I think he's clearly xenophobic I think he's clearly sexist and I think he's clearly has bigoted Tendencies I think that's obvious but to Parlay that on an entire group of people tens of millions of people is I think becoming a troubling thing and I think it's becoming a it's it's troubling me with the lack of empathy and sincere and and sincere concern that we have for other people in this country um and I printed out two things one of them I actually watched a video and transcribed it from this morning because I was so touched by it and so moved by it that I was like I need to share this with what someone said about Donald Trump's supporters but above and beyond that I before we get to that I just feel like people need to learn how to separate the candidate from the people that support that candidate and uh the issues from the people that might support some issues but not other issues the example I use all the time and I think it's totally salient issue same exact thing is so people",
            "start": 1723.48
        },
        {
            "text": "that candidate and uh the issues from the people that might support some issues but not other issues the example I use all the time and I think it's totally salient issue same exact thing is so people are like well if you vote for Trump then you must support the things he said about Mexicans for instance I'm like okay if you voted for Barack Obama in 2008 you were against gay marriage if you voted for Bill Clinton in 1996 you didn't even believe that gay people should be able to serve openly in the military we we can all play that game right we can all certainly play that game but sometimes people you know like a candidate for certain reasons or very specific reasons and uh they they don't care about or they don't pay attention to or they're so desperate that they don't care about those other issues that that you know trouble someone like me who's in frankly a much more secure place financially who's in who's one of the coastal Elites or whatever from you know I'm from New York I was",
            "start": 1759.8
        },
        {
            "text": "issues that that you know trouble someone like me who's in frankly a much more secure place financially who's in who's one of the coastal Elites or whatever from you know I'm from New York I was educated in Boston I live in San Francisco I do not have a uh a glimpse into Middle America into the Rust Belt into into blue collar America the way that a lot of Trump supporters do and so I wanted to read this to you guys I know some people get mad when I read things for a few minutes but this is really important and I want you to guys and I want you guys to listen there's two things here that I want you guys to hear the first one is from Mike Barnacle he's a he's a writer for uh Boston he's for the Boston Globe now Liberal unabashed Liberal guy he's on Morning Joe all the time which is a show I really like was accused of plagiarism I think in the 90s actually but he's a he's a smart a smart dude and here's what he said about Trump supporters today on on Morning Joe too many people in the",
            "start": 1798.04
        },
        {
            "text": "I really like was accused of plagiarism I think in the 90s actually but he's a he's a smart a smart dude and here's what he said about Trump supporters today on on Morning Joe too many people in the media our business Coastal Elites where a lot of people live or who are in our business don't understand the loss that's taken place in this country over the last 10 or 15 years specifically if you have a 20-year-old son today serving in Iraq or Afghanistan that child was 5 years old when this War Began that's 15 16 years ago then comes the winter of 2008 and 2009 when another loss occurs that shakes the foundation of the culture of the country people lose homes they lose incomes they lose jobs they're unemployed they lose their 401K they lose their life savings and what are they thinking along the course of these years they're thinking this they have no voice in government that they are represented by a professional political class who just keep running for reelection and raising money to",
            "start": 1833.52
        },
        {
            "text": "the course of these years they're thinking this they have no voice in government that they are represented by a professional political class who just keep running for reelection and raising money to enhance their own Futures and their own present status but they don't talk about their lives and what do they read and what do they hear now lately in the last year if they go to a Trump rally they're not going to a Trump rally to listen to a guy who they sort of like what he says without paying attention to who he is they hear and read in the papers that they've Pro that they're probably racist for going to the Trump rally and that they and they take great offense to this and they ought to take great offense we don't understand our lives and we don't cover their lives and I thought that that was a a really interesting and totally salient thing about Trump supporters we don't we here at this table don't understand what it's like to live in a Rust Belt town in Ohio where the **** coal",
            "start": 1868.44
        },
        {
            "text": "was a a really interesting and totally salient thing about Trump supporters we don't we here at this table don't understand what it's like to live in a Rust Belt town in Ohio where the **** coal Factory or the coal mine is shut down and everything's **** for all of them everything you know they live in that the the the the the town uh Town X in Ohio has a Coal Mine the EPA rips the coal mine you know doesn't allow the coal mine to exist anymore the coal miners are out of jobs the people that work at the convenience store are now out of jobs the people that work at the gas station are out of jobs all the service Industries are out of jobs and no one has any money and they're all **** and all they want to hear is someone come in and blast the people that they feel like did it to them and whether or not that they they they're writing that the Washington D.C.'s and corrupt corrupt and liberal policies have done this to them it's not neither here nor there we have to understand more",
            "start": 1898.36
        },
        {
            "text": "and whether or not that they they they're writing that the Washington D.C.'s and corrupt corrupt and liberal policies have done this to them it's not neither here nor there we have to understand more about where these people come from and why they're voting for this man and why they don't trust the political Elite and why they don't trust politicians and Washington and all these things because they **** them you know and that's one of the things where I feel like we don't understand that in San Francisco we don't have that problem we have one of the most bustling economies in the entire world in this city you know I don't understand that where I come from in New York in the on Long Island in the shadow of the biggest city in the one of the biggest cities and most profitable cities in the world or I went to school in Boston which is a very affluent Collegiate place but I tell you right now in Gary, Indiana they know that you know in in West Virginia they hear it and I feel like we have",
            "start": 1938.36
        },
        {
            "text": "world or I went to school in Boston which is a very affluent Collegiate place but I tell you right now in Gary Indiana they know that you know in in West Virginia they hear it and I feel like we have to have a little more empathy for these people than to say like they're racists and they're bigots and they're xenophobes they're not there are some of them that are you know I can point out some **** cartoon characters on the other side too Greg and I walked through Zuccotti Park during the **** height of of of uh of Occupy Wall Street that was this cartoonish as that came off of on TV and I think we can both agree on that there but I never walked around and said those people are **** stupid you know those people are **** pieces of **** I said I I looked at and I'm like you're wrong you have no idea what you're talking about and maybe you can say that about Trump supporters but to to demonize this whole group of people after an election and then expect everyone to come back into",
            "start": 1971.52
        },
        {
            "text": "you have no idea what you're talking about and maybe you can say that about Trump supporters but to to demonize this whole group of people after an election and then expect everyone to come back into the fold what you're going to see after this election because of this kind of **** is a very divisive country where nothing gets done Hillary Clinton's not going to get **** **** done but I mean that is been politics is normal forever I do have empathy for these people I feel **** sorry for them I'm sorry that they are so disenfranchised that they can be duped this easily and the Trump supporters I do see on my Facebook I are the ones I feel the most sorry for family members who have been duped into this **** **** that is the racist **** that is the racist tirade that is posting a **** meme asking if President Obama is a Muslim and wear his birth certificates still to this day like that's what I'm talking about that's where it comes from sure I you're talking about like",
            "start": 2012.16
        },
        {
            "text": "a **** meme asking if President Obama is a Muslim and wear his birth certificates still to this day like that's what I'm talking about that's where it comes from sure I you're talking about like demonizing this whole thing of course this is the problem this is the problem when I see these **** people talking out their ass about the fact of like oh I can't believe we're letting Muslims into this country when they did this when you're talking about well look at any other **** the Unabomber not Unabomber but any other mass murderer who's a Christian I can suddenly demonize all Christians based on the actions of one you know the one bad person spoiling the bunch and that's the problem is that this is never cut and dry but when you're screaming about how terrible Trump is and that he's a bigot and that if you're going to follow him into this you're following somebody like Hitler and da d d da it's extreme it's too far of course but it's trying to talk and trying to get through to these",
            "start": 2049.08
        },
        {
            "text": "and that if you're going to follow him into this you're following somebody like Hitler and da d d da it's extreme it's too far of course but it's trying to talk and trying to get through to these people that have gone so far around the bend that they think that this snake oil salesman is speaking to that Donald Trump knows **** about Gary Indiana that Donald Trump knows **** about being a blue-collar worker as you know my father this construction worker this blue-collar guy in a union and all this other stuff and I'm not at all as you know and and as the listeners know am I trying to claim that I understand what it's like to do that or be there or to be G or being a coal a coal mine I'm not saying that at all I'm saying that I feel sorry for the people who have fallen for that who have fallen for that line of **** that have look looked at Trump and see him come in and are so **** and don't get me wrong this is what I've been saying for years if you watch our **** throughout",
            "start": 2084.36
        },
        {
            "text": "fallen for that line of **** that have look looked at Trump and see him come in and are so **** and don't get me wrong this is what I've been saying for years if you watch our **** throughout the years of what I **** hate about politics is that nothing gets done everyone is a grin **** nobody is saying anything or making any real change here and this is what I keep saying about what I like about this election is Bernie Sanders is Donald Trump not as people not as platforms but as things to come out and say from here on out I really really really really do believe that it's going to be all right cool I'm running for mayor I'm running for Senate I'm running for president from here on out and I'm going to be a normal person and I'm going to finally get back to the America and the the politics you believe in Colin right cuz that's always been the thing with you when I first met you when you were a Republican I was like how can you be a Republican they're anti-gay they're anti",
            "start": 2118.64
        },
        {
            "text": "the politics you believe in Colin right cuz that's always been the thing with you when I first met you when you were a Republican I was like how can you be a Republican they're anti-gay they're anti and you're like well I'm not I don't agree on those issues but we are so far from that part we are so far from that America where we're talking about Colin Greg live today where there can be compromise where there can be discussion where I can be Republican Tim can be a Democrat and we can come across the aisle and actually get legislation done because everything's **** and everything's been **** forever nothing is going to be unfucked by this election and that's the problem and that's what it comes down to with right is the fact that I'm voting for Hillary Clinton I'm of course as everyone knows not super briefed on the Benghazi on this I mean I know I've read a headline I've read an article here and there I I don't I don't understand how people can hate her as much as they hate Donald",
            "start": 2155.28
        },
        {
            "text": "knows not super briefed on the Benghazi on this I mean I know I've read a headline I've read an article here and there I I don't I don't understand how people can hate her as much as they hate Donald Trump but that's fine that's beside the point I'm not voting for her because she's the change I believe in I felt for that with Obama Obama was the guy when he came through and was talking about Hope and he was young and hopeful and I was like here we go it's our generation's JFK it's the this is going to be the guy who gets back in there and brings us back together and some **** way and it didn't happen and I don't put it all on him I put it all on Politics as Usual I put it all on everybody else coming in wanting to gridlock the system and not let anything get done because nobody wants to compromise and we are in to a point where all we do is scream at each other when it comes to political **** whether it be and that's the whole thing with the pundit whether it's MSNBC or Fox News",
            "start": 2190.96
        },
        {
            "text": "compromise and we are in to a point where all we do is scream at each other when it comes to political **** whether it be and that's the whole thing with the pundit whether it's MSNBC or Fox News or whoever it's all the **** same now where everybody just talks talks talks and none of it's worth a goddamn cent and that's the thing here where the problem to back to the point I'm sorry to get so far down on this thing is the fact that I have empathy for these people I feel **** sorry for them I understand that things have gone wrong but you are being duped and I think that's where the hyperbole comes out where people start trying to say that if you follow this man you are ex of course not of course that's some of those people are for sure I can give you examples of those people that have done that or that I've seen or have talked to that are that not everyone is but you say that trying to get to the last Bastion of these people's humanity and intelligence to realize that no you're",
            "start": 2226.72
        },
        {
            "text": "done that or that I've seen or have talked to that are that not everyone is but you say that trying to get to the last Bastion of these people's humanity and intelligence to realize that no you're being **** played y uh first of all kudos to you that was a fantastic and I mean that with all do you know that'be great if it was total sarcasm I've never I've never heard get so political I think I think you hit on a lot of salient points uh and a lot of important points to me I don't necessarily disagree with you that the people are being duped that there are people being duped out there um and that Trump is a snake oil salesman I think that's obvious right it's obvious to me very early on I'm actually really kind of proud of myself that I bailed before he even won the primary you know because I was like and I voted for John Kasich even after he dropped out because I'm like he's the only reasonable person that represents some brand of Republicanism the way I grew up with it and we grew",
            "start": 2261.16
        },
        {
            "text": "I was like and I voted for John Kasich even after he dropped out because I'm like he's the only reasonable person that represents some brand of Republicanism the way I grew up with it and we grew up as New York Republicans a little bit more moderate and a little more liberal than the most Republicans I get that but we we had Rudy Giuliani comes from New York City he's a **** Republican you know George Pataki was our governor in New York he's a Republican but he wouldn't even re Mitt Romney these people are not really recognizable as Republicans anymore and so I agree with you there but I just don't like walking around acting like watching one group of people think that they have The High Ground on this other group of people when they do not understand them you know and their vote counts just as much as another person's vote and their opinions really do carry as much water and as much weight to me as another person's opinion even if they're a blue-collar because what it really",
            "start": 2302.92
        },
        {
            "text": "counts just as much as another person's vote and their opinions really do carry as much water and as much weight to me as another person's opinion even if they're a blue-collar because what it really comes down to a lot for me and this is Fu and this is just being **** honest and this is putting all on the table is that there's a lot of **** bigotry on the coast about people that live in the middle of the country that might live in a trailer that might live in a small home you know that might work in a **** coal mine you know where the hell does your food come from you know where does your fuel come from where do your natural resources come from from they sure as hell don't come from **** San Francisco you know and that's the thing where I feel like people need to need to like wake up to the fact that like we all need each other and we have to figure out a new way to talk about each other and understand these people and that's where you know a lot of people have been",
            "start": 2337.72
        },
        {
            "text": "like wake up to the fact that like we all need each other and we have to figure out a new way to talk about each other and understand these people and that's where you know a lot of people have been circulating to me and I I know we're going along here but I want to end on this I mean I don't personally care but because I know people get upset there there's a there was a Cracked article by this guy named David Wong I don't usually read Cracked but a lot of people were linking me to this article and so I finally read it it's called how half of America lost its **** mind it's really really really great piece and I I've cut out a few excerpts of it um that I that I wanted to read but I also really encourage people to go read it and on their own view counter it's got almost like four million views or something I even read it yeah and this really gave me a lot of perspective and almost put tears in my eyes when I was reading it you know in a in a sense because well I'll read it and and and",
            "start": 2373.92
        },
        {
            "text": "or something I even read it yeah and this really gave me a lot of perspective and almost put tears in my eyes when I was reading it you know in a in a sense because well I'll read it and and and and and so here here's what it says and the guy David Wong from his perspective grew up in one of these Trump communities and he like you know he's like a screenwriter or something now he got out or whatever he says as a kid visiting Chicago is like Katniss visiting the capital or like Zoe visiting the city of the future in this ridiculous book I don't know what he's talking about their ways are strange and the whole goddamn world revolves around them every TV show is about LA or New York maybe with some Chicago or Baltimore thrown in when they did make a show about us we were jokes either wide-eyed naive fluff balls like Parks and Recreation and before that Newhart I love Newhart or filthy murderous mutants True Detective and before that Deliverance you could feel the arrogance from",
            "start": 2407.24
        },
        {
            "text": "naive fluff balls like Parks and Recreation and before that Newhart I love Newhart or filthy murderous mutants True Detective and before that Deliverance you could feel the arrogance from hundreds of miles away nothing that happens outside of the city matters they say at their cocktail parties blissfully unaware of where their food is grown hey remember when Hurricane Katrina hit New Orleans kind of weird that a big hurricane hundreds of miles across managed to snipe one specific City and avoid anything else to watch the news or the multiple movies and TV shows about it you'd barely hear about how the storm utterly steamrolled rural Mississippi killing 38 people and doing an astounding $1.5 billion in damage but who cares about those people right what's newsworthy about a bunch of Toothless Hillbillies crying over a flattened trailer New Orleans is culturally important it matters to those ignored suffering people Donald Trump is a brick Chuck through the window of the elites are",
            "start": 2446.44
        },
        {
            "text": "Hillbillies crying over a flattened trailer New Orleans is culturally important it matters to those ignored suffering people Donald Trump is a brick Chuck through the window of the elites are you **** listening now that was the that was that was one section he wrote and the second one says they're getting the **** kicked out of them I know I was there step out of the side of the city and the suicide rates among young people **** doubles the recession pounded rural communities but all the recovery went to the cities the rate of new businesses opening in rural areas has utterly collapsed see rural jobs used to be based around one big local business a factory a coal mine Etc when it dies the town dies where I grew up it was an oil refinery closing that did Us in I was was raised in the hollowed out shell of what the town had once been the roof of our high school leaked when it rained cities can make up for the loss of manufacturing jobs with service jobs small towns cannot that",
            "start": 2481.68
        },
        {
            "text": "the hollowed out shell of what the town had once been the roof of our high school leaked when it rained cities can make up for the loss of manufacturing jobs with service jobs small towns cannot that model doesn't work below a certain population density if you don't live in one of these small towns you can't understand the hopelessness the vast majority of people's careers revolve possible careers involve moving to the city and around every city is a now 100 foot wall cost called cost of living let's say you're a smart kid making $8 an hour at Walgreens and aspire to greater things fine get ready to move yourself and your new baby into a 700t apartment for $1,000 a month and to then pay double what you're paying now for utilities groceries and babysitters unless of course you're planning to move to one of those neighborhoods and those in quotes in a city you can possibly aspire to start a band or become an actor or get a medical degree you can actually have dreams in a small town",
            "start": 2516.36
        },
        {
            "text": "to move to one of those neighborhoods and those in quotes in a city you can possibly aspire to start a band or become an actor or get a medical degree you can actually have dreams in a small town there may be no venues for Performing Arts aside from country music bars and churches there may be only two doctors in town aspiring to that job means waiting for one of them to retire or die you open the classifieds and all the job listings will be for fast food or convenience stores the town the downtown is just the corpses of mom and pop shops left shattered in Walmart's blast crater the suburbs are trailer parks there are parts of these towns that look post-apocalyptic post-apocalyptic I'm telling you the hopelessness eats you alive and if you dare complain some liberal Elite will pull out their iPad and type up a rant about your racist white privilege already someone has replied to this with a comment saying you should try living in a ghetto as a minority exactly to them it seems like the",
            "start": 2550.88
        },
        {
            "text": "iPad and type up a rant about your racist white privilege already someone has replied to this with a comment saying you should try living in a ghetto as a minority exactly to them it seems like the plight of poor minorities is only used as a club to bat away the cries for or bat away white cries for help meanwhile the rate of rural white suicides and overdoses skyrockets **** at least politicians act like they care about the inner cities and then the final thing he said and this is just these are fragments it really does feel like the worst of Both Worlds all the ravages of poverty but none of the sympathy quote blacks burn police cars and those liberal Elites say it's not their fault because they're poor my son gets jailed and fired over a baggie of meth and those same Elites make jokes about his missing teeth end quote you're everyone's punching bag one of society's last remaining safe comedy targets they take it hard these are people where who come from a long line of folks who",
            "start": 2586.92
        },
        {
            "text": "about his missing teeth end quote you're everyone's punching bag one of society's last remaining safe comedy targets they take it hard these are people where who come from a long line of folks who took pride in looking after themselves where I'm from you weren't a real man unless you could repair a car patch a roof hunt your own meat and defend your home from an intruder it was a source of shame to be dependent on anyone especially the government you mowed your own lawn and fix your own pipes when they leaked you hauled your own firewood and your own pickup truck the rural folk with the Trump signs in their yard say their way of life is of dying is dying and you smirk and say what they really mean is that blacks and gays are finally getting equal rights and they hate it but I'm telling you they say their way way of life is dying because their way of life is dying it's not their imagination no movie about the future portrays it as being full of traditional families hunters and coal",
            "start": 2620.32
        },
        {
            "text": "you they say their way way of life is dying because their way of life is dying it's not their imagination no movie about the future portrays it as being full of traditional families hunters and coal mines well except except for The Hunger Games and now was depicted as an apocalypse so yes they vote for the guy promising to put things back the way they were the guy who'd be a wake up call to the blue islands they voted for the brick through the window it was a vote of desperation and that piece is that piece really almost made me cry when I was reading it and it's on Cracked and he makes jokes in there and every every once in a while but if you even read the comments people are a lot of people are like yeah I don't know what the **** that's like you know what do I know I come from Long Island I grew up in a two-car a house with a two-car garage you know like these people wouldn't have never even maybe even swam in an in-ground pool that was in my backyard you know and all I'm trying to",
            "start": 2652.16
        },
        {
            "text": "I grew up in a two-car a house with a two-car garage you know like these people wouldn't have never even maybe even swam in an in-ground pool that was in my backyard you know and all I'm trying to say is are there bad people amongst them yes you can find plenty of videos of people spouting terrible **** about Muslim people or black people or whatever at these rallies but I'm telling you most of those people that go through those doors are just people like you and me trying to get by you know and they have everything working against them and so all I ask people out there to say is like show a little bit of **** empathy for these people you know especially after the election there's no reason to gloat and there's no reason to **** parade around because you're just going to make it **** worse and and if that kind of **** happens Donald Trump will be back and I'm not saying someone like Donald Trump will be back I'm saying Donald Trump will be back and if things do not go if",
            "start": 2689.28
        },
        {
            "text": "**** worse and and if that kind of **** happens Donald Trump will be back and I'm not saying someone like Donald Trump will be back I'm saying Donald Trump will be back and if things do not go if things do not go right in by 2020 he will win and he'll he'll come back in 2018 be like I **** told you you know exactly what was gonna happen and he'll win so we have to we have to heal these divides in this country that go far beyond race or sex and all these things these terrible things and Donald Trump I'm not saying Donald Trump's a good man I'm not saying Donald Trump is saying anything that's right that's not what I'm saying what I'm saying is I understand where these people are coming from a lot more than I did a year ago and I have a lot of **** empathy for them and I feel bad for them and we can sit around and say like oh we our college educated people you guys are being duped but that's their **** reality and I just don't I mean I agree like every single thing in that",
            "start": 2730.8
        },
        {
            "text": "for them and we can sit around and say like oh we our college educated people you guys are being duped but that's their **** reality and I just don't I mean I agree like every single thing in that article I understand and makes sense to me what I don't understand is what's Donald Trump saying to them like Donald Trump says to them Donald Trump comes in and says like the EPA is going to crush your coal mine you know I'll keep it open and everyone in that town is like great now I don't have to be **** anymore you know or he goes in he goes into a manufacturing town and says like Carrier Air Conditioner left Indianapolis and fired 3000 people we're going to start charging them with tariffs so that they won't leave anymore and then you don't have to be **** anymore those 3000 people that lost their jobs what say all them have nuclear families of three other people that's that's 1000 people that are being affected by this so not only the people that work at Carrier are going to be",
            "start": 2769.88
        },
        {
            "text": "lost their jobs what say all them have nuclear families of three other people that's that's 1000 people that are being affected by this so not only the people that work at Carrier are going to be with with him now their wives going to be with them now their aunt is going to be with them their Grandma their mom you like it doesn't it doesn't I really feel like because of an and I'm sorry an inherently racist or I'm sorry not racist an inherently biased media that is completely in the tank for Clinton I've never seen anything like it totally the WikiLeaks shit's coming out all the shit's coming out all they want to talk about is Donald Trump right they'll do anything the the three versus one thing where you said that was Fair that's not fair you know they didn't challenge anything Clinton said they didn't ask anything about she answered questions he didn't answer questions they were challenging him answering the question they were moderating asking questions she'd answer he wouldn't",
            "start": 2808.12
        },
        {
            "text": "answer he would just say emails emails emails I'm going to arrest you say she was saying things that weren't true too though I mean PolitiFact played that out and they could have easily gone after I'm not saying question about but she answered them whether or not it was true or not she answered it that he didn't answer the things and the thing about the there's a difference here to me where it's like nobody is voting for for Clinton uh because she might have killed someone or whatever and because of the Benghazi and because of all this there are people voting for Donald Trump because he's a bigot and racist that's disturbing sure there there absolutely are I'm just saying that you can't paint with a broad brush this entire group of people that are **** desperate that's all I'm trying to say",
            "start": 2849.68
        },
        {
            "text": "and racist that's disturbing, sure there there absolutely are. I'm just saying that you can't paint with a broad brush this entire group of people that are **** desperate, that's all I'm trying to say. Like they're just desperate, you know? And so I, like I said, there are some racist and some bigots and all those kinds of things that's going to happen in a more conservative, frankly, uh, society where they don't want societal change, they don't want gay marriage, they don't want I understand that. I'm not defending it. All I'm saying is that like we have to, like people in general have to stop giving these people the finger, you know? Like bring them along with us. This is why I always said about about gay marriage when I, you know, I I've been a long time supporter of gay marriage long before anyone in the Republican Party was for it. And what was so ironic about and what's so ironic about someone like Donald Trump is he stood at the at the I couldn't even believe this where he stood at the convention",
            "start": 2885.36
        },
        {
            "text": "Republican Party was for it. And what was so ironic about and what's so ironic about someone like Donald Trump is he stood at the at the I couldn't even believe this where he stood at the convention talking about how he wants lesbian rights, how he wants all these things. I was like, what? Like you have to be the guy that **** says this first, not someone that can win, you know? Like like so, well, don't count him out yet. He very well might. So to me it's just like I want to just speak out there to all those people. I'm not defending anything that he said. I my my record, my own record is clear. Like I I spoke with my feet by walking away from a party that I once worshiped growing up, you know, that I once really believed in and and it doesn't exist anymore. And I recognize and acknowledge that and I want to be part of rebuilding the GOP or rebuilding a new party that speaks for people like me. So I'm not I'm not saying that Donald Trump's the answer. I'm not saying Donald Trump's going to fix these",
            "start": 2928.04
        },
        {
            "text": "to be part of rebuilding the GOP or rebuilding a new party that speaks for people like me. So I'm not I'm not saying that Donald Trump's the answer. I'm not saying Donald Trump's going to fix these guys. He walks in, he has no he doesn't know the first thing about getting the EPA off those coal mines. That's not what's important. What he's saying is that he's going to do it. And since what you were saying was that it doesn't matter if she's telling the truth, well, it certainly doesn't matter if he is either. You know, these people are hearing what they want to hear. And when they go to a rally to hear the man say, uh, your car, the car manufacturers are, you know, are not going to invert anymore or whatever is going on, invert their businesses and go to another country to save money or whatever. They just want a job. They just want a career. They don't want a a bureaucrat in Washington saying, we'll give you, hey, 55-year-old man that worked at a car company for 30 years, we're gonna we're gonna train you to do",
            "start": 2967.16
        },
        {
            "text": "want a job, they just want a career. They don't want a a bureaucrat in Washington saying, we'll give you, hey, 55-year-old man that worked at a car company for 30 years, we're gonna we're gonna train you to do something else. The guy's like, I'm 55. I just want a secure job so I can retire like I was promised, you know, 30 years ago. He's not out to hurt a gay person. He's not out to hurt a Black person. He doesn't even care, you know? That's I really feel like the normal person voting for them. And I just want to show empathy for those people. I hear you. It's not even sympathy, it's just empathy. I well, it's sympathy for me and it's feeling sorry for them again. And I think what you're saying is it's they just want this. They and for me, a lot of times in what this is coming down to with Trump supporters that aren't in the I'm crazy racist whatever Camp is that they just want the easy answer and none of this has easy answers. And my example of this is like we're talking now about something I do know incredibly",
            "start": 2999.12
        },
        {
            "text": "in the I'm crazy racist whatever Camp is that they just want the easy answer and none of this has easy answers. And my example of this is like we're talking now about something I do know incredibly well when living in Missouri in the liberal town of Columbia, Missouri, then going out to Hallsville, going going out to Mexico, Missouri, going out to Booneville and covering for the newspaper, whether it was the Columbia Tribune, whether it was the Columbia Missourian, and living in that community for five and a half years in knowing what it's like to go to Hallsville and have that be a town that **** revolves around the basketball team and Friday Night Football or going to Hermann, Missouri and it's all about the wineries and all these different things, right? Like I'll never forget being in downtown Booneville where they were having a rally to try to stop the wall, the Walmart from moving in or whatever the new Walmart they wanted to put out there or whatever. And I'm doing my job as a reporter. I'm",
            "start": 3039.12
        },
        {
            "text": "where they were having a rally to try to stop the wall, the Walmart from moving in or whatever the new Walmart they wanted to put out there or whatever. And I'm doing my job as a reporter. I'm being objective. This is taking their this person, the rally side, getting the Walmart side, putting it all together from my article. But the fact of how terrified these people were about this coming in and taking out the small town business. Now granted, it's hard to give you structure. Booneville, what? Uh, it's been a while. We'll say 30 minutes outside of downtown Columbia. Not far. In Columbia, there's now I think five Walmarts, maybe four Supercenters. I don't know. It all runs together because I don't live there anymore. But at the time, Booneville, not far from a Walmart to put a Walmart down there. But the the terror in the Main Street and they're already being closed up shops and them being there saying like, this is going to be so bad for local businesses, da da da da. The problem is is that it's what we always talk",
            "start": 3078.08
        },
        {
            "text": "in the Main Street and they're already being closed up shops and them being there saying like, this is going to be so bad for local businesses, da da da da. The problem is is that it's what we always talk about and I'm being very reductive here. Obviously, these are huge problems. But it's what we talk about with video games, a vote with your wallet. The reason Booneville's Main Street collapses is the fact that the community starts stops going to Main Street. They go to wall, they go to Walmart. If if if everybody who's at this rally is like, I'm not going to go to Walmart because it's easier and it's cheaper and it's this. I will go to Hank's Toolbox down here and get whatever the hammer I need that keep Hank in business. But when it they when they give up the ground and they go and they have that one moment where they're like, I'm already here and I'm buying something else, I might as well get the hammer here and not go to Hank's. That's when everything starts collapsing upon itself. I feel like it's",
            "start": 3116.72
        },
        {
            "text": "moment where they're like, I'm already here and I'm buying something else, I might as well get the hammer here and not go to Hank's. That's when everything starts collapsing upon itself. I feel like it's the same thing. Now I can't I'm stupid as everyone knows. I'm not throwing that out there. I'm not I don't have a business degree. I don't have a community management degree or some **** like that where I can tell you how the people who are getting laid off from Carrier are able to do that. I would say don't buy Carrier products anymore. Start a revolution and a campaign and do all these different things to try to stop that. But it's when you look to somebody, one person to be the solution to that, when Trump would clearly come in and I doubt keep the coal mine open or have the power to probably through a million other things. But then on top of that, the fact of like how as a businessman whose ties are made in China and all this other, he's clearly just **** lying. And why why I understand he",
            "start": 3155.0
        },
        {
            "text": "through a million other things. But then on top of that, the fact of like how as a businessman whose ties are made in China and all this other, he's clearly just **** lying. And why why I understand he sounds like the easy answer, but the the solution here is that there are no easy answers. And it's the same thing with the divide we're talking about, you know what I mean? Even what you're saying of bring those people along with us, get them I I think that's when people are saying he's a racist, how can you follow this guy and not be a racist? They're not trying to say they're the racists are trying to wake somebody up to get on their side and do it. It's not the best way. Obviously, it's get closer and closer and the ads get worse and worse and the the fervor gets worse and worse and the debates are going to get worse and worse. That gets to this really, you know, crazy tipping point. But then it is going to be the thing that you're talking about is like if there's a **** God, Donald Trump loses,",
            "start": 3187.48
        },
        {
            "text": "going to get worse and worse. That gets to this really, you know, crazy tipping point. But then it is going to be the thing that you're talking about is like if there's a **** God, Donald Trump loses, right? And then it's going to be that he's still going to be spouting all this hate and trying to rally those troops. And it's going to be what does that what I hope happens is what you're saying is like, yeah, his people are disenfranchised. Uh, and and let's say even Trump wins, Clinton's people are disenfranchised. I'm hoping that when we get four years from now, we do have a candidate who is what we're talking about, who is let's bring this together. I I this is the good and that's bad. And I realize you should think I should think are both are good, but they're not. You know what I mean? Like hopefully this is the wakeup call. And if it is that Trump loses, I hope his disenfranchised base can find somebody who is giving real answers and real solution and real, you know, ideas. Yeah, yeah, I feel like you",
            "start": 3224.76
        },
        {
            "text": "this is the wakeup call. And if it is that Trump loses, I hope his disenfranchised base can find somebody who is giving real answers and real solution and real, you know, ideas. Yeah, yeah, I feel like you know, I felt like with Bernie Sanders who brought out a lot of vitriol on me because I thought he was just so off base. I felt like a lot of the things that he spoke to with people were very similar to what Trump says in in the same vein. It's just that those people were from Massachusetts, those people were from California, those people were from Oregon, those people weren't from necessarily Iowa. I'm not saying that they didn't exist there. What I'm saying is like they were Coastal Elites talking to other Coastal Elites. And it's like a whole it's a whole thing where it's like these people were those kids were desperate too. I but the the difference is like I didn't go around walking around calling them Bolsheviks, you know? Like I didn't walk around calling them, you know, Stalin, you know what I mean?",
            "start": 3260.04
        },
        {
            "text": "kids were desperate too. I but the the difference is like I didn't go around walking around calling them Bolsheviks, you know? Like I didn't walk around calling them, you know, Stalin, you know what I mean? Like and and that's that's the difference. I think Bernie Sanders is **** wrong and I think the people that like followed him really were like had a similar hopelessness about similar college debt or about how they're going to afford their healthcare and all those kinds of things. But I still had deep in me sympathy. I even had sympathy for me when call like socialist, right? Which I mean like I know some of his policies are socialism, whatever. But I mean like when you're but then you're throwing that on the people, the people who are supporting him and aren't socialists, sure. Is that the same idea of them getting rallied up and then they're just taking that as bile? Uh, not to not to the level of you're a **** racist and you're a bigot. Yeah, but I mean socialist isn't necessarily pejorative, you",
            "start": 3304.56
        },
        {
            "text": "of them getting rallied up and then they're just taking that as bile. Uh, not to not to the level of you're a **** racist and you're a bigot. Yeah, but I mean socialist isn't necessarily pejorative, you know? And we have pieces of socialism in the United States. I mean, anyone can deny that. What I used to make fun of was when everyone was calling everything socialism when Bernie Sanders was running. I'm like, I'm sorry, the military is not socialist. The Romans weren't really socialists. I hate to tell so, you know, uh, I feel like, yeah, I've been guilty of it too in my own way, but never to the degree that I see, never ever to the degree that I see people talk about Trump supporters. And all I'm saying is these are human beings that mean just as much as you and I, you know, that have the same dreams and aspirations. At the end of the day, everyone just wants a security. They want a job. They want a family that they can take care of and support. And so all I ask out there, it's the same thing where it's like",
            "start": 3344.64
        },
        {
            "text": "aspirations. At the end of the day, everyone just wants a security. They want a job. They want a family that they can take care of and support. And so all I ask out there, it's the same thing where it's like the vitriol goes too far sometimes. It's fun to play games and and you know, I talked plenty of **** about the candidate Bernie Sanders and I've talked plenty of **** about Donald Trump the candidate and I talked plenty of **** about Hillary Clinton the candidate. But I didn't trivialize tens of millions of people by reducing them to a fascist movement in Nazi Germany, for instance, you know what I mean? Everyone everyone's saying like, I'm like, yeah, I see shades of fascism what Trump does. I don't see shades of fascism in the Republican Party, you know? I don't see shades of fascism in many of the supporters that don't even know what that means, right? This isn't the Weimar Republic and Trump isn't Hitler. So like we have to kind of ground those kinds of things and just learn a new way to talk to",
            "start": 3380.76
        },
        {
            "text": "supporters that don't even know what that means, right? This isn't the Weimar Republic and Trump isn't Hitler. So like we have to kind of ground those kinds of things and just learn a new way to talk to each other. And I I I want to put the the foot forward with that as well. I can learn from that. I'm not saying I'm not trying to trying to say I'm above reproach either. But I've certainly not thrown around the level of a I've seen thrown around a Trump supporters calling them **** stupid and ignorant and and rednecks and all these kinds of things. Hey dude, like, you know, that's not cool, you know what I mean? Like that's just like at some point like you wouldn't want to be where they are. And that was the point of the Cracked article is like if you were where they are, you'd be voting for Donald Trump too, you know? And that's the and that's the only thing that I want to say. So I appreciate you guys, you know, uh, humoring me. We'll return to this maybe around the election and talk about it one more",
            "start": 3419.08
        },
        {
            "text": "too, you know? And that's the and that's the only thing that I want to say. So I appreciate you guys, you know, uh, humoring me. We'll return to this maybe around the election and talk about it one more time. But um, just to see, you know, um, but you know, that was one of the major things that I walked away from recently. It's just like, and maybe it's just a to be learned is we're supposed to be like the same country. Yeah, that went out the window a long time ago though. It'll be interest to see if we can ever get back to that. So anyway, thank you. I hope it resonates with I say it all the time and I don't mean it as a joke. 9/11 was the last time we were unified on anything. And that was like such an amazing time because it was so horrible. But God did it feel good to see one United America. And we made a lot of bad decisions. We did a lot. We didn't use it in the best way. But it was awesome that for one time it seemed like everybody was on the same page in my lifetime, I should say, you know what I mean? I",
            "start": 3457.0
        },
        {
            "text": "of bad decisions. We did a lot. We didn't use it in the best way. But it was awesome that for one time it seemed like everybody was on the same page in my lifetime, I should say, you know what I mean? I don't count the Iraq War. I was a little baby. I don't or second grader. I don't remember the political landscape. But that was because I think it was **** before 9/11 with two sides fighting each other for stupid things and being petty children and getting elected and not doing God a goddamn thing. And then 9/11 brought us together where it seemed like, cool, it is going to be bipartisan. We are going to work together. We're going to make things happen. And then of course, we went back to business as usual with a few changes like the TSA. Matt, what's your topic? Oh, I'm sorry. Wow, that's a lot. Yeah, it's heavy. Amazing though. I listen to it on the ride. I'm so excited because I love you. Thank you. No, I mean it because it's just like education and interest and you also it's so quick too. I don't think that fast. I never",
            "start": 3495.0
        },
        {
            "text": "amazing though. I listen to it on the ride. I'm so excited because I love you. Thank you. No, I mean it because it's just like education and interest and you also it's so quick too. I don't think that fast. I never think that fast. So this is I love it. No, thank you very much. No, it was um, well researched. Uh, did I have a topic? I don't know what I did have a topic. Well, you invited me back to I mean, it's not as serious as no, I no, that's why we break it up that way. Thank God. Yeah, no, I mean because this is I I just I feel guilty now that I don't know enough. So now I have to go you got to go learn wife hold in a class, I think. Yeah, apparently we Google like you think you could call her and just after we stretch and get all that gas out, we can like vote correctly. Yeah, because I I just don't want to be I don't want to make the wrong opinions on the election. Oh, I bet she does right after her Alm. You want to tell mix stories? You want to talk about Midlife Ballers? I mean, I was excited, uh, when I forced Nick to have me",
            "start": 3533.96
        },
        {
            "text": "make the wrong opinions on the election. Oh, I bet she does right after her Alm. You want to tell mix stories? You want to talk about Midlife Ballers? I mean, I was excited, uh, when I forced Nick to have me on the show, uh, today for come on Kevin together 45 **** minutes. He's over here like amazing monologue. I start talking, you drop your keys. That's a fine monologue. It was a yeah, 45 minutes. I mean, there's a timer right there. No, I didn't I wasn't correcting you on the Tim. Oh, I'm I apologize saying it was fine. So when did I come on the show last? I know it's horrible. Like he it's like still in the spare bedroom. It was a long time ago. Yeah, that was the last time. I think it was earlier this year. Yes. So when then in in that it was yeah, it was uh, I don't know, 10, 11 months because we August something. Yeah, somewhere in there. And uh, it was an idea. This this show was an idea, Midlife Ballers. And so I was excited to come back and tell you how things are going. How's it going? How so Midlife Ballers in a nutshell?",
            "start": 3581.24
        },
        {
            "text": "in there. And uh, it was an idea. This this show was an idea, Midlife Ballers. And so I was excited to come back and tell you how things are going. How's it going? How so Midlife Ballers in a nutshell? You're ripping off our formula. It's a podcast. Actually, we started doing that. We started ripping it off and went, there's no **** way we can do this much ****. Like, you know, Chris and I, producer Chris is actually here for those of you that give a ****. Chris, he's in the back. Um, yeah, he doesn't have a fancy microphone like Kevin, but he does throw it down when it's time. But it's super fun. Uh, and it's really hard to be an adult to have adult responsibilities. Like Jason has kids and he's always getting new jobs. Like last night he texted me and said, I think I'm the general manager of the restaurant now. And I went, how did that happen? Weren't you just like a bar manager? And he said, no, I'll tell you later. And um, so his schedule constantly changes and just trying to get the show together. But we",
            "start": 3624.32
        },
        {
            "text": "now. And I went, how did that happen? Weren't you just like a bar manager? And he said, no, I'll tell you later. And um, so his schedule constantly changes and just trying to get the show together. But we figured out how to make it better for us if that makes sense. And then uh, we decided to maybe try Patreon. So let's check it out then. So Midlife Ballers YouTube channel podcast you're making. Yes, you started start off. You wanted it to be weekly. It is still weekly. Is it really? Because I remember when episode one went up, there was a long s like it wasn't going up that often. The pilot just the pilot. Did you get did you get an official set? You still have the concrete wall? We had two videos that came up to like say this is coming. And then once we started, it was 30 what? Episode 38. So it's 38 weeks ago. Okay. We've shot some doubles, which I don't like doing where you like do two episodes in the same day because by the end of it, I'm just like, I mean, I can't I I like it to be sympathize little fresh. No, I know.",
            "start": 3665.4
        },
        {
            "text": "shot some doubles, which I don't like doing where you like do two episodes in the same day because by the end of it, I'm just like, I mean, I can't I I like it to be sympathize little fresh. No, I know you guys. I appreciate that. And also like I could, you know, love and sex stuff is kind of like that where you would want to be more efficient. But it's actually better if we don't let Jason talk that much or me because then at the end of it, Chris will start making faces at me and I'll go, man, I need another Red Bull because this is like, I can't I'm not funny. I can't do another beat box. I can't do anything. But it's better to do and it's exciting because, you know, he fights the traffic and we have to clear our schedules. And then we get there and even Chris two episodes ago, um, something happened where he was **** crazy angry. It was like a client or something. Something went bad. Somebody **** something up. And by the middle of the episode, he was laughing and it was like he was relaxed. And then he was",
            "start": 3705.24
        },
        {
            "text": "**** crazy angry. It was like a client or something. Something went bad. Somebody **** something up. And by the middle of the episode, he was laughing and it was like he was relaxed. And then he was throwing us stuff that we could talk about. It was so it's it's more therapeutic and it's fun for us. But then, you know, a lot of people are like, hey, we would love to support you on Patreon. When's that going to happen? And Chris is like, why don't we just try it? And I was like, well, because if you look at the Bible of online content written by Kinda Funny and Tim Gettys, we're not supposed to launch that. And he's like, **** that. Let's let's just do it. Let's just do let's do us and figure out. No, I didn't say ****. Well, that sounds like I mean, I literally went around Tim because we don't have I would have told you to do that day one. Why not? No, well, I mean, because I well, I'm I'm a little more conservative because I want to see where it's going. And then and then ultimately I wanted more. And Chris goes,",
            "start": 3743.08
        },
        {
            "text": "have told you to do that day one. Why not? No, well, I mean, because I well, I'm I'm a little more conservative because I want to see where it's going. And then and then ultimately I wanted more. And Chris goes, no, no, no, no, no, let's just let's just do the podcast. Let's just get this together and get it right. And so far we have like we hit our NE we have a little the tier system and and uh, people are starting to donate a little bit. Wait, hold on. So the Patreon is live? Yeah, it launched a week and a half ago, two weeks now. Now you got Tim mad because you missed you launch the Patreon without talking to me about the launch of the Patreon. Bad news. You miss around. I didn't read all of the book. Yeah, no, looks like you didn't even get it from the library. Page one on Tim's book has always talk to Tim Gettys. Okay, here's the thing though. Never tell anyone you talk to Tim Gettys. We okay. So it it yes, it launched and we were excited. And honestly, you guys are so busy that dude, I got the Patreon spiel down to a",
            "start": 3783.88
        },
        {
            "text": "here's the thing though. Never tell anyone you talk to Tim Gettys. We okay. So it it yes, it launched and we were excited. And honestly, you guys are so busy that dude, I got the Patreon spiel down to a science now. How many launches we've helped at this point? All all of them. Every single Patreon that exists. What are we doing? What are we doing right? Well, this is what I'm that's why I want that's why we wanted to try it and make sure that it was all working and everything was organized. So now that it's up, it's only been a week. Yeah, and a half. And this episode's going to drop when it drops. And then we haven't even done like the exclusive stuff. I mean, we literally just got one guy that gave us a tier where I have to now like give them because one of our tiers is I do live beatboxing for them so they can have a I know, right? And I like and uh, and so I have to come up with like it's a limited thank God because I think producer Chris was like, no, no, if people give us like 10 bucks a month, you got a",
            "start": 3822.8
        },
        {
            "text": "they can have a I know right and I like and uh and so I have to come up with like it's a limited thank God cuz I think producer Chris was like no no if people give us like 10 bucks a month you got a beatbox and I was like that's not happening cuz I'm not going to just spend all day just you know ticking and drooling on a microphone we need to make it maybe give me a motivation for that and then do I is it like a ringtone anyway so we we had fun coming up with all give me some box right now a sample um well normally when I open the show gave you 10 bucks it's not 10 bucks gave you whatever the hell the **** can you hear this Kevin yeah you can hear uh okay so earlier I thought you might want that and so I was like what would I do if I was sitting next to Colin and so I popped on Spotify and got a little 311 in my ear and it was like yeah yeah that's my light one too that's like fantastic I love you so much so that was for you cuz I missed you from last time I",
            "start": 3861.96
        },
        {
            "text": "Spotify and got a little 311 in my ear and it was like yeah yeah that's my light one too that's like fantastic I love you so much so that was for you cuz I missed you from last time I appreciate that yeah Chris was cuz we we were sharing a room so I was like in the shower listening to as many 311s as I could to get like what if they asked me to beatbox I got to I got to do it for my boy cuz he's probably going to rant for 55 minutes about politics and I don't vote so this is going to be a **** horrible conversation I didn't mean to alienate you with the first no you didn't alienate me but like I was so in like I just want I want to vote for you cuz I want to see you we all want to vote for fix it or really break it either way it be going to kill somebody right now with that wrist right there why wouldn't you want to vote for me what did I do are Dark Knight I don't know I just we can't lose you yeah I don't know me and you I think don't agree on a lot of things you're",
            "start": 3900.4
        },
        {
            "text": "wrist right there why wouldn't you want to vote for me what did I do are Dark Knight I don't know I just we can't lose you yeah I don't know me and you I think don't agree on a lot of things you're not the president I would vote for to be fair no one had this table some of that I would be a dope president I'm just saying uh Nick you wouldn't even show up like awesome president like wake me up at noon you would kill yourself give me a list of **** that you need yes he assassinate himself no he would just under the stress he would just they find him his office there would be **** thrown out of the oval like just flying and then there'd be a little guy with like a cool quiff and he's like God damn it St maybe maybe his assistant now are you talking about Mel Gibson over there yeah it's like Mel Gibson I asked him where you know Murtaugh was yeah right **** he is not too old for this **** he's in spill water on that lightboard okay I I want I want him to keep growing it out until he",
            "start": 3960.08
        },
        {
            "text": "Mel Gibson I asked him where you know Murtaugh was yeah right **** he is not too old for this **** he's in spill water on that lightboard okay I I want I want him to keep growing it out until he can actually legit or whatever that is a little switchy switch that you don't don't use anyways yeah I so what can we do the show yeah no this is what I was going to ask you is this a taste of Midlife Ballers what is when I beatbox no this what everything that just happened what what is Midlife Ballers you still haven't sold it to the kids you haven't told them what they're getting into we should give them a taste of Midlife Ballers um I mean Midlife Ballers is what it needs to be at that moment for us Jesus God what the **** does that mean it's the Batman of podcast don't help him don't I have to I sort of invited him on the show so I feel obligated I feel like when I was like Hey What Can I be on the show and you were like hold on I have to call Greg yeah it's Greg show okay Greg just got back to me",
            "start": 3996.76
        },
        {
            "text": "invited him on the show so I feel obligated I feel like when I was like Hey What Can I be on the show and you were like hold on I have to call Greg yeah it's Greg show okay Greg just got back to me yes you're allowed in the building you're funny I I don't book people I don't book guas on other people's shows okay I don't book guas period I don't I I still don't know like he came back from Morocco and was like I'm walking my dogs and I'm talking to him and he's like yeah this and that and I go yeah and the Patreon channel is doing well he goes Hold Up Wait you on Patreon and I was like yeah you were out of town well I would have expected you have waited for me to come back in town and then coordinate I thought about all of that we could have helped on the launch and push more people toward you I know cuz we believe in you but we're doing that now no I mean making me question it we kind of want decision what do you mean questioning my decisions if he's he's questioning if he backs you",
            "start": 4034.6
        },
        {
            "text": "you I know cuz we believe in you but we're doing that now no I mean making me question it we kind of want decision what do you mean questioning my decisions if he's he's questioning if he backs you here's what I need Tim for for Matt Midlife Ballers and everyone watching top three Patreon tips top three Patreon tips uh Chris is taking notes make your most valuable thing your cheapest thing so whatever's at a dollar the entryway the gateway drug into the Patreon should be the most Val so like our bonus episode I think our bonus episodes of the shows are our most valuable thing sure okay so you do that um second off don't have too many tears make sure that it's all we main you want to focus on you never even looked at your Patreon the one to $5 one tier it's $1 500 the $1 to $15 tiers are the most important okay and those should all be content focused so they should all be about they should all be based on stuff you're already doing correct that's what we're doing good great okay so",
            "start": 4069.84
        },
        {
            "text": "the most important okay and those should all be content focused so they should all be about they should all be based on stuff you're already doing correct that's what we're doing good great okay so you're doing you're doing exclusive it's early stuff early videos early audio early goodness and then I know I mean then we came up with some fun options that people want and so far we've gotten you know like the other day I got a got a $100 a month subscriber that's nice and uh he is going to get all kinds of cool stuff including the beatbox so I have to come up with something I like the be making up as you go $ tier cool stuff you know we'll figure it out don't mean I got to give uh producer Chris credit I mean like we really kind of spent a couple weeks going back and he did a lot of research also like we shot a little video intro video and we were very specific and we did a whole night of sh there's a lot of footage of me running around half like at one point we were a little drunk and",
            "start": 4118.0
        },
        {
            "text": "also like we shot a little video intro video and we were very specific and we did a whole night of sh there's a lot of footage of me running around half like at one point we were a little drunk and there's we Jason and I are in like robes and of course then I talked and I was like well she AAR break fat person like I was like really and he's like we can't use that and I was like just keep it in the can just in on our podcast and saying it that yeah no no no I meant the the video of me running around tucked you totally could you just blur you Mosaic out I mean I know he knows how to do it but no there's no sh I was like let's not do that let me lose a little bit of weight and remember also we were coming cuz I I'm 8 weeks after my surgery so I just had my I just had hernia fixed yeah I I'm hernia yeah what happened hernia I you uh actually I was sitting on the toilet and I sneezed is that true mhm wow ripped up the universe works in unusual literally literally I had been I had been",
            "start": 4160.8
        },
        {
            "text": "I I'm hernia yeah what happened hernia I you uh actually I was sitting on the toilet and I sneezed is that true mhm wow ripped up the universe works in unusual literally literally I had been I had been lifting a lot my wife said let's move to Northridge and then let's move back but we hadn't moved back yet and so I was moving a lot of boxes and and I'm like going back and forth and I'm lifting and I'm gaining weight because it's fun and then all of a sudden I had this I had a cough cuz I have bronchitis and sometimes I I sat down pooping I was well of course I poop I poop like I mean it's like like five six times before noon so I was on the toilet in the guest bathroom and I was about cuz you're blowing it up uh if you really must know because in our 1940s house if a **** in the main bathroom they re after the earthquake in Northridge they redid the plumbing and there are two 90° turns and the guy from the plumbing company said that toilet's always going to have issues if you're ****",
            "start": 4198.12
        },
        {
            "text": "they re after the earthquake in Northridge they redid the plumbing and there are two 90° turns and the guy from the plumbing company said that toilet's always going to have issues if you're **** loading it up with butt wipes and man turds and so I was like then then that's **** horrible so where can I **** he's like **** in that toilet cuz it's a straight run to the to the street and it used to piss my wife off she's like why are you **** in the guest bathroom and I was like a because there's a window in B because I need of all my travels he was the most human yeah like I just shot that **** I just shot him right out put into space yeah so much so but that was the truth cuz form follows function so I was like this is my toilet and so uh yeah I was just sitting there and I was like like that and it just went just popped out of my belly button and then after no no dial back cuz I I had a hernia as a baby I don't remember I tried to lift my mom I imagine what does a hernia",
            "start": 4247.24
        },
        {
            "text": "like like that and it just went just popped out of my belly button and then after no no dial back cuz I I had a hernia as a baby I don't remember I tried to lift my mom I imagine what does a hernia entail what did it pop is it intense pain immediately is it no not at all it literally happened and then I was cuz you know in some of those moments uh it's better if I don't wear a shirt of course so oh I know that I overheat when I poop some sometimes I get totally naked if I can get naked I get naked that's no this is what like what three four episodes ago we covered The Squatty Potty which I've got some on order cuz we're going to test that and do a market research on it cuz I the I I tried it with my wife she has a little stool to get up to her closet and and almost fell off anyways it's not it's was too high it needs to be lower and I'm also fatter now so I can't really roll like those those drawings don't do angled this way a little bit it's just 14 you need 14 in or there are women",
            "start": 4290.88
        },
        {
            "text": "it's was too high it needs to be lower and I'm also fatter now so I can't really roll like those those drawings don't do angled this way a little bit it's just 14 you need 14 in or there are women and men that can stand on the top of the toilet that is not me or you can go out and just **** in the woods I felt like just get out there and **** in the woods wait what stand on top of the toilet yeah that's why if you've seen these these EP there are there are like sketch bits online I researched it where people are perched on the top of their toilet like I'm not even that's not a joke I was listening Tak a non I was listening to Daniel Tosh the other day on I think it was Spotify and he has a great joke about how you he's like did you know you could sit the other way on the toilet oh yeah and he eats spaghetti andere an old yeah yeah he goes hold on hold on a minute that's a great yeah that's a that's a funny sketch I don't actually sit that way but um no I no one sits that way that's",
            "start": 4333.4
        },
        {
            "text": "and he eats spaghetti andere an old yeah yeah he goes hold on hold on a minute that's a great yeah that's a that's a funny sketch I don't actually sit that way but um no I no one sits that way that's no I mean but you can you have to take your pants off all the way but yeah I had my shirt off and I sneezed and then I looked down and there was like a little like nubbin sticking out of where I used to have a belly button so what happen ibly don't like this story why no but for Tim's own visual picture how deep is your belly button cuz something could pop out of my belly button I I would not well first of all it was right above the belly button so essentially what happens an umbilical hernia is you get a little tear and then a little tiny skin pops out it's not at one point somebody's like oh your intestines no your intestine is not going to pop out of a little tear but after a year and a half of working it ripped to two fingers so then I had a little bit more mushrooming so the guy's like",
            "start": 4370.56
        },
        {
            "text": "your intestines no your intestine is not going to pop out of a little tear but after a year and a half of working it ripped to two fingers so then I had a little bit more mushrooming so the guy's like we might want to fix this and I was like let's **** rock this so eight weeks ago no you a coup incredibly fun Parts where you get get drunk and then make me push it back in oh that's the other thing so the guy forgot he grab my like I don't want to do this like thect first doct saw at Kaiser in Woodland Hills who was this guy on his cell phone young kid and they were like you got to see The Specialist because he's like like the ER doc from like you know whatever Saudi Arabia or something no he he was like a battlefield Tech like in the military and then he came back so he's like super young and has this cool technique so he's on his phone and he's like oh let me see and for those of you watching I'm touching Colin's belly he said yeah it's umbilical okay let me try and then he popped it",
            "start": 4410.52
        },
        {
            "text": "and has this cool technique so he's on his phone and he's like oh let me see and for those of you watching I'm touching Colin's belly he said yeah it's umbilical okay let me try and then he popped it back in and it made a little sound in my ears and I was like who sourness in my tummy and he's like cool just keep pushing it back in and we'll figure it out eventually you should lose some weight and and and and uh and don't sneeze and then and you get it back in and then we're good no I'm not even kidding about that and so he pushed it he pushed it back in I was like great so I'll just do that and then it got worse and then I Then I then we get to a point where I couldn't push it back in and so I to to lay down and rest and ice it and push it back this is all in a book that you can you can read you can research online similar to Tim's Patreon book yeah I jumped to the end and it just said don't get a anyway so I got the surgery the amazing part about this is he gets the surgery and I was like oh",
            "start": 4454.48
        },
        {
            "text": "research online similar to Tim's Patreon book yeah I jumped to the end and it just said don't get a anyway so I got the surgery the amazing part about this is he gets the surgery and I was like oh let me see the scars right and he lifts up his shirt and I'm like this is interesting because For the First Time I **** you not in probably 0 years Matt has chest hair now because he can't shave nope this area because the scars are too new I guess I assume I chose not to shave when I was with you on Sunday when we were watching the show but I have since remedied that oh it's you're bald again yeah but I just trim it I can't stand here we're not going to look at it online it's disgusting I need it's block camera I want to see the scar let me block the camera Kevin only keep it on the wide why doesn't he block the camera and Flash all of you guys why don't you take your pants off right now all right go ahead show me the scar here uh I can't even do no it's not they're laparoscopic scars oh",
            "start": 4492.8
        },
        {
            "text": "doesn't he block the camera and Flash all of you guys why don't you take your pants off right now all right go ahead show me the scar here uh I can't even do no it's not they're laparoscopic scars oh they were super tiny and then well they were bigger before and then there's I got a dimple here and there was four dots around them cuz that's how they put the mesh okay okay so they like the mesh that's not bad at all no no no it was okay I mean I'm sure it was it's the way to get it repaired cuz there's no external scar like if you're going to have it problem you don't want to have a cut because then the Stitch won't cuz they stitched internally and then cauterized and did all this cool **** but the fun thing was when I was going in because they gave me the joy juice right I know anti-anxiety and then the med and she was hot like she this the anesthetic the yeah anesthesiologist anesthesiologist was a pregnant woman so I was like I hope you're hope that's going to stand in there",
            "start": 4534.24
        },
        {
            "text": "and then the med and she was hot like she this the anesthetic the yeah anesthesiologist anesthesiologist was a pregnant woman so I was like I hope you're hope that's going to stand in there doc but I get in there and I'm like loopy I'm loopy and so I'm like hey thinking Tim Gettys' Playbook right what am I going to do I get into the surgical unit start and I said and I was like Hey so do you guys record this surgery on video and they were like yeah we do and I was like cool so I have this podcast called Midlife Ballers and it would be awesome if I could have a copy of it and you know what they said is that for work and I was like yeah it's for work and they were like no but we'll give you photos and I was like I'll take those I can put those on my show too so I got so my wife sitting next to me and the nurse comes up hours later and goes oh here are those photos you requested and it literally she was like are you **** nuts and I was like I have no idea what I I I guess yes",
            "start": 4569.8
        },
        {
            "text": "next to me and the nurse comes up hours later and goes oh here are those photos you requested and it literally she was like are you **** nuts and I was like I have no idea what I I I guess yes you're a content creator cuz I want cuz in my mind I was like Chris will cut this in where they shoot the video where it's going into my belly and blowing it up and we can do a react to my video I mean it was all in my head but they wouldn't release it for legal reasons **** Kaiser I know it was awesome and it was 45 minutes we need to go in there and sneak in there and get it it's probably on F those drugs are the best huh I've been a few times I literally I I was sometimes when you're having surgery the best looking at the looking at the clock I counted backwards from five I was like oh I'm stoned done and then you w up done yeah out of my mind but you know when I had the surgery the **** launch of the studio yeah he was having a that's why I couldn't come the very day that's why I saw",
            "start": 4616.52
        },
        {
            "text": "done and then you w up done yeah out of my mind but you know when I had the surgery the **** launch of the studio yeah he was having a that's why I couldn't come the very day that's why I saw your little exclusive thing we were walking around like I can't go and then there's a bar and bartend then then he was on these incredible pain meds and called me every 15 minutes cuz he forgot that he called me already oh you want to talk about constipation too that **** pain meds I was on holy **** I hate that **** I won't do it four days and the other problem is anything in your abs here like I couldn't I didn't want to even like blow my nose it hurt so bad there was so much pain and so I was like I don't mind my **** when it's time and I just I just I **** worked out **** man well not really I mean it was really painful to go back to what you were saying week ago whenever you were saying about poop poops painful poops painful poops so Tim are you ready for any of this cuz I",
            "start": 4651.88
        },
        {
            "text": "not really I mean it was really painful to go back to what you were saying week ago whenever you were saying about poop poops painful poops painful poops so Tim are you ready for any of this cuz I feel like these are all hurdles you've never had to go over in your life any kind of surgery any poop pains all this stuff oh I've I've had poop pain my entire life I've had constipation problems since day one cuz you're too tense I was going to say he isn't he carries it all he's nervy I I I think I can deal with this stuff what I can't deal there's certain things in my life like you know people have like issues I can't deal with like eye stuff like needles and eyes like scary movies I'm like nah that needles in general like something about like veins just I don't like the idea of veins well you can't get a surgery then like whether it's cuz they stab you all especially the woman that put my my central line and she couldn't get it she's like that vein's got a 90° angle I got to go to the",
            "start": 4696.2
        },
        {
            "text": "you can't get a surgery then like whether it's cuz they stab you all especially the woman that put my my central line and she couldn't get it she's like that vein's got a 90° angle I got to go to the other hand and she pulled it out and it spattered everywhere and I was like hey I have good let's be **** Pro about that and she's like I'm sorry and then stabbed this **** hand and I was like okay so we're done then I had to pee like Nick Scarpino in the middle of an episode and I was like **** what am I going to do and she's like oh you can pee we just have to walk behind you with all the **** so then I was like with those **** octopus yeah I was just like and then I get in the bathroom they have all these Hooks and I sit on the toilet I'm like now I what am I going to do cuz now I can't reach the stuff to unhook it so then I had to call her back in and it was I mean I've told the story on the show before but that happened to me and there was one time I was like dehydrated or",
            "start": 4737.32
        },
        {
            "text": "I can't reach the stuff to unhook it so then I had to call her back in and it was I mean I've told the story on the show before but that happened to me and there was one time I was like dehydrated or some **** so I had to go to the **** ER and uh they're like I don't remember this story was I I don't know they rehydrated me like with the whole I IV thing I had to go pee eventually I was there for hours that's good though and uh they're like oh cool Greg go to the bathroom so I go to the bathroom and I pee it all out I faint mid piss and then they're like next thing I know I wake up and I'm like back in the bed I'm like what the **** and they're like you straight up peed out in the bathroom did you pee on yourself everywhere yeah you pissed on yourself how did you get so dehydrated I don't it was you probably drank like 10 100 thousand sodas and **** Kevin you had to be there what happened I don't remember thanks I was young Kevin can tell me everything about **** milking this",
            "start": 4771.12
        },
        {
            "text": "it was you probably drank like 10 100 thousand sodas and **** Kevin you had to be there what happened I don't remember thanks I was young Kevin can tell me everything about **** milking this cat his best friend his brother I wasn't there his beloved yeah it was bad though but I do that was it was the only time in my life I've ever like blacked out like I've ever had a moment where there's something happened I'm like I don't know what scary that was like cuz I was just back I'm like I was peeing a second ago and she was like it was a while ago and you were peeing everywhere so did they just find you and and your captain was a fire yeah I was going to say in my mind it's like Backdraft and then you're just sitting there like that's my brother you go just grabbing his dick trying to get you like Kevin's trying to get on top of Tim's dick trying to put it it's a fire hose joke are some deep deep Backdraft quotes it just popped into my all I remember from Backdraft is when they had sex",
            "start": 4807.48
        },
        {
            "text": "on top of the fire hose and he brought down and then uh Donald Sutherland when he's like all creepy and Everything Burns or something burn them burn them all but I'm okay with like the pain I'm okay with the idea I'm okay with shots even it's just the when I like when I know that it's going into my vein thinking about that or seeing it it's just like **** that if they just to pop me in the back or some **** be like whatever go for it like I can take that but the idea of the veins like even looking at them just it just bothers me I really like and in addition to that belly buttons there's something about belly buttons umbilical cords like this whole idea it really creeps me out and I'm just super not into it so this this whole thing very very Troublesome to me popping out you having to",
            "start": 4852.28
        },
        {
            "text": "about belly buttons, umbilical cords, like this whole idea, it really creeps me out and I'm just super not into it. So this, this whole thing, very, very troublesome to me, popping out, you having to pop back in. It's like this, the only make worse is if it was Kevin, if it was Kevin's body and I knew that things were happening, Kevin's body so soft. Oh my God, why would that be worse? Cuz he, you would fear or why is there fear? I would fear it because he doesn't like my body. You know how you made him poke things? Yeah, Kevin, no, I mean that was recently like and and Nick wanted to, even though he said no, I knew want to in his **** heart of heart. Now he's got like plates and **** **** Dupont. It's a mesh and I can't do anything with it cuz the guy's like, if you break this one, you, it's bad and you, he said a healthy four-year-old takes two years to grow the tissue into the mesh. Yeah, so and I was like, ****, what is that? Three, four years for me cuz I'm just, yeah, it's horrible, but it's getting to the point now, are",
            "start": 4894.24
        },
        {
            "text": "four-year-old takes two years to grow the tissue into the mesh. Yeah, so and I was like, ****, what is that? Three, four years for me cuz I'm just, yeah, it's horrible, but it's getting to the point now, are you restricted? Can you move? Can you lift? Yeah, no, I'm good now. I'm good now. Um, there are internal stitches that sometimes still poke weird and then um, I can lift now up to 50 lbs. Okay. And in about another couple of months, I can maybe mountain bike. He said a year, but I'm going try to. Where is that on your scale of worries, Matt? Well, my producer mountain bikes every day and wants me to go with him and that's how I lost all my weight the first time cuz I'm jovial right now, Timmy. I don't know if you know, like I'm the biggest I've ever been, which is exciting, but um, I'd like to be able to tie my shoe without holding my breath. So you know what I mean? Or or slip-ons, just throwing that at there. You know what? I I'll go back to slip. I got my thongs, I got my flip-flops, those flops, bro, and my and my",
            "start": 4941.72
        },
        {
            "text": "shoe without holding my breath. So you know what I mean? Or or slip-ons, just throwing that at there. You know what? I I'll go back to slip. I got my thongs, I got my flip-flops, those flops, bro, and my and my comfortable shorts from Target. Oh, you love shorts. And and then I used to wear those button-up shirts and one of my, one of my guys on the crew once was like, nice blouse. And I'm like, okay, I'm not going to wear that again. But I have so many of them, so I have still wear them. I have to because then I can unbutton like the collar. I can just like pop it open and I'm now cool cuz one, three buttons. It's the three buttons from no, no, no, no, it's the, he knows it's the work ones. I wore him to put this studio together. Look at your video. I have one on in the video. Don't get so angry about it. All right. No, I know. I just wish I looked better, but I'll work on it. You look great. Well, I'm excited. Yeah, I'm excited to be here. Okay, these nice cameras. I look good on the camera. You look great on the camera. That was a",
            "start": 4985.6
        },
        {
            "text": "I just wish I looked better, but I'll work on it. You look great. Well, I'm excited. Yeah, I'm excited to be here. Okay, these nice cameras. I look good on the camera. You look great on the camera. That was a sample of Midlife Ballers. Go to their YouTube channel or Patreon for all that. Patreon for Midlife Ballers. It better be Patreon.com/MidlifeBallers. It is. Okay, good. No hyphens, no dashes, no backlash, underscore Scarpino. Tim, what's your topic before we even get to my top? I do want to say one last thing about his topic. You need to just make your beatboxing just a show, 11th Street style show where it's just weekly and just choose a different song every week and just do that cuz people would love to hear that. That shit's funny as hell. You're good at it. You're good at it. Yeah, but I want it super tight, super tight. That's all. H, just you. Yeah, brother. That's right. When you know how to beat it, a bunch of Stewart Copeland over here. A lot of **** going on over there. That's that's okay. You know what Chris took",
            "start": 5031.56
        },
        {
            "text": "tight. That's all. H, just you. Yeah, brother. That's right. When you know how to beat it, a bunch of Stewart Copeland over here. A lot of **** going on over there. That's that's okay. You know what Chris took that down? Chris, we're going to do another show. You heard it from the god of Patreon. He said, no, don't shake your **** head. Edit that. Take a day to do all of them. Choose when we finish this GameOverGreggy Show. We'll punch you in on your face and you just beatbox out like 10 songs. No big deal. **** good. Let me do Thriller. Of ****, you can keep it trendy. When Star Wars comes out in December, do the Star Wars theme song. I'm sure people react to this tonight. Why is our video happening? Because Kevin's doing things. Whenever Kevin does something. Okay, well, thank you very much. He's got literally, literally two buttons to push. That's all he's got to do for this show. But he has the option to hit, but he has the option to do more and that's the problem. You give him the option, he's going to take it all.",
            "start": 5074.16
        },
        {
            "text": "two buttons to push. That's all he's got to do for this show. But he has the option to hit, but he has the option to do more and that's the problem. You give him the option, he's going to take it all. All right, so my topic, Matt, is uh, very, very important that you're here for. Can I set this up for you? Cut you give my topic. I thought that he, Tim mentioned this topic. I was, you gotta do this because my, because my brother, you guys will vibe on this. Tim decided, can't wait to hear what it is. Tim decided, I don't know why I've never heard Tim talk about this before. What are you talking about? Never. I've never heard you talk about this specific thing before. I never knew this was a dream. Share things with you guys. Well, you don't share most your life with us. I agree with that. Um, I don't even know your girlfriend's name. People on this show would know this. Tim has a Prius C. Are you familiar with how big this car is? I feel like a Prius C is like one of those electric cars. It's like a Prius that fits inside of a",
            "start": 5120.88
        },
        {
            "text": "name. People on this show would know this. Tim has a Prius C. Are you familiar with how big this car is? I feel like a Prius C is like one of those electric cars. It's like a Prius that fits inside of a Prius. It's not the four stands for City. It's for them making them parallel parks in the city. No, it's four, four, but they're really tiny. But but basically they they they essentially chopped down a lot of the size, not the least of which was the trunk space is a little, is a lot smaller than it. It's so small that they recommend you take off the the headrest in the back seat so you can see out the back window. So small is so Tim the other day goes like this, I finally got it. And I'm like, what did you get? And he's like, they tried to get me to do the 12-inch, but I said no, the 10-inch subwoofer is too much. I'm going to put a 10-inch sub in the back of my car. And I'm like, you've got to talk to my brother about this. So I put in the 12-inch. Yeah, and it was too much. And that coming for me, that says a lot. What's",
            "start": 5158.76
        },
        {
            "text": "going to put a 10-inch sub in the back of my car. And I'm like, you've got to talk to my brother about this. So I put in the 12-inch. Yeah, and it was too much. And that coming for me, that says a lot. What's too much about a was was it was the box correctly made? Like was it it rattled off hub caps? That's the thing. That's the thing. It's like too much. It was fine. It fit this **** close to the sub. If you're in the back seat, it fit. But the 12-inch made me feel like uh, it was unsafe to drive. Move the **** car cuz it hits so hard. It you independent amp just for that one speaker. Here's in its own box. Is in the box or is it just mounted in the up? No, it's separate. It's a separate beast. All right. Years ago, I I decided as a young Tim Gettys that audio is something I value in my life. Yep. Exactly. I'm like, I need nice headphones. I want nice speakers for my computer. And when I do eventually have a car, that **** needs to slap. Yeah. Oh, is that what it's called? That **** needs to slap. I've never heard that.",
            "start": 5203.76
        },
        {
            "text": "nice headphones. I want nice speakers for my computer. And when I do eventually have a car, that **** needs to slap. Yeah. Oh, is that what it's called? That **** needs to slap. I've never heard that. But I'm going to use it now. Slap. That was like, I don't know, slap in the bass. That was like, slap in the bass. That was like 2007-ish area. Okay, vernacular. B there. Um, I think I guess knock would be the more modern. I does this constitute Coastal Elite when he's talking about these speakers? Yeah, yeah. Okay, great. Let's move on. I don't know. Bump. Bump. That's in the South though too. Yeah, yeah. I think South more than anything would appreciate this. **** the music in the Prius. Yeah, well, whatever. The the Prius is now becoming a bit. That joke would have made sense back in what? 2003, 2016. Priuses are **** everywhere. No, that's not what I'm saying. You talk about, do you have a car? You might as well be ask, have Prius. Not what I'm saying. You're not going to see somebody roll up in a Prius and just be like, okay, you're",
            "start": 5255.08
        },
        {
            "text": "no, that's not what I'm saying. You talk about, do you have a car? You might as well be ask, have Prius. Not what I'm saying. You're not going to see somebody roll up in a Prius and just be like, okay, you're right. You're right about dude. You're right. So I mean, I would do it, but I'm just saying so long ago, I was just like, if I ever do have a car, I'm going to make sure the **** sound system's awesome. So I was like, I don't give a **** if it's a piece of **** car. I still want a baller ass. A piece of **** car is actually more acceptable than the Prius. But continue. No, but so here's the thing. Eventually, like I I used to be uh, a lot less well off in my life. So I never thought I was actually going to have a car. My family didn't have one. So just hit a point where I'm like, this isn't going to happen. My my good old neighbor Mario, um, whose brother was named Luigi. And it's like, this is, I'm gonna win. Yeah, I'm like, this is fantastic. Um, he decided to give me his old car when he bought one. So he gave",
            "start": 5304.68
        },
        {
            "text": "my my good old neighbor Mario, um, whose brother was named Luigi. And it's like, this is, I'm gonna win. Yeah, I'm like, this is fantastic. Um, he decided to give me his old car when he bought one. So he gave me his like '94 uh, Toyota Corolla. And it was car, the most **** piece of **** of all time car. Yeah. And I was like, had to go through a real hard thing in my life of like, am I going to do it? Am I going to put the sound system in this? And I made the decision not to based both on finances and also on like, this car can get stolen at any given moment. They break into it and just get it. I don't want to invest that much money into this because it will get stolen. Smash and crap. Um, that car eventually died. I eventually got another piece of **** car that cost me $1000. I went back in time and got a '98 Camry. Um, and that was even more broken at most points. Didn't have windows. I've told the story before. Alfredo broke the windows doing something in the back seat and uh, doing something or someone. So",
            "start": 5340.6
        },
        {
            "text": "'98 Camry. Um, and that was even more broken at most points. Didn't have windows. I've told the story before. Alfredo broke the windows doing something in the back seat and uh, doing something or someone. So anyways, uh, that that car saw a lot of things and it still hit me. I'm like, should I do this? And I didn't do it. And that car did get stolen. So thank God I didn't do it. Eventually, we start doing this whole thing. I need to to drive to your guys's old place to do stuff. I needed a car. And I'm like, you know what? I've saved enough money. I can invest in a time to get the Dream Ride, the Prius. And that was my thing. I've always wanted Prius. It's economical. And I'm like, this is a good decision for my future. Um, so I was in a position to do that. So I made sure to do it in obnoxious blue as we've all heard. And uh, it's great. Best decision I ever made. Now that you pitted two Toyota dealerships against each other to the point where I think one of them may have killed himself. I mean, that was my thing is like I",
            "start": 5390.12
        },
        {
            "text": "uh, it's great. Best decision I ever made. Now that you pitted two Toyota dealerships against each other to the point where I think one of them may have killed himself. I mean, that was my thing is like I was like, if I'm going to **** invest in this ****, I'm not just going to get the blue outside. I want I want to make sure that I get the blue chairs because they were trying to give me this light gray **** on the inside. This is the only way it comes. I'm like, excuse you, sir. I've seen the Google Images. I've seen that the the tier three also is available in this and that's what I want. I don't want this ****. Anyway, I've had this thing for about almost coming coming up on two years. And uh, I've loved the car. It's been 100 miles on it. Uh, no, couple thousand, couple thousand, couple thousand. Every once in a while, Tim feels the just got to make that midnight run down to Disneyland. Yeah, you know, just got to do it. Like made fair share of trips down to the. You continue. Eventually, I'm like, you know,",
            "start": 5430.96
        },
        {
            "text": "once in a while, Tim feels the just got to make that midnight run down to Disneyland. Yeah, you know, just got to do it. Like made fair share of trips down to the. You continue. Eventually, I'm like, you know what? The sound system in my car sucks. It's been a big issue for me from day one. I was like, I'm going to do it. I'm going to get the sound system. But me and Kevin are always like, when's a time? And it was never time cuz we're always busy building studios and **** planning shows and all this stuff, right? But eventually now, I was I went down to do the The Proposal video that I just put up. And I was going to have to drive back by myself. So I was like, you know what? Cuz me and Greg were driving down together. I had no partner going back, dumping her. So yeah, I was leaving her there. She was in front of the Magic Castle. He's like, now look at the phone again. Thanks for, I got another video for you after the proposal video. It's just like, you're we're **** done, done. So anyway, I'm like, this is the best",
            "start": 5468.84
        },
        {
            "text": "the Magic Castle. He's like, now look at the phone again. Thanks for, I got another video for you after the proposal video. It's just like, you're we're **** done, done. So anyway, I'm like, this is the best time cuz I'm going to have a six, at least 6-hour drive. It end up being about a 10-hour drive. Um, back by, why so bad at driving? What's up? Why are you so bad at driving? **** traffic and ****, bro. **** traffic. 10 hours. Jesus. Yeah, man. Like there's construction going on on the the five. This. Okay, so but did you get this system in? So then I'm like, SoCal. No, no, no, no, no. I got it up here. So we we're I was looking around, looking at a bunch of options. And again, pitting people against each other. Fig that whole thing out. I eventually find some guy that I trust. I'm like, this sounds good. And he puts it in. He was like, do you want the integrated thing where it's like the bass with the integrated amp or whatever? I'm like, what's it look like if I didn't do that? And I got the an amp and the bass and new",
            "start": 5506.48
        },
        {
            "text": "in. He was like, do you want the integrated thing where it's like the bass with the integrated amp or whatever? I'm like, what's it look like if I didn't do that? And I got the an amp and the bass and new speakers and all this stuff cuz I was like, I want to keep my **** stock. Like my my deck inside. Yeah, cuz I don't want I don't want people looking in and being like, cuz then my Prius is about to get jacked and I I ain't trying to do that, right? So I'm like, I want I want to do the the integrated stuff so that it bypasses the deck, but it's still like there's a different sound processor or whatever. So I'm like, let's **** do it. So he does that. And now my **** slaps and it's **** forward to yesterday. Can I ask questions before you tell me the? Okay, so you replaced all the speakers? So they they they put not all of them. I didn't do the back seat ones. So the and did you have those rerouted as like mids or like are they actually the how how are your back speakers routed through? Are they did you put an",
            "start": 5547.12
        },
        {
            "text": "put not all of them. I didn't do the back seat ones. So the and did you have those rerouted as like mids or like are they actually the how how are your back speakers routed through? Are they did you put an amp on those and feed them? Yeah, the feed the stock amp got new amps for everything. I got new amps for everything. Jesus. Yeah, so Milly, it wasn't that bad. It wasn't that expensive. Milly, not enough for him to do this to justify this to a Prius. Think that's true. My ultimate car. Yeah, but it's not about a Prius. Prius. I grew up in a time back in the day where I some of my fraternity brothers worked at a small town store called Circuit City. Oh, they were all managers and they would be like, Scarpino, when it's time done, I'm pulling in right now. Do it. Used to have a new Alpine CD player like every months from the time you could be like, cha-ching. And now you a suitcase for your **** radio, right? And then you got the face off. And then eventually, and my **** one time got jacked. And then I changed it up. But um, you know, I",
            "start": 5588.56
        },
        {
            "text": "you could be like, cha-ching. And now you a suitcase for your **** radio, right? And then you got the face off. And then eventually, and my **** one time got jacked. And then I changed it up. But um, you know, I rode with a uh, they had these things called, I think they were called thump boxes where the actual tens were mounted in the middle of a of a huge box where it's Plexiglas and ported on the other side. And that son of a **** keep their heads ringing was **** awesome. Now, what was the biggest sub you had? Did you have it a 10-inch? No, I never had 12-inch. John Robinson had 12-inch. Did you have two tens in a small like Ford? What is the smallest two-door Ford? Remember when Johnny had a Ranger? No, no, no. Had it was a Ford like Fiesta. It was like a small, remember that little Ford he had that with the two 12-inch in the back. So our friends were in the like 12-inch like like built-ins in the back of their car. So a lot of my guys had a ton of **** in the back and it was all beautifully, you know, wood. It was all manufactured and fit.",
            "start": 5640.24
        },
        {
            "text": "friends were in the like 12-inch like like built-ins in the back of their car. So a lot of my guys had a ton of **** in the back and it was all beautifully, you know, wood. It was all manufactured and fit. Looks like it's part. And then one of my fraternity brothers actually repped Alpine. So they took his brand new Mustang apart, replaced everything, sprayed the inside of the car with that sound foam. Have you ever seen people that? And then we and your ears would **** bleed. And outside the car, not one goddamn thing. It was brilliant. See that? So this is where we're getting to the next chunk. You got to take your car part and have that **** foamed down and no one will hear. Kevin, can you go foam out Tim's car for me, please? Thank you. Appreciate. We got this extra acoustic foam. That's not what you need, but it's okay. Don't let Kevin do it. Your car will look like uh, what's it gonna look like? What's happening? I no, he keeps throwing a I don't know what they're talking about. My the thing that popped in my",
            "start": 5683.08
        },
        {
            "text": "it's okay. Don't let Kevin do it. Your car will look like uh, what's it gonna look like? What's happening? I no, he keeps throwing a I don't know what they're talking about. My the thing that popped in my head was Demolition Man when the car turned into a cannoli. Never mind. Continue. So so so yesterday uh, I looked over and I saw the secondary knob that they've installed in Tim's car that just controls the subwoofer. And I was like, oh ****, dude. Just a volume control for the sub or like, yeah. And I'm like, oh dude, we got it. Just it's bass. It cranks the bass. There's a bass knob. Okay. And what are we listening to in our new car? Two things we listened to yesterday. One with this was Tim's choice. And and rightfully so, it was G-Low, right? Of course, the song me and Nick came out. AB that thing slams. A build up thing. It's like, all right, there's no bass in it for the whole **** thing. 30 **** hit. **** hit. It's it's five of us in this car. I was lucky enough to be in the front seat. Greg was not. Greg was in the",
            "start": 5724.2
        },
        {
            "text": "it's like, all right, there's no bass in it for the whole **** thing. 30 **** hit. **** hit. It's it's five of us in this car. I was lucky enough to be in the front seat. Greg was not. Greg was in the backseat unfortunately. And I look back at Greg and Greg Greg has this look that he has sometimes when he's not happy, but he's not miserable, but he would very much like whatever's happening to not happen anymore, but he's okay if it keeps happening. He's gonna let it play, right? It looks like this, right? That's Greg's. I would, you know, I'm ambivalent to this, but I would prefer it not to be happening. Uh, then on the way back, I sat in the back seat and I was like, I need something that my brother would have bumped in this car. I was thinking of channeling Scarpino. So I put on Cypress Hill's 'I Wanna Get High'. Scun scun. And what I learned about that is I haven't heard the song in years. A. It's still **** phenomenal. B. Bass drops actually hits. So you don't know what it's going to happen. Did you ****",
            "start": 5771.72
        },
        {
            "text": "high. Scun scun. And what I learned about that is I haven't heard the song in years. A. It's still **** phenomenal. B. Bass drops actually hits. So you don't know what it's going to happen. Did you ****? Oh my God, did you the brown note? Oh my God, it like it pushes the **** through the tip of your there. You know the brown note? Yeah, yeah. It's a certain frequency that makes there YouTube videos and they're fantastic. Dude, it's in intense. It is ****, dude. I'm so happy for that's. Can I ask a dumb question? So is what is the what's the system? Is it actually like cuz you're not using CDs? So is it just all my thing has CDs. So is but they didn't take they didn't take the actual face off and redo and you didn't get a new system. No, no, no. That's the thing. I wanted to make sure that it was stock. Still got the you can still the phone. They didn't get it. But the sound processor like they ripped out the inner on the inside and changed all that ****. And it's **** great. Uh, but yeah, the we play his song and",
            "start": 5818.16
        },
        {
            "text": "you can still the phone. They didn't get it. But the sound processor like they ripped out the inner on the inside and changed all that ****. And it's **** great. Uh, but yeah, the we play his song and it's like you hear all the amazing like and then every once out of every four beats, you just be like, like holy ****, the mirror is **** going crazy. But uh, it's it's definitely the thing I want to clear to everybody is I don't want to be one of those guys that are like **** driving through residential neighborhood. You didn't let Nick really crank it. Let it loose until we were in motion. We at a stop. I just I'm trying to get the visual of a beautiful little, you know, Prius with four white dudes slamming Cypress Hill. Kevin was there. Oh, Kevin's okay then. He Cypress Hill with Kevin. That's nice. Greg and then other Greg. Jesus. God, car. So that's it. You just listen to 'I Wanna Get High' and then you stopped because it was so big. Yeah, I mean, it is. It's a lot. What about like a little Metallica?",
            "start": 5863.48
        },
        {
            "text": "Greg and then other Greg. Jesus. God, car. So that's it. You just listen to 'I Wanna Get High' and then you stopped because it was so big. Yeah, I mean, it is. It's a lot. What about like a little Metallica or something that has a little nuts like Megadeth or something that has like some sco on it? They have I've given it the whole I had 10 hours. I listened to like everything on. So you like testing the entire. And then of course, the whole new world. And like Disney ****. Absolutely. Of course, I had to listen to the whole Bop sound like 'A Whole New World'. Is that something? It's just kind of an ever present. It's just kind of it's just there. There's no drop per se. You got to you got to come to work. You going to be so relaxed. You're getting like a massage on this ****. I mean, that's my thing is I only got like 10 minutes each day, but that's 10 minutes. Oh my God, good for you. Yeah, no, it's it's fantastic. You should experience it sometime. I want I mean, I would love to sit in your car and yeah, cuz that would take",
            "start": 5911.24
        },
        {
            "text": "minutes each day, but that's 10 minutes. Oh my God, good for you. Yeah, no, it's it's fantastic. You should experience it sometime. I want I mean, I would love to sit in your car and yeah, cuz that would take me back to my cuz that's all my friends did. That's what I mean. He's told me the story. All they **** did. Nobody really worked. Just sold drugs and bought sound equipment and put it in their shitty cars and then go, oh my **** got jacked. Let's do it again. Yeah, yeah. H, I just love it. It's in my car. I love. Remember that gray box you used to have in the back of your car where had like the amp drilled into the side of it or whatever? Well, that was because yeah, we had the Blue Thunder. It's called the Blue Thunder series. It was awesome. Fck yeah, it was that Thunder much fun. This makes me just happy. It's just like it's the best thing. I'm looking forward to every time I drive now. And what's your license plate number? I'm joking. I was never one four. I never needed that. I once bought a CD player and put",
            "start": 5948.6
        },
        {
            "text": "just like it's the best thing I'm looking forward to every time I drive now and what's your license plate number I'm joking I was never one four I never needed that I once bought a CD player and put it in my Ford Taurus that I I didn't buy it okay so this is a question then uh do you think like City specific or or or uh how do I ask this question because he I don't want to be too offensive but my question would be Greg didn't really care about sound system you did you grew up in two different areas of the planet I think it's just I think it's an appreciation for music thing I just don't I no I'm talking about the actual sound system like I was very influenced by the Inland Empire San Bernardino IE the IE throw it up White Knights no I don't throw up White Knights because that's not me Jesus Is Right are but probably not the reason why the IE is called the Inland Empire is because it had a very kind of a good smattering a large group of just a smatter a small smatter of possible people who hate you know",
            "start": 5985.96
        },
        {
            "text": "probably not the reason why the IE is called the Inland Empire is because it had a very kind of a good smattering a large group of just a smatter a small smatter of possible people who hate you know white supremacists oh okay I don't like this at all what I'm saying what that to do with sound systems because those **** drive big trucks with sound systems they're playing like dit I'm I'm or LA you know what I'm saying like you you're you're a Bay Area dude but not not like where I don't know where you live, Colin no I know we're in San Francisco I'm saying but weren't you like on the from San Francisco but you're like kind of on the outskirts now I'm on Daly City but I'm from San Francisco but you either have it or you don't I mean it has to be you have to be kind of technological like a techie for that kind of **** you have to be into like I'm on a because you didn't do your own but my friends would take their **** apart and like run the **** to the battery and run a whole oh **** the",
            "start": 6029.68
        },
        {
            "text": "for that kind of **** you have to be into like I'm on a because you didn't do your own but my friends would take their **** apart and like run the **** to the battery and run a whole oh **** the B we got get Kevin did do that for my 9 Camry but I just got you appr I got new speakers though I didn't do the whole thing no when you got the whole car and rebuild it it's kind of cool and then it never gets back on there **** window put back we did put it on except you put it back on good the door opening thingy didn't the handle hand put it on good I I do real good I I comb my hair once a week you so pretty with those teeth that was a great is that yeah I'm with you Greg I wasn't I was never into anything I just thought it was a completely waste of money I was like the car came with speakers was that's good enough when when when I was driving in the the the Ford Taurus and the driver side speaker just stopped working one day I was fine and then like nine months later it came back",
            "start": 6073.96
        },
        {
            "text": "was that's good enough when when when I was driving in the the the Ford Taurus and the driver side speaker just stopped working one day I was fine and then like nine months later it came back online I was like great I would leave my bed until that shit's fixed I'm out of commission that's awesome yeah **** that man I'm excited for you one of my nice pair of headphones during when I went down the **** proposal that one of them broke and now I'm like well **** I feel useless I can't believe I'm here right now how am I supposed to function without being able to listen to things I understand with other nice headphones here don't you do yeah I think all the headphones balance out what kind of sound system do you have in your car I don't have a car now I haven't had a car since I was 18 or you still don't have a driver's license right no not a not a do you have an ID card yeah an ID yeah it just says no drive it's different though right yeah it just says I mean it looks similar right",
            "start": 6119.0
        },
        {
            "text": "you still don't have a driver's license right no not a not a do you have an ID card yeah an ID yeah it just says no drive it's different though right yeah it just says I mean it looks similar right I don't have my wallet on me well it's probably for the best actually it probably show up show it to the let me show it on the camera uh no I the one car I owned was a Ford Ranger and my dad bought it from a guy in his Firehouse uh for $1 uh because he was just trying to get rid of it and had a beautiful Alpine system in it like it was it it was awesome it was so awesome and then I sold it to my friend Brian and then for how much for more than a dollar for I think $500 and the truck worked great it was a beautiful truck and um and uh then it got stolen I would love to see Colin bopping around in a Ford Ranger truck just driving I was listening to pretty much exclusively rap rock on that I just seeing you driving seems like it be so weird I'm not a bad driver not a good driver not a bad",
            "start": 6157.52
        },
        {
            "text": "in a Ford Ranger truck just driving I was listening to pretty much exclusively rap rock on that I just seeing you driving seems like it be so weird I'm not a bad driver not a good driver not a bad driver okay kind of like me with the speakers in the back seat Well when I Le I learned how to drive in my dad's Nissan Xterra and uh and Nissan I had a really yeah I had a really it's an SUV it's a pretty big car I had I I had I have a hard time centering the car in a lane based on like I feel like the driver she should be in the middle of the car because then you have to use like these weird like because then you have to you have to use like these mirrors to like like my dad was like align yourself by using the left mirror and like the line like just like all these tricks I guess you know I don't know and I was so scared of that that I would drive like really close to the shoulder and I remember driving down this road Old Stump Road in Brookhaven just blind with trees and uh just scratching the",
            "start": 6194.72
        },
        {
            "text": "and I was so scared of that that I would drive like really close to the shoulder and I remember driving down this road Old Stump Road in Brookhaven just blind with trees and uh just scratching the **** out of the side of my dad's car like and he was so and he used to get mad too because when I would get off the highway and I would like go onto the like the offramp I would be going like so fast and wouldn't break until like the last second used to get you be like like one of these yeah I got it I got it there is something weird about that though just the the perception of the of where the the lane is because like I'm totally good never hit anything but there's something about like whenever there's cones I feel extra sensitive about that like if it was just normal street I would have never even went near it but now that there's cones and the drive back to LA always does this you'll have all these open lanes and it's beautiful and at some point it's just one little thing where there's like a",
            "start": 6229.68
        },
        {
            "text": "went near it but now that there's cones and the drive back to LA always does this you'll have all these open lanes and it's beautiful and at some point it's just one little thing where there's like a wall and then construction and I'm like the most tense I've ever been you have tons of room on each side of the vehicle yeah but it's just like you just feel like you're so constricted you but what we need to test out now is I need to play my **** super loud and I need someone from the outside to like that's what I want to do I want to figure it out test my limit no I bet I bet not and we should check the rattle on the license plate frame and in the certain areas yeah because you can get those little bumpers to make sure it doesn't do that little rub rubbers little rubber stops all right my topic I guess is Westworld which means Colin Moriarty already we need to bid you I haven't seen it I want spoiled your plan is you're going to watch the entire thing at the end is your plan right you're doing",
            "start": 6268.92
        },
        {
            "text": "I guess is Westworld which means Colin Moriarty already we need to bid you I haven't seen it I want spoiled your plan is you're going to watch the entire thing at the end is your plan right you're doing one of those I've heard great things about it yeah uh but up your alley it's a show but I I don't really watch shows one an episode at a time yeah so as long as I can avoid spoilers and even if I don't I'm sure I'll still watch it anyway I've heard great things yeah so when Curb Your Enthusiasm comes back I'll watch that one episode at a time but other than that okay okay and maybe The Apprentice if you like I don't know sers I just I just don't know I feel like that show needs Trump back but okay all right see he might he might have some free time in the I'm going to grab a handful of you handful of what I want big KevDog I'm going to need you close to the mic you got some Westworld thoughts you want to talk about time you know what we could do what's that me and big KevDog could switch spots",
            "start": 6309.4
        },
        {
            "text": "I want big KevDog I'm going to need you close to the mic you got some Westworld thoughts you want to talk about time you know what we could do what's that me and big KevDog could switch spots I'll do you know how to do you know how to switch a camera I do okay three buttons but just don't hit the other button that brings up the half a **** black square with a white border around it now for the viewers out there as we now switch Tim and Kevin what the hell's happening there as we now switch Tim and Kevin is he Kevin come up Kevin you're getting called to the big league Tim you get up uh I think it'll be spoiler-y conversation I don't think there's spoilers to worry about if you want to know nothing about Westworld sure I mean then the idea is I think I don't know that anything's been like anything I agree but like uh like um uh James Marsden's character yeah love him like oh he's amazing but like maybe I didn't know who he was until a little bit later in the episode you know what I",
            "start": 6350.92
        },
        {
            "text": "like anything I agree but like uh like um uh James Marsden's character yeah love him like oh he's amazing but like maybe I didn't know who he was until a little bit later in the episode you know what I mean like that kind of thing well can we I mean we're going to spoil something 100% so I'm just I'm just saying **** no no let's not yet before no spoilers I think you I think you should watch Westworld like a crazy person I think you should totally be on it I do too I think it's phenomenal oh quick impression absolutely and then I love it it's phenomenal it's amazing now we're going to start talking and now the gloves are off I say and so that was your thing if you want to end the episode now thanks supporter us on Patreon so one of the things that that that I talked to you about when I first when I first saw it and came in the next day was I was like I'm **** floored by the cast they have for this show yeah the fact that they have Ed Harris and Anthony Hopkins in a show together is",
            "start": 6394.08
        },
        {
            "text": "when I first saw it and came in the next day was I was like I'm **** floored by the cast they have for this show yeah the fact that they have Ed Harris and Anthony Hopkins in a show together is ridiculous um James Marsden again I think James Marsden is one of those guys that like has always sort of got he's never had his come up I don't think I think I always gets the role that is uh weekly written for the character um and and I don't think he's actually this is one of those shows where he's actually shining right now in my eyes and it's shining he does age perfect **** casting he plays the perfect person right and then and then literally through that he's supposed to be the perfect guy the hero um and you don't know in the beginning but then you fin see it and it happens over and over and over again and there's this slow Twisted thing happening to him and he's nailing it in my opinion Now Grant to early on episode 3 so we'll see what happens come episode 9 of 10 but um he's",
            "start": 6434.8
        },
        {
            "text": "over and over again and there's this slow Twisted thing happening to him and he's nailing it in my opinion Now Grant to early on episode 3 so we'll see what happens come episode 9 of 10 but um he's phenomenal uh uh the girl from MI what's her name um Thandie Newton's phenomenal um Jeffrey Wright is phenomenal Evan Rachel Wood is phenomenal the Danish woman that my wife is incredibly in love with the main like the the head of everything that smokes oh smoking woman I I got it broken here yeah got it she's awesome and so that Cy be those and **** in her name, probably Newton. Shut up. The production value is phenomenal the way it's shot is phenomenal the fact that literally the same thing happens over and over and over and over again and it's **** riveting so the pacing of the edit everything all that the writing is great the small touches like um when uh the music hits and you're like is that **** Radiohead yeah yeah is that Black Sun so things like that that",
            "start": 6474.56
        },
        {
            "text": "of the edit everything all that the writing is great the small touches like um when uh the music hits and you're like is that **** Radiohead yeah yeah is that Black Sun so things like that that that's how you'd have to do it if you wanted to make a contemporary like amusement park for adults to come into and just the overall concept is really really cool um so yeah I mean I'm glad you know you said you're going to make this topic Matt just happened to be in town I'm like let's watch it on your HBO GO account which is great and now I have to just keep watching it it's I think a fantastic piece of sci-fi and I give KevDog credit because he was one of the people trying to get us all was it oh no I had it I had it recorded and then when he when you texted me I was like oh **** I didn't watch him yet but yeah no I'd seen the previews and I'm like this is what the **** is happening great and it was like oh cool a western thing but I didn't real it wasn't you know it was I didn't I went in",
            "start": 6519.16
        },
        {
            "text": "yet but yeah no I'd seen the previews and I'm like this is what the **** is happening great and it was like oh cool a western thing but I didn't real it wasn't you know it was I didn't I went in not really knowing what I was getting into and so when I'm the middle of that episode when I'm like holy **** and they're like talking about how you know it's not about the storyline you get it's about the choices you make and they I'm like **** it's a it's a video game without the the video game exactly right yeah it's a live-action video game and it's also the mashup of what you **** dorks like in Disneyland right of like there is this likeu able to **** anim yeah exactly **** in that Lincoln face it's that it's that mixup of video game and theme park shoved together whatever and then having role playing like live action no it's **** cool and it's total like that if that place really existed like oh my God $40,000 a day I would **** I would save for it and try for one day yeah",
            "start": 6558.28
        },
        {
            "text": "having role playing like live action no it's **** cool and it's total like that if that place really existed like oh my God $40,000 a day I would **** I would save for it and try for one day yeah one day try to get it all in yeah I got just one side quest mean I don't really want to play them I mean 40K for you guys is not that bad today put on Patreon yeah put on Patreon um no no it's **** it's really really cool now to be fair I don't I'm not feing for it like I'm very much looking into the next episode I'm not it's not on Game of Thrones level for me but yet we'll see how it goes Game of Thrones took a couple episodes to get into I feel like after the first episode I was like damn I need more of this after the second episode I was like oh I want more right now after the third really a little bit less for me see I and I've been outspoken before just like Game of Thrones just isn't my jam I just I'm not a fan of the setting and everything else this is I love the setting here",
            "start": 6595.68
        },
        {
            "text": "a little bit less for me see I and I've been outspoken before just like Game of Thrones just isn't my jam I just I'm not a fan of the setting and everything else this is I love the setting here both in the in Westworld and outside of Westworld like how they run this theme park and then so yeah I am I'm not waiting with baited breath because like Ed Harris's whole thing with the Maze and all this other stuff I'm like that's interesting I'm I'm sure that's going to become more and more important but I'm way more important or I'm way more into watching uh Dolores and like how quickly she gets wise to what's happening what her motivation going be I this is a this is one of those I wish that I know it's impossible it's a lot like comic books where I wish I could have waited like Colin is even though he'll have something ruined and be pissed off about it but and I like being part of the conversation I wish I could just Marathon it all like a Netflix show because I would sit there do you know how",
            "start": 6638.52
        },
        {
            "text": "he'll have something ruined and be pissed off about it but and I like being part of the conversation I wish I could just Marathon it all like a Netflix show because I would sit there do you know how many actual episodes they're going to do no I don't I mean probably anywh between and 13 I would say the general HBO show I love that um the conversation like I love being able to like I'm excited about next week when you guys all hopefully catch up and then we can sit down and be like oh man she watch yesterday this this and that and I I want Tim to join so bad because I think he's going to love it and I I've just you know my whole life's been those sort of conversations with Tim yeah it's going to be interesting and here's the thing it's going to be interesting to see where they go right because we had a cool twist right at the beginning uh which is not not revolutionary but it was like you're like oh they're going to **** with us a little bit like we're not we're not sure what's happening um",
            "start": 6675.64
        },
        {
            "text": "had a cool twist right at the beginning uh which is not not revolutionary but it was like you're like oh they're going to **** with us a little bit like we're not we're not sure what's happening um 10 EP 10 episodes seven more am I so excited and then we sort of are on this story line that's not 100 like nothing 100% enthralling is happening with the main story which one's the main story to you H uh to me the main story is the the them kind of happen so nothing it's nothing like shock crazy moment even the stuff with Thandie Newton I was like this is just beautifully done and like it's shocking but or like disturbing but it's not on the level of like the Red Wedding right with Game of Thrones right so so we're we haven't gotten a moment like that it's this cool sci-fi Slow Burn Right In This beautifully **** crazy sci-fi environment ju suppose with the wild west and even like some of the small things they do that I think is really really cool that kind of brings you in is like the",
            "start": 6713.6
        },
        {
            "text": "This beautifully **** crazy sci-fi environment ju suppose with the wild west and even like some of the small things they do that I think is really really cool that kind of brings you in is like the Mexican uh I looked up the locations the the placees they were in Mexico um and I think there was another place those are actual backlots on Universal so like they felt like a Backlot too so when you come in there's like three how like three places I don't think they really cared to do anything to make it feel like it was an actual Mexican Town it felt like it was kind of theme parkes and so stuff like that **** with you because you have that you have Ed Harris sitting down with I forget the actor's name the guy from 187 and they're having this intense conversation and then this brutal seat unfolds like what is happening with this **** show but it's **** like that and then it's that Dux position of those of those those sort of moments that really really have drawn me in so what do",
            "start": 6761.08
        },
        {
            "text": "unfolds like what is happening with this **** show but it's **** like that and then it's that Dux position of those of those those sort of moments that really really have drawn me in so what do you think if them I I guess what's the through line going to be I think they're setting up Ed Harris right and I think they've made him look like this Man in Black he's he's going to be this big bad guy or whatever d i i do you think what's going to happen with him do you what's your prediction for that character because I think what's going to happen at some point is he's going to flip and be the hero it turns out you think so I would agree I think the because the Maze gets referenced I think when and I could be wrong on this when they were talking to Dolores right whatever it seems like the Maze is for hosts and I don't know if that's in the last episode they made it seem that way if the Maze is a like a test to be like if you can get through this thing then you are yeah you found conscious are we",
            "start": 6796.84
        },
        {
            "text": "hosts and I don't know if that's in the last episode they made it seem that way if the Maze is a like a test to be like if you can get through this thing then you are yeah you found conscious are we going to find Arnold right isn't that his name Arnold at the center of it you me wait partner but do you don't think Ed Harris is Arnold no I don't no no because they a picture they're aware of Ed Harris they've looked in on Ed Harris and gone someone that's been there for and they were like that guy get to do whatever he wants when they about no no no no no okay that's not the way I took it though what did you take it as I took it as everyone that's younger thinks he's that person but we have not seen who that person is in Anthony Hopkins eyes surek knows all kinds of **** and he's about as old as Anthony Hopkins so my question I think what happened is they had an argument and he's like oh he left and died when he really did now he's trying to go you guys created this cool Studio I'm",
            "start": 6833.4
        },
        {
            "text": "as old as Anthony Hopkins so my question I think what happened is they had an argument and he's like oh he left and died when he really did now he's trying to go you guys created this cool Studio I'm going to burn it down from the inside or I'm going to release these people because they're real humans and you're **** around this is not what I wanted I'm going to go in as someone else and Come Out Swinging I just feel like it's it's too easy it's too easy that he is I mean what's that guy my theory I mean maybe or maybe he's just someone else yeah I I I just think he's a guy that one day was like I'm going 100% this game and has been doing every single Quest and journey and different variations for 30 years honestly what it feels like to me way is it's it's the end of Groundhog Day right like Groundhog Day is a really funny movie and when you talk I think it's when Ivan Reitman or maybe it was Harold Ramis was talked about it right that was supposed to be that he lived that day for five years",
            "start": 6881.08
        },
        {
            "text": "Groundhog Day is a really funny movie and when you talk I think it's when Ivan Reitman or maybe it was Harold Ramis was talked about it right that was supposed to be that he lived that day for five years every day and that's why by the end he's just trying to kill himself and he's so miserable right that like Ed Harris has Platinum the game and now he's trying to get into the actual inner workings of this and see the code and what what he hopes to find in the Maze I don't know if he's I I I think he figured out that there is one more game for the host to play sure and he's just like I know it's not for me but I'm going to do this so that I the completionist in him is is satisfied yeah because that's the thing of like too where it's like he went and you know takes the guy scalp to get the the Maze map or whatever right but it was interesting when they're cutting back and forth to when um uh Thandie you said was her name Thandie Newton when she's almost getting scalped by him right when Evan",
            "start": 6926.12
        },
        {
            "text": "Rachel Wood's in the barn he goes to scalp her too it's I don't think the map was on every person right like he's been going through systematically trying to figure out who has this and it turns out that there is it so there is is another game built in that this is there and how do you got I can't wait to see how he got started on that Quest well that's the other thing too is like people clearly know he's on this doing playing this game right because at some point something told that little girl to tell him where the Maze was right or that it wasn't for him or it wasn't for him what it was remember she's like go to the the whatever and go thing but it's not meant for you but it's not meant for you right so she shut off and then came back to herself so someone that was that just be a",
            "start": 6962.68
        },
        {
            "text": "remember she's like go to the the whatever and go thing but it's not meant for you but it's not meant for you right so she shut off and then came back to herself so someone that was that just be a program that was already set in there that's possible to that's possible too um yeah I I thought they showed Arnold though they show a picture of young Anthony Hopkins they showed young Anthony Hopkins they never show oh they didn't show the other guy they didn't they didn't show him in a picture I thought we saw I thought we saw him too I'll look it up after this no that's what I'm saying that's why I think there's got to be something the Man in Black has got to be something so mean more UL be a p like this is obviously based on I think it was Michael Crichton movie not a book I think he wrote a movie and it was called Westworld I think it was Yul Brynner but the the concept was originally and that it was a bunch of reporters coming to this brand new theme it was Jurassic Park basically",
            "start": 6997.96
        },
        {
            "text": "a movie and it was called Westworld I think it was Yul Brynner but the the concept was originally and that it was a bunch of reporters coming to this brand new theme it was Jurassic Park basically yeah bunch of is coming to this brand new theme part that all these robots and then lo and behold one of the robots they all start going crazy and killing all the humans and so that's that's the general theme that we're dealing with here is like what's going to happen when these beings become sentient and realize that they can get the **** out get the **** out of there like what's going to happen and it's similar to and this is why leg it's got themes that that um Ex Machina had dealt with things like that like they talk about the Turing Test they talk about what life is and it just because it's not organic doesn't mean it's not alive you know so it's gonna be really cool to see how this develops um my only real concern with the series right now is like I want this to just be one season I really",
            "start": 7030.88
        },
        {
            "text": "organic doesn't mean it's not alive you know so it's gonna be really cool to see how this develops um my only real concern with the series right now is like I want this to just be one season I really just want it to be **** 1 Stellar episodes that **** blow your mind and then boom we're done I don't want to see Anthony Hopkins wrestle with something else in season two right if he makes it out of the season because he's the Dumbledore character and probably will die oh my God Nick what well you know he's the character that Jeffrey Wright the the understudy and at some point Jeffrey Wright's gonna probably have to take up the mantle it doesn't matter well I'm interested to see who's going to turn out to be a host in the support staff that's there's got to be somebody there who they don't know or like you I mean the host doesn't know or I was like At first I thought Anthony Hopkins was going to turn out to be a host then we see a young picture or the young thing of him but then even then",
            "start": 7067.52
        },
        {
            "text": "or like you I mean the host doesn't know or I was like At first I thought Anthony Hopkins was going to turn out to be a host then we see a young picture or the young thing of him but then even then maybe he uploaded his Consciousness or did something to that effect I don't know that's possible my question to you guys is if you were in this world this is good right here this no this is where I was eventually going to go yeah yeah if you were in this world the answer is yes how would you go Wicked how much **** would you do like what would I be a good guy for how long for the whole thing I mean I'm a cowboy I'd be taking out the bad guys I'd be going on I I wouldn't go on maybe the the rides out there but I'd be protecting Town I'd be sticking around there you wouldn't go on the rides out there maybe a couple but not all you know you can't get hurt you know and just go well that they have a few logical points for to that I need answers to like how the bullets work oh yeah exactly yes",
            "start": 7104.24
        },
        {
            "text": "there maybe a couple but not all you know you can't get hurt you know and just go well that they have a few logical points for to that I need answers to like how the bullets work oh yeah exactly yes and Ed Harris they Ricochet him off like he's in The Matrix and then he used to get then the other guy get shot and knocked down on their like forums they said it's like paintball guns no yeah it hits you sure so why did Ed Harris not act hurt at all he's been getting hit by those paintball guns he doesn't have like all over his body no it's not it's not calluses but you're used to it also have you seen Ed Harris badass no he's got Leathers on Leathers there you go he's got a set of leathers on it's all cool and **** and they're also not and then they're little sand sand blaster little balls here's okay yes so you would be positive man you'd be like the hero yeah be a Superman kind of I think I would do that for a second then I'd be like I'm taking these two **** in the back and I'm",
            "start": 7139.76
        },
        {
            "text": "here's okay yes so you would be positive man you'd be like the hero yeah be a Superman kind of I think I would do that for a second then I'd be like I'm taking these two **** in the back and I'm going to pick pay for some goodness that's a bad thing and by paying I mean not paying oh man Sho your out take you're going to take what you want you're going to trump it nobody dope as me I'm going to be like what am I what'd you say you Donald Trump dude I'm not saying this is a locker room oh no come on the problem is this you're absolutely right because I it's a very interesting concept to be able to do whatever the **** you want would you be a person that would snap someone's neck rape someone it's one of those things just to see you could do it like the idea of it bothers me the idea rape bothers me therefore I don't want to explore it shooting someone I I don't know if I would shoot someone I think exploration or like an event that would be fun being around it and like drinking a lot",
            "start": 7181.6
        },
        {
            "text": "bothers me therefore I don't want to explore it shooting someone I I don't know if I would shoot someone I think exploration or like an event that would be fun being around it and like drinking a lot and playing the piano and oh we're gambling that seems interesting to me and just living in the world but like if I was like take those panties off and then all of a sudden now it's time for a re-acquainted yeah and then the other thing to me is I'm thinking to myself like I think we've talked about this like you know sex doll like you got that's nasty the thing I thought of too with there a lot of sex dolls essentially in there and what do they every night they restart them and clean out their the all the sand blast that **** my thing is that how many how many games have you played where an NPC comes up to you and no one's around and you're like I'm just going to shoot this **** guy in the face it's the same oh no you try it once yeah you got to try it once right so why",
            "start": 7223.32
        },
        {
            "text": "where an NPC comes up to you and no one's around and you're like I'm just going to shoot this **** guy in the face it's the same oh no you try it once yeah you got to try it once right so why wouldn't you do that in real life like you're out in the middle of nowhere some dude's just there and you're like I could just **** they talking James Marsden's character right that he was they were taking him out to the wherever but they still react like humans though they act like humans you rape someone they scream if you it's the exact like I'm you know I'm playing Deus Ex right and in the middle of town if someone if you pull your gun out and shoot everyone goes crazy and they go huddle in the corner and you're just tempted to just **** Slaughter all of them just once like just because a video game though I can't control my biotic that's not you standing same thing where it's like it's just easier if I **** mass murder everyone and so like why wouldn't you do the usually you do it the",
            "start": 7262.72
        },
        {
            "text": "game though I can't control my biotic that's not you standing same thing where it's like it's just easier if I **** mass murder everyone and so like why wouldn't you do the usually you do it the right way I do it the right way I'm with I'm with Matt like yeah it's too real you know what I mean like like when uh when the guy in the bar or the whorehouse or whatever shoots James Marsden and he collaps and then he comes over and does like a million shots and he's like still gasping for air and like it's like I know he's a host or whatever but like that would be too much for me to deal with I couldn't I mean again I to like guns slinging bad guys in the streets like there's distance there's that but I can't just walk up and murder someone or or or more importantly hand to hand combat with knife play stuff when like Ed Harris pulls the knife out and the and we're re-acquainted like said and then all of a sudden it's like is he really going to cut or the a lot of throats are being cut in the show",
            "start": 7297.96
        },
        {
            "text": "stuff when like Ed Harris pulls the knife out and the and we're re-acquainted like said and then all of a sudden it's like is he really going to cut or the a lot of throats are being cut in the show also and you're like wow they just have an unlimited supply of that stage blood I don't know I mean for 40K a day you you got to be sick anyways to spend that money to get into that that world and do are there packages where people like so the the Man in Black Ed Harris what does he have a credit card on file does he just stay there every day in the same outfit just getting sticky and nasty and I mean that's another one of those questions of just like how are they getting these robots in and out like well I mean interesting I understand how they're getting them out with the elevator I but I mean like how are you like are are new people coming in every day and if so how if I just shot James Marsden's character is he there interacting with the Dolores the same way you know what I mean like is",
            "start": 7337.52
        },
        {
            "text": "like how are you like are are new people coming in every day and if so how if I just shot James Marsden's character is he there interacting with the Dolores the same way you know what I mean like is it that we're all it doesn't make sense that the story is reset every day right but that doesn't make any sense then because there's people who are staying multiple days even the guy right now with his brother-in-law overarching Quest and everything else is side quests and so they just stay there it's like a game like if you were to go and like events been triggered you can't do that side quest anymore until you come back the next day and then what do you think I understand what you're saying when the two uh cuz I mean I'm sorry just I'm sorry but what happens then when I take James Marsden out on the trail with me and we're gone for like people can't use them anymore yeah so the quest changes a little bit but you just said that it starts a new every day right but so if you take James Marsden if",
            "start": 7379.32
        },
        {
            "text": "the trail with me and we're gone for like people can't use them anymore yeah so the quest changes a little bit but you just said that it starts a new every day right but so if you take James Marsden if you take James Marsden out that day and that's the day that's the only day I'm there I don't get to do that Quest because someone else took him there's only one of him so I got to go do something else but there's like say there's like 40 quests that are happen the time and only 20 tourists at some point there's just someone waiting out there for me to Quest with right or maybe he comes back and then I can interact with him but either way if they kill him the next day it sets himself up and I get to do that again so theoretically I'm there multiple days I get I get to do the Marsden Quest if I want okay you know or not or maybe I don't but that's the thing too is like that's the whole point remember then the guy gets there he's like don't do that don't do that wait for the thing no I",
            "start": 7415.64
        },
        {
            "text": "if I want okay you know or not or maybe I don't but that's the thing too is like that's the whole point remember then the guy gets there he's like don't do that don't do that wait for the thing no I understood all that but like in my head it was that he like he got there and then there was a however long he was there that that I it didn't reset daily for him but you're right that it does for Dolores so why would it not but yeah that makes sense yeah I just thought it that would be such that would be such a game breaker for me then I'd only go for yeah a day or whatever two days and one night you know what I mean I'm just I don't know I don't want to see everybody oh hey I just **** shot you or I couldn't save you yesterday and your whole family was killed by the Milkman Murderers or whatever but that's why I think taking the longer Quest like the like quest to take you outside would be cooler where it's like suddenly you are in like a different world and you know you're not seeing",
            "start": 7447.12
        },
        {
            "text": "but that's why I think taking the longer Quest like the like quest to take you outside would be cooler where it's like suddenly you are in like a different world and you know you're not seeing the same people the possibility of seeing the same people is significantly less likely unless you go on that last one with all the **** horrified this is what I was going to say yeah are they part of the quest you think no that's Anthony Hopkins put them in there for some reason I think I think that's the new kind unknown at this point yeah the way they acted I was like I don't know if that's a quest or if that's just some crazy thing with Man in Black or what was it he said he said he said a very poignant thing which I think is like the main overarching theme of the whole thing which is like people don't come here for cheap tricks something like that they come here to see the person they could be or something like that to learn who they Lear who they who they can be or something like that",
            "start": 7481.92
        },
        {
            "text": "don't come here for cheap tricks something like that they come here to see the person they could be or something like that to learn who they Lear who they who they can be or something like that um so I I don't know but I think maybe he's like like upping the **** game with this new one or something or they're going crazy that was the end of episode one or two where he was like I have I have a a new idea or whatever like a burned out church or whatever so I don't know but those guys were like weird and they were all using hand to hand weapons which I thought was weird cuz like I don't understand how the I don't understand how a host who's you know programmed to kill but not kill a human comes up and threatens you like the gun they can shoot you with the axe they can't swing and like get right there and stop you're like you're dead lay down or kill me please I don't know well and and then what I was going to bring up is when they had the remember the the pit of guys that were waiting",
            "start": 7517.36
        },
        {
            "text": "right there and stop you're like you're dead lay down or kill me please I don't know well and and then what I was going to bring up is when they had the remember the the pit of guys that were waiting for the cook to come back or the guy with Fedor and then he got stuck in a rock enclosure and then went crazy but then he killed him he actually hit himself with a rock he didn't get stuck he he left he left the scene and started walk he fell into the little Gorge what's-his-butt went then they have the knife moment then then she gets attacked and then instead of killing her he takes a rock it looks like he's going to kill her and then he starts smashing himself where you're like is that a program like I think that was he was I think he was off on whatever the hell he was broken beforehand he was carving the little wooden creatures which is weird shouldn't be doing that but it was that he was yes I think so like already there was something wrong who is the **** guy I always want to say",
            "start": 7556.12
        },
        {
            "text": "was carving the little wooden creatures which is weird shouldn't be doing that but it was that he was yes I think so like already there was something wrong who is the **** guy I always want to say Arthur? No, Arnold's voice in his head telling him to go to do that do that whatever go off get to wherever you're supposed to do and then I assumed when he came out and picked it up it was all right you got to self-destruct yourself so nobody knows what I've told you kind of thing and like smash your I think it had to do with that pyramid that we saw I think it was in the second episode where oh he didn't know what the top was yeah he didn't know what the top was but the first two like I think we're going to start seeing host exhibit those like features right I can't remember was like something one was self-preservation and the other one was uh self awareness no self awareness I can't remember talking it was in it was in in and trying to become more human right",
            "start": 7597.04
        },
        {
            "text": "remember was like something one was self-preservation and the other one was uh self awareness no self awareness I can't remember talking it was in it was in in and trying to become more human right so that was the four tiered system of trying to become more human which they didn't ever know what the last one was yeah he never it's trippy it's really good though I'm looking forward to next week the last thing I I want to say is it's fascinating uh and I made this joke in the other room before the show if you're going to be on that show as an extra you better figure out how you want people to look at you naked cuz the the trippiest part of the whole thing is when they're like ah I got to got to put them in storage or whatever they call it and I mean a lot of that could have been fake or just CGI or a ton of extras just hanging the **** out so so Greg and I know one of the guys that Ted the guy that was played one of the Milkman Psychos the guy that was Jack that my wife was like holy",
            "start": 7638.6
        },
        {
            "text": "CGI or a ton of extras just hanging the **** out so so Greg and I know one of the guys that Ted the guy that was played one of the Milkman Psychos the guy that was Jack that my wife was like holy **** oh he's yeah he's he's Trevor he plays Trevor, voice of Trevor rather in GTA um and when we met him he's he just naturally walks around jacked but he's also hella skinny so I think a lot of you know obviously it's the old trick of like when you're super skinny on camera you look jacked you got to be paid a **** ton of money in Hollywood to be naked yeah but you're in a **** you're in a show with SE with Anthony Hopkins I'll **** start those brilliant that there's so much money to spend on the sets and then a 100 people naked and then some of the top stars in the show have no problem doing entire it's Tastefully done and you buy it and even Anthony Hopkins says why are you covering him he doesn't get cold he doesn't um he doesn't get embarrassed stop it s with the razor it's like Jesus Christ",
            "start": 7678.68
        },
        {
            "text": "entire it's Tastefully done and you buy it and even Anthony Hopkins says why are you covering him he doesn't get cold he doesn't um he doesn't get embarrassed stop it s with the razor it's like Jesus Christ and that dude with that extra was naked and saying hey this is great I just they really they're doing it Tastefully but it is very shocking at some points where their interviews and the maintenance the maintenance is like oh my God put some clothes on it's great you got have you got think one or two of those dudes a lower level guys that are just like cleaning them off just sneaking sneaking a little bit in there I mean if they're already supposed to be cleaning it off just get a taste thr shot across the take a taste no Jesus their jobbing a all right ladies and gentlemen watch Westworld this has been the GameOverGreggy Show remember each and every week four sometimes Sur five best friends gather on this table not even going to try I did I went like this try it with some Gusto next",
            "start": 7722.44
        },
        {
            "text": "this has been the GameOverGreggy Show remember each and every week four sometimes Sur five best friends gather on this table not even going to try I did I went like this try it with some Gusto next time watch I'm going to scratch this table up Nick does it all the time this table's all **** up uh to bring you random topics of discussion for your amusement if you like that head over to Patreon.com/KindaFunny where we post the entire show early and give you a bevy of exclusive goodies and perks if you have no bucks to toss her away no big deal head over to YouTube.com/KindaFunny where we post the entire show topic by topic day by day until it goes up is one big video In MP3 the following Friday Matt Scarpino do it thank you so much for coming by dudes thank you everyone check out Midlife Ballers Matt's very fun funny on it it does the goofy stuff it is Goofy and it's fun and it's you know enduring endearing and enduring it's enduring 3 weeks Everlasting 36 37 weeks the Alpha and",
            "start": 7766.24
        },
        {
            "text": "Ballers Matt's very fun funny on it it does the goofy stuff it is Goofy and it's fun and it's you know enduring endearing and enduring it's enduring 3 weeks Everlasting 36 37 weeks the Alpha and the Omega it's about 37 38 we're doing 360 it's 30 sexy yeah **** until next time it's been our pleasure to serve you yeah",
            "start": 7805.56
        }
    ]
}