{
    "id": 2098,
    "video_id": "YR0pNvlWd5k",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "How Scary Is Until Dawn: Rush of Blood on PS VR? - Kinda Funny Plays",
    "description": "FULL DISCLOSURE\nPLAYSTATION PROVIDED US WITH PLAYSTATION VR FOR REVIEW PURPOSES.\n\nPlease note, video is captured at a lower resolution than what the player sees when using PlayStation VR.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1475856002,
    "duration": 998,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome back to Kinda Funny Games. My name is Colin Moriarty, this is Tim Gettys. Today we're going to show you the game Until Dawn: Rush of Blood on PlayStation VR. It's worth noting that our friends at Sony provided us both our headsets and all of our games, so we thank our friends at Sony for that. Now, Until Dawn: Rush of Blood is kind of a spin-off or like in the same universe as the really fantastic PlayStation 4 exclusive Until Dawn, which came out in the summer of 2015. It's basically like a teen horror film. We all loved that game very much. You were excited about this since you saw it at a preview event, Tim, and so we gave you full rein here to kind of show everyone the game. So I'm very excited about. I mean, this game was what, what kind of sold me on PSVR the most. I've always been a big fan of like light gun shooters and specifically there's a game called CarnEvil back in the day that me and Kev used to play at Round Table, and it was pretty much this.",
            "start": 0.16
        },
        {
            "text": "I've always been a big fan of like light gun shooters and specifically there's a game called CarnEvil back in the day that me and Kev used to play at Round Table, and it was pretty much this. It was like a haunted Carnival and you had to like shoot everything, but the VR just takes it to a whole new level. I want to note that the first time I actually screamed while playing VR was this game, even just during the loading screen. Oh, that's good. The baby, the no, not the baby head, the with like the intro screen where you're going down this hallway and like in your left there's like some things going on, but then this thing pops out on the right. It scared the hell out of me. This game is extremely good at doing that and it's a lot of fun. I, what do you want to kind of start with this? I mean, I think we should go. I think we should show the first stage. I don't think we should show too deep into the game, but I'll leave it up to you. I mean, whatever you want. Well, you know.",
            "start": 39.28
        },
        {
            "text": "This, I mean, I think we should go. I think we should show the first stage. I don't think we should show too deep into the game, but I'll leave it up to you. I mean, whatever you want. Well, you know what? I want to do something that I haven't played yet. I haven't done this hotel. All right, let's let's do hotel. Let's do hotel. Um, so I don't know if you agree or disagree, this, I'm a really big fan of the original Until Dawn. I know you are as well, as we as we kind of just said a minute or so ago. Um, the connections to Until Dawn are kind of tangential. Yeah, it's an absolute spin-off and I personally, I think it's like the best type of use of a property in the sense that this could have just been any type of light gun game, but might as well just attach Until Dawn to it to at least have some recognizable iconography and stuff, right? And you do see things and you will see those things. I don't want to spoil for anyone, but um, you will see certain things that will tie the game together, but yeah, I mean, I'm of.",
            "start": 76.52
        },
        {
            "text": "And stuff, right? And you do see things and you will see those things. I don't want to spoil for anyone, but um, you will see certain things that will tie the game together, but yeah, I mean, I'm of a different mind where I'm like, I don't quite understand why this is an Until Dawn game, but I think that generally speaking, I think horror, um, is a great fit for VR, for virtual reality. And I think that similar to what we, Greg and I were talking about on our Batman and Job Simulator Let's Plays, which deal with locomotion in a different way. Locomotion's dealt with with kind of pressing buttons around in Batman and there is no locomotion in Job Simulator. Um, this game is just on rails, so that's the way they solve the locomotion issue and you can play the game. We're playing it with Move controllers, but you can play it with a DualShock 4. So I wanted to be know that I absolutely love this game. It's super fun. What you were talking about the locomotion stuff, like it totally solves it and like.",
            "start": 116.0
        },
        {
            "text": "But you can play it with a DualShock 4, so I wanted to be know that I absolutely love this game. It's super fun. What you were talking about the locomotion stuff, like it totally solves it and like right now I feel a sense of momentum and it's kind of, it's creepy, you know, it's really unnerving, especially on the roller coaster parts where you're going down. It feels like you're on a roller coaster. Your stomach drops, at least mine did. Oh yeah, oh my God. I I I assume some people are going to maybe get a little groggy, a little sick, definitely. But I mean, it kind of fits the horror theme too, so it's cool too. You reload by just flicking the things down. Oh my God, see this thing is scared. Holy shit. God damn it. Oh, I just hit my knee so hard. Yeah, we got to put little pads on the edges of this table or something. Sweet Jesus. Uh, so that's why I wanted to do a stage that I hadn't done before. Fair enough. Yeah, you don't you don't expect what's going to happen. I do one thing I will say about this, people.",
            "start": 154.2
        },
        {
            "text": "Something, sweet Jesus. Uh, so that's why I wanted to do a stage that I hadn't done before. Fair enough. Yeah, you don't you don't expect what's going to happen. I do one thing I will say about this, people have been asking like, how does it feel to play VR? What do you feel like? It makes me tired, absolutely. And I feel like this particular game, because it is so heavy on stimuli, on visual stimuli, it made me very tired. Like after a couple stages, I'm like, I got to take a break and actually think I took a nap. I don't know if everyone's going to experience that or that's just me, but it's definitely, it does a toll on your body, man. Like it it it's been super super hot and it it makes I need to take breaks all the time. So you all right, so for people out there that are hearing, that's the second time we've heard of the trophy ping. Oh, um, I know it's popping up. Come come at me, bro. Oh, I guess not. So in VR, we were curious about the solution with trophies. We talked about this on a little bit with Batman.",
            "start": 196.96
        },
        {
            "text": "Heard of the trophy ping. Oh, um, I know it's popping up. Come come at me, bro. Oh, I guess not. So in VR, we were curious about the solution with trophies. We talked about this on a little bit with Batman. When Greg and I did our Let's Play, there trophies do not appear either in the headset or on the screen when you earn a trophy. So just so you guys know, you do hear the ping, so you have to go to the trophy needs to stop, man. You got to reload your other gun. There you go. So there are different guns, different weapons. You're got kind of dodge the trees and stuff too. I think really cool. It's we're about to go down. Use the triggers to shoot and the PlayStation Move buttons to reload in case you guys are curious out there. Holy crap. Whoa, this is so I feel like I'm moving so fast. So you can see as Tim was saying, he's kind of bobbing and weaving. You do have to do that. The PSVR unit obviously doesn't light up for fun. It lights up so the camera can track your head movement. Oh my God, this is so.",
            "start": 236.72
        },
        {
            "text": "Was saying, he's kind of bobbing and weaving. You do have to do that. The PSVR unit obviously doesn't light up for fun. It lights up so the camera can track your head movement. Oh my God, this is so awesome. So so far my experience with PSVR has been great in the sense that it reminds me of arcades a lot. Like the the kind of gimmicky stuff where you'd have to pay a dollar to play the game instead of 5 cents. Um, and I I think that's kind of a, it's a cool thing. Oh my God, this is so active. Um, it also reminds me of like the uh, those random like um, 3D rides you would go on. Um, like the dinosaur one, like uh, I don't know, the equ, like where we did at this place called Pier 39, which is kind of like a touristy thing in San Francisco. Is that the one with all the old arcade machines or is that what's the one with the all the old? No, that that was uh near uh Ocean Beach, but uh you go and it's like it's like theater experiences and like the seats move and do all the crazy stuff. Like it really reminds.",
            "start": 282.72
        },
        {
            "text": "One with the all the old. No, that that was uh near uh Ocean Beach, but uh you go and it's like it's like theater experiences and like the seats move and do all the crazy stuff. Like it really reminds me of that. Oh God, been quiet for a little bit. Yeah, so get scared. Some things are popping out. Oh man, oh no, this is like, it's really, I feel super claustrophobic. Yeah, VR does a good place of settling you in a spot. Oh my God, it's definitely, it definitely does the trick. Yeah, it is immersive. I mean, I I really am a believer in this thing and I believe games are the proving ground for much cooler things to come. Mhm. Yeah, this is definitely one of my favorite uh PSVR games so far. Um, I think it's one of the most complete as well in terms of it being an actual game. Yeah, this I do agree with you there. This is an actual game. Like you could have, it's a light gun game, so you could have played it on any number of consoles in the past theoretically. I wouldn't have run. Oh God, here we go. Um, yeah, something. Oh.",
            "start": 332.8
        },
        {
            "text": "Is an actual game. Like you could have, it's a light gun game, so you could have played it on any number of consoles in the past theoretically. I wouldn't have run. Oh God, here we go. Um, yeah, something. Oh, uh oh, here you go. Oh, so again, these roller coaster type areas are really believable when it's like really does. Oh, just makes my my head like hurt. Oh God, all right, we're going in the hotel. So as you guys will see at the end of the stage, the game does track you on. God damn it. The game does track you on things like accuracy and all that kind of stuff and you get graded at the end. So there is a lot of replay value with Until Dawn: Rush of Blood. Oh God, no mannequin things. Oh, and the Crow Lady. This is great. Shit, get away. What you doing? Wow, these things take a ton of damage. Can you stop, guys, getting shot in the face like point blank? Oh, you can leave. You can leave. You, oh no, oh no, oh no, oh no, oh no, there's a, oh, there's a gun to the left. So the boxes, there's vibrant colored boxes you find in.",
            "start": 388.28
        },
        {
            "text": "In the face like point blank. Oh, you can leave. You can leave. You, oh no, oh no, oh no, oh no, oh no, there's a, oh, there's a gun to the left. So the boxes, there's vibrant colored boxes you find in the environment that are new guns, different kinds of guns. So I got to be real, you see my arms right now? Like that scares me more than anything. Like you look over and you see it. Not cool. So yeah, some sort of automatic pistol, automatic pistol, something that guy just did. So there's another trophy pop like I was talking about before. Nothing to see on screen. Tim can't see it either. That is the only indicator. All right, we're going down again. Yep, here we go. Oh my God, oh my God, it's so hard to explain how it feels, but I feel like a badass. That's pretty damn. Can you look down real quick? So by the way, you can see there's a little HUD here in case you wanted to with multipliers, your score and the guns you have as well in case you guys didn't see that earlier. Keep throw shit out me. Oh Lord, there's.",
            "start": 451.32
        },
        {
            "text": "You can see there's a little HUD here in case you wanted to with multipliers, your score and the guns you have as well in case you guys didn't see that earlier. Keep throw shit out me. Oh Lord, there's something. I mean, it's very antiquated at this point, but there's something special about light gun game. Not for sure, sure. I mean, this really is kind of the the future of them, like how they would naturally adapt. Yeah, it'll be interested to see if we get like Time Crisis and House of the Dead. God, I love it. New ones now that there's a solution to play them in a more novel way. I've always been a fan of haunted houses and obviously amusement park rides and like things like Disneyland and this is like, that's all this is. That's why I like PSVR so much. VR in general. Oh God, this hook doesn't look nice. Oh my God. God, you need to turn your head around. Where where she going to pop? Oh, it's that's a soft. I'm going to avoid you. Dude, they are hell close, shit. Oh wow, my God. So the saw is obviously a pretty overt.",
            "start": 523.32
        },
        {
            "text": "My God. God, you need to turn your head around. Where where she going to pop? Oh, it's that's a soft. I'm going to avoid you. Dude, they are hell close, shit. Oh wow, my God. So the saw is obviously a pretty overt reference to the original game. Um, holy shit, plus they're just scary. So are just scary as it were. This game is a lot to handle and I like it. Now it's all quiet. Something terrible is going to happen probably or maybe not. I don't know. No, it's coming. I'm scared. The funny thing is if things get too scary and you you can just close your eyes and then you're not there anymore. God, imagine waking up to that. Jesus Christ. Uh, there are collectibles in the game as well. These collectible kind of statues you shoot from each stage has a bunch. What's up, bro? Are you waggling the remote too or the head? Yeah, okay, cool. I didn't do that. It it's really cool. You guys moving. Y'all good? Y'all homies? You look like a homie. Sorry about that. Shoot you in the dick. Okay, y'all gone. I love the use of the the flashlights.",
            "start": 567.88
        },
        {
            "text": "Cool. I didn't do that. It it's really cool. You guys moving. Y'all good? Y'all homies? You look like a homie. Sorry about that. Shoot you in the dick. Okay, y'all gone. I love the use of the the flashlights as well. It really makes things even scarier. Like not like right now, like that's just no, let's not even do that. It's also weird having you next to me, Colin, and not seeing you. Yeah, I'm here, but I'm not. It just disappeared any time. It would be funny if we just all left quietly and the lights off and drew the curtains and then you woke, took the VR unit, you were alone. You, I the uh, the kitchen demo yesterday still shit terrifying. I'm telling you, horror is, I mean, you know more than anyone, horror is where it's at. I think with this particular unit and things like EVE: Valkyrie Space Found, I think there's a lot of natural. The other thing too is like right now I'm playing without headphones on. That's when it's really, yeah. M, cuz there's, oh my God, you can hear the moving my headphones. That clown.",
            "start": 653.72
        },
        {
            "text": "A lot of natural. The other thing too is like right now I'm playing without headphones on. That's when it's really, yeah. M, cuz there's, oh my God, you can hear the moving my headphones. That clown scared me more than anything. There's something to your left, really. I can hear it. Oh God, the dick, you shit. I felt something touched me in real life, but it was just my jacket. Resident Evil is going to be just a huge. I can't I can't wait. I can't shit wait to play Resident Evil 7 on VR all the way. I hope a lot of people do support it that way so we can get more of them. I'm sure they'll they'll have. Man, you need to stop, Crow Lady. Oh Lord, oh come on. Yeah, creaking is a little ominous. Also, I like being in a spinning chair. Okay, open the doors. Got two shotguns. Someone's about to taste how slow it's moving right now. Oh yeah, oh my God, shit, is that the shit? Is that heart? Y'all need to stop. Shotguns do a lot of damage. You, oh my God, stop your shit, not cute anymore.",
            "start": 704.4
        },
        {
            "text": "Taste how slow it's moving right now. Oh yeah, oh my God, shit, is that the shit? Is that heart? Y'all need to stop. Shotguns do a lot of damage. You, oh my God, stop your shit, not cute anymore. Oh my God, oh, did I? Yeah, wow. I've never lost so far. It is. I will say the game's a little nebulous with damage received. What's hitting you? Yeah, I mean, even the shooting's kind of off, but it's like, whatever, I'll take it cuz it's it's so immersive. Yeah, I will say out of the three games I've spent time with uh with my at home, which is Batman, uh Job Simulator and this, this one has, I think, the in my limited experience, the the wonkiest controls, the most intuitive, but the longest reload. Oh my God, a holy shit, what are you summoning, dude? Oh my God, the shit off. Sorry if I'm like all up in your face. No, no, no, you're fine. It's not looking good, dude. No, should we call it? I think we should call it. I want to let people experience it for themselves. All right, that's Until Dawn: Rush of Blood.",
            "start": 818.03
        },
        {
            "text": "In your face. No, no, no, you're fine. It's not looking good, dude. No, should we call it? I think we should call it. I want to let people experience it for themselves. All right, that's Until Dawn: Rush of Blood on PlayStation VR. It is a launch game. Again, thanks to our friends at Sony for providing our headsets and our games as well. Uh, check it out. On rail shooter, pretty good game. I think you guys will enjoy it. Uh, until next time, we'll see you later. Bye. God.",
            "start": 966.6
        }
    ]
}