{
    "id": 2338,
    "video_id": "6A-Ts2QRO08",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Nick's Stories of Being A Waiter - The GameOverGreggy Show Ep. 164 (Pt. 3)",
    "description": "Nick finally tells his stories of being a waiter.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1485331202,
    "duration": 1643,
    "transcript_chunks": [
        {
            "text": "This episode of The GameOverGreggy Show is brought to you by Movement Watches. Movement Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high quality minimalist products at revolutionary prices. With over 500,000 watches sold, the customers in more than 160 countries around the world, Movement Watches has solidified itself as the world's fastest growing watch company. Movement Watches started just $95. Now at a department store, ladies and gentlemen, you're looking at 400 to 500 bucks. Movement figured out that by selling online they were able to cut out the middleman and the retail markup providing the best possible price, classic design, quality construction, and stylized minimis. Over 500,000 watches sold in more than 160 countries. Did I say that? I did. Right now you can get 15% off with free shipping and free returns by going to movement watches.com/greggy. That's mvmtwatches.com/greggy. This",
            "start": 0.08
        },
        {
            "text": "watches sold in more than 160 countries. Did I say that? I did. Right now you can get 15% off with free shipping and free returns by going to movement watches.com/greggy. That's mvmtwatches.com/greggy. This watch is cool. You've seen me talk about it before, black face, red hands, black band. I look awesome. So it's time to do it ladies and gentlemen, step up your watch game. Go to movement watches.com/greggy, MVMT, join the movement. All right, my topic, your topic right, is about Nick Scarpino. Nick, a while back on a few shows ago you teased, yeah, you should do your waiter slf food stories as a topic, right? I want to hear some you, I want to hear about some of these stories. You were a waiter for how long? Uh, or how long were you in Food Service? I was in the Food Service. My first job ever was as I was 16, no 17 years old and I was a uh, a pizza cook at an Italian restaurant. So that's why I remember I taught you had to do piz. I was going to say for the record you can of course go to my Instagram",
            "start": 40.32
        },
        {
            "text": "was 16, no 17 years old and I was a uh, a pizza cook at an Italian restaurant. So that's why I remember I taught you had to do piz. I was going to say for the record you can of course go to my Instagram instagram.com/GameOverGreggy and I still use your pizza method. That pizza I made last week was so **** phenomenal. I bought stuff again to make it this week. So I yeah, my my friend of mine worked at a place called Boomas which was uh near near a was it near PSIs? No, it was very close. It was near a uh, an Edward Cinema uh in Riverside California. It's no longer there unfortunately, but he got me a job as a waiter. Now we made um sorry, a cook rather, uh and we made minimum wage just a cook, just a cook, lowly lowly fried cook. No, um was minimum wage. Minimum wage back then was I want to say it was four bucks. No, it was somewhere up in seven, six or seven something like that. Been **** four bucks since like the 30s. Jesus out the cor I just points at me just like 30s. Um so that's that's where I learned",
            "start": 101.0
        },
        {
            "text": "no, it was somewhere up in seven, six or seven something like that. Been **** four bucks since like the 30s. Jesus out the cor I just points at me just like 30s. Um so that's that's where I learned the uh, the sort of the value of of working hard and not working smart, right? And so that that was I always say like when you're young and you're just starting out on anything what you end up doing the cycle that you end up being in is learning what not to do over and over and over and over again until eventually you figure out figure it out and then you're like oh I'm I've been an idiot all this time I'm working way too hard I should work smarter. This was the job that I was like this is the worst job I'm ever going to have and I knew it happening. I knew it was happening while it was happening but all my friends worked there and then one by one they went away and then I went off to college and I was like I got to I got I got to stop this this is horrible but we would work like from 4 till like 1",
            "start": 147.52
        },
        {
            "text": "my friends worked there and then one by one they went away and then I went off to college and I was like I got to I got I got to stop this this is horrible but we would work like from 4 till like 1 minimum wage and then when all the waiters got to go home we would have to do we' have to clean up the kitchen. So like a normal restaurant you have a cleaning crew that comes in. So like a really fancy restaurant like the cooks don't clean. They'll clean their station probably and make sure everything's prepped for the next day and sanitized or whatever but then there's a deep clean that happens every night. We did the deep clean and I mean when I say deep clean I mean I used to have to clean out the little the gutters like the the the troughs at the bottom of the floor all the **** would coagulate as all the water and sauce and spill everything would spill and then I remember thinking this is this is the this is the **** most horrifically demeaning thing I've ever had to do when the",
            "start": 193.52
        },
        {
            "text": "as all the water and sauce and spill everything would spill and then I remember thinking this is this is the this is the **** most horrifically demeaning thing I've ever had to do when the the lead Chef walked me into the walk-in refrigerator. We're talking like you know this it's a freezer basically um freezing cold but throughout the night when you're pulling stuff **** would fall on the ground sauce would fall and it would coagulate and then you'd step on it so over and over and over go and he's like you got to claim that up and I'm like well how do I do that it's like Frozen and he hands me this um it's like a blade it looks like a handle with a dull blade on it and what what it's used for is scraping the dough off of a tray so like when your when your Dough's risen you scrape it off like this and then you can put it on the flower and roll it out he hands me that thing and he's like you got to scrape the all the **** off this floor and then sweep it up and then mop it and so",
            "start": 227.68
        },
        {
            "text": "like this and then you can put it on the flower and roll it out he hands me that thing and he's like you got to scrape the all the **** off this floor and then sweep it up and then mop it and so at the end of every night I would literally get on my hands and knees and scrape like **** pasta or dough that had been like ground into this floor over the period of like six hours scrape it all sweep it up take a a **** dirty like a clean mop and and by the way when you were done with the mop water it would start off Cay it would be **** Brown and then I would have to do that for like every other part of of the the kitchen and you're in a freezer oh you're in a freezer yeah it's it's it's terrible you're you're bouncing out and trying to get like a little bit of warmth granted I was like also a cook and didn't give a **** what I ate back then so there was that but there was also like I would make myself pizza every five minutes like there would we have excess dough and I would just",
            "start": 268.08
        },
        {
            "text": "also a cook and didn't give a **** what I ate back then so there was that but there was also like I would make myself pizza every five minutes like there would we have excess dough and I would just roll out roll out the pizza and send it through and it what it was like try to escape from prison like one out of every three would get caught by the guy like the lead cooking you can't **** do this you can't be eating pizza while making pizza I was like okay cool and then I'd like lock eyes my other homie I'm like oh we got two more coming we got two more coming you know he just like I would make myself like sandwiches and just hiding behind **** and he was like dude you can't eat half a sandwich and put it's not sanitary and I'm like I'm 16 I don't **** care like doesn't matter and so that was that was one of the jobs that I was happiest in my entire life to quit and then I went from there to uh I worked at a like a like a Jamba Juice SL like the coffee place got even fatter there",
            "start": 311.8
        },
        {
            "text": "that was that was one of the jobs that I was happiest in my entire life to quit and then I went from there to uh I worked at a like a like a Jamba Juice SL like the coffee place got even fatter there because I was like like it was like it was like a it was a Juice It Up I think is what it was remember juice remember Juice It Up no they're like it's these these uh the style of juice Place smoothie place that sold the most unhealthy smoothie on the planet like normal healthy smoothie is like you know like maybe almond milk with some spinach and maybe some and this was like ice cream and like and like some strawberries right and so I would I would eat like five six of those a day or just be Cannonball those **** just cuz you'd experiment you get bored you're like you know what happens if put in a kiwi strawberries and M Chocolate Chip disgusting you get get another one you know um so I did that but well I didn't start serving food until Midway through college and that was cuz my",
            "start": 346.52
        },
        {
            "text": "if put in a kiwi strawberries and M Chocolate Chip disgusting you get get another one you know um so I did that but well I didn't start serving food until Midway through college and that was cuz my brother had served food and so I kind of saw that lifestyle and I was like oh M Scarpino must have been one of the funnest waiters to have awesome he strikes me as one of the guys who'd come up spin the chair on what's going on guys what do you want want some he played characters madag now he's totally a t the vest wait for this my brother when he when he's on the show we should have him do these stories I think I think we did before but okay he worked at a place called Bobby McGee in San San uh sardino um Bobby McGee is a theme restaurant so you pick you play a character while you're serving food and his character was Great Scot oh I do vaguely remember him talking about being a Kil and sometimes and this was this was deep in deep into my brother's like college I he he was a sigma new he",
            "start": 387.88
        },
        {
            "text": "food and his character was Great Scot oh I do vaguely remember him talking about being a Kil and sometimes and this was this was deep in deep into my brother's like college I he he was a sigma new he was drinking like every **** night he looked great because he was like you know it looked like he was training for like the sex Olympics and so he he would just mow through people and like it was it was ridiculous but I I went the other way with it I was like I'm going to be super fat and smoke a lot of cigarettes so a lot less work yeah it was a lot less work um so yeah I mean we and that was my that was my life for for for all of college which was just bouncing back and forth between restaurants like my first restaurant I I worked at for a couple years that was the one where I was when I I became a server at that restaurant and it was it was fun because I hated it so much that I never pushed for the fun like the good shifts where you can actually make money so I'd get the Sunday",
            "start": 434.36
        },
        {
            "text": "I I became a server at that restaurant and it was it was fun because I hated it so much that I never pushed for the fun like the good shifts where you can actually make money so I'd get the Sunday afternoon shifts where we would everyone would bring breakfast and we would just have cereal and then someone would walk in like you kind of go over and serve them and come back to like just chilling like it would be make people feel unwelcome the second they walk in like be here guys open like Italian restaurant for lunch like you don't want to be here it you don't want to be here um but the the the lifestyle starts to wear on you after a while because because it is very much you work until midnight and then take every every dollar you've earned in tips and then we all go to the bars afterward and so there was like everyone was sleeping with everyone so like people got knocked up constantly there was like like girls like the hostesses would drop like flies because every like six months one",
            "start": 476.4
        },
        {
            "text": "and so there was like everyone was sleeping with everyone so like people got knocked up constantly there was like like girls like the hostesses would drop like flies because every like six months one of them would like I'm pregnant and then it was always super it was always super awkward because like you knew the guy that was begging them was also begging the other hostesses oh God and like I remember one of the like people do stupid **** cuz you're when you're serving food when you're in that you're not in the normal world like there's a Anthony Bain wrote a book about this that made him famous confid yeah and it's supposed to be I read I don't read again unless I'm on a flight but it's it's in a plastic bag but but it's about that it's about that sort of like you're at work when everyone's not you're like when you don't think about it because when you go to a restaurant you sit down you're there for good service but people that's their job they're working so at 5:00 when you get",
            "start": 513.88
        },
        {
            "text": "not you're like when you don't think about it because when you go to a restaurant you sit down you're there for good service but people that's their job they're working so at 5:00 when you get off and you're thinking like oh we're going to go go for steak T that or whatever someone's thinking I'm I got to go to work I got to be professional stuff but after that holy **** like there there were there were times when you'd have guys that were like I remember one time we had a guy good-looking guy but dumb as **** very hip-hop though um like he was totally like the whitest guy you know but he talked like he was a hip-hop artist you're like oh God I'm familiar with a lot of those guys oh **** shout out to Cool Greg nice by the way his Instagram is is public now and it's the best thing on the planet yeah yeah what is it Cool Greg underscore I think Cool Greg I like Cool Greg Cool Greg is a **** cool GRE got the name cuz he's Cool Greg oh my God Cool Greg last night wasn't in the most",
            "start": 554.8
        },
        {
            "text": "planet yeah yeah what is it Cool Greg underscore I think Cool Greg I like Cool Greg Cool Greg is a **** cool GRE got the name cuz he's Cool Greg oh my God Cool Greg last night wasn't in the most Cool Greg mood I've ever seen him in my life he orders a burger we go to we go to BJ's because Sean wanted to go to BJ's it's 11:30 and he's like they close at midnight we can get there and I'm like I'm sure they're going to be super happy that a party of 10 walked in at 11:30 night so we get we get in there cool orders a a burger but it has mayo on it he doesn't like mayo and so he goes can I have it with no mayo please don't even put on this side just no woman's like cool but it's 11:30 and so she goes back and again another one of those server stories like I've been in that situation I'm like mother **** I just I thought we were closing I was almost out of here Party Town walks in Burger comes it's got Mayo on it and he just looks at it and it broke him and he was just",
            "start": 594.08
        },
        {
            "text": "mother **** I just I thought we were closing I was almost out of here Party Town walks in Burger comes it's got Mayo on it and he just looks at it and it broke him and he was just like cuz he was like I don't want to embarrass you guys but this has mayo on it and I don't want to eat it and I'm like I'll send it back and he's like I I'm fine I'm not going to say anything and I'm like well it's more Awkward that you're just staring at the Burger than it is if you just tell don't want it right and then so she comes and I'm like you know what he it doesn't have it has mayo on it can you can you remake it or is the K if the kitchen's closed don't worry about it just just take it back and take it off the bill and she looks at him and she's like what do you want me to do and he goes I don't know what should I do and she was like well we're making for you it's okay it's not that big of a deal but like he wasn't even hungry so it comes and then he just keeps staring at it and then he's like",
            "start": 635.16
        },
        {
            "text": "what should I do and she was like well we're making for you it's okay it's not that big of a deal but like he wasn't even hungry so it comes and then he just keeps staring at it and then he's like can I get a and then like you know 15 minutes after we're all done eating he's like can I get a box and then the Box comes and it's got toothpicks in it and so he's trying to close the box over it because it's so perfect he doesn't want to take the toothpicks out of it but the toothpicks start poking through the box and it's just it's just it was a whole cruffle it I love that you had your first pizuki I had my first pazooki yeah man that **** is crack it's amazing it was so good that she delivered two bazookis and six forks there's 10 of us now most people didn't want part of the bazooki I was like it's my birthday weekend I'm going to have some **** I haven't had cake I'm going to have some bazooki so I'm eating and I look over and I lock eyes with Kevin Kevin did not get a spoon or a",
            "start": 672.4
        },
        {
            "text": "like it's my birthday weekend I'm going to have some **** I haven't had cake I'm going to have some bazooki so I'm eating and I look over and I lock eyes with Kevin Kevin did not get a spoon or a fork for this thing oh no and Kevin she's like excuse me can I have excuse me excuse me can I sir can I have a kept walking by she's like I'm closing I'm done sir sir excuse me I'm halfway through and Kevin's like this is starting to bother me I don't know what to do do I get up and he was like in the middle of the table so he couldn't get up so finally he looks at me and I'm just whittling through ours and I look at him and he looks at me and my spoon comes out of my mouth and I just hand it to him and he takes it digs it into bazooki and starts eating as his spoon gets delivered and he goes like this it's okay I'm using his dirty spoon and I'm like I'll take the clean one and it was this and Kevin **** he didn't care didn't skip a beat just kept going in it God bless it that's the kind",
            "start": 714.16
        },
        {
            "text": "this it's okay I'm using his dirty spoon and I'm like I'll take the clean one and it was this and Kevin **** he didn't care didn't skip a beat just kept going in it God bless it that's the kind of **** you deal with when you're when you're a server that's that's what you have to deal with that's how good that pizuki was you **** took a spoon right out of that man's mouth so is this from your time of being a server is that where your short fuse comes from for bad service yeah I think that because I was such a terrible server because I hated it and it was again it was another one was life life lessons where I was like I don't know why I'm investing any time in this like I was just so caught up in not really having ambition that I'm like I'm serving food I'm making enough money I'm getting by like this is fine um but there is you know anything worth doing is worth doing right so there is a sense of sort of Pride that you you kind of have you're like well you know like these people",
            "start": 749.68
        },
        {
            "text": "by like this is fine um but there is you know anything worth doing is worth doing right so there is a sense of sort of Pride that you you kind of have you're like well you know like these people came here to have a good experience like I want to give them the best experience I can um and so there are you know you when you worked at nicer restaurants you had people that really gave a **** about it like I worked at a place called berin which I think there's still one in Vegas um but they had corporate like offices and they'd have people that would come train you and they were like look these are the steps of service right these are the things that you're supposed to do in order to ensure that people are having a good time touch a table in the first five minutes touch table in the first five minutes right like drink orders have to cut like get there tell them about the specials get the drink orders get any appetizer orders and get those drinks back as soon as possible once the food",
            "start": 789.72
        },
        {
            "text": "five minutes right like drink orders have to cut like get there tell them about the specials get the drink orders get any appetizer orders and get those drinks back as soon as possible once the food drops on the table you got to get back there with it before like before the second bite I think is what they used to say so like you you that those the things that you want to make sure and and there's and there's sort of an art to to making sure that people are taken care of but not smothered right you don't want to be that guy that's turning the chair sideways and be like guys what are we doing tonight what are we doing after this you know um you want to be that person that's just kind of there to facilitate amplifying the experience amplifying the experience exactly um and and you know I was never really that person because I never really gave a **** and so when I see people that don't give a **** it's very easy to recognize that like yourself sure I like you don't care you're",
            "start": 823.92
        },
        {
            "text": "I was never really that person because I never really gave a **** and so when I see people that don't give a **** it's very easy to recognize that like yourself sure I like you don't care you're working on us like that one time we went in Austin it was like a day like no one was there that dude was high **** on we will never stop referring to that trip like that that was the worst the worst experience I've ever had and so that's when I I just it's it's unacceptable because I think on a very base level I don't care what you're doing if you are doing a job that you hate stop doing the job yes I agree figure out something else don't let it **** you up don't let it turn you into an **** don't let it turn you into little lazy unambitious piece of **** the second that happens you're going to eventually run into me and I'm going to call you out on it and that's what this guy this is what's happened this guy at this restaurant that we went to the food was so late we had time we",
            "start": 853.6
        },
        {
            "text": "going to eventually run into me and I'm going to call you out on it and that's what this guy this is what's happened this guy at this restaurant that we went to the food was so late we had time we were like we ordered took him forever to get our **** order food goes in food doesn't come out for it's been 30 minutes at this point 45 was yeah since we ordered and I'm like excuse me sir can you check on our food it's been a little while and he goes he looks at his **** watch and goes well it's only been like 1 minutes and I'm like go get your manager yeah go get your man right now and he's like what and I'm like go get your **** manager right now and she comes over like what's going on I'm like when I ask a server where my food is I don't want him to tell me that it's only been 1 minutes especially when",
            "start": 897.04
        },
        {
            "text": "especially when and I showed her the watch of like my phone the text message when we sat down I was like I sent this text out when we first sat down it has been 45 **** minutes and there is no one in this restaurant it was us a table of old people and a **** dog outside and that was it and I'm like where the **** is our food go into the restaurant I was like sir I think you should leave um I'm like go check on our food she goes she's like I'm so sorry like I think the guy forgot to put the **** order in cuz he he was noticeably high like you talk about this yeah yeah like I don't know what he was doing I'm guessing pill addiction but I'm not sure um so this guy and he professional and then he's looking and then he's like shooting us looks across the thing and I'm like this look to the manager and she was a very nice person was like I'm I'm sorry sir we'll take care of this we'll comp some of your stuff for you and Y yada I was like good but I'm like look I don't I'm not",
            "start": 939.76
        },
        {
            "text": "to the manager and she was a very nice person was like I'm I'm sorry sir we'll take care of this we'll comp some of your stuff for you and Y yada I was like good but I'm like look I don't I'm not comfortable with this guy serving us anymore I don't like this guy we need we have **** we got to do later today we got to get back to the convention center like you got to give us another server and the next guy to the credit was he was Jing on the spot but like I don't want to be in that environment then no one's happy you I've already yelled at someone I've already raised I've already like I didn't yell but I was Stern with someone and I hate having to do that it's debatable where where you were at volume wise I was on the middle I was I was on the the CP the cusp yeah um Serv that's the I mean over the weekend like it was the this like these varying degrees of different service where Jen was in town we went up uh North through Marin uh to Hog Island Oyster Company where you",
            "start": 980.4
        },
        {
            "text": "the I mean over the weekend like it was the this like these varying degrees of different service where Jen was in town we went up uh North through Marin uh to Hog Island Oyster Company where you go and like they have an oyster bar there super it's a town you know it's Marshall a town of 50 people they have all these different oyster Shacks on the water wait where is this Marshall California up North about an hour and a half with traffic hour 15 if it's it's going well uh anyways we got up there we had the I yesterday she or the day before she had been like I want to go do this I'm like all do you want to say the bar do you want to get like the picnic thing cuz the P the bar is like normal they're going to bring you you order what you want they're going to bring it to you and then the p thing is you get a table and a grill and you go buy the oysters and you bring them over and you sh them yourself and you do all this stuff you grill them you bring other stuff it's like let's do the",
            "start": 1011.0
        },
        {
            "text": "thing is you get a table and a grill and you go buy the oysters and you bring them over and you sh them yourself and you do all this stuff you grill them you bring other stuff it's like let's do the picnic I'm like all right cool and we got there and I was immediately off-put cuz like the reservation started at 10 first off overall amazing experience place is great I'll go back but it was that jarring thing of what my expectations were because it is San Francisco and Bay Area and I we do go to really great places usually that are super awesome you know what I mean and we got there and like there was a line to get in but it was like 11:00 and our reservation started at 10:30 you book it for like 3 hours right and so we got there and I'm like well they're lined up for the bar there's already people over at the picnic table what do we do so like we walked in and then like the person at the bar was like oh we're not open just I'm like we have a picnic rest she's like oh go still go back",
            "start": 1049.0
        },
        {
            "text": "people over at the picnic table what do we do so like we walked in and then like the person at the bar was like oh we're not open just I'm like we have a picnic rest she's like oh go still go back we'll be right there and she walked over and like brought us there and she's like all right cool and you go over there to get your oysters and you do this thing we'll see you later and they walked away and like no was this our first time like what do we do like I was like all right so I walked over there I'm like can to get oysters from you like oh yeah how you I'm like all right great and I'm like I need charcoal he's like oh you get that to the bar I'm like but I Okay and like went over there and then bring the charcoal one it's not it wasn't briquettes it was like the mosquite logs or stuff which are great but I'm you know I haven't barbecued since I lived in Missouri cuz you can't have a **** Barbecue in San Francisco so I'm like it was just like this like frustration of like **** what",
            "start": 1080.56
        },
        {
            "text": "are great but I'm you know I haven't barbecued since I lived in Missouri cuz you can't have a **** Barbecue in San Francisco so I'm like it was just like this like frustration of like **** what is this all and then once I got in the rhythm of it I was like all right great but then the opposite you know of I took her to W Fair Tavern cuz she wanted to Fried Chicken we're going to go out see some sketch comedy cuz it's Sketch Fest or whatever so **** we I we were late for that reservation or first off I called them while we're crossing the Golden Bridge I'm like Hey we're coming in I know it's tough can we get a spot and the guy's like oh yes we can put you the the chef's thing or maybe a table I'm like great perfect and he's like what's your name give him my name start reading my phone number autofill he's like oh welcome back Greg I'm like oh hang up then a few hours later we're late of course so I call him like Hey we're like 20 minutes late like oh no problem Mr. BLAH we'll do",
            "start": 1109.64
        },
        {
            "text": "phone number autofill he's like oh welcome back Greg I'm like oh hang up then a few hours later we're late of course so I call him like Hey we're like 20 minutes late like oh no problem Mr. BLAH we'll do this and I hang up and she's like man they were all really Cal I'm like gu that's what everyone's supposed to be like that's supposed to be the experience if you want people to come back you got to be nice to them and that was the problem of the next day we went to Social Kitchen and Brewery in the sunset which I **** love great beers the food solid but as we walked in she's like oh this place is really cool I'm like yeah heads up the service always **** awful and I'm like they have this new guy I'm not sure if he's a new owner or a new manager and I've seen him trying to whip the place in shape we're going to see how it goes **** terrible the bill comes she's like let me pick it up she's like let me pick it up I'm like great give them no money she's like what and she's Canadian I'm",
            "start": 1142.64
        },
        {
            "text": "shape we're going to see how it goes **** terrible the bill comes she's like let me pick it up she's like let me pick it up I'm like great give them no money she's like what and she's Canadian I'm like give them nothing like do not tip them for this I don't have that I can't do that I can't I know it was a whole like conversation like I will **** tear this up and I'll pay for the meal to **** give them no money cuz again it was just like five different people came no communication between them long periods of ordered a salad and um the pork belly fried rice they do that should take 30 seconds to cook in plate and we were there like 30 minutes we finished our drinks they came by like do you want another drink I'm like no I'd like the food like if I get if I you know if this would have all moved in you know a smooth fashion maybe I would have like that but now I'm **** angry and I don't want to do this yeah that's and and that's that's the thing for me is like and again I",
            "start": 1176.4
        },
        {
            "text": "have all moved in you know a smooth fashion maybe I would have like that but now I'm **** angry and I don't want to do this yeah that's and and that's the thing for me is like and again I recognize that like I don't have it in myself not to tip like I've never ever walked out of a even that restaurant we were at I still tipped generally well because did and we fought you on that yeah like don't do it I was like I the second guy was good and he's getting the tip so that's fine I get that um but my thing is when you're at a like San Francisco is a different ecosystem right because the service industry up here is more way more focused on the actual food than I think it is on the service now that's not to say like we went to Nopa and the service there was **** amazing way was great great so there's lots plenty of places but I have been to a lot of mom and pop owned shops where they're owned by people who just like to cook but not necessarily understand what the service should",
            "start": 1212.04
        },
        {
            "text": "great so there's lots plenty of places but I have been to a lot of mom and pop owned shops where they're owned by people who just like to cook but not necessarily understand what the service should be based around that right and there is is a mentality in some of these places where when you go to them it's not about the customer you're almost putting them out by wanting to do things you know what I mean and I don't like that experience I went to the Chinese food shop down uh the street with a friend a couple weeks ago or whatever and we got there and like the people who were running were just eating Chinese food in the middle at lunch it's like we they like oh sit here I'm a great we sat there like there's eating I can see you can you come like get our order what you whatever you're having yeah exactly I mean for whatever it's worth I mean that usually signifies it's good food good yeah like we're eating it **** it must no but so the tail end of my my serving career really taught me",
            "start": 1245.88
        },
        {
            "text": "yeah exactly I mean for whatever it's worth I mean that usually signifies it's good food good yeah like we're eating it **** it must no but so the tail end of my my serving career really taught me something though and that was when I was out of college I graduated I was not using my uh prestigious film studies degree from the University of California Irvine um and I was pretty depressed I was like I'm all I'm CU you are kind of what you do right you know I I don't really necessarily subscribe to the notion that you're like your inner qualities are you like you're your actions you're you're sort of a culmination of what you do and at that point all I was doing was serving food and again not to disparage the food service industry if that's what you love doing great but I wanted to be in video production I wanted to make films um and so I had just started shooting weddings and it was just getting to a point where I'm like making a little bit of money on it but I still needed my serving",
            "start": 1282.4
        },
        {
            "text": "production I wanted to make films um and so I had just started shooting weddings and it was just getting to a point where I'm like making a little bit of money on it but I still needed my serving jobs and I was doing two at the same time so I was at two different restaurants CU I was like I got nothing better to do so I'm just going to pull double shifts every day which is stupid again working harder not smarter I could have been like I have all morning to do not like go on a film shoot or or schedule those things out and I just didn't **** do it I did a couple but it didn't work out um and so some things psychologically broken me at a certain point and was like you're more than this or you want to be more than this you have other aspirations and goals in life and this is holding you back but that was deep in my subconscious and how that manifested was in the span of a month I got fired from two jobs so I was working at I was working at The Market Broiler in in the blocket orange",
            "start": 1320.04
        },
        {
            "text": "back but that was deep in my subconscious and how that manifested was in the span of a month I got fired from two jobs so I was working at I was working at The Market Broiler in in the blocket orange which is like a run-of-the-mill like it's like a like you get salmon for like 10 bucks at this place you know so it's and everything comes with like eight sides so they'll tell you the quality the it's like Applebee's level like a little maybe a little bit lower um I was working there and I was working at a at a Japanese restaurant and so uh at one point I just got so frustrated that I like it was this exact same thing we were talking about with us last night where this party came in I was like I'm supposed to be going home and a party of like 10 came in on a Sunday and I was like dude we're supposed to be closing right now and like shutting down for the next thing like I was telling my manag you got to close like we're I got to I can't keep working and the guy's like you got to take this",
            "start": 1356.36
        },
        {
            "text": "to be closing right now and like shutting down for the next thing like I was telling my manag you got to close like we're I got to I can't keep working and the guy's like you got to take this table I was like fine whatever and I was punching in their order and I just went and just put my **** hand through this like terminal and I looked up at him and he looked over at me and I'm like that's such a **** boss way to quit I'm like I guess uh and he's like yeah you're you're fired it's like you can't destroy a $300 computer console like I can't have you doing that and I was like okay you shuffled the menus put them in your briefcase and walked out yeah sure it's been excellent working with you uh and then so the next month I got or I think actually it wasn't within a month I apologize about that it was I think I quit the other job because I got another job at Downtown Disney and that was the last serving job I ever got which was at the Ralph Bren and Jazz Kitchen and that was that was",
            "start": 1398.84
        },
        {
            "text": "that it was I think I quit the other job because I got another job at Downtown Disney and that was the last serving job I ever got which was at the Ralph Bren and Jazz Kitchen and that was that was where I was like I'm getting a little too old for this lifestyle because that was at that place I had heard stories of the Christmas party before where they were no longer allowed by Disney to have their Christmas party at Ralph Brennan's because people like were **** on the balcony like it was going it was crazy cuz they shut it down and everyone would come there yeah and I was like **** how did I miss that one uh was when where I sign up I hit a part in my life where I was like I just I got to falcony man I definitely want to **** on a balcony I still want to **** on balconies I want **** bathrooms also I just want to **** uh but it was me and my good friend we called him Eddie no no because he used to drink a lot and he was an ex-marine he had Eddie no no and Nick running",
            "start": 1439.2
        },
        {
            "text": "**** bathrooms also I just want to **** uh but it was me and my good friend we called him Eddie no no because he used to drink a lot and he was an ex-marine he had Eddie no no and Nick running around Irvine Eddie was a great guy he was an ex- Marine right he and he actually I think he was over in Iraq for a while came back and he was serving food really cool guy uh but we just became friends because we had that sort of like we work the day shift all the time at in Downtown Disney there's never anything happening he would just like pour me drinks and we would just get **** hammered and then when it started to rain or when it was slow We we'd all get off and a small contingency of us drunk as **** would get on the Montre rail and go over to Disney for free because we were Disney employees technically we weren't employees but we were like Associates whatever yeah cast no we weren't cast members but we were like one step down from that so like we weren't we didn't get all the the",
            "start": 1476.56
        },
        {
            "text": "technically we weren't employees but we were like Associates whatever yeah cast no we weren't cast members but we were like one step down from that so like we weren't we didn't get all the the perks we can get other people in but we could get it at the park and so we'd get hammered and go ride Space Mountain just over and over again and I'm like I got to do something else with my life and then the wedding business started picking up just to the point where I was like I can't really pay rent on it yet and then it happened there was one day when like I just couldn't deal with tourists anymore CU When you work in Downtown Disney you're working with a lot of uh people who are on vacation but they're from **** they come from wherever and if it's raining that day they don't it's not like you cannot be on vacation with your family you just came from France and so people are pouring in and there's **** everywhere and I'm just so **** tired and it's raining outside and again I was just",
            "start": 1513.0
        },
        {
            "text": "cannot be on vacation with your family you just came from France and so people are pouring in and there's **** everywhere and I'm just so **** tired and it's raining outside and again I was just like I got I'm supposed to be off and my manager like you got to stay a couple more hours you punch this french guy and I just looked in I was like you got to just I can't man you got to like we're supposed to like cuz at this restaurant we were supposed to close and then you'd like reopen at a certain point I was like you got to close the door she like I can't we're making money and Yad Yad Y and I was like well if you'd stop being a little **** **** you could get out there and like close the **** doors and leave like I was I was like basically like telling him like you got to be a **** manager here you can't work your crew to death and he was like what did you just call me I was like I called you a little **** **** and I just got fired didn't I was like yeah you're super fire I",
            "start": 1549.28
        },
        {
            "text": "manager here you can't work your crew to death and he was like what did you just call me I was like I called you a little **** **** and I just got fired didn't I was like yeah you're super fire I was like **** and it was it was actually it was the best just the wor weekend of my life but the best week of my life because I literally was like oh **** what do I do and that is the best place for you to be especially when you're a young creative because you're like I'm I have I'm forced to get out of my box like this little box I was living in is not working and I just tore out of it whether I like it or not so I have to do something and that was when I was like I got a brainstorm and I called my friend who was working at this other place and I was like can you get me more gigs here and I called people and I was like what can we do y y and and sure as **** I was able in the span of a month to start putting together that month with just video work and I'm like oh wow I've entered",
            "start": 1579.84
        },
        {
            "text": "I called people and I was like what can we do y y and and sure as **** I was able in the span of a month to start putting together that month with just video work and I'm like oh wow I've entered this new section of my life anybody that I know that has ever succeeded in the Arts have quit and focused on it 100% cu no net is the only way you'll make it happen 100% you know",
            "start": 1620.0
        }
    ]
}