{
    "id": 2307,
    "video_id": "6Nv2qWxDCqs",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What Games Have We Been Playing? - Kinda Funny Gamescast Ep. 103 (Pt. 1)",
    "description": "What games have we been playing lately?\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484571600,
    "duration": 1915,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by Movement Watches. Movement Watches was founded on the belief that Styles shouldn't break the bank. The watchmakers goal is to change the way consumers think about fashion by offering high quality minimalist products at revolutionary prices. With over 500,000 watches sold to customers in 160 plus countries around the world, Movement Watches has solidified itself as the world's fastest growing watch company. Greg Miller has his sexy one with the red hands, the black face. Oh baby, it looks nice. Mov watches started just $95. At an department store you're looking at 400 to 500 bucks. Movement figured out that by selling online they're able to cut out the middleman and Retail markup providing the best possible price. We're talking about classic design, quality construction and styled minimalism. You know I'm a fan of that. You can get 15% off today with free shipping free returns, but go to movement watches.com kinda. That's mvmtwatches.com kinda.",
            "start": 0.16
        },
        {
            "text": "Quality construction and styled minimalism. You know I'm a fan of that. You can get 15% off today with free shipping free returns, but go to movement watches.com kinda. That's mvmtwatches.com kinda. Okay, join the movement. What's up guys, welcome to the first ever episode 103 of the Kinda Funny Games Cast. As always, I'm Tim Gettys joined by the coolest dudes in video games, Colin Morard and Greg Miller. Flag on the play. Wow, it's for you. It's blue. It's like it he didn't like it all. If he threw that at Boise State you wouldn't even be able to see it on the field. A little football joke. The refs are all down doing this Pawn at the field is blue. Yeah, you'd love Boise States field really. Yeah, Blue Grass. Yeah, you make Blue Grass just Turf surf and turf surf what? Yeah, no, it's just Turf. It's blue Turf. It's just blue Turf. It's very eye-catching. It's ridiculous say eye burning, but I like it. I like it a lot as well. Big fan. Kevin, can you pull up a picture of this is it St Boise State jersey State's not a",
            "start": 37.52
        },
        {
            "text": "Just blue Turf. It's very eye-catching. It's ridiculous say eye burning, but I like it. I like it a lot as well. Big fan. Kevin, can you pull up a picture of this is it St Boise State jersey State's not a thing. Jesus Christ, Boise State football field. That's all you got to put in there. You'll find it. You find it right away. I'm excited about this. When are they bringing back NCAA football? I feel like the NCA has gotten better about this player profile. We miss it. We all miss it. After the after in a few years when the athletes are getting paid I think and they own their likenesses and stuff I think that EA will get back into the game. Think I really hope they do an inevitable inevitable future. There it is. Oh, I like I don't like blue and orange though. That combo has never been nice. Can you just take I mean they gave you something isn't that better than nothing? Aren't you sick of seeing Green Fields everywhere? Yeah, I mean I I really do appreciate the blue and then when they when they put on their",
            "start": 99.04
        },
        {
            "text": "I mean they gave you something isn't that better than nothing? Aren't you sick of seeing Green Fields everywhere? Yeah, I mean I I really do appreciate the blue and then when they when they put on their blue jerseys and play on it there in camouflage. Oh my God announcers is like we don't even this this other way team the ball was moving down there's a person the person has the ball sorry I thought a ball was feeling going on its own ladies and gentlemen this is the Kinda Funny Games Cast each and every week we get together to talk about video games and all things that we love about them you can get the show early over on patreon.com kindof funny games and this month only you can also get Kinda Funny Live Too the full video if you don't want to you know help us out give a dollar cuz it's only a dollar to get Kinda Fun Life too I think it's worth it do you think it's worth it's worth the dollars three hours of entertainment Cisco the dragon Kevin get engaged Gia is in a Pokemon",
            "start": 137.96
        },
        {
            "text": "It's only a dollar to get Kinda Fun Life too I think it's worth it do you think it's worth it's worth the dollars three hours of entertainment Cisco the dragon Kevin get engaged Gia is in a Pokemon costume she is she is anyways if you don't want you can wait Kinda Funny Live will come out on February 6th for everybody for free on youtube.com/ kindof funny and this show will be released for free for everybody on youtube.com/ ofy games next week podcast Services all that stuff um also another change we made recently Kinda Funny Morning Show you can catch that on youtube.com/ kindof funny we talk about some video game stuff it's a weird crossover we're in a point where it's just like I don't know where the **** do we put things there's no Rhyme or Reason yeah that's just Insanity the show Symph The Night One new mhm no it's not new I haven't updated it yet I'm planning a big 2017 up I remember he's been releasing some hotness yeah Oro orioto you should go check him out on",
            "start": 175.32
        },
        {
            "text": "The show Symph The Night One new mhm no it's not new I haven't updated it yet I'm planning a big 2017 up I remember he's been releasing some hotness yeah Oro orioto you should go check him out on Devian Art and all of his uh his Facebook page and all that stuff o r i it's in O it's in the description yeah it's in the description always there's a lower third now if he's over at DV in art how many times has he drawn Sonic the Hedgehog and Tails making out um as you've seen in this art there's a lot of Sonic and and Tails but I don't know there's no making out that I've seen onic inails and corn huling that's what they should make corn huling yeah that sounds nasty what you been playing Greg a lot of stuff uh well it's funny I in the past week I've played a lot of stuff and then started playing an old game and focusing on that uh gave a brief rundown on PS I love you or whatever I the Yakuza preview Has Lifted so I'll start there and give you new I played yakuzi zero the first night I",
            "start": 217.04
        },
        {
            "text": "An old game and focusing on that uh gave a brief rundown on PS I love you or whatever I the Yakuza preview Has Lifted so I'll start there and give you new I played yakuzi zero the first night I got it what happened is got Gravity Rush 2 played that for a night the next day yakuzi Zero came in played that for the night the next day I got distracted by something else and then the weekend came and blah we'll get to that in a second though Yakuza zero though more Yakuza the prequel to the Yakuza story we know and stuff uh this is something I mentioned last week when we're talking about open world fatigue and the fact that some open worlds we talk about like why is it even why is it even like this what is it really drawing that's always been my thing with yuzzi games again I review reviewed them all the time for I enjoy a good yakuzi game of course you know are you familiar with this series all right cool so it's like the very Loosely the Japanese GTA not nearly that big of an open world",
            "start": 261.16
        },
        {
            "text": "All the time for I enjoy a good yakuzi game of course you know are you familiar with this series all right cool so it's like the very Loosely the Japanese GTA not nearly that big of an open world but that's the idea of let's play through this gangster Yakuza Mafia story or whatever uh run around uh their red light district this one s in 1989 so it's a bit of a callback there's different things going on in there but it is the same idea of cool I can go into this shop and buy this you know soup or whatever to keep on me to use as a healing item but I can also just go into the arcades and play games I can go in and play the you know the UFO catcher game uh you love that game I do love the UFO you know and that's the thing I'm continuing to play it in Yakuza cuz I'm like I should have gotten that item I'm I don't like how this is and then you tip it over it's just like real just like a real UFO catcher game you tip something over you're playing it to get it into the right spot and then",
            "start": 298.16
        },
        {
            "text": "That item I'm I don't like how this is and then you tip it over it's just like real just like a real UFO catcher game you tip something over you're playing it to get it into the right spot and then any time when you've collected all the prizes you can go over and tell the people it's time to change out the prizes and they change out the prizes you go back and play some more that sounds very detailed yeah yeah and they got a couple classic Sega stuff arcade games in there to play and stuff uh but it's the same thing of just like like if you want to play a yakuzi game and just Mainline that story you can and go through it and what again what I think usually yakuzi games Excel is that it's still an interesting story it is this you know we're playing there as Kazuma again you know this time before he actually goes anywhere in this whole family that he's in and with his clan and how he's going to move up to eventually become a big deal and then go off to an orphanage spoiler alert for what",
            "start": 338.28
        },
        {
            "text": "He actually goes anywhere in this whole family that he's in and with his clan and how he's going to move up to eventually become a big deal and then go off to an orphanage spoiler alert for what happens in the rest of yuzzi games but uh interesting I like the characters I like where it's going there's this air of mystery it's like you know why what's happening the story is happen happening to him and what's going on and you know I beat up a guy and he cut off his own finger and a sense of honor I'm like yeah that's **** cool that's what yuz is great at right cuz yuz is usually this and it always is I guess an interesting story that feels not grounded obviously but all the cut scenes of you interacting with the other you know Yakuza bosses and the family members and explaining all the intricacies of how it all ties together that always seems grounded in the way you talk and then you just walk through streets and beat the **** out of everyone and you like that's the whole thing of",
            "start": 372.48
        },
        {
            "text": "Of how it all ties together that always seems grounded in the way you talk and then you just walk through streets and beat the **** out of everyone and you like that's the whole thing of just like yeah it's got a really in in-depth uh skill tree and unlockable system you're going through to get new moves if you want or more health or more power this way to you know warm up your heat gauge faster which allows you to do special moves and things but they also have you know the the last yakuzi game I remember playing was the uh zombie one I always talk about and before that there was the other one which must have been what the six is the next one that's coming out here so it would have been five I'm Rusty on all my numbers but it's the one where we jumped around the different characters there was of course like the lone shark with the secretary that he hated and then she got hot and he liked her a lot and I was like woof that's not AES that's not a storyline you're allowed to do but you",
            "start": 409.84
        },
        {
            "text": "Was of course like the lone shark with the secretary that he hated and then she got hot and he liked her a lot and I was like woof that's not AES that's not a storyline you're allowed to do but you jumped around between characters this one set from caz's perspective who I knew from my earlier yuzi gameplay experiences and rather than you know just spice it up it seems you can switch your fighting stance from brawler which is you know very anchored and you're giving out heavy slow blows to you learn a new stance you're able to jum around be super fast and Dodge around and kick the **** out of everybody and use them differently to fight different bosses and do different things like that and that's where Yakuza always very interesting is that it is uh it's it's like a Dynasty Warriors in a lot of ways mixed in with is then really good story of the fact that it is like okay cool like you need to get from this one side of the red light district to this other side to catch a cab to",
            "start": 445.88
        },
        {
            "text": "In a lot of ways mixed in with is then really good story of the fact that it is like okay cool like you need to get from this one side of the red light district to this other side to catch a cab to continue the story but on the way if you just want to keep going down different Alleyways you're going to continue to find people like Street punks or dudes dressed in black who just want to beat the **** out of you and you do that and you earn money and you earn you know your XP that you can then go and spend stuff it's a fun game it is the same thing I've talked about a lot in the past with Yakuza though where I like Yakuza I enjoy a good yakuzi game and this is where I think it's similar to a Dynasty Warriors you know what you're getting like you're playing the I'm like oh cool the fighting styles are different I don't remember this from previous I'm pretty sure this is a new addition to this one it gets rusty though because again I've played so many of them so I mean not holding you",
            "start": 482.56
        },
        {
            "text": "Styles are different I don't remember this from previous I'm pretty sure this is a new addition to this one it gets rusty though because again I've played so many of them so I mean not holding you to this because I'm sure you might not know all the information but at PSX they last year they announced Yakuza zero and Yakuza 6 right is zero a new game or is this support of no Yak yakuzi zero to what I understand is a new game the the thing about it of course is that it's been out in Japan forever not forever but like a year year and a half or whatever exactly here it is in America and I'm pretty sure that's now what's happening with six as well where six is out in Japan because when I tweeted hey I got Yakuza zero I can't tell you about it but I'm excited to play it some kids like I already got Yakuza 6 because he got the imported version is playing that and so that's usually what happens here which makes it all the more cumbersome because I remember going to TGs and getting my photo",
            "start": 514.88
        },
        {
            "text": "Got Yakuza 6 because he got the imported version is playing that and so that's usually what happens here which makes it all the more cumbersome because I remember going to TGs and getting my photo taken on the Yakuza throne with like the U uh Hostess girls there and stuff but that was promoting the that was coming out there in a second which we were like one or two behind at the so it's all **** titly Winks on the floor but for me you know it's whatever uh but what I was driving at before it's more Yakuza I feel like they are doing this different thing where usually it's always cut scenes and you know telling you the story and you're going through it and okay cool they're doing this thing that's new to me I think it's new to the to this is must be the introduction to the series of putting faces on the screen or having like still things like people moving behind you or whatever but then just having text on the screen or what and it's like okay like I'm fine with that whereas I don't",
            "start": 553.32
        },
        {
            "text": "Faces on the screen or having like still things like people moving behind you or whatever but then just having text on the screen or what and it's like okay like I'm fine with that whereas I don't need an animated cut scene but it at first was a jarring thing to me and I don't know if it's just a call Fire Emblem style stuff I'm not just like an anime esque picture and then Tex similar to that it's almost like it's in engine persona persona does it too persona for sure not to that degree no no no no but like having uh you know from the game like him just standing there but his mouth not moving you're got it's fine it but it was when I when I jumped into it not knowing too much about yaku's year I know it's a prequel I know this I was like oh is this their version of not a budget yakuzi but like here's how we'll get it out faster to continue working on Yakuza 6 to make the real thing whatever all that said it's more Yakuza if you're in the mood for Yakuza you know what you're getting",
            "start": 592.08
        },
        {
            "text": "Like here's how we'll get it out faster to continue working on Yakuza 6 to make the real thing whatever all that said it's more Yakuza if you're in the mood for Yakuza you know what you're getting into it's just like every other Yakuza I feel like I enjoy it I I'm going to play it more but it's one of those I've done this weird thing this past week of games just jumping around where night before I started Gravity Rush 2 reviews are up now doing really well critically which is great for them for me with Gravity Rush 2 it was a very similar thing of jumped in started using the powers I was happy to be back with cat I was happy I forget her uh the reporter from the first game who now like her sidekick or whatever I was like oh that guy again oh yeah it was like fun to catch up with these characters that I hadn't thought much about since I played it and reviewed it on Vita jump back into that world I thought it was a clever thing of like I was like what are we doing why is this happening",
            "start": 628.36
        },
        {
            "text": "That I hadn't thought much about since I played it and reviewed it on Vita jump back into that world I thought it was a clever thing of like I was like what are we doing why is this happening they had a cool reveal in the beginning and then she doesn't have her powers and that's how we're going to get them back and da d da and going through that and playing that I'm like oh **** Gravity Rush this is fun I enjoy Gravity Rush but it is the same thing like turn your world upside down this is gravity ah more thing of this is Gravity Rush this is exactly what I expected as I was talking about on PS I love you XOXO haven't gotten to the new powers which make you lighter and make you heavier stuff like that had played that at PSX uh but in terms of the storyline I think I think I'm in Chapter 3 but I was running around doing a bunch of the side quests but it is the same thing I'm just like cool you're not I don't feel like this is a Quantum Leap and that on that level then it's not",
            "start": 668.12
        },
        {
            "text": "3 but I was running around doing a bunch of the side quests but it is the same thing I'm just like cool you're not I don't feel like this is a Quantum Leap and that on that level then it's not scratching me like pulling me back into it making me want to play it over and over again and so then got to the weekend uh and like like I said neither of those games were tugging me but I had 2064 readon memories on my xmb or whatever you want to call it now for place my live area for PS4 I was like oh **** right this game jumped into that and played that for all of Saturday halfway through the game it's uh six chapters I think I'm three chapters through a little bit more maybe and really dig it really really dig it um I was talking to Colin about it on PS I Love You of like is it a visual novel is it an adventure is it a point click adventure game something it's somewhere in between all of that you know what I mean but really interesting story so far I think it works really well for us",
            "start": 701.8
        },
        {
            "text": "Is it an adventure is it a point click adventure game something it's somewhere in between all of that you know what I mean but really interesting story so far I think it works really well for us cuz it's set in Neo San Francisco it's you know 2064 in San Francisco so it's I'm I'm a journalist in the Outer Outer Sunset and I go to the Richmond and do stuff yeah and there's news report because like gordos there no I haven't seen it yet it's not like free roam so it's not that the developer I believe is he's from or he lives in San Francisco now so I assume it's just like us where there'd be all these references but references to what the 49ers and their quest for 10 and like how they're you know playing against the Japanese guys and how it's expanded that way and it is this thing of what we always end up talking about you know the story at its core is uh you're in your apartment and then in the middle of the night this robot comes in this AI that was made by your friend that you've",
            "start": 741.92
        },
        {
            "text": "We always end up talking about you know the story at its core is uh you're in your apartment and then in the middle of the night this robot comes in this AI that was made by your friend that you've fallen out of contact with and someone just broke into his house and you the robot ran all these things and he's you like this robot is the first robot that is like self-aware and is learning on its own and this is you know we've hit that point it's you know it's called Turning like the Turning test or whatever and so it's like okay cool let's go out and figure it out what's wrong with your Creator and it becomes like this investigative game of going through and talking to different people and trying to figure out how to get into this area to do this thing to do that or whatever but what type of game is it like Adventure game or yeah see that we're back to that where like the best way I think to describe the gamep play is to describe what you're looking at the entire time and so when you're",
            "start": 780.44
        },
        {
            "text": "Game is it like Adventure game or yeah see that we're back to that where like the best way I think to describe the gamep play is to describe what you're looking at the entire time and so when you're the screen imagine it's a black screen and then like up in the the top half of the screen you have this little postage stamp that is like it's either the character that's talking to you like a closeup of them or it'll be like you know your items your menu whatever you want to click through and do this and then the other part is this long rectangle that takes up the rest of the screen on that top half of the screen and that's showing you the scene of where you're at so like when you're in your apartment it's h you don't ever see yourself you never see your character it's all from not even first person you're looking at your apartment your bed's there your doors there your computer's there blah blah the AI Bots there talking just there but then close up in the thing and then you have their",
            "start": 816.8
        },
        {
            "text": "Person you're looking at your apartment your bed's there your doors there your computer's there blah blah the AI Bots there talking just there but then close up in the thing and then you have their the dialogue of them pop up it's all voiced their dialogue so like Melissa Hutchinson is uh the CLM from Walking Dead she's the robot turning and like bunch of our other friends like Austin Creed's in there and stuff up up down down Co um their text pops up below that but you hear it and then when it's time you have your response to pick what you want to say so it is this visual novel Adventure game of whatever but it's not Adventure game like Walking Dead is where I feel like I'm making choices that are drastically influencing the game nor is it an adventure game where I feel like it's you know something Tim Schaefer would do of like how does this water bottle turn off the light like it's not that kind of thing I haven't there's no puzzle I've hit where it's like there's no Puzzles I don't",
            "start": 849.32
        },
        {
            "text": "Something Tim Schaefer would do of like how does this water bottle turn off the light like it's not that kind of thing I haven't there's no puzzle I've hit where it's like there's no Puzzles I don't think it's just an adventure that's unfolding with you in it and you're in the seat driving making walking simulator Adventure game sure but no walking involved simulator Adventure game whatever you want to call it the story is cool and intriguing this is definitely a game I'm going to get back to to beat and actually see all the way through but what happened is Sunday I woke up and I was under the weather and I was like I don't feel that great I just want to stay under the covers as much as I like read only memories it is a game that I feel like I'm all in it's an experience of like I want to just give do you know uh give this myen and not get distracted I needed something more throwaway more disposable and I was like oh you know what I want to do I want to play a Lego game and I thought",
            "start": 891.44
        },
        {
            "text": "Just give do you know uh give this myen and not get distracted I needed something more throwaway more disposable and I was like oh you know what I want to do I want to play a Lego game and I thought about Lego dimensions and I was like no I'd rather earn a platinum I'd rather get more trophies out of this and all the dimensions packs just have bronzes so it's like whatever um so what I remembered is that I never ever back when the PlayStation 4 came out I never Platinum Lego Marvel Superheroes the original now I you know Platinum Avengers I'm in Lego Marvel Avengers and so I went back grabbed that or downloaded it again jumped in and picked up my save and I just beat that and so last couple nights that's what I've been doing sitting there very very DC Universe Online very Skyrim where I'm just sitting there with podcasts on the iPad I listen to a whole bunch of always open last night from Barbara yeah yeah listen to always open and just going through and just **** picking up studs",
            "start": 924.44
        },
        {
            "text": "just sitting there with podcasts on the iPad. I listen to a whole bunch of Always Open last night from Barbara. Yeah, yeah, listen to Always Open and just going through and just **** picking up studs and unlocking characters and doing all that stuff and you live a thrilling life, Greg. I know, right? And that's the thing, right of just like I I was going back and forth of like, well, what do I want to do? And I'm like, Gravity Rush is fun. Yakuza is fun. I'm not I don't feel like that right now. The same thing with like Real Memers. I don't feel like that much of a commitment to it. I do feel like just **** being brain dead. We've had we put in all this work these last couple days as we always do and you work yourself to your bone, you get home and it's like I cook and then it's like, well, cool. I don't want to why I well real quick shout out if Colin would say Nashville this season holy **** are they killing it on CMT? I'll tell you what three episodes are out. I'm I'm through the first two the camera",
            "start": 964.44
        },
        {
            "text": "to why I well real quick shout out if Colin would say Nashville this season holy **** are they killing it on CMT? I'll tell you what three episodes are out. I'm I'm through the first two the camera moves. Yeah, you can tell they got new show runners in there. They're doing different things with the cameras, the story lines, the songs of course off the chart amazing but I watch that while I eat and then it's like oh I want to play something I want to do something and it's like all right fine I don't feel yeah I'll I'll get in there and I'll make some more progress on this Lego Dimension games chip away at that and then today of course they put up this video about DC Universe Online that they now are doing it for their sixth anniversary that you can jump in and similar to how Destiny and like would let you jump to whatever level or 5 whenever it was so you could play that content they're now doing a thing where you can get in there and get your combat rating immediately up to 100 and I have",
            "start": 998.68
        },
        {
            "text": "let you jump to whatever level or 5 whenever it was so you could play that content they're now doing a thing where you can get in there and get your combat rating immediately up to 100 and I have no idea what I left my combat rating at when I was playing as Taylor Swift but I don't think I was at 100 yet so I'm going to jump in there tonight and **** around with that okay what have you been playing call uh just more Tomb Raider I'm almost to the end I think the game won't end uh but I'm also playing it very meticulously but it just refuses to end uh Shantae uh Half Genie Hero I played extensively on Vita I'm almost done with it I actually had to uh so I played it uh you know it was Wild Card Weekend in the NFL last weekend so Vita is obviously a nice companion to that especially considering all four games were **** atrocious Final Fantasy 6 shout out in the background uh but to uh me this was the game I needed at the time and uh for people that don't know it's a Way Forward game",
            "start": 1036.12
        },
        {
            "text": "all four games were **** atrocious Final Fantasy 6 shout out in the background uh but to uh me this was the game I needed at the time and uh for people that don't know it's a Way Forward game Way Forward obviously very um established at this point old school uh um studio uh Yacht Club which did a trouble night spawn off from them you guys might know them but uh they've done a bunch of game a bunch of old school games and Shantae actually has pretty deep Heritage in Game Boy handhelds or Nintendo handhelds and uh so I played it's it's a it's kind of a pseudo Metroid Vania it's basically like um like what's a good example it's kind of like Mega Man X actually where you you go to uh a stage there's things you can't access in that stage yet you leave the stage you go to the next stage or do something else and you go back to the stage later and get it so it's not like an open world like a Symphony of the Night it's a scattered World um but really really good I said on PS I Love You and I must",
            "start": 1074.24
        },
        {
            "text": "else and you go back to the stage later and get it so it's not like an open world like a Symphony of the Night it's a scattered World um but really really good I said on PS I Love You and I must say again as a Mula that um I said it's a .5d uh game which aesthetically to me is not very pleasing usually um and in the very brief time I had played it before I had spoken about it a PS a couple episodes of PS I Love ago I said that you know I didn't really like it and I think I was in terms of its aesthetic and I was completely wrong about that especially with the the uh the characters like Shantae herself is an amazing character but um all the anay characters the beautiful animations in the game uh the gameplay is not very difficult it reminds me of Shovel Knight in that regard where my one complaint about Shovel Knight was that you know when Yacht Club put that game out was um just wasn't hard enough and uh I feel that way with Way Forward and Sh I think they could have made the game way harder",
            "start": 1118.08
        },
        {
            "text": "about Shovel Knight was that you know when Yacht Club put that game out was um just wasn't hard enough and uh I feel that way with Way Forward and Sh I think they could have made the game way harder is Shantae comparably hard to yeah I would say so in that like you almost never I mean at least I'm never you know I don't really die I think Shantae is easier than Shovel Net um so I wish I could used a little bit more of a challenge there are other modes that you be you get you unlock and I assume that that will uh be something that comes to fruition so I'm almost at the very end of the game and in fact I really wanted to jump into it on Monday um and uh you know at night I was there and I'm like I only have an hour or so of the game left and if if that I'm I'm collecting everything as well all the items so I'm almost I have I have like I don't know like 95% of the items and there's only one stage left and then I'm like you know what I'm going to save this uh for uh this week when I become one",
            "start": 1154.64
        },
        {
            "text": "items so I'm almost I have I have like I don't know like 95% of the items and there's only one stage left and then I'm like you know what I'm going to save this uh for uh this week when I become one with the living room and one with the couch uh for divisional playoff games uh in the NFL and having the VA as a companion will be very good and so I'm going to save it for that and then there's a a couple speedr running options that I I'd like to investigate in the game this weekend maybe uh one of them you have to beat the game in about four hours with everything and you have to beat the game in two hours with nothing um to get the last trophies and otherwise I think you know so it's a possible Platinum um but we'll see how that all works out and then uh I got Tales a oh what you going I want to real quick to just jump in to give a shout out to Read Only Memories Remote Play works really well with it since there's no it's not like there's no timing bar like a Walking Dead thing so that's",
            "start": 1189.28
        },
        {
            "text": "to real quick to just jump in to give a shout out to Read Only Memories Remote Play works really well with it since there's no it's not like there's no timing bar like a Walking Dead thing so that's what I was doing when I was watching football with you on Saturday Tales of Berseria I got uh it's the new Tales game obviously uh we get a Tales game every 1 to 18 months um in the United States and have for some time I'm a huge Tales fan for people that don't know and I was surprised when I I I tweeted out that I got it and I was excited people were like I'm surprised that you're a Tales fan I'm I've been a Tales fan for a very very long time very vocal Tails fan so I'm surprised some people don't know that you're a bro shooter fan there's usually not much you know I was thinking you know it was uh it was October 1998 when I got uh it was my 14th birthday when I got um Tales of Destiny for my birthday October 14th um uh 1998 and fell in love with the franchise and it's been almost 20",
            "start": 1222.24
        },
        {
            "text": "it was uh it was October 1998 when I got uh it was my 14th birthday when I got um Tales of Destiny for my birthday October 14th um uh 1998 and fell in love with the franchise and it's been almost 20 years I've been playing Tales games and I I I uh I'm surprised by that Destiny is still my favorite um I'm very partial to others like Legendia obviously everyone loves Symphonia I thought Exilia and Gilia 2 were excellent Zesteria which was the one that came out last was the one that really threw me and a lot of Tales fans off because it just didn't feel and it was one of the it was the only Tales game that I I played for a very brief time I was like this isn't right to me uh there's something off about it I played it for a few hours and I'm like I just there's there's this isn't this doesn't feel like a Tales game and that's strange because when I was in Japan playing it before it came out uh I was excited about it because I was like it's it's it's a more open it's but what we found with",
            "start": 1256.88
        },
        {
            "text": "feel like a Tales game and that's strange because when I was in Japan playing it before it came out uh I was excited about it because I was like it's it's it's a more open it's but what we found with this aerio was that it's just empty it's just they use the same design philosophy the same timeline in which to build one of these games they build these games very quickly and so it felt very empty and very heartless uh and very soulless I also thought the combat system was kind of bad so getting into Berseria was a little bit of a trepidacious kind of thing for me but I immediately after only playing the game for about 90 minutes or so this week uh because I was been editing Colin was right um at night that uh it feels like better it it looks like a Tales game the the um the story is obviously very quirky and strange in Japanese but but interesting and it's like comfort food for me um I really do feel like Tales and Dragon Quest are the only true AAA or a role playing series that",
            "start": 1297.2
        },
        {
            "text": "obviously very quirky and strange in Japanese but but interesting and it's like comfort food for me um I really do feel like Tales and Dragon Quest are the only true AAA or a role playing series that really stay true to themselves pretty consistently and so I want to support that as well and I'll be able to talk about more of that on PSI Love You on Gamescast next week when I have a little bit more experience in it that game comes out I think late January for everyone else so those are the three games I'm playing and tonight I'm really looking forward to uh stay up till 5:00 a.m. last night uh editing colum was right uh and I'm excited to have tonight uh open to be able to jump back into Berseria because I really feel like you know Final Fantasy 15 didn't really speak to me at all but it gave me this hankering similar to I am Setsuna where I'm like I want to play a big role playing game and spend 40 or 50 hours with it because it just feels like the thing I want to do and I'd also like",
            "start": 1332.24
        },
        {
            "text": "me this hankering similar to I am Setsuna where I'm like I want to play a big role playing game and spend 40 or 50 hours with it because it just feels like the thing I want to do and I'd also like to get it out of the way because we're going to get Resident Evil 7 soon Resident Evil so that's what I've been playing and uh you know so uh shout out to Tomb Raider still great game Rise of the Tomb Raider really really fantastic shout out to Shantae Half Genie Hero which is available on a bunch of platforms I'm playing on VD you guys should check that out and support Way Forward and then a preliminary shout out uh to to the Tales team and to Namco Bandai for uh for Tales orber area Tim speaking of Resident Evil for the first time since E3 I got to do the I played the new Res 7 demo oh and uh cuz I'm not W3 well so yeah at E3 they announced it and then I played it there with VR or whatever and then since then I I'm a little confused at how they released the demos CU it sounds like it's the",
            "start": 1370.48
        },
        {
            "text": "I'm not W3 well so yeah at E3 they announced it and then I played it there with VR or whatever and then since then I I'm a little confused at how they released the demos CU it sounds like it's the same demo they just keep updating it yeah um so I'm not I think when they updated though they unlock New Paths or endings or whatever I played I only played it at PSX and I remember them being like well you can go home and play it and there's different ways and different things yeah eventually so beginning hour is the one I played uh now and originally back in the day we played the kitchen demo the kitchen uh there's like it's a cut scene now in beginning hour in the demo anyway this it's old news but I played through this uh for the first time at home not PlayStation VR just using the PS4 and God damn that game is so scary I was playing it before Gia got home so it was just me alone I'm like why am I doing this and I turned the lights off I was like I'm going to do this right oh yeah and it",
            "start": 1409.64
        },
        {
            "text": "damn that game is so scary I was playing it before Gia got home so it was just me alone I'm like why am I doing this and I turned the lights off I was like I'm going to do this right oh yeah and it was it was horrifying but like I cannot wait for this game to to get here for us because it it seems like the type of of game that I want Resident Evil to be I know a lot of people are upset that this doesn't seem like the pure experience that that they expect and I know a lot of other people are burned about it being too action-y uh but I think that like there there is a middle ground of what the the OG Resident Evil fans want but for me I don't I don't even think that we need more of that especially getting the Remake constantly re you know up remastered re-up graded whatever re everything uh I think that we we will always have those games so I like that this is trying something different and especially now that PT is no longer a thing I thought PT was very special and already playing",
            "start": 1450.08
        },
        {
            "text": "uh I think that we we will always have those games so I like that this is trying something different and especially now that PT is no longer a thing I thought PT was very special and already playing this demo it lacked uh I think some of the Polish that PT had but I think it makes up for it in there's more game there sure and uh cuz especi and there's also more um just variety of environment because in PT you're literally just going around the hallway over and over and over with this just even having stairs and like having that like going up and down the stairs is like super um liberating and it allows for a lot of fear because it's always going into the doorway and like seeing what's on your left or right that's the scariest part but being upstairs and looking down seeing a stairwell and knowing that there's could be something from that door that door or from just down the hall it's like a whole other level to it that I'm like man this is super scary can't wait to keep playing it um",
            "start": 1489.56
        },
        {
            "text": "knowing that there's could be something from that door that door or from just down the hall it's like a whole other level to it that I'm like man this is super scary can't wait to keep playing it um I'm going to force you to sit next to me as I play because I'm a baby and I cannot play that game fully uh but I do enjoy the the games use of the first person perspective to kind of create the scare moments because they know what you're looking at at all times so when you're going down a ladder they know that if they put something behind you it's going to be scary you know sure but they also like a horror movie like any good horror movie would they play with those expectations so it's not always something there and it's it's I thought at least in the demo it did a really good job of having me not know when the scares were going to be there and when they were it was really damn scary uh I don't really like the PTs you have to do all this really weird obscure **** to get the good ending",
            "start": 1537.76
        },
        {
            "text": "not know when the scares were going to be there and when they were it was really damn scary uh I don't really like the PTs you have to do all this really weird obscure **** to get the good ending and progress the right way I got the bad ending and then went on YouTube to the rest of the endings and I'm like man you had to do a lot of complicated **** to get this done it's kind of Adventure Time water bottle and the light and that's the thing is like when I I got the bad ending of my initial playthrough but when I finished up the you know PR represent was talking to me I was like well you know when you replay it you I forget I it's I'm Rusty now but it's what you don't need to watch the tape to do that you just know to go to that area and open that door then and so like if you do that you're cutting it out which then tells the game that you've played it before which does this and yeah and I'm interested to see how the game differs from the demo I know a lot of press got to do the",
            "start": 1584.16
        },
        {
            "text": "you're cutting it out which then tells the game that you've played it before which does this and yeah and I'm interested to see how the game differs from the demo I know a lot of press got to do the first four to five hours of it a couple weeks ago and invited invited and we ended up not wanting to go because I want to just experience the game I'm interested CU Capcom's saying that this game is going to be a 14 to 16 hour experience I'm like I don't know that I need that much of that um so I'm interested because I I can't imagine them doing that with this game being that for that long I imagine it being a bit more linear over that time which I'm actually okay with I just don't think that I need all this super obscure **** for 16 hours sure sure um but very excited for it the demo was super scary and it's it's a beautiful game minus the um characters like oh yeah yeah in the demo you see very few people but like man they they're ugly as hell it totally doesn't fit in it takes you out",
            "start": 1622.84
        },
        {
            "text": "scary and it's it's a beautiful game minus the um characters like oh yeah yeah in the demo you see very few people but like man they they're ugly as hell it totally doesn't fit in it takes you out of it um maybe those people are ugly in that Universe no but like they're real they're real ugly and shiny and like I I don't think they look no no it's all bad um but the most important game I played was the Near Automata demo that's available now on PlayStation 4 if you haven't played it get that **** right now it's only 30 minutes maybe an hour I lost track of time I don't know but it wasn't too long um but I've been very really excited about the game for a long time a lot of people have been asking if I played the old ones absolutely not uh they didn't look into interesting to me they always confuse me I remember reading about them and it's like correct me if I'm wrong if you know anything but Near was two different games on Xbox 360 and PS3 like same name totally different games totally",
            "start": 1665.12
        },
        {
            "text": "confuse me I remember reading about them and it's like correct me if I'm wrong if you know anything but Near was two different games on Xbox 360 and PS3 like same name totally different games totally different characters something like that that doesn't sound there's some weird there's some weird **** that I remember like what the **** and it also just didn't sound interesting to me this sounds a lot more easy to wrap my head around Platinum it sounds like the good Platinum is is working on it and um I like the character designs it reminds me a lot of PS2 era Ani Musha Devil May Cry uh type games and it it's it has the fluidity of a Bayonetta but without the at least for me the added complexities and stuff or at least you don't need to go that deep with it um so I'm super enjoying it the super over the-top boss fights like God of Wars but just with a different aesthetic um so I'm super into that I love the the mobility of the game uh and the fact that every like five minutes the",
            "start": 1707.44
        },
        {
            "text": "the super over the-top boss fights like God of Wars but just with a different aesthetic um so I'm super into that I love the the mobility of the game uh and the fact that every like five minutes the perspective shifts and they spent a lot of time with the camera to make sure that you were playing the game and guided in a way that is the most fun at any given moment so the character Tob has uh a bunch of swords and it's kind of like Final Fantasy 15 where the swords are like flying around her and she doesn't need to actually hold them um and then there's this like little Sentry robot thing that flies around her and shoots so it's kind of like Devil May Cry in the sense that at any point you can slice with your sword or shoot with the guns uh and if you hold the R1 it's just shooting it kind of becomes a dual stick shooter so you can contr where the the guns are shooting while slicing people up so one second it feels like Devil May Cry one minute feels like uh bullet bullet hell uh top",
            "start": 1751.0
        },
        {
            "text": "of becomes a dual stick shooter so you can contr where the the guns are shooting while slicing people up so one second it feels like Devil May Cry one minute feels like uh bullet bullet hell uh top down shooter and the camera adjusts accordingly so they'll be enemies all around and they're all robots so they just like keep responding like contextually makes sense uh and they'll St they shoot you with all these like orbs and stuff and it really becomes a it it feels like um Resogun in that type of game where it's like this is **** awesome and then there's the the added layer of but it's an action game and you're running around and doing stuff because the mobility feels so good and the controls feel so tight it it's really satisfying to play through and as you're going through then the the camera will shift from the top down view over and all of a sudden becomes like a side scrolling platformer and it never feels wrong like the controls keep feeling like they're cuz the controls are",
            "start": 1795.32
        },
        {
            "text": "camera will shift from the top down view over and all of a sudden becomes like a side scrolling platformer and it never feels wrong like the controls keep feeling like they're cuz the controls are the same it's just the camera but the camera never gets in the way and it it kind of reminds me of um Super Mario Galaxy 2 the levels where they were the 2D versions of it you know um you're going left to right and there was a little bit of the the verticality or the um the depth to it but at the end of the day you're just going up and down or whatever and then the demo ends with this boss fight that is one of the most fun boss fights I've played in years and it reminds me of the old school PS2 era titles I'm saying I'm comparing it to a lot of games but everything I'm mentioning is awesome things so I think that this really is a a a little bit of this little that type of game but all those things are why I like playing video games super stoked about it it comes out on March March 7th so",
            "start": 1840.96
        },
        {
            "text": "so I think that this really is a a a little bit of this little that type of game but all those things are why I like playing video games super stoked about it it comes out on March March 7th so hopefully Resident Evil Horizon and then that are going to be my trajectory for games to lead you into the switch yeah oh yeah are you going to touch a Mass Effect or no no no no I I don't really care about Mass Effect never have will yeah what that Mar 1st yeah yeah okay that's the thing",
            "start": 1882.2
        }
    ]
}