{
    "id": 2295,
    "video_id": "81Fhf3d5G8I",
    "show_name": "Colin Was Right",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "There Are Too Many Games - Colin Was Right",
    "description": "On this week's Colin Was Right, Colin makes the argument for significantly reducing the number of releases on PlayStation 4 and Xbox One in order to avoid Sony's and Microsoft's marketplaces suffering the same fate as iOS, Android, and -- to a lesser, yet growing degree -- Steam.",
    "published_at": 1484240401,
    "duration": 613,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations and welcome to Colin Was Right! As we roll into this here second episode let me first thank you for the amazingly positive and kind response to the first publicly available episode. I'm listening to your feedback both positive and negative so keep it coming. This week, I want to discuss an issue that's near and dear to my heart. Something I have discussed in scattered ways over my years in the gaming industry. Put simply and succinctly, I think that there are far too many games flooding virtually every gaming platform imaginable, except maybe the dedicated handhelds, and I think it's up to the platform holders to do something about it. I think the current situation is untenable, and that the further we go down this rabbit hole, the more developers and publishers alike will begin to suffer. If devs and pubs suffer, you guessed it, so do we as gamers. Colin: If we rewind time 34 years into the past, we can catch a glimpse into a possible, admittedly",
            "start": 3.98
        },
        {
            "text": "publishers alike will begin to suffer. If devs and pubs suffer, you guessed it, so do we as gamers. Colin: If we rewind time 34 years into the past, we can catch a glimpse into a possible, admittedly apocalyptic outcome of the situation should things remained unchanged. The oft-discussed video game crash of 1983 is far more complicated than most people give it credit for, with more reasons for the demise of the console market than we can discuss here. But obviously, the major driver of the evaporation of home gaming in the early '80s was that there were simply too many games. And not only too many games, too many shitty games! Games not worth a single penny nonetheless bore a significant asking price of 30 to 40 dollars, which in today's inflation adjusted money is more like 70 or 100 dollars. The outcome of the crash was at first negative, but then strikingly positive. Many gaming companies, most notably Atari, lost their shirts. The media decried the end of a fad. Casual gamers",
            "start": 39.8
        },
        {
            "text": "dollars. The outcome of the crash was at first negative, but then strikingly positive. Many gaming companies, most notably Atari, lost their shirts. The media decried the end of a fad. Casual gamers receded into the background, and the hardcore were left in the cold. Then Nintendo came around, and not only promised change, but delivered it against all odds. You have to remember that when the NES launched in American test markets in 1985, there were few people who thought it had even the remotest prayer of succeeding. But Nintendo managed to accomplish the seemingly impossible, not only because it had great games, but because it ultimately became obsessed with managing its first and third party portfolio. That, as it turned out, was key. Without getting too into the weeds with Famicom and games that never crossed the ocean, and for the simple sake of argument, let's focus on the NES as released in the US and Europe. From 1985 to 1994 (so nearly a decade), just north of seven hundred",
            "start": 77.14
        },
        {
            "text": "games that never crossed the ocean, and for the simple sake of argument, let's focus on the NES as released in the US and Europe. From 1985 to 1994 (so nearly a decade), just north of seven hundred games were released on the Nintendo Entertainment System at a clip of just over one a week on average. Colin: Whether or not what Nintendo did was the right thing or not from a free market perspective is one thing. But by constraining its partner's ability to publish anything they wanted, and by forcing them to carefully consider their own releases effect on the overall NES portfolio, the NES came to stand for quality. That's not to say that there aren't abjectly terrible games on the NES, because there certainly are, but when you consider how many good, great, amazing, and classic games were on the NES, and when you consider that there were only 700 or so to choose from in total, you realize that Nintendo was onto something. I'd argue that there isn't a console in existence, before or",
            "start": 117.84
        },
        {
            "text": "on the NES, and when you consider that there were only 700 or so to choose from in total, you realize that Nintendo was onto something. I'd argue that there isn't a console in existence, before or after that sustained the quality level the NES did when compared to just how few games launched. Let's contrast the NES experience to today, and how the loosening of constraints has led to an absolute glut of garbage, where the bad and mediocre and average far outweigh the good and the great and the excellent. There are more than a thousand games currently available and announced for Playstation 4 after only three years or so on the market.",
            "start": 154.72
        },
        {
            "text": "More than a thousand! Xbox One is in the same league, if you're curious. It took NES a decade to reach 70% of that number. Oh, and you wanna really dig into the garbage pit? As has been famously circulated in recent weeks, Steam's library has swelled in size, growing by considerable leaps and bounds in 2016. On iOS, an embarrassing, catastrophic, fucking absurd 758,000 games! That's right, seven hundred and fifty eight thousand! Or about a thousand games for every one game on NES! And don't even get me started on Android. You'd have to wade through all of the emulators before you could figure it all out, but if you're curious, there are roughly three and a half million apps available on the Google Play Store right now, which is more than a million apps above even iOS. So I think you can do the math.",
            "start": 185.54
        },
        {
            "text": "And I think you get the picture. For the platforms console gamers in particular will really care about right now, Playstation 4 and Xbox One, a dire future can be seen not in the comical, inflated, who the fuck knows wild west Apple & Google have cultivated, but in Steam, the incredibly popular, incredibly influential, incredibly useful PC game marketplace. Just watch one of the many videos my friend Jim Sterling puts up to see just to see just how bad much of the garbage on Steam has become. It's laughable. But it's also scary. It's a glimpse into the future of Playstation Network and Xbox Live if Sony and Microsoft don't get a grip, and quick. See, judging a video game's merits is largely subjective. As gamers, we all know and understand that. Colin: There are games that speak to me that other people couldn't care about. There are franchises like Assassin's Creed that I profoundly dislike, but that other people absolutely adore. That's all well and good. The constant circulation of",
            "start": 230.34
        },
        {
            "text": "other people couldn't care about. There are franchises like Assassin's Creed that I profoundly dislike, but that other people absolutely adore. That's all well and good. The constant circulation of conflicting opinions keeps us all on our toes, and reminds us that what's good and great for one of us isn't worth anything to others. Here, on a level playing field, no one is right or wrong. I'd never deny that many of the games that I dislike for any number of reasons are nonetheless playable and should be available for purchase for others with differing opinions. But the hard truth is that, nestled down underneath the subjectivity, is a small slight glimmer of objectivity. Seasoned gamers should be able to look at certain products and understand that they're probably not for anyone. The game that comes to mind for me from several years back was the horror game Amy. Colin: Amy is fucking atrocious! Amy is one of those games that I can't imagine anyone likes. It's unplayable! It's an",
            "start": 268.7
        },
        {
            "text": "game that comes to mind for me from several years back was the horror game Amy. Colin: Amy is fucking atrocious! Amy is one of those games that I can't imagine anyone likes. It's unplayable! It's an abomination! It, simply put, should have never ever been put on a platform for anyone to buy! And that isn't the fault of the developer. They made the garbage, sure, but Sony and Microsoft decided to propagate it, and this is where we encounter a problem. When I see some of the videos of games being uploaded to Steam, I scratch my head and and wonder, \"Who the hell would play any of this shit?\" It crosses the precious subjectivity line and becomes an objective truth. This game is broken. This game is unplayable.",
            "start": 305.68
        },
        {
            "text": "This game is trash. Kudos to whoever developed the garbage pile in question. They're trying to make a buck, and maybe their asset flips and dead game design are intentional. But shame on Valve for ever letting it see the light of day, for letting their precious consumers be subjected to it, even coming up when searching for something else. Steam's generous return policy, a more recent development is, I think, accepting this model. But someone needs to step up and do something! There needs to be an accounting for quality! Shit will always slip through, and one man's shit is often times another man's game of the year. But I think you'll agree that the flood can be stymied significantly, and that the only people who won't benefit are the developers making these half-assed messes. So when I go on the Playstation Blog, and I see ten games in that week's drop posting, six of which no one has ever heard of, seven of which never even received a Playstation Blog post, and perhaps eight of",
            "start": 336.68
        },
        {
            "text": "I go on the Playstation Blog, and I see ten games in that week's drop posting, six of which no one has ever heard of, seven of which never even received a Playstation Blog post, and perhaps eight of which are destined to sell almost nothing, I can't help but wonder what the stake holders are doing, what they're thinking. And then I boot up some of these games and I recoil in horror because I realize the subtle but important truth. Some of this trash sits alongside good and great games that are likewise buried because Sony, in this instance, doesn't believe in meritocracy, but in the same trite philosophy that made iOS the laughing stock it is, and is helping destroy Steam's sterling reputation. The fact is not every game deserves to see the light of day. Not every game should be sold on storefronts just because it exists. Not every game is created equal, even accounting for tastes and opinions. The people who should be angriest about this are developers, especially the independent",
            "start": 374.96
        },
        {
            "text": "storefronts just because it exists. Not every game is created equal, even accounting for tastes and opinions. The people who should be angriest about this are developers, especially the independent developers that release quality games that have to stand on storefronts alongside the Amys of the world. The likes of Metacritic and baked-in user ratings simply aren't enough in my mind, because, in reality, Sony and Microsoft shouldn't be interested in putting up trash at all. I know for a fact that some of these lesser known, low quality titles sell virtually nothing when compared to how many platforms are in the wild. How do Sony and Microsoft even justify putting these games through certification and posting them to their to their respective stores when there is almost no money being made on them to begin with? Colin: I'm of the mind that, with how many people are playing games today, that no good game goes unnoticed or unplayed for long. So what does that say about the hundreds of",
            "start": 409.34
        },
        {
            "text": "on them to begin with? Colin: I'm of the mind that, with how many people are playing games today, that no good game goes unnoticed or unplayed for long. So what does that say about the hundreds of games on these digital download services that no outside of the development team has ever heard of? And how can the destruction of discovering the good and great games out there be justified as a result? The more products on the shelf, the less likely you are to see individual gems, and this is especially true for the more casual, looser, fringe gamer who isn't connected to games on a daily basis. I feel like the solution to this is problem is way easier than some folks think. Here's my modest proposal. Sony, for instance, should invest a couple million dollars a year into a team of a dozen or so dedicated employees, and a framework that investigates each game that comes through its doors. Games, when submitted for certification, shouldn't only be judged on if there is a trademark symbol",
            "start": 442.58
        },
        {
            "text": "so dedicated employees, and a framework that investigates each game that comes through its doors. Games, when submitted for certification, shouldn't only be judged on if there is a trademark symbol after the Playstation logo, and if the developer properly swapped the Xbox One's \"A\" button for the Playstation 4's \"X\". These people, who should be hired based on gaming knowledge and pedigree, with an emphasis on genre and platform diversity, should also sit, play each game for a brief period of time, mull things over, and talk to each other. If eight of them think the game is up to snuff for someone out there to enjoy, the game should be published. If they don't reach the eight vote threshold, the game is tossed away, and the consumer is hopefully saved a few bucks. Colin: A guy on this team who doesn't like JRPGs shouldn't judge the game negatively because it is a JRPG, he should judge it based on the merits to JRPG fans. Just like I can tell when an adventure game is worthwhile, even",
            "start": 476.34
        },
        {
            "text": "who doesn't like JRPGs shouldn't judge the game negatively because it is a JRPG, he should judge it based on the merits to JRPG fans. Just like I can tell when an adventure game is worthwhile, even though I dislike the genre. This truly shouldn't be that hard to accomplish. Imagine how many games would be purged if this were to happen, and how the games that remain would be easier to find. Who loses here? Is Sony really going to lose a ton of money because shitty game X, which sold five thousand copies at ten dollars a piece isn't contributing fifteen thousand dollars to Sony's coffers? Is it a pie-in-the-sky idea? Perhaps. Is it doable? I truly think it is. Someone out there has to take a stand for basic levels of quality. Not every game has to be a ten or even a five, but nothing should be put up that's getting a .5 on Metacritic. Apple and Google clearly don't give a fuck.",
            "start": 514.52
        },
        {
            "text": "Valve doesn't seem to care too much, either. This leaves Nintendo, Microsoft, and Sony to fight the good fight. And I'm seeing at least the latter two in particular trending in the exact wrong direction. It really does seem that games are submitted to Sony, and they just say \"Okay\" and move on with their lives. No one wins in that situation. With better curation and an eye toward objective levels of quality, however we decide to measure those levels, the good and great developers will thrive even more. Games will be propagated that share an overall higher level of quality, and perhaps, most importantly, decaying trusts will begin to be restored in these services that are, frankly, beginning to fail the consumer in fundamental ways. Regardless of the outcome and the solution, it's important we continue to have these conversations, and to tackle this problem. A problem that can have far reaching consequences as we saw in its own way back in 1983. As always, you should let me know what",
            "start": 554.02
        },
        {
            "text": "we continue to have these conversations, and to tackle this problem. A problem that can have far reaching consequences as we saw in its own way back in 1983. As always, you should let me know what you think in the comments. Oh, and go ahead and let me know what topics I should cover in the weeks and months ahead. I have a list of things I would like to talk about, but I'm curious what's on your mind, too, and what you think might make a good episode of Colin Was Right. In the mean time, thank you for watching and be well.",
            "start": 588.54
        }
    ]
}