{
    "id": 2294,
    "video_id": "e2kJHGL_dAk",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Is PlayStation Plus Getting Worse? - Kinda Funny Gamescast Ep. 102 (Pt. 3)",
    "description": "We question if PlayStation Plus is getting worse over time.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484139626,
    "duration": 731,
    "transcript_chunks": [
        {
            "text": "All right, next topic I want to talk about PlayStation Plus and Xbox Games With Gold, the free games, the free games you get free. I love it when so I I to prepare for this topic, I went to Google and I typed in Xbox Games With Gold just to see what they're officially saying about it and it literally says free games and there's an asterisk next to it and I'm like that's **** hilarious. So yeah, you pay for the the online service either PS+ or Xbox Gold and then Xbox Live Gold and you get free games every month. Uh, two games on Xbox, random amount of games on on PlayStation, two per platform, two per platform, less random than I thought I but you get the crossplay sometimes get confused participate in this at all. I have PlayStation Plus. I never get like really get those games. You guys active users of this? Well, the problem with Colin is that we're so embedded in the community usually when these games come around, we've played them, we already have them, we already you know have them through",
            "start": 0.13
        },
        {
            "text": "users of this. Well, the problem with Colin is that we're so embedded in the community usually when these games come around, we've played them, we already have them, we already you know have them through hook or crook. So it's never been as big a deal PlayStation Plus as I think it would have been to us as consumers for a long time when it first started, Colin, I did an article at IGN and we'd update every month with is it worth it and this is what we paid for the year subscription and then add up all the different avatars or backgrounds or games we'd get and take down with or discounts we'd spend in stuff and it was like what in the first four months it it easily outpaced it. Yeah, I mean I I mean I was I was some went proud of the fact that back in the day in 2010 or whenever it was like we were really the first people that were like PlayStation Plus is great idea people **** for people. I don't remember people hated PlayStation Plus. They hated they **** hated it and I remember I was being",
            "start": 55.88
        },
        {
            "text": "the first people that were like PlayStation Plus is great idea people **** for people. I don't remember people hated PlayStation Plus. They hated they **** hated it and I remember I was being like but why like why do you hate it? It's totally optional and it has all these like interesting things you can do. This was before it was mandatory for now it's mandatory on PS4. Hey, hey, keep going. So I I I you know, I've always been of the mind that it's been quite the value even though they upped at $10 over to $60 like I I think this is to me the whole PlayStation Plus and Xbox Live Gold kind of argument honestly is like and I feel this deep inside me and I and I think that it's it's true is is it's just something for people to **** about and and like I I I I just don't get how you could look at a list of games where even when you're getting six games, seven games, eight games, whatever it is a month and you can't find two or three a year that you thought was worth it that would just pay for",
            "start": 92.48
        },
        {
            "text": "at a list of games where even when you're getting six games, seven games, eight games, whatever it is a month and you can't find two or three a year that you thought was worth it that would just pay for that subscription like that's insane. Not including the discounts on games that you were going to buy anyway, you know, whether it's a they don't do summer of arcade anymore, right? But when then they got the PlayStation deals where you buy them and you get the discounts of it like spring fever. There's an I think that the what people get so hung up on what cuz this we're going we're driving at the fact that people have been outraged lately, right? And there it's getting worse and all this different stuff. Uh, there's so many little things that I don't think people remember that they saved $7 on this game that they bought or this during the sale they were able to fin angle this or get early access to something here or that they sent their saves to the cloud and their PS4 died or you know like like",
            "start": 130.6
        },
        {
            "text": "that they bought or this during the sale they were able to fin angle this or get early access to something here or that they sent their saves to the cloud and their PS4 died or you know like like there's all these interesting things where I'm like the games yeah I mean I look at the games every month and I'm like some of the some of the times but on both Xbox and PS4 I'm like these games suck you know but you can't win them all and there are plenty of great games that that have been downloadable on there too. I mean think about Rocket League as an example of that. Rocket League was big specifically because of its PlayStation Plus and it was a huge it was a huge Gambit that they that you know they had Sinx that they did. I know because I had conversations with them before they did it um you know and and uh it was it was a thing that they were thinking deeply about if it was worth doing or not. I really feel like the stigma around PlayStation Plus has reached a new height because of uh",
            "start": 165.0
        },
        {
            "text": "know and and uh it was it was a thing that they were thinking deeply about if it was worth doing or not. I really feel like the stigma around PlayStation Plus has reached a new height because of uh PlayStation 4's inclusion of having to have it to play online and that games online connectivity is somewhat ubiquitous now with whether it's leaderboards or whether you're actively playing online in in active multiplayer or you're ghosting or whatever it happens to be that like this is hard to do without PlayStation Plus but it really is just a $60 investment and and I've said it before and it's not to be snarky or snide but if a $60 investment to get free games Cloud saves automatic updates and uh play online is too much for you you probably shouldn't be playing video games like you probably should save your money and spend it elsewhere. It's really one game one AAA game bought at at at release that you don't get or something like that in exchange for a Litany of games across all these",
            "start": 200.6
        },
        {
            "text": "should save your money and spend it elsewhere. It's really one game one AAA game bought at at at release that you don't get or something like that in exchange for a Litany of games across all these platforms that you could just Bank forever and as long as you keep paying you're going to have access to them on PS3 on PS4 on Vita on Xbox 360 on Xbox One and so I never really quite understood the argument for it and so I'm I'm to I totally think it's ridiculous that people that people are so upset about it but I understand the ups and downs of it and I'm sure it's not easy for Sony to acquire these games. We don't really understand the nature by which they I've heard stories anecdotally off the Record that I'm not going to talk about here about how it goes but but the the the fact of the matter is that I really feel like it's been a net benefit that it's been an interesting program that it's that's proliferated interesting games that people otherwise wouldn't play put money in in the",
            "start": 241.36
        },
        {
            "text": "matter is that I really feel like it's been a net benefit that it's been an interesting program that it's that's proliferated interesting games that people otherwise wouldn't play put money in in the developer Pockets that otherwise aren't going to be selling their games because no one's going to care about them and I think that there's a there's a lot of positive there that people Overlook because they want to be negative about this one people's and especially within the history where there has been a big triaa game on there or something you're like oh man this is what this is what it should be this is what it should be. The problem is I think you look past it so much that it's a way to get people to play games they wouldn't have played before that are cool right? Look at that like Flame Over jumped off the list and I remember how much you were playing Flame Over and you were enjoying Flame Over and then to see like Gone Home on there or something where it's a game we all talk about",
            "start": 281.36
        },
        {
            "text": "over jumped off the list and I remember how much you were playing Flame Over and you were enjoying Flame Over and then to see like Gone Home on there or something where it's a game we all talk about but maybe you didn't want to invested in that time. Contrast on PlayStation 4, I would never played that but I did because it was free and there's so there's these things that get tossed in there where it's like I understand that you want it to be that Mass Effect is a Playstation Mass Effect Andromeda is the Playstation Plus game of you know for March that's not going to happen sadly maybe way down the line promoting Mass Effect Andromeda or whatever the hell they going to call it. There's games in here that are setting things up and doing these different marketing things but also getting you something you wouldn't play before and getting you something that is out there and so I think it's when you talk about a PlayStation Plus lineup or an Xbox it's the same thing it's I go back to when",
            "start": 314.24
        },
        {
            "text": "something you wouldn't play before and getting you something that is out there and so I think it's when you talk about a PlayStation Plus lineup or an Xbox it's the same thing it's I go back to when Adam Boyes was talking to us after PSX last year well I guess now what 2015 PSX 2015 and he was saying like they build these things and they the conferences and they try to have they understand they're talking to millions of people they're trying to have one or two or three announcements in there that every for every person so you're excited about Crash and I'm excited about now I'm talking about this one Pat up on you know what I mean like there's these things where we're all finding our touchdown and I think that's what this is where there's yeah there are times where I come through and I look at the PlayStation Plus I'm like none of I remember that game doing really poorly and this isn't cool and I don't want any of this and I bounce but there are times where I run into something I'm like",
            "start": 347.16
        },
        {
            "text": "at the PlayStation Plus I'm like none of I remember that game doing really poorly and this isn't cool and I don't want any of this and I bounce but there are times where I run into something I'm like oh yeah first off I want that game or like Last Guy in there. Yes, I want you to **** play Last Guy years later. Yes, play Last Guy. Mhm yeah I think that you know I was just reading that Tim had printed out the list of PlayStation Plus free games across all the platforms for 2016 and I'm looking at it and I'm like okay like even if 0% of these games are up your alley like isn't that a nice win for $60? I mean it's like there there are a lot of games on here that are great there are great games on this totally or games that you know Grim Fandango is on here Hell Divers is on here Nam Nom Galaxy for arena ulx the Last Guy you said Super Stars HD which is one of PS3's best games Costume Quest 2 NBA 2K16 is on there on here which I actually downloaded last month because everybody keeps telling",
            "start": 381.48
        },
        {
            "text": "for arena ulx the Last Guy you said Super Stars HD which is one of PS3's best games Costume Quest 2 NBA 2K16 is on there on here which I actually downloaded last month because everybody keeps telling me I should play Color Guardians like there's things on there that you get to miss and I you know when I went through and compiled this I put the Metacritic scores on there. Metacritic sucks. I'm not saying it's the end all be all but to put all the metac Critics on there and it averages out to about 73 74 73 average and like looking at it uh like the question of is PlayStation Plus getting worse like doesn't look like it at least from the Metacritic point of view of like these numbers like there a lot of the more recent ones are in 80s every once in a while there's a 60 something the thing I think when people think it's getting worse is when they look further back right because when you go back and you look at like the original run of PlayStation Plus you're seeing immediately Wipeout HD",
            "start": 418.88
        },
        {
            "text": "when people think it's getting worse is when they look further back right because when you go back and you look at like the original run of PlayStation Plus you're seeing immediately Wipeout HD siphon filter more siphon filter like you're seeing the games that I think people have a soft spot for where they were okay with getting older **** because it was a big name or that made it seem like that was justifying it where it is now you're getting Flame Over and Last Guy and people like well those aren't the games I want it's like okay but like you can't always get Little Big Planet sack boy prehistoric moves M for about how can you forget so yeah I think it's you know could it could it be better sure but this is an additive kind of feature of PlayStation Plus and it's not you know with p with the PS4 I it's it's it's people need to pay this this fee to get online with PS4 and I understand people don't want to just throw their money away but it's it's it's a little it's a little",
            "start": 458.2
        },
        {
            "text": "p with the PS4 I it's it's it's people need to pay this this fee to get online with PS4 and I understand people don't want to just throw their money away but it's it's it's a little it's a little intentionally ignorant to to walk around acting like you don't get anything for the $60 and that you don't get plenty of banging for your buck for your $60 cuz you do if you're if your argument is that like the Network's Fidelity isn't very good or if you that's that's a fine argument but just based only on the and freebies like I I just and and then you add in the automatic updates and you add in the cloud saving which I think is **** awesome um and maybe we just like it more because we have multiple consoles and St like that maybe that's not something a lot of people use and it just kind of gives you peace of mind as well I was going to say when their systems die though but to me I'm like I just don't $60 like it's it's literally $60 and this is not a cheap hobby we all are used to",
            "start": 494.96
        },
        {
            "text": "of gives you peace of mind as well I was going to say when their systems die though but to me I'm like I just don't $60 like it's it's literally $60 and this is not a cheap hobby we all are used to spending money so $60 is really you're you're you're inhibited by a $60 purchase that's getting you all this free **** basically or **** that you're technically paying for that's not free then video game might not be for you you know like yeah it's interesting because on the Kinda Funny Facebook group there's a like this is all every time every month this comes out there's a huge discussion on what people think and it's so funny to go back to what Adam Boyes was saying I'm a little something for everybody anytime someone's complaining somebody's like I love it yeah and the thing back I feel like I'm usually middle of the road on every one of them cuz I own a few of them or whatever I'm just like oh that seems like a good month and then it is that there are the people **** like it and",
            "start": 528.36
        },
        {
            "text": "like I'm usually middle of the road on every one of them cuz I own a few of them or whatever I'm just like oh that seems like a good month and then it is that there are the people **** like it and really like it and maybe even love it and the people who hate it and like you're never you can't make everyone happy because it's so broad there's no way I mean even if it was all right we're giving everyone Persona they'd be like there I don't care about JRPGs why didn't they why didn't they give me Mass Effect like all right guys gu complicated and this isn't so much about the free games but I think I want to give a shout out to Sony for doing a really good job with digital sales and I think PlayStation Plus has a lot to do with that there's so many times I'm on PSN there's like sales there's always flash sales going on there's always like event sales happening and I'm like why don't other people do it this way you know I mean like Steam does Steam does it obviously really well Steam",
            "start": 562.92
        },
        {
            "text": "always flash sales going on there's always like event sales happening and I'm like why don't other people do it this way you know I mean like Steam does Steam does it obviously really well Steam Steam's the best but uh like Xbox doesn't do that like Nintendo doesn't have like Nintendo focused sales and stuff every once in a while they will but it's usually as an apology because they **** something up yeah uh but on Playstation it's like I I really think they're doing a good job of getting me interested in things that I wouldn't necessarily be interested in like there's been multiple times where the PlayStation Plus uh sale price like there's a sale going on on PSN and and the PlayStation Plus discount you get on top of that sale I'm like oh **** worth it right over break somebody had hit me up of like they got like three of the games we had been talking about this year for like $760 because it's like that what you're talking about where you compile all that together and but those",
            "start": 595.04
        },
        {
            "text": "hit me up of like they got like three of the games we had been talking about this year for like $760 because it's like that what you're talking about where you compile all that together and but those are those are the hidden benefits right the benefits people think of are the instant game collection and why the **** is there an Oddworld on here I don't care about Oddworld I want to play something well next week next year they'll be or next month they'll be something different but yeah okay any closing words no my argument that it's it's you know you the the old adage is you spend money to make money we we know that from owning a business but I would also put forth that you you spend money early to save money later and that I I think that it's like a gamble because you don't know what you're going to buy if you're going to buy 10 games a year or something like that maybe none of your games are discounted but if you're if you're a a chronic purchaser of games and if you also wait to",
            "start": 634.68
        },
        {
            "text": "going to buy if you're going to buy 10 games a year or something like that maybe none of your games are discounted but if you're if you're a a chronic purchaser of games and if you also wait to and you don't care about being you know quote unquote in the conversation which is a term I hate about a game and you're willing to wait or whatever then PlayStation Plus is almost certainly going to pay dividends for you if you're patient and you buy a lot of games because if you're going to spend uh if you're going to be in these flash sales often and buy a game or two in every flash sale that is usually discounted and then discounted even more significant and severely for PlayStation Plus and certainly you're going to make your money back and if you count the cloud saving as worth $10 and you count the automatic updates as worth $5 the online plays worth $10 orever than that it removes $ 5 from the $60 and suddenly you're not really even spending that much money to grab a few freebies if",
            "start": 674.12
        },
        {
            "text": "count the automatic updates as worth $5 the online plays worth $10 orever than that it removes $ 5 from the $60 and suddenly you're not really even spending that much money to grab a few freebies if there's one game every other month that you like then you're making your money back like it it's just it's just it's just basic math and so I never really quite understood the very you know negative nature of some commentators around this like you said it's not everyone but some people around this uh I think the the negativity is a little over over the top",
            "start": 700.76
        }
    ]
}