{
    "id": 2344,
    "video_id": "kCpoYAxcLAQ",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Kingdom Hearts 2.8 Review and Audience Questions - Kinda Funny Gamescast Ep. 104 (Pt. 4)",
    "description": "Tim reviews Kingdom Hearts 2.8.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1485435664,
    "duration": 1326,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient and recipe delivery service in the country. Their mission is to make incredible home cooking accessible to everyone. They achieve this by supporting a more sustainable food system, setting the highest standards for ingredients, and building a community of home chefs. Not all ingredients are created equal. Fresh, high-quality ingredients make a real difference, so it's important to know where your food comes from. Greg Miller is all about it, as you might have seen from his hashtag Cooking with Greggy series. To this day, he swears by that buffalo chicken sand. Here's a little taste, see what I did there, of upcoming meals: spicy shrimp, pork chops, and garlic piccata, mushroom and chipotle pepper enchiladas with lime sour cream. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Gamecast. You will love how good it feels and tastes to",
            "start": 0.12
        },
        {
            "text": "enchiladas with lime sour cream. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Gamecast. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait, that's BlueApron.com/Gamecast. Blue Apron, a better way to cook. Final topic of the day, I want to talk about Kingdom Hearts. Okay, HD 2.8. I like how you said final topic of the day and Kevin shook his head in disgust, went long today. Kingdom Hearts HD 2.8 Final Chapter Prologue. How's that roll off the tongue? I played it, I beat it, or I beat at least the sections that matter to me that I haven't played before. Uh, this game, obviously, you guys, I don't know if you are familiar, um, this is a collection of Kingdom Hearts Dream Drop Distance, that was the one that came out on 3DS a couple years back. This is Kingdom Hearts Birth by Sleep – A Fragmentary Passage, again, rolls off the tongue, which is essentially, uh, remake of the PSP. This no",
            "start": 39.12
        },
        {
            "text": "that was the one that came out on 3DS a couple years back. This is Kingdom Hearts Birth by Sleep – A Fragmentary Passage, again, rolls off the tongue, which is essentially, uh, remake of the PSP. This no, this is the most exciting part of this package. It is a new game. Um, it is kind of a Ground Zeroes. Um, is this the one that runs in the engine for the next G? Yes, this is running, running in the Unreal Engine 4. Um, and so it's, it looks like Kingdom Hearts 3 is going to look. But this is a sequel to Birth by Sleep, which is the PSP game. Um, and it kind of ties into where we're going to be playing Kingdom Hearts 3 story-wise or whatever. Um, and then Kingdom Hearts χ Back Cover. I've heard people say it's Chi, but I don't know, I don't really understand. They rename the X, they should spell it Chi. They didn't though, they didn't do that. Um, and that's a movie. It's a CG movie that is kind of a retelling with it all added story points, no, of the mobile game that came out, uh, recently, Kingdom Hearts χ.",
            "start": 104.36
        },
        {
            "text": "didn't though, they didn't do that. Um, and that's a movie. It's a CG movie that is kind of a retelling with it all added story points, no, of the mobile game that came out, uh, recently, Kingdom Hearts χ, whatever. And it is like the most early, early, early part of the story. Like it goes back in the timeline earlier than we've ever seen so far. Um, so I watched the movie and I beat the Birth by Sleep – A Fragmentary Passage. Took me about two hours. So again, it's more of a Ground Zeroes experience or like Final Fantasy Versus XIII, the demo that they put out years ago, Final Fantasy XV. Um, it is Dream Drop Distance. I played before, so I didn't get into it now and didn't really feel the need to. Um, is it worth, you know, full price for essentially just the Birth by Sleep because I doubt many of you want to replay Dream Drop Distance? No, not necessarily. It is cool playing how Kingdom Hearts 3 is going to feel, you know, I like it. The graphics are real pretty, the environments are awesome. The characters",
            "start": 153.4
        },
        {
            "text": "to replay Dream Drop Distance. No, not necessarily. It is cool playing how Kingdom Hearts 3 is going to feel, you know, I like it. The graphics are real pretty, the environments are awesome. The characters themselves look a little off because like, so like Donald and Mickey and um, all the like more the, the, I don't, I don't know the difference between the anthropomorphic like humans and like anthropomorphic animals. Like the animals look off because there's something about the humans have more like features and stuff that like I'm like, all right, cool, I buy this, this look on them. Like there's more detail. But like with Mickey, whose face is really just like a circle, yeah, with like other little circles on it, it kind of looks off. Um, I feel like it needs, it needs more, the, the engine it's using and and the style it's using, uh, it could use a bit more shadows, I think. Like it doesn't look cell shaded and I think it, it could have helped if it did. I could just use a bit more depth in some of the looks.",
            "start": 201.76
        },
        {
            "text": "the style it's using, uh, it could use a bit more shadows, I think. Like it doesn't look cell shaded and I think it, it could have helped if it did. I could just use a bit more depth in some of the looks because it just look, it looks a little too clean, uh, for my taste, especially when the environments look so nice. Uh, from a gameplay perspective, it's Kingdom Hearts and man, it's been a while since I've played a core Kingdom Hearts game and it, it feels good. This is exactly what I wanted. And especially having just come out Final Fantasy XV, uh, which is a very action-heavy, um, game compared to other Final Fantasy and a lot of people compare it to Kingdom Hearts. I'm like, oh no, Kingdom Hearts, I like this ****. And I, I loved the battle system in XV, but this is what I wished it was, you know, this when you first saw the demos of um, Versus XIII back in the day, I was like, this, that I, this, this is the type of gameplay that I fell in love with with Kingdom Hearts over a decade ago. So, um, this Fragmentary",
            "start": 251.88
        },
        {
            "text": "you first saw the demos of um, Versus XIII back in the day, I was like, this, that I, this, this is the type of gameplay that I fell in love with with Kingdom Hearts over a decade ago. So, um, this Fragmentary Passage, you play as Aqua, who is one of the main characters in Birth by Sleep. Um, it's great to play as her again. Last time was when Birth by Sleep came out, which I think was like 2007. Um, so it's definitely been a while. Um, story-wise, you don't get too much in this. Uh, it's a little over the top, Kingdom Hearts-esque in terms of dialogue. Uh, and to be honest, I found myself being the least interested I've ever been. Wow. Um, you finally grown up. Just because it's been, and, and, and, and I think there's a, a very, very big reason for that. I feel like on one side of it is Kingdom Hearts 1 and 2 even were really about Disney. It's about going to the Disney World, it's doing like the meeting the Disney characters and, you know, everything had to do with that. As the series went on with, uh, they're not spin-offs, but",
            "start": 290.48
        },
        {
            "text": "about Disney. It's about going to the Disney World, it's doing like the meeting the Disney characters and, you know, everything had to do with that. As the series went on with, uh, they're not spin-offs, but with the side stories, it got more and more into its own convoluted of, here's the original characters and here's the Heartless version of them and here's the like, I don't even remember all the names of, of all the, all the different **** is. But it's like there's three, three dudes that look exactly the same, but they have different names and they're all different versions of the same person. But and it got to a point that I'm playing this, I'm like, I do not remember any, anything at all. And um, hearing the dialogue in, in this game, I'm like, oh man, I don't even care to try to figure it out. And I know that's an insult to a lot of people that love this, but it's just like, it just feels like when I played through Kingdom Hearts 1 and 2 a long time ago, I was obviously younger in a different place and",
            "start": 340.28
        },
        {
            "text": "that's an insult to a lot of people that love this, but it's just like, it just feels like when I played through Kingdom Hearts 1 and 2 a long time ago, I was obviously younger in a different place. And that doesn't take away even now from those games, because I love them so much. But I feel like I put up with all the weird anime, um, kind of just tropes because I liked the gameplay and Disney stuff so much. Yeah. Um, when it is just melodrama and like talking about the darkness for the 10th time and my heart this and the light there, and it's just like, holy ****, this is, this is bad. Yeah, this is really bad. But then as it went on, things starting to get a bit more familiar and there's Cinderella's Castle and Snow White's Forest and all that ****. I'm like, all right, all right, cool. Can't wait to see this in Kingdom Hearts 3. But I think that's the problem is this was such a coming out, yeah, such a demo. Um, and such like a, a little, oh, hear, hearing Goofy was a something special for sure. You **** dous. I don't",
            "start": 381.24
        },
        {
            "text": "Hearts 3. But I think that's the problem is this was such a coming out, yeah, such a demo. Um, and such like a, a little, oh, hear, hearing Goofy was a something special for sure. You **** dous. I don't know. I was just, I was a little let down, um, in that sense because I, I want to love this franchise more than anything, but it's like, it just feels like it's giving me reasons to not stay away. Um, but as it, as it ended, I can't wait for Kingdom Hearts 3 even more so. I'm like, all right, cool, because it does seem like it's going to be giving me those things that I want so much. Like they pretty, uh, heavy-handedly explain like, we're getting back to it, all that stuff. Like we're moving past this whole side story characters that we made up ****. Um, and the end of the, of this game, the last, the two-hour experience, well, throughout it, there's boss fights and they're super awesome. This is kind of a Kingdom Hearts game minus the other going to the different worlds, just condense down into two hours to that, to that",
            "start": 426.88
        },
        {
            "text": "well, throughout it, there's boss fights and they're super awesome. This is kind of a Kingdom Hearts game minus the other going to the different worlds, just condense down into two hours to that, to that extent. I like it a lot because it, it's, you start off with very limited abilities and you gain all the different abilities, whether it's, um, being able to to roll or jump and do your little glide thing and all that. The combos and stuff, you gain them all really quickly. Um, so I appreciate that. So I did feel a nice sense of progression with the, the battle systems and all that. Camera still just as iffy as it's always been, but that's what happens when you're doing a third-person action game with hundreds of characters on the screen at with the Heartless. Um, but the boss fights are super epic, especially the last two or three in it. And I was really impressed by their scale. It reminded me of like God of War 3. Um, so that's cool. And the, there's a twist at the end that made it all kind of worth it for me.",
            "start": 472.72
        },
        {
            "text": "the last two or three in it. And I was really impressed by their scale. It reminded me of like God of War 3. Um, so that's cool. And the, there's a twist at the end that made it all kind of worth it for me. Where from a story, no, I wish, uh, from a story perspective, where I was like, oh ****, cool. So this is how it ties into Kingdom Hearts. All along, Kingdom Hearts 1 and 2, Mickey's in it a lot, which I really like, because Mickey's more of like a, you know, the, the, the Yoda character of the series, where it's like the moments he's there really matter. But with this, he, because you are Aqua, who's a bit higher leveled than like Sora or whoever, I'm sure you're familiar, totally. Them being side by side makes a bit more sense in a way that's not just him saving your ass. So that's super cool. It was hilarious playing the game, uh, with Gia cooking, because like she just keeps seeing this stuff. She's like, wow, the writing in this is **** horrible. And I'm like, yeah, you just got to put up with it, whatever. And I just",
            "start": 512.2
        },
        {
            "text": "the game, uh, with Gia cooking, because like she just keeps seeing this stuff. She's like, wow, the writing in this is **** horrible. And I'm like, yeah, you just got to put up with it, whatever. And I just keep playing. And then all of a sudden she hears Mickey. She's like, wait a minute, Mickey Mouse is in this game. So that was hilarious. Um, but anyway, um, and the, the movie was just even more **** where I'm just like, I just don't understand who the audience is for this, uh, for like all of this weird backstory stuff. And there's obviously a lot of people, because people **** love this game, um, and love the franchise. But I just like, there's something I love about the franchise and then there's all the other ****. And I feel like this game really made me realize that there's a lot more that I put up with to get to the things I like than, um, I think is really worth the time overall. But going back to it, love Kingdom Hearts 1, love Kingdom Hearts 2, and 3 hopefully is that more condensed experience of here's",
            "start": 557.4
        },
        {
            "text": "to the things I like than, um, I think is really worth the time overall. But going back to it, love Kingdom Hearts 1, love Kingdom Hearts 2, and 3 hopefully is that more condensed experience of here's the things I like about it. Because the all these, I feel like this is kind of the answer of making all the side stories worth it, combining together in a way that leads us. This is The Avengers kind of. Well, Kingdom Hearts 3 will be The Avengers. Yeah, yeah. This is, this is the like the Thor movie that you had to watch, so you didn't really want to. Um, um, did you see the story that they, they released about Kingdom Hearts 3 and Final Fantasy VII Remake? Like I think it was maybe a week ago where they were like, none anytime soon. It was basically, yeah, it was basically a story of just them being like, because everyone's like, everyone think it's stoked. I'm like, no, of course it's not. Of course it's not stoked. That's why they're releasing all these things now to give you a little peace meal approach. Clearly Kingdom Hearts",
            "start": 597.36
        },
        {
            "text": "like everyone think it's stoked. I'm like, no, of course it's not. Of course it's not stoked. That's why they're releasing all these things now to give you a little peace meal approach. Clearly Kingdom Hearts has a big fan base. Um, I just feel bad for everyone waiting for this game. Feels like forever and it's going to be forever more. Yeah. So Kingdom Hearts HD 2.8 Final Chapter Prologue is going to be out by the time you're watching this. And then Kingdom Hearts HD 1.5 + 2.5 ReMIX, I don't know what they're actually calling it. Um, it's coming on PlayStation 4 and that's all of the Kingdom Hearts games thus far in HD on PS4 minus, um, the stuff that I just mentioned earlier for this. So definitely cool. If you haven't played Dream Drop Distance, I do think it's worth it because that is a good game and experiencing it in HD is going to be awesome in addition to, uh, Birth by Sleep. But just buying it for Birth by Sleep – A Fragmentary Passage, I don't think it's necessarily worth it. Um, but if you're super into",
            "start": 640.04
        },
        {
            "text": "it in HD is going to be awesome in addition to, uh, Birth by Sleep. But just buying it for Birth by Sleep – A Fragmentary Passage, I don't think it's necessarily worth it. Um, but if you're super into the, you know, the kind of story and narrative of this whole thing, there is a cool twist that I, I do think pulls it all together. So it would be worth it for you in that case. So now, as always, yeah, we're going to you over at KindaFunny.com/GamescastTopic where you can leave your topic. This episode won't end, Kevin. I'm sorry. Kevin's so angry all over there. Sick as a, when, when did we start that? The last topic. Okay, Jesus. I've never seen him sound worse than this. All right. Uh, we got a question from Ghost Jacobs. If you guys could get the Inside Story on any canceled game, P.T., Agent, Scalebound, et cetera, which one would you choose? Uh, Agent is a really good choice since it involved Sony and Rockstar and that would be all sorted and **** up. I guess I would say P.T. because I want to everything with Kojima and",
            "start": 677.04
        },
        {
            "text": "one would you choose? Uh, Agent is a really good choice since it involved Sony and Rockstar and that would be all sorted and **** up. I guess I would say P.T. because I want to everything with Kojima and Konami. I'm more, I don't care so much about that game as much as their relationship deteriorating. But it'd be awesome to hear like how they, yeah, Norman Reedus and Guillermo del Toro are on board and then like it all starts falling apart and what those conversations are between Kojima and them. Yeah, maybe I'll ask at RTX Sydney. Games wise, I'd probably say Star Wars 1313 just because that looked so awesome. Um, and it was so, so exciting and then for it to just not happen, really sad. But, um, in terms of like juicy stories and ****, I think P.T. is the, the definitive answer. StarCraft Ghost. I don't care too much about StarCraft, but that was such an interesting development as well. Sure, that was a long time ago though. Jon Bernardino, what flaw could a game have that would break the experience for you no matter how",
            "start": 736.16
        },
        {
            "text": "StarCraft, but that was such an interesting development as well. Sure, that was a long time ago though. Jon Bernardino, what flaw could a game have that would break the experience for you no matter how good the rest of it is? Uh, I don't, I'm not much of a frame rate snob, but skipping or like framy games in terms of like inconsistent frame rates definitely ruin them for me. If you're going to run at 15 frames, that's fine. Just, I mean, it's not great, but it's fine. We just run at 15 frames, you know. Um, I'd be the inverse of Colin and if it was only inverted, like I can't play this. I can't, I don't care how great this game is supposed to be, I can't do it. Yeah, I'm really picky about controls. Uh, for example, in Grand Theft Auto: San Andreas, I, I just couldn't keep playing it because when you drove the car, you had to use the analog stick, you couldn't use the D-pad. And there's just something about third-person, uh, driving where I like the precision of just, you know, the D-pad kind of moving over slightly.",
            "start": 782.44
        },
        {
            "text": "you had to use the analog stick, you couldn't use the D-pad. And there's just something about third-person, uh, driving where I like the precision of just, you know, the D-pad kind of moving over slightly, slightly, slightly. So that the analog just always felt off to me. The beginning of that game, you play on the bicycle and it was the same way where you had to use the analog and I was just like, I just can't do this. Like it just bothers me. I know it's such a nitpicky, stupid thing, uh, but whatever. A game has one little control aspect that I'm like, ooh, this just **** feels wrong. It gets to the point that I'm not, I'm, I'm just going to stop playing. Shawn Zulu, how long and crazy have your most insane gaming binges been? I don't know. I haven't had a gaming binge probably since I was a kid. Yeah, I mean, the one I go back to is one story I've told a million times where P.O. brought over, we both bought NCAA Football that year and he brought his PS2 over and we set up a second TV downstairs in that card",
            "start": 824.76
        },
        {
            "text": "one I go back to is one story I've told a million times where P.O. brought over, we both bought NCAA Football that year and he brought his PS2 over and we set up a second TV downstairs in that card table. And I'll never forget walking him out of the house that morning and as the sun was rising, I was like, **** yeah. All the Halo games, we had crazy binges for where there was Halo 1, me and my friends just play Capture the Flag for **** hours and hours and hours. But then when Halo 2 and Halo 3 and 4 came out, we all got together and played through the campaign in one sitting. And that was always a really intense, um, time because I mean, those games, they're not that long, but some of them go upwards of 10 hours. Like sitting straight through, like we would not stop till we beat it. So those were definitely some of my more insane things. Smash Bros. I mean, I'm sure I played that game for hours on hours on end at one time, specifically probably Melee would be the most. But I'm not that, I'm not a",
            "start": 872.32
        },
        {
            "text": "definitely some of my more insane things. Smash Bros. I mean, I'm sure I played that game for hours on hours on end at one time, specifically probably Melee would be the most. But I'm not that, I'm not a binge type of guy when it comes to gaming. Like it hits a point where I'm like, all right, I got to do something else. I need to sleep. I mean, that was the whole thing with the wrestling N64 games where I would take the day off school the day after they came out so I could play as, play as long as I could, then sleep downstairs in the TV, you know, video game room and then wake up and play more. Yeah. Um, Movie Buff wants to know, with today's climate, what are games that you think do politics correctly? I feel like this kind of an easy answer, but I think Metal Gear Solid overall has always done a good job of presenting different opinions as convoluted as they are and different perspectives on politics and thinking that way. And it wasn't really until Metal Gear Solid 2 that I even really ever thought about",
            "start": 912.24
        },
        {
            "text": "of presenting different opinions as convoluted as they are and different perspectives on politics and thinking that way. And it wasn't really until Metal Gear Solid 2 that I even really ever thought about our political system or ever thought about our government not being good, you know, and the government like doing shady ****. I was 11 at the time, so it's not like that crazy. But like that was a game that made me think about what it means to be a president and the people close to the president and all that stuff. I mean, I was, I was, it's funny because I've been pondering the idea of doing politics and games and why it's good and why there should be more. Because I hate when people say to keep your politics and your social stances and everything on the games. I'm like, **** you, you know, like that ****, it makes good art. That **** makes for good storytelling. If you don't want politics and, and, and, and, and social views and points of view in your games, that's part of the reason that you're",
            "start": 954.0
        },
        {
            "text": "****, it makes good art. That **** makes for good storytelling. If you don't want politics and, and, and, and, and social views and points of view in your games, that's part of the reason that you're holding your medium back. That's like saying, uh, keep your politics out of like every piece of, every piece of literature that's ever been written. It's silly. Um, and so I think that there is a lot of subtle politics in a lot of games. And, and I like the way games like Banner Saga and, uh, even Final Fantasy Tactics and stuff deal with fictional politics. And, um, and I think that kind of stuff's important. But I think that it's essential that we let this stuff seek, whether it's realistic or based on real stuff like Metal Gear or based totally on fictional stuff like a lot of the games we play. I think it's important that it's there because I think it's a good storytelling devices. That's why House of Cards is so **** good. That's why, um, but it doesn't have to be overt like, I'm pro-choice or I'm pro-life.",
            "start": 994.88
        },
        {
            "text": "that it's there because I think it's a good storytelling devices. That's why House of Cards is so **** good. That's why, um, but it doesn't have to be overt like, I'm pro-choice or I'm pro-life. Politics, politics, small P politics can mean almost anything. And small S social views or the way you look at the world that, you know, that engineers, uh, the way we play games and that engineers the way we are, we receive stories. And so I think lots of games do that really well. And I think we talked about The Last of Us is another game that deals with a pretty significant social issue very well. So well that it never even touched on in the first game and it only expanded on in the DLC and it made you look at the entire other game differently. And I think that that's cool, you know. Yeah, I think indie games are doing it. A lot of indie games are in the same way Colin's talking about that their art. So people are have a bringing their perspective to it. You know, I'm playing through 2064: Read Only Memories",
            "start": 1035.96
        },
        {
            "text": "are doing it. A lot of indie games are in the same way Colin's talking about that their art. So people are have a bringing their perspective to it. You know, I'm playing through 2064: Read Only Memories right now still. And like, you know, one of the big things that's going on in that universe is genetic modification and if that makes you less than human and what if you're doing is it's people who are doing it. You know, Jim Sterling's character in the game is a guy who's fiercely anti that movement, right? And feels that those people aren't human anymore. They're, they're no longer human once they go through this genetic modification or whatever. And to hear that character's arguments and then talk to the people who have been genetically modified and why they did it. It's not, you know, some people are doing it, yes, just for, you know, giving themselves cat ears and tails and stuff because that's their kink or whatever. But then there's this one character in the game who you meet who's super, you know, a",
            "start": 1067.28
        },
        {
            "text": "doing it yes just for you know giving themselves cat ears and Tails and stuff because that's their kink or whatever but then there's this one character in the game who you meet who's super you know a furry when you first meet her but it's you know based on the fact that she had to do this to stay alive but she's being looped in with all these other people so why would we want to shut it's like this really fascinating thing that is goofy on its top level right of like oh people are turning themselves into furry cats or whatever you know it's like this next step for furries or whatever but then to get into it and start thinking about it and start applying it back to the politics in our world you see those parallels yeah I think it's important that we keep telling stories like that and challenge people um and challenge their their preconception I think that's what like imagine BioShock if it wasn't political it would be impossible to tell that story but it's one of the great stories",
            "start": 1102.0
        },
        {
            "text": "people um and challenge their their preconception I think that's what like imagine BioShock if it wasn't political it would be impossible to tell that story but it's one of the great stories ever told in games and it's a bastardization of libertarianism and I and and I'm I have libertarian leanings and I'm not offended by that I don't care it's interesting you know well that's when games are at their best right and stories are at their best when they get to put us in somebody else's shoes and challenge the way we think about something yeah and even and even say that it's wrong and even say that it's this is the end result of your of your point of your beliefs and I'm like well I don't agree but it's very interesting you know it's about having you can tell when someone's really confident in the way they believe or and when they just don't want to be challenged and they want to just be told children's stories basically and so more politics the better yeah and I mean then the small P way",
            "start": 1134.44
        },
        {
            "text": "the way they believe or and when they just don't want to be challenged and they want to just be told children's stories basically and so more politics the better yeah and I mean then the small P way you know all about the small P damn I don't of course it's the Mushroom Kingdom as well they handle that shit well uh this one's from my dude David Bodell shout out to you where are all the 3DSes it's like Nintendo just quietly stopped making them or something none within 50 Mi of me damn good signs I've been seeing a lot of these people tweeting me pictures of just like their targets and they being no 3DSes so that's good stop making 3DS games just shit stop yeah I don't I guess that's the the only similar to Vita right whatever yeah um and then final question for I thought meant where are people playing him because that's the other thing too mine just sits down there I touch one I seen people playing them all the time I I was going through I I have like I don't know hundreds of PS3 and",
            "start": 1169.24
        },
        {
            "text": "playing him because that's the other thing too mine just sits down there I touch one I seen people playing them all the time I I was going through I I have like I don't know hundreds of PS3 and PS4 games on the shelf and video games and there there was a my 3DS was on top of one of them but I was taking one out and it just like fell on the fell on the rug or whatever and I was like oh there you are I haven't seen you in a while this one's from Barack Attack he says Thumper haven't played Thumper play Thumper then talk about it next week Kinda Funny Kevin knows you guys play Thumper I did yeah what we all think of Thumper it's interesting it's like a very abstract musical VR VR I love Thumper yeah yeah I played it I think I played it at some PSVR demo and it's on and it's been one of those that I see on my unit all the time and I was like when I set up that VR room maybe I'll fuck around with it now it's set up Thumper one of my my favorite um um games are played on PSVR but it's not",
            "start": 1211.84
        },
        {
            "text": "that I see on my unit all the time and I was like when I set up that VR room maybe I'll fuck around with it now it's set up Thumper one of my my favorite um um games are played on PSVR but it's not because of the VR stuff I don't think that that's really necessary it kind of adds to the whole yeah effect of it but the game it's just a fun game but I do feel like it lacks a depth that Rhythm games need in order what's the nutshell pitch of what's happening in the game you're you're kind of going along on a roller coaster uh style thing you just need to dodge um like just yeah obstacles random in time with the music and yeah it's in time to to music but it's like in a in a fairly indirect way where there just music happening and like you can see the pattern where it's kind of like a a much more pretty less cartoony dumb down version of PaRappa the Rapper where like you you know like when you're supposed to hit the things but based on you see three obstacles so it's like boom boom boom",
            "start": 1250.44
        },
        {
            "text": "more pretty less cartoony dumb down version of PaRappa the Rapper where like you you know like when you're supposed to hit the things but based on you see three obstacles so it's like boom boom boom based on how far apart they are but got yeah I I didn't beat it but I got I played a lot of it and it just hit a point I'm like all right cool I get it and I don't need to keep playing but it's a lot of fun though and it is good and if you have PSVR there's not much else to play so you might as well get it try it ladies and gentlemen this is Been Kinda Funny Gamescast it's over Kevin till next time I love you",
            "start": 1294.08
        }
    ]
}