{
  "id": 2327,
  "video_id": "kMOzUSHEiVo",
  "show_name": "Gameplay",
  "hosts": ["Tim Gettys", "Soul (Nintendo)"],
  "title": "Let's Play Ultra Street Fighter 2 on Nintendo Switch - Kinda Funny Plays",
  "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
  "published_at": 1485018003,
  "duration": 472,
  "transcript_chunks": [
    {
      "text": "What's up guys? I'm Tim G from Kinda Funny. Here we have Soul from Nintendo. We're checking out Ultra Street Fighter 2, the final challengers, the first Street Fighter game in like 10 years, first new one we got. We got the HD1 a couple years ago or whatever, but it is the first new one, new characters. Got Evil Ryu and Violent Ken, but we're playing retro mode here. So there there's two modes in it, right mode? Yeah, classic. So there there's classic mode which looks old school and then what's the other one called? Uh, HD mode. HD mode where it's like the, you know, super nice vision visual and all that stuff. Let's get right into it though. Got to go with my girl Chun-Li. Chun-Li. All right, let's go. You know what? I'm going to go Violent Ken on this one of the new characters. All right, for those who don't know, I'm really bad at Street Fighter, but it's okay. So what's up with Violent Ken and Evil Ryu? What's different about him? Uh, so euu if you play him in other games, he's sort of the same. He's got, you know,",
      "start": 0.12
    },
    {
      "text": "I'm really bad at Street Fighter, but it's okay. So what's up with Violent Ken and Evil Ryu? What's different about him? Uh, so euu if you play him in other games, he's sort of the same. He's got, you know, struggles with the dark D, you know, all that B Stu and then Violent Ken, um sort of like the gist of his story is he gets captured by in and he kind of gets that cycle power. Okay, so but from a gameplay perspective, how how different are they from the other K does have an extra move that he does. So he does give away, um he gives up some of his speed and he gains more power. Okay, cool. He does have EXT like sort of dash move. I'll show you that going to G stage. G music makes everything better and uh so the buttons real quick, uh punch is going to going to be Y and X. Also the hard punch is going to be the L button. You can tell he's violent cuz he's purple. Wow, got a round. That's all I needed to feel valid. Have a clear strategy, jump around and jump on your head.",
      "start": 40.2
    },
    {
      "text": "The L button. You can tell he's violent cuz he's purple. Wow, got a round. That's all I needed to feel valid. Have a clear strategy, jump around and jump on your head. Nice. I don't remember if Chun-Li has the little baby Hadoken in in this one like her her H is in this in in this game. I think that one I think you have to charge back the charge thing. Yeah, okay, right. And this one we'll go with the Evil Ryu this time. Let's see. I'll try I'll go Evil Ken or Violent. Where's he at? He's over there on the side. There you go. All right, you know what? We'll just go Evil Ryu. See where should we go this time? Let do go Ryu stage. All of even the new characters in the old style. Yeah, oh, I'm out of trouble with the Hadoken here. Oh, that was really cool. You can use the directional pad if you want to. It might be easier. I don't I don't know which one you're used to playing with. Oh, so you were saying you were playing against",
      "start": 91.12
    },
    {
      "text": "You can use the directional pad if you want to. It might be easier. I don't I don't know which one you're used to playing with. Oh, so you were saying you were playing against Justin Wong earlier. Yeah, I didn't know I didn't even know who he was until uh one of my uh one of my partners told me he's a legend legend. That was the this supped be so frustrating people watching like why is he doing that? Oh, oh now what did you do wrong? A lot did a lot wrong. All right, this will be I won one. You won one. This will be the game to decide the ball going back to my girl Chun. Okay, uhoh, he's pulling up the big guns. Little E Honda. Same as always come from above. Yep, yep, yep, yep, yep. Oh, okay, that's all I got. I was scared you going to do that jump off the wall flippy dippy ****. Wasing com chle takes me out again. So Justin Wong beat you. I beat you. So that's I'm assuming it goes Justin long and then me and then you",
      "start": 242.39
    },
    {
      "text": "To do that jump off the wall flippy dippy ****. Wasing com chle takes me out again. So Justin Wong beat you. I beat you. So that's I'm assuming it goes Justin long and then me and then you in terms of best Street Fighter two players in the entire world. Heard it here first folks. So this was the classic mode. There's also the HD mode. When is this game available? Uh, they actually haven't listed a said it yet, but it will be available on the Nintendo Switch. Thank you very much. So see you soon.",
      "start": 407.4
    }
  ]
}
