{
    "id": 2271,
    "video_id": "mq5pRvnZsqQ",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Was 2016 a Disappointment for Big Games? - PS I Love You XOXO Ep. 68",
    "description": "It's the first show of 2017, but one viewer wants to know if last year's AAA game crop let us all down. Greg and Colin discuss! (Released 01.03.17)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=0pymUCsVGaA\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1483462831,
    "duration": 5033,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to PS I Love You XOXO, episode 68. I'm one of your hosts, Greg Miller, alongside the lead singer of the Spin Doctors, Colin Moriarty, to break into Jimmy Olsen's Blues over here. I think that's what I want to, I've decided what I want to do. My 2017 New Year's resolution is to change it up for you every time. Now it's been how many years have I been doing Pride of Long Island? Here it is. Everything I know, however many years it's been, it's been too long. Exactly. It's time to shake it up, a new one every time. I say now go, you're very loud. I forgot Kevin, I just want to consult with you one more time because I haven't seen Greg in I don't know, like a month. Was that louder than usual or am I just not acclimated? Kevin frantically trying to turn on his microphone to make sure. I think that uh, you just, you're lacking the, he's been off too long. He's, I've been in like a hyper, what do they call it? Hyperbolic chamber? Is that no, it's not hyperbolic. It's, is it, is it a",
            "start": 0.5
        },
        {
            "text": "make sure. I think that uh, you just, you're lacking the, he's been off too long. He's, I've been in like a hyper, what do they call it? Hyperbolic chamber? Is that no, it's not hyperbolic. It's, is it, is it a hyperbolic chamber? It's a, it's a chamber of hyperbole. I guess that is where I live actually. I do live in a hyperbolic chamber. You figure it's, it's, I've let it build up. Hyperbaric, I think it is. Hyperbaric chamber, I think. Something like that. Okay. Think about it this way, where it's like every day we were out here **** swinging, doing all these shows, right? It's been two solid weeks of not doing anything. I've built up. I've been in Canada for one of those weeks where I couldn't be loud at all. Every time I talked, they told me I was too loud in there. It's true. They're are quiet people. **** them. I know, right? They were all worried about avalanches in the mountains. I was being so loud. They said they didn't know what they were talking about. They're nothing up. Colin, we're back. 2017 is here, the first",
            "start": 59.6
        },
        {
            "text": "right? They were all worried about avalanches in the mountains. I was being so loud. They said they didn't know what they were talking about. They're nothing up. Colin, we're back. 2017 is here, the first thing we've ever recorded in 2017 is right here. Yeah. Are you excited? You ready for another year of this? Hold my hand. Hold my hand. Here we go. Jump off the cliff together. We're just gone. Like when we just like when we **** started the business. Hold your hand and jump. Colin, did you know that listeners and viewers can go to kindafunny.com/psq to get their questions read in the air just like Nathan Shoket did? Thank you for spelling out your last name. Nathan writes in and says, Hi guys, no super detailed questions here, but I was curious how your breaks were, went. Did you get to make your way through a bunch of backlog games in between spending time with loved ones or did your systems end up silently waiting for you to return from your holiday? Love your work and Happy New Year to you both. Your friend,",
            "start": 99.08
        },
        {
            "text": "of backlog games in between spending time with loved ones or did your systems end up silently waiting for you to return from your holiday? Love your work and Happy New Year to you both. Your friend, Nathan Shoket. PS, totally up to you, but would you mind giving my best bro Michael a birthday shout out? He's turning 5 on the day this episode releases and he loves you guys too. No, we won't do that. What'd you do for a break? Um, I I did a lot of things. I uh, went to Mexico. Yeah, you're going to talk about having the GameOverGreggy Show. You said yes, I'm excited about that. Uh, so that was interesting. And uh, and then uh, came home and I was home for I don't know, from like the 2nd till now. Yeah. Um, how many how how many hours were in pants do you think? Were you mainly? My God, like almost I was pretty much never. There were days where I never even left. Oh yeah, I went to the diner. I saw that Snapchat or not Snapchat, Instagram, Snapchat Stories, whatever you want to call it. Too old for that. She was watching",
            "start": 145.84
        },
        {
            "text": "never. There were days where I never even left. Oh yeah, I went to the diner. I saw that Snapchat or not Snapchat, Instagram, Snapchat Stories, whatever you want to call it. Too old for that. She was watching people do that make uh, but yeah, no, I uh, I played some games and I read and I watched TV and caught up with the sports and uh, played with Lola. Yeah, I don't know. How did the writing? This is the first time we've talked. You played the crystal bassoon a bit like every day. Oh my gosh, like five times. It's con, it's like one of those helmets with the beers and the straws. It was just one giant crystal bassoon. Yeah. What I want to know is how did the writing go? I haven't talked to you at all. You you were originally going to write a lot in Mexico and then I saw you put up the Tweet about your New Year's resolution. Right, right, right, right, right. Yeah, the ideas in full. You get a lot of work then. Yeah. Uh, so a lot of it, I mean, I wrote quite a bit, but the the uh, the idea is solidified and um, yeah, it's good to go.",
            "start": 189.2
        },
        {
            "text": "right, right, right, right, right. Yeah, the ideas in full. You get a lot of work then. Yeah. Uh, so a lot of it, I mean, I wrote quite a bit, but the the uh, the idea is solidified and um, yeah, it's good to go. I think I think the idea is is great. Like I really do. I like it and I'm I'm I'm stoked to see no dramatic changes since I last heard about the no, not really. And so and so um, you listener, viewer, you're not missing anything. You don't know what this idea is yet. Colin's not shown his cards, but he's been hinting around at it. I'm not going to show any cards until it's time to go. But what you should do is not ever release it and have a whole **** novel series and then when you die, Lola's grand babies get all that money when they start publishing those books. It's like Chinese Democracy, take 15 years. Uh, yeah, so I I'm aiming for the middle of the year to have something for people, not like the listeners, but like people like close to me to start to look at. Um, and uh, I think I I don't know, so I'm stoked",
            "start": 231.2
        },
        {
            "text": "Yeah, so I I'm aiming for the middle of the year to have something for people, not like the listeners, but like people like close to me to start to look at. Um, and uh, I think I I don't know, so I'm stoked with the idea. A lot of it was just spent on the beach and like on, you know, like just like writing in notebooks, like fleshing out characters and stuff like that. I'm excited about it and it's it's it's basically my massive priority this year. Um, is to finish this. Um, I've always wanted to write a book and and I've had opportunities presented to me in the past to write books. Um, and for, you know, one reason or the other, one I I pursued quite vehemently, uh, for a while and it just it it's still actually in the air. I I I I haven't talked to the guy in a while from the publisher, I guess. So he's a really nice guy. He actually listens to the show. Um, works in a major publishing house and and and he and I have been going back and forth for some time since I was at IGN, but I just can't find the time to",
            "start": 275.96
        },
        {
            "text": "nice guy. He actually listens to the show. Um, works in a major publishing house and and and he and I have been going back and forth for some time since I was at IGN, but I just can't find the time to write that particular book right now. I'd like to work with him in the future. And then some, you know, a guy that publishes fiction and reached out to me a little while ago, but but I think I want to just go this alone and just see like how it goes. And um, I'm open to any all opportunities obviously, but this is always something I've wanted to do. I want to do something that I feel like not that what we do doesn't mean something or like the things we've done in the past don't mean anything, but I want to do something that's like I always wanted to have my name on a book. Sure, you know, and uh, that's like a huge dream of mine. So I hope that that works out. So yes, it went very well and and it's it's it's difficult work to do and and hopefully um, hopefully it comes out at some point in the future. I don't",
            "start": 316.68
        },
        {
            "text": "a huge dream of mine. So I hope that that works out. So yes, it went very well and and it's it's it's difficult work to do and and hopefully um, hopefully it comes out at some point in the future. I don't lose my nerve. Thank you. Let me know how I can help. Question here. What'd you do about gaming though? You had a whole bunch. We both had not aspirations, not dreams, but we had plans, things we wanted to do. I saw you Platinum. We we didn't have dreams because that game's never going to come out. Hey, hey, it's in this **** video. It's confirmed. The hell it is. We'll get that. Yeah. Uh, what did you what did you Platinum Hitman Go? I Platinum Hitman Go very early on in the uh, in the break. I've been working on that one for like eight months. Uh, I really like that game a lot. Hitman Go is great. Uh, I moved on to Lara Croft Go. Just I I moved on to Lara Croft Go, which I think is a significantly inferior game. And inferior, yeah. And and you were you were saying five to seven second load times on that game. It's a joke. No offense.",
            "start": 351.92
        },
        {
            "text": "Lara Croft Go. Just I I moved on to Lara Croft Go, which I think is a significantly inferior game. And inferior, yeah. And and you were you were saying five to seven second load times on that game. It's a joke. No offense. Maybe multiply that by four or five and you get the Lara Croft Go on Vita is perhaps the worst optimized game I've ever played on that device, period. I can't believe that they released it in that shape. And uh, it's frankly embarrassing. They should have just not even released on um, for a game that requires so much touch and go and so much like trial and error, way more than Hitman. Um, to literally wait 5 or 30 seconds for the game to load. And that's literal, literally 5 or 30 seconds to load. Go to a map, loads forever. Go to back to the menu, takes forever to load. It's like who the **** optimized this game for Vita? And why does Hitman Go run so much better than this game? It's not this isn't a technical Behemoth. Killzone Mercenary runs just fine on Vita. So that annoyed me a little bit. Nonetheless, I",
            "start": 392.24
        },
        {
            "text": "game for Vita. And why does Hitman Go run so much better than this game? It's not this isn't a technical Behemoth. Killzone Mercenary runs just fine on Vita. So that annoyed me a little bit. Nonetheless, I platinumed it. Yeah. Uh, but I found it to be a way. Jump over to PlayStation 4. No, Aaron was playing it there and it and it runs way, way better. That was the problem is that I played I when I played Hitman Go without any uh, comparison when I was just playing at the coffee shop, I was like, oh, this is fun. These loads suck, but whatever. I'm doing this. I'm texting somebody. I'm doing whatever. And then when I went home and saw it on PlayStation 4, I was like, oh, why the **** would I ever played on Vita again? It's it's incredibly **** annoying on Vita. Like I'm just throwing it out there. But I stuck with it. I'll tell you, I sure did. I couldn't wait for it to be over like halfway through the game. Like I got it. I I've come this far. I need to get this over with. 3% of the people that played have a platinum. I can't I",
            "start": 436.28
        },
        {
            "text": "you. I sure did. I couldn't wait for it to be over like halfway through the game. Like I got it. I I've come this far. I need to get this over with. 3% of the people that played have a platinum. I can't I can't possibly not be one of the people. So I played that. I played a Vita game called BS gold quite extensively. I played it. I didn't like it. It didn't work for me. I liked it a lot. It looked it's got it's what we were talking about uh, on our top 10 list about Rogue Legacy. A lot of Rogue Legacy feel in that game in terms of D. Come back doing it isn't exact. And that was the thing where it's just it was a bit too stiff for me. Why'd you like it? It's obtuse. I like I but just the right amount of obtuse. So the idea is that there's like these four World. Each world I think has seven stages. Um, and you're just going through somewhat random generated stages, but they're kind of similar to each other in each of these worlds. Um, and I just found it quite satisfying. The cool thing is that you find these like",
            "start": 469.68
        },
        {
            "text": "going through somewhat random generated stages, but they're kind of similar to each other in each of these worlds. Um, and I just found it quite satisfying. The cool thing is that you find these like secret books. You have to do like really obtuse and strange things to make them appear. So like um, in I think it's like World 1, if you beat World 1 with a weapon you bought from the shop and World 2, if you get all the way through it, then a monster appears. You kill the monster, then like a treasure chest appears. This this something you have to read online to figure out. Yeah, I figured out something about myself and then I realized that this **** was happening randomly and I went online and looked, figure out what they doing. And these books allow you to upgrade your character and your character becomes like super powerful. Um, and is able to do a lot of things. So you have like the ability to for range with your dagger. You have ability to have more health or um, you know, whatever move quicker.",
            "start": 506.72
        },
        {
            "text": "becomes like super powerful. Um, and is able to do a lot of things. So you have like the ability to for range with your dagger. You have ability to have more health or um, you know, whatever move quicker, whatever it is. And so I I liked it. I mean, I I I played the game and instantly knew that this game was going to be a major turn off for lots of people, but it reminded me of of older games that I really liked that just keep you coming back for more and more. It has the same kind of hook that Downwell had for me in the sense that it's not nearly as hard as Downwell, but yeah, where it's like it's it shouldn't be this hard, but I I on the plane to and from Mexico and in Mexico when I was playing Vita, that's basically all I played. Um, oh, interesting. And I really, really liked it a lot. Um, and the major game that I spent time with um, uh, over the break when I got back from Mexico was Rise of the Tomb Raider. Ah, yes. Now the specific reason that I wanted to that I I I frankly thought it was a mistake and",
            "start": 540.16
        },
        {
            "text": "game that I spent time with um, uh, over the break when I got back from Mexico was Rise of the Tomb Raider. Ah, yes. Now the specific reason that I wanted to that I I I frankly thought it was a mistake and didn't want to do our game of the year video before the break is because I knew I was going to be playing things or at least something that was going to mix that list up. And Rise of the Tomb Raider is one of those games. Um, and so you know, my list that's going to go up, I think the same day this goes up for everyone on on youtube.com/kindafunnygames is already inaccurate, but that's the name of the game, I guess. Uh, Rise of the Tomb Raider is exceptionally good. Yeah. And um, and I played it for I want to say almost 30 hours at this point. Are you going to platinum it? Uh, maybe. I I I um, so in terms of the trophies, the the trophies are out of **** control in the game. Like there's a million of them. There's a million of them. I there was a point where I went in and just looked and I had like 34 Platinum or",
            "start": 577.64
        },
        {
            "text": "trophies. The the trophies are out of **** control in the game. Like there's a million of them. There's a million of them. I there was a point where I went in and just looked and I had like 34 Platinum or 34 Bronze trophies and % of the trophies in the like what? And it's because all the DLCs in there and that's fine. You don't need the DLC trophies to even get the platinum trophy. I just feel like even the general trophy list is just so bad. It's just such a bad list, especially with all the collectibles and all the cool things in the game. Nonetheless, um, as I tweeted out when I was playing it a little bit, uh, the game is strongest when it's not trying to be Uncharted. I think the beginning of the game is totally ripping off Uncharted. And then when you settle into what the game actually is, you find that there's a lot of really unique and interesting ideas in the game that you know because you played on Xbox. Um, and I like that there's a lot to do, but it never seems super overwhelming. Like",
            "start": 618.0
        },
        {
            "text": "find that there's a lot of really unique and interesting ideas in the game that you know because you played on Xbox. Um, and I like that there's a lot to do, but it never seems super overwhelming. Like there's just enough to do. I like that she learns languages and I like that she finds survival caches and documents and relics. All the relics have stories and the documents really stress the story. And it has that soft feel where when you get introduced to a new area, yeah, you start seeing things pop up, but it's not them popping up in there's a hundred caches to go find or 100 gold coins to find. It's like I could actually stop here and and that's what I did. Every time I entered a new area, you spent like an hour cleaning it out, getting the XP, doing all these things, learning whatever you can. And yeah, spawning or spamming survival Instinct the whole time. Yeah, that's really annoying as ****. But but uh, I think that it's uh, um, you know, you said it's like a Ubisoft game. I would dare say with the",
            "start": 657.88
        },
        {
            "text": "spawning or spamming survival Instinct the whole time. Yeah, that's really annoying as ****. But but uh, I think that it's uh, um, you know, you said it's like a Ubisoft game. I would dare say with the exception of maybe the Far Cry games, it's better quality than Ubisoft's typical offerings. And uh, Far Cry I think is like the the pinnacle of what Ubisoft does in my mind. Um, and I feel like there's just cool ideas there where like you you you wonder as an Uncharted fan, what would Uncharted look like with more the the the the makings of a modern game as opposed to like a pulp game that's very that would be very at home on PS3 in a sense where it's like there's not much to do here. You're just going from point A to point B and maybe there's some collectibles. What would this game look like if it was opened up and given some love and massage in a different way? And you actually have you don't have to think about you have it. Rise of the Tomb Raider is that game. I will say that the story is not that",
            "start": 694.84
        },
        {
            "text": "it was opened up and given some love and massage in a different way. And you actually have you don't have to think about you have it. Rise of the Tomb Raider is that game. I will say that the story is not that interesting. And uh, Naughty Dog absolutely destroys Crystal Dynamics in terms of uh, character development, in terms of um, animations, in terms of pretty much everything that has to do with narrative and aesthetic. I don't think there's any comp. That's the same thing with the original Tomb Raider, right? In the fact that I can tell you how much I loved playing the original Tomb Raider. I can tell how much I love playing Rise of the Tomb Raider. Uh, I think the original Tomb Raider ended with me fighting a witch for some reason. And I can't tell you anybody in the game except the guy who had an escape button on his shirt, which is the same thing with Rise of the Tomb Raider, where that guy pops up and they're like, blah, blah. And I'm like, oh, is he in the first game? Like I don't even **** remember this",
            "start": 734.84
        },
        {
            "text": "button on his shirt, which is the same thing with Rise of the Tomb Raider, where that guy pops up and they're like, blah, blah. And I'm like, oh, is he in the first game? Like I don't even **** remember this dude. Whatever. Go through. Sure. And it's about though, it's her and her father. Her father's like ghosts really that were I mean like narrative ghost. Yeah. Lara is an interesting character. The voice acting is really great. Um, and I I feel like I feel like it's they have something really special here. I think everyone already knows. I think I'm the last of the party. But yeah, but uh, although the game is apparently not selling very well on PS4, but I highly recommend it. I I think that uh, it really sucked me in. I I'm I I got to the almost to the very end and then I actually have pulled back because I I know you can play the game after you beat it, but I hate doing that. Like I I I want to like collect everything and do everything and then go beat the game so I can be **** done with it. Um, but surely it's",
            "start": 772.84
        },
        {
            "text": "you can play the game after you beat it, but I hate doing that. Like I I I want to like collect everything and do everything and then go beat the game so I can be **** done with it. Um, but surely it's it's uh, it's one of the great games that I've played in the year and would bump something off my list. Um, and and I had intended on moving on to other things. Like I I uh, I booted up a game called Dex on Vita for a little while. I got a code from it. Our friends at Eastasiasoft, I think, are publishing it. They're the guys that do like Rainbow Moon. By the way, I got uh, heard Rainbow Skies still coming. Yeah, Rainbow Skies development almost done. Um, so if you guys are looking forward to that PS4, PS Vita, uh, sequel to Rainbow Moon, uh, you won't be waiting too much longer, I don't think. Um, Dex is like this uh, this really neat looking Blade Runner like sidescrolling role playing game. And no one no one had recommended to me. I was going through my spam uh, over the break and this this email them why this",
            "start": 808.48
        },
        {
            "text": "uh, this really neat looking Blade Runner like sidescrolling role playing game. And no one no one had recommended to me. I was going through my spam uh, over the break and this this email them why this isn't spam. And I just asked for a code and I downloaded it. And the game's the idea behind the game is really cool, but it just runs so badly. It literally lasted 5 minutes of my before like I'm out. And then the other game I wanted to play was Call of Duty: Modern Warfare Remastered. Um, got a bad taste in my mouth when I booted it up. And then I had to put the disc in for Advanced Warfare or whatever the **** it is that I just played Infinite Warfare. And uh, and then I I just I played. I'm like, yeah, back. Well, I mean, it's it's fine. It looks great. But uh, I'm just like, I don't really want to play shooter right now. I'm I'm shooter out. So yeah, a huge year for shooters. Yeah. Then I went to Rise of the Tomb Raider. And then basically with so I think that that's basically it. I played quite a bit.",
            "start": 849.32
        },
        {
            "text": "shooter right now. I'm I'm shooter out. So yeah, a huge year for shooters. Yeah. Then I went to Rise of the Tomb Raider. And then basically with so I think that that's basically it. I played quite a bit over the break. I also want to give a shout out to a few other things I did. Okay. Start watching that show Colony. Very good. Super Jericho like. Think you'd like it. Is this the one Aaron was talking about on Twitter that she was trying to figure out how to make you watch it? How'd she make you watch it? She just put it on the television. Watch. Seems pretty easy. Seems like she over. Uh, it's got It's not the plot's not like Jericho, but it's very Jericho like. Okay. Uh, which resonate with me. So I'm trying to work my way through that. Finished The Man in the High Castle season. Superb. Okay. Very, very good. Shout out to The Man in the High Castle. She watched that show. And then I I started watching Westworld. Uh, just a couple episodes. It's fine. I'm not I'm not like I think the idea is really cool. Not sure I was in the",
            "start": 893.52
        },
        {
            "text": "to The Man in the High Castle. She watched that show. And then I I started watching Westworld. Uh, just a couple episodes. It's fine. I'm not I'm not like I think the idea is really cool. Not sure I was in the right mindset to watch it. It reminds me when I first watched Game of Thrones and I had to go back and watch it again. Yeah, because I was like, man, click. Yeah. But yeah, so so but certainly an interesting and and intriguing idea. Uh, so I got a lot a lot done. And and playing Rise of the Tomb Raider, uh, set so deep in Soviet territory or post-Soviet territory. We reading a lot about the Russians lately as well. Well, there's lot lots to talk about with the Russians lately. Lot things. Nicholas I, Alexander II, Alexander III. You're going all the way back to catch up. See how you you don't want to jump you don't want to jump into the Russian politics now. You want to see how Russian history is **** up, man. Yeah, it's like uh, they had like serfs until like the mid-19th century.",
            "start": 931.44
        },
        {
            "text": "want to jump you don't want to jump into the Russian politics now. You want to see how Russian history is **** up, man. Yeah, it's like uh, they had like serfs until like the mid-19th century, which is a very strange kind of it ain't broke. Very strange kind of thing. But uh, but interesting, interesting to read about them nonetheless. Okay, that's it. How about you? Uh, I played a ton of Hue. Hue popped on the radar. This puzzle platformer thing when GDC was coming around and I was booking GDC and they sent over the video of what the game was. And I was like, this is awesome. And put them on the GDC stream. I think you and Nick, you and Tim, somebody did it or whatever. And I was like, all right, cool. And when it came around, downloaded on the Vita. Had it ready to go. Had a stick. What what are you laughing about? What? I I was thinking about something. Nothing. I was just I'll tell you later. Okay, okay. No, it has to do with the game, but I'll tell you after your story. Okay, cool. Uh, and jumped into it. And it was",
            "start": 976.96
        },
        {
            "text": "what I I was thinking about something nothing I was just I'll tell you later okay okay no it has to do with the game but I'll tell you after your story okay cool uh and jumped into it and it was one of those that I didn't know what to expect this game this you know 2D baseless side scroller with the puzzles or whatever puzzle games I'm it's always 50/50 if I'm going to get into it and like it or if I'm going to be like this is obtuse and I don't want to do this anymore and the way Hue built upon itself was so much fun and so interesting and clever I thought where you're going through getting different parts of the color wheel so it's the puzzle start off so simple and then by the end of the game when you have all the different puzzle pieces that's when it's like okay now it's way more complicated and how do I make all this work but so the lion's share of the game going through and solving all these different puzzles I didn't have an issue you know what I mean I wasn't if if I got to a",
            "start": 1017.2
        },
        {
            "text": "and how do I make all this work but so the lion's share of the game going through and solving all these different puzzles I didn't have an issue you know what I mean I wasn't if if I got to a point and I was like how do I do this it wasn't frustrating and at the end I've petered out now where I'm I lo I finally jumped ahead and you know all the walkthrough videos nobody writes anything anymore all the walkthrough videos I have like 15 minutes left of the game I guess in terms of puzzles and stuff I don't know if I'm going to get back to it though because it's to the point of I want to play it on planes I want to play it when I'm on the on the go I was playing on the couch in front of the fire and stuff I'm to a point though where it's just like I jump in I'm like this is kind of frustrating this is not I don't want to sit here and stare at this screen for 15-20 minutes trying to figure it out nor do I want to go watch a walkthrough video to do it if it had a platinum maybe maybe there'd",
            "start": 1051.24
        },
        {
            "text": "this is not I don't want to sit here and stare at this screen for 15-20 minutes trying to figure it out nor do I want to go watch a walkthrough video to do it if it had a platinum maybe maybe there'd be a sense of going through complete it no real reason to though but I enjoyed I recommend it I thought it was great I think the puzzles are fun interesting we talked about how bad the load times are on Lara Croft and that being like oh that's weird on Vita uh this I don't I'm trying to think and maybe you can help me do you know of a game on Vita where there's like significant frame rate drops where it just chugs all of a sudden I I I started thinking when I had seen some and it's not all the time I'm talking and it's not three-quarters of the way through the game I ran into like two or three levels where it was like I was playing playing playing and I was doing these really complicated puzzles and all of a sudden it was like and I was like I had to stop cuz and quit out close it come back yeah",
            "start": 1085.12
        },
        {
            "text": "where it was like I was playing playing playing and I was doing these really complicated puzzles and all of a sudden it was like and I was like I had to stop cuz and quit out close it come back yeah and then it cleaned it all up but I don't know if it was processing pulling I don't know The Walking Dead didn't run well yeah but even that that's like frame rate hitches I felt like or like full like scene skips and shit like that you know what I mean like it was loading something yeah I can't off the top of my head think of anything there's nothing like that going on and then it just chugged out of the blue it doesn't stop me from recommending it I think it's really great really fun maybe I'm sure at some point on a plane I'm going to sit back down and jump back in those puzzles and have no idea how what the fuck I was doing but yeah it's totally just a fun puzzle game I don't think the story is anything not that it matters it's just a narrator like is your get a letter from your mom",
            "start": 1126.44
        },
        {
            "text": "idea how what the fuck I was doing but yeah it's totally just a fun puzzle game I don't think the story is anything not that it matters it's just a narrator like is your get a letter from your mom and stuff maybe like I'm saying it stays around too long but I don't think so I think it's just that the puzzles get to a point that I don't want to play uh played the first two episodes of The Walking Dead Season 3 uh it was interesting no spoilers of course well I mean spoilers for the fact of like what the basic part of the game is right that you're playing as a new character Javier you play as Clem in flashbacks uh it was when they announced that it was going to be a new character in Season 3 that you'd be playing even though you'd get some Clem or whatever I was like I don't know that doesn't I don't know if I'm going to be into that or whatever and I think from the I think it's actually really paying off well where I I like not having the baggage it was interesting to jump into episode",
            "start": 1159.64
        },
        {
            "text": "I don't know if I'm going to be into that or whatever and I think from the I think it's actually really paying off well where I I like not having the baggage it was interesting to jump into episode one and be making choices and not know 100% who this character was yet so I could be a dick if I wanted to I could you know be go the really assholish way that I never would have done with my Clem and then to run into Clem and the story and see how that goes what she's matured into that's an interesting dichotomy too and what's interesting is again no spoilers show how the game plays out uh is the fact that you know get into the regular The Walking Dead choices of we need somebody's like we need to do this and then somebody else we need to do that but the person saying we need to do that this time is Clem and so it's like that thing where I'm still doing the I'm like fuck over not fuck over but I'm like not listening to my family members and totally picking Clem over these other people which",
            "start": 1195.92
        },
        {
            "text": "is Clem and so it's like that thing where I'm still doing the I'm like fuck over not fuck over but I'm like not listening to my family members and totally picking Clem over these other people which is going to be interesting I think and as we go down the line does that totally backfire and fuck me over because like Telltale as we saw with the Batman game I think has balls in terms of like fuck around characters you love or whatever are they going to fuck around with what the core of my Clementine was was you know I know what she's been from Season 1 to Season I feel such a connection to that character it's going to be interesting if the end like if I'm just blindly following her if that's like totally the wrong call and she's an asshole and she's just out for herself I don't know but I loved it uh had a great time it's it's another game you know we just came off of Batman we talk so much about Batman leaving especially Episode Five and how poorly it ran wasn't having the",
            "start": 1234.84
        },
        {
            "text": "know but I loved it uh had a great time it's it's another game you know we just came off of Batman we talk so much about Batman leaving especially Episode Five and how poorly it ran wasn't having the frame rate hitches the crashes none of that shit in Season Two so I mean again for the most part that's how I've had Batman until Episode Five so we'll see if it's another thing where it seems like they're trying to catch up to a deadline and it all goes to hell but cool really interesting excited one day to do a spoiler casty thing to talk about all the different choices and that but again it's cool not having a connection to people and being like Oh let's do this and fuck that person over whatever and see how that all plays out and I thought it was weird to do Episode One and Two on day one were you following this that yeah I don't understand why they did weird thing I don't know I don't understand it either but the the kicker cliffhanger for Episode Two I thought was really great and",
            "start": 1268.4
        },
        {
            "text": "were you following this that yeah I don't understand why they did weird thing I don't know I don't understand it either but the the kicker cliffhanger for Episode Two I thought was really great and I'm excited to see how that pans out cool and then just started it after I finally washed my hands with Hue it was this Shantae: Half-Genie Hero oh yeah I boot that up to yeah I really I was blown away I was like oh man this look it looks great you know it's a side scroller plat what do you want to call platformer action game where I'm hitting opponents with my hair it's got like that fast-paced it it doesn't look like it obviously but it reminds me of Shovel Knight and like oh this is like a call back to what what we've seen before and where we've done this that's WayForward shit so WayForward WayForward spawned people from WayForward spawned Yacht Club and so the the lineage of their games would be very similar WayForward's always been yeah very near and dear to my heart they make they",
            "start": 1305.08
        },
        {
            "text": "Forward spawned people from WayForward spawned Yacht Club and so the the lineage of their games would be very similar WayForward's always been yeah very near and dear to my heart they make they make some duds but they make some great games too the the one game that they made that I think was like super underappreciated was that that BloodRayne game or not Bloodborne, BloodRayne um that was clearly obviously supposed to be a Castlevania game at some point in I don't have that authentically but uh I would not be surprised did you give Shantae a chance you go oh yeah I I played around with it a little bit uh and I played the last Shantae game too on PS4 yeah um yeah I I like it what I what um actually kind of like uh got turned not turned off from it but there's I want to I like platinum in games like that and there are uh trophies in that game that are really hard and I want to wait for a trophy guide if one comes out because there's one to beat it in two hours which is probably fine",
            "start": 1340.52
        },
        {
            "text": "games like that and there are uh trophies in that game that are really hard and I want to wait for a trophy guide if one comes out because there's one to beat it in two hours which is probably fine but then there's one to get everything in the game in four hours and so I want to see how that all pans out before I because I you know uh I don't really want to you know jump into that that was when I I downloaded that and that Dex game yeah at the same time and then I just went back to Tomb Raider for me this is like one of those pleasant surprises where I'm like I I remember the PS4 game or the ones that have come before cuz other ones that been going for a minute and so jumping in I was like is this going to be like a JRPG that's been around for a while and I don't connect anything I don't know what's going on jumped in I found the dialogue funny the interactions funny they're clearly playing with the comedy and stuff the first boss battle or you know don't call them whatever the like",
            "start": 1381.16
        },
        {
            "text": "know what's going on jumped in I found the dialogue funny the interactions funny they're clearly playing with the comedy and stuff the first boss battle or you know don't call them whatever the like poopy pants or whatever the hell I was like all right that's pretty good like it seems cool to jump out and then start upgrading and buying things from the shop and doing all this stuff so little a little not that I can speak intimate to to intimately on Shantae's History which is longer than you'd think but um was disappointed that it was 2.5D um but it is very expensive to make you know that's that's a major difference between that game and Shovel Knight you know Shovel Knight looks really beautiful I don't I really don't think Shantae looks beautiful I think it's pretty I think it's pretty it looks like a cartoon which I like it looks very the 2.5D thing is becoming very generic in my in my mind like it's there's some games that I think do it really well uh I think that that uh Strider game",
            "start": 1416.04
        },
        {
            "text": "like a cartoon which I like it looks very the 2.5D thing is becoming very generic in my in my mind like it's there's some games that I think do it really well uh I think that that uh Strider game that Capcom released like very early in PS4's life cycle is a good example of a game that looks great in that in that motif and then I think there are games like Mighty No. 9 which is a you know shit turd anyway you anyway you cut it but uh looks like garbage there there's a lifelessness to it um that disappoints me which was one of the concerns I had with Bloodstained: Ritual of the Night which is IGA's game and I haven't early build of that game that was given to people that supported it and as um you know to to be clear with the audience uh I'm you know friendly with IGA and uh Ben and burritos at our house they did IGA burritos at our house and uh we are going to be in the game so um and I'm working on that with them now so and might we I mean Kinda Funny like there's going to be Team Fat",
            "start": 1450.68
        },
        {
            "text": "at our house they did IGA burritos at our house and uh we are going to be in the game so um and I'm working on that with them now so and might we I mean Kinda Funny like there's going to be Team Fat stuff in the game and stuff like that so just throwing that out there but when I played the build I was I was I was quite uh that fear was allayed you have to you have to massage that in a very specific way because I just feel like there's a lifelessness and a lack of artistic merit to it compared to traditional you know static you know pixel backgrounds sure yeah so and then final thing that I'll be playing tonight that I'm super excited to get home and put on the big TV is uh Gravity Rush 2 yeah we had that we got the code like 10 days ago yeah well we got notified we're going to get it yeah and then got it like right and I like all right cool that was as I was like going to New Orleans like I can't do anything about this I know it's not for you exactly but like I'm super stoked to jump in",
            "start": 1488.88
        },
        {
            "text": "then got it like right and I like all right cool that was as I was like going to New Orleans like I can't do anything about this I know it's not for you exactly but like I'm super stoked to jump in and play it uh review embargo it will lift sometime before when we when I can talk about on the next PS I Love You XOXO so look for those impressions week what was I gonna say oh shout out to Sony PR though and one of specific way the email for Gravity Rush 2's code upside down I was like all right you're trying too hard come on can I just get cuz my iPhone I was able to lock it and rotate it but then I needed to check something on the sheet today and I was like on my computer I'm like it's cute it's a nice idea it's whatever you're trying Jake Jones, you son of a bitch! Jake Jones, you sorry son of a bitch! if you didn't know ladies and gentlemen this is PS I Love You XOXO it is KindaFunny.com PlayStation podcast and it posts every Tuesday at 9:00 a.m. Pacific Time, rain or shine on",
            "start": 1530.52
        },
        {
            "text": "sorry son of a bitch if you didn't know ladies and gentlemen this is PS I Love You XOXO it is KindaFunny.com PlayStation podcast and it posts every Tuesday at 9:00 a.m. Pacific Time, rain or shine on YouTube.com/KindaFunnyGames and podcast services around the globe where you've made it the number one PlayStation podcast in the world and we thank you very much for that if you're listening to this the date post on Tuesday or leading into Thursday remember Kinda Funny's second anniversary is Thursday, January 5th we will be streaming over on Twitch.tv/KindaFunnyGames to celebrate and doing a whole bunch of announcements and telling you where that we're going for this year it'll be super fun and exciting so check that out Colin yes let's begin the show with what is and forever will be Roper's Report time for some singular possessive news there are two items on the list what the a baker's dozen God damn these breaks this goes back uh the so to be clear because you know we have had an",
            "start": 1567.2
        },
        {
            "text": "Roper's Report time for some singular possessive news there are two items on the list what the a baker's dozen God damn these breaks this goes back uh the so to be clear because you know we have had an episode every week even though we record it we can them this the news goes from the December 26th to today the 2nd when we recorded this and there are really only two things to talk about so um can't manufacturing the news I actually went to way more sources even than I usually do to see if I can find anything and no no dice so number one Sony has revealed the free games PlayStation Plus subscribers will have access to for the month of January 2017 and they are as follows PlayStation 4 gamers will be able to download Day of the Tentacle Remastered, This War of Mine: The Little Ones which is supposed to be very good, The Swindle which is very good, and Titan Souls which is very good free of charge if you're gaming on PS3 you'll get Blaze Rush and The Swindle for free and if you're on Vita you can",
            "start": 1611.32
        },
        {
            "text": "to be very good, The Swindle which is very good, and Titan Souls which is very good free of charge if you're gaming on PS3 you'll get Blaze Rush and The Swindle for free and if you're on Vita you can play Day of the Tentacle Remastered, The Swindle, Azkend 2, and Titan Souls that's a good month it is like people are bitching about I don't know what you're bit like like so The Swindle really cool I enjoy that game Azkend 2 is like a match three game uh Titan Souls is a is a Boss Rush game it's it's got like Shadow of the Colossus kind of DNA in it um I think it's really fucking hard it's really hard but that was a game playing on Vita where I remember booting it up on some trip we were going on and it was a it was a fun two flights of sitting there like all right fuck, how do I do this and then figuring it out but still trying to time it correctly to do it uh Day of the Tentacle Remastered is not for me because I'm not a huge nerd but a lot of you guys out there will like it and then uh This War of Mine",
            "start": 1651.8
        },
        {
            "text": "Mine, This War of Mine is supposed to it's like a survival kind of yeah I jumped in it didn't click for me but I can understand why so many people like it so there's that so as of the time you're listening to this these games should be free so go check it out make sure to obviously check don't buy them on accident number two the final piece of news it appears that Detroit: Become Human and from Quantic Dream and Dreams from Media Molecule are launching this year at least according to a new trailer Sony released teasing 2017 Launches on PS4 the other games included in the sizzle reel are Gran Turismo Sport, Hellblade, Drawn to Death, Nier: Automata, Yakuza 0, Farpoint which looks awesome, Uncharted: The Lost Legacy, Matterfall, Gravity Rush 2, Wipeout Omega Collection, MLB The Show 17, Everybody's Golf, Pyre, Persona 5,",
            "start": 1693.44
        },
        {
            "text": "Sport, Hellblade, Drawn to Death, Nier: Automata, Yakuza 0, Farpoint which looks awesome, Uncharted: The Lost Legacy, Matterfall, Gravity Rush 2, Wipeout Omega Collection, MLB The Show 17, Everybody's Golf, Pyre, Persona 5, Neo: World of Warriors, Next Machina, Knack 2, PaRappa the Rapper 20th Anniversary, Starblood Arena, and Horizon Zero Dawn don't get too excited though Shida was asked on Twitter about the inclusion of two games, Dreams and Detroit, in the trailer to which he responded their inclusion was a mistake we'll have to wait and see what happens come on now when as soon as I believe Detroit but I as soon as that popped up and kids started tweeting me I started drafting I think I deleted it but I started drafting the same tweet I did for Persona whenever you wanted to throw that in my face that I was going to be wrong with my prediction I was like on January 1st, 2018 go ahead and show me those games in your hands show me that I was wrong that they came out somewhere in the calendar shit year of 2017 that's",
            "start": 1729.44
        },
        {
            "text": "wrong with my prediction I was like on January 1st, 2018 go ahead and show me those games in your hands show me that I was wrong that they came out somewhere in the calendar shit year of 2017 that's not happening and even when inevitably there's going to be somebody who says at some point and this is Greg talking for the my prediction of Dreams and well not even Dreams probably but for Detroit where they will say 2017 it ain't happening it's not coming that's uh that is it for the new news that's short news yeah happens though yeah um that's weird that we usually never end that quickly you know it's rarity don't ask me for the drop either because they didn't the right one this week so I have no idea what's coming out God damn it I don't know if they're just not doing it anymore cuz this is like something has have had to have come out the last few weeks you'd assume oh there hasn't been enough the whole break there no there has there wasn't one when we recorded the last regular",
            "start": 1770.04
        },
        {
            "text": "this is like something has have had to have come out the last few weeks you'd assume oh there hasn't been enough the whole break there no there has there wasn't one when we recorded the last regular episode I don't think I'll go look but uh I'm not seeing anything they're not going to retire the drop it's just Christmas break for them too or holiday break for them where they take the two weeks off I'm assume like we do I assume they have two weeks off I'm searching Ryan Clements somewhere bouncing his baby on his knee Justin Miller do whatever the fuck he does Sid Shuman doing pull-ups non-stop for two weeks you're going to come back and be like he was tall and now he's jacked and then he's going to punch Justin in the face it seems like the last drop was on 1/6 there wasn't a drop on the 13th, the 20th, 27th, or the 3rd coming the new year and the holidays always hard to keep any kind of regularity well I'll tell you you know if you want these these random games to sell even worse than",
            "start": 1813.72
        },
        {
            "text": "13th, the 20th, 27th, or the 3rd coming the new year and the holidays always hard to keep any kind of regularity well I'll tell you you know if you want these these random games to sell even worse than they already are on PlayStation Network you might as well not tell anyone they exist at all if you're in the middle of the forest and a tree fall you know does the tree make any noise if no one's there to see it fall and hear it fall Greg well you're really you're like explaining you're really getting into the weed here yeah okay so if whatever fuck random ass shit's coming out that 5,000 people are downloading yeah well now 1,000 people are going to download them cuz not not even the drop is going to give them a wow so my hope is that everyone is uh just on breaking and stuff because I like reading the drop I get excited on Sundays I always go around noon to PlayStation Blog while I'm watching football and and uh see what they're doing yeah yeah and special congratulations to the",
            "start": 1855.76
        },
        {
            "text": "Houston Texans for making the playoffs again this year how's that make you feel uh maybe they'll actually score this year in the playoffs probably not uh but you know congratulations to them they couldn't have pulled a better team than the fucking Raiders who is who are going to start their third string quarterback and it not since 1966 since the Super Bowl era has a person started a quarterback started a playoff game without ever started a regular season game before until right now so there's your little piece of NFL knowledge for the day on PS there's little piece of NFL all right then you want to jump to topic of the show sure Dots, Dots, Dots, Dots, dot this one comes from username Regret hey Greg he puts in parenthesis ignore Colin he's sick of people waiting for you to say hi guy",
            "start": 1898.4
        },
        {
            "text": "you want to jump to topic of the show sure Dots, Dots, Dots, Dots, dot this one comes from username Regret hey Greg he puts in parenthesis ignore Colin he's sick of people waiting for you to say hi guy that's fine with me do either of you feel like 2016 wait wait who you just said ignore Colin and then you're and then you're asking the question to either of us I don't understand I mean you can take it up with username Regret over in the Kinda Funny forums where he left this KindaFunny.com/PSQ do either of you feel like 2016 has been a little disappointing on the AAA front or at least the major ones 2016 has felt like the year of underdogs to me more than anything some of my favorite games were ones that I never expected to like so much it's not often that a game like Inside could be doing so well in Game of the Year categories sure Journey did it but that's lightning in a bottle 2013 had GTA V and The Last of Us 2015 was all The Witcher 3, Fallout 4, and Metal Gear Solid V I can go on so I can't go",
            "start": 1938.88
        },
        {
            "text": "in Game of the Year categories, sure, Journey did it, but that's lightning in a bottle. 2013 had GTA V and Last of Us. 2015 was all Witcher 3, Fallout 4, and Metal Gear Solid V. I can go on, so I can't go on, so it's not unusual for smaller games to have some of the best. I know what that means. Uncharted 4 was shockingly somewhat of a disappointment for me. If you ignore Battlefield 1 and Overwatch and Titanfall, the year feels kind of empty. That is until you start looking at things under the radar. Some of the games people were really looking forward to were ones that already seemed obvious to me that were going to be disappointing, like The Division or No Man's Sky. Even if they aren't terrible games, I'll remember 2016 for games like Stories: Path of Destinies and all the tough choices and terrible endings I always get. I'll remember it for Furi and how I was, how it was the highest I ever made it on the leaderboard, 100th, because I just loved it so much in some smaller, more emotional games like this.",
            "start": 1983.32
        },
        {
            "text": "I always get. I'll remember it for Furi and how I was, how it was the highest I ever made it on the leaderboard, 100th, because I just loved it so much in some smaller, more emotional games like This War of Mine: The Little Ones and the insane co-op fun of Helldivers more than Uncharted 4. Do either of you feel this way too? I'd love to hear your response and for Colin to tell me how wrong I am about Uncharted 4. (Parenthesis: I'd give Uncharted 4 an 8.5 at least, anyways, just not a 10 like two and three.) Thanks, username Regret. Colin, was it a disappointing year for AAA and do your memories center more around indies? Uh, no. I, I think there, there's a lot of hyperbole around 2016 in many ways. Like, the games were bad, everything bad happened, a bunch of people died. Like, no one's ever died before. There, no, there's never been a time where bad games had come out. I just think 2016 really kind of got people into a, into a frenzy, in a tizzy. Everybody's up in a tizzy. And uh, I think that the hyperbole about",
            "start": 2023.44
        },
        {
            "text": "no, there's never been a time where bad games had come out. I just think 2016 really kind of got people into a, into a frenzy, in a tizzy. Everybody's up in a tizzy. And uh, I think that the hyperbole about 2016 in every way is, is a little ridiculous. Um, but uh, I will say that I think the exact opposite. Yet, as I said on the uh, when we did the Gamescast, and I went back and looked at all the games I played, which is a **** ton of games I played this year. Um, I was actually surprised by how many good games were, were released and how hard it was for me to wile that list down to 10. Um, so I don't necessarily agree, because I think that there were a lot of great AAA games. Doom was great, Uncharted was great, Battlefield was great, Call of Duty was great. People loved Titanfall. I mean, there was a lot of AAA games that people love. For me, and this is what I talk about, confused in the Gamescast, I bring this up and talk about it. I believe there is the fact that for obviously gaming and gaming taste is all",
            "start": 2065.6
        },
        {
            "text": "AAA games that people love. For me, and this is what I talk about, confused in the Gamescast, I bring this up and talk about it. I believe there is the fact that for obviously gaming and gaming taste is all subjective. And for me, like I said in the show, it was an underwhelming, quote unquote, year, or it, AAA wasn't the main focus. I, I'm with him where Uncharted, I'm sorry, for 2015, I felt like getting my top 10 down list down was hard. I felt for 2016, when I was get, getting up, I, I totally, I had like three or four overhangs and then honorable mentions. But like 2015 felt like I had a list of 17 that all deserve something and I couldn't possibly do it. And I think that's because, similar to I think how he's bringing up here, I'm not a shooter guy, right? And so I, I liked Titanfall, I appreciate what it did, but okay. And Infinite Warfare was fun, all right. And Battlefield stories are really cool, but I'm not compelled and I'm not compelled to remember those. I'm not compelled to play them. I'm not compelled",
            "start": 2111.76
        },
        {
            "text": "but okay. And Infinite Warfare was fun, all right. And Battlefield stories are really cool, but I'm not compelled and I'm not compelled to remember those. I'm not compelled to play them. I'm not compelled to jump into it. So Uncharted 4 does stand out. And similar to what he's saying, for me, is the fact that I do think I have more smaller experiences standing, like Overcooked, right? Is my number two Game of the Year spoilers from my top 10 list that goes live on Wednesday on the Gamescast. You already spoiled your list because you put it on Giant Bomb two weeks ago. That's what I do. Can't help me. Giant Bomb wanted me in demand a little bit more than Kinda Funny, dude. Uh, but you know, that's the whole thing of just, there's, I think when you look at it, it's like I talk about, I think when I'm thinking about 2016, I'm thinking about Overcooked and Virginia and sparade and all this goofy ****, right? That not nor, normally would be in 2015 was **** Metal Gear. There was a AAA game that defined the year",
            "start": 2154.28
        },
        {
            "text": "2016. I'm thinking about Overcooked and Virginia and sparade and all this goofy ****, right? That not nor, normally would be in 2015 was **** Metal Gear. There was a AAA game that defined the year for me and I put the most hours into. I'll agree that having a mobile game on your list is goofy indeed. The, the uh, the thing that I found uh, so interesting about the list when I was making was that I had a really hard time cutting it down. And and that's why I had a lot of honorable mentions on my list because there were games where I was like, s, like just in head before I looked at everything, I'm like, surely Headlander is going to be on this list. Headlander, great Double Fine game, really, really unique Metroidvania. I really loved that game a lot. Uh, didn't make it. Uh, you know, uh, something like Job Simulator, which I think is a great VR game. And that's actually something I want to talk about too, but I'll get to that in a second. I thought for sure, I love Job Simulator. I think it was a really funny and",
            "start": 2187.72
        },
        {
            "text": "which I think is a great VR game. And that's actually something I want to talk about too, but I'll get to that in a second. I thought for sure, I love Job Simulator. I think it was a really funny and quirky and cute. Um, thought for sure it'd be on the list, didn't make it. Overcooked, I really liked a lot, thought it'd be on the list, didn't make it. Like there, there, there were, I thought that this was a great year. As I said on the list, like I played such an extraordinary amount of games this year that, um, and like I said, I actually feel like I played an excessive amount of games this year. I don't think you need to play 70 games or whatever and varying degrees. Um, I think that's absurd and I don't want to do that again. But, um, you know, it made it so that I had a nice little palette to choose from. The, the one thing that I thought was surprising was that I wanted to spend time with VR this holiday and I just didn't. I couldn't. Like I, I, it's so weird because I think it's such a great piece of technology and I",
            "start": 2228.32
        },
        {
            "text": "that I thought was surprising was that I wanted to spend time with VR this holiday and I just didn't. I couldn't. Like I, I, it's so weird because I think it's such a great piece of technology and I think the games are so fun. Um, that I played. It's just like I was looking at it, I'm like, I got to connect the box, the PS, then I got to like get the camera and set it up. Then I have to like recalibrate every five **** seconds. I only have an hour to play really before the next thing. So what's the point? They really have to figure that out. Like I, I'm, there are some, there are certain things that they're not going to be a, you got to have to calibrate your stuff and stuff, but just making it so, just making it easier. Here's the thing, do you think it also is just an issue of having a compelling title? There's a lot. I have so many. I have, you know, Robinson: The Journey and all these things lined up in my VR folder. I started doing on PS4, right? That I'm like, ah man, I, I, I want to play that at some point. I want to play that at",
            "start": 2266.12
        },
        {
            "text": "lot. I have so many. I have, you know, Robinson: The Journey and all these things lined up in my VR folder. I started doing on PS4, right? That I'm like, ah man, I, I, I want to play that at some point. I want to play that at some point, but it's not like I have to play like tonight. Gravity Rush, I can't **** wait. I'm so stoked to get, get back into that world, see that story and play those characters. But these other games, I'm like, oh cool, I'm going to look around and see a **** dinosaur and do this and that'll be cool for a little bit. But **** a dinosaur, I'll look around and see this **** dinosaur. If there, now if I can take that Move wand though, get it rock hard, do this and say, hey Kevin, come suck on this glow tip. By the way, I call all dinosaurs Kevin. That's not about you, you Kevin. Don't file a sexual harassment claim. That's not about you. I say, hey dinosaur Kevin Coo, come over here and suck my dick right in front of dinosaur fiance Paolo the dinosaur. Wow, that's very similar to, I mean, I can't help but that",
            "start": 2302.64
        },
        {
            "text": "claim that's not about you. I say, hey dinosaur Kevin Coo, come over here and suck my dick right in front of dinosaur fiance Paolo the dinosaur. Wow, that's very similar to, I mean, I can't help but that, that's just how my mind works. Yeah, I don't know. I just, I, I was, I was surprised by my reaction, like my guttural reaction being like, I just want to play a normal game. And and then just getting sucked in the Tomb Raider. I didn't intend on getting sucked in so long. I mean, I played that game for **** ever. It, it might even be more, it might even be more than 30. I mean, I just was enamored with it. Sure, it was really fun. But that's what I was trying to say before when I'm saying like that playing too many games by volume is, you know, because I was, you know, there's some games that were short that I beat. There were some games that I just didn't spend a lot of time with. And there were a lot of games I spent a lot of time with. And there were games that I beat. And all is like the Tomb Raider experience for me",
            "start": 2339.72
        },
        {
            "text": "were some games that I just didn't spend a lot of time with. And there were a lot of games I spent a lot of time with. And there were games that I beat. And all is like the Tomb Raider experience for me was like, this is the way I like to play games, really spending time with a game if it's necessary. And then that's why like, I think Far Cry Primal is going to be the next game and I go back to, wow, all right. Cause I restarted Tomb Raider. I got like five hours into Tomb Raider a while ago and then I restarted it from the beginning. And I think I'm probably in a similar, probably a little farther actually in, in, in Far Cry. Whatever happened with Hitman? You were get, you downlo, you were ready. Erin started playing. Yeah, Erin's, so is that what happens? She and you're just watching it? Yeah, I just watch it. I mean, it's fun. I, I don't, uh, I'll tell you like, tell me, but kind of just watching her play it and watch and booting it up a lot and the ecosystem that they've created, very",
            "start": 2377.96
        },
        {
            "text": "it. I mean, it's fun. I, I'm glad I tried it. I, I don't, uh, I'll tell you like, tell me, but kind of just watching her play it and watch and booting it up a lot and the ecosystem that they've created, very compelling. Um, uh, justification for why they do episodic content. They really do a nice job at IO Interactive of, um, like the uh, the, the Elusive Targets, whatever they call, Elusive Targets or whatever. It's a really cool idea. Like, like once they're gone, they're gone. That's it. Like, and it get, it keep, and you know that there's the completionist side of a gamer that feels like they need to log in and get these **** at all these maps. And I see, I see. I'm like, oh, I'm point out like, Elusive Target in Sapienza or whatever the **** it is. And and she's, you know, but she's so obsessed with just the, she's like, can't leave Paris. I have all the maps. I got them all. Yeah. And she just loves because she's like trying to get all the challenges and and level our character all the way up. And I'm like, all right. I'm like,",
            "start": 2407.68
        },
        {
            "text": "leave Paris. I have all the maps. I got them all. Yeah. And she just loves because she's like trying to get all the challenges and and level our character all the way up. And I'm like, all right. I'm like, there's some obtuse **** going on in this game right now. You get trying to, they have an old fashion show. You're trying to collapse lights on him. You just shoot him right in the **** face and be done with this. Yeah, no, it's a cool game. I have no intention of going back to it, but it's, but it's, uh, I'm glad I tried it. And I appreciate people giving me those recommendations. That was the thing about that game, Dex, that I put on Vita where I was like, when I first was reading about, looking at videos, and I was like, how did no one recommend me this game? No one. I never heard of this game in my life. And like, oh, that's why. Now we hop tracks there. I want to hop back to VR. I, what I, what I found interesting about you with VR is how, and I thought this is a, a problem, not in terms of you, but in terms of like,",
            "start": 2454.12
        },
        {
            "text": "oh, that's why. Now we hop tracks there. I want to hop back to VR. I, what I, what I found interesting about you with VR is how, and I thought this is a, a problem, not in terms of you, but in terms of like, when we talk about VR and what it means and its future and all stuff, is how excited you were still for EVE: Valkyrie, but still have never sat back down to do it since. Like, you talk about it being, that was your religious moment with it. That's the one that got you. And then we even like what you're saying, well, I don't want to set it up. I don't want to do this. How much time do I have for? Yeah, it's, it's, it's, it's also, you know, I'll tell, tell you with EVE: Valkyrie, tell me, um, it's a Persona 4 Golden kind of thing. And I'm already feeling it. Like, you're going to save that for the end. I just, we talked about, I think a few episodes ago, but but between the, the soft sales of VR overall, PSVR is the best selling unit, but and that they didn't reach their expectations. And it seems like some of that has to do with",
            "start": 2487.12
        },
        {
            "text": "think a few episodes ago, but but between the, the soft sales of VR overall, PSVR is the best selling unit, but and that they didn't reach their expectations. And it seems like some of that has to do with manufacturing issues and all that kind of stuff. I just wonder, is it all just going to fall apart? And if so, I would like to have something to play. My hope is that that doesn't happen. My, my, my feeling is that they won't let that happen. But it's one of those things where I look at it, I downloaded it. It's, it's just on my console. And and uh, I'm just like, you're there and I want you. Yeah, I want to be deep inside of you, EVE: Valkyrie. But, um, now's not the time. Now here's the next. You'll be fertile when I'm, when I get to you next. It'll be bare. There'll be no fruit left to bear. Here's what we need to talk about. We still have that second bed or second, third bedroom, third bedroom that to be Kinda Funny HQ, the studio. We could set up a standing PlayStation VR thing where all we'd ever have to do is go in",
            "start": 2526.72
        },
        {
            "text": "we still have that second bed or second, third bedroom, third bedroom that to be Kinda Funny HQ, the studio. We could set up a standing PlayStation VR thing where all we'd ever have to do is go in there, plug in our unit, plug in our own headset. We could do that. We could do that. We could do that. And then what would that, would eliminate everything. Then we could go in there, we **** around. We could do that. What's probably going to end up happening though, is uh, I'm buying a drum kit and uh, going to put it in that room. Okay, so but there's plenty of room. That room is more spacious than people give it a lot of credit for. The major problem, cause I, I heard through the grapevine that someone has a pretty nice kit sitting around that they just want to get rid of. Yeah, I think a five piece. And so I don't need a five piece, you know, I'm not, you know, I need, you know, maybe a high tom and a floor tom and a snare and a bass. I don't need the high tom and and and and and the low tom, you know, understand what I'm",
            "start": 2571.4
        },
        {
            "text": "need a five piece, you know, I'm not, you know, I need, you know, maybe a high tom and a floor tom and a snare and a bass. I don't need the high tom and and and and and the low tom, you know, understand what I'm saying? I don't need, you know, I don't need two bass drums. So whatever. Are you still going to soundproof this? Cause you once talked about that. So cause, so that's the next. We got, we got a man downstairs and our landlord upstairs. Care about the man downstairs. The man upstairs is who I care about now. The man downstairs doesn't care about us. Is hawking his loogies and doing whatever he does, throwing his garbage in our garbage can. Yeah, you know, I pay for that garbage. You know, it's like, you know, it's, I mean, he's just living in a coat closet down there. And I'm pretty sure he's on our electric bill anyway. So who cares? Yeah, yeah, I'm pretty sure he is too. So that's nice. Uh, but I want to look into, is it possible to soundproof the room? Like, is it possible to just make it so that no one hears anything going",
            "start": 2613.52
        },
        {
            "text": "who cares? Yeah, yeah, I'm pretty sure he is too. So that's nice. Uh, but I want to look into, is it possible to soundproof the room? Like, is it possible to just make it so that no one hears anything going on in that room? Because then it makes it a very tantalizing way to take you out eventually as well. Now the, the, what, what I'm more likely going to do is just play it by ear. I just want to have the kit and then maybe when, you know, the guy upstairs goes, goes on an errand or something like that, he's going, you know, I, I, I, I, I, uh, bang it out, go animal style. Um, so no, but that's, that's a fine idea with the VR. I mean, we have like 17 PS4s in the **** apartment. So might as well do something with them. But, um, it's possible. Yeah, I, I, I want to, uh, I'd like to get back to it. It's such an immersive experience. When I think about the games that I liked on it, you know, Super Hypercube was an awesome game. Uh, uh, even that, that Headmaster game was interesting. Like, there's other games on there. I'm like, this is",
            "start": 2649.64
        },
        {
            "text": "when I think about the games that I liked on it, you know, Super Hypercube was an awesome game. Uh, uh, even that, that Headmaster game was interesting. Like, there's other games on there. I'm like, this is cool. I just, uh, the semantics of it were a bigger turn off than, than I had anticipated once the luster wore off. You understand what I'm saying? Yeah. And then once you start getting pulled into other games, I mean, we're really only probably a month, five weeks away from getting Horizon, you know? Like, there's not, there's not, I wouldn't be surprised if Horizon went gold by the end of this month. Um, and then you're going to be going back into these games that require you to not use VR. And then we're going, and then the ball's rolling. Then all sorts of **** comes up. Yeah, you know, Wildlands and all, whatever. Wildlands got to hope that pans out. All right, good job, Colin. I didn't do anything, but thank you. No, you talked. You did a good job. That was a good conversation. Give me a handshake. We talked. We, we",
            "start": 2699.36
        },
        {
            "text": "Wildlands got to hope that pans out. All right, good job, Colin. I didn't do anything, but thank you. No, you talked. You did a good job. That was a good conversation. Give me a handshake. We talked. We, we talked good. We talked good. We, we talked real good. We talked good. Me, me talked good one day. What was it? What was it there? David Sedaris, Me Talk Pretty One Day. Yeah, me talk. Uh, tell me about what's happened in the trophy times. Well, I was looking at the trophies today. There's only actually, I was looking at them all break. And this might have to do with, um, this might have to, you, because I go on PSNProfiles and basically update it every day just to see what. And this might have to do with the fact that, um, uh, you know, there's no drop, there's no games coming out. A lot of the things being put up are, uh, Japanese games where, why? Oh, here we go. Mm, here we go. Okay, there we go. Mouse problems. So I mean, last we talked, I mean, like, there's just a lot of Japanese games and then there's a few games that no one cares",
            "start": 2740.28
        },
        {
            "text": "games where, why? Oh, here we go. Mm, here we go. Okay, there we go. Mouse problems. So I mean, last we talked, I mean, like, there's just a lot of Japanese games and then there's a few games that no one cares about that I don't want to talk about. There's one game on here that I'm not even sure what it is. And then there's another game on here that people were excited about. The game that people were excited about was Puyo Puyo Tetris. I've heard this. I've heard, why do we, why do we know about this? I think it came out of Japan a long time ago. Okay. I think it came out in Japan and on PS3 and Vita, yeah, in 2014. Never was here. And now it's coming to PS4. And so there's trophies live for that. And I will have you know that it has a platinum trophy now. Uh, 30 bronze, nine silver, three gold, and a platinum trophy for a Puyo Puyo Tetris. Um, but again, all about combos and scores and all that kind of thing. The other game that I don't know what this is, it's a Vita game. It's called The Longest Five Minutes. Okay. 50 bronze, two",
            "start": 2781.12
        },
        {
            "text": "Puyo Puyo Tetris. Um, but again, all about combos and scores and all that kind of thing. The other game that I don't know what this is, it's a Vita game. It's called The Longest Five Minutes. Okay. 50 bronze, two silver, two gold, and a platinum. Pixel art looks pretty good. You get different trophies for different endings. Uh, RPG level five, greet Chloe before departing. Blah, blah, blah. My theory about this game, not knowing anything about it, because it's all, R, it's all reaching levels and all sorts of things. Do you have only five minutes to play the game? That's what it sounds like. This is one of the great mysteries. It'll be answered soon. So when The Longest Five Minutes comes to PlayStation, by the way, I, maybe it's coming this week. We don't know. Ryan sleep at the wheel. Let me see. Yeah, what, what kind of excuse? You have another kid already, Ryan. Come on. What they call, what is it called? What do you call that when you have two kids in the same year? It's an Irish something. Irish twins. Is that what is Irish twins?",
            "start": 2826.16
        },
        {
            "text": "have another kid already, Ryan. Come on. What they call, what is it called? What do you call that when you have two kids in the same year? It's an Irish something. Irish twins. Is that what is Irish twins? No, I don't think that's right. Uh, anyway, uh, also I'll have you know that Danganronpa 3, I believe, comes out like this week or next week in Japan. Could be wrong about that. You going to import it? Stumble through it on our saying a word. What am I about? Andrew Goldfarb. Exactly. Um, what is it called? Is it, it's not everyone gets M. It's not Danganronpa 3. That's an an. It's definitely Irish twins. Yeah. Okay. Thank you. Thank you very much, Kevin Coo. Not the same as the dinosaurs that I **** that I call Kevin Coo, but they're different. In Time Machine VR, a hit PlayStation VR game, January 10th, it comes out in Japan. I'm very jealous. We'll get it later this year on PS4 and precious Vita. Um, so yeah, that's basically it going on for trophies. Nothing new popping. So that I, I, my assumption is, uh, nothing news really coming out",
            "start": 2872.8
        },
        {
            "text": "jealous. We'll get it later this year on PS4 and precious Vita. Um, so yeah, that's basically it going on for trophies. Nothing new popping. So that I, I, my assumption is, uh, nothing news really coming out anytime soon. All quiet on know because who knows what Ryan Clements is doing right now. God forbid. I mean, you, he has a wife. The baby has a mother. You take the baby. You give it to the mother. You **** update the blog. You just say, here's what's coming out this week, everybody. I didn't bother putting images in cause I got to go back to the baby. And it's New Year's or whatever. Kids never had any dedication. Uh, Lucid Dream rode in for trophy time, just like you can by going to kindafunny.com/psq and says, trophy time suggestion, give a shout out to a game with a great trophy list. You guys talk about becoming trophy consultants in order to help developers come up with well-rounded, comprehensive and balanced lists for their games. More info on that in 2017. And this is certainly an ingenious idea. I think it",
            "start": 2924.2
        },
        {
            "text": "consultants in order to help developers come up with well-rounded, comprehensive and balanced lists for their games. More info on that in 2017. And this is certainly an ingenious idea. I think it would help to highlight and identify games that you think have such a list, just in case the consultant thing doesn't pan out. I'd like to suggest that this week's shout out goes to Doom for not only being one of the best games this year, but for also having one of the best trophy lists I encountered in a game. Earning the Platinum involves exploring every inch of the game, utilizing all the upgrade systems and game modes that are introduced, and challenging yourself to complete all of the bonus tasks in each stage. Nothing feels tacked on, repetitive, grindy, or encumbering. Most importantly, the multiplayer trophies are easily acquired and there are no missable trophies. id Software nailed it. Thanks, guys. XOXO, Lucid Dream. I like that. We don't, I like celebrating things, Lucid Dream, and I'm glad you're",
            "start": 2969.72
        },
        {
            "text": "are easily acquired and there are no missable trophies. id Software nailed it. Thanks, guys. XOXO, Lucid Dream. I like that. We don't, I like celebrating things, Lucid Dream, and I'm glad you're doing that. We celebrate too much. Let's **** on everything. We're in, we're in the hyperbolic chamber. We're in the hyperbolic chamber. Kevin, is that right? Hyper hyperbolic chamber? Is that really time is slower? I'm going to look. I'm going, we, we really should have looked an hour ago. Oh, also, I circled, uh, when we were, so when I started talking about Hue, you started laughing and said, you tell me a story later. Then we went on an entire 50 minutes. You said something else that I wanted you to come back to, which reminded me to come back. Hyperbaric. Hyperbaric chamber. Okay, that he said hyperbaric, but we never, he's, but I like to live in the hyperbolic chamber. Well, I do. I definitely think Twitter is, I was going to say hyper hyperbolic chamber is Twitter. All right, what was your Hue story? That was, oh no, I",
            "start": 3013.36
        },
        {
            "text": "he's, but I like to live in the hyperbolic chamber. Well, I do. I definitely think Twitter is, I was going to say hyper hyperbolic chamber is Twitter. All right, what was your Hue story? That was, oh no, I just remember when I was interviewing them because it was, it's a game based on, you know, colors. And I remember being like, you know, this is when you thought you had, yeah, like, I got you. Like, so what if you're colorblind? Yeah, you know, and they're like, what if you're colorblind? Like, we have a color. I'm like, ah, ****. I, when I went through to try to figure out where I was in the, in, in the game, uh, I got to that final thing and I found my level and I was like, okay, cool. And I was like, wait, why does this guy have symbols all over everything? I like, oh, the colorblind mode. Right. When, when Colin got got, as they say, well, I was happy to hear, you know, because it reminds me of that the PSX talk we listened to about, uh, accessibility for gamers and gamers that are disabled in some way and can't play. Um, and then",
            "start": 3062.24
        },
        {
            "text": "say, well, I was happy to hear, you know, because it reminds me of that the PSX talk we listened to about, uh, accessibility for gamers and gamers that are disabled in some way and can't play. Um, and then obviously Naughty Dog tells that story about how someone couldn't beat Uncharted because of a button mashing thing and they needed to figure out and overcome that. Yeah, and I didn't realize that Uncharted 4 was like really one of the pioneering games or was it The Last of Us, one of Naughty Dog's games that was really pioneering in terms of like it has like disability options built in, baked in, like they from the get, you know, so people can play in, in a way that's best for them. I think that's great. Yeah, Colin, you for Reader Mail. Yes. All right, great. Thanks to Jericho, of course, for compiling this over on the Kinda Funny forums. You can leave your question over at KindaFunny.com/PSQ. The Q is for questions. Let's start with a little segment I'm calling Colin Take Him to School. Ice 7 writes in",
            "start": 3101.72
        },
        {
            "text": "over on the Kinda Funny forums. You can leave your question over at KindaFunny.com/PSQ. The Q is for questions. Let's start with a little segment I'm calling Colin Take Him to School. Ice 7 writes in and says, Growlin, Happy New Year. Hope your holiday breaks were great. So I'd like to start with the fact that this isn't an argument, but a genuine question I would like answered. How will the All Digital future really make games cheaper? I understand it cuts out the middleman of the stores, but as a gamer on a budget, I get most of my games after the launch window when prices get cut drastically. Yeah, I get that when The Last of Us Part II finally hit store shelves and I don't want to wait. All the digital systems would probably save me a few bucks. However, most of the time I don't need to be part of the conversation and I'll play what speaks to me when I want to. Amazon generally cuts game prices in half around three months after release, while just while the PlayStation Store still has them at full",
            "start": 3135.96
        },
        {
            "text": "the conversation and I'll play what speaks to me when I want to. Amazon generally cuts game prices in half around three months after release, while just while the PlayStation Store still has them at full price. Just trying to get some knowledge dropped on me by my boy Colin M. Colin Take Him to School. Well, if you were the Patreon subscriber on Kinda Funny Games, you would have seen the pilot episode, uh, one of the pilots that wrote If Colin Was Right that went up about this. Um, this argument takes a little bit of faith in the market of behaving like a market would behave. So the argument is, and markets always behave in predictable ways. So my argument is simply this: if the brick and mortar stores and middlemen didn't need to be played anymore and publishers had to release games in a, in a static market in which, uh, no one, uh, had to again fund the people that are trucking the games around, the people that are manufacturing the games around, GameStop has to get their cut, all these kinds of things,",
            "start": 3175.88
        },
        {
            "text": "market in which, uh, no one, uh, had to again fund the people that are trucking the games around, the people that are manufacturing the games around, GameStop has to get their cut, all these kinds of things, then the only people left to compete with are the other publishers on an even market. Right, right. And my argument is simply this: if EA and Ubisoft and Activision were all like, our games are still $60, and then Warner Bros. was like, our games are $50, still AAA, still all the time, people you expect went into this, it's still an awesome Superman game, it's still an awesome Lego Dimensions, it's whatever, but it's not as much as the other guys, then you, you think that EA is just going to sit there and be like, eat it, and just be like, well, we have to do something. And then, and then remember the last time this happened, of course, a real world example, Sega and EA was like, all right, cool, we'll buy the NFL license so you can't undercut us and put that game out for like, what was it, $25 bucks or",
            "start": 3221.72
        },
        {
            "text": "last time this happened, of course, a real world example, Sega and EA was like, all right, cool, we'll buy the NFL license so you can't undercut us and put that game out for like, what was it, $25 bucks or whatever. For people that don't know, back 10 years ago now, I think, uh, Sega Sports was still doing an NFL game, a pretty good NFL game. People would claim that the games were better than Madden. They were advancing it, first person mode, doing a whole bunch of crazy ****. And Madden was still being released at the time by EA for $50. And I want to say that Sega was releasing the NFL games for $20. That's what I think too. I remember being ridiculous, maybe $30. Uh, this was when the market was still open and the NFL didn't go fully with Madden. And it worked. The Sega games were more beloved. They sold at a higher volume and it ate into the market share. And, and market share means mind share. Then suddenly people are talking about, uh, well, what about, we don't have to worry about Madden. Madden is ubiquitous now",
            "start": 3263.8
        },
        {
            "text": "volume and it ate into the market share. And, and market share means mind share. Then suddenly people are talking about, uh, well, what about, we don't have to worry about Madden. Madden is ubiquitous now with, with NFL games, but it wasn't. So it reminds me of a way that PES, uh, Pro Evolution Soccer could possibly compete with FIFA on a pricing structure like that as well. The point I'm making, and I think it's, I, I, I personally think it's indisputable. Well, I've never heard of a good argument otherwise, is that if the publishers were forced to compete with each other on a digital marketplace in which Sony took its static cut and then they got the rest of the money, is that you would find a situation where this year's a good example. Battlefield 1 comes out. Call of Duty: Infinite Warfare comes out. What if Call of Duty: Infinite Warfare was $10 less than Battlefield? That's that suddenly, suddenly that's like, well, I might want to play Battlefield more. $10, like, that's a lot of money. And so keep in",
            "start": 3299.56
        },
        {
            "text": "if Call of Duty: Infinite Warfare was $10 less than Battlefield. That's that suddenly, suddenly that's like, well, I might want to play Battlefield more. $10, like, that's a lot of money. And so keep in mind, this is already established in this world. This, we're talking about where it isn't the stigma now, right? Where the Ratchet & Clank game comes out and it's cheaper and we're all like, is it a budget game? Is it going to be terrible? And no, it's awesome. We've had tons of success like that. People understand that this is a thing that isn't a big deal. And, and I also would argue, and I've argued in the video that some of you saw if you support us on Patreon, we appreciate you, that the argument can be made that games should be more expensive than $60 too. And I'd be interested to see what that looked like. What I mean by that is like, uh, you know, if, uh, The Witcher 3, which was by all accounts a fantastic game, beautiful game, well-made game, great voice acting, storytelling, lots to do, uh, very well executed and",
            "start": 3341.2
        },
        {
            "text": "I mean by that is like, uh, you know, if, uh, The Witcher 3, which was by all accounts a fantastic game, beautiful game, well-made game, great voice acting, storytelling, lots to do, uh, very well executed and put together all around. What if they, their next game, Cyberpunk, comes out in a few years? What if they're like, the game's $100? Would you like be aghast by that? Or would you be saying, huh, actually The Witcher 3 was so **** huge, it's all I played for six months. That, that game might have been worth more than $60. And I might have gotten the best of them. And now they're going to charge $100 for this game. I, I, I, I, I wonder how we settled on the $60 arbitrary AAA price point. Used to be for $50, but people also have to remember that in the cartridge era, game, new games went from $40 to $100. So games right now are cheaper than they've ever been when counting for inflation. But my argument is that by going to the digital infrastructure only and by removing the brick and mortar and the middleman and the",
            "start": 3376.6
        },
        {
            "text": "now are cheaper than they've ever been when counting for inflation. But my argument is that by going to the digital infrastructure only and by removing the brick and mortar and the middleman and the disc manufacturing and all the things that cost money, making the box cost money, making the discs cost money, all that kind of stuff, suddenly I do believe that publishers will be more likely to compete with each other. And it's not going to happen because they can. If they can keep the money that they're saving, they will. But when one of the publishers forces their hands, they will start competing and prices will fall. I'm telling you that that's what's going, that, that, that's what will happen. And I think that's going to happen. And all you have to do is look at Steam. Steam's a, a vibrant marketplace, although it's turning into a **** show, but it's a vibrant marketplace of competition. Um, and it's not yet a race to the bottom like iOS is. It, it is certainly turning into that, which is what I'm concerned",
            "start": 3417.92
        },
        {
            "text": "it's turning into a **** show, but it's a vibrant marketplace of competition. Um, and it's not yet a race to the bottom like iOS is. It, it is certainly turning into that, which is what I'm concerned and have been concerned about and we'll talk about in Colin's Right Soon about the race to the bottom on, on the digital marketplaces we actually care about, which is Xbox Live, obviously, and, and PSN. Um, so I just want you to consider that that, that's an economic reality. If the market behaves in a predictable, and the markets typically do behave in a predictable way. If, if, uh, let's, what's a good example? Like cars, like sedans, right? Like Toyota and, and Ford and Hyundai and all them release pretty comparable sedans at $30,000. And you look at them and they're like, well, uh, you know, Consumer Reports has pretty good things to say about all of them. And, uh, they all have a similar 100,000 mile warranty and all these kinds of things. What's the big differentiator? Oh, Ford just made their $5,000 cheaper. Yeah,",
            "start": 3452.48
        },
        {
            "text": "good things to say about all of them. And, uh, they all have a similar 100,000 mile warranty and all these kinds of things. What's the big differentiator? Oh, Ford just made their $5,000 cheaper. Yeah, there's the differentiator, you know? And suddenly all the other car manufacturers have to be like, well, we have to do something. And so they start competing. Prices always go down when there's competition. Always. It's the same argument that's being made about opening up state, uh, state lines to health insurance. Why health insurance prices in the United States are going so high. It's because if you're in California, you can't buy health insurance in New York, you know? Yeah, but if you could buy health insurance in New York or Alabama for $10 cheaper, then your insurance here suddenly becomes $20 cheaper because they know they're going to lose you as a customer. It's just the way the market works. Yep. So I hope that that explains it. I don't think you're right or wrong and I don't know if it's ever going to",
            "start": 3492.64
        },
        {
            "text": "they know they're going to lose you as a customer. It's just the way the market works. Yep. So I hope that that explains it. I don't think you're right or wrong and I don't know if it's ever going to happen. I am very heartened to hear data, end of the year data, saying that digital sales are increasing significantly on consoles, significantly. And that's great news. Colin, take a breath. You took him to school there. Hit the water bottle. There you go. Can't hit the showers yet, but I thankfully you did it. You lean back. I'll take care of this one from It's That Dave. He says, hey, Greg and Colin. Now, usually this is one we wouldn't do anymore, but we just kind of opened a little bit of Pandora's Box with this, so I'm letting it slide. I just listened to the 10 Best Vita Games episode and I've decided to take the plunge and buy a Vita. I know, **** my face for getting it so late. I don't know if we'd **** your face unless a dinosaur named Kevin Coo. He'll gladly **** your face if you're a Kevin Coo dinosaur man.",
            "start": 3525.24
        },
        {
            "text": "and buy a Vita. I know, **** my face for getting it so late. I don't know if we'd **** your face unless a dinosaur named Kevin Coo. He'll gladly **** your face if you're a Kevin Coo dinosaur man, while the other dinosaur, Paolo, watches. But now is it a good time for me? What? But now is a good time for me. And I had a few questions for you since some of the stuff online doesn't quite answer my questions. First, if I were to buy a Vita from Japan, 'cause I'm digging that blue one, is it region free? Yes, it is. My pink one is from Japan. I have no problems. Second, when I start my Vita and logging under my name, if I go to the PSN, will it show me all the games that may be cross-buy or stuff that I got off of PlayStation Plus over the years? Or do I have to search that manually? You wouldn't be on the PSN like you go to the store and find it right there. But when you go to your past purchases, your download lists, there you'll see all your Vita stuff. It is all mixed in with your other ****, which kind of sucks.",
            "start": 3560.12
        },
        {
            "text": "go to the store and find it right there. But when you go to your past purchases, your download lists, there you'll see all your Vita stuff. It is all mixed in with your other ****, which kind of sucks. But it should be sequential. You could also go through, well, but it's all, yeah, exactly. It's **** up. There's a little ellipses you press when you're in the store on the Vita. And then it brings up a download list. You go to that and then you hope, you hope and pray that, and, and if it's, if it's all out of order, is all **** up, go look, figure out what you actually want and what you've gone cross-buying, what you've done for PlayStation Plus and maybe search on the online portal and do it that way and just say downloaded your Vita from there. Uh, the help would be appreciated. You got it. Hope you had a good break. We did. Much love, Dave. We love you too, Dave. **** you, Dave. Whoa, Colin. No, we're turning over a new leaf. Oh, sorry. That, let's go here. We're going to now move into another reader response that was a",
            "start": 3601.08
        },
        {
            "text": "break. We did. Much love, Dave. We love you too, Dave. **** you, Dave. Whoa, Colin. No, we're turning over a new leaf. Oh, sorry. That, let's go here. We're going to now move into another reader response that was a response to our Top 10 Vita Episodes. We have another reader response from do that episod in do very well. You guys aren't really feeling the Vita episodes. Well, I think it's also just break numbers down better. **** be, uh, the third. JP wrote into KindaFunny.com/PSQ and says, hi, Colin and Greg. I know you guys did your The Last of Us Part II theories video a couple weeks ago, but I recently heard a theory about this story that I thought was interesting. There is reportedly, I take that with a grain of salt. I don't think anyone at Naughty Dog is reporting anything yet, going to be another LGBT character featured in the game. The theory was that the reason Ellie is so angry and going on a murder, murderer spree is because her girlfriend was captured and now she's on a mission to get her back. If this is the case,",
            "start": 3632.48
        },
        {
            "text": "in the game. The theory was that the reason Ellie is so angry and going on a murder, murderer spree is because her girlfriend was captured and now she's on a mission to get her back. If this is the case, it would be a hu, it would be huge. It means so much to so many LGBTQ gamers, parenthesis, gamers, but spelled gay, uh, to have such a huge game like The Last of Us Part II be about a queer story. My question is, how likely do you think this is? Do you think the gaming community is ready to have such a huge game be centered around a queer story? Thanks, John. Left Behind where already was this. I, and I think that would be a huge, not mistake, but it would be weird. Like, yeah, already did it. The, the reportedly, I'm like, nothing's reported. No one knows anything. Naughty Dog's great at keeping everything locked up. I don't believe that for a second. How likely do I think it is? I don't think it's likely. Not because of the gay part of it. Again, Left Behind dealt with this. It was awesome. Spoilers for Left Behind. **** you. You",
            "start": 3677.48
        },
        {
            "text": "believe that for a second. How likely do I think it is? I don't think it's likely. Not because of the gay part of it. Again, Left Behind dealt with this. It was awesome. Spoilers for Left Behind. **** you. You should have just supported him at the time. Uh, I think it's more the fact of that's, I think about how that game has to look. We have to, we already know Ellie. We already know Joel. We jump into this game. Time has passed. We have to get introduced to this character. We have to immediately be made to feel that we like her as much as Ellie likes her or loves her, however you want to describe it. And then she has to get ripped away from us and then we set out in the mission. I think the Joel angle's way more compelling and it's already done and the groundwork's laid and you already have what you feel about those characters from the first one. So if it is that The Last of Us Part II is hunting Joel's killers or going after somebody for Joel or something like that, that makes more sense to me than trying to shove all",
            "start": 3724.6
        },
        {
            "text": "characters from the first one. So if it is that The Last of Us Part II is hunting Joel's killers or going after somebody for Joel or something like that, that makes more sense to me than trying to shove all this back in. If Riley from Left Behind was still alive, then I think we'd have, have a different ball of wax where, okay, now we care about her and they got separated some other way. But that's not how that ended. I, I think, I mean, here's this, the long and the short of it is that I thought what Naughty Dog did with, with, uh, with Riley and with Ellie in Left Behind was awesome. And, and I, I made the argument at the time when I reviewed it that the game needed no combat. Like, and I was disappointed that there was any combat in at all. It really should have been about their, their story and exploring that mall and, and getting to know each other and getting to know that relationship that sets the scene for who Ellie is by the time she meets Joel. I think that when you, if you try to, you know, I think part of the way",
            "start": 3763.68
        },
        {
            "text": "getting to know each other and getting to know that relationship that sets the scene for who Ellie is by the time she meets Joel. I think that when you, if you try to, you know, I think part of the way we normalize, um, gay characters, the way we normalize having Muslim representation or whatever representation you don't see often in video games or in art, is to not pay it much heed. It shouldn't be part of the car, like the character's DNA. So we know Ellie's gay and that's great. But the reaction now about that should be like, who cares? You know, that's normalizing it. Beating it over the head again by being like, now it's about her, her, her conquest in an LGBTQ, you know, situation. It's like that comes off as pandering now. Like, you guys already did it so artfully. Ellie's gay. She's a gay character. Accept it or not. But it's not, it shouldn't define her and it shouldn't define the game. Exactly. You're, you're making the great point because the, the thing was, we all played through The Last of Us not",
            "start": 3795.28
        },
        {
            "text": "accept it or not, but it's not, it shouldn't define her and it shouldn't define the game. Exactly. You're, you're making the great point because the, the thing was, we all played through The Last of Us not knowing her sexuality, not caring, thinking she was amazing, having a relation, totally irrelevant. And then you play Left Behind. You get more context, more color to her character. But it doesn't suddenly make what you just did be like, oh. And if, if you do have a recoil and disgust that I was, oh my God, there was this gay character I fell in love with, then you have to stop and think that you fell in love with a gay character and that's okay. And the gay people are fine. Like, I'm with you in the fact of like, he, you know, the point of like, how likely do you think the gaming community is ready to have such a huge game be centered on a queer story? I think so. It already, already. Yeah, yeah. But I mean, it's not the same in the fact of, you know, how numbers drop off. Obviously, more people play The Last of Us than did",
            "start": 3845.56
        },
        {
            "text": "game be centered on a queer story? I think so. It already, already. Yeah, yeah. But I mean, it's not the same in the fact of, you know, how numbers drop off. Obviously, more people play The Last of Us than did Left Behind and stuff like that. Sure. But Gone Home, this, and I mean, this isn't new. Like, like the, the, this whole, this whole drama with Overwatch and Tracer character flying **** about the, you know, I really do feel that, you know, the acceptance of our gay and lesbian brothers out there, our transgender, uh, people and, and all these kinds of things, a lot of it comes from education, but then acceptance through normalization. Sure. Making it a big to-do, I think, is destructive towards the end goal. I think the way that Naughty Dog just did it in a very subversive kind of way, right? Very, I don't mean that in a negative way, but in a very, you don't really know. Like you saying, we didn't know Ellie was gay. We didn't care Ellie was gay, you know? And then she was. And then it gives you context and know those kinds of",
            "start": 3883.76
        },
        {
            "text": "way. But in a very, you don't really know. Like you saying, we didn't know Ellie was gay. We didn't care Ellie was gay, you know? And then she was. And then it gives you context and know those kinds of things. It's, there's clever storytelling ways that, so I just want people to be really wary about kind of, you know, um, there's a place for social justice and there's a place for inclusion. There's a place for diversity. You have to do it in a way that's clever that, you know, because then you have the reactionaries that are like, you're just shoving the **** down our throats instead of just saying like, hey, it's just a portion of who that character is. Your lesbianism or your, your homosexuality doesn't define you and it's not really relevant to this story, but that's who she is, which I assume is what's going on with Overwatch. I'm not a nerd, so I don't play that game. Here's, uh, she kissed a girl on a comic. Oh my God. Now just show me another picture of that fat ass and them tights. I don't mind that. That I got no",
            "start": 3935.4
        },
        {
            "text": "Overwatch. I'm not a nerd, so I don't play that game. Here's, uh, she kissed a girl on a comic. Oh my God. Now just show me another picture of that fat ass and them tights. I don't mind that. That I got no problem with this girl's ass being in my face the whole time. But as soon as I find out she's lesbian, like the lesbian thing, anyway, I don't understand. I mean, I don't know. They felt like based on that butt and what they had played in that game. Again, this is what I'm getting the scuttlebutt of. I'm not, I'm not from some **** dork out there. Oh man, look at me. I'm taking the **** calf skid on the thing. Oh, doing. I, they were all just mad. They all dreamed of being with her, of course. Oh, you dreamed of being the fictional cartoon character. That's interesting. Um, so to me, I feel like they will have a clever way to go about the story. I don't believe anything I hear about the game. I think everyone's full of **** about. I don't think Naughty Dog said one **** word to anyone that's leaked anything about the",
            "start": 3971.32
        },
        {
            "text": "way to go about the story I don't believe anything I hear about the game I think everyone's full of shit about I don't think Naughty Dog said one shit word to anyone that's leaked anything about the game so there's no reporting and there's no rumors about this game and by the way you're not going to be playing it for like three years boom also yeah maybe two years I don't remember what I predicted anymore two years 2017 now so you'll play it in 2019 uh but I am very excited um to hear more about it and I like the more subtle ways that that that things are getting uh more inclusive um but again people don't need to be beaten over the head with it because then that causes the negative reactions to it you have to do it in a way that normalizes it I think people have to realize that more and I think they did a nice job with that and Left Behind and we can expect that Naughty Dog will treat it with care and regardless yeah The Last of Us Part II is the main character is a lesbian like that you",
            "start": 4009.48
        },
        {
            "text": "think they did a nice job with that and Left Behind and we can expect that Naughty Dog will treat it with care and regardless yeah The Last of Us Part II is the main character is a lesbian like that you know what I mean like that's what the game is uh Master Bronze 1 wrote into KindaFunny.com/psq just like you can it says hi Greg and Colin Happy New Year my question is regarding first week sales of games Gravity Rush is on the horizon I loved Gravity Rush in my Vita even platinumed it I really want to buy this game to support it with its release date in January January I won't be able to play it for at least a month I was considering not buying it on first week since I won't be able to play it and maybe in the meantime I can catch a discount my question is are first week game sales as important as they used to be nowadays we hear a lot of developers saying they sell the majority of their games when there is a sale especially on Steam software is categorized as high initial fixed",
            "start": 4055.28
        },
        {
            "text": "important as they used to be nowadays we hear a lot of developers saying they sell the majority of their games when there is a sale especially on Steam software is categorized as high initial fixed cost and low marginal cost parenthesis low or no reproduction cost every sale must count even if it occurred years after the initial release just think how much money games like Fallout 3 or Skyrim parentheses now it has remastered versions earn developers after its release I really want to support Gravity Rush I really like the world they build up and want more out of this this IP even if I buy the game one month later it should have the same effect as buying it first week right love from Turkey and then he he does his name here and it's got a C with a little got a little leg on it down there underneath he says it's pronounced like Tunk T.K. and then he says P.S. it's an in it is Istanbul Greg so he's giving me all sorts of Turkey that kind of Turkey I think so he's love from a Turkey",
            "start": 4098.28
        },
        {
            "text": "underneath he says it's pronounced like Tunk T.K. and then he says P.S. it's an in it is Istanbul Greg so he's giving me all sorts of Turkey that kind of Turkey I think so he's love from a Turkey the Turkey in Istanbul I believe is what he's saying that's my best in Turkey we love the Turkeys here in the United States that's your best one huh what y that's that's the Turkey you're running through the wood you got go he like turned it off and threw out the podcast he's like I don't need this unsubscribe um oh so no I mean do first week sales still matter a lot they're where it is reported a lot uh I don't think you in the case of Gravity Rush I don't think you have to worry Gravity Rush 3 is not happening I don't think Gravity Rush is going to come out of the gate and set the world on fire and establish this as Kat as an indispensable PlayStation character Gravity Rush Gravity Rush is going to bomb now here's now here's the says the guy who's super excited to go home and",
            "start": 4142.4
        },
        {
            "text": "world on fire and establish this as Kat as an indispensable PlayStation character Gravity Rush Gravity Rush is going to bomb now here's now here's the says the guy who's super excited to go home and play it I'm not not throwing stones here I love Gravity Rush saying that the guy who is totally impartial to the series Gravity Rush was going to bomb now now here here is the interesting kind of thing about it Gravity Rush you want to you know you're going to be able to buy play it day one the most money is going to go to Sony if you buy it at $60 if you're buying it at discount everyone's getting less money so um if you want to support them like you know dollars to Donuts then you should buy it as soon as possible because Gravity Rush 2 is going to be on sale probably weeks after it comes out so and remember that it's not the number of units moved it's the the amount of profit made right Sony would rather sell 100,000 copies of Gravity Rush at $60 than 50,000 copies of Gravity",
            "start": 4189.44
        },
        {
            "text": "out so and remember that it's not the number of units moved it's the the amount of profit made right Sony would rather sell 100,000 copies of Gravity Rush at $60 than 50,000 copies of Gravity Rush at $0 they don't care about the volume they they want the money uh so so you have to keep those kinds of things in mind I feel a little bit bad for Sony because I think The Last Guardian's probably bombing too and and Gravity Rush 2 but but then we're going to get in the Horizon and Gran Turismo which are going to obviously do great um critically and commercially I assume so um but yeah and and and and there is some excitement for Gravity Rush my big disappointment with Gravity Rush is it jump systems it's just kind of I don't know it's just kind of lame you know I understand that they don't want to strand it on Vita but but here's my thing is that's the thing is like again I liked Gravity Rush when I reviewed it I'm excited for Gravity Rush tonight I I have missed that world and I",
            "start": 4225.84
        },
        {
            "text": "don't want to strand it on Vita but but here's my thing is that's the thing is like again I liked Gravity Rush when I reviewed it I'm excited for Gravity Rush tonight I I have missed that world and I do like those characters I feel like they're going to look at the numbers it does as Gravity Rush on PlayStation 4 and it's going to be like all right cool like not more people bought it but like what how what would have the ground swell of Vita supporters felt like if it just went there again hey we're not out of the AAA Vita game thing we you loved Gravity Rush here's a Gravity Rush 2 maybe and then six months from now oh put out the shit collectors whatever PS4 edition if you really wanted to but how many more copies are you going to sell that you wouldn't have sold on Vita Vita is the audience of us the shit super PlayStation nerds who already have our Vita and buy games in bulk and love love this thing and do all these things who love Gravity Rush based on the Vita game it's not like",
            "start": 4269.16
        },
        {
            "text": "of us the shit super PlayStation nerds who already have our Vita and buy games in bulk and love love this thing and do all these things who love Gravity Rush based on the Vita game it's not like I'm hearing people oh I never picked up that Gravity Rush on Vita but it's coming to PlayStation 4 now I'll check it out I'm sure it's going to happen it's it's a chicken in the egg thing dude that's why I understand the Gravity Rush Remastered came in the PS4 but I'm sure no one bought it similar to Tearaway Remastered which might as well have never happened at all so Tearaway was not remastered it was a different game all together oh I hope not because that was a waste of your time the uh but the thing about Gravity Rush is that I'm sure it's going to be a great game I'm sure people are going to love it but it is unfortunate that it is coming out in early January it is unfortunate that it sequel is not I don't want to say readily accessible but not within the mind share like this is a game that",
            "start": 4309.04
        },
        {
            "text": "it but it is unfortunate that it is coming out in early January it is unfortunate that it sequel is not I don't want to say readily accessible but not within the mind share like this is a game that maybe didn't need to happen at all but we'll see we'll see we'll see how it all goes gets the the uh Dying Light treatment and all people oh man there's nothing to play I would absolutely love that for that to happen I hope I'm totally wrong that it's going to bomb um but I'll be interested to see I'm super interested to see NPDs for December to see how Last Guardian did um as well although I don't know that Sony reports digital numbers so the numbers going to be but it'll be we would have numbers yeah it'll be I wouldn't be surprised it was on the chart at all let's see digitally how well it's sold on you know the breakdown of that chart on the blog if Ryan Clements ever comes back from vacation well he's having Irish children apparently so jeez God he's not even Irish I know that's that's",
            "start": 4344.08
        },
        {
            "text": "sold on you know the breakdown of that chart on the blog if Ryan Clements ever comes back from vacation well he's having Irish children apparently so jeez God he's not even Irish I know that's that's so weird about it I'm sorry what is that Irish's having Irish children no there's more more to the story that meets the eye Indian wife is Irish it's very bizarre but you see black people every once in a while having saw on Maury Povich they have a white child then there's a there's a thing where the woman thinks the guy is there someone's cheating on someone or whatever but it actually is just a pigmentation problem it happens it happens oh they do that you're not the father thing you are the father do you remember when Maury Povich had other things yeah I do and then suddenly what does Connie Chung think all this shit when he comes home and he's like this what happened on the show today we filmed seven of these today I believe Connie Chung was on the 30 for 30 about Tonya Harding she",
            "start": 4379.36
        },
        {
            "text": "Chung think all this shit when he comes home and he's like this what happened on the show today we filmed seven of these today I believe Connie Chung was on the 30 for 30 about Tonya Harding she was yeah yeah yeah could have been another Asian woman but I think it was I think it was sure you're right about that that checks out that checks out I think at least what I remember Colin final question yes comes from Zara N. he or she says hello has the PlayStation Vita been discontinued no it seems like every store in Sweden is out of stock and has been for a while with small amount of research I see a similar pattern across Europe seems stupid to discontinue a product when new games are still coming out on a regular basis can this just be a stock issue or Sony really really decommissioned it they definitely didn't need Commission in Japan so I I my assumption is that they're probably working through whatever stock they have here it's not discontinued um hard it is hard to find but they still",
            "start": 4425.8
        },
        {
            "text": "definitely didn't need Commission in Japan so I I my assumption is that they're probably working through whatever stock they have here it's not discontinued um hard it is hard to find but they still sell a ton of them in Japan so what I'm saying is that the unit's not discontinued and worse comes to worse you're just going to have to go buy it from Japan but I think what's really happening is yeah retailers aren't supplying it anymore like people hit us up all the time like the ghost town of like your Walmart or Target where there's nothing there and less a wi one game I think it's just that no one's reordering them because no one's coming in to buy them and they're bitching the wrong people and like isn't it Amazon you can't get it new anymore you can just get refurbished ones or people who something like that selling used ones or whatever I think it's just that fact of like these are businesses they're not going to keep everything on the shelves just to have it no one's coming in",
            "start": 4473.84
        },
        {
            "text": "who something like that selling used ones or whatever I think it's just that fact of like these are businesses they're not going to keep everything on the shelves just to have it no one's coming in asking for it and that's the trouble I will say that if you're interested in Vita uh really like interested in having one I would I would act soon yeah yes okay Colin you ready to meet your best friend for the week this is PS I Love This Best Friend XOXO it's where one of you beautiful bastards writes in gives us your PSN we read it then you get all sorts of fun friend requests and you get people to play games with and you get nice messages on the PSN everybody's all the best friends are happy and they have a great year and no one cries this one comes from Anth Anonymous hey Colin and Greg so last week someone posted their PSN hoping to get help with some trophies I figured it would be nice to do the opposite and offer help there will be a lot of new Guardians in Destiny needing help",
            "start": 4509.12
        },
        {
            "text": "week someone posted their PSN hoping to get help with some trophies I figured it would be nice to do the opposite and offer help there will be a lot of new Guardians in Destiny needing help with this game and it can be very overwhelming at the start I've got hundreds of hours logged if anyone needs anything Destiny related parentheses or any other game for that matter let me know my PSN name is Anth Anonymous that's A.N.T.H. Anonymous all one word P.S. my fiance couldn't find me a PSVR for Christmas so she brought me an electronic drum kit instead I figured you want to know that timely as we talk about a VR room or electronic kits now don't be all poopoo in it you almost you always talk about maybe getting that for the house I know but like they're just not right I understand that but you're in San Francisco you have neighbors there's a lot not right here actually yeah it's true that's true that's a good point oh yeah I have neighbors too that's true Reaper Wolf 91 has this week's",
            "start": 4553.36
        },
        {
            "text": "you're in San Francisco you have neighbors there's a lot not right here actually yeah it's true that's true that's a good point oh yeah I have neighbors too that's true Reaper Wolf 91 has this week's forgotten PlayStation game he or she writes in and says hey Colin and Greg long time first time I recently got a perfectly legal PlayStation 1 emulator on my cell phone and I may or may not have downloaded a few ROMs for gaming on the go if hypothetically I got some ROMs I would get some of my favorite games that I had for my physical PS1 back in the day for the same reason I recently may have reconnected with the game I'd like to suggest for forgotten game of the week Tiny Tank: Up Your Arsenal was a game released by Sony Interactive Entertainment and developed by Appaloosa Interactive and and now parenthesis which I haven't heard of since back in 1999 it was right around the time Jennifer Lopez was waiting for that night the game was funny and surprisingly easy to pick",
            "start": 4596.32
        },
        {
            "text": "now parenthesis which I haven't heard of since back in 1999 it was right around the time Jennifer Lopez was waiting for that night the game was funny and surprisingly easy to pick up it was about a yellow little battle tank with the spirit of a Rottweiler trying to stop the main villain from removing the Earth's atmosphere so it was more suitable for a new machine overlords I especially enjoyed teaching the mechanics of the game to my younger brother back in 1999 and challenging him in the multiplayer for hours on end the little yellow tank had a ton of great and hilarious quips which I still use to this day unfortunately I've never met another person who remembers or even knows about the game have either of you played this forgotten game if so thoughts Reaper Wolf says thank you P.S. I love you guys long time because your podcasts are long you see have you played Tiny Tank: Up Your Arsenal uh no I haven't me neither never even heard of it it could be a madeup game for",
            "start": 4638.36
        },
        {
            "text": "thank you P.S. I love you guys long time because your podcasts are long you see have you played Tiny Tank: Up Your Arsenal uh no I haven't me neither never even heard of it it could be a madeup game for all I know sure probably I mean I Wikipedia'd him usually didn't this week but some I assume he's not that smart to write in I mean he's Reaper Wolf could be smart could be smart man Tiny Tank: Up Your Arsenal maybe it's like a current game and he does it and then people buy it and then he makes a million dollars you got us shit nailed us let's check in with the PSN's worst name of the week as you know ladies and gentlemen you can't change your PSN name because Shuhei Yoshida hates you so what you do is you go to the Kinda Funny Forums over at KindaFunny.com/forums you go to the PSN's worst name of the week list you submit yours and we read it on the air now I think I'm do another one where I'm bending the rules a bit with this one but here we go this one comes from Charb Tronic that's not",
            "start": 4681.32
        },
        {
            "text": "of the week list you submit yours and we read it on the air now I think I'm do another one where I'm bending the rules a bit with this one but here we go this one comes from Charb Tronic that's not his PSN name that's just a bad Kinda Funny Forum name that he chose for some reason hey Colin and Greg first time long time so I just started a new job the other day and I was talking about video games with the guy who sits next to me and he told me the story of how he got his current PSN name when the PS3 came out long ago he bought one early and created his initial account he mostly played Call of Duty online at the time never had an issue with it couple years later his name was reported after playing the game a game of MLB The Show and his account was locked out he had a call PlayStation support to fix it the co the call support asked what his name was and he responded Vag Punisher all one word Vag Punisher he loved having this name he recalls hearing his friends girlfriends on the mic",
            "start": 4722.6
        },
        {
            "text": "to fix it the co the call support asked what his name was and he responded Vag Punisher all one word Vag Punisher he loved having this name he recalls hearing his friends girlfriends on the mic asking who's the Vag Punisher and he would respond yeah let her and all her friends know support forced him to change his account name and not knowing that he could change it again on his own he came up with a generic name Colin might like this one Patriots4 with she now regrets cheesing please Sony let us change our names thanks guys keep Punisher that's a good one Charb Tronic I like that it's like a double whammy 'cause Vag Punisher funny and stupid but dumb and then he gets Patriots4_ that's what he got you're a big Patriots fan aren't you they're going to lose are they yes in the divisional round okay to the Chiefs oh okay good if you didn't know ladies and gentlemen this has been PS I Love You XOXO it is KindaFunny.com PlayStation podcast it is the number one PlayStation",
            "start": 4764.76
        },
        {
            "text": "divisional round okay to the Chiefs oh okay good if you didn't know ladies and gentlemen this has been PS I Love You XOXO it is KindaFunny.com PlayStation podcast it is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. Pacific Time rain or shine on youtube.com/KindaFunnyGames and podcast services around the globe remember if you ever go to your podcast service around the globe it's say like 9:15 a.m. Pacific Time and it's not up it might be 'cause I'm on vacation and you should tweet me like the one guy did and then I immediately published it and it was great but you know sometimes it's just no I can't auto you can't auto publish on SoundCloud really annoying really annoying every episode of PS I Love You XOXO ends in a song in a segment we call Singing to Shuhei this is where one of you talented shit goes to KindaFunny.com/PSM and you give me your MP3 so I can play at the end of our MP3 you give me your YouTube link so I can annotate to",
            "start": 4816.72
        },
        {
            "text": "Singing to Shuhei this is where one of you talented shit goes to KindaFunny.com/PSM and you give me your MP3 so I can play at the end of our MP3 you give me your YouTube link so I can annotate to your YouTube video at the end of our YouTube video this one comes from Greg says hi Greg here he has two G's in his name though so it's not going to be too confusing long time first time a lot of long time first time today my best friend Nevin Michael sadly I know and I write music both of us play guitar but he is The Mastermind audio engineer who plays lead guitar in addition to programming drums bass synths etc. here is a track from years ago called Interstellar on the long gestating but finally upcoming 2017 album you can find a handful of other tracks on SoundCloud at Nevin Michael Nevin Michael now here's where I usually spell it out because there's some funny spellings but here's where you shit up Greg with G's I need your MP3 and YouTube video your MP3 I can",
            "start": 4867.48
        },
        {
            "text": "Nevin Michael now here's where I usually spell it out because there's some funny spellings but here's where you shit up Greg with G's I need your MP3 and YouTube video your MP3 I can download you didn't give me an MP3 I can download you just link me your SoundCloud that has no download button or anything some of you guys give me the the SoundCloud link and I go there and you want my money I usually give it to you but I'm saying saying guys it'd be easy if I could just download them if I could just click a download button so if you want to find out where the song is SoundCloud Nevin Michael one of those words is spelled funny they smell funny too I'm sure like the dinosaurs I shit named Kevin Coello in in Time Machine VR this is probably more up Colin's alley is where a metal djent band is the D supposed to be there is that a okay what does that mean okay but don't fret no pun intended you might enjoy it too P.S. I work with Brian Altano's sister's",
            "start": 4917.64
        },
        {
            "text": "boyfriend and he can vouch that I wear Kinda Funny gear at least four out of five days a week while my co-workers constantly ask what's a smiley face I know who this guy is you know this Greg with G's I know the Greg with G's okay yes not personally but I've heard of him okay ladies and gentlemen here is Nevin Michael that's the SoundCloud and his friend Greg with two G's who don't understand how to let you download things off SoundCloud until next time it's been our pleasure to serve you",
            "start": 4962.56
        }
    ]
}