{
    "id": 2324,
    "video_id": "QGXiwg--jkA",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Raymond (Nintendo)"
    ],
    "title": "Let's Play Super Bomberman R on Nintendo Switch - Kinda Funny Plays",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484941954,
    "duration": 549,
    "transcript_chunks": [
        {
            "text": "What's up guys? I'm from Kinda Funny and this is Raymond from Nintendo. So check this out, we're about to play Super Bomberman R. Super stoked about this one. Let's get right into it. Going to the Battle Mode. Yes. All right, let's go multiplayer battle. Boom. You all right, so for the sake of speed, let's go to the one set. Uh, you can have up to eight players as you see right there, pretty awesome. Uh, everything down here is pretty similar stuff where you have the Revenge Cards. Uh, special abilities aren't available in the current demo or sorry, the current version we're playing right now, so don't worry about that. Okay, let's go to next screen. All right, now we can pick our stage. Did you feel free to pick which one you want, man? Let's see. I mean, let's just go, let's keep it simple, right? All right, let's go. Yeah, that one's good. Is that not the simple one? Not really the most simple one though, but it's fine. Don't worry about it. F yeah, yeah, character obviously got to go Blue. I'm going to go Black one. He's cool. So",
            "start": 0.16
        },
        {
            "text": "one's good. Is that not the simple one? Not really the most simple one though, but it's fine. Don't worry about it. F yeah, yeah, character obviously got to go Blue. I'm going to go Black one. He's cool. So, uh, in the game you actually buy certain accessories. So I'm going to wear the hat because I got to wear hat. Got got it. I'm I'll go Shell, Dark Shell. Yeah, nice, nice, nice. All right, so here you can turn off the computer and turn it on. So if you want to turn off, just hit to the left. You'll turn it on. What you let's get some yeah, some calls. Sure, sure. We'll show you the the Revenge Cards actually. It'd be cool. So this game playable with the Pro Controller on the tablet itself, with the Joy-Cons, all that stuff. Yep, really, really great 'cause the controls are pretty simple. It's just move, drop down. Yeah, simple. Don't can you play with just a Joy-Con? Uh, you can, but uh, you won't be able to like uh, use multiplayer unless you have the Joy-Cons attached to it and 'cause it's a shared screen. Yeah, but you can't play",
            "start": 38.04
        },
        {
            "text": "don't can you play with just a Joy-Con? Uh, you can, but uh, you won't be able to like uh, use multiplayer unless you have the Joy-Cons attached to it and 'cause it's a shared screen. Yeah, but you can't play co-op together, which is awesome. So if you do want to play Bomberman on the go with people, you can. Uh-huh. You can just use it use from straight from the the Switch. All right, so I have the ability to oh, why is that guy flying? I don't going oh, I got caught. Yeah, man. So now what you can do, you can put uh, try to explode someone. Now you get someone while you're in the Revenge. You guys should come back in. Oh, oh no, no, no. Okay. Oh no, chase you down. I know, right? I'm wanted. No. All right, beat by a machine. Hey, man, it'll happen. It'll happen. All right, nice. One life. Okay, one life. Yeah, yeah, we can do it again. Play again. The cool thing is that every character that wins has their own personal like exit. Yeah, yeah, that's pretty cool. Gives some player and there's a Story Mode. Yes, 50 levels. Yeah, it's",
            "start": 84.24
        },
        {
            "text": "do it again. Play again. The cool thing is that every character that wins has their own personal like exit. Yeah, yeah, that's pretty cool. Gives some player and there's a Story Mode. Yes, 50 levels. Yeah, it's awesome. Bosses. It's really fun. Is there online? Uh, there should be an online feature. Yes, to play against the people. Yeah, cool. All right, beginning all calm and tranquil. Yeah, I know, right? No, I didn't do anything. That was a bad move. That was a real bad move. All right, all right. I was getting power up hungry. Do it again. All right, it's party time. I know, right? Let's do this. All right, for one second, I'm going to up the ante. All right, what's going on? We can take him down. Yeah, I've got this limited edition. Nobody in this room won. Okay, if I win, I get the Nintendo Switch hat. Can I do it? Can you do it? Not if you get blown up there. Oh, oh, man. We'll see. You're not only fighting me, you're okay. Well, you won as I said that. Oh no. Yeah, guess what? The hat that up, Switch that up, son. Nice. I'm the coolest person",
            "start": 142.48
        },
        {
            "text": "if you get blown up there. Oh, oh, man. We'll see. You're not only fighting me, you're okay. Well, you won as I said that. Oh no. Yeah, guess what? The hat that up, Switch that up, son. Nice. I'm the coolest person here now. Precious. I love it. I love it. All right, nice, nice. Now let's let's do more. Yeah, yeah. Can't get enough Bomberman, man. Real life's fun. People just walk up to you and give you things. All right, let's see. All righty, get in this. I got double bombs now. This you me now on the computers. So let's see. Got the Boxing Glove now. Oh, Lord, this game is really intense. Yeah, it's crazy. Imagine with eight people. I know. Good Lord. Get that crazy. It's ridiculous. Oh no, so slow now. There we go. Oh, man. Oh, I can't kick it yet. I thought I got the kick power up. All righty. Oh, now you can't put down a bomb. Why? Because you got the Skull. Oh, I thought it was a good thing. No, no, no. Skull. Oh no, was yes, by default. No. All right, we'll do three more rounds. All right, two out of three wins the champ. All right, I mean",
            "start": 235.76
        },
        {
            "text": "because you got the Skull. Oh, I thought it was a good thing. No, no, no. Skull. Oh no, was yes, by default. No. All right, we'll do three more rounds. All right, two out of three wins the champ. All right, I mean, you have the hat. You I do have the hat, so I I am already the champion, but we'll see how this goes. Yeah, a strategic advantage over there. Yeah, you're getting power from the Switch. Power from the Switch. Yeah. Is there a launch window for this? It has to be uh, launched with the Switch actually. Launch day, son. Yeah, they won, they won. Those computers are dumb. So is the Skull the only thing you don't want to touch? Yeah, but I mean, it's also good to get the Skull sometimes. If you get the Skull, you can walk in someone and give it to them. So depending on the situation, you actually might want to do that. So you need to switch up your strategy exactly. Got to be on the fly. Oh no. Okay. Oh, I almost killed myself again. Oh no, I have the Punch. No, no. So that's one on the hat. Oh, man, this is why they",
            "start": 343.32
        },
        {
            "text": "so you need to switch up your strategy exactly. Got to be on the fly. Oh no. Okay. Oh, I almost killed myself again. Oh no, I have the Punch. No, no. So that's one on the hat. Oh, man, this is why they don't let us do Let's Plays in places. I get really emotional. All right, one more. Let's see. You have one. You could you can take it here. I can. Let's see. All righty, let's get in it. Boom. The buildup got wheels, son. My one. Oh, oh, you know, go go for it. It's fine. No. Oh my. Oh, wait, no. Oh my God, they go so far now. Yeah, man. High octane explosions. Oh, the pitfalls. Yo, the long game. That was good. Sorry. That was good. Sorry. He got me. Yeah, yeah. High bombing. Yeah, it's fun though, man. It's good. Congrats, Raymond. Yes, yes. Congrats to you. You bested me this time, but I still got my hat, ladies and gentlemen. Super Bomberman R will be launching alongside the Nintendo Switch on March 3rd, 2017. I'm stoked about it. Definitely seems like a one more match type of game. Speaking of that, I'm going to get into that one more match.",
            "start": 407.52
        },
        {
            "text": "will be launching alongside the Nintendo Switch on March 3rd, 2017. I'm stoked about it. Definitely seems like a one more match type of game. Speaking of that, I'm going to get into that one more match. We'll see you soon.",
            "start": 536.96
        }
    ]
}