{
  "id": 2355,
  "video_id": "qgZhtSTeoSE",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "What's So Great About Horizon, Fallout, and Open Worlds? - PS I Love You XOXO Ep. 72",
  "description": "Greg's played Horizon Zero Dawn, but a viewer wants to know what he's missing by not playing open worlds, period. (Released 01.31.17)\n\nThank you to our sponsor, ProFlowers.com. Go to http://www.ProFlowers.com and use the code xoxo to support the show and get two dozen roses with a FREE glass vase for $29.99 plus shipping and handling.\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=k-nVnR_x3X4\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
  "published_at": 1485882002,
  "duration": 5580,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to PS I Love You XOXO episode 7. I'm one of your hosts Greg Miller alongside the last son of Long Island Colin Morardi. Might be. You're going underwater. So how much time they got? I don't know. Who cares? You got out. **** him. How you doing Call? I'm fine. How are you? Good. Acting V shirt looking on point today. Thanks. No problem. What have you been playing? Tales of Berseria. Still are you now you have nothing distracting you? You're solely focused on it. Yeah, I'm 31 and hours 31 hours and change into the game. Uh, I think it's great. Um, yeah, it's a little repetitive, but all these games are story is interesting. Nothing new to really report. Same old same old thing from the Games Cast and PS I Love You last week. Gotcha. Uh, but I enjoy it. I think it's I think it's got its own problems, but I I quite see it all the way through. Yeah, I think so. Come this far. Yeah. Yeah. I mean, I I can't imagine I'm more than 15 hours away from",
      "start": 0.5
    },
    {
      "text": "it. I think it's I think it's got its own problems, but I I quite see it all the way through. Yeah, I think so. Come this far. Yeah. Yeah. I mean, I I can't imagine I'm more than 15 hours away from the end. So, Gotcha. Um, yeah, it's fun. It's a good game. JRPG fans, Tales fans, obviously a lot to like there. It's not for anyone else, so I wouldn't I wouldn't touch it if you don't like role playing games. Um, yeah, that's basically basically it. Gotcha. What are you playing? Thank you. Yeah, it's I'm not interviewing you. We're talking to each other. I know, but you could have just said I'm playing. I know, but I like it when you're engaged. Otherwise, it's just me talking at you and you talking to me. We need to We Now, what's with the water bottle? A very nice child. Someone who listens to one of these shows sent you a new bottle. You're still using this thing. And it already dripped on you. Give up on this PlayStation water bottle. Colin, I won't I won't do it. I can't do it. Can't",
      "start": 64.32
    },
    {
      "text": "to one of these shows sent you a new bottle. You're still using this thing. And it already dripped on you. Give up on this PlayStation water bottle. Colin, I won't I won't do it. I can't do it. Can't turn your back on it. I still Whenever this one gets lost or broken, I still got mine ready to go for you in the archives. Ready? Ready to break out. Never you. Still in the bag. Thank you. Waiting there for whenever you give up the ghost in this one. Appreciate that. Uh, Platinum The Division. Oh, congratulations. Kept playing. Yeah, I fell down that Division rabbit hole as people know last time. got I got out of survival pretty quick and started doing the rest of the world stuff and building up my gear score and man what a it's night and day how that game has changed from when we played it you know initially in terms of the reward structure in terms of technical problems same old thing why can't I see my friends online I know they're there what the **** going on how is this still",
      "start": 103.92
    },
    {
      "text": "it you know initially in terms of the reward structure in terms of technical problems same old thing why can't I see my friends online I know they're there what the **** going on how is this still happening probably another one where we just have too many friends and that's the problem um but in terms of being rewarding because that's always been the problem with me in like DC Universe Online or any of these games you have to get into right the hours you have to spend to get the best gear to get equipped to actually do the new content always seems so daunting that it just scares you off. Whereas with this one, you know, I mean, I what I put a hard weekend of playing it and, you know, doing long days on the weekend, but getting together with our our friends. Shout out to Rob from Naughty Dog for playing with me. Shout out to Unsexiest Comedian, one of the best friends out there, Cameron for playing with me as well. Uh, just running around either doing the missions I needed to do for",
      "start": 141.04
    },
    {
      "text": "Dog for playing with me. Shout out to Unsexiest Comedian, one of the best friends out there, Cameron for playing with me as well. Uh, just running around either doing the missions I needed to do for the trophies, uh, roaming the open world and finding bosses. They drop good loot and you get going. And it's back to what we were talking about, I think, on the Games Cast last time or maybe PS I Love You in terms of how you always say, you know, there are there can only be so many of these games, but the es and the flows where I jumped in, went really hard at it. If I want to keep playing survival, I could and do it with Fran. And from here on out, maybe I will, maybe I won't. But my character is back to top level, top tier, and now I can leave it and come back to it. Like I can go play other stuff now, not feel like I'm ignoring the Division, and it's going to bite me in the ass when the next big update comes or whatever. 1.6 and six is supposed to be coming soon. Uh, so I really like",
      "start": 173.6
    },
    {
      "text": "stuff now, not feel like I'm ignoring the Division, and it's going to bite me in the ass when the next big update comes or whatever. 1.6 and six is supposed to be coming soon. Uh, so I really like it. A lot of people have been asking all week while I was playing it if they should get back into it. If you like The Division, I totally think you should. Um, it's way easier to get the gear. It's way easier to get in there and just play by yourself and feel like you're making progress and and get obviously it's best when you get together with other people. And then last night, Colin went to Tim Getty's. You've heard of this kid. Went over to his house. Uh, now this was the problem, of course, is that I had already done all the missions. I had gotten the platinum down to one one trophy I needed for a division and it was uh use your special move or your special thing where you hit L1 and R1 at the same time and use your power move or whatever. I did not ever really use this I don't think",
      "start": 209.84
    },
    {
      "text": "for a division and it was uh use your special move or your special thing where you hit L1 and R1 at the same time and use your power move or whatever. I did not ever really use this I don't think when we were when I was originally playing the game. So I knew I had my work cut out for me and this thing takes about 10 minutes to recharge. I saw I saw conflicting reports online that if I got in there and shot people would recharge faster. Need to use it 100 times. So as soon as I jumped back in this past week with Fran and stuff, I've been starting to work on that one. I would not you know as much as I can. I still forget about it. Oh **** I should have done. So we get Friday night go through Saturday we play a bunch and Saturday night I get it down to the one trophy and I'm like **** So I just kept running other missions with friends and hitting one R1. I'm like **** it's still not happening though. So then I woke up sat Sunday didn't need I played a little bit. We jumped into",
      "start": 241.76
    },
    {
      "text": "So I just kept running other missions with friends and hitting one R1. I'm like **** it's still not happening though. So then I woke up sat Sunday didn't need I played a little bit. We jumped into this underground mode they've added or whatever. It's it's nice enough. I'm it's not enough for me to come back but I'm glad there's more content uh doing the you know R1L1. And then what I was like is well I got to clean up the house. I got to do some other stuff. So what I did is I just walked out of the safe house left it there put a timer on my phone. Every 10 minutes walk over there and hit L1 R1. Did that for a few hours while I clean up the kitchen clean up. And by the way we got a new new group of ants. I know they come in from a different place. I've just given up. I've waged war. I I went and bought a whole bunch of tarot traps. I have them out there. Let me tell you these **** walking around like they drinking paint can. They was all stump like they were all organized",
      "start": 276.08
    },
    {
      "text": "I I went and bought a whole bunch of tarot traps. I have them out there. Let me tell you these **** walking around like they drinking paint can. They was all stump like they were all organized in the beginning. Then they're just everywhere just like cuz they're just drunk off and they can't they're dying, but you know what I mean. I think I got them. I think I got them on the road. That's great. That's fantastic. uh kept over hitting the button blah blah blah. And so then it was like, \"All right, still haven't popped this **** trophy. Go into Tim's house to watch the Royal Rumble. I know what I'll do. Bring the Vita remote play it there because it's the same thing, right? I can still watch the Rumble. I can talk to people. I can eat the pizza, the wings, drink the beer.\" I do that. 5:00 I think it's 5:06 is the official time. Call it death in this trophy. Pop. Damn. There it was. Well, I pop in the back of the you know VA for the touchpad. And I was like, \"Yes, platinum",
      "start": 309.44
    },
    {
      "text": "that. 5:00 I think it's 5:06 is the official time. Call it death in this trophy. Pop. Damn. There it was. Well, I pop in the back of the you know VA for the touchpad. And I was like, \"Yes, platinum achieved. Awesome.\" Finish the Rumble. go home sit down on the couch. I'm like, \"What do I want to play now? I gotta I I'm going to Australia on Tuesday night.\" You know what I mean? This is quite the **** adventure you're bringing me out. I spin you a yarn. I spin you a yarn. Do I not? All right. Yeah. Keep going. People just want the facts. They want to jump to the conclusion here. They want to go back to podcasting. Here we go. Next. People like it. Uh, flip the page. Get home. Want to play something? It's 8:00. I'm like, \"Well, what do I want to play?\" And I'm like, \"Well, nothing's speaking to me right now.\" Not to mention I don't want to start something and then go to Australia on you know I I got to start thinking about VA games for Australia. Dang and Rob already in the list.",
      "start": 338.24
    },
    {
      "text": "to me right now.\" Not to mention I don't want to start something and then go to Australia on you know I I got to start thinking about VA games for Australia. Dang and Rob already in the list. We talked about that that spider game that I downloaded a long time ago and never did anything before. I got I got my plane ride planned. So what can I do tonight? Maybe tomorrow night. And you know I remembered it's time to fall off the wagon. I decided to trophy **** which I haven't done in a long time. Bought Coffin Dodgers. You remember this title? It's a cart racing game where death's chasing all the Yeah. Remember they they did it I think at PSX they showed a trailer for or whatever. uh put on two different put on two podcasts guys we **** listen to two episodes of that platinum trophy there you go from a cart racer not a great cart racer trophies huh you know but it's like well I just want to chip away at something what am I going to do you know the accomplishment you feel when you're",
      "start": 379.12
    },
    {
      "text": "you go from a cart racer not a great cart racer trophies huh you know but it's like well I just want to chip away at something what am I going to do you know the accomplishment you feel when you're just like all right knock this out I guess I mean I'm that would be a game I would add that wasn't even on my backlog in order I'm not getting I'm not doing I don't I don't play that game anymore I know you don't know I'm not this isn't me trying and I don't respect the game anymore you know I don't respect the game sure no I know that too yeah So that's your I mean I'm not going to tell you you can't do what you can't I know you're not going to tell me what be waste of time but I'm but I'm happy that you was I didn't feel like watching Nashville. I didn't feel like watching the couple flashes I have banked and I can put those on the plane as well. So what am I going to do? Watch some shitty movie watching another documentary I don't care about. You know what I mean? Like what am I what am",
      "start": 413.2
    },
    {
      "text": "I have banked and I can put those on the plane as well. So what am I going to do? Watch some shitty movie watching another documentary I don't care about. You know what I mean? Like what am I what am I going to do? You know what I'll do? I'll do Well, no. I already that was part of my cleaning thing was reading through all Well, I don't even need to talk to her, but going through and reading everything. Well, I I had quite the adventure on Sunday with all this protests and all these things going on. Educating myself, trying to figure out what the **** happening. Like, joint chiefs of staff, I've heard a lot about them. Let's go read about them. All right, cool. Now I'm caught up to speed on what these guys are. Cuz it's always they talk about the joint joint chiefs getting wiped out in every horror movie and every **** post-apocalyptic movie, right? So, what did you learn about the joint chiefs? Probably shouldn't have thrown them out of that media. Probably should have kept them",
      "start": 447.12
    },
    {
      "text": "every horror movie and every **** post-apocalyptic movie, right? So, what did you learn about the joint chiefs? Probably shouldn't have thrown them out of that media. Probably should have kept them around. Ladies and gentlemen, this is PS I Love You XOXO. It is kind offunny.com's PlayStation podcast. It is the number one PlayStation podcast on the internet because of your support. And it posts every Tuesday, rain or shine, at 9:00 a.m. Pacific time on YouTube.com/kindafunny games and podcast services around the globe. So, please subscribe to all of our different shows at kindafunny.com. Rate and share them on the iTunes and whatnotss and give out the links to your mom and Gro. Let them know this is where you got to go. Colin, two pieces of housekeeping before we jump in the show proper. What happened? You when you do this, something bad happened. What happened? Breaking news. Brooklyn's Barclay Center is dumping the Islanders. This is breaking news. All right. I've heard it. After",
      "start": 477.84
    },
    {
      "text": "What happened? You when you do this, something bad happened. What happened? Breaking news. Brooklyn's Barclay Center is dumping the Islanders. This is breaking news. All right. I've heard it. After two years and countless complaints, Brooklyn's Barkley Center has concluded it is no longer worth it to host the New York Islanders. The arena, which is already home to the NBA's Nets and one of the world's top grossing concert venues, would make more money without the National Hockey League team. According to people familiar with the facilities financials, Russian billionaire Muel Proarov, who owns the building and the Nets, has since November been seeking an investor to take a stake in both. As of earlier this month, a financial production shared with potential investors showed the Islanders won't contribute any revenue after the 01819 season. A signal the team won't play there that people said they're going back to Nassau Coliseum. I hope so. My my my theory is that that's that's",
      "start": 519.2
    },
    {
      "text": "won't contribute any revenue after the 01819 season. A signal the team won't play there that people said they're going back to Nassau Coliseum. I hope so. My my my theory is that that's that's possible uh because the new owners want to bring them back to Long Island. But the uh the Will Bombs who own the Mets offered money and land in Queens to build them over. This is Mike Wilbomb. Mike Wilbomb. Exactly. No, like No, like No, like the family that lost all their money to birdie maid off, but still somehow own the Mets. Okay. How do you feel about all this then? You knew this was coming, but here it seems like the first official confirmation. What the **** I'm sorry. You are the last son of Long Island. This hits you harder than anybody else. I just don't understand what what are they going to do. Well, it doesn't matter. Whatever. They're going to Nassau. Two pieces of housekeeping, ladies and gentlemen, before we jump into the show. Remember that this weekend Tim and I are in",
      "start": 553.04
    },
    {
      "text": "going to do. Well, it doesn't matter. Whatever. They're going to Nassau. Two pieces of housekeeping, ladies and gentlemen, before we jump into the show. Remember that this weekend Tim and I are in Sydney. That's right, Australia. So, if you're there, go to RTX. I have a Kajjima interview on Saturday the 4th. And then there's a Kind of Funny panel on Sunday the 5th. Then remember, of course, if you are in Boston or going to PAX East, Kind of Funny has a panel Friday the 10th of March at 8:30 p.m. Colin, let's begin the show with what is and forever will be Roper Report. Time for some singular possessive news. I'm trying to look for information on the Islanders here. An Islanders baker's dozen. There are seven items on the list. Number one, Square Enix and Marvel have announced a major collaboration, a multi-game partnership in quotes, between the prolific video game publisher and developer and the storyried comic book company. The partnership will begin with an Avengers themed video",
      "start": 598.24
    },
    {
      "text": "a multi-game partnership in quotes, between the prolific video game publisher and developer and the storyried comic book company. The partnership will begin with an Avengers themed video game under co-development at Crystal Dynamics and Idos Montreal with a release plan in 018. The description for the brief reveal trailer on YouTube reads quote \"The Avengers Project is being designed for gamers worldwide and will be packed with all the characters, environments, and iconic moments that have thrilled longtime fans of the franchise. Featuring a completely original story, it will introduce a universe gamers can play in for years to come.\" Oo. End quote. So, that's all we know. Uh, most interesting thing about that obviously is that Marvel continues to go around and find good talent as opposed to signing kind of a blank check document like they did with Activision uh back in the day uh with you know the Spider-Man games and all this. And that speaks to I'm a bad gamer 57 who wrote",
      "start": 647.28
    },
    {
      "text": "to signing kind of a blank check document like they did with Activision uh back in the day uh with, you know, the Spider-Man games and all this. And that speaks to I'm a bad gamer 57 who wrote into kindafunny.com/psq just like you can. It says, \"Hello, Greg and Colin. I know like myself, tons of people are excited for Sony Spider-Man exclusive with Square Enix and Marvel reaching a multi-game deal. Do you think this finally opens up the wide world of comic books to video the video game industry? I know the obvious answer is yes, but more in depth, will this be a new wave of video games? We've had comic book games before that have always been the best. Haven't always been the best. And now we have a real opportunity at a vast universe. The movie industry has already found amazing success in the topic. Can a video game can the video game industry be as successful? Brian it remains to be seen, but I I definitely think so. I think that this is again the way Marvel I don't want to say",
      "start": 679.28
    },
    {
      "text": "in the topic. Can a video game can the video game industry be as successful? Brian it remains to be seen, but I I definitely think so. I think that this is again the way Marvel I don't want to say fixed but capitalized on movies. It seems like they're doing the same thing with games. It seems like they're taking and it's what I've been saying since their announcement that they were partnering with Telltale since that announcement that they're going over here now and doing the right thing. Uh, you know, Bill over there is in charge of it. He's got such a great head on his shoulders and he's got a vision for this which is so **** important in the way like what you're talking about is that yeah before Disney and all that Marvel had this standing agreement with Activision where they just **** out **** bad games and like in the beginning they start all right and then they just went down the **** You see it here. Let's get take and this is what I've been saying forever now. Let's",
      "start": 721.04
    },
    {
      "text": "**** out **** bad games and like in the beginning they start all right and then they just went down the **** You see it here. Let's get take and this is what I've been saying forever now. Let's take our AAA properties and team them up with AAA developers and see what happens. So, let's give Spider-Man to Insomniac. Yeah, let's make it a PlayStation exclusive. You have one console to worry about. Let's take the Avengers and give it to Square Enix. See what they're going to do. Crystal Dynamics teaming up with Idos Montreal and doing something in there. Uh there's a rumor today uh if you don't mind can you did you see this? the uh Jason Shrier confirmed that he had heard this from a source too but he didn't he wouldn't break it about the fact that uh Idos Montreal uh also working on a Guardians game even though there's the Telltale Guardians game as well. Um it's all super exciting because it is Marvel sitting there and going or Disney I would assume to some extent sitting",
      "start": 756.8
    },
    {
      "text": "on a Guardians game even though there's the Telltale Guardians game as well. Um it's all super exciting because it is Marvel sitting there and going or Disney I would assume to some extent sitting there and going, \"We have all these awesome things. We know that there's people out there who want to play all these amazing things. Let's get them together. Let's get them into the same you know page and not have people just **** stuff out. Let's make some great stuff.\" You see it? Uh, yeah, I see it here. I can confirm Tom Phillips EG's report. Idos is working on Guardians of the Galaxy future of DSX is Murky which we'll talk about in a minute. Uh, yeah. I mean, that's great. I I already feel like they are um over like this is actually almost too much now. Like like this is I'm not saying you know I mean it's very alarmist to say but why don't you just let them make one game at a time? Like I just don't understand what what is the rush? Part of the allure of the Batman games",
      "start": 794.0
    },
    {
      "text": "you know I mean it's very alarmist to say but why don't you just let them make one game at a time? Like I just don't understand what what is the rush? Part of the allure of the Batman games for instance which WB did. So well which was was there was time and there wasn't you know with the exception of maybe Black 8 or whatever. There wasn't a lot of spin-off you know kind of Yeah I know what you're talking about there. Yeah. I mean it remains to be seen. Of course we don't know what the schedule's going to look like for this. Obviously video games take so much time. I don't think necessarily we're going to see them on top of each other but we will soon know. You imagine what I I would imagine Telltale Guardians first Insomniac Spider-Man next uh and then Avengers since they've announced that now. And then somewhere out there this rumored one from Idos for Guardians or whatever. I think there's a lot of time. I don't think it's going to be right on top of each other.",
      "start": 832.48
    },
    {
      "text": "announced that now. And then somewhere out there this rumored one from Idos for Guardians or whatever. I think there's a lot of time. I don't think it's going to be right on top of each other. We'll see. We'll see. Hopefully DC can catch up. I mean if their movies are any indication they cannot. It's over. Number two the long-awaited new Prey game simply called Prey has a release date. Bethesda will publish the Arcane Studios developed RPG on PS4 and elsewhere in time for a May 5th release. The game surrounds protagonist Morgan Yu on board a space station called Talis 1. As many will remember the since canceled sequel to the original Prey Prey 2 was revealed in 011 under development at Human Head Studios and was eventually canceled in 014. Human Head Studios was the developer of the original Prey. Um I saw that game when it was revealed a long time ago and it no longer exists but uh this is the continuation. So this is technically Prey too. Uh no I don't want to see",
      "start": 871.76
    },
    {
      "text": "the original Prey. Um I saw that game when it was revealed a long time ago and it no longer exists but uh this is the continuation. So this is technically Prey too. Uh no I don't want to see it. Okay. Yours in no matter what? Uh yes. Good. Yeah Nick and I watched it. Super sci-fi looking and it gives me Dead Space vibes but not to the extent of Dead Space but it looks interesting. It looks cool. Nick's super excited for it. Yeah it looks great. There's just certain games like I don't want to know anything about Horizon. I don't want to know anything about there that's just certain mass effect. I'm good. Yeah. Number three Resident Evil 7's first pieces of DLC are far closer than you may have expected. On January 31st so today when you're listening to this the band footage volume pack will come to PlayStation 4 where it will be available exclusively for nearly a month. The DLC pack contains the bedroom where you'll need to figure out how to escape from a locked room",
      "start": 908.48
    },
    {
      "text": "volume pack will come to PlayStation 4 where it will be available exclusively for nearly a month. The DLC pack contains the bedroom where you'll need to figure out how to escape from a locked room nightmare which forces you to fend off enemy waves and Ethan Must Die quote \"A tough as nails mode separate from the tapes and story of the main game.\" End quote. This latter mode doesn't support PSVR. Band Footage Volume the second DLC pack will come to PS4 on February 14th a week before other platforms and contains um uh let's see oh contains 1 some sort of deadly gambling game. Daughters a look at the Baker family before the events of Resident Evil 7. And Jack's 55th birth birthday a quote race against the clock to feed Jack tons of food end quote in a comical expansion. Oh a comical expansion. This also doesn't support PSVR. Speaking of Resident Evil 7 the game has shipped .5 million copies so far bringing series sales to a fantastic 75 million sold. Resident Evil",
      "start": 940.64
    },
    {
      "text": "a comical expansion. This also doesn't support PSVR. Speaking of Resident Evil 7 the game has shipped .5 million copies so far bringing series sales to a fantastic 75 million sold. Resident Evil 5 is still the best selling Resident Evil game of all time at 7.1 million copies sold with Resident Evil 6 behind it in second place at 6.6 million units sold. So Resident Evil 7 is trending lower than five and six and its stock price has taken a uh and I'm talking about Capcoms has taken a beating as a result. The good news nearly one in 10 players of Resident Evil 7 have or are playing the game with VR according to data from Resident Evil.net. That's very nice. So we have a whole bunch of VR questions for later and reader mail but right now Resident Evil one comes from Bado who says \"Hey Colin and Greg. With the Resident Evil franchise bringing out their latest video game installment the same week as their latest blockbuster movie does this make you nervous that Resident Evil 7",
      "start": 975.36
    },
    {
      "text": "Colin and Greg. With the Resident Evil franchise bringing out their latest video game installment the same week as their latest blockbuster movie does this make you nervous that Resident Evil 7 game may have been pushed for this week whether it's ready or not? Love your show. See Greg at RTX Sydney Sbattton from Sydney Australia.\" No I don't think so. Oh no. I I I don't think I mean it's smart business if that was the case to try to have everybody talking about Resident Evil one way but these Resident Evil movies appeal to a very different sect. I don't know what the crossover is anymore between people watching these movies and uh playing about the games. Yeah they're very different. I think I saw the the first movie maybe a long time ago. Yeah. Then they just immediately went in the **** I saw that they are going to pass a billion dollars gross with this particular movie in terms of the whole movie universe. So that's interesting. Yeah. But no Resident Evil I mean 7 the",
      "start": 1011.4
    },
    {
      "text": "the **** I saw that they are going to pass a billion dollars gross with this particular movie in terms of the whole movie universe. So that's interesting. Yeah. But no Resident Evil I mean 7 the game is awesome and great and stands on its own. And it's one of those if number one if it needed this much time to get to this point to get released to be this good great. Good on you. If they need they wanted to get to this point to avoid other games and big releases good good on you. It seems like it's selling well. Seems like it's doing well. So it's selling well. It's not it's not going to sell as well as five and six which makes me not even close probably which makes it makes me a little nervous actually uh about if they'll read into the positive critical claim or the poor commercial uh reception um which I think is probably more relevant to them. See I think it's the opposite because I think they know what they have. I and I also think that like this is also uh both last",
      "start": 1050.08
    },
    {
      "text": "uh reception um which I think is probably more relevant to them. See I think it's the opposite because I think they know what they have. I and I also think that like this is also uh both last think of the fall coming into this year of AAA games and now into here we've seen all these different AAA units these different these franchises selling less than before right that would seem to be our uh new stories coming in and out last time it just seems that they aren't moving as many units as before and I think that for a game that has been taking it on the chin for so long to where they were like we have to get back to what works and where we go I think this is a good move for them and I think they'll stick with it. Well I'm just looking at Metacritic uh right now for Resident Evil 5 Resident Evil 5 is 84. Resident Evil six's is 74. Resident Evil 7's is 85. So if they look at this overall they've increased Metacritic one point and are probably going to sell a couple million units",
      "start": 1087.04
    },
    {
      "text": "Evil 5 is 84. Resident Evil six's is 74. Resident Evil 7's is 85. So if they look at this overall they've increased Metacritic one point and are probably going to sell a couple million units less. And I'm sure that they would make that trade any day in the other direction. So just something to keep in mind. M but don't you I think it speaks to I mean I think that this is what we always talk about where you reviews are one thing but then popular opinion is another right and I feel like the scuttlebutt around Resident Evil has never hasn't been this positive in a long time and I'm talking about when the last two installments came out and people were playing him it was like this isn't my Resident Evil this and granted it sells fine but I think there is an argument here to be made that like I don't I don't necessarily think it's not the pacing or the perspective I think that's making this game sell less than the other ones before it. I think if anything it's actually the games before",
      "start": 1123.52
    },
    {
      "text": "I don't I don't necessarily think it's not the pacing or the perspective I think that's making this game sell less than the other ones before it. I think if anything it's actually the games before it that burned people out in Resident Evil and made them so that you couldn't trust that brand anymore that franchise. Sure we'll see. We shall. Number four Avalanche Software lives again. The studio has been brought back to life under the Warner Brothers publishing banner after the studio met its initial demise following the cancellation of its trademark franchise Disney Infinity. Little else is known about the reform studio other than that it's currently toiling away on a Cars 3 game. The studio was founded in 1995 and went belly up in the first half of 2016. It was responsible for more than two dozen middling games including a slew of Disney games and some outside work on franchises like Mortal Kombat and Rampage. It shouldn't be confused with Avalanche Studios. The studio",
      "start": 1164.56
    },
    {
      "text": "more than two dozen middling games including a slew of Disney games and some outside work on franchises like Mortal Kombat and Rampage. It shouldn't be confused with Avalanche Studios. The studio responsible for the Just Cause franchise Renegade Ops and Mad Max which is still alive and well. Number five Overwatch the massively popular online shooter has surpassed a staggering 25 million players in just over half a year on the market. God damn. That's an increase in 5 million players from the 20 million reported back in October of 2016. The game is available on PS4 as well as Xbox One and PC and it's unclear how the player breakdown goes though it's safe to assume a lion share of its audience is on PC cuz they're dorks. Yes. Number six the DSX franchise is officially on hiatus according to a report from Eurogamer. Here's what the website reports. Quote \"Square Annex's shift in focus to its recently announced the multi-game Marvel project combined with underwhelming sales of",
      "start": 1198.64
    },
    {
      "text": "to a report from Eurogamer. Here's what the website reports. Quote \"Square Annex's shift in focus to its recently announced the multi-game Marvel project combined with underwhelming sales of last year's Mankind Divided mean the DSX franchise has been placed on hiatus. Eurogamer understands this. Despite Mankind Divided leaving the series with a number of hanging story threads these plot points were intended to be resolved in a third game which would also complete the trilogy of the DSX titles begun by predecessor Human Revolution. Much of the remaining story was once intended for Mankind Divided Eurogamer has heard until the game grew too large in scope and had to be curtailed. Even with this Mankind Divided's development took 5 years. It's unclear if this is if this untold story will now be left unresolved or tied up in another medium such as a graphic novel. End quote. Much like Jericho. Much like Jericho. And number seven do you think we ever get the end of this DSX story?",
      "start": 1234.4
    },
    {
      "text": "now be left unresolved or tied up in another medium such as a graphic novel. End quote. Much like Jericho. Much like Jericho. And number seven do you think we ever get the end of this DSX story? Probably not. Didn't seem like anyone cared about that game. Agreed. Nick Nick loved it. I'm sure they at a age **** on that game. I'm sure Nick was the combat and everything else. He never I have no I have no doubt that it was it was good but uh but no one cared. Like I I just You can just kind of tell anecotally just being in the industry what what game has buzz. Like a game like Neo is probably going to sell way better than than Mankind like or the than the DSX game simply because how do I know that? because there's a lot of buzz in hardcore in hardcore gamer circles and hardcore gamers buy games. Yeah. Number seven the Banner Saga 3 has been announced. A Kickstarter is currently help running to help fund the game if you're interested. The first two Banner Saga games are currently",
      "start": 1268.8
    },
    {
      "text": "buy games. Yeah. Number seven the Banner Saga 3 has been announced. A Kickstarter is currently help running to help fund the game if you're interested. The first two Banner Saga games are currently available on PS4 and the first one is apparently still coming to VA. Uh I don't understand whatsoever why they're kickstarting their game. Uh they don't need to. As far as I'm concerned they saga one and two sold well and they seem to have gotten all I I don't really get this move but nonetheless free money. An apocalypse now video game is being kickstarted with the blessing of Francis Ford Copala with the goal of eventually bringing it to PS4 after its PC launch. Although it is far off from fun its funding ask and doesn't seem like it will make it. Third 4 has an official release date and will launch on June 9th on PS4 and elsewhere. Aselworld versus Sword Art Online will come to PS4 and VA in the summer of 2017. Daniel Lingan Daniel Lingan a senior manager for community engagement at",
      "start": 1307.6
    },
    {
      "text": "launch on June 9th on PS4 and elsewhere. Aselworld versus Sword Art Online will come to PS4 and VA in the summer of 2017. Daniel Lingan Daniel Lingan a senior manager for community engagement at EA recently tweeted out #skate4. But why is skate4 coming? We may find out soon. 3D action game Malicious Fallen is coming to PS4 on February 1st. DualSick platformer Embers of Miram comes to PS4 this spring. Action RPG The Surge comes to PS4 in May of 2017. Action RPG Portal Nights comes to PS4 on May 2nd. Puzzle game Semispheres comes to PS4 on February 14th. And finally Ghost Recon Wildlands closed beta on PS4 and other applicable platforms. Runs from February 3rd through 6th. You can sign up for beta access at ghostrecon.com/ba. That is ghostrecon.com/ba if you are interested in that. And that is not an advertisement by the way. I just feel like repeating it. That's good. No you see I liked it. Uh what is an advertisement is that tomorrow if you're listening to this on Tuesday",
      "start": 1342.32
    },
    {
      "text": "that is not an advertisement by the way. I just feel like repeating it. That's good. No you see I liked it. Uh what is an advertisement is that tomorrow if you're listening to this on Tuesday over on YouTube.com/KindaFunny our Ghost Recon Wildlands uh multiplayer playthrough what do you want to call it? Let's play. That's what they call these things. Is going live. Kevin's been working on it for a week. It's taken him forever but it's really funny and it's what we we always talk about when we did the turnover here for a kind of funny live or kind of funny year three starting it out is that we wanted to get to those kind of let's plays and obviously we're looking for an editor and doing all these different things. But a taste of what's to come hopefully knock on wood you can watch that one. It's real funny and it's enjoyable. Colin you missed one news story. Sassy Chaz wrote in with it. Hey Greg and Colin. I'm a longtime gamer and now well into fatherhood. My one-year-old",
      "start": 1388.0
    },
    {
      "text": "that one. It's real funny and it's enjoyable. Colin you missed one news story. Sassy Chaz wrote in with it. Hey Greg and Colin. I'm a longtime gamer and now well into fatherhood. My one-year-old daughter being my youngest. Every morning I love to try and get some gaming in before the kids wake up. Parenthesis as they're not allowed to watch me play immature games. This morning I got a conquest match in Battlefield 1. I was in the middle of skydiving off of Zeppelin after detonating some dynamite when I looked over to see my baby daughter standing there staring at the TV mouth a gate. She looked at me then back at the TV and said her first complete sentence. If I wanted to know what games were coming to the mom and grab shops where would I go? Thanks guys. Sassy Chaz. We all knew where that was going. You go to the official list of upcoming PlayStation software or PlayStation whatever. It doesn't matter. by the kind of funny co-founder. Sass wanted this and he got it. He said \"PS",
      "start": 1421.44
    },
    {
      "text": "that was going. You go to the official list of upcoming PlayStation software or PlayStation whatever. It doesn't matter. by the kind of funny co-founder. Sass wanted this and he got it. He said \"PS you guys used to do letters like this all the time. One of my favorite parts of the show internally. I always called it the getting grrolled. Hope it makes a comeback.\" I'm a little scattered today. Just Yeah. What is going on? I've noticed you're you're it's not that you're off your game but I can tell. Well I did a lot of work this week like especially last night yesterday. Sure. Um I'm doing more journalism journalisming than uh I have since I was at IGN. So I'm with Kyle was right. So it's just it's exhausting tracking all these people down. Sure. And it's surprising how few PR people want to talk to you when you're not asking them how about how great their game is but asking them actual real questions. God forbid anyone **** answers an email. But I'm sure if I I'm sure if I",
      "start": 1459.92
    },
    {
      "text": "want to talk to you when you're not asking them how about how great their game is but asking them actual real questions. God forbid anyone **** answers an email. But I'm sure if I I'm sure if I message them hey how great is your game? I'd get an answer in 10 minutes. But when I ask real questions no. Radio silence. Shocking. Uh corporations you got to go through the hoops. Got to run up the ladder. Here are the games. Your regular PR guy doesn't know what's going on with this that and the other. Absu comes to PlayStation 4 retail. Dive into a majestic underwater adventure from the artistic mind behind Journey and Flower. Absu is a beautiful underwater adventure that evokes the dream of diving. Immerse yourself in a vibrant ocean world full of mystery and bursting with color and life. It came out digitally almost a year ago. I didn't think it was very good. Yeah. No we we are super super It's We already have. We already have a journey. We don't need this. That was my entire",
      "start": 1496.0
    },
    {
      "text": "life. It came out digitally almost a year ago. I didn't think it was very good. Yeah. No we we are super super It's We already have. We already have a journey. We don't need this. That was my entire feeling from the moments where you'd go in you're all small swim next to a giant whale. I'm like I get it but come on now. It's just a journey. It wasn't great. It was really Some people loved it but I I don't I don't quite get it. Adventure Pop comes to PlayStation 4 digital. Embark in an epic adventure in this allnew super explosive bubble shooter. Ready your can and aim the bubbles and fire a way to burst through Adventure Pop. Can't wait. Dexed comes to PlayStation VR digital. From Ninja Theory creators of Heavenly Sword and DMC Devil May Cry comes Dex an on-rails VR shooter where dexterity is a must. Target and shoot flurries of enemies with two blasters one launching ice to destroy fire and the other shooting fire to destroy ice. Oh journey through beautifully realized",
      "start": 1531.44
    },
    {
      "text": "dexterity is a must. Target and shoot flurries of enemies with two blasters one launching ice to destroy fire and the other shooting fire to destroy ice. Oh journey through beautifully realized worlds and hone your skills in challenge mode before taking on the endless battle of arcade mode. Digimon World Next Order comes to PlayStation 4 digital and retail. There was some confusion that this would also come in the VA. It isn't. Welcome back to the digital world and all new adventure and story await. The digital world is in despair. Machine dramins are running rampant and causing utter chaos. The digital world needs your help. Recruit faithful Digimon companions and meet friends along the way to help you on this epic journey. Divide comes to PlayStation 4 digital. Divide is a science fiction dungeon crawl. Power up derelith complexes unlock jammed doors and delve into a long abandoned computer networks as you dust off the secrets of the mighty Vestage Corporation. Players explore",
      "start": 1568.56
    },
    {
      "text": "dungeon crawl. Power up derelith complexes unlock jammed doors and delve into a long abandoned computer networks as you dust off the secrets of the mighty Vestage Corporation. Players explore expansive isometric environments and stroll through deep map paintings that bring Divide's world to life. Shout out to uh Chris Hilton. He is the guy who is in charge of exploding tube of the developers behind Divide. He is the uh b the patreon.com/kindfunnygames uh bonus episode that went live this Sunday uh the past month. He talks a little bit about Divide but more about his career. Divide sounds awesome. I like that it's a it's more of like hey here's a narrative. Here's a story we're telling you and there's a little bit of combat in there. Regrettably with all the games coming out there's just no not a lot of time to play some of these smaller games anymore for me. But that does sound good. Yeah this one sounds good. I'm definitely going to play it. Double Dragon 4 PlayStation 4",
      "start": 1606.96
    },
    {
      "text": "just no not a lot of time to play some of these smaller games anymore for me. But that does sound good. Yeah this one sounds good. I'm definitely going to play it. Double Dragon 4 PlayStation 4 digital out the 30th. So this uh is out today when we're recording this. So this will already have been out by the time you hear this. The next entry in the sidescrolling action game series Double Dragon is finally here. The story picks up after the elimination of the Shadow Warriors in Double Dragon 2 which I'm sure is an event you remember. I **** can't forget it. Experience all new exhilarating action with the original old school graphics. I love Double Dragon. I hope it's good. Dynasty was that one Double Dragon? We were at IGN that came out. God **** awful. Double Yeah Double Dragon Neon was no good. Not as bad as some people were saying it was but it was it was bad. Not good. Dynasty Warriors Godseekers comes to PlayStation 4 and VA digital. The Three Kingdom Story was",
      "start": 1642.64
    },
    {
      "text": "Dragon Neon was no good. Not as bad as some people were saying it was but it was it was bad. Not good. Dynasty Warriors Godseekers comes to PlayStation 4 and VA digital. The Three Kingdom Story was never that I'm sorry. The Three Kingdom Story that was never told. A simulation RPG set in the world of the Dynasty Warrior series starring the youthful Xho Yan. Famous for his loyalty to duty and his sincerity. I'm sure he is famous for his sincerity and depicting alternate stories like that told in Romance of the Three Kingdoms. Gekki Yaba Runner comes to PlayStation VA digital. and transform your mustached hero into a raging force of destruction or a super speedy gnome to overcome Gekkiaba's toughest obstacles to face the ultimate challenge. Can you overcome every hurdle to save the princess in peril? Gekkiaba seems like a good game. Australia fight. You ready for this one? Yeah. Hand of Fate Deluxe Edition comes to PlayStation 4 digital. Remember this game? Deck building comes to life",
      "start": 1677.04
    },
    {
      "text": "in peril? Gekkiaba seems like a good game. Australia fight. You ready for this one? Yeah. Hand of Fate Deluxe Edition comes to PlayStation 4 digital. Remember this game? Deck building comes to life in Hand of Fate. An infinitely replayable series of quests. Earn new cards build your deck then try to defeat it. Draw your cards play your hand and discover your fate. The Hand of Fate Deluxe Edition includes the original game plus the Wild Cards DLC and the Murder at Sea update. Murder at Sea update I did hear was good. Hitman the complete first season comes to PlayStation 4 digital and retail featuring all of the season 1 locations and episodes from the prologue Paris Sapienza Marrakesh Bangkok Colorado and Hkaido. As Agent 47 you will perform contract hits on powerful high-profile targets in an intense spy thriller story across a world of assassination. Did Aaron ever get out of Paris? She went to uh the next one. What is it? Sapienza. No Marrakesh. No Sapienza. And to be",
      "start": 1714.24
    },
    {
      "text": "targets in an intense spy thriller story across a world of assassination. Did Aaron ever get out of Paris? She went to uh the next one. What is it? Sapienza. No Marrakesh. No Sapienza. And to be clear if she's obsessed it wasn't that she couldn't beat Paris. It's that she kept beating Paris over and over and over and over again in different ways because she couldn't get over that. That was how cool that was. That's a good story. I like that. She loves that game. Kill the Bad Guy comes to PlayStation 4 digital. I'm listening. As part of the secret of mysterious society whose members have sworn to rid the world of bad guys. It's your responsibility to serve justice in the bloodiest possible way. Track the bad guys. Be brutal and smart in your planning and eliminate them one by one. No idea what kind of game it is. Doesn't I Do you like bad guys? Do you want to let the bad guys get away with this? I like I like Cobra. Cobra. U partial to you know some some bad guys. So yeah Knee",
      "start": 1751.2
    },
    {
      "text": "what kind of game it is. Doesn't I Do you like bad guys? Do you want to let the bad guys get away with this? I like I like Cobra. Cobra. U partial to you know some some bad guys. So yeah Knee Deep comes to PlayStation 4 digital. I had an email in my box so I thought maybe it was a PR person emailing me back. Nope. When it responded to you so far uh three. Okay. One with an answer one with a we will not comment one with we are looking into it. Everyone else is MIA. Kneeed Deep comes to PlayStation 4 digital. When a washed up actor hangs himself on location a spotlight is cast on the backwater Florida town of Cypress Knee. Kneeed Deep is a crime thriller where choices matter as you investigate this mysterious suicide. Use your skills of observation deduction and cleverness to pull back the curtain and reveal the true story behind a swampland conspiracy. When you say it all cheery like that it doesn't sound as like scary and like dark. I mean it's called the the town is",
      "start": 1788.56
    },
    {
      "text": "pull back the curtain and reveal the true story behind a swampland conspiracy. When you say it all cheery like that it doesn't sound as like scary and like dark. I mean it's called the the town is called Cypress and Knee. San Francisco. Whatever. Everybody's got dumb names to retrace it back. Figure it out. San Francisco means St. Francis. Is there St. Francisco? I got to look into that. That doesn't sound right. Cuz Sands means no. No. Francisco. Pants means you don't have pants on. Line Light comes to PlayStation 4 Digital. Line Light is an elegant minimalist puzzle game where everything takes place on lines. Its zen-inducing music and visuals simulate the experience of getting an A+ on a super hard test while receiving a back massage. The controls are irreducibly simple. Move. What the **** does any of that mean? Finally. Nudo Shipuan Ultimate Ninjastorm 4: Road to Bordo comes to PlayStation 4 digital and retail. This is out the third and so it is a Friday release. Naruto",
      "start": 1833.52
    },
    {
      "text": "the **** does any of that mean? Finally. Naruto Shippuden Ultimate Ninja Storm 4: Road to Boruto comes to PlayStation 4 digital and retail. This is out the third and so it is a Friday release. Naruto Shippuden Ultimate Ninja Storm 4 Road to Boruto concludes the Ultimate Ninja Storm series and collects all of the DLC content packs for Storm 4 and previously exclusive pre-order bonuses. Not only will players get the Ultimate Ninja Storm 4 game and ex I'm sorry. Not only will players get the Ultimate Ninja Storm 4 game and content packs they will also get an all new adventure Road to Boruto which make which contains many new hours of gameplay focusing on the Son of Naruto. I don't know. Just get it over with already cares. And that is it for the games. Now as you know Colin there's been a thread recently on PS I Love You XOXO where we read the drop who's buying these games what are these **** games all these different things. And then last week began my new my new favorite thing of me",
      "start": 1877.52
    },
    {
      "text": "recently on PS I Love You XOXO where we read the drop who's buying these games what are these **** games all these different things. And then last week began my new my new favorite thing of me going to the PlayStation store and watching the trailers for these games we tal about. I did it again last night and he I I'm not ready to come back to you with findings yet. But what I want you to know is that what it seems to be happening is there are two publishers I noticed last night all over these terrible games and they're not like normal publishers we're see you know like publishers we're familiar with. There's something there's something fishy going on over there where I kept watching these trailers for awful what you assume are awful games and then because like most trailers don't even show you gameplay. Like there was one Joe's Diner, right? You remember Joe's Diner from a while back? Watch the trailer and it's just narrative over like you know like not Joe's Diner is supposed to",
      "start": 1923.84
    },
    {
      "text": "show you gameplay. Like there was one Joe's Diner, right? You remember Joe's Diner from a while back? Watch the trailer and it's just narrative over like you know like not Joe's Diner is supposed to be awful from what I heard. It's just narrative over some thing. It's like you go to Joe's Diner. Your only job is to **** keep the tables clean and keep doing all right whatever. So then I went to YouTube and watched a review from somebody who did a Joe's Diner review. And yes, the game is just **** god awful from what's apparently going. There's ghosts who No one's in Joe's Diner, but you work there. There's ghosts in Joe's Diner and they just don't like things loud. So, you have to keep walking out and getting dishes and bringing them back and putting them away. And then sometimes you walk out your little sound meter on your screen that'll show you like oh there's a radio on. You got to go turn the radio off. But like the reviewer was saying like there's no 3D sound. So like",
      "start": 1963.2
    },
    {
      "text": "you walk out your little sound meter on your screen that'll show you like oh there's a radio on. You got to go turn the radio off. But like the reviewer was saying like there's no 3D sound. So like you'll hear a hair you'll hear a hand dryer in the bathroom but you don't know if it's a men or women's. It's just like it's like it's right next to your head. It's not like that. And there's no every level has a time limit but you don't know the time limit till you fail. It's like what the **** is what is this? What is going on here? Sounds thrilling. We're gonna get to the bottom of this. Thank god all these games are published on PlayStation Network. I love when I did Colin was right about too many games, man. A lot of people were agree with some some of the responses about in disagreement like what are you talking the argument is basically to still do if a person makes a game they should be able to sell it. And I'm like okay I don't agree with you not on this network son ****",
      "start": 1997.68
    },
    {
      "text": "like what are you talking the argument is basically to still do if a person makes a game they should be able to sell it. And I'm like okay I don't agree with you not on this network son **** everything up these terrible **** games. remove half these games from the PlayStation Network and no one will care. No one. You know, it's just Life of Black Tiger. Yeah, we know. Just don't understand why there would be no quality control whatsoever on these on this at all. Who who how many how many hundreds of people are going to play Joe's Diner? **** break. It's 55 million PS4s in the wild. If your game is selling a thousand copies on 55 million units I'm going to tell you it's your game. It's not the PlayStation. It's not us. It's you. All right. Thank you for giving me a soap box in order to say that today. Greg, call. Time for topic of the show. Tots. You got Come on. What's Come on. Come on. It's been a very stressful kind of few days for me, man. I know. I'm pulling this columns",
      "start": 2027.92
    },
    {
      "text": "to say that today. Greg, call. Time for topic of the show. Tots. You got Come on. What's Come on. Come on. It's been a very stressful kind of few days for me, man. I know. I'm pulling this columns right to the wire, dude. I haven't even written it. I know. Yeah. You're gonna You're not going to have a good two days there put together, but it's going to be good. I hope. Yeah. Okay. But it's uh Yeah. It's just just one of those things you Okay, just one of those days. Give me a tots with feeling. Topic of the show. Tots. There you go. Thank you very much. Uh this one comes of course from kindafunny.com/psq where Javier Bonet 10 7 says, \"Hey guys, what do you look for in openw world games? It seems like the market is heavily saturated these days with so many open worlds such as Metal Gear Solid 5, Mad Max, Watch Dogs etc. I have never played an open world before. I tried GTA V for 10 minutes, stealing cars and driving into a military base and was so bored. Open world games",
      "start": 2073.12
    },
    {
      "text": "Gear Solid 5, Mad Max, Watch Dogs etc. I have never played an open world before. I tried GTA V for 10 minutes, stealing cars and driving into a military base and was so bored. Open world games capture many people's attention, but not mine and it's probably because I'm picky. The game that I'm confident will hit the note for me is Horizon Zero Dawn. Maybe it'll be the game that takes my open world virginity. Is it wrong to be so picky about open world games, especially being a genre that most people enjoy and is so in demand? Thanks for all you do, Javier Bonet. First off, you got to go play what you want to play. Don't worry about open world games being in there. But it's interesting. I mean, I like where he started with the question because he gets into what I don't I for somebody who's not in hooked into games, I wish he would have told us what he's looking for in games. But he says, \"What do you look for open world in open world games?\" Colin life. Yeah. Uh no, I don't think",
      "start": 2119.84
    },
    {
      "text": "who's not in hooked into games, I wish he would have told us what he's looking for in games. But he says, \"What do you look for open world in open world games?\" Colin life. Yeah. Uh no, I don't think it's wrong to be uh skeptical of or hard on open world games. A lot of open world games **** suck. Um open worlds that are empty and and vapid and vacant uh are very common and they're boring. Uh Mafia 3 is a really good example of this. The game had a great narrative and it's the storytelling is very good. The the character development is very good but it's just this open boring ass world making you do the same boring ass things over and over again and it ruins the entire game including the narrative. And and it makes you wonder why some of these games even require open worlds. I often reflect back on The Getaway which was a great PlayStation game uh from Sony London in which um really team Soho at the time in which uh you know it it gives you the opice it has the offices of",
      "start": 2160.0
    },
    {
      "text": "reflect back on The Getaway which was a great PlayStation game uh from Sony London in which um really team Soho at the time in which uh you know it it gives you the opice it has the offices of like a open world but it's not an open world. It came out hot came out hot on the heels of GTA and it looked and you thought it was going to be that kind of thing but it wasn't it didn't need to be. It just it was uh a really good game and and uh a well-remembered game and I'm not saying it's like the great example of this and I'm not saying also that there aren't great open worlds. I think uh The Witcher 3 was a vibrant and alive world. I think um I think Dying Light and Mad Max had their own interesting open worlds. I think Mad Max specifically is vacancy and deadness was what made the open world interesting because it was eerie. But not every game works like that. So when Mafia 3 sends you back into the bayou 7 000 times to get drugs and you're **** 8 million miles away from where you",
      "start": 2200.48
    },
    {
      "text": "interesting because it was eerie. But not every game works like that. So when Mafia 3 sends you back into the bayou 7 000 times to get drugs and you're **** 8 million miles away from where you need to be and it's just you're just driving for no reason it's just not fun. Well that's boring and you have every right to be critical of that. Um I think some people exchange scope for meaning or depth or texture and I think that those things are more important than scope. So, I'd rather have a smaller open world like say uh an open world that I thought was su successfully executed that was actually small was Seattle in and in Infamous Second. That wasn't a big map. Um but everything had seemed to have meaning and uh tied together nicely and they didn't make it three times bigger than it had to be just and they had landmarks and different feels and the districts felt you know unique so you didn't feel like you were running through the same thing over and over and over again. Yeah. I mean",
      "start": 2240.24
    },
    {
      "text": "to be just and they had landmarks and different feels and the districts felt you know unique so you didn't feel like you were running through the same thing over and over and over again. Yeah. I mean that's what I always talk about with Watch Dogs this year where Watch Dogs for me was a it was San Francisco which is helpful but the districts felt unique. they felt different. You you were making for me it's always about making progress in a world and you know he brings up Horizon. Of course my let's play for Horizon is up right now on YouTube.com/kindafunnames. A lot of people asking us to talk about it but not spoil it and not show the gameplay because you want to hear about it. So, in very general terms and you don't have to worry about spoilers here like that's what you know the four hours of Horizon I played why I'm excited for it why I know that's my kind of game was the feeling of progression the feeling of life and the feeling of changing things where you know in",
      "start": 2274.24
    },
    {
      "text": "four hours of Horizon I played why I'm excited for it why I know that's my kind of game was the feeling of progression the feeling of life and the feeling of changing things where you know in the thing I climb up one of the long necks take it over and then the fog of war lifts and suddenly the map populates with more **** to do. And there's tons of different things to do. Granted, it's going to be I'm sure there's going to be you know x number of bandit camps and I'm going to take them down and they're all going to feel similar but the fact that there's bandit camps and then there's hunting grounds and then there's the story missions and there's the side missions like I want it to feel different and change as I play through it. And I want to have enough where I don't you don't notice you're doing the same thing over and over again. You know you are but you're doing so many of the same things you're able to pepper in and do differently which is one of the things going",
      "start": 2305.76
    },
    {
      "text": "notice you're doing the same thing over and over again. You know you are but you're doing so many of the same things you're able to pepper in and do differently which is one of the things going back to The Division earlier is what drove me away with The Division early on, right? like I beat The Division got to level 30 and then it was going to oh I have to run the same missions over and over and over again. Like well this no longer feels like the world it did before. Cuz when you're going through The Division you and I always talk about it like Manhattan and New York feel awesome as you go through it and there are people there scavenging for goods and there's all these different things. But when it is you know okay cool. Well I either play the same story missions I do or do the same encounters I've been doing over and over again. Defend the supply drop wait for the JTF all this jazz it's like well no this is I don't want to keep doing that. Whereas now there's so",
      "start": 2340.88
    },
    {
      "text": "the same encounters I've been doing over and over again. Defend the supply drop wait for the JTF all this jazz it's like well no this is I don't want to keep doing that. Whereas now there's so much more content for it. And Horizon seems like a game packed with content. Like I'm wholeheartedly in on Horizon based on what I play. I mean we've seen it before. Obviously we've given an E3 game of the show twice now. But uh actually sitting down to play it like that is definitely the world I'm stoked about. And what you're talking about is some of life in in the let's play. There's this great thing on a side quest. I'm running off to go do whatever the **** I need to do. But as I'm you know I stop the let's play and bring it back to real time at one point where because I'm running and oh **** there's a boar and there's a turkey. Stop. I hunt them. I get them. I collect my stuff and then I go look at my all right cool. If I want to expand my you know my my quiver of",
      "start": 2370.16
    },
    {
      "text": "running and oh **** there's a boar and there's a turkey. Stop. I hunt them. I get them. I collect my stuff and then I go look at my all right cool. If I want to expand my you know my my quiver of arrows I need this. And you have those things where there's always different objectives going that make the world feel your own. And you're always making progress. Even if it is just running from point A to point B there's something along the way for you to do to find to learn. Let alone the environment's going from this you know forest that's you know bathed in sunlight and very beautiful and there's a nice creek going through it. Or as I go up into the mountains snow's there it's cold it's frozen there's different animals up there. Yeah I'm I'm excited about it. I I I think Horizon's clearly going to be great. Um and clearly be a very big game as I said some weeks ago on PlayStation 4. Uh it's going to be a huge game and uh so I'm I'm excited that it's good. I have I don't",
      "start": 2404.8
    },
    {
      "text": "clearly going to be great. Um and clearly be a very big game as I said some weeks ago on PlayStation 4. Uh it's going to be a huge game and uh so I'm I'm excited that it's good. I have I don't really want to know anything else about it personally. I've been avoiding trailers and all this. I'm good. I'm in. I played it at E3. That's enough for me. But uh I I will say you know just a few other things about open worlds. I think playing open worlds back to back to back to back can be uh for some not for this particular gentleman but for some people can be uh can be excruciating. And I think that people should avoid to do that. Although avoid doing that although I think it's hard as well because so many games now stress their open worlds and nonlinearity as as these back of the box kind of things that I think that are not really necessarily pertinent for every kind of game. And I wish people would kind of tone that down and rein it in a little bit because I don't think it serves every",
      "start": 2440.0
    },
    {
      "text": "things that I think that are not really necessarily pertinent for every kind of game. And I wish people would kind of tone that down and rein it in a little bit because I don't think it serves every single game. And I think some games that have a little bit of edge of nonlinearity um or backtracking like Dead Space or BioShock are way way way creepier and way better made than a lot of these games with vast you know thousand mile open worlds which are just **** sterile and boring and who the hell cares how open they are when there's nothing in them and nothing to do. Um the other thing that I would say is that uh is you know identify the the open worlds that are that are truly great and spend time and immerse yourself in those open worlds and you won't even have any time to play the other shitty open world games. And so I think great places to start are with the Bethesda games or with uh Witcher 3 or uh you know I really do think Dying Lights you know Turkey inspired world is or",
      "start": 2473.92
    },
    {
      "text": "other shitty open world games. And so I think great places to start are with the Bethesda games or with uh Witcher 3 or uh you know I really do think Dying Lights you know Turkey inspired world is or city is you know really really awesome. Um Far Cry all those games are great and meaningful and meaty. Um even Rise of the Tomb Raider. So I think that for all of the all of these kind of you know shitty little or big open worlds um there are plenty to keep you busy. And I I will say again it's such a shame when an open world when sometimes the story or lack of a story hurts a game that plays well. It's more of a shame when a game has all the promise and trappings of a great game like Mafia 3 but then just gets lost and is ruined because of its open world. That's the only thing that ruins it. But that's a huge **** piece of content that's ruined that ruins the other an otherwise great game. And I feel bad for the people that like made that narrative and did the writing and the voice",
      "start": 2510.64
    },
    {
      "text": "it. But that's a huge **** piece of content that's ruined that ruins the other an otherwise great game. And I feel bad for the people that like made that narrative and did the writing and the voice acting really superb you know work and then this just drab **** garbage open world to explore that ruins all of it. Makes you not want to play it anymore. It's a shame. You know people should take hints from Tomb Raider and the like. I think Piers JM11 chimes in on this topic. Of course he went to kindafunny.com/psq just like you can and says \"What's up Marty and Brian? I mean Greg and Colin. I thought that was a funny one. I recently was talking about the Fallout series with a coworker and how much I love the story and lore in the world. When I think about the three games I've played three New Vegas and four there was just something off about four as opposed to the other two. Colin did you ever finish the campaign? Did it just attempt too much and fly too high? Or was",
      "start": 2551.44
    },
    {
      "text": "played three New Vegas and four there was just something off about four as opposed to the other two. Colin did you ever finish the campaign? Did it just attempt too much and fly too high? Or was there something magical about three in New Vegas that has worn off as open world games have become more commonplace and done better? Looking at you Witcher. Uh Witcher 3. Uh what would you guys like in a fifth series? But what went wrong with four? I I mean you beat it and so I think you have more to say on it than I do but I played Fallout 4 for 5 or 30 hours and there there's definitely something wrong about with it. Like I I don't I don't know what it is. I don't know if it's me. I don't know if it's the industry. I don't know if it's how far we've come. I don't know if it's the game itself. I don't know if it's a an amalgamation of all those things but there is something wrong with Fallout 4 and I don't I can I haven't been able to and cannot put my finger on what it is. I",
      "start": 2588.56
    },
    {
      "text": "itself. I don't know if it's a an amalgamation of all those things but there is something wrong with Fallout 4 and I don't I can I haven't been able to and cannot put my finger on what it is. I think I think wrong is drastic is a way to put it but there's something off. And I think I platinum Fallout 4 beat Fallout 4 obviously. Uh for me the thing about it was stop just get go get the new water bottle. We'll wash it out as soon as it's done. Just stop dripping all over yourself Drippy. Uh the thing about Fallout 4 was the fact that what's wrong with it right? What's different about it as core is that it just wasn't that step forward. It was it I we'll never forget that games cast where before we had it and before we had played it and Tim was like for you guys what is going to happen with this game and I was like best worst case scenario is it's Fallout 3 again and it's that same game and it just look it looks a little bit prettier runs a little bit better and does a few things",
      "start": 2624.16
    },
    {
      "text": "with this game and I was like best worst case scenario is it's Fallout 3 again and it's that same game and it just look it looks a little bit prettier runs a little bit better and does a few things differently. best case scenario is it totally re and it was more it was it was Fallout 3 and it was New Vegas again and those were great games but we've played them so much and when you thinking of oh my god they're jumping onto the PlayStation 4 they're or Xbox One or whatever they're jumping onto this nextG machine they're making the nextG Fallout they've been secretly working on it and here it comes it's going to be great it was great but it wasn't it doesn't carry the same weight when you have the same kind of problems and your face is clipping the same way and all these different things and it just it isn't running well and it's doing all these different things that we thought were in the past. Whereas like Fallout 3 when Fallout 3 arrives and become like as soon as it gets there and",
      "start": 2665.04
    },
    {
      "text": "it just it isn't running well and it's doing all these different things that we thought were in the past. Whereas like Fallout 3 when Fallout 3 arrives and become like as soon as it gets there and people start playing it for the first time they're like \"Holy shit.\" Like \"This is unlike any the Fallouts before it in terms of perspective and style.\" And that that's on console and people are all up in it. You know what I mean? It was so many f so many people's first Fallout and then it was the first Fallout that was like that that you were like \"Holy **** this is awesome.\" And New Vegas came so quickly and was different. It was it it changed it was done by a different studio. Obviously you always talk about you know the morality system was different and this it it felt like okay cool. In the same way GTA 3 was great and then Vice City was great and like they had all these games that you're iterating so quick you're changing little things. That's fine. I can give you that",
      "start": 2698.72
    },
    {
      "text": "cool. In the same way GTA 3 was great and then Vice City was great and like they had all these games that you're iterating so quick you're changing little things. That's fine. I can give you that that much rope that leeway when you're talking about a few years when you're talking about you know going dead silent on Fallout or not dead silent but you know what I mean? Quiet on Fallout from since Fallout 3 as Bethesda and coming here comes Fallout 4. It's this giant announcement. We're doing all these different things. It's coming out right away. people I think expectations not and I don't think it even I think expectations ran away with people but I don't think they necessarily I don't think they're in the wrong I don't think it's a No Man's Sky thing where everybody's like well no hold on we were all saying it is still Bethesda it is still Bethesda not that that's bad that we know it's similar to Telltale we know what a Bethesda game is uh I feel like just expectations were",
      "start": 2733.68
    },
    {
      "text": "no hold on we were all saying it is still Bethesda it is still Bethesda not that that's bad that we know it's similar to Telltale we know what a Bethesda game is uh I feel like just expectations were really high for that one and it met the bare minimum of it which again is a great game but when you're talking about like oh man a standout blah blah blah like I you know I talk about all the time that Fallout 3 there's so many memories and quests and things I talk about whereas this one I didn't and it wasn't I don't think because the voice act because there was voice acting or these things it was just like okay cool this is we've done this before I know where this is going. Yeah I think I mean I I I truly believe that Fallout 4 um suffered from uh coming too late and I'm not I'm not sure that you know I'm not saying too late in the sense that they wanted to or should have released it earlier. I'm just saying that there it is not 2008 anymore. And uh even going back and playing you",
      "start": 2769.6
    },
    {
      "text": "that you know I'm not saying too late in the sense that they wanted to or should have released it earlier. I'm just saying that there it is not 2008 anymore. And uh even going back and playing you know briefly during one of our streams when I I booted up Skyrim Special Edition just to stick around with it having not played Skyrim in some years like this game this game's not that good anymore. Like the the the the I I appreciate what they were. I appreciate what Skyrim and Fallout 3 represented at those times. I think Fallout 3 and Fallout New Vegas from Obsidian are exceptional games for their time and place and are really important games but man they aged quickly and they aged badly. And so when you're playing uh a game like Witcher 3 in the spring of 2015 right? Yes. And then you are playing Fallout 4 in the fall of 2015 and you're like yikes. Like now you have this direct comparison a complete direct comparison more so to like what they're doing with the Elder Scrolls and",
      "start": 2809.84
    },
    {
      "text": "are playing Fallout 4 in the fall of 2015 and you're like yikes. Like now you have this direct comparison a complete direct comparison more so to like what they're doing with the Elder Scrolls and Font in terms of narrative but in terms of these open worlds CD Project Red in every single respect made a better game. And and I can't think of one way in which The Witcher 3 is inferior to Fallout 4. And when you look at games like that I'm not saying Witcher 3. I have you know as people know I have massive problems with The Witcher 3 but it certainly certainly held my attention for way longer. Um and I thought it was a very well executed game. It just became too dense for my o my gaming OCD. I mean it's really my problem but that so so it is. Uh so when I when Fallout 4 came out and I was excited to play it and stuff but I'm like man like this just doesn't feel very good anymore. This doesn't look very good. This doesn't this uncanny valley **** with your characters is",
      "start": 2847.08
    },
    {
      "text": "and I was excited to play it and stuff but I'm like man like this just doesn't feel very good anymore. This doesn't look very good. This doesn't this uncanny valley **** with your characters is offputting. The the environments and the textures are not very good. The the you know I should have I I lived in Boston for a long time. I love this kind of American Revolutionary kind of **** Obviously like everything about this game should speak to me. It's similar to Assassin's Creed 3 where I'm like everything about this game should work but the game just doesn't work. And so I gave it my all and I'm just like I just don't really care about what's going on in this world anymore. And a lot of it you know we were talking about how certain things can ruin an entire package before when we were talking about open worlds. And with Fallout 4 it's like the open world's great. It's expansive. There's a lot to do a lot of hidden lore a lot of interesting characters. All that kind of stuff is",
      "start": 2890.4
    },
    {
      "text": "talking about open worlds. And with Fallout 4 it's like the open world's great. It's expansive. There's a lot to do a lot of hidden lore a lot of interesting characters. All that kind of stuff is great. But I'm like man we talked even in 2008 about VATS being an excuse for for not being able to program proper combat. Uh VATS is an excuse. There are no VATS-like excuses in The Witcher. There are no VATS-like excuses in Dying Light. There are no VATS-like excuses even in in some other more middling open worlds. I really feel like Fallout and as we said before was a game made in a vacuum and a studio that had not adapted to the time and going around it. And that really surprised me not only because Todd Howard's a super smart guy and Bethesda Game Studios knows what it's doing but because games in the Bethesda publishing family are all pushing their respective mediums and genres forward. And uh I feel like Bethesda Game Studios proper is stuck in the past. Like I I and I",
      "start": 2924.16
    },
    {
      "text": "because games in the Bethesda publishing family are all pushing their respective mediums and genres forward. And uh I feel like Bethesda Game Studios proper is stuck in the past. Like I I and and I really hope with Elder Scrolls 6 that they um they really they need to do something drastically different. And I understand that these are the games they make. This is the way their games look. It doesn't have to look like this and it doesn't have to be made like this. or Fallout 1 and Fallout 2 were not what Fallout 3 and Fallout 4 were. And I'm not saying that Bethesda made those games. What I am saying is that the it can evolve. It's the similar evolution of GTA to GTA 3 to GTA 5. You have to do something to change it up a little bit. And I'm not trying to harp on hating on I love Bethesda but when you look at God look what Machine Games is doing for shooters. Look what ID is doing for shooters. Look what Arcane is doing for for third person action and stealth you know? Look what look",
      "start": 2960.88
    },
    {
      "text": "when you look at God look what Machine Games is doing for shooters. Look what ID is doing for shooters. Look what Arcane is doing for for third person action and stealth you know? Look what look what Tango is doing for survival horror. What exactly is Bethesda Studios game studios doing for RPGs? Yeah and that's the thing is again I you're hitting the nail on head and I mean for any haters out there is I know they tend to come once in a while. You're not saying that the graphics or the frame rate or what any of that broke the is what sucks and you wanted it to be 1080p. You're what you're saying is what we were driving at earlier right? Is that these things took away from the world and took away from the experience and took away from you being lost in it. And that's the whole point is like if I can't get lost in that world if I know I'm just playing another Fallout that's fine and I don't mind playing another Fallout. I obviously I loved Fallout 4 but it's whenever we talk",
      "start": 2999.52
    },
    {
      "text": "is like if I can't get lost in that world if I know I'm just playing another Fallout that's fine and I don't mind playing another Fallout. I obviously I loved Fallout 4 but it's whenever we talk about that year whenever we talk about games of the year when we talk about stand out I'm always going to talk about Fallout 3 versus Fallout 4. I'm never going to bring up Fallout 4. I thought it was cool that I got a pit boy with my collector's edition. I like having that. I liked what I did. I enjoyed the voice acting. I enjoyed the different camera angles but it was more Fallout. And that's great. And I'm with you that I hope they took it on the chin like \"All right cool.\" Like obviously it was too late in the game when they see Witcher when they see where people are going. They came up for air and like oh the industry's changed and this isn't where we need to be. This is a great game. We're going to put it out. People are going to enjoy it. Awesome. But it's not going to be",
      "start": 3036.72
    },
    {
      "text": "came up for air and like oh the industry's changed and this isn't where we need to be. This is a great game. We're going to put it out. People are going to enjoy it. Awesome. But it's not going to be Fallout 3 again in terms of reception sales people talking about it. They need a they need a technical overhaul a massive technical overhaul because I don't think that the game design's bad. I don't think the writing's bad. And I don't think Fallout 4 is anything less than a good game. Yeah. But again when I think about what Arcane is doing with Prey what they did with Dishonored when I think about what Wolfenstein has done with or what Machine Games has done with Wolfenstein when I think about what Tango has done with The Evil Within uh etc. and so on these are all way more interesting and way more dynamic and I would say better in their genres than Fallout 4 is is to its genre. Sure. Elder Scrolls 4 Oblivion specifically was a massively important game on consoles. Understand",
      "start": 3070.56
    },
    {
      "text": "and way more dynamic and I would say better in their genres than Fallout 4 is is to its genre. Sure. Elder Scrolls 4 Oblivion specifically was a massively important game on consoles. Understand that this was the fourth game. This wasn't even the first Elder Scrolls game released on console but it was a massive game that showed console gamers that they like something that is more PC and show developers and publishers that people want games like this. That was quaint over a decade ago. But but seeing a game in that same mold today which is a little bit better graphics and some little accutrants that make it seem a little bit more modern a lot was removed from that. I would I would have loved to have seen what CD Project would have done with that game you know with that story with that world. And I'm not trying to **** on on what Bethesda is doing necessarily. All I'm saying is that they they cannot release another game like that and um and expect to get away with it in a sense.",
      "start": 3105.68
    },
    {
      "text": "world. And I'm not trying to **** on on what Bethesda is doing necessarily. All I'm saying is that they they cannot release another game like that and um and expect to get away with it in a sense. You know what I mean? I think they kind of got away with one in my in my opinion. And I think we all kind of look the other way because it's like you're Bethesda. We we love and appreciate you. We respect what you do. The talent this the level of narrative and character building and world building you do is immense. Why does it look like this? Why does it run like this? What's with the load times? What's you know uh all those kinds of things. And and you just it's not like an idea anymore. It's like you have a a direct comparison. It's like playing Infinite Warfare and then going back and playing the original Medal of Honor on PS1. Another massively important shooter on console. shooters had been proliferating with Quake and and Hexon and whatever whatever all these games are",
      "start": 3152.16
    },
    {
      "text": "back and playing the original Medal of Honor on PS1. Another massively important shooter on console. shooters had been proliferating with Quake and and Hexon and whatever whatever all these games are that are on PC that people Wolfenstein Doom but it really was Medal of Honor on PS1 as one of the really first games that everyone's like this works on on console. We have dual sticks and we can do this kind of thing. And uh but we don't make shooters like Medal of Honor anymore. It was just a a proving ground a place in time. Sure. But now shooters are much bigger and much better than they used to be. And we expect the same out of this genre as well. Some genres are imu are immune to these effects. I think platformers and Metroid vanas and stuff are typically much better when they're made in the old style but not these kinds of games because they're it's so competitive and they require so much time. Um so that was why I mean and that's why you know that's why everyone has this mis",
      "start": 3190.0
    },
    {
      "text": "in the old style but not these kinds of games because they're it's so competitive and they require so much time. Um so that was why I mean and that's why you know that's why everyone has this misconception that I don't like Worth 3. I don't like CD Project Red. I actually really admire what they did because I really do think that that set a massive bar. And I'd say the same thing for for Dying Light and some other games with just open worlds. You might not like the game. You might think it's overrated. Maybe you might think I overrated all that but just think about in terms of its open world and what it does to push that particular setting forward. And then think about you know the Commonwealth and Fallout 4 and how drab and boring it was. Sure. You know just because it's apocalyptic doesn't mean it has to be **** boring. And I guess that was kind of the thing. And eventually I was just like there's other games I want to play. Yeah. But this was a long time ago. I often",
      "start": 3230.08
    },
    {
      "text": "doesn't mean it has to be **** boring. And I guess that was kind of the thing. And eventually I was just like there's other games I want to play. Yeah. But this was a long time ago. I often think about Fallout 4 specifically with that Bar Harbor DLC which sounds really great because it takes place in Maine which was part of Massachusetts until the Civil War. But see that'd be interesting to see start it up because as somebody who platinum it when I got that DLC and I tried to jump back in I was like wait which save am I and which character am I? And this so much time's gone by. It was the same thing of jump in and it's like four frames a second. Like the fog is like blocking everything. I'm like I don't know about this man. The PlaySt PlayStation 4 can do better than this. So I'll be interested to see how they respond. And my my hope is that they just go away for until next gen. Wow. Uh final question on this open world topic of the show comes from Sorry We Are. He",
      "start": 3265.36
    },
    {
      "text": "So I'll be interested to see how they respond. And my my hope is that they just go away for until next gen. Wow. Uh final question on this open world topic of the show comes from Sorry We Are. He says \"Hey Colin and Greg. So yesterday you Greg played Horizon. How was it?\" I already talked about that. Do you have any lingering concerns or can you not wait for the next few weeks to pass? You can jump back in. Thanks Josh. Uh again let's plays up. You can get all the things there. It was **** awesome. Uh I can't wait. Lingering concerns? No. I think it's going to be interesting to see how people now that we're past the post Fallout 4 world right? where you're like \"Well we gave them the benefit of the doubt and making a vacuum.\" Uh the let's play brings it up a few times. The way you talk to people that it's it's it's when you talk when you're having a conversation in a not a cut scene but like a conversation with a side quest or a character in game or whatever. It gives",
      "start": 3298.32
    },
    {
      "text": "way you talk to people that it's it's it's when you talk when you're having a conversation in a not a cut scene but like a conversation with a side quest or a character in game or whatever. It gives off a Fallout vibe of like like the one in the Let's Play that's up of this woman who's like talking to you and then like looks down and comes up and she's like \"Thank you so much.\" You're like \"What the **** Are you about to murder me?\" Oh no. Your character model's just wigging out right now. All right cool. Whatever. And it's like are people going to be forgiving of that or is that going to be a ding that they give it? But I think when you from the things I played of the world around it you know what I mean? I think uh it's going to be a lot of fun to play. It's going to be a lot of fun to invest. It's going to be a lot of fun to play. It's going to be a world to get lost in. And I think the more you put into it the more time you put into it the more forgiving you'll be",
      "start": 3334.96
    },
    {
      "text": "lot of fun to invest. It's going to be a lot of fun to play. It's going to be a world to get lost in. And I think the more you put into it the more time you put into it the more forgiving you'll be of those kind of things. In one of the battles I have up you see me rolling away from the creature and like I roll into a box and it's like the awkward trying to get around the crate to get back outside or stuff. Like there's little things like that. The bandit AI and the bandit camp. The game's not like a perfect 10 going to blow you away. It's on every level and every front. There's going to be video game moments to it. There's going to be action RPG moments to it. The thing I talked about in the let's play and that I talked about after the fact right was the fact that this was way more RPG than I thought it was going to be which I love which I'm I love the combat of it. I love the world of it and I love the fact that there is more RPG parts of that. But I do think then there's",
      "start": 3366.4
    },
    {
      "text": "RPG than I thought it was going to be which I love which I'm I love the combat of it. I love the world of it and I love the fact that there is more RPG parts of that. But I do think then there's going to be moments where you're like uh if this was a strict action game and it was just this you know more linear path this wouldn't have happened. You want to go? Who the **** cares if you're out there having fun clearing bases doing whatever Colin? Yes it's trophy time man. A lot of trophies have gone up. I I looked at the tro I look at psnprofiles.com/games pretty often like once a day. Then uh cuz they just when games are in the server they pop up and we can see what's going on. Then I didn't look for like a couple days. And last night I went and looked and there's like 15 new games on here. They good ones? Uh well there's some So I I pulled out four of them that I thought were worth talking about. Uh first one is Final Fantasy 12. the Zodiac Age. Uh Final Fantasy 12 is",
      "start": 3397.04
    },
    {
      "text": "games on here. They good ones? Uh well there's some So I I pulled out four of them that I thought were worth talking about. Uh first one is Final Fantasy 12. the Zodiac Age. Uh Final Fantasy 12 is imminent. Uh we we don't quite know when but uh it's through certification because the trophies are live. Uh so this one has 6 bronze 10 silver four gold and a platinum. And I think I might go for this one. I was talking to Tim that Final Fantasy 12 was the last Final Fantasy game I just didn't hate. You know I it came out when I was a senior in college. I wrote a strategy guide for it and uh last Final Fantasy game I didn't hate. And uh I thought it was it's a it's a tale of two games as I've said many times before. You can tell when when and where people worked on it I think. And um it's trying to be like a pseudo MMO. It's definitely a game of its time. The combat I think is very MMO like. Uh but I think the world's interesting and and there's interesting things and fun things to",
      "start": 3433.28
    },
    {
      "text": "trying to be like a pseudo MMO. It's definitely a game of its time. The combat I think is very MMO like. Uh but I think the world's interesting and and there's interesting things and fun things to do in it. And I I I don't remember. It's been 10 years. Um I don't remember too much of the ins and outs. I have these little screenshots in my head of what I was doing and how the game played and stuff like that but I remember that it was a massive step up from 10 and that it doesn't get much worse than 13. So um so I'd like to get back into it. Interesting. Uh so the trophies seem pretty reasonable. There are a bunch of bronze troies for attacking 300 times using magics and technics and uh all these kinds of things taking steps and acquiring gil and clan points and spending gil and and selling loot and but then there's some difficult ones. Uh completing the best area and and uh learning all the magic and techniques. Um fully exploring every map which is a pain in the ass. I remember",
      "start": 3475.36
    },
    {
      "text": "loot and but then there's some difficult ones. Uh completing the best area and and uh learning all the magic and techniques. Um fully exploring every map which is a pain in the ass. I remember that was one of the trophies I was missing in the last east game on VA which was so annoying because you had to go around the maps and light up all the areas of the map or whatever and I'm like I have no idea. I don't I missed some pixel somewhere. So go **** yourselves. There's a bunch of trophies for beating uh some difficult enemies like the trickster the carrot the Gilgamesh and stuff like that. Um there are a bunch of them for marks and then there's a bunch of story driven ones. Um escaping from now in the dungeons and rescuing princess and the mouse and stuff like that. So anyway Final Fantasy 12's trophies look good. Another game I'm super excited for comes out February 14th so just in two weeks is Sniper Elite 4. A perfect Valentine's Day game. 49 bronze 11 silver two gold and",
      "start": 3512.64
    },
    {
      "text": "12's trophies look good. Another game I'm super excited for comes out February 14th so just in two weeks is Sniper Elite 4. A perfect Valentine's Day game. 49 bronze 11 silver two gold and a platinum. There are a bunch of trophies for completing missions. um and overwatches. And then there are trophies for completing uh or for getting kills. So with your secondary weapon your primary weapon pistols and rifles etc. and so on using traps beating the game on the various difficulty levels. There are objectives secondary objectives in all the different maps and all the different modes and you can get uh trophies for getting some of them and all of them. Why are you excited for this one? Uh so I this game was not on my uh I think we talked about this a little bit post E3 but this game was this series has been floating around. I think I have Sniper Elite 3 on my shelf unopened. Sure. Uh and uh you know I'm a huge shooter fan. I love shooters but but uh you know had never",
      "start": 3547.44
    },
    {
      "text": "was this series has been floating around. I think I have Sniper Elite 3 on my shelf unopened. Sure. Uh and uh you know I'm a huge shooter fan. I love shooters but but uh you know had never really been familiarized with this game. You made an uh this game is made by a studio called Rebellion and you um went ahead and made an appointment from E3 and I went and played it. I'm like this is this is awesome. Like and to chime in cuz I know how many people are listening to this that are developers our game publishers are in the industry. The reason this works and why it's on your radar is because they reached out and it wasn't a press release blast. It was \"Hey Greg I heard you're planning E3 from so and so. This is a game that's a shooter and we really think we have something special and we know Colin from listening to all the shows loves shooters. We'd like to see get it in front of them.\" Like I And they were right. It was a great game. We talk about it was great. The",
      "start": 3582.32
    },
    {
      "text": "special and we know Colin from listening to all the shows loves shooters. We'd like to see get it in front of them.\" Like I And they were right. It was a great game. We talk about it was great. The demo was great. Yeah. Yeah. We talk about Shovel Knight all the way being the same way right? Identifying you as a person that like is going \"Oh Jesus God get a new water bottle. I'm going to smash the **** that's going to be that's my uh cup to smash like yours.\" Um but we talk about shovel night where they identified you right? And the times people have hit me up and been like \"Hey this is a game you're going to really dig.\" It works when you come to somebody personally and you're like \"Hey we've paid attention to your content. We know what you're going to like. We're willing to put our reputation or you on the line to say this seems like it's going to be for you.\" Well they were right in terms of their demo. I mean it would definitely you know I like meticulous slow",
      "start": 3619.52
    },
    {
      "text": "to put our reputation or you on the line to say this seems like it's going to be for you.\" Well they were right in terms of their demo. I mean it would definitely you know I like meticulous slow games. It's the same thing with what I assume is that what I assume is their competitor um Sniper Ghost Warrior. We just did a paid let's play for that. So I don't know if it's up yet or when maybe by the time this goes. Uh but anyway so I just people take it with a grain of salt because we were paid. we were sponsored for this that particular let's play. But it's the same thing where I like I I'm looking for some more meticulous slower paced shooters. I I love my Dooms and I love my Call of Duties and all that but I'm still looking for something a little more meticulous that I can really sink my teeth into. So that's one of those things. Uh I wanted to give this one a shout out. Super Gunw World. Gun World's made by a a hardcore Kinda Funny fam. And I believe one of our fans is",
      "start": 3649.12
    },
    {
      "text": "sink my teeth into. So that's one of those things. Uh I wanted to give this one a shout out. Super Gunw World. Gun World's made by a a hardcore Kinda Funny fam. And I believe one of our fans is in Gunworld because it was one of our giveaways on one of the streams. Well I'll get to that cuz there's a trophy. I apologize in here about it. Uh 10 bronze nine silver seven gold and a platinum. I don't know if the game's good or bad. We don't endorse. You don't have to sit in the stand in the corner like a **** weirdo. Well it's like Blair Witch. Yeah I know. I don't watch your You're making me nervous at the light. Watch your head. Okay stop. Is it scaring you? It scares you. Prolonging the show. I mean you love Blair Witch. I do love Blair Witch. I remember seeing it very well. It was in North Carolina. I was visiting my sister in the summer of 1999. Now uh the interesting thing about this so yeah the guy's a friend. I don't know if the game's good or bad. I actually",
      "start": 3679.6
    },
    {
      "text": "It was in North Carolina. I was visiting my sister in the summer of 1999. Now uh the interesting thing about this so yeah the guy's a friend. I don't know if the game's good or bad. I actually played the original Gun World a little bit on Xbox One. I thought it was not good. Um so I don't and I've talked to him about that. I don't you know um know how this is going to be if it's going to be an improvement or not. Um nonetheless, like I said, 10 bronze, nine silver, seven gold, and a platinum. What I want to point out here is the trophy team fat. It's a bronze trophy. It says find the adventurer who won the Kinda Funny cameo giveaway. Yay. So we're in there as well. I think you should name one of your trophies Morardi, but that's no big deal. And the final trophies I want to spotlight are Double Dragon fours, five bronze, one silver, three gold, and a platinum. So, different uh different uh trophies for beating different missions and then getting to the floor presumably of",
      "start": 3716.96
    },
    {
      "text": "are Double Dragon fours, five bronze, one silver, three gold, and a platinum. So, different uh different uh trophies for beating different missions and then getting to the floor presumably of climbing a tower all the way up to the 100th floor and then completing all the missions. There are trophies for completing all the missions using all of the different characters. There's a ton of them. Um I want to say that there's got to be 0. So complete the game use complete all missions with Williams with Ralper with Linda or Linda M with uh Abod Abobo with right arm with Bernov with Chintime with Mason Cody Jake etc. So uh kind of neat dual platinum. I love Double Dragon when I was a kid. I loved it. If this game is any good and I don't know that it is. Uh I'm going all in. Oh yeah. Yeah, that's right. Okay, good. Cuz I got to reconnect with my childhood. Uh if you guys want to go uh PSM profiles and check it out, there's a bunch of other games that have been put up. Typo Man Revised, Toy",
      "start": 3752.4
    },
    {
      "text": "right. Okay, good. Cuz I got to reconnect with my childhood. Uh if you guys want to go uh PSM profiles and check it out, there's a bunch of other games that have been put up. Typo Man Revised, Toy Odyssey, that game, Need Deep, Kill the Bad Guys up here. Um Line Lights up there. So some of the games we talked about, this game Super Magical um is like a Snood Light game on VA and PS4 and PS3. I downloaded it, bought it this weekend. I thought I'd play it to um like when I was watching TV. Didn't do it for free. I actually formatted my entire VA. I was like, I'm so sick of looking at all these games. I'm like, I'm just deleting all of you. I don't I don't think I care. Did you upload some saves? I uploaded two saves out of like the 40 games on my on my thing. I'm like, you know what? Why do I need any of these games anymore? Uh I feel I feel like, you know, like I've been looking at **** Hotline Miami for like two years. I'm like, it's just not going to happen right now. Doesn't",
      "start": 3801.84
    },
    {
      "text": "do I need any of these games anymore? Uh I feel I feel like, you know, like I've been looking at **** Hotline Miami for like two years. I'm like, it's just not going to happen right now. Doesn't need to be on here. Environments are too big. The big the big thing that I wanted to say was I was playing that game, that video game, Exiles End, which sucks. And I have trophies on it and I'm like, I don't want these trophies. And so I was like, the only way I can do it is to format this. Oh, so you never you never connected to the internet to get him. Interesting. Interesting. All right. Why did you want the the Gun World trophy should have been called Mori Arti? I just wanted a I just want a trophy that's just called Morardi. Well, that's fine, but I I mean the Gun World one like I feel like No, but it should have been the kid's name if anything. No, I I doesn't be related to that trophy. I just don't want there to be a trophy. You want in the future there to be a Morardi trophy? Well",
      "start": 3840.8
    },
    {
      "text": "No, but it should have been the kid's name if anything. No, I I doesn't be related to that trophy. I just don't want there to be a trophy. You want in the future there to be a Morardi trophy? Well, we always say knob switch was a missed opportunity. Yeah, that was a big insult. You and me did all this work. That was a really big insult. I got to be honest with you. It was a huge insult. Like the game, that's our game. That's our name for a game. Even was not even Scott Rod. It's not literally our game. It's your idea, I guess. Mario. Okay. Well, you just name We made up a name. We made And you have the nerve not to put any O to us in there at all. No, I don't think so, sir. Yeah. Also, no offense to that game, but I was looking at I was just searching through the VA store in Vita. Man, that game's getting beat up compared to a lot of other games. Yeah. I got the new issue of what's that Vita magazine? I get the Vita. The Vita Patreon, you know what I'm talking about, right? Small one.",
      "start": 3876.72
    },
    {
      "text": "game's getting beat up compared to a lot of other games. Yeah. I got the new issue of what's that Vita magazine? I get the Vita. The Vita Patreon, you know what I'm talking about, right? Small one. Uh, Vita Vita Life. Vita Lounge. Lounge. The Vita Lounge. I got the new Vita Lounge one. They they they had a knob switch review in there in which they talk about us, of course. Give the history of it here. You know what I mean? Even though the game wants to turn their back on us like a bunch of sons of **** Uh, Colin, did you know that for trophy time we have a new most popular segment? So many people wrote in about the new segment, this trophy can go **** itself. But lots of fans of this. Jellybelly 100 wrote in to kindafunny.com/psq and says, \"What's up, guys?\" after last week's edition of trophy time. I have another entry for this trophy can go **** itself. I nominate the expert of war trophy from Homeront on PS3. After playing the online multiplayer for 5 hours, me and all my",
      "start": 3910.32
    },
    {
      "text": "of trophy time. I have another entry for this trophy can go **** itself. I nominate the expert of war trophy from Homeront on PS3. After playing the online multiplayer for 5 hours, me and all my friends playing encountered a stat reset bug that reset all the progress towards this trophy, which requires the player to earn every unlock for every gun and kill streak in the game. Being the last trophy that I needed, a gold no less, I was robbed of the platinum. This happening back in 011, but the gaping hole left in my platinum collection still haunts me to this day. Thanks for this awesome show. That trophy can go **** itself. Jelly Belly 100. Well, there's a gaping hole in New York City where Chaos Studios used to be too. So So I guess you're the one who got the last laugh. Gamer on weekends wrote in and said, \"My this trophy can go **** itself entry is what for those very essential kind of trophies that ask you to watch every something but don't keep track of what you've seen.\"",
      "start": 3952.88
    },
    {
      "text": "wrote in and said, \"My this trophy can go **** itself entry is what for those very essential kind of trophies that ask you to watch every something but don't keep track of what you've seen.\" It happened with the navigate like Drake trophy in Sly 4. The **** developers wanted me to just hit pause and see the map. But every **** map by the end of the game, I had no idea which maps I had seen. So, I had to go to every location just to press and pause and leave. And you would think that was 013. Developers by now should have learned those trophies aren't fun. But no, just finished my second playthrough of the new Ratchet and Clank. Waiting to platinum the wanting to platinum the game, I went to see which trophies I missed. And surprise, surprise, another one of these **** The Death by Disco trophy. Use the Groovatron in every type of enemy. Well, **** you. I probably missed like one guy and I'm not going to go to a new playthrough just to find out which. So, **** you, Trophy.",
      "start": 3992.56
    },
    {
      "text": "Disco trophy. Use the Groovatron in every type of enemy. Well, **** you. I probably missed like one guy and I'm not going to go to a new playthrough just to find out which. So, **** you, Trophy. So, in conclusion, **** Senzaru and **** Insomniac. That's too far, but okay. Dial that one back a little bit, gamer on the weekend. I uh I hear you. I uh one one that stood out to me that I was so lucky that I was just as meticulous as I was was the Order 1886. Uh this was this is hand of God, though, where you came into my room, right? And you're like, I'm missing one **** thing. You're like, wait. And I went over and I was going over to get one. You're like, I didn't. Oh, that's it. That's the one. And you went back and got it. I was like, games that do not track collectibles, do not track these kinds of things are are just miserable. I I hate that **** This was the thing with The Division over the weekend of a hundred times using my signature move, but there's nowhere keeping",
      "start": 4030.72
    },
    {
      "text": "track these kinds of things are are just miserable. I I hate that **** This was the thing with The Division over the weekend of a hundred times using my signature move, but there's nowhere keeping track of how many times you've done that. And so, yeah, I was like, maybe I'm 10 away, maybe I'm 90 away. I'm just sitting there doing it over again. Like, come on. This is what we're talking about with the trophy consultant business. It's just not that hard. And of course, it's just not that hard. Come on. Yeah, Xbox tracks it in the achievements, which is good that they force people to do that, which means that for crossplatform games, that thought has already gone into the the and that's just tracking numbers to be fair because it wouldn't be like it wouldn't tell you which Groovatron guys you've gotten. It would say, you know, of 0, right? But but the point is is that's still well not from Ratchet because that's a PS4 exclusive, but that's still in the metadata in a sense for how",
      "start": 4068.16
    },
    {
      "text": "you've gotten. It would say, you know, of 0, right? But but the point is is that's still well not from Ratchet because that's a PS4 exclusive, but that's still in the metadata in a sense for how they're constructing these trophy and achievement list. You think that they would just parlay that over. Yeah. But you would think wrong, I guess. And then the other thing, of course, recently we did the people started writing in wanting shout outs, pats in the back. Uh a lot of people have a problem with that, too. It turns out here's Ryan. Ryan wrote in and said, \"Hey guys, may go into full heel wrestling mode for trophy time. Will you allow that call?\" Yes, I'll allow it. Thank you. Hold up a goddamn second. Do we have people bragging in here? PS I Love You XOXO about putting 80 something or 100 something hours into a platinum trophy. That's cool, I guess. But I didn't realize all your listeners were from Babyville. I sunk 300 hours into Metal Gear Solid 5 to get the platinum. Somebody",
      "start": 4099.92
    },
    {
      "text": "100 something hours into a platinum trophy. That's cool, I guess. But I didn't realize all your listeners were from Babyville. I sunk 300 hours into Metal Gear Solid 5 to get the platinum. Somebody fight me. Hey, remember when Greg was going to platinum Metal Gear Solid 5? Ah, good times, Ryan. My god. By God, Ryan just tore him a new one out of the blue. Somebody get the damn cops on. Where are the paramedics? Let's keep going with reader mail then. See what the readers have to say who are actually listeners, but whatever. Thanks as always to Jericho over on the Kinda Funny forums. That's kindafunny.com/psq for combi compiling all the questions for me. Colin, it's time for Kie Collie pick you possibly want. You can you can get Neo, you can get Oh, okay. Outlaw Reaver says, and again, I'm gonna read it the way he wrote it. Outlaw Reaver says, \"Hey, Colin and Greg, got a question for you guys. Do you think that Sony is banking on the game Neo to sell as well as Bloodborne? If",
      "start": 4136.96
    },
    {
      "text": "I'm gonna read it the way he wrote it. Outlaw Reaver says, \"Hey, Colin and Greg, got a question for you guys. Do you think that Sony is banking on the game Neo to sell as well as Bloodborne? If so, could Team Ninja have a massive hit on their hands, as well as the confidence and fan base to support to continue the Ninja Gaiden franchise, whether it be a reboot or a numbered sequel. Thanks, Oval Reaver. I must express something that we were talking about last week with Neo, that somehow along the way, quietly, very I missed somehow, we both missed that Techmo Koi no longer publishing this game. I had no idea that Sony picked this. I I would know this. I don't know remember what I remember ever talking about. I don't remember ever seeing a news story about it. Yeah. But we reached I was like, \"Oh, Neil comes out, too. He must reach out to Techmo and get the game.\" So, you did that and then we're like, \"Oh, Sony's publishing.\" I'm like, \"Sorry, we're not publishing this game anymore.\" In",
      "start": 4182.64
    },
    {
      "text": "\"Oh, Neil comes out, too. He must reach out to Techmo and get the game.\" So, you did that and then we're like, \"Oh, Sony's publishing.\" I'm like, \"Sorry, we're not publishing this game anymore.\" In November of PlayStation took it over. I was like, \"What?\" I'm like, \"I don't remember that ever happening, but I believe you.\" So, then we we reached out to Sony and and such, but uh I think that no, there's no way it's going to be as big as Bloodborne. I don't think there's any way it's going to be as good as Bloodborne, but uh this is the kind of game that thrives on Sony platforms. And um this mixture of Dark Souls, Anim Musha, whatever the hell they're doing, really much more Dark Souls than anything, I think will really appeal to the fan base that's here that was really cultivated in the beginning with Demon Souls a long time ago. And uh so I think first of all, Sony clearly has a hit on their hands. The one not going to do Bloodborne numbers. No, the one question I have here, and I'm",
      "start": 4223.76
    },
    {
      "text": "with Demon Souls a long time ago. And uh so I think first of all, Sony clearly has a hit on their hands. The one not going to do Bloodborne numbers. No, the one question I have here, and I'm saying a hit, and I don't know if it's going to be a critical hit, but I think it might be, but commercial, I think it's going to do very well commercially. Uh my one concern from just the business optics of it, the optics of it is why would Techmoi release it? In other words, TU Ninja closely ass associated with Techmo. Were they not seeing good numbers? Were they offered a lot of money to just remove themselves? The game was already a PlayStation exclusive. So, I'm a little confused about that particular aspect where there's something strange about that to me whether or not in Demon Souls whether or not something publish it here. It's weird. Like, I think it's strange. Um, but uh that aside, I mean, you're hearing almost nothing but positivity about the game. And I think it was very bold of Team",
      "start": 4258.84
    },
    {
      "text": "not something publish it here. It's weird. Like, I think it's strange. Um, but uh that aside, I mean, you're hearing almost nothing but positivity about the game. And I think it was very bold of Team Ninja to uh put out multiple alphas um basically letting people just play the game over and over again. um which I think and I've criticized in the past for other games, but for this kind of game I think is really interesting uh because of the nature of what the game is and I think would engender it has engendered so much more support. This game would have been farted out into the wind if it wasn't for those particular alphas and the access that pe the general people had not only press but but everyone had to the game. It's it's caused a lot of buzz. People are talking about this game. Um so I just want to say that I had no idea that that I have no clue and I I I don't I don't quite understand why that is. I'm sure I could Google it and find out in one minute, but I'm just not going to do",
      "start": 4310.8
    },
    {
      "text": "just want to say that I had no idea that that I have no clue and I I I don't I don't quite understand why that is. I'm sure I could Google it and find out in one minute, but I'm just not going to do that. Colin. Mhm. I got a VR rabbit hole for us to stumble down. The first one comes from one peg. You can lean back. It's a novel, but he's very positive about it. He's respectful. You know what I mean? Hey, Greg and Colin. Sorry to beat a dead horse here, but your PSVR conversation struck a chord with me last week. I apologize in advance if this sounds like I'm attacking you. I'm not. I'm simply trying to offer a different view. Do you think that there is a double standard when it comes to content on Sony and Nintendo consoles/p peripherals? For example, Shu Heralded the PSVR is essentially launching a new console again. While my expectations were in check, this led me to believe he meant we would see great but sparse firstp party titles appearing to hardcore fans alongside compelling",
      "start": 4344.48
    },
    {
      "text": "launching a new console again. While my expectations were in check, this led me to believe he meant we would see great but sparse firstp party titles appearing to hardcore fans alongside compelling indie titles. Launch consisted mostly of small indie experiences, which was entirely fine. I had fun with these and dropped around $150 to support the amazing technology and show developers that VR has a market. I was eagerly looking forward to PSX where Sony can talk directly to their fan base about things normally left off the E3 stage. Yet, PSVR was nowhere to be found in any meaningful capacity. It felt like an unwanted nuisance to Sony and had no true showtime. It seems like we have yet another year of small indie experiences with no full games aside from RE7. This to me doesn't feel like the launch of a console. It feels like the launch of a per peripheral being quickly forgotten. In PS1's first North American year, we got Mortal Kombat 3, Rayman, Tekken, Doom, Wipeout, Resident Evil",
      "start": 4386.64
    },
    {
      "text": "launch of a console. It feels like the launch of a per peripheral being quickly forgotten. In PS1's first North American year, we got Mortal Kombat 3, Rayman, Tekken, Doom, Wipeout, Resident Evil, Crash Bandicoot, and more. We all look we all look on and simply nod our heads, accepting that this was PSVR's fate all along. Essentially, no firstp party lineup announced as of yet, no killer apps yet, and a plethora of short small experiences. While I'm happy that we've gotten so far, I want PS I'm want VR to expand in new areas in the future, which can't happen if we get just short small experiences. I believe in the tech, but not Sony. Yet, the Switch is now deemed a failure before launch despite its solid firstp party support throughout 017. I know it's unfair to compare VR to a full console, and that Nintendo needs to do a better job with third parties, but Sony itself called VR a console in its own right. Yet, it's refusing to back it up with firstp party content. Nintendo already",
      "start": 4427.2
    },
    {
      "text": "and that Nintendo needs to do a better job with third parties, but Sony itself called VR a console in its own right. Yet, it's refusing to back it up with firstp party content. Nintendo already seems to care more about Switch than Sony but does about VR, which honestly is making me more excited for Switch titles than PSVR titles in 014 017. A console can't fully succeed with only firstp party content as we've seen with the Wii U. However, it can't it also can't succeed with only third party content as evidenced by the PlayStation VA. Thanks, boys. One peg. Um, I don't know. I mean, to me, PSVR does feel like a console launch. I mean I I PS1's launch was fine. I mean battle arena to all this kind of stuff, but I mean the but yeah, the first year was strong. PS2's first year was bad. Um I think just totally not good until Oh, Anusha um was really the first game of any weight that came to PS2. Um and thank you for not saying Bouncer. I mean I liked the Bouncer, but it was not it was",
      "start": 4471.04
    },
    {
      "text": "I think just totally not good until Oh, Anusha um was really the first game of any weight that came to PS2. Um and thank you for not saying Bouncer. I mean I liked the Bouncer, but it was not it was you know I liked a lot of things when I had a PS2 with no games to play. Uh Fanta Vision and all this. So, uh and I mean just there's just so much garbage on PS2 in the first year. Uh I don't um disagree, but I also don't agree. I just think yeah it feels like both. Uh to me, it feels like an ear it feels like a console launch. It also feels like it's letting they're letting it die. But I just don't believe that that's the case. Um based on the way they were talking about I don't think this is Move. I don't think this is any of those kinds of things, PSTV or whatever. So, I think I think it is a double standard, but I do think there's it's not black and white. It is apples and oranges. It is a double standard because they're saying it's a console launch who's saying it's like",
      "start": 4517.44
    },
    {
      "text": "I think it is a double standard, but I do think there's it's not black and white. It is apples and oranges. It is a double standard because they're saying it's a console launch who's saying it's like launching it, but it's not. It is a peripheral. It it it does it does require the most successful console on the market right now, which is their focus, the PlayStation 4. And so, yeah, we still are in this weird thing of like, all right, cool. What is the future of PlayStation VR? And where is the next big thing and what do we do with that? Um, but I think the fact that again there's a PlayStation VR game coming out this week, like it's not like PlayStation VR games aren't there. And we have a couple more questions that talk about this and examine it a bit more. So, let's I'm going to bring it into the conversation. I'm bringing in High-5 music. High five says, \"Hey guys, regarding Resident Evil VR, you two, as well as Dan Riker in his Giant Bomb review said that while VR mode was cool",
      "start": 4560.4
    },
    {
      "text": "it into the conversation. I'm bringing in High-5 music. High five says, \"Hey guys, regarding Resident Evil VR, you two, as well as Dan Riker in his Giant Bomb review said that while VR mode was cool, you wanted to relax and play traditionally. We finally get a AAA VR experience, and some of the people most excited for VR opt not to play it that way. We dismiss many we dismiss many many VR experiences, but then don't play a full game either. Is there a middle ground they're missing? Perhaps a way of playing with traditional twin stick camera movement but just have a screen in your face mode. Uh that way you can relax and still have the pseudo immersion or is the head movement in VR what makes the experience thanks high five music. I mean I wanted to play Resident Evil in VR. I mean this was this is what I'm talking about with the like you can't **** win and you can't please anyone uh situation especially with this show. Like we got the game early. I was watching my",
      "start": 4595.04
    },
    {
      "text": "this was this is what I'm talking about with the like you can't **** win and you can't please anyone uh situation especially with this show. Like we got the game early. I was watching my girlfriend's dog at her at our house uh for several days at a time in a row. So my mind and my my first instinct was like I'll just wait and play it when I go home next week on VR and in the meantime I'll play something else and then I'm like oh but we're having a conversation and people are going to get mad at me if I don't play it. Um so then I played it on there uh normally to in order to get that review out and then everyone's like well you wanted to play on VR and you didn't and it's like well I can't **** win. So well for high five music that's not where he's coming at from. He's speaking specifically to me who did play four and a half hours of VR and then came home that day and was like I want a traditional experience. I think well no he said some of the biggest advocates of the VR",
      "start": 4637.6
    },
    {
      "text": "specifically to me who did play four and a half hours of VR and then came home that day and was like I want a traditional experience. I think well no he said some of the biggest advocates of the VR of the of playing VR ended up not doing it which I think is me because I was the one who said I wanted to play the whole thing well he's including you me and Dan in the same thing so there's multiple advocates in there and I guess Dan's review which I have not read echoes what I said is all I don't think it's him coming down hard on you uh I don't I think he says though is there a middle ground they're missing perhaps a way to I don't I think the middle ground is this is the fact that again VR is a new way to play it is a new way to learn it's I know it sounds stupid but we've been playing games a certain way for a long long time. And that's what gaming is. And so as cool as the VR was and as great as an experience it was, I missed playing the way I wanted to play it. And seeing as",
      "start": 4670.88
    },
    {
      "text": "games a certain way for a long long time. And that's what gaming is. And so as cool as the VR was and as great as an experience it was I missed playing the way I wanted to play it. And seeing as how I can play it that way I can't play in the couch or I can't play it on VR. I went over and did it that way. In the same respect I mean, Rez is a game I've played before. Now that it's in VR, I want to play it that way. But that's meant that Rez is just sat on my PlayStation 4 for a while because I need to be in that headspace in that thing. And I think that's the point that we're coming to. The middle ground is what we're at right now where we have to start relearning to play games and having that desire to play them that way until it becomes second nature till those training wheels come off and that's what we're doing. There's just not enough time for me to play everything I want to play. So the you know and I'm I'm letting lots of games go because of the nature of my life like I",
      "start": 4705.36
    },
    {
      "text": "off and that's what we're doing. There's just not enough time for me to play everything I want to play. So the you know and I'm I'm letting lots of games go because of the nature of my life like I just there's other things I want to do other than play games. So um so it's VR has just become very supplementary. Um I think Resident Evil 7 would have been a great way for me to have played it again had I been in an environment in which that would have been conducive to do that. I wasn't. So, uh, and we're always going to fall back on what's easiest. And as I said, I think a week or two ago on the show, I really did, um, in the leadup to VR and even having VR kind of, uh, preliminarily did not pay credence or did not think about this the simple fact that, um, old habits die hard and that there's going to be this this this inevitable gravitational draw to playing games the way they used to just because it's easier. And I'm and we're all at the end of the day when we're just playing games",
      "start": 4739.36
    },
    {
      "text": "going to be this this this inevitable gravitational draw to playing games the way they used to just because it's easier. And I'm and we're all at the end of the day when we're just playing games and looking to relax, we're all profoundly lazy. I want the quickest possible route to playing games as easily as possible, which is why I don't play PC games, for instance. Why I don't get think that that's a worthwhile ecosystem whatsoever for a person like me. So, that kind of goes hand in hand with this. Uh, and then rounding out these VR questions, Odd Dino responds, \"Hey, Greg and Colin, I've just finished playing through Resident Evil 7 using only PlayStation VR. Honestly, it's one of the best experiences I've ever had with a game. Having Resident Evil finished, I am now all more eager to play long games in VR. Uh, I enjoy all the smaller games and tech demos, but I'm ready for big experiences. Not necessarily AAA, but a game I can get more invested in than a fun arcade game or something like",
      "start": 4778.32
    },
    {
      "text": "games in VR. Uh, I enjoy all the smaller games and tech demos, but I'm ready for big experiences. Not necessarily AAA, but a game I can get more invested in than a fun arcade game or something like Batman. The next game that seems like it could satisfy for me for that is Farpoint. I got to play the demo before VR was out and thought it was incredible, but I barely hear anybody talking about it and the developers are being pretty silent about the whole thing. What do you guys think? Have you had a chance to play Farpoint? Are you as eager as I am? Farpoint looks awesome. Yeah, I've only seen it. I haven't played it. I won't I haven't played it either. When we were at PSX, we were running around doing the show, doing a couple I also won't play PSVR anymore in in in public places uh cuz I'm not putting those things on my face. Your eye grew. Uh but uh yeah, Faroint looks great and uh is the kind of experience I think will be quite again gravitational for me to get back into PSVR. Good",
      "start": 4815.92
    },
    {
      "text": "not putting those things on my face. Your eye grew. Uh but uh yeah, Faroint looks great and uh is the kind of experience I think will be quite again gravitational for me to get back into PSVR. Good good VR shooter. I hope that when that comes up though that they put and I don't know they or the developers or who Sony somebody's putting thought into promoting it because that had did the thing where like when when Robinson first was like announced we're all like oh that looks really cool and then it was like one Tuesday oh here it is like oh what the **** like I didn't realize it was coming out now and there's a million other things coming out right now and it's another game that I want to play sitting on my machine there waiting for me to do something with it. Colin final question. It can be PlayStation Plus related. It can be classic games with trophy support. It can be Dragon Quest or it can be Last of Us. Dragon Quest obviously. Bazoo writes into kindafunny.com/pq and says",
      "start": 4853.92
    },
    {
      "text": "can be PlayStation Plus related. It can be classic games with trophy support. It can be Dragon Quest or it can be Last of Us. Dragon Quest obviously. Bazoo writes into kindafunny.com/pq and says, \"Hey, Greg and Colin.\" Hello. Hey. He said, \"Please wait for Colin to respond, but promptly interrupt him when he does. Is there any hope for a Dragon Quest fan like me to see Dragon Quest 8 come to the PlayStation 4? It would be awesome to really play this game with trophies. I know an updated version just came out for the 3DS and I have no idea how game licensing works. Will I have to play this gem on the 3DS or should I wait and hope? You can wait if you want, but I don't know that anything is going to bear any fruit. Square is kind of strange in the fact that they they're one of the few companies that publishers that really are in bed with Nintendo and PlayStation almost equivalently. Um, so Nintendo seems to be getting the better stuff out of them and uh which is fine. Uh, Dragon",
      "start": 4890.96
    },
    {
      "text": "companies that publishers that really are in bed with Nintendo and PlayStation almost equivalently. Um, so Nintendo seems to be getting the better stuff out of them and uh which is fine. Uh, Dragon Quest 8 is a beloved PS role playing game. So, if you want to if you want to play it I I would probably just go to 3DS. I don't anticipate that they're going to release it as a PS classic, although that's possible. Um, but I don't know that it's in the cards necessarily. It seems like Dragon Quest specifically, we'll get the new Dragon Quest games on PlayStation 4 with Dragon Quest Heroes and with Dragon Quest 11, but I do not anticipate that we will get new games uh or the old games made new again, like they're getting on 3DS for instance. And remember that the Dragon Quest games go back to uh you know, god they released four, five, and six on on uh DS years ago as well. So they've that that's more where they're kind of funneling games right now. Okay. I think Colin, are you ready to",
      "start": 4936.24
    },
    {
      "text": "to uh you know, god they released four, five, and six on on uh DS years ago as well. So they've that that's more where they're kind of funneling games right now. Okay. I think Colin, are you ready to meet your new best friend? Yes. This segment is PS I Love This Best Friend XOXO. This is where one of you goes to kindafunny.com/forum, goes to the PS I Love You board and posts your PSN name so we can read it here. You can get awesome friend requests and messages of support. This one might be spam. It comes from BJ. BJ writes, \"Lady M, I real beauty of a right, dear friend. Love this one of yours, too. G L Y A SDI. Hugs, love, blessings, BJ.\" So, I think the PSN name is G L Y A S DI or it's spam. Sorry, I tuned out. So everybody figure out if G ly a D SDI is a real name for a real reader mail. Let's check in with Gator Eliminator for this week's forgotten PlayStation game. Greetings Growlin Millardi. And then he tries to say Tim and Nick's name together. I'm not going to try that.",
      "start": 4970.48
    },
    {
      "text": "mail. Let's check in with Gator Eliminator for this week's forgotten PlayStation game. Greetings Growlin Millardi. And then he tries to say Tim and Nick's name together. I'm not going to try that. Here is the situation. My new and wonderful wife made authentic New Mexico green chili for dinner. and what I can only assume are peppers grown on the fourth floor of hell. So there I sat on my porcelain throne, body temperature through the roof, taste taste buds emulsified, angel soft three ply on the ready and the air raid claxons blaring because ordinance this hot hadn't been dropped since the firebombing of Dresden. Needless to say, this wasn't the scenario I envisioned to remind me of a forgotten PlayStation game, but when inspiration strikes, it must be listened to. Also, with a new poop friendly theme to the show, it feels appropriate. Let me take you back to the before times. The long ago of 007 when Rihanna was under her umbrella and Mim was desperate to explain just exactly why",
      "start": 5030.68
    },
    {
      "text": "friendly theme to the show, it feels appropriate. Let me take you back to the before times. The long ago of 007 when Rihanna was under her umbrella and Mim was desperate to explain just exactly why he's hot. Mims don't remember that one. This is why I'm hot. This is why I'm hot. This is why. This is why. This is why I'm hot. I'm hot. Cuz I'm fly. You ain't cuz you're not. This is why. This is why this is why I'm hot. And a little game called Chili Con Carnage for the PSP. Its gameplay is ridiculously fun. The writing is hilarious. And you get to kill more drug dealers than an entire season of The Wire in one sitting. Seriously, if leaving a bloody swath of bodies from a double uzzy armed bullet tornado is wrong, then I don't want to be right. Some schmuck named Chris Roer gave it a 7.7 because of those dodgy PSP controls, but it was clearly an 8.5 or a nine. Because of this horrible miscalculation, I bet no one would ever immortalize this game in a report. Do you guys remember this",
      "start": 5077.28
    },
    {
      "text": "because of those dodgy PSP controls, but it was clearly an 8.5 or a nine. Because of this horrible miscalculation, I bet no one would ever immortalize this game in a report. Do you guys remember this hidden gem? If so, what did you think? Gator Eliminator. I I was there uh right around this when this is happening. Obviously, 007. I remember it being a thing. I never played it. I never played it either. I remember the name. That was Roer played it though. He gave a seven seven. So it's good. Almost great. And I stand with Roer as he reports. Colin. Yes. Time for you. The PSN's worst name of the week. As you know, ladies and gentlemen, Shuhei Yoshida hates you and he won't let you change your PlayStation Network name no matter how many years and PSXs go by. So, you go to kind offunny.com/forum. You put up your bad PSN name and you beg Shuhei to let you one day change your name. This one comes from D. That's how it spells. D. That's not the name. D. It's his forum name, not his PSN name.",
      "start": 5123.76
    },
    {
      "text": "You put up your bad PSN name and you beg Shuhei to let you one day change your name. This one comes from D. That's how it spells. D. That's not the name. D. It's his forum name, not his PSN name. You see me? Mhm. Hey, CG. My PSN name is not at a glance a candidate for worst PlayStation Network name of the week. However, it comes with a story that gives me a compelling reason to want the ability to change my name. So, let me paint the picture. The year is 010, the game Call of Duty Modern Warfare. The PSN name Captain Curly. That's CPT Curly. That's Captain, right? Not Corporal. Captain Curly. So, here I am, a 19-year-old Australian boy in my room shooting everything I see when I hear the familiar jingle of an incoming PSN message. I didn't recognize the username and I'm not used to getting the odd random message, so I open it. The message simply says, \"Are you a girl?\" I, of course, reply, \"Yep, you.\" What followed would leave me forever scarred. Upon asking ASL, to which I",
      "start": 5165.12
    },
    {
      "text": "to getting the odd random message, so I open it. The message simply says, \"Are you a girl?\" I, of course, reply, \"Yep, you.\" What followed would leave me forever scarred. Upon asking ASL, to which I replied 15 and female because I wanted to know where this was going, this random individual asks asked me for a picture. Panicking, as you can see, I'm actually an older gentleman. I say you first. He doesn't reply right away. Did I scare him off? Is he preparing a cute outfit? Minutes pass until the jingle comes through again. I open the message and the site I see makes me recoil in horror. It's a trouser snake. A vagina minor. Yep, the dude sent me a dickpick. I immediately report him, but I live in constant fear. Clearly will find my PSN again and haunt my dreams with blurry images of his tiny Tim. Please, Shuhei, let me change my name. I don't want to see that dick again. D. All right, Colin. That's dark. Yeah. If you're in love with somebody or hitting it off with a 15-year-old",
      "start": 5211.84
    },
    {
      "text": "his tiny Tim. Please, Shuhei, let me change my name. I don't want to see that dick again. D. All right, Colin. That's dark. Yeah. If you're in love with somebody or hitting it off with a 15-year-old female, you shouldn't send a dickpick, right? Uh, no. You shouldn't do that. You know what you should send? Pro Flowers, the sponsor of PS I Love You XOXO this week. Aren't you tired of guessing what she wants for Valentine's Day? Wouldn't you love an easy, failproof way to make yourself look like a pro this year? Pro Flowers is making it easier than ever by taking all the guess work out. On top of their already low prices, right now you can get two dozen assorted roses with free glass vase. A free glass vase for $29.99 plus shipping and handling. Or upgrade. And for $9.99 more, you can get two dozen long stem assorted roses with premium vase and chocolate. It should be a premium vase, guys. Just go to proflowers.com and use the code xoxo. Help support our show by supporting our sponsor.",
      "start": 5255.48
    },
    {
      "text": "dozen long stem assorted roses with premium vase and chocolate. It should be a premium vase, guys. Just go to proflowers.com and use the code xoxo. Help support our show by supporting our sponsor. Use the code xoxo at proflowers.com. Pick your flowers and then check out in two minutes. Two minutes. Colin, seems like a long time. Well, it's cuz you got to pick the flowers. What do you want? You know, you don't. So, don't wait. Order today. The deal expires soon. Two dozen assorted roses. 30 bucks. Pro flowers. XO. That was a great Greg Way, though, right? Give me that much. That was pretty good. Thanks, buddy. It was pretty good. If you didn't know, this has been PS I Love You XOXO. It is kindafunny.com's PlayStation podcast. It is the number one PlayStation podcast in the world because of your support. And it posts every Tuesday at 9:00 a.m. Pacific time. Rain or shine on youtube.com/kindfunnygame and podcast services around the globe. Please listen to everything and rate it and",
      "start": 5300.4
    },
    {
      "text": "of your support. And it posts every Tuesday at 9:00 a.m. Pacific time. Rain or shine on youtube.com/kindfunnygame and podcast services around the globe. Please listen to everything and rate it and share it and send it to your mom and say, \"Look at these idiots. They talked about a dickpick to a 15-year-old and they made it into an ad because they're **** dope.\" Every episode of PS I Love You XOXO ends in a song in a segment we call singing a shoe. This is where one of you talented **** heads over to kindafunny.com/psm. You give me an MP3 that I put at the end of our MP3. I give me a YouTube link that'll annotate from our YouTube. We play music and everybody has fun and makes friends and changes their life. Right, Colin? I think they just listen to music and then go about their day. Incorrect. Friend of the show a submitter to every one of the songs we've ever done in the whether it be Beyond or Here multiple times. Chris from Life in 4 Frames has written in with a new song",
      "start": 5344.08
    },
    {
      "text": "Incorrect. Friend of the show a submitter to every one of the songs we've ever done in the whether it be Beyond or Here multiple times. Chris from Life in 4 Frames has written in with a new song and he says, \"You guys are the best.\" And he's talking about you, the community. So, over the last six months, a lot has happened with Life in 4 Frames and the future of our new record, Control Plus Z. You may remember last year we released a couple of songs ourselves, November and April. These two songs generated some interest from labels thanks to you guys and the amazing community. So, we are happy to finally announce we have signed with a brand new label called Gold Standard Records. This is incredibly exciting for us, not just for the obvious reasons, but this label is distributed via Sony. The label made the official signing announcement last Friday with the release of our official single titled January, parenthesis My Condition. For those of you unfamiliar with the new Life in 4 4",
      "start": 5382.84
    },
    {
      "text": "The label made the official signing announcement last Friday with the release of our official single titled January, parenthesis My Condition. For those of you unfamiliar with the new Life in 4 4 Life in Frames 4 Life in 4 Frames new album. It is a concept album. It will have 1 tracks January through December that chronicle personal ba chronicle a personal battle through a very tough year coping with life-changing anxiety, loss, childbirth, and perseverance. Reflecting on our very personal experience we had in our lives in writing and recording this album, I understood how incredibly isolating, alienating, and lonely these things could make me feel. For me at the time, no one could possibly understand what I was experiencing. Our hopes is that just like the music we were listening to during those times helped us, someone will hear this and relate. Maybe even feel not so isolated, alienated, or alone. I learned there is always someone out there who understands. You are not",
      "start": 5424.8
    },
    {
      "text": "to during those times helped us, someone will hear this and relate. Maybe even feel not so isolated, alienated, or alone. I learned there is always someone out there who understands. You are not alone. The song you will hear in the audio version of PS I Love You XOXO is actually both January and February from the record to give everyone an idea of how the album flows together as one big experience. For those watching the video version, the YouTube links to January My Condition. Now, here's what's important, ladies and gentlemen, because you already made Chris's dreams come true, but we need his help. This YouTube link is on the the label's official YouTube channel. So, if you like the song, please give it a thumbs up, leave a comment, and let them know where you heard us. And he puts kind of. Uh, this single release also kicks off pre-orders for Control Plus Z, which we are happy to announce releases on March 10th. It can be pre-ordered on iTunes as well as Google Play and Amazon. You",
      "start": 5466.64
    },
    {
      "text": "of. Uh, this single release also kicks off pre-orders for Control Plus Z, which we are happy to announce releases on March 10th. It can be pre-ordered on iTunes as well as Google Play and Amazon. You can also support us and the new label by heading over to Facebook and liking us and Gold Standard Records. I digress. We can honestly say we can honestly say we don't know if we would be where we are without the years of support from you guys and this goddamn amazing community. Going all the way back to 01 when Ryan Clements first played us on Beyond. Words can't express how much we value not only the friendship we have with you guys, but the entire community. P.S. We love all of you guys. XOXO. Congratulations 4 Frames. I can't say name ever for some reason. I'm stupid. I'm an idiot. **** Clemens. Hate hate him. Ladies and gentlemen, this is Life in 4 Frames with a whole bunch of cool music. Until next time, it's been our pleasure to serve you.",
      "start": 5503.92
    }
  ]
}
