{
    "id": 2306,
    "video_id": "QJ7N4g_Oh0o",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Ethics of CG Facial Reconstruction - The GameOverGreggy Show Ep. 163 (Pt. 1)",
    "description": "Nick Scarpino brings up the ethics of CG facial reconstruction.\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1484553601,
    "duration": 1986,
    "transcript_chunks": [
        {
            "text": "this episode of The GameOverGreggy Show is brought to you by MVMT Watches. MVMT Watches was founded on the belief that style shouldn't break the bank. The watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices. With over 500,000 watches sold to customers in more than 160 countries around the world, MVMT Watches has solidified itself as the world's fastest growing watch company. MVMT Watches started just $95. Now at a department store, ladies and gentlemen, you're looking at $400 to $500 bucks. MVMT figured out that by selling online they were able to cut out the middleman and the retail markup, providing the best possible price: classic design, quality construction, and stylized minimalism. Over 500,000 watches sold in more than 160 countries. Did I say that? I did. Right now you can get 15% off with free shipping and free returns by going to MVMTWatches.com/Greggy. That's MVMTWatches.com/Greggy. This",
            "start": 0.04
        },
        {
            "text": "watches sold in more than 160 countries. Did I say that? I did. Right now you can get 15% off with free shipping and free returns by going to MVMTWatches.com/Greggy. That's MVMTWatches.com/Greggy. This watch is cool. You've seen me talk about it before. Black face, red hands, black band. I look awesome. So it's time to do it, ladies and gentlemen. Step up your watch game. Go to MVMTWatches.com/Greggy. MVMT. Join the movement. What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, seducer, Nick Scarpino. Hi. Hey now, what's this going on over here? You got some, you got some smuts. I don't know. God knows. Is this one of the Kevin **** shirts? No, I don't know. This might be. You never know where you get that stuff from. You pick it up. I rub up against a lot of things. Do you're like a cat. Put your sometimes, you know, my old man spatial like awareness just kind of falters on me and I just slam into things. I keep going. This might be wall. Could",
            "start": 40.28
        },
        {
            "text": "against a lot of things. Do you're like a cat. Put your sometimes, you know, my old man spatial like awareness just kind of falters on me and I just slam into things. I keep going. This might be wall, could be cobweb, sure. Who the hell knows what it is? Well, you came in looking like a drowned cat today, dude. I got it, got, I got dumped on, man. It, it is like storming outside, seriously. I think we might talk about that later. Over here, the couscous magnet, Colin Moriarty. What does that mean? I don't like this whole new thing that you're doing. 2017 new magnet. You ever heard of couscous? Couscous. I've heard of cous. I've had couscous many times, but I don't understand this new naming. Had many times. Yeah, so you'd say it's drawn to you. Over there, the pure one, Tim Gettys. Couscous is an inanimate food. Keeps coming to you though, apparently. Lots of times you've been a magnet. It's not magnetized. I need this weekend to come really bad 'cause of football. Football, that's going to help you, you think? I don't need help.",
            "start": 99.84
        },
        {
            "text": "you though, apparently. Lots of times you've been a magnet. It's not magnetized. I need this weekend to come really bad 'cause of football. Football, that's going to help you, you think? I don't need help. I'm fine. I just last year's or last week's football games was terrible. So I need, you know, do you think these would be better? I hope so. You don't know. Saturday and Sunday. Yeah, me, couch, underwear. Tim, cous mag. Where it, where did it come from? 'Cause yesterday you guys recorded PS I Love You in the other room. I heard this. Yeah, you gave him some other weird ass name. I'm giving him 2017 Champion or some ****. No, tight socks. Tight socks. Mmm, about it. But I understand that you look down, he has tight socks. You give him that couscous magnet. Yeah, his hair kind of reminds me of couscous. I could see that grain. I can't see it. I looked up to look at my hair, but it's, but the hair moved back 'cause your hair looks good. Your hair looks good. Your hair looks good. My hair looks great today. We're having quite a good ****.",
            "start": 144.6
        },
        {
            "text": "see it. I looked up to look at my hair, but it's, but the hair moved back 'cause your hair looks good. Your hair looks good. Your hair looks good. My hair looks great today. We're having quite a good **** hair show right now. No, I like, I like it when it's like this. I, I got to get a cut. How, how short you going to go this time? The regular amount of shortness you've been going? You going to get the beard trimmed up too? Yeah, I just feel like I'm going to, can we go together this time? I want to go to this haircut place. I'm probably going to go tomorrow before I come here for the Gamescast. Full bunch of men there. I hear there are a lot of men. Yeah, just a lot of men. My dude left though. Oh no, Jesus. He's no longer there. So I had to go. I had another guy named Lis. Now, have you asked them to do like a traditional barber cut on you? So instead of, instead of just cutting it down short, have them do like a little bit of fade on the sides, just more di that requires maintenance. But you have to understand that I",
            "start": 189.84
        },
        {
            "text": "barber cut on you. So instead of, instead of just cutting it down short, have them do like a little bit of fade on the sides, just more di that requires maintenance. But you have to understand that I don't, it doesn't, I don't have that. I don't, people ask that question sometimes. I'm like, do you not understand what's going on here? It doesn't fall or fold or sit on. It's just there. It's like sheep's wool. It's ridiculous. It's a ridiculous head of hair. It's so thick. But I like it when you do what you just did to, or you ding a little bit and just got all these different edges. Now, you know what I mean? Anime, like a broke down anime character. I really think you could style that. I think you just got to go to the right guy and he has to help you. You got to believe they have to help you like get it to a specific La. I think it's more Tim saying is that the belief factor. It's also the interest factor and the caring factor. Understand both precipitously low on this. You don't need to care much though. You let the",
            "start": 230.44
        },
        {
            "text": "La. I think it's more Tim saying is that the belief factor. It's also the interest factor and the caring factor. Understand both precipitously low on this. You don't need to care much though. You let the barber, you need is the side. Yeah, the bar, the barber doesn't even need to care much. Trust me, I know. You got such a good hairline. What I like about it is it's just got all these dips and curves to it, like a planet. It's just this **** surf, like a beat up captured asteroid roaming around Saturn right now on Miller's Point. If you didn't know, ladies and gentlemen, this is The GameOverGreggy Show. Each and every week, four, sometimes five, best friends gather on this table, each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com/KindaFunny where you can get every show early along with a bunch of exclusive perks, goodies, and right now if you're giving us a dollar or more, exclusive access to Kinda Funny Live. If you have no bucks to toss our way, no big deal.",
            "start": 267.64
        },
        {
            "text": "show early along with a bunch of exclusive perks, goodies, and right now if you're giving us a dollar or more, exclusive access to Kinda Funny Live. If you have no bucks to toss our way, no big deal, head over to YouTube.com/KindaFunny where we put the entire show up topic by topic, day by day, until it goes up as one big video MP3 the following Friday. Nick, yes, what's your topic? Uh, my topic comes from Star Wars this time. It's uh, you know, un, no sand. Um, unfortunately, Carrie Fisher passed. So it begs the question, what, what do they do with Star Wars Episode VIII and IX? Well, VIII done, IX, and should they be considering doing something with her CG like Tarkin and, and like exactly in Rogue One? Yes, Rogue One, definitely. You know, Rogue One, I mean, it's spoilers. You had your shot. It's like, what? I mean, people have seen it. Anyone's watching the show, it's been in other people's thumbnails by now. It's fine. You've seen it somewhere. Um, so, you know, everyone thought it was cool. I thought it was a",
            "start": 312.72
        },
        {
            "text": "I mean, people have seen it. Anyone's watching the show, it's been in other people's thumbnails by now. It's fine. You've seen it somewhere. Um, so, you know, everyone thought it was cool. I thought it was a little uh, a little alarming. I don't necessarily like when they did this. I didn't care for it in Tron. Um, I didn't think it, well, obviously the effect didn't work that well in Tron. I didn't see it in, I didn't see Tron. So who was who in Tron: Legacy? They made Jeff Bridges younger. So his, the villain was the younger version of him. It was, it was a program, but it looked like him. Um, and so when Jeff Bridges came in, had to fight himself, which I was like, that's cool, but it didn't really work. They couldn't, I guess they didn't get the right team on it or there, there was a lot of criticism about it. It was 2008. Well, it was, but I guess they wanted the people that, the way I heard the story, and I could be completely wrong, was that the, the Benjamin Button team that, that did Benjamin Button, which was amazing,",
            "start": 360.52
        },
        {
            "text": "well, it was, but I guess they wanted the people that, the way I heard the story, and I could be completely wrong, was that the, the Benjamin Button team that, that did Benjamin Button, which was amazing, was supposed to come on here, but by that point there had been so many production delays that they lost the majority of the good guys. So they had to kind of, I guess they got the B team on it. Anyway, it didn't work and it didn't, unfortunately, it didn't even need to be that. They could have just had someone that looked like Jeff Bridges be that character or a completely different actor be that character, and I think it probably would have been okay. See, I go a different direction. I, I disagree. I don't think they could have just had a different actor. I think that they could have just changed the plot so it didn't, that's what I meant, right? I mean, obviously that he was supposed to be like a fact of, I think that that's important. Now, the one thing that I'll give Tron: Legacy in that regard is that since it",
            "start": 397.32
        },
        {
            "text": "didn't, that's what I meant, right? I mean, obviously that he was supposed to be like a fact of, I think that that's important. Now, the one thing that I'll give Tron: Legacy in that regard is that since it is a, they're inside a computer, literally. So I'm like, I'll give it that it's not perfectly accurate and whatever. What was a little more off-putting to me was the Jeff Bridges stuff and like the flashback scene and all, because then when you see what's supposed to be Jeff Bridges' character in real life and he looks exactly the same as the computer villain version, that's when it was like a little bit weird to me. And I feel like they could have cut that stuff out. See, I just feel like you, I feel like we're just in Uncanny Valley, right? I feel like no matter what happens, we are going, we as human beings will never recognize that as real. It just like, not in our lifetime at least, or not in the next 20 years. So what do you do with the people who did think that Tarkin was real? You, you line them all up",
            "start": 427.56
        },
        {
            "text": "will never recognize that as real. It just like, not in our lifetime at least, or not in the next 20 years. So what do you do with the people who did think that Tarkin was real? You, you line them all up outside. No, I'm just joking. No, I, You Can't Do That on Television. When that guy, the, remember the, the Slime, no, the, the, the character on You Can't Do That on Television that used to shoot everyone. He was, he was the Executioner and then some guy would run on and say like, stop the execution. You guys don't, no, I for the record, I, You Can't Do That on Television. No, You Can't Do That on Television. I loved as a kid, but all I can remember is the Slime and the lockers 'cause I was so young. I could tell that you were, you're older than me. I know. I watch, I mean, watch syndication. Um, sorry to interrupt with Tarkin. I can understand. I mean, a lot of people thought he was real and that was great. It was done very, very well. Um, I still kind of feel the same way, right? I mean, I guess that that Peter Cushing's",
            "start": 467.64
        },
        {
            "text": "with Tarkin. I can understand. I mean, a lot of people thought he was real and that was great. It was done very, very well. Um, I still kind of feel the same way, right? I mean, I guess that that Peter Cushing's died a long time ago and hasn't been really in the public eye since. I mean, I, I can't remember him in other movies after, you know, A New Hope for the most part. So you look at that and you're like, I guess that's sort of okay. But I mean, Carrie Fisher, everyone knows Carrie Fisher. I just saw her in a film, you know, that documentary just came out with her and her mother. I just don't know, know if people are going to be able to see that as real and if it's not going to uh, hinder the process or hinder the actual final. So they said, so to bring everybody up to speed, Episode VIII is done. They said her scenes are done, done. Her scenes are shot, done. Okay. And she's, she from what the report I heard, read was, or heard on the Colin & Greg Live or Morning Show, was the fact that uh, it's her stuff's done. She's not that",
            "start": 510.2
        },
        {
            "text": "are done, done. Her scenes are shot, done. Okay. And she's, she from what the report I heard, read was, or heard on the Colin & Greg Live or Morning Show, was the fact that uh, it's her stuff's done. She's not that big of a character, but she was supposed to be a big character in Episode IX. Yeah. So, and you want, I mean, obviously they're, they're talking about, you know, some of the things that people speculate about. Obviously she has to have some sort of scene with Kylo Ren, some sort of scene with Luke, some sort of scene with, with Rey. You know, she's, she's the leader of the, the Rebel Alliance or whatever they're calling it now. The, the 40-year uh, team of people who really haven't been able to beat the **** Empire in 30 years. Um, so I love you so much, Nick. Well, you know what I mean? It's, I know what you mean. I'm talking about people have been around doing the exact same thing. Maybe it's time to change your **** tactics a little bit. Okay. They're both pretty good job considering. I got, they're all, they let",
            "start": 551.16
        },
        {
            "text": "talking about people have been around doing the exact same thing. Maybe it's time to change your **** tactics a little bit. Okay. They're both pretty good job considering. I got, they're all, they let this smoke guy get in cut by, you know, thousand Death By A Thousand Cuts, exactly. Um, no, but I mean that, but, but it's disconcerting. What do you do? Obviously that they're, they're up against a conundrum. No, this is what I lovingly refer to as the Fast & Furious 6 conundrum, right? Or 7, excuse me, conundrum. Um, is that you don't, what do you do? What do you do? You can't not make the movie. You do that. I, I, I think that there's a tasteful way to do it. You don't agree? Yeah, you thought the end of Fast & Furious 7 wasn't, I think we're talking about apples and oranges here. I think the fact if this was Episode VIII and she was a main character there and okay, ****, we have to fill in a few holes like they did with Fast & Furious 7, right? I know we just said this, but anyway, 'cause Paul Walker stuff, a lot of it was shot,",
            "start": 592.08
        },
        {
            "text": "and she was a main character there and okay, ****, we have to fill in a few holes like they did with Fast & Furious 7, right? I know we just said this, but anyway, 'cause Paul Walker stuff, a lot of it was shot, not all of it. So then these body doubles and computers and stuff. Okay. I'm talking about the end of Furious 7 specifically where they did the actual, you think you go away without saying goodbye? Did you? I think it's a case-by-case situation where it comes down to, is it about the actor or is it about the character? And I think that in the case of Fast & Furious, that was a sendoff of the character, but the reason they did the facial reconstruction stuff was to honor him, to honor Paul Walker and his, you. So where does that leave us with Carrie though? Because she, this is not, this is not to honor her. This is because ****, we have all movie to make. And I think that that's a totally different, totally different scenario. When it comes to Tarkin, we've seen him in Rebels. We've seen him in a whole",
            "start": 630.32
        },
        {
            "text": "is because **** we have all movie to make. And I think that that's a totally different, totally different scenario. When it comes to Tarkin, we've seen him in Rebels. We've seen him in a whole bunch of other um, forms of media of Star Wars. And I think Star Wars is something where these characters are the characters and him seeing him as much as we did in Rogue One, I like I said in the review, thought unnecessary. That could have like kept it a little bit more CGI. But they obviously doubled down on it because they knew that this type of stuff was going to happen eventually and they, they need people to just get used to the, the fact that these characters are, they have story lines and those story lines are not going to change based on reality. But so, so prior to this, right, one of the more, more famous instances of this happening was Dumbledore dies. That actually played Dumbledore in the first two Harry Potter films, uh, passed away. They don't have a choice. They can't do five more movies or",
            "start": 667.56
        },
        {
            "text": "famous instances of this happening was Dumbledore dies. That actually played Dumbledore in the first two Harry Potter films, uh, passed away. They don't have a choice. They can't do five more movies or six more movies with uh, with CG. So they have to recast him, right? End up, everyone ends up, you know, it's divisive, but people got used to the new Dumbledore and he went on. Um, don't we feel like it's a little exploitative, exploitative, exploitative? You're exploiting the dead actor a little bit. You feel that way? You mean, I don't think, I don't think it's that the situation you're talking about with um, with Dumbledore is similar to the moms in Fresh Prince. Yes. Or of course, the last season of Family Matters. Aunt Viv didn't die. No, Aunt Viv didn't die. Just got ****. Can no, they just, they had some sort of disagreement in some sort of way. I'm with Tim that I think with, with Tarkin specifically, that I thought, well, let me back up to what you said were, because I, I, I've seen some people being like, I was with someone or I",
            "start": 706.96
        },
        {
            "text": "some sort of way. I'm with Tim that I think with, with Tarkin specifically, that I thought, well, let me back up to what you said were, because I, I, I've seen some people being like, I was with someone or I thought Tarkin was real. And I'm like, A New Hope was made in 1977. M.H. Peter Cushing looks exactly the same in this movie in 2016 that he looks like in 1977. You thought that a real man? Okay. Beyond that particular, the point there is, I'm sure those people didn't realize that that character was in A New Hope. But how is that possible? I mean, I think it's casual Star Wars fans who don't understand the, my wife for instance, like, oh, I, you know that, I, I didn't know that guy wasn't real. But she, I, I looked at him. I don't know anything about technology as everyone knows, right? Don't care, not really interested in it. I looked at Tark immediately and maybe it's because I know Star Wars very intimately. Maybe it's because I know Tarkin. Maybe didn't look real at all. Like, like to me, like, I'm like, you can that",
            "start": 754.16
        },
        {
            "text": "in it. I looked at Tark immediately and maybe it's because I know Star Wars very intimately. Maybe it's because I know Tarkin. Maybe didn't look real at all. Like, like to me, like, I'm like, you can that can pass, I guess. But and that's as good as it gets. It is kind of like I was going to bring up The Uncanny Valley. It isn't technically The Uncanny Valley for people out there that want to be nerdy. It's not at all. But uh, because that's like about how robots become so realistic that they actually just don't look real anymore. A term people use for, no, I know it's similar to like Occam's Razor, how we use that term where simplest explanation tends to be the right one, but it's not really what it means. The, the thing about Leia that kind of bothered me. So with Tarkin, I agree with Tim where they should have, they could have cast a normal person and just showed him from the back and when they showed the reflection of Tarkin on the window, that's as far as they should have went. I thought that that was really",
            "start": 798.32
        },
        {
            "text": "could have cast a normal person and just showed him from the back and when they showed the reflection of Tarkin on the window, that's as far as they should have went. I thought that that was really cool and I thought that's we were going to get and I was surprised immediately thereafter, not in the next scene where, but immediately thereafter they show him. I'm like, ah, this, this, that seemed to me something that George Lucas would do, right? And I didn't expect like, you know, with his obsession with, you know, the **** fakeness of the Episode I through III, which I, and I spoke about how I went back and looked at those movie, look awful now, man. It just looked terrible when I, I was watching Episode II in, in, in Mexico. Looks awful. And it just still, it's even worse. That's why I tweet, it's even worse than I remember. That was, that was how I was like, okay, it can't possibly be any worse than. And then I got to the sand scene and the Boba Fett. And I was like, the Boba, the Leia thing I thought was",
            "start": 832.12
        },
        {
            "text": "worse than I remember. That was, that was how I was like, okay, it can't possibly be any worse than. And then I got to the sand scene and the Boba Fett. And I was like, the Boba, the Leia thing I thought was an unforced error because Leia looked way worse than Tarkin, first of all. And second of all, they could have just showed her putting her hood on from the back. It's, I don't understand like why they forced this particular thing. Made, made a, made, but it would have been cooler. It's the same argument I made. I know it's redundant to people where they should have never showed Luke at the end of 7. You know, like they should have just had that thing whirling around the guy in the hood because you know who it is, or at least you think you know who it is. And with that iconic, those buns in that iconic white cloak on the, on the Corellian Corvette with the codes, it would have just been awesome if she just put her hood up and interacted with R in some way and that was the end. They didn't need to show her. It",
            "start": 864.52
        },
        {
            "text": "cloak on the, on the Corellian Corvette with the codes, it would have just been awesome if she just put her hood up and interacted with R in some way and that was the end. They didn't need to show her. It seemed to me to be something that is particularly with Leia where I'm like, that just caused you unnecessary problems. I think you can make plot and narrative arguments of why Tarkin needed to be an X, Y, and Z. And that's fine. And we could have those arguments. But the Leia thing I felt like was totally unnecessary, especially because I don't think, I don't think it looked good. Like that, that was jarring to me. Like Tarkin, I thought looked way better. But I, they had the more they gave us of Tarkin, the more you got to get hung up on the fact of, oh ****, 'cause I remember when originally when it is the glass, you, I remember being next to me, what? And then it was, oh, okay. And the more we got used to it, it was like, oh, well, this is why doesn't look real and that doesn't look real, blah. And Leia was, I thought",
            "start": 896.6
        },
        {
            "text": "you. I remember being next to me, what? And then it was, oh, okay. And the more we got used to it, it was like, oh, well, this is why doesn't look real and that doesn't look real, blah. And Leia was, I thought, great because it was just hope and the place went crazy and everybody, everybody was yelling and screaming. Like it was like that one quick moment. It was, I didn't get a chance to linger. I haven't, you know, gone back and looked at screenshots of it or anything. I'm with Colin a little bit on this one in that, and there's, it's sort of the trend in filmmaking now. Before you used to, if you, if you wanted to hold suspense or if you wanted to, you know, have some sort of mechanism, you would use, you would see her maybe, you know, turn a little bit. You'd see maybe a three-quarter profile, something like that, but still shrouded by the hood, right? Something, something that just said, okay, that you're giving it a little bit. Right now we're getting 110% all the time with Star Wars and with Marvel in specific. Like they",
            "start": 928.16
        },
        {
            "text": "shrouded by the hood, right? Something, something that just said, okay, that you're giving it a little bit. Right now we're getting 110% all the time with Star Wars and with Marvel in specific. Like they just, they figured it out. They're like, that's what the audiences want. Let's give them 110%. And so I'm with you. I don't think we should have seen her face because we knew who that was. We see her from behind, her putting a hood on and then like turning a little bit. We would have got it. It would have been the exact same thing. But I think they wanted to make sure that everyone and their mother really knew who that person was. And I'm with you too. It kind of took me out of it a little bit, especially coming off of that amazing scene with uh, with Vader right before that. I'm like, holy ****, they just knocked out of the park. That's like the best thing Star Wars like I've ever seen in Star Wars. And then you get to that. I'm like, oh, you didn't, not that I, I didn't mind it because I'm with him too. I was kind",
            "start": 960.84
        },
        {
            "text": "out of the park that's like the best thing Star Wars like I've ever seen in Star Wars and then you get to that I'm like oh you didn't not that I I didn't mind it because I'm with him too I was kind of like all right I'll take it and I clapped but I did upon you know reflecting on you're like you look back you're like it wasn't necessary it didn't need to be there it kind of felt a little fan-fairy like you were just kind of you know I don't know it just seemed weird to me like I don't I don't know was my big take because I really thought Rogue One was fantastic there's a significant plot problem as well that I can't get over as we talked about in the uh in the spoiler cast which people can go listen to which I won't rehash here just in case I don't want to get too deep into the spoilers but that was the only other thing about the movie that I thought was amiss like a complete amiss was was Tarkin and Leia um otherwise I don't know that like I I don't know that it can get much better than",
            "start": 994.04
        },
        {
            "text": "was the only other thing about the movie that I thought was amiss like a complete amiss was was Tarkin and Leia um otherwise I don't know that like I I don't know that it can get much better than that either I mean because when I was looking at it and thinking about it I'm like this a pretty advanced this a pretty advanced technology I mean no no one's doing they're they're they're they're attracting the best talent and they have the best technology in order to do so I don't know how much better it can possibly be than that I thought it was very lifelike and very real but you just see if I went in and didn't know who Tarkin was if it was like Grandma or if it was like Grand Admiral Thrawn or something and they and they decided they wouldn't need to do this but if they were just in other words a character that we saw or we knew about from Timothy Zahn book covers or something but we never saw outside of a video game or a book or whatever and then they did that and I didn't really know",
            "start": 1029.68
        },
        {
            "text": "a character that we saw or we knew about from Timothy Zahn book covers or something but we never saw outside of a video game or a book or whatever and then they did that and I didn't really know that character was was fake to begin with and then I looked quickly I probably would have thought Tarkin was real but immediately I'm like that's not it's not possible and therefore it took me out and I can't imagine that most people don't feel that way because it just was a huge disconnect and I feel like there's something powerful in in storytelling about leaving something to the imagination even if you know what the person is and seeing Leia interface with her back turned with R2 or something like that or just getting the the chip after that very frenetic scene which was **** awesome with Vader as they tie A New Hope to Rogue One intimately and directly just seemed like a big miss and I so I don't I don't like it I don't I don't like seeing that kind of stuff but it ties back to old Star Wars",
            "start": 1060.56
        },
        {
            "text": "as they tie A New Hope to Rogue One intimately and directly just seemed like a big miss and I so I don't I don't like it I don't I don't like seeing that kind of stuff but it ties back to old Star Wars what do you want to do then everybody with Episode 9 is the question they had to write her around Episode 8 like they they have to write her out either at the be either at the end of Episode 8 or the beginning of Episode 9 and my thought is can they not use with some clever voice over and some clever editing scenes or shots they already have that's what they'll do I mean that's what they did in Fast and Furious 7 with Paul Walker and it won't be great I mean that's my problem is I hope they don't do what they did with Furious 7 and again very different situations they finished shooting Episode 8 whereas with Furious 7 they were not even halfway done shooting it so they had to completely rewrite the script and completely change things up I think with Star Wars like they need to kind of just go forward with what the",
            "start": 1092.92
        },
        {
            "text": "they were not even halfway done shooting it so they had to completely rewrite the script and completely change things up I think with Star Wars like they need to kind of just go forward with what the plan was like whatever Leia was going to do in Episode 9 and we don't know all these reports and all these things coming out they are the most rumor of rumor who the hell knows if she has interactions with these characters or whatever who knows what happens to her in Episode 8 like they're not nobody um that's working on Episode 8 is publicly putting out there like oh man we need to figure out what we're doing in Episode 9 because that implies she makes it through Episode 8 in the original cut of it or whatever that was my problem with the rumors too that that's why it didn't make any sense it seemed to B too much like Ian I just I don't trust it and I mean I would assume she makes it through Episode 8 but who knows and I also think that there she's not going to be in enough scenes for it to really matter I think",
            "start": 1129.64
        },
        {
            "text": "like Ian I just I don't trust it and I mean I would assume she makes it through Episode 8 but who knows and I also think that there she's not going to be in enough scenes for it to really matter I think that as we saw with Episode 7 they're not trying to force these things down our throats I think that Han was uh the most used most on camera character that we're familiar with for a reason like they they knew they were getting rid of him and it was totally uh yo this is the tie back to the originals and they we they needed that to do the carbon copy movie that that is or whatever and to to make that happen but going forward I really don't think we're going to see too much of of her if I think that Luke's character is going to be way more prominently featured so we need we need to protect Mark Hamill at all costs well I mean not to make I mean it's kind of it's kind you know dark comedy I guess but it's like you would have expected Harrison Ford would have been one to eat **** at some point",
            "start": 1164.12
        },
        {
            "text": "Hamill at all costs well I mean not to make I mean it's kind of it's kind you know dark comedy I guess but it's like you would have expected Harrison Ford would have been one to eat **** at some point because of the plane crash and just the the fact be against him and you wouldn't have expected you know Carrie Fisher being somewhat young by modern standards actually quite quite young I don't even think I don't think she was in I think she was I think she was 60 on the no she was in 50 oh maybe yeah and then Mark Hamill obviously I feel like uh my my theory was always she was going to die in this one and I wonder and I wonder if that if there's any truth to that cuz I was assume they were G you know after Han dies in Episode 7 which I didn't expect actually and I was kind of sad to see that because I was kind of hoping to see you know him begrudgingly play Han Solo for another film like maybe maybe he wanted to be there for that for Episode 8 I thought I thought anything was going to",
            "start": 1204.88
        },
        {
            "text": "was kind of hoping to see you know him begrudgingly play Han Solo for another film like maybe maybe he wanted to be there for that for Episode 8 I thought I thought anything was going to be the opposite way around I thought they would they would kill Leia off well I thought I thought I think Luke's going to obviously die so but I think that they'll do that at the end and so is then you know the other one that would you know I feel like they're just they have to get rid of these characters in some way in order to for everyone to a new generation to move on beyond this new trilogy but I mean it's all conjecture, Tim was saying we don't really know although a lot of the rumors you know to to to be fair to the other side or to another side a lot of the rumors that were coming out about Star Wars were were they were true you know and and not all of them but a lot of them were remember I remember the earliest rumors about Episode 7 was about how Luke had gone missing and that",
            "start": 1241.4
        },
        {
            "text": "about Star Wars were were they were true you know and and not all of them but a lot of them were remember I remember the earliest rumors about Episode 7 was about how Luke had gone missing and that and like no one knew what that meant it was true it's the first word first in the in the crawl if I remember correctly well so I mean but this so so so how do you react to Episode 8 she she lives and then in Episode 9 we have to get a CG version of her so that's where this gets really interesting I think going back to what I was saying about the there's the difference between honoring the actor and honoring the story and I think that this is a one of the the most complicated of those issues because you do need to honor her death in some way uh but I just I hope that that doesn't get in the way of of the story of what these movies can be because then it's it's just it's kind of like um Batman with the Joker right Heath Ledger dying it's like they how are they going to uh go about that and",
            "start": 1274.16
        },
        {
            "text": "of of the story of what these movies can be because then it's it's just it's kind of like um Batman with the Joker right Heath Ledger dying it's like they how are they going to uh go about that and it's complicated because it's very similar to this where he shot everything for Dark Knight didn't even start Dark Knight Rises so that completely changed what Dark Knight Rises is and I think that because of this it might completely change what Episode 9 is but I don't think so I think that they will find clever ways to uh write her out of the story in a way that gives her a send off kind of like Fast and Furious but I think it'll be better because they haven't shot half of Episode 9 already you know so they can reroute in a way that really makes sense instead of kind of make sense you know yeah the problem is shooting at this in the dark not knowing what Episode 8 is right because if it is that she's a main character there and she hasn't had a run-in with Kylo she hasn't had a run-in with",
            "start": 1317.56
        },
        {
            "text": "the problem is shooting at this in the dark not knowing what Episode 8 is right because if it is that she's a main character there and she hasn't had a run-in with Kylo she hasn't had a run-in with Luke that doesn't happen in Episode 8 and that is something obviously that needs to happen in this series in Episode 9 for the the end of their part I mean I think it's be all in the realm of possibility recast I know that's **** crazy I know that's insane but I mean they can't I mean you can't we all know what Carrie Fisher and Princess Leia look like and so to have it be the CG version that just everybody's going to walk out and be like it was close but it was weird and it was you have to get someone to do her voice right like you have to have an impersonator to do her voice because you don't have that like synthesized I'm with Greg I I think like and I'm sure people are sitting in a room right now probably still discussing this but I think you recast and I think you even go as far as to",
            "start": 1361.4
        },
        {
            "text": "have that like synthesized I'm with Greg I I think like and I'm sure people are sitting in a room right now probably still discussing this but I think you recast and I think you even go as far as to re-shoot her scenes in Episode 8 like why not that's what I was thinking too if you are going to I think I think do it now like get it that's ridic see that doesn't make any sense give her at least her last hurrah I don't know I'm I'm just saying like like it was it was jarring with Dumbledore right and so and especially if that character is not going to die if you're going to use that if if you were continue going to continue to use that character which is she's the leader of the Resistance and you would you would imagine like she goes on to lead whatever El whatever is happening with the Empire or whatnot um I don't know I mean I think you I don't think it's beyond the realm of craziness to say like bring in another actor who can do that justice who we all would love and let's see let's",
            "start": 1399.28
        },
        {
            "text": "or whatnot um I don't know I mean I think you I don't think it's beyond the realm of craziness to say like bring in another actor who can do that justice who we all would love and let's see let's see it happen because I mean look if this has happened in the 80s imagine if if midway through Empire Strikes Back Carrie Fisher had an accident and died they would have had to recast right there's no choice that they would have just changed the plot you know I mean Luke or Mark Hamill got a catastrophic accident in between A New Hope and Empire and that's why they wrote in the scar in his that he has on his face from the accident with the Wampa and stuff I think that was written specifically to to make room for that and I think the and that that scene obviously is **** iconic with the lightsaber in the snow stuff but uh I'm I'm I disagree in the sense that I don't think they should be recast I agree that if they're going to recast or they need to do it now uh to make it less jarring there is a",
            "start": 1434.76
        },
        {
            "text": "in the snow stuff but uh I'm I'm I disagree in the sense that I don't think they should be recast I agree that if they're going to recast or they need to do it now uh to make it less jarring there is a point Tim is making which I think is very interesting that you have to kind of there's going to be there's going to be fan reactions either way that are going to be positive and negative I think and probably mostly negative if you do something like that I think the answer is to kill her in Episode 8 like to go back and rewrite it so you don't have to worry about Episode 9 and just put her on a **** ship and she's just on or she's on a ship and just gets blown up that's the end you know like and you can have a very you can have a call back to A New Hope when Tarkin when I love that scene of Tarkin when they show him for a second as the as the Death Star's blowing up or whatever you know and it's like like they can do a similar thing like that and just show you know have a scene of her just showing",
            "start": 1474.16
        },
        {
            "text": "they show him for a second as the as the Death Star's blowing up or whatever you know and it's like like they can do a similar thing like that and just show you know have a scene of her just showing her face and and alter that way I think that they have got to have got been have gotten rid of that character by Episode 9 like I don't I don't think you can and I don't know that she's that integral to the to the to the plot anyway it's they're trying to not make it about them ultimately I think that's why The Force Awakens was such a carbon copy of A New Hope is to get everyone comfortable with the fact that it shouldn't probably be you know because if Episode 8 is like Empire that's a huge problem and and I hope that it's I hope that that that's not the case shooting in the dark doing all these different things right like I think I I mean as an outside of Star Wars but just knowing how films go and how the Star Wars stories go like Kylo Ren gets his uh **** redemption at the end",
            "start": 1508.92
        },
        {
            "text": "these different things right like I think I I mean as an outside of Star Wars but just knowing how films go and how the Star Wars stories go like Kylo Ren gets his uh **** redemption at the end of this right and I think the redemption would come from Carrie Fisher Princess Leia or you know General Leia holding him as he dies you know what I mean and he has it's the reverse where she's Luke and he's Vader and it's that thing of I was wrong I'm so sorry I'm sorry I killed dad he won't say that obviously but that's what's being communicated in that moment and so I feel like if they're if that was where we were going to Episode 9 then I think you have to drastically redo it and I think that then means drastically redoing what the relationship with Luke is because now Luke has to be that parental figure to get those moments and get those scenes and then I want that changes I think if Luke dies at the end as well or you know I I I agree that Luke would have to die in all this and the way",
            "start": 1541.24
        },
        {
            "text": "figure to get those moments and get those scenes and then I want that changes I think if Luke dies at the end as well or you know I I I agree that Luke would have to die in all this and the way it originally played out but I just don't feel like there's an anchor to this story then or where where his redemption comes from it can't be him talking to Rey unless they are not even I mean I think they're related right like that's what we all take away from The Force Awakens but I don't think they're going to be related to the fact that that's going to matter that like they're talking and hanging out I think there's so many options out there and I think that there's been so much thought put into what these movies are and where that they're going and not only these movies but Star Wars as a whole as a franchise and I what I don't want to happen is for them to be reactionary to this type of stuff and I want them to be stay true to what the vision is and understand understandably they're going to",
            "start": 1580.0
        },
        {
            "text": "a franchise and I what I don't want to happen is for them to be reactionary to this type of stuff and I want them to be stay true to what the vision is and understand understandably they're going to need to make some changes because if she was a prominent feature she's not going to be as prominent but I think Tarkin's example of them being like no she will be we're going to figure that out Tarkin being in Star Wars Rebels he's Tarkin and the reason Tarkin they did that and they went so far and they didn't just do the reflections is because they're like this is the character and this is what we're doing and I think that T though the same thing Tarkin's another one of the perfect examples they could have literally recast that there's like all the hardcore people would have been like okay that Tarkin now I get it like they did it with uh what's her name uh the red Mon Mothma Mon Mothma Mon Mothma right Mo I just I think it's I just there's some part of me that's just irked by this right where you're just",
            "start": 1610.88
        },
        {
            "text": "get it like they did it with uh what's her name uh the red Mon Mothma Mon Mothma Mon Mothma right Mo I just I think it's I just there's some part of me that's just irked by this right where you're just suddenly allowed to recreate the exact look of a human being that you would have had to pay for this I'm sure they had to pay as a state for it right but like he doesn't get to say as to whether or not he gets to be in this movie like there's just it's kind of the same feeling I got when I heard that George Lucas was just going to say **** it and make everything like in his brain he wanted to make everything CG right he even has that I think it's a famous quote that he said could have been making this up too where he was like if I could I'd make everything CG even the actors right cuz that's what he wanted I think it's just where do we draw the line of saying like look at a certain point these are **** human beings you can't just use Carrie Fisher's likeness forever and keep putting",
            "start": 1647.8
        },
        {
            "text": "what he wanted I think it's just where do we draw the line of saying like look at a certain point these are **** human beings you can't just use Carrie Fisher's likeness forever and keep putting her in movies because yeah but I mean there's just a line that has to be I don't think even that's like what we're dealing with I think the I think you get away with it if you if that's what they wanted to do and like Episode 8 were doing that it wouldn't be contracted not even that I mean I don't even think it would be seen as like you're you know exploiting her or her estate or her memories she would this is the end of Princess Leia's story for the most part right like this is where Leia's journey was going to end we are were what Jesus Christ five six of the way there you know what I mean like this was what it was supposed to be in terms of what the vision of Star Wars was and we want to honor her by doing that and that's even with Tarkin right in the fact that all right we need him for",
            "start": 1685.84
        },
        {
            "text": "this was what it was supposed to be in terms of what the vision of Star Wars was and we want to honor her by doing that and that's even with Tarkin right in the fact that all right we need him for this one thing and it's a cool throwback for the audience and for him and he has been in Star Wars Rebels and there's this but again he's been in Star Wars Rebels the character's been in Star Wars Rebels not the actor pushing did in Star Wars Rebels he looks like that guy sure in CG you could have cast an actor that looked like him and actually didn't even need to look like him like these people are actors like again it's I I I called the call back to Dumbledore like yes they bring a different vibe they bring a different sense of the as far as their sensibility is concerned but that character wasn't so pivotal of the plot that it had to look like Peter Cushing's it was just kind of it almost feels kind of gross when you think about it right it's a very interesting philosophical question that I not really considered why don't",
            "start": 1725.84
        },
        {
            "text": "had to look like Peter Cushing's it was just kind of it almost feels kind of gross when you think about it right it's a very interesting philosophical question that I not really considered why don't they put Elvis Presley in a movie why not right Elvis Presley he's been dead for a while no one's going to care it's Elvis but like I think it's a contractual thing I do think that like going forward in movies this is just the reality of where we're at these people need to in the contracts it needs to say it's a this many movie deal and I mean what about toys what about like it's hard where do you draw the line because if your likeness is used for every single thing whether it's comics or toys or video games or this or that like it what's perishing their their you know whatever likeness and that's the interesting thing you brought up uh Bright Lights the Debbie Reynolds Carrie Fisher document I watched it on HBO and then right afterwards it recommended Wishful Drinking the Carrie Fisher one",
            "start": 1763.12
        },
        {
            "text": "the interesting thing you brought up Bright Lights the Debbie Reynolds Carrie Fisher document I watched it on HBO and then right afterwards it recommended Wishful Drinking the Carrie Fisher one woman show or whatever and I never seen it so I popped it in there and of course she talks with broad strokes about all manner of things but she says that George Lucas owns her likeness and so I don't know if that was 100% correct if that was just that's what I was going to say was that some of the actors famously did fight for their likeness rights in the movie and some didn't which is why I don't want to say Carrie Fisher was never destitute but like I think Harrison Ford and Mark Hamill made an extraordinary amount of money compared to her um and probably others and the and it's possible Peter Cushing was actually an OG pretty popular famous actor I don't know if he fought for his rights it could be some there could be some minutia but it doesn't there but it doesn't it doesn't negate what you're",
            "start": 1800.68
        },
        {
            "text": "was actually an OG pretty popular famous actor I don't know if he fought for his rights it could be some there could be some minutia but it doesn't there but it doesn't it doesn't negate what you're saying sure they have full rights to use this by the way accusing Disney or Lucas of they're just running away like what are you doing this on the up and up no I understand that but what I'm saying is I still think regardless of of the legality I still think there is an interesting philosophical question because you're right it's like Elvis died what in the **** late '70s or something yeah it's like yeah why not just bring Elvis back you know and it's so I agree that there's there's something to be said about that but they're they're in between a rock and a hard place and they have to figure this out I'm sure that they're not it's not going to be an easy solution you know like I I really do think dollar of donuts I think they rewrite parts of Episode 8 and then they have to rewrite obviously",
            "start": 1835.96
        },
        {
            "text": "this out I'm sure that they're not it's not going to be an easy solution you know like I I really do think dollar of donuts I think they rewrite parts of Episode 8 and then they have to rewrite obviously you're going to have to rewrite a lot of Episode 9 but I think that they're going to have to solve this problem now and uh and it's a it's a big problem it's a sad problem you know I don't think that anyone anticipated I remember when I read about the news and then there was all this conflicting stuff on The Hollywood Reporter and whatnot about well the son says she's in stable condition and all this kind of stuff and because immediately you know I remember when I mean it's it's sad but when you only have the connection to these people as their actors and as their characters I remember when Harrison Ford got into that **** plane accident like well that's great you know like Indy and and you know the possibility of some sort of Indiana Jones thing happening maybe with him maybe with not and",
            "start": 1869.32
        },
        {
            "text": "Ford got into that **** plane accident like well that's great you know like Indie and and you know the possibility of some sort of Indiana Jones thing happening maybe with him maybe with not and then obviously Han Solo his return and in s you get worried about these kinds of things and that's immediately where I went to with her too where I was like well sounds like she's fine so we don't have to worry about that and I also watched Catastrophe which was what she was the last thing she filmed so it's uh it's sad to to hear but I I hope that they solve and I think they can solve in a very tasteful way um and I think the best way you give ode to her is to dedicate the movie to her you know that that's going to happen for sure I guarantee you at the end of it it'll say whatever I think that that's important you're just for Carrie Fisher what sure and I and and so yeah but I I agree with you and I My Hope Is that they don't belabor this because I just the technology between what we saw",
            "start": 1903.48
        },
        {
            "text": "that's important you're just for Carrie Fisher what sure and I and and so yeah but I I agree with you and I My Hope Is that they don't belabor this because I just the technology between what we saw Rogue One in A New Hope and the years passing are not going to make it any more believable Leia didn't look right in A New Hope in Rogue One and it's not it's just not going to be right to have like an animatronic **** Leia walking around yeah the technology is obviously it's come a long way like it fool it did fool a lot of people and in the last like what I think Tron came out what like six years ago 2008 right 2008 yeah 2010 so so seven years ago almost um it's conceivable in the next 10 years they'll be able to do it they'll be able to get it to the point where you really can't like only the trained eye can really tell but the question still is like should they like should they be doing this you know I know that's that's what I grapple with",
            "start": 1939.6
        }
    ]
}