{
    "id": 2339,
    "video_id": "SdQcK0l40lc",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What We Know Of Nintendo Switch Post Launch - Kinda Funny Gamescast Ep. 104 (Pt. 3)",
    "description": "What we expect for the Nintendo Switch post launch in it's first year.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1485349204,
    "duration": 2332,
    "transcript_chunks": [
        {
            "text": "This episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient and recipe delivery service in the country. Their mission is to make incredible home cooking accessible to everyone. They achieve this by supporting a more sustainable food system, setting the highest standards for ingredients, and building a community of home chefs. Not all ingredients are created equal. Fresh, high-quality ingredients make a real difference, so it's important to know where your food comes from. Greg Miller is all about it, as you might have seen from his hashtag Cooking with Greggy series. To this day, he swears by that buffalo chicken sand. Here's a little taste, see what I did there, of upcoming meals: spicy shrimp, pork chops, and garlic piccata, mushroom and chipotle pepper enchiladas with lime sour cream. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Gamecast. You will love how good it feels and tastes to",
            "start": 0.12
        },
        {
            "text": "enchiladas with lime sour cream. Check out this week's menu and get your first three meals free with free shipping by going to BlueApron.com/Gamecast. You will love how good it feels and tastes to create incredible homecooked meals with Blue Apron. So don't wait, that's BlueApron.com/Gamecast. Blue Apron, a better way to cook. So I want to talk about the first year of the Nintendo Switch, or what we know of it so far, right? So I got to play all those games, they were great, they were cool, whatever. Zelda's the obvious dominant launch title, but there are other launch titles. Okay, I was going to say many, but that would be a lie. As of today, January 20th, we know of these launch titles: 1-2-Switch, which is not a pack-in, The Binding of Isaac: Afterbirth+, Just Dance 2017, The Legend of Zelda: Breath of the Wild, Skylanders Imaginators, and Super Bomberman R. What are your thoughts on this launch lineup? Launch day lineup seems shallow, you know what I mean? Uh, Zelda's going to be awesome. Bomberman",
            "start": 39.12
        },
        {
            "text": "of the Wild, Skylanders Imaginators, and Super Bomberman R. What are your thoughts on this launch lineup? Launch day lineup seems shallow, you know what I mean? Uh, Zelda's going to be awesome. Bomberman sounds awesome from everything you're saying, but right there, that's what I plan on picking up and playing on day one. Is Snipperclips isn't even a launch game? No, great, great. It's, it's March. Okay, so, so that's the thing. Moving, moving on a little bit here, games confirmed from March that don't have an actual date tied to them are Snipperclips, Fast RMX, I Am Setsuna, and Has-Been Heroes. Gotcha. I feel like Snipperclips should have made the, the launch date. I think it would have been, I feel like from what you're saying, that would sound like, of course it should have. Yes, like you have this eShop game, you have this thing that people think is cool, but you want to get it out there on launch day so everybody who's like, I want to play something and I'm hearing good things about this and it's only 14",
            "start": 106.4
        },
        {
            "text": "you have this thing that people think is cool, but you want to get it out there on launch day so everybody who's like, I want to play something and I'm hearing good things about this and it's only 14 bucks or whatever the hell it's going to be as an eShop game, jump on that one and actually move units that way and get people super excited about it. Yeah, um, yeah, it doesn't sound like a, a great launch lineup in terms of that, but I guess it, I saw, I think it was Ryan McCaffrey going back and forth on with people on Twitter about this of like, he's super excited about it and he's fine with the launch lineup as it is because he has Zelda and why would he want something to distract him from Zelda and stuff like that? It's not a bad argument, but it's also, and, and then because then I do think back to like my PlayStation 3 launch lineup, right? Where I bought a whole bunch of stuff, but I really just played Madden over and over again. Smuggler's Run, even Smuggler's Run, I'm trying to convince myself was great.",
            "start": 153.0
        },
        {
            "text": "my PlayStation 3 launch lineup, right? Where I bought a whole bunch of stuff, but I really just played Madden over and over again. Smuggler's Run, even Smuggler's Run, I'm trying to convince myself was great. Yeah, um, there, launch lineups are hard to nail. I feel like this, and I assume what Nintendo's doing here is something similar to what Adam Boyes talked about two years ago, right? With the two PSX ago, where he wants to have two or three announcements for everybody, right? I have two games on there that I'll buy on day one. Sure, okay, great. And that you need to try to apply that to everybody and give them something, but you don't want to overwhelm it and then have games get drowned out. Would I, I wouldn't buy Bomberman if there were three other games in there that I thought were awesome. Not to mention the fact that it's going to be just like my Wii, right? Where I get it and I'm like, okay, cool, Bomberman or whatever, I'll screw around with that and then I'm jumping right into Zelda and playing Zelda until",
            "start": 185.88
        },
        {
            "text": "fact that it's going to be just like my Wii, right? Where I get it and I'm like, okay, cool, Bomberman or whatever, I'll screw around with that and then I'm jumping right into Zelda and playing Zelda until probably, well, until I beat it, number one, but until Snipperclips or something else comes along like that. Um, the, we're talking about the first year of the Switch here. The first year of the Switch sounds like it's going to be stumble out of the gates and it's going to be an uphill battle based on popular opinion and everything else that's happened with it, right? Like I went back and forth, I, I, I was, I got my pre-order on the, on the first night there off of Amazon and it was one of those like, I'm getting it and I'm not sure if I'm going to keep it and what, what I, I figure out why I'd want to keep this and what it means to me. And for me, a big thing is I want to play Zelda. I hate my Wii U. Uh, and a week later we go to Boston, so it's like, all right, cool, I have 12 hours on a plane, you know what I mean? I",
            "start": 221.12
        },
        {
            "text": "and what it means to me. And for me, a big thing is I want to play Zelda. I hate my Wii U. Uh, and a week later we go to Boston, so it's like, all right, cool, I have 12 hours on a plane, you know what I mean? I want to be playing Zelda. That I want to be able to go off into to The Wilds and do side quests and do all these different things. And even if we got it early, let's say through Nintendo or something like that, I'm sure it's going to, there's going to be plenty of side stuff for me to go do. Yeah, to go off and do something different on it. And so I was like, all right, there's that. And then in April, there's Mario Kart. And then in the holiday, there's Mario. And that's enough for me right there, let alone the little things that'll come along and do these different things. But I wish it was a no-brainer. It's always shitty to have, hey, there's this new console coming out and do, do we want it? Is it what it is? I mean, I think it's, I think it's Colin said a few times on this show, like it just, it seems like a",
            "start": 256.88
        },
        {
            "text": "always shitty to have, hey, there's this new console coming out and do, do we want it? Is it what it is? I mean, I think it's, I think it's Colin said a few times on this show, like it just, it seems like a rushed thing. Why is it coming out right now? What is the reasoning behind putting it out right now? Zelda. And but I mean, even we, the reason we've said that, I know, but I mean, is that for a fiscal year? Is it, I mean, is it because we just want to get it off shit or get off the pot with the Wii U version? I think I, I really think Zelda is the reason they're, they're putting it out. I don't think they can hold Zelda anymore. And I think that they, they realize that if they put Zelda out on Wii U and the Switch comes out in the fall, when it probably should have, that when the games were ready and that they had, you know, something to say. I mean, Zelda or Switch launching with Mario would have been way more compelling than Switch launching with Zelda for the, for the mass market. Um, and uh, Zelda games as we",
            "start": 291.24
        },
        {
            "text": "had, you know, something to say. I mean, Zelda or Switch launching with Mario would have been way more compelling than Switch launching with Zelda for the, for the mass market. Um, and uh, Zelda games, as we talked about on, on the Morning Show last week, people have a mixed perception of how much these games sell. There's a few examples of them selling very well. Ocarina of Time sold very well. Uh, the original Zelda sold very well. Uh, but then you have examples of Zelda games sell like, you know, everyone was talking about Link Between Worlds, which sold fewer than three million copies. It's like the, you know, but if you would just listen to Nintendo fans or listen to Twitter or something like that, you think that that game sold 15 million copies, but it didn't, you know? And, and, um, so that's my major concern with Switch is that, I mean, I don't want to belabor what I said on Colin was right all already. You guys can watch that episode. What, what, what bums me out about Switch is that the hardware looks great and I think",
            "start": 327.28
        },
        {
            "text": "is that I mean, I don't want to belabor what I said on Colin was right all already. You guys can watch that episode. What, what, what bums me out about Switch is that the hardware looks great and I think it's sexy and I think it's a great idea. Um, it's just everything else, you know, like they, they just fucked up. What, what do I think of this launch lineup? I think this launch lineup is mediocre at best. And I think that anyone who says anything other than that it's mediocre is lying to themselves because it's, you have a great game in Zelda, but that's like saying the N64's two games at launch were great because you had Mario, but it was two games, you know? Like you have to have, you have to have a, a variety for people. Some people are going to play Zelda, they're going to be done with it in four or five days. Then what? That and that's, that's like, and then they're going to play 1-2-Switch. They can play I Am Setsuna. Like I, you know, and I'm a huge fan of I Am Setsuna. I just, that's the major thing I'm concerned about.",
            "start": 362.48
        },
        {
            "text": "that and that's, that's like, and then they're going to play 1-2-Switch. They can play I Am Setsuna. Like I, you know, and I'm a huge fan of I Am Setsuna. I just, that's the major thing I'm concerned about. They, this thing is not ready. That I think that that's like my major takeaway. They don't, they don't even know the answers to half the questions that are being asked. Where Netflix is even on it, which is weird. You can only take screenshots with it. You can't like, there's no trophy system. There's, you have to use online, you know, a lot of it's attached to a phone app. Like I'm like, what? Like the, the common theme I, I've gotten from people from the Switch is that some people are excited about it, some people are in the middle, some people are not excited about it. But a common theme is that if anything, that conference made people less excited. And that's, that's a, that's bad. Like if I never, I would have been like, yeah, day one, day one, day one. Like still if I didn't see that conference, you know? And that's",
            "start": 397.92
        },
        {
            "text": "conference made people less excited. And that's, that's a, that's bad. Like if I never, I would have been like, yeah, day one, day one, day one. Like still if I didn't see that conference, you know? And that's, that's a really big problem because I mean, and again, not to belabor the points because we all know what we thought about the conference, but there was so much in that conference that was like huge. Xenoblade Chronicles 3, that's speaking to Nintendo fans, like the hardest of hardcore Nintendo fans. Hardcore in a way, I'm not even hardcore. And it's like that gets, you know, muddled out by weird presentation and a weird focus of why we're supposed to like this console. Um, but yeah, for me, as, as somebody that you often talk about how, you know, Nintendo fans aren't buying Nintendo consoles for Nintendo games as a generality when you're looking at the numbers, right? I'm somebody that buys Nintendo consoles for Nintendo games. I love my Wii U to this day because it provided me with many great games, many great",
            "start": 435.16
        },
        {
            "text": "as a generality when you're looking at the numbers, right? I'm somebody that buys Nintendo consoles for Nintendo games. I love my Wii U to this day because it provided me with many great games, many great experiences that I hold up there, some of the best of all time. And I'm buying the Switch and I'm confident that I'm going to fucking love it based on how much I've played of it and also just what games I know are coming, let alone the ones I don't know are coming. And again, do I sound like a burned lover? Yeah, exactly. But those moments, those awesome moments of love that I get, I'm like, all right, cool, that's enough for me, especially because it's cheap enough overall as an investment where I'm like, $300, like, all right, cool, $300. Like with the Wii U, I've, I have not regretted the Wii U a single moment because of the five, at least five games that I love with it, let alone the fact that there was 15 that I love with it. But when I talk about perception, it's not necessarily talking from my lens because",
            "start": 474.24
        },
        {
            "text": "of the five, at least five games that I love with it, let alone the fact that there was 15 that I love with it. But when I talk about perception, it's not necessarily talking from my lens because as an old Nintendo fan, like I like to play my Nintendo games on Nintendo consoles too. Like so when I use my N64 for, it's what I used my GameCube for, although GameCube had a good third party support and obviously we, uh, really died, uh, because Nintendo stopped supporting it, not because third party stopped supporting it, because people do want their Nintendo games. And I, and I acknowledge that and that's why I would want it. So I'm not talking about from my perspective, like I wish that they had Call of Duty on this thing so I can play Call of Duty on it because I wouldn't play Call of Duty on it anyway. What I'm talking about more is the mass market. Uh, the mass market doesn't give a flying shit about Xenoblade Chronicles. And, and for this thing to get, for this thing to go out there and win some people",
            "start": 520.48
        },
        {
            "text": "I'm talking about more is the mass market. Uh, the mass market doesn't give a flying shit about Xenoblade Chronicles. And, and for this thing to get, for this thing to go out there and win some people over, it needs to have more. And that's my, that's my whole thing about, you know, if it's a console for me and you, that's great, but it shouldn't be a console just for me and you because it's going to fail. And that, and that's the, that's the thing I'm trying to, that's why like I'm like, people are like, well, the PS4 and the Xbox One launch lineups are bad too. I'm like, no, they really weren't. I don't know why everyone keeps saying that. They really weren't bad. They were actually, they didn't have anything, any standout that was better than the rest. It was a bunch of eights. But that's, that's, that's great though. When you, when you're launching and because people like, well, launch with some ports. I'm like, I guess, but it came with a Call of Duty. Like Call of Duty was on it at launch. Battlefield was on it",
            "start": 553.2
        },
        {
            "text": "when you, when you're launching and because people like, well, launch with some ports. I'm like, I guess, but it came with a Call of Duty. Like Call of Duty was on it at launch. Battlefield was on it at launch. Assassin's Creed was on it at launch. Like the, what'd you say? Madden. Madden was on it at launch. NBA 2K was on it at launch. Like it was Knack was on a launch. Killzone. But the point is that they had not only volume, because I don't think volume necessarily matters. If volume mattered, then the 3DS launch would have been great. And the 3DS launch was fucking awful. The, the, and, and people asking, what's a worse launch than the launch lineup than Switch? I'm like, 3DS is, is the fucking worst launch lineup I've ever seen for a Nintendo product. But the, so it's not only about volume, but about choice. And it's about, hey, uh, dude on the couch that might not care about Mario, this machine also is for you. You know, it's like Killzone wasn't the reason that people bought a PS4. Killzone was just an additive",
            "start": 590.76
        },
        {
            "text": "it's about, hey, uh, dude on the couch that might not care about Mario, this machine also is for you. You know, it's like Killzone wasn't the reason that people bought a PS4. Killzone was just an additive thing. People wanted PS4 because of the variety of games and the promise of games in the future. And when I look at this, I see, I'm with Greg where I'm like, yeah, Zelda looks great. I'm still, I have a Switch pre-order that I actually, I was actually writing an email to you when I saw your Facebook post about how you got it and went to bed. And I'm like, I actually got that pre-order thinking you would want it because I thought you were asleep. So I'm like, appreciate that. So, so now I'm like, I'm like, what the fuck do I do? Like it's the first time we like, I don't really know if I want this. We have a Wii U. I'll just play it on Wii U. But heed the words of Betty and my mom tweeted me and be like, keep it, you never know what's going to happen. I'm like, you're right. But when I look at, when I look at it, I'm like,",
            "start": 628.84
        },
        {
            "text": "just play it on Wii U. But heed the words of Betty and my mom tweeted me and be like, keep it, you never know what's going to happen. I'm like, you're right. But when I look at, when I look at it, I'm like, Zelda and then Mario. Okay. And, and, and, and so, and so I just, you know, I want people to enjoy the console. I think it's going to be a great handheld. And I hope it sells as I said, selling twice as well as the Wii U is going to be a massive success. People are saying, saying like 50 million years. I'm like, yeah, no, no way. But 10-15 million units is doable. They just have to, they just have to nail this, this, this thing. And they have a perception problem. You can't sell a product to Nintendo fans. That's what the Wii U was. You can't do it. Like it's, it's not going to work. And that group's even smaller now because now you have a bunch of scorned lovers there, right? Like every, every generation seems like they shave off people that are going to fucking eat shit. And, and, and so that's why I'm afraid of for them.",
            "start": 668.36
        },
        {
            "text": "now you have a bunch of scorned lovers there, right? Like every, every generation seems like they shave off people that are going to fucking eat shit. And, and, and so that's why I'm afraid of for them because like the, the, I love the idea of the Switch. It's so fucking cool, you know? I don't even need to put my hands on her play and like, this is great. It's not a great idea. But, but guys, you have to have more than Zelda and Mario. And, and I know that people like, well, they have Splatoon. And they have, guys, Splatoon didn't move Wii Us and it's not going to move Switches. Xenoblade didn't move Wii U. It's not going to move Switches. Donkey Kong didn't move Wii U's. Not going to move Switches. We, you have to think differently. Zelda's, Zelda will move Switches and Mario will move Switches. But you have to have stuff in between. And Nintendo doesn't have the wherewithal and, and the resources. None of the first parties do to just fill the, fill the back catalog with just their games. It's just not possible. And",
            "start": 711.96
        },
        {
            "text": "stuff in between. And Nintendo doesn't have the wherewithal and, and the resources. None of the first parties do to just fill the, fill the back catalog with just their games. It's just not possible. And that's the, that's the thing I'm concerned about and why I feel like they're just sending this thing on not to die. It's not going to die. It'll be around for years. But to send it out to just be, and it shouldn't just be. I mean, talking about the first year, I feel like best case scenario, you can look at it like this. The launch here is going out to the beta testers. We are, if you're buying it like you and I are on day one, or Betty and tell Colin to, we're all beta testers and going through. We're going to stumble through the pain as they figure out this online system that's free until they want to start charging for it and all these different things. But you get to December and hopefully either based on an, a few E3 announcements, also Mario doesn't slip and actually comes out in the holiday suddenly.",
            "start": 753.2
        },
        {
            "text": "charging for it and all these different things. But you get to December and hopefully either based on an, a few E3 announcements, also Mario doesn't slip and actually comes out in the holiday suddenly. Then I feel like you have a chance to remarket this thing and have a Renaissance like they did with 3DS when they put 3DS up against Vita to crush Vita. And when they were like, all right, cool, we understand that we've been slacking. Here's why you get this. And you run a trailer that is Zelda, Kart, and the new Mario and Mario Odyssey. And hopefully two or three other things that are so we didn't expect that are there. Some, you know, whatever, Animal Crossing or third party awesome exclusives. Suddenly people are going to be like, fuck yeah, I want that for Christmas. It finally matters. And they'll get it and go. I don't think this is like, this isn't a, a death blow out of the gate. It's just a stumble that I think they can come back from. And when there's an, it's going to, I think you're going to get to",
            "start": 788.44
        },
        {
            "text": "and go. I don't think this is like, this isn't a, a death blow out of the gate. It's just a stumble that I think they can come back from. And when there's an, it's going to, I think you're going to get to, you're, you're going to get to the point that so many people argue about the Wii U is faster than you did with the Wii U where you're going to get to, no, the library is great. And guess what? The hardware is fucking awesome, which is, you could never say about the Wii U. Never. And even me, I could never say that. I mean, the point you're making is interesting. What I do think is a death blow is the industry perception of this thing and the way that people are talking about Nintendo as a whole. And when you talk about the same old Nintendo, I think really the, the part I agree with most of that is how I, I, there's nobody that wants this thing to succeed more than me. And I can't hold on to, they'll nail it at E3. I don't believe that they will anymore. Whereas three weeks ago, I believed more than anything. I was",
            "start": 824.0
        },
        {
            "text": "nobody that wants this thing to succeed more than me. And I can't hold on to, they'll nail it at E3. I don't believe that they will anymore. Whereas three weeks ago, I believed more than anything. I was like, I can't fucking wait for this presentation. And then E3 is just going to be even better. And it's like, now it's like, no, I do believe that Sony's going to have a killer E3 because they've proven they've had this track record recently. I'm just nailing it, nailing it, nailing it. And then the PS4 conference, which I like, in the grand scheme of things, doesn't even matter because when you look at it, E3 and PSX is what matters. Nintendo presentation mattered, mattered more than anything because this is them putting their best foot forward of, here's the new Nintendo and here's what we are. And I will still give it to them that I want to see a more American-based conference. So E3, I'm excited for no matter what. I'd be excited for it, but I'm not looking forward to it as this thing that's going to answer all the",
            "start": 863.32
        },
        {
            "text": "to them that I want to see a more American-based conference. So E3, I'm excited for no matter what. I'd be excited for it, but I'm not looking forward to it as this thing that's going to answer all the questions and the, the way that I expected it to and needed it to for this to not just be, oh, Nintendo, you know? But it's like, having said that, I do think that there is a lot going for. And you talking about the beta tester thing, when 3DS came out, it had an abysmal launch lineup. And it came out in March, if I remember correctly. And it wasn't until probably January is the next year that it was like, oh, fuck, there's actually some games coming out for this thing. And then from then on, it was awesome. And they did a really good job of keeping up with the, the, they cut the price, which is why, which is why I think that I was so happy that Switch is going out to 300 because I think that they need to get themselves room to maneuver, room, which, you know, that sucks for the people buying it now, but also like,",
            "start": 898.68
        },
        {
            "text": "I think that I was so happy that Switch is going out to 300 because I think that they need to get themselves room to maneuver, room, which, you know, that sucks for the people buying it now, but also like, whatever, they did that to 3DS owners too. They called them Ambassadors. The, the, uh, yeah, I, I want, I really do feel in my heart that like a strong, vibrant hardware manufacturer, Nintendo, is essential. And when I saw out of them at that conference, what I'm seeing it now is I'm like, man, like I, I, I hope I'm wrong because I want, I want the Switch to succeed because I, I want Nintendo to do well. I think they need to, they need to show everyone that they're, they're capable of doing more. But I wouldn't be surprised to see for this to be it too, for not for the company, but for their hardware initiative in the next few years where it's just like, if people don't care about this thing, it is over for them as far as a hardware manufacturer. So they need to make people to care about this. They're not going to do it.",
            "start": 939.72
        },
        {
            "text": "few years where it's just like if people don't care about this thing it is over for them as far as a hardware manufacturer so they need to make people to care about this they're not going to do it again they're not going to be like you didn't care about Wii U you guys bought the Wii but then you put it in your closet in 2008 and you have your 3DS for frankly third party games and now you have you know this particular device that you don't care about again how about we do another one like that's not going to happen so like I this is the this is their last stand you know in terms of like the Nintendo I think we all want because a lot of people are like can't wait to play Zelda on PS4 in 2019 or whatever I'm like you don't really want that like we we talk about that like it's like it's a great idea and and and that would be nice for us as PS4 and Xbox One owners but you don't really want that because you don't want you want Nintendo to remain independent and a little different",
            "start": 978.44
        },
        {
            "text": "it's a great idea and and and that would be nice for us as PS4 and Xbox One owners but you don't really want that because you don't want you want Nintendo to remain independent and a little different and people are like well you don't want them to replicate what they're what the others are doing I'm like no you don't you just want them to replicate the ideas that are actually good and there are great ideas being done on those other consoles that matter it's like saying uh oh uh like iPhone you can text on iPhone Android devices don't text like that's how essential some of the things are that are missing on on this device it's like what the **** you talking about you need to be able to the P you could you could voice chat on PSP you know like you could voice chat on Vita and 3DS and DSi you know like it it you you can I I I had like I said in in the in the Colin Was Right video I was playing I was voice chatting on Xbox in 2003 you know like it's it's there's no excuses for some of",
            "start": 1016.76
        },
        {
            "text": "you know like it it you you can I I I had like I said in in the in the Colin Was Right video I was playing I was voice chatting on Xbox in 2003 you know like it's it's there's no excuses for some of these things no achievement structure was as I said the most emblematic thing they don't give a flying **** what's going on around them and are totally toned deaf man that would have gotten so many people in the door if they were like hey we have a coin system or a metal system or an achievement system whatever they want to call it a flag system whatever whatever and you earn things for in game and maybe we'll make them even more useful than just these these these e-pen prizes that that everyone like likes to to to float around maybe you can buy things with them or something like that or it's just like I saw all that stuff I'm like man you guys I it's it's in a lot of the decisions they made in my mind are indefensible and and are going to hurt the system every one of them you know it's a",
            "start": 1054.16
        },
        {
            "text": "just like I saw all that stuff I'm like man you guys I it's it's in a lot of the decisions they made in my mind are indefensible and and are going to hurt the system every one of them you know it's a death by a Thousand Cuts no achievements punch in the face you know no voice chat punch in the face have to matchmake with an app punch in the face Zelda oh maybe a little maybe a little massage in between rounds on the you can get back in there getting back in the ring and then you get keep getting punched and it's like it's just disappointing and and what was surprising to me because I'm I'm known being so pessimistic about things and a little and a little more harsh than other people are what I was super surprised about you weren't here but I when I just reading over the that night and the next few days everyone was like this it was it was it was it was rare for me to see anyone that was super duper any anything positive to say about it you know if if and if Zelda wasn't on this thing",
            "start": 1097.04
        },
        {
            "text": "next few days everyone was like this it was it was it was it was rare for me to see anyone that was super duper any anything positive to say about it you know if if and if Zelda wasn't on this thing I mean that's the thing I was trying to I'm trying to tell people like I like take Zelda and remove it now what you know how good does it look now but it is there though I mean that and that's that's to me and again I'm going to come off as a super fanboy with this and I don't even care because I really stand by this look at this thing for what it means to you do you want it or not and I think that when it comes down to it I could give a **** less about voice chat trophies they'd be really great and I'd like if if they had that type of stuff but it's not a make or break for me like when when I start going on the list of like why am I going to like this what am I upset about I think that people get so lost in the weeds of oh my God the controllers are this much money I'm not going to buy",
            "start": 1134.44
        },
        {
            "text": "I start going on the list of like why am I going to like this what am I upset about I think that people get so lost in the weeds of oh my God the controllers are this much money I'm not going to buy the controller then like just stop right I I I agree with what you're saying and from my own Viewpoint it's like yeah I think my mom's actually right where it's like Mom was right where it's it's like's Mom was right it's like yeah you're going to play Zelda you're going to enjoy Mario and New Donk City whatever the **** that is that disturbing ass looking Mario game they showed the the uh but I look at it more as like a pie chart again speaking for others and speaking more from a from a from a bird's eye view if you look at the pie chart it's like there's a little sliver of people there care about voice chat they're out a little sliver of people there that care about trophies and achievements they're out a little sliver of people there that would have like to play third party games on",
            "start": 1170.76
        },
        {
            "text": "about voice chat they're out a little sliver of people there that care about trophies and achievements they're out a little sliver of people there that would have like to play third party games on Nintendo consoles they're out a little SL like and it's like and then you're just left with the same **** piece of the pie but that piece of the pie is smaller than it was 5 years ago smaller than it was three years I feel like they need to double down on that piece of pie and give that piece of pie more reasons for more people to enjoy it and I think that that the is the big issue is that when you look at it and you're just like I don't want to play Call of Duty on this thing I don't there's it's better it's always going to be better on the other systems Nintendo lost that fight Generations ago you know and I I want to see a place where I'm playing like this year is a horrible example of what I thought the Switch was going to be I thought they were going to come out and that this",
            "start": 1209.8
        },
        {
            "text": "ago you know and I I want to see a place where I'm playing like this year is a horrible example of what I thought the Switch was going to be I thought they were going to come out and that this presentation was going to be here are all the ports that we're doing here's dates for all of them which leads you to believe that next year on is going to be all the new games and there's going to be this calendar of every 3 months there'll be a big game to look forward to and we didn't see that which worries me because now I'm like all right I guess we're going to hear about Pokémon Stars at E3 and it's like that's upsetting now the one good thing about that is it could be the announc E3 coming this fall you know I still think that they have the chance to get all the ports out of the way quote unquote by the end of the year so that at the end of the year come holidays there is a lot of enticing reasons for people to buy this thing cuz there is so many people that didn't buy the Wii U and it's",
            "start": 1242.08
        },
        {
            "text": "by the end of the year so that at the end of the year come holidays there is a lot of enticing reasons for people to buy this thing cuz there is so many people that didn't buy the Wii U and it's like all right I didn't buy one at launch cuz it looked like **** and it doesn't have launch games I want and it only has you know five games or whatever but then come the holidays it's like oh well now it has Zelda and I never really got into Mario Kart 8 and I'll give Splatoon a try because you know people seem to like it and I don't understand it but whatever it's there and you know Pokémon create an HD Pokémon on a console I should try that out and I think that by then hopefully there's a lot more but again I can't stand by that because they **** up so bad at this presentation but I do think it's good that they talk about things like Xenoblade Chronicles that they are seemingly just putting all in on Fire Emblem in a way that I would have never expected them to well I think the Fire Emblem",
            "start": 1281.28
        },
        {
            "text": "it's good that they talk about things like Xenoblade Chronicles that they are seemingly just putting all in on Fire Emblem in a way that I would have never expected them to well I think the Fire Emblem sold better than than they expected over the last two two uh what Fates and Awakening or whatever the I I agree with what you're saying but I would I would say that what you're saying is like yeah I want to get Mario I'm interested in all these things but the vent diagram between all these games it's just a **** Circle and that's why you need to have I don't think it is though because but if that wasn't true we bunch of various circles and I think that it's a matter of getting those people to push over a little why didn't I play Splatoon more I should but I didn't because it's a slightly different Circle than the circle I'm in and it's like if they were to tell me that I get I'm just hypothetically saying this I get Mario and January I get uh Zelda in uh February I get Metroid in March",
            "start": 1317.0
        },
        {
            "text": "Circle than the circle I'm in and it's like if they were to tell me that I get I'm just hypothetically saying this I get Mario and January I get uh Zelda in uh February I get Metroid in March then I get Splatoon in April then I get uh Smash Bros. in June all of a sudden I'd be like I guess I should play Splatoon you know just because I trust them for all these other things that I love so I'm going to go a little bit out of my comfort zone I'm going to try out Xenoblade Chronicles in a way that I wouldn't before and I think that that's how they get that Circle to be bigger and stronger and to buy every single thing that they do instead of now it being so long and far apart that it's like you feel burned even in the console that you're in so I'm like I don't trust you for Splatoon I don't even really want to play it even when you hear good things about it I don't jump into it uh to me I I think this thing is good for an automatic 10 million units and then everything else from there is",
            "start": 1357.68
        },
        {
            "text": "even really want to play it even when you hear good things about it I don't jump into it uh to me I I think this thing is good for an automatic 10 million units and then everything else from there is going to be added I'm not saying it's going to stop a 10 million news but everything else from there is going to be is going to depend on things outside of their ecosystem um because I think Wii U when you really look at it with the exception of a 3D Mario game had almost everything that like a per like a Nintendo fan would really want like a modern day Nintendo fan would really want had a lot of games like and I think that that was one of the major misconceptions even from second party was that like there were it was supported what hasn't been supported more recently but and there were huge gaps but that's my major concern is like you want to like I look at it from the other way like get the Assassin's Creed bro in the door so he knows Splatoon is good because otherwise he's not going to",
            "start": 1397.56
        },
        {
            "text": "but that's my major concern is like you want to like I look at it from the other way like get the Assassin's Creed bro in the door so he knows Splatoon is good because otherwise he's not going to know and he's not going to care because one of the major things that that I think is being overlooked too and although some people have mentioned it but it's not a major talking about I know how you agree about it is that Switch happens to be coming out at a very bad time when you look at and Zelda is obviously going to negate much of that for a lot of people but a lot of games are coming out March and April like a lot of great important games around that time whether it's Horizon or Mass Effect or whatever it might be that are going to distract from it too and then what does it look like like you were saying a year 18 months from now that's why I was so disappointed I wish they really had a road map where they're like like where they really I I typically don't agree that you need to announce",
            "start": 1429.92
        },
        {
            "text": "were saying a year 18 months from now that's why I was so disappointed I wish they really had a road map where they're like like where they really I I typically don't agree that you need to announce games way ahead of time as people know but with Nintendo they do because they need to show something and it would have been awesome to say like June's here August is this September is this November's this next February's this April's this June's this like and we're hitting all these dates and there's your reason to get in and what I said to people was like the third third party Sport's not happening it's just not going to come like and and so they better hope for a better and more vibrant Nintendo this time than they got with Wii I don't think you should hope for that because I don't think it's possible like I I I think they're going to Zelda's going to be great I think Mario is going to be great again super **** disturbing to see Mario in a in a world like that Sonic '06 really really",
            "start": 1467.56
        },
        {
            "text": "possible like I I I think they're going to Zelda's going to be great I think Mario is going to be great again super **** disturbing to see Mario in a in a world like that Sonic '06 really really can't forget and I've erased that from my mind uh him standing next to a human probably gonna **** that human hope yeah he is but I just I I like that that like I said like EA just putting FIFA on there which is apparently maybe even a last gen version of FIFA Ubisoft putting out Rayman Legends and Steep and then and then to Greg's point always they're going to be like oh they didn't sell we're out you know wouldn't have been better to EA to be like we put Mass Effect on it when like because it's **** new the one thing I want they don't think they can make money wrinkled add this I think that we that I I think we talked about earlier not headon and I think applies to what we're talking about right now because the argument has always been Nintendo fans alone can't carry a console since",
            "start": 1499.92
        },
        {
            "text": "we that I I think we talked about earlier not headon and I think applies to what we're talking about right now because the argument has always been Nintendo fans alone can't carry a console since the Wii U right personally and I know that you on a different side of this right when I think of my GameCube I have nothing but fond memories about my GameCube but the games I think of with the exception of Twin Snakes really are Nintendo exclusives Animal Crossing cart golf stuff like that right but I love that system when I think of my Wii I think of being excited for when it first came out and then feeling like they marched away from me when they went more mainstream and do stuff but I remember Galaxy I remember other Nintendo exclusives on it the Wii U I remember thinking was a piece of garbage at launch hated the the way it worked the way the way it loaded all these different things and I know that there's been great games on it but like I'm saying I'm so over that system I never want to",
            "start": 1544.72
        },
        {
            "text": "at launch hated the the way it worked the way the way it loaded all these different things and I know that there's been great games on it but like I'm saying I'm so over that system I never want to plug it in so the one thing I think that is a part of this that time will tell how much it actually matters when we talk about the Switch is the fact that it's going to be a console again for Nintendo games but it's a cool piece of Hardware again which is something you know what I mean like my GameCube I love that **** controller and we I was excited about motion controlling at first cuz it was different and it was turned the thing and it didn't look like every other thing and granted that went in a different direction direction that I wasn't thrilled with but the Wii U right with this game pad that's not responsive and not multi-touch and has a shitty battery and does all this stuff I **** hate no I hate this **** thing I don't want to do it so that was the albatross I had to put on",
            "start": 1585.48
        },
        {
            "text": "that's not responsive and not multi-touch and has a shitty battery and does all this stuff I **** hate no I hate this **** thing I don't want to do it so that was the albatross I had to put on if I wanted to play one of the if I wanted to play card and I **** love Mario Kart you know what I mean and like I couldn't even do it I just couldn't do it I hated using that thing so much even when I was just using a Pro Controller I still had to deal with the **** squares and everything I hated about the Wii U I think there is something to be said for the fact that this is going to have cool Nintendo games and be a cool piece of hardware and I don't know how much that expands the pie how if that can help lift up the people who are like me who are just like I hated the Wii U I but I do think it is it's not exactly the Wii U again in terms of like Can Nintendo games carry by themselves well I'll just say that you know what I've said before is Wii is the outlier and if you pay attention",
            "start": 1621.08
        },
        {
            "text": "it is it's not exactly the Wii U again in terms of like Can Nintendo games carry by themselves well I'll just say that you know what I've said before is Wii is the outlier and if you pay attention since SNES all the way down every hard piece of Hardware at Home Hardware sold worse than the one before it so that that shows you something whether or not it's meaningful or not I don't know I happen to love SNES obviously N64 and GameCube especially I love GameCube I think it's it's one of my favorite consoles of all time I really think it's a special console but you might think about that way but there were there was significant third party support on GameCube and anyone who's saying otherwise didn't play GameCube has no idea what they're talking about right on through the very end of the console I mean Capcom especially was all over that **** console um but there were others evil yeah Resident Evil 4 Viewtiful Joe not to mention like almost every well not almost every game but lots of",
            "start": 1658.32
        },
        {
            "text": "I mean Capcom especially was all over that **** console um but there were others evil yeah Resident Evil 4 Viewtiful Joe not to mention like almost every well not almost every game but lots of games came out on all three consoles so and and that continued all the way through and clearly games were selling on GameCube in that and I have a lot of games like that a **** ass not amount of GameCube games my my whole takeaway you might be right the Switch clearly is a better piece of Hardware than the Wii U doesn't get any worse than the Wii U I mean the Wii U is awful but I I I just I stand by this notion that because a lot of people are like you know I always diminish the the power argument you do too where it's like well it's running at 70 and Zelda is like 900p or whatever on it and it's like I don't care and everyone's like well it was more powerful to attract third parties and I'm like maybe that might be a piece of the compon but it's really not because if division went to Treyarch",
            "start": 1694.4
        },
        {
            "text": "I don't care and everyone's like well it was more powerful to attract third parties and I'm like maybe that might be a piece of the compon but it's really not because if division went to Treyarch and was like Hey make Call of Duty work on this they would do it if they had any if they had any notion that it would be supported that Nintendo would care and that fans would be there they'd make that game Run on a **** toaster oven you know if there could be money made there so the whole power argument's out there it's just that these guys have been like you have to look at it from the third party perspective they've been burned over and over again by this company and they are out I mean that's the whole thing is like this is just as good as being out because think about Ubisoft last year or last generation at least they gave them ZombiU like they tried to give you something right now they're just like **** you basically you know like we're",
            "start": 1729.12
        },
        {
            "text": "last generation at least they gave them ZombiU like they tried to give you something right now they're just like **** you basically you know like we're and and and and then EA EA made as I said in the Colin Was Right made $4.5 billion dollars in revenue and a billion dollars in profit and wants to do nothing on the Switch like these guys are bean counters to the max bad bad the this is a bad Omen and whether or not it whether or not it it turns around but as I said again not one example not one example of a console succeeding without third party support not one and and uh so if Switch does it it'll be the first and uh again we have to talk about what what success is I think if this thing me hits 10 million units which is possible I think they'd be **** how much throughs though 60 this thing needs to beat that in my opinion I think that besides no way besides the conference sucking like I think the biggest issue they had was like the",
            "start": 1765.68
        },
        {
            "text": "be **** how much throughs though 60 this thing needs to beat that in my opinion I think that besides no way besides the conference sucking like I think the biggest issue they had was like the conference focused on Joy-Con controllers and this is a console it's a Home console it's a Home console they should not on that I think Nintendo from the get-go should have been like yo this is this is a port this is what Nintendo is now it's portable they should I mean like they should have stopped should stopped 3DS and then you should have totally stopped it instead of seemingly doubling down on it now and still announcing games the Fire Emblem direct yeah had it own 3DS title it's like what the **** 3DS title and it's a mobile game too that's a uh well the mobile game looks **** awesome and February 2nd way sooner than I thought and on iOS and Android same day that's an update to the the direct a lot of people might have missed out on super excited about that um but Fire Emblem Echoes",
            "start": 1812.24
        },
        {
            "text": "February 2nd way sooner than I thought and on iOS and Android same day that's an update to the the direct a lot of people might have missed out on super excited about that um but Fire Emblem Echoes which is a remake of Fire Emblem that's coming to 3DS eShop so it's like all right cool I guess that they're still putting out new games there uh then Fire Emblem Warriors which is going to be a fall title for the Switch also come to the 3DS and it's like I get they force getting work they already had the the you know the engines made because of um Hyrule Warriors so I'm like all right cool whatever but didn't everyone hate Hyrule Warriors on on 3DS didn't it suck well it didn't play well on 3DS it was good on New 3DS s uh this one only coming to New 3DS oh so there's that um and then they announced Fire Emblem uh uh the Switch for a new Switch Edition coming in 2018 so I'm like thank you at least there's that to look forward to um but yeah I mean they're still talking about 3DS and",
            "start": 1847.0
        },
        {
            "text": "announced Fire Emblem uh uh the Switch for a new Switch Edition coming in 2018 so I'm like thank you at least there's that to look forward to um but yeah I mean they're still talking about 3DS and they're still pushing it and it's just like you should have just **** killed cut the legs off hey guys we're done making Wii U games we're done making 3DS games this is the Nintendo Switch because it's the fact that everybody's comparing these the the Switch to consoles because Nintendo doing it too that's the biggest issue why are we talking about Call of Duty on this thing we should be comparing this to the 3DS and Vita we should be comparing this to how much better it is than those and how awesome it is that we're getting these great experiences portably but instead I agree that's their fault though but it's entirely their fault and it it sucks because when we we look at the rest of the year's lineup like talking about a lot of things like like Rayman Legends uh NBA 2K18 Ultra Street Fighter",
            "start": 1893.52
        },
        {
            "text": "fault though but it's entirely their fault and it it sucks because when we we look at the rest of the year's lineup like talking about a lot of things like like Rayman Legends uh NBA 2K Ultra Street Fighter Minecraft Minecraft Story Mode Project Sonic and Sonic Mania Yooka-Laylee Shovel Knight these are a lot of games that some of them are coming to other consoles but I want to play them on the Switch because I these are games that I want to play portably and I it's my per I want to play Sonic Mania on this not on my PlayStation 4 that's good let's double down and Target that audience because that's what this is this is what the what I said before this is what the Vita should have been it's a bunch of indie games and every once in a while a quirky third party title but in addition to Vita it's quality first party games consistently being made and we're not seeing that yet hopefully once we get through this whole Port like the Fiesta yeah the Port Fiesta which I don't I think is a",
            "start": 1932.2
        },
        {
            "text": "it's quality first party games consistently being made and we're not seeing that yet hopefully once we get through this whole Port like the Fiesta yeah the Port Fiesta which I don't I think is a great thing I'm so happy to do I want to hang out in the Port Fiesta I thought it was going to be the Port Storm but I can deal with the Port Fiesta Port Port Storm I think it's a fiesta it's going to be a good time but it's upsetting because me going I played this thing at the event like man this is going to replace my 3DS not oh this is going to replace my PlayStation 4 right right but but and I would agree with you except for cuz I was I agree with a few points a them them keep calling it a console console console it's like mistake mistake mistake mistake mistake M mainly because of what you're saying because then my comparisons would be totally moot but I'm making those comparisons because they're making those comparisons by calling it a console you're putting it in the league with the",
            "start": 1972.12
        },
        {
            "text": "saying because then my comparisons would be totally moot but I'm making those comparisons because they're making those comparisons by calling it a console you're putting it in the league with the Xbox One and PS4 and guess what Switch is now going to be in line to have to go against PS5 and the Scorpio as well and that's when things are gonna get really **** dire if they don't if they don't if they don't uh because we're gonna see Scorpio this year it's probably I don't think it's gonna come out this year but you're gonna see it this year and then you're gonna see a huge Quantum Leap of another company calling their thing a console and that and so this is what I'm saying like they don't really know what they're doing they really honestly I I have a couple predictions for what I think the the future holds for the Switch and these are being you know pretty positive on it and just hopeful at the same time but I think that this year is going to be a lot of trying to just build the",
            "start": 2012.92
        },
        {
            "text": "the the future holds for the Switch and these are being you know pretty positive on it and just hopeful at the same time but I think that this year is going to be a lot of trying to just build the catalog with a lot of ports then we're going to get to E3 and I think that's when we're going to get a lot of release dates for a lot of the ports and a couple announcements for next year and it's not going to be until the end of this year that we finally see the 3DS die off and they do finally put that behind them and it's not going to be till 2018 that they start talking about the Switch not as a Home console device but just as this is the Nintendo system like whatever that means to you and it's going to start to find its own Niche and I do think that's when third parties are going to be like okay this is just the portable system we're not trying to Port our Mass Effect to it we're trying to either make something from the ground up or not you know I think that that's the only chance it",
            "start": 2042.4
        },
        {
            "text": "okay this is just the portable system we're not trying to Port our Mass Effect to it we're trying to either make something from the ground up or not you know I think that that's the only chance it has at getting things like what we saw at the GameCube with so such strong third party support they look at it as a different type of system and this GameCube support remember came with fewer than 5 million units sold over the entire life of the console which is abysmal uh outsold literally 6 to1 by PS2 and yet Capcom was still interested in going there and others were still interested in going there Publishers are still interested in going there because there was money to be made there that's and that's and that's the thing that that I you know I really do mean it if if if Ubisoft was like we want Watch Dogs 2 to run on this thing and we think it could sell they would make it work it's not it's not a it power makes it easier there was a piece uh from that was circulating today about",
            "start": 2082.32
        },
        {
            "text": "we want Watch Dogs 2 to run on this thing and we think it could sell they would make it work it's not it's not a it power makes it easier there was a piece uh from that was circulating today about Respawn basically laughing when they asked if Titanfall 2 can run in there and I'm like I don't think EA would let you guys be laughing too much if they thought You' make a **** Buck on there you know then you'd figure it out it's just it just makes it more expensive and there and therefore harder so there is a disparity there that I think is relevant and important but it is not that important uh Wii was significantly weaker than PS3 and there were still games between those two consoles so because they sold there yeah so I I just I want Nintendo to succeed and the only thing that's changed in me is that I just don't believe anything they say anymore now they're like this is GNA be great I'm like I don't believe you now I don't believe a **** word you say and you'll show me now because I",
            "start": 2119.44
        },
        {
            "text": "me is that I just don't believe anything they say anymore now they're like this is GNA be great I'm like I don't believe you now I don't believe a **** word you say and you'll show me now because I for some reason put a ton of faith in this machine and you guys showed me that you really don't know what you're doing so and you showed the world that you know that as well and yeah Zelda looks great and Mario looks great my I question again is then what then what I mean the big Splatoon is not good enough big question as we talk about the year of Nintendo is does Mario really come out this year oh absolutely okay without a Shadow of Doubt be that would be a disaster from everything I've heard Mario is done and they're holding it to the fall for a big fall game and for something to drive towards all the rumors pointed to this being a launch game and from everything I've heard is it is very close to completion if not already done my I I I'll say this and I don't know how popular it'll be",
            "start": 2161.2
        },
        {
            "text": "all the rumors pointed to this being a launch game and from everything I've heard is it is very close to completion if not already done my I I I'll say this and I don't know how popular it'll be and I don't know if it will resonate with anyone but I were them you can't make this decision now but 6 months ago a year ago I would have been like we're we're releasing Zelda on Wii U last fall when it was clearly probably ready then we're going to put the Switch out the fall after and we'll put Zelda on there too but it'll launch with a Mario game a 3D Mario game the first 3D Mario game since our **** but Bonkers selling Galaxy series that everyone's going to be really excited about in that time we will be able to get everything that we do not have ready for this console ready to go we'll have voice chat ready to go we'll get we we'll we'll get rid of the innan excuses why we don't have Netflix which runs on **** everything on there and all these video devices we'll get video streaming",
            "start": 2202.28
        },
        {
            "text": "voice chat ready to go we'll get we we'll we'll get rid of the innan excuses why we don't have Netflix which runs on **** everything on there and all these video devices we'll get video streaming going on there and video capture on there we'll get a trophy system in there we'll do all these kinds of things give themselves time they should have done that I really do feel like this thing is being rushed to Market and I do not understand why and and I think they're hurting the console because if power is not part of the equation which it shouldn't be another six months shouldn't hurt it it should only help it and it should allow them to engender more support as well and I think that you know we'll see how it lives or dies uh but I think that if they can get I think P was saying between six and 8 million in its first year I think if they can hit 8 million I think they'd be **** thrilled I'll be I'll be surprised if they do but um that would be awesome and I wish them the best I hope",
            "start": 2240.84
        },
        {
            "text": "and 8 million in its first year I think if they can hit 8 million I think they'd be **** thrilled I'll be I'll be surprised if they do but um that would be awesome and I wish them the best I hope they sell I hope **** Switch sells 500 million units becoming better selling than every other console before it combined Greg but it's I don't know I I don't I I'm scared for them and I'll be interested to see how this kind of rolls and adops I disagree in the sense that I'm happy it's coming out so soon like so ridiculously soon like the fact that this thing's weeks away it blows my mind uh because I I think that we just need to power through the launch period and just hopefully get to what this system is really going to be and I wish that wasn't the case I wish that right the gate that had all these things and it was what we all dreamed it was going to be it's not though so I'm like all right I need to do exactly what I did with the 3DS and just kind of hope they have a relaunch period",
            "start": 2271.4
        },
        {
            "text": "all these things and it was what we all dreamed it was going to be it's not though so I'm like all right I need to do exactly what I did with the 3DS and just kind of hope they have a relaunch period And I think that they have to especially since it will be their only console eventually they do have a relaunch period it's April Dry Bones yeah Dry Bones April 8th day after my birthday about to let it go there you go Mario Kart 8 Deluxe prove me wrong Nintendo do it",
            "start": 2307.2
        }
    ]
}