{
    "id": 2274,
    "video_id": "toIRRaHN-Jc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Movies Greg Saw in 2016 - The GameOverGreggy Show Ep. 161 (Pt. 3)",
    "description": "Greg Miller talks about all the movies he saw in 2016.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1483518030,
    "duration": 2060,
    "transcript_chunks": [
        {
            "text": "Ahoy-hoy, this episode of The GameOverGreggy Show was brought to you by Blue Apron. I've talked about Blue Apron quite a bit, ladies and gentlemen, because you know, #CookingWithGreggy. I cook all the time and Blue Apron was a gift my mother gave me last year. I'm pretty sure she did not use the code. I'm not sure if we had the deal, but basically Blue Apron sends you all the fresh ingredients you need to make awesome meals. And you might say, \"Greg, I have no talent at cooking like you do.\" And I will tell you right now, ladies and gentlemen, I once had no talent of cooking either before I became the male Rachael Ray. Basically, all you need to do is these are 30-minute meals for the most part. They send you the instructions, you go through step by step with the pre-portioned ingredients and you make whatever you want. Do you want to know what's in the upcoming meals? Hell yeah, you do. Seared pork chops with far-out farro and cranberry chutney. I don't know if that is, but it sounds good. Spaghetti squash and",
            "start": 0.0
        },
        {
            "text": "you want. Do you want to know what's in the upcoming meals? Hell yeah, you do. Seared pork chops with far-out farro and cranberry chutney. I don't know if that is, but it sounds good. Spaghetti squash and marinara with mushrooms and garlic knots. Garlic knots are great. Spicy shrimp and Korean rice cakes with cabbage and furikake. I can't be right pronounce that, but that's how I'm gonna do it anyways. It's affordable. It's less than ten dollars per meal per person. They deliver it all to you. It's seasonal, it's flexible, it changes. You get to go online, pick your meals. Everything's great. So here's what you do: check out this week's menu, get your first three meals free with free shipping by going to BlueApron.com/Greggy. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait. That's BlueApron.com/Greggy. Blue Apron, a better way to cook. My topic. Yeah, boy. Nick, yes, you like movies? I do love movies. This is our final GameOverGreggy",
            "start": 35.34
        },
        {
            "text": "with Blue Apron. So don't wait. That's BlueApron.com/Greggy. Blue Apron, a better way to cook. My topic. Yeah, boy. Nick, yes, you like movies? I do love movies. This is our final GameOverGreggy Show of 2016 as we move into 2017. Early in 2016, I decided I wanted to see more movies and I wanted to be better about it, you know what I mean? Because I've always been bad about it. Yeah, I've seen more than 50 movies set for you. I've chronicled them all and where I saw them because we always article, we are, you know, I've seen, I've seen Chronicle before. I do know this. Now this movie, this does include things I've seen before. There, note it is such, but it also examines where I'm watching it, how I'm watching it, and what I, what movies I've watched and why I watch them again. Say what you're wearing when you watched it. No, sadly. Too bad. So now I'm sure I missed a handful of these. Sure. No, I mean, I'm sure I've missed a handful things I forgot to do it. You don't see, we don't think about Ghostbusters",
            "start": 72.03
        },
        {
            "text": "when you watched it. No, sadly. Too bad. So now I'm sure I missed a handful of these. Sure. No, I mean, I'm sure I've missed a handful things I forgot to do it. You don't see, we don't think about Ghostbusters anymore. No, it's on here, trust me. There's quite a bit. See, I'm gonna restart running you through them. I want you to rate my list here. Everyone, every, we can do this. Chime in on movies you want to talk about too. All right, great. So I started 2016. The first movie I watched was Sleeping with Other People on Amazon. Great. You're more familiar this one? Nope. This is Alison Brie one. It was great. This was good romantic combo. Yeah, I liked it a lot. How does it compare to Neighbors? I know different genre, but I put them in the same category idea. I think I would never watch this, but maybe I would. See, this is one of the things as you go through, I watched that on Amazon. You're gonna see a lot of Amazon on here. And I, what I found myself doing a few times around on there was I, I'm big on going to Amazon, watching",
            "start": 131.11
        },
        {
            "text": "of the things as you go through. I watched that on Amazon. You're gonna see a lot of Amazon on here. And I, what I found myself doing a few times around on there was I, I'm big on going to Amazon, watching all the trailers for the new released movies and then being like, \"I thought there was more movies I wanted to see than this.\" Because I feel like we're in the theaters, trailers are going and I'm like, \"Yeah, I see that. Yeah, I see that. Yeah.\" And it seems like it's always six months later for me seeing something. And I go into Amazon, I'm like, \"I don't watch this crap. I'm not in the mood for this.\" But I would have been in the mood for apparently when I saw the trailer. But what I started doing was taking a shot more. And Sleeping with Other People is one of them where I'm like, \"Oh man, it doesn't have that many stars. IMDb didn't like that much, but I like both those people. I liked those people.\" Like, \"Why? Oh, ****, I should probably take a shot.\" And I did that. I started taking shots on movies where I was like,",
            "start": 170.86
        },
        {
            "text": "stars. IMDb didn't like that much, but I like both those people. I liked those people. Like, \"Why? Oh, ****, I should probably take a shot.\" And I did that. I started taking shots on movies where I was like, \"Well, I like it.\" It's like how I went, saw, we'll get to it eventually, Central Intelligence, right? Was like, \"All right, cool. Rock and Kevin Hart. I'm **** it. Let's go to the theater and see.\" So, Sleeping with Other People, Straight Outta Compton. I love it. I did The Visit. Yes, this year. Yeah, no, this is again what I've seen in 2016. So it's Sleeping with Other People, Amazon, Straight Outta Compton, Amazon, The Visit on Amazon, which again, it was one of the way I got too late. I think it was too hyped up, but I enjoyed myself. No big deal. The Visit, not the best movie ever, but a surprisingly good movie. Sure. Being in my shop alone, which is what I think that's where the hype came used to be the homie. I feel so bad that it's fun, but busy still is the homie. Yeah, is that, is Split, Split, Split, the one with",
            "start": 202.72
        },
        {
            "text": "which is what I think that's where the hype came used to be the homie. I feel so bad that it's fun, but busy still is the homie. Yeah, is that, is Split, Split, Split, the one with Professor X? Yeah, it's, I, I saw a commercial for last night for the first time in forever. So I think it's on DVD now. No **** way. Or in or out have I? Because this is my problem with movie trailers too, but you show me a trailer so **** far away. Yes. I don't think, I don't think I saw a trailer last night. I think when I was DVRing and watching my DVR, The Walking Dead. So either it survived to come out final Inglot. No ****. James McAvoy. McAvoy. Thank you. James McAvoy. Kev, you get back to us on that one. Watch Propaganda Wars on Netflix. That's a great movie. That's the one about North Korea, right? Yeah, exactly. Yeah, it's a great one. Yeah. And then like they go to, Split is what it's called. Thank you. Yeah, that one, right? I don't, Propaganda Wars signs in it. January 2017 works great. Propaganda Wars, yeah.",
            "start": 240.64
        },
        {
            "text": "exactly. Yeah, it's a great one. Yeah. And then like they go to, Split is what it's called. Thank you. Yeah, that one, right? I don't, Propaganda Wars signs in it. January 2017 works great. Propaganda Wars, yeah. Super interesting. The guy there who's like the English-speaking expat, whoever they're like, \"Hey,\" and he's like, \"I'm their Ministry of like propaganda.\" Yeah, he's that guy's been bouncing, he's a Spanish guy. Yeah, he's been bouncing around for like 20 years. He's like, he's a **** weirdo. That is so weird. That's a really good movie. All right, so then I watched The Intern on Amazon. I liked it a lot. That's all De Niro. Yeah, Robert De Niro. I watched that on a flight. Someone in front of me was watching it on the way to PAX. So I want to say her stuff. So no, I was going to Nate's for Christmas last year. So around this time, I shared no sound. So I don't know what it's about, right? But I watched the entire thing. I think I got an idea like he's trying to get back into the business. Woman owns a business. Is her",
            "start": 282.94
        },
        {
            "text": "this time. I shared no sound. So I don't know what it's about, right? But I watched the entire thing. I think I got an idea like he's trying to get back into the business. Woman owns a business. Is her husband's cheating on? Oh, yeah. Right there. Right there. I like, I liked it a lot. And again, this is a thing of, I like Anne Hathaway and I like Robert De Niro. And I didn't get around to seeing it in the theater. So it's on Amazon. Why not take the shot? Whoo, Paula, Paula. Hey, Anne Hathaway. Kevin hates her. That's weird. Don't get me started. I **** love Anne Hathaway. One of my favorite actresses. Okay, pull with a passionately hate her. Now, this is the first repeat of 2016. I've seen this movie before. Oh, Goodfellas. I good, I got, I got Goodfellas off Amazon. I forget who hadn't seen Goodfellas. And I was like, \"Oh, we're watching Goodfellas.\" Got it. And got it off Amazon. I love Goodfellas. Goodfellas, a fantastic, phenomenal. Everyone watch Goodfellas. First time going to a theater in 2016, Room. Went in, saw Room.",
            "start": 321.16
        },
        {
            "text": "Oh, we're watching Goodfellas. Got it. And got it off Amazon. I love Goodfellas. Goodfellas, a fantastic, phenomenal. Everyone watch Goodfellas. First time going to a theater in 2016, Room. Went in, saw Room. Remember this movie? Brie Larson. I loved that movie. Really. Actually saw that one, believe it or not. Yeah, no, that was a really, really good one. I like that one a lot. And that was one of those that I knew it was a really good movie about the fact that it stuck with me so long as I saw it. And then weeks later, we're still thinking about it. You know, let me tell you, I was on Prime right now. I thought it was weird that the, the, I think we talked about the snake that the Brie Larson got a nod, right? For an Academy Award for that. That the kid didn't. But the kid didn't. The kid was way, but with the kid was awesome. Mm-hmm. He's really shocking to me. She was some other award though, right? I remember him giving a speech like his parents. Okay. But yeah, Brie Larson just kind of a, she had a moment around that.",
            "start": 371.85
        },
        {
            "text": "awesome. Mm-hmm. He's really shocking to me. She was some other award though, right? I remember him giving a speech like his parents. Okay. But yeah, Brie Larson just kind of a, she had a moment around that where, you know, they were Pylea campaigning for her. So I think she became Captain Exciting for that. She's also got some other movie coming out that you can tell she felt like 10 years ago. Somebody's been sitting on it. Oh, yeah. You guys applies to the preview for us with her. It's all in one place. They're all trying to kill each other. It's just a bunch of assassins that are trying to kill each other. And she's in it. And she's like, it's like her, but her from like maybe a year or two after 21 Jump Street. Yeah, like, yeah. Next on Amazon, Birdman. Did not like. We talked about this in Kinda Funny Live. Didn't I? I didn't ****. Okay, glad you liked it. Batman: Bad Blood on Amazon. An animated feature with that woman. I don't even know. We saw that today. And again, on Kinda Funny, glad we were going through my Amazon",
            "start": 410.64
        },
        {
            "text": "I didn't ****. Okay, glad you liked it. Batman: Bad Blood on Amazon. An animated feature with that woman. I don't even know. We saw that today. And again, on Kinda Funny, glad we were going through my Amazon purchase. Gramps, dude. I don't remember that **** movie's about like, literally, I don't even remember. I think I remember her getting in a fight with a father. Deadpool in the theater, of course. Great. So I'll Man Up on Amazon. Now here's the thing about Man Up. I would you typically also have no idea what **** Man Up. Okay, Kevin, can you show me what Man Up is? All right. So Free Fire is the Brie Larson. This has been cooking forever. That that poster looks terrible. That does not look good. Show me Man Up now. And what this movie wasn't Amazon. Let's get y'all getting my recap of it. Oh, wait, hold on. It might have. No, that's not it. That's not it. Oh, the Simon Pegg romantic comedy. All right. Yeah, this is another good one. This isn't recommended as well. I forget who Kevin, who stopped going back to **** Brie Larson.",
            "start": 452.22
        },
        {
            "text": "No, that's not it. That's not it. Oh, the Simon Pegg romantic comedy. All right. Yeah, this is another good one. This isn't recommended as well. I forget who Kevin, who stopped going back to **** Brie Larson. **** movie. Man Up. Who wrote Man Up or directed it? Okay, that doesn't help me. Burnt, I saw on Amazon as well. That was that Bradley Cooper one where he's the disgraced chef. These keys come back to get his Michelin star stuff. It was really good. Again, no, it was another one when I was like, I've seen trailers for a long time ago. I swear to God, if I see this Brie Larson poster one more thing. I'm like, I really like Bradley Cooper. And it was another thing where no one ever talked about that movie, but I saw it in the thing. I'm like, you know what? I will do that. 10 Cloverfield Lane in the theater. Great movie. Liked it a lot. And he was weird, but I liked it a lot. Yeah, Tumbledown on Amazon. Vaguely, you know, I can't give you much on what this one was. I need to see the poster. Kevin, give me Tumbledown. Saw",
            "start": 497.69
        },
        {
            "text": "movie. Liked it a lot. And he was weird, but I liked it a lot. Yeah, Tumbledown on Amazon. Vaguely, you know, I can't give you much on what this one was. I need to see the poster. Kevin, give me Tumbledown. Saw Bridge of Spies on Virgin America. Yeah, I didn't like that one. I enjoyed it fine. It was the ticket war. Yeah, the tray where Tom Hanks gets called into Italy because he's, it's based on a true story where he's like a lawyer and they're like, \"You know what did you do?\" Like, yeah, the at Checkpoint Charlie like during the world. Oh, cool. It's a cool concept. I just didn't, it was very Spielberg. Like Spielberg when he's like, \"All right, everyone get the paint brushes out, get the numbers out. Let's start painting by numbers.\" Like this, I know this is good to evoke emotion here. Yanis, get your camera. Yanis, yes. Can't hear any more. That was the thing about, I think it's on a Virgin America flight, right? It wasn't something that I wanted to go to a theater for enough and I didn't want to watch on that for Amazon. I know.",
            "start": 550.68
        },
        {
            "text": "any more. That was the thing about, I think it's on a Virgin America flight, right? It wasn't something that I wanted to go to a theater for enough and I didn't want to watch on that for Amazon. I know he's gonna keep going to see ignore music, but I'm gonna see it on Virgin America. I was last one. Yeah, get down on her flight. Midnight Special. Saw that. I have not seen Midnight Special. Was really fun. And I said alive. That's on Amazon. I went on an opening, you know, whatever day or whatever with some friends when it was down at, uh, not RTX, the other Austin went. I stopped by South by Southwest. And I was like, \"How cool?\" I have no expectations for this movie, but it's got Dodd in it. I'm interested. Like, \"Oh, this is fun. That's a cool science fiction.\" All right, then Batman v Superman in theaters. Great. Then Batman v Superman in the theater in 3D. Then Batman v Superman in the theater. Then The Invitation on Amazon. Now, which one's The Invitation? You remember this? I don't know. Kevin, throw up Invitation to one more day.",
            "start": 593.82
        },
        {
            "text": "in the theater in 3D. Then Batman v Superman in the theater. Then The Invitation on Amazon. Now, which one's The Invitation? You remember this? I don't know. Kevin, throw up Invitation to one more day. Nobody got away. They think. No, I didn't do that. This is the one I do believe that is the one that Alamo Drafthouse did. Yeah, that Alamo Drafthouse did through their production company and promoted the **** out of it at Alamo Drafthouse forever. But basically, this guy's invited over to his ex-wife's house for a dinner party with all their old friends and it gets all creepy and cool. Another one I don't hear anything to talk about. Kev, really enjoyed up on the big screen. Really, really enjoyable. No, just on the TV. It's too hard to see when it goes down to little one. Yeah, that they don't Wolverine off him. No one. Okay, we don't care. Then I saw Batman v Superman in the theater again. Then I saw Civil War in the theater. Then I saw Civil War in the theater. The war's great. Yeah, well, the Spider-Man part was awesome. Oh, it's great.",
            "start": 631.16
        },
        {
            "text": "care. Then I saw Batman v Superman in the theater again. Then I saw Civil War in the theater. Then I saw Civil War in the theater. The war's great. Yeah, well, the Spider-Man part was awesome. Oh, it's great. Then I saw Hush on Netflix. You see Hush? No, it's got Jim from Newsroom in it. And it's about like this, this a deaf woman, right? In our house, in our house, the cabin all alone. And then Jim's coming and like attacking and stuff. It's **** scary, but it's cool. I recommend with Jennifer. Netflix or that movie? No, I don't remember Jennifer. Breathe. Oh, don't pray. That's on my list. So we are still here on Netflix. Now, this was a, this is a Jimmy Champane recommended horror flick because I think I liked Hush so much. I wanted another horror flick. I tweeted about it. He gave it to me. Super **** weird. Really weird foreign horror movie or whatever, but it's got some good special effects for the people who are like the ghost people. I want to recommend it, but go watch the ghost people special affection.",
            "start": 675.26
        },
        {
            "text": "weird foreign horror movie or whatever, but it's got some good special effects for the people who are like the ghost people. I want to recommend it, but go watch the ghost people special affection. So Hateful Eight finally on Amazon. Hell, what do you think? I loved it. It was one of those that I forget what happened. Why I didn't go see it with all of you. One said I, I didn't go see with all of you. People came out with mixed opinions on it. And then when I got it and I put it on, I was like, \"This is **** exactly what I love about Tarantino.\" Just talk forever. And let's see what I got. What I forgot why I didn't like it. What the hell? Why did I, why didn't I like it? I think it was just a sort of switch order up. Besides that, **** fantastic. I got to go back and listen. Old Kinda Funny, we did it. The traffic on that shoulder. I remember being really disappointed. I like Tarantino a lot. I've ever get being especially after Django Unchained, which is **** phenomenal, right? I thought this was a huge tender.",
            "start": 717.29
        },
        {
            "text": "on that shoulder. I remember being really disappointed. I like Tarantino a lot. I've ever get being especially after Django Unchained, which is **** phenomenal, right? I thought this was a huge tender. Second, really? I know. Yeah, I think the fact that maybe the people already knocked it down, but lowered my expectations going in. Not a great time. Really enjoyed it. Barista on Amazon. Documentary about being a barista and then going to some barista competition. It was fine. Saw The Lobster and feeder. This is that, uh, that's my Amazon queue right now. It's good. It's weird for a weird indie. Yeah, yeah, super weird. Got the girl from Mom. Ooh, I forget her name. But anyways, interesting. Really crazy ending. Yes, right. The Conjuring 2 in theaters. I like The Conjuring so much that I had to go see The Conjuring 2. And I wanted to put my money where my mouth is. Who's again, I like the, the couple in it, right? Yeah, but it's a MIDI villain. Was like, \"All right, that's cool.\" And it was just like everyone hyped it up so much.",
            "start": 757.3
        },
        {
            "text": "I wanted to put my money where my mouth is. Who's again, I like the, the couple in it, right? Yeah, but it's a MIDI villain. Was like, \"All right, that's cool.\" And it was just like everyone hyped it up so much. It was the **** all the best horror movie in years. Yeah, I was like, \"Was it really?\" That's not a good sign for horror movies. Then I saw a Conjuring tour. And I'm like, \"Man, why do I keep watching this Conjuring?\" He was one that I had to reach there to remember what the **** it was about, right? But I just remembered that again, that I liked the couple. Those Annabelle was in between. Yeah, I didn't see that. And I didn't need the backstory in the doll. Yeah. And I wasn't even sure if they weren't in it, right? The couple, Patrick Wilson, directed by James Wan. I think so. Yeah, I think you get the whole community. Yeah, yes. Then I saw Central Intelligence theater again. This is, this is going is my thing. I like these people. I like the Conjuring people. I'll go see their movie. I like The Rock and Kevin Hart. Sure it is.",
            "start": 800.56
        },
        {
            "text": "Yes. Then I saw Central Intelligence theater again. This is, this is going is my thing. I like these people. I like the Conjuring people. I'll go see their movie. I like The Rock and Kevin Hart. Sure it is. Fun stupid movie. Whatever. Saw Ghostbusters, the original in theaters when they were doing that and getting ready. I saw that with you anyway. I think so. You went with me. I think it was you and Oransky, right? That's right. It's like when Rance, he's like, \"Yeah, I'm dying and my organs are failing. I'll have a beer.\" And we're like, \"Is that okay?\" You're like, \"No.\" He's like, \"Now you got to live sometimes.\" Like, \"I don't know what you're talking about. If you have a child, you got to live for them.\" We all went, saw Independence Day: Resurgence. That's a bad movie. Okay. That was one of the worst things I've ever seen in my life. It's not that bad. It's one of the worst movies ever. I'm Savannah. It's one of the worst thing. It was after the opus that was did. That was Independence Day. Want. Sure. I expected way more. Do you",
            "start": 840.88
        },
        {
            "text": "my life. It's not that bad. It's one of the worst movies ever. I'm Savannah. It's one of the worst thing. It was after the opus that was did. That was Independence Day. Want. Sure. I expected way more. Do you see Will Smith's statement? You know, I read it today on Kinda Funny Greg Live about why he didn't do it. Why he did Suicide Squad instead of Independence Day. Because they were both gonna be terrible, but that one was gonna be less terrible. So he did that one. He's like, he wanted a claw. He don't want a claw backwards. He wanted to look forward and try to build something and maybe have a hate egg. And I was like, \"Damn, deep ass Will Smith. Closer. We could have really used you, Will.\" Then I went, then I should get up and saw Batman v Superman: Ultimate Edition in theaters. You like it so much. I'm innocent. Then saw me and Kevin. I mean, Kevin and I went, saw Swiss Army Man in theater. So ****. I gotta watch that still. I enjoyed it. It's a weird-ass movie. Yeah, I saw Ghostbusters (2016) in theaters. No thank",
            "start": 879.01
        },
        {
            "text": "saw me and Kevin. I mean, Kevin and I went, saw Swiss Army Man in theater. So ****. I gotta watch that still. I enjoyed it. It's a weird-ass movie. Yeah, I saw Ghostbusters (2016) in theaters. No thank you. So I Everybody Wants Some!! on Amazon and Nick's recommendation. Hank, that's fine. Yeah, it's just some stuff that happens to people. That's like, that was the thing. Even date, we talked about it. Even Dazed and Confused. I felt like they were throwing the party. Then what are they gonna do? And then are the freshmen? How is he gonna fit in? Like there was like narrative threads there. Whereas this one was like, they all play baseball and you're in a house and this is your first three days. Yeah, we're gonna **** or do this. We're gone. Right. It's a lot of tits in it. It's great. That is trim it. So you can tell the person that was casting was like, \"I am the authority on tits.\" I saw The Witch on Amazon. The Witch, the way to the form of me. Yeah, yeah. I was so, I was another one when everybody hyped up. Everyone was",
            "start": 915.55
        },
        {
            "text": "the person that was casting was like, \"I am the authority on tits.\" I saw The Witch on Amazon. The Witch, the way to the form of me. Yeah, yeah. I was so, I was another one when everybody hyped up. Everyone was The Witch. The one that was really creepy trailers of they're like on a farm. Yeah, it's like, yeah, period piece or whatever. They're like in the barn and someone. No, you know, it was like a big deal. It's like a colonial era. Yeah, it's something with somewhere around there. But I don't remember the exact. Yeah, that's why I, and I'm not sure if they spell it out or whatever. A movies that I saw the trailer and I'm like, \"I don't want to see this movie because that trailer is **** awesome.\" That trailer was scary as hell. There's no way the movie looks. Well, that was, it was another one that had such polarizing opinions where people were coming out of it me like, \"This is the best horror movie ever seen.\" Or, \"This didn't deliver at all.\" And I was doing this. I had to give it a shot and watch it. I enjoyed it fine.",
            "start": 955.58
        },
        {
            "text": "opinions where people were coming out of it me like, \"This is the best horror movie ever seen.\" Or, \"This didn't deliver at all.\" And I was doing this. I had to give it a shot and watch it. I enjoyed it fine. But it was, it was like, \"I know we're going with this. What are we gonna do?\" Like that actress was really good. Yeah, no, no, she was young too, right? Yeah, she was good. I saw Antichrist on Amazon. There's a Willem Dafoe one. Awful. So bad. Yeah, this is a Gen idea. This is a Gen idea. She's heard things about this. There's crazy sexy. I like, \"All right.\" And we watched it. Like it's movies we've know. We stopped it. This is, I don't know if I got to the bleeding. Remember if you got the part where you believe that. I mean, it's one of those. I don't remember much about in there. Dumb dead kid. I saw Batman: The Killing Joke in theaters with you guys. Rewatched Ferris Bueller's Day Off on Amazon. Cause that was one of those. I was like, two days ago, I was like, \"I haven't watched this as an adult.\" There's some. And I did the same thing.",
            "start": 998.06
        },
        {
            "text": "with you guys rewatched Ferris Bueller's Day Off on Amazon cuz that was one of those I was like two days ago I was like I haven't washed this as an adult there's some and I did the same thing it's coming up here eventually I was question for you Caddyshack where I was like I haven't seen Caddyshack as an adult grew up watching it didn't know anybody that we're supposed to have someone I've seen that movie probably I gotta say conservatively 0 times in my life and we were watching it over the weekend I was down in Santa Cruz over the weekend and someone asked me a question that broke my **** mind and apparently it's a very it's a very popular question Ferris Bueller's but I never thought of it for whose house were they at when they went when they were in the pool do they race bangs Ferris's is its Sloan's I always thought it was Sloan's because she's the one you state I think so but it's never it's never really specified that it is we just don't know they're just for age oh no it's",
            "start": 1040.72
        },
        {
            "text": "is its Sloan's I always thought it was Sloan's because she's the one you state I think so but it's never it's never really specified that it is we just don't know they're just for age oh no it's not Sloan's because Sloan had to be in her own way was a joke so cute on a bikini honest it's her house but she was in her slip the entire time so it's not Sloan's house and it's not it's not Cameron's house because Cameron's house doesn't have a pool Cameron's dad there's something wrong with him right days like an abusive **** no but in real life oh I don't know Warren wasn't the one big question about Ferris Bueller's Day Off no one knows what happened I'm nerds I can't remember either yeah I I always interpreted it as I never thought about it but even watching I thought maybe they were using someone's pool or it was Sloan's pool I said they why soon they were but they're at no point did they specify whose pool that was so it's it leads you to believe that either a they do someone had a pool",
            "start": 1084.17
        },
        {
            "text": "pool or it was Sloan's pool I said they why soon they were but they're at no point did they specify whose pool that was so it's it leads you to believe that either a they do someone had a pool and randomly just waiting but they're either way they went into the backyard without permission because they're not supposed to it's not like you can call their parents up to like hickeys your pool we're paying hooky from school today and no one knows we have this elaborate plan that involves this pool but we said I oh I just assumed they were Ferris's house and then someone's like no they're not Ferris's house cuz why would he need to race back like to his own house I'm like oh that's a good **** point man they were just there why did he just stay there I always find it more interesting that like when the parents are coming home and if Ferris has to race you know back to the house it's like what five o'clock right and I think that's a big part it's early though right and he runs through like",
            "start": 1136.67
        },
        {
            "text": "when the parents are coming home and if Ferris has to race you know back to the house it's like what five o'clock right and I think that's a big part it's early though right and he runs through like the most populated backyards for a weekday at like 4:30 I go to high school goes to there cooking on the grill like who's eatin at 4:45 right now whole families that's so you said you watch Caddyshack as well yeah okay second score Caddyshack is **** and it clear rewatch perfect phenomenal perfect yeah it's still a perfect Rodney Dangerfield his one like cuz when you read about that movie one of the only moves I know anything about when you read about that movie it was really supposed be about Danny and they just basically rewrote it but then they're like dude we have every we have a comedic like mind of our generation and Rodney Dangerfield like from the **** gecko is just no the but know if it's my friend Wang no offense but but he like in the club or whatever when he's like he's just",
            "start": 1169.43
        },
        {
            "text": "like mind of our generation and Rodney Dangerfield like from the **** gecko is just no the but know if it's my friend Wang no offense but but he like in the club or whatever when he's like he's just handing money out to everyone just saying snide ass **** the people or get a haircut yeah yeah yeah just the little quips in one-liners like he's just so brilliant what a great comedian and what a great cloud rate man I still hold the Chevy Chase is the best part of that movie really yeah I really should be Jason well Bill Murray wouldn't even do any of those scenes together I didn't I didn't know that like that that one scene where they're in the warehouse where was the only time they ever interact with each other here the other night and I realized that when I watch it I totally never on screen together I put my hard to learn because everyone apparently Bill Murray was fine with everyone just did not like working with Chevy Chase yeah he's a douche and that's why I said I think we",
            "start": 1213.34
        },
        {
            "text": "on screen together I put my hard to learn because everyone apparently Bill Murray was fine with everyone just did not like working with Chevy Chase yeah he's a douche and that's why I said I think we talked about this that the the Roast of Chevy Chase on Comedy Central some of the most brutal **** I've ever seen in my life because it's like everyone means exactly what they're saying no Dan they're destroying him you should have watch it yeah that's crazy yeah yeah it's weird that yeah he made such a big stink when he left SNL because he thought he was like the guy and that this wouldn't last without him and then he made a bunch of movies that were good but then just totally tapered off and the resurrection of Jake the Snake on Netflix I watched Jake the Snake that's a really good one right DDP Yoga saving his life good for them we went saw Suicide Squad in the theaters we won't talk about it Popstar on Amazon which I liked it was a dumb comedy",
            "start": 1250.42
        },
        {
            "text": "that's a really good one right DDP Yoga saving his life good for them we went saw Suicide Squad in the theaters we won't talk about it Popstar on Amazon which I liked it was a dumb comedy okay it was a dumb comedy I enjoyed myself it was good it was better than it could have been wish I wish it wasn't done in that mockumentary style though I wish it was just a movie a straightforward movie mmm interesting with with moments where they were talking as opposed like a first of her guests yeah it was very much Spinal Tap or it was like kind of reality TVs though I just to see more that story no one watches JFK Jr. on Amazon and documentary about him cuz that was one of those things I remember him dying right you know I mom Jamie Kennedy right she has some far-flung connection to the Kennedy family she cared about all that in Camelot and you know the book and like of course JFK's assassination is like that generations 9/11 where I remember growing up and she can remember every moment",
            "start": 1290.95
        },
        {
            "text": "family she cared about all that in Camelot and you know the book and like of course JFK's assassination is like that generations 9/11 where I remember growing up and she can remember every moment of how that you know how she found out about it and then when 9/11 was happening I was like holy **** this is what that is you know I mean they have that kind of thing but what was mind-boggling for me watching it was the idea like I remember his plane crashing and me being in high school because I remember coming back from Michael Bryan's after playing Smash Brothers all weekend and it was like okay the news was like the planes missing what happened to him and it's now being so far-flung and for me to think about John F. Kennedy the president right it feels like such ancient history but to think about there was a contemporary piece of him still alive living in New York you know what I mean that was this like ladies man is settling down in like magazine yeah exactly George this you know",
            "start": 1329.95
        },
        {
            "text": "think about there was a contemporary piece of him still alive living in New York you know what I mean that was this like ladies man is settling down in like magazine yeah exactly George this you know royalty that even they talk about the documentary right that even though he would say he wasn't he was constantly being groomed people expect him to eventually run for public office and probably run for the presidency one day and try to bring back all that and so to see that and then of course the tragedy and Jesus Christ you know mean that family that was somewhere 1999 I think right something like that yeah I remember that too yeah and now they got that you know 2017 movies I want to see that Jackie movie with Natalie Portman looks awesome - yeah I saw Finding Dory on a plane huh I was enjoying I haven't seen it really it's enjoyable it's fun Finding Nemo was one that I was like it's obviously good yeah she's never really like never connected with you got into me this one make like hers",
            "start": 1368.32
        },
        {
            "text": "I haven't seen it really it's enjoyable it's fun Finding Nemo was one that I was like it's obviously good yeah she's never really like never connected with you got into me this one make like hers baby Dory too cute and her getting torn away from her folks heartbreaking you know what I mean you think but then I remember I'm gonna play and I'm sitting there I mean peanuts I'm doing great eat some beef jerky plains of Vida it's not real exactly I saw X-Men Apocalypse on the same plane not nearly as bad as everybody made it out to be great though not great no I didn't say it was great but I mean it was like okay cool but I mean like the wait this is very similar I think to how people talked about or talked about Batman v Superman leaving the theatre or not even leave like initially of like it's worse than Batman and Robin let's not be we're talking about X-Men Apocalypse and I watch them like that's fine another dumb X-Men movie but there's a lot of though is this is no X3 next three is",
            "start": 1409.3
        },
        {
            "text": "worse than Batman and Robin let's not be we're talking about X-Men Apocalypse and I watch them like that's fine another dumb X-Men movie but there's a lot of though is this is no X3 next three is **** awful this isn't that I still haven't seen it X3 never existed you worry about it yeah you don't have to rush out but again on a plane where I got to watch something sure for the first time since its release on iTunes watched Final Destination at Halloween 7 Sawa what's up yeah yeah god I forgot all about that I probably retweet him more than I retweet any other human being on the place you see so much his tweets are **** gold yeah and that was the one to wear Stifler isn't playing Stifler but it makes all these like Rangers jokes and Islanders look cool Bartender at Large Air Castor's Flick one saw that in theatres on it, man yeah very very good if you have a chance see it watches Utopia on a plane as well yeah that was fine overblown nonsense how much people love that thing I",
            "start": 1449.41
        },
        {
            "text": "flick one saw that in theatres on it, man yeah very very good if you have a chance see it watches Utopia on a plane as well yeah that was fine overblown nonsense how much people love that thing I think that might be one of those movies it's about inviting some it's good it's here's the time tube for me for sure I didn't like Jason Bateman's character all that much and I'm a Jason Bateman fan have been since The Hogan Family am I going anywhere I wanted it to like him more and it took him too long to come around in any way home and family what up fools then this is an interesting one to be added to the list this is the same flight as Zootopia One Wild Moment a French flick that I watched with the subtitles I tweeted about this at one point that it was a similar situation a Collins intern thing where I was watching it off the seat in front of me cuz my I forget what I started to watch it wasn't one of these but I was so bored with whatever I started I stopped but I was I just looked",
            "start": 1501.76
        },
        {
            "text": "thing where I was watching it off the seat in front of me cuz my I forget what I started to watch it wasn't one of these but I was so bored with whatever I started I stopped but I was I just looked over and saw this movie it's subtitled so I'm already reading it and it's just you know two older gentlemen go with their daughters to this the you know seaside village or whatever for vacation one of the guys sleeps with the other guy's daughter and then it's like this whole trying to hide it and stuff I was like yeah I mean I gotta see this so I started it on my screen so I could watch it and get the whole thing I wanted to see what huh nothing then it was Doctor Strange in theaters which we love us Arrival in theaters which we loved I loved I loved it Love Actually in theaters again which obviously is a repeat and then rounding it out I watched I guess this weekend that Don't Breathe one oh yeah but out of order day today so it's a friend from Lu yeah we met him at Comic-Con during Evil",
            "start": 1539.77
        },
        {
            "text": "is a repeat and then rounding it out I watched I guess this weekend that Don't Breathe one oh yeah but out of order day today so it's a friend from Lu yeah we met him at Comic-Con during Evil Dead I bought him Nashville he watched Nashville he likes Nashville of them we still talk every so often on Twitter it was **** up yeah what did you see it yeah Don't Breathe **** that's another one of my movies a year to be honest it nailed it for what it was trying to do and it was the opposite of the contrary where I'm like no this was not an overblown yeah movie this was a **** great like I I've never felt so tense in a movie ever the one thing and this is gonna sound stupid cuz even the trailer kind of hints at it then I think it would have made me go see it faster cuz I'm gonna support this guy I like him internet friends and such but the problem was that you know I can't stay in horror movies where bad things happen to good people and so the way the trailers initially made it look",
            "start": 1578.47
        },
        {
            "text": "this guy I like him internet friends and such but the problem was that you know I can't stay in horror movies where bad things happen to good people and so the way the trailers initially made it look granted they were gonna break in and robbed this guy they didn't make her the main character in it the woman looked like a dirt bag and the trailers always gave me the impression that she was kind of long for the ride maybe she was gonna be like though let's not do this guys how we're doing it and you watch them like oh man oh you guys **** suck I could really hope this guy goes **** ham on you and he starts going ham on and then you find out about hammer like I don't know who now you're all bad people on I know whatever **** cool it was **** up and then it kept getting more **** up but in a way that I mean granted there was there's some things that happen that movie that is like really but in a cool way nah no like that's **** **** like oh this is like such a like because",
            "start": 1623.74
        },
        {
            "text": "but in a way that I mean granted there was there's some things that happen that movie that is like really but in a cool way nah no like that's **** **** like oh this is like such a like because horror movies and I mean it's a horror movie but it's also kind of not it's also way more of a thriller they have problems with endings and yeah and I think that it did a great job of creating a plot that kept things going there was twists that felt like rewarding and earned and the end was awesome and that there's talk talks of sequels and and but the thing is there tamo doing a sequel in these like but the direction we got is totally different than this one but it's more about the idea and concept and we're not doing it until it's perfectly the story you want to tell me I'm **** it man yeah like you guys you proved it to me like this was really damn good Don't Breathe Cinematic Universe yeah it's gonna be like the Monster Universe we'll have three ones of different **** up guys and",
            "start": 1660.79
        },
        {
            "text": "like you guys you proved it to me like this was really damn good Don't Breathe Cinematic Universe yeah it's gonna be like the Monster Universe we'll have three ones of different **** up guys and then they'll be like they if they have to team up to go after a really **** up when one's blind ones deaf ones can't speak and he clearly has the advantage over the other do you know the the concept is essentially they go in to rob a blind guys house but it's the wrong **** blind oh damn well it's funny cuz that other movie you saw was about a blind woman getting stalked right yeah oh no no not blind deaf deaf deafened I think you too because I think she have to sign everything yeah it's it's another one that's like **** up cuz I don't like I don't like torture porn right and that's the whole thing and maybe even Hush was like that thing where I got so many so many people I knew were saying they liked it and I liked the Jim guy from Newsroom then I was like okay cool I'm gonna watch",
            "start": 1701.44
        },
        {
            "text": "whole thing and maybe even Hush was like that thing where I got so many so many people I knew were saying they liked it and I liked the Jim guy from Newsroom then I was like okay cool I'm gonna watch it but it was that thing of like she's a good person this really **** sucks this is that this horrible things keep happening to her and but what but it was alright it was good yeah Anthony and they got thing I'm sorry I was just the one movie I saw this shirt I can't remember what the **** the name of it was was interesting it was a it was about these two guys that go on a trip around the world one of them is like really sick and The Bucket List Jack Nicholson Morgan Freeman Freeman and he has like these this problem with his head or his brain or whatever and he big like one of the first nights are overseas he gets attacked by some woman wakes up and is like all sick but he ends up like getting like these superpowers or like he's like someone out there I know I know you guys know it's a",
            "start": 1744.78
        },
        {
            "text": "are overseas he gets attacked by some woman wakes up and is like all sick but he ends up like getting like these superpowers or like he's like someone out there I know I know you guys know it's a really bizarre movie it wasn't bad who's in it I don't know it would seem like it was very indie I'd never seen the guys in my life I'm sure people will write me in the comments what it is it was it was a strange kind of film about this guy that like is like super sick and like dying but gets like it's like these imbued with like these weird powers like he's able to like run really quick or like do all these kinds of things and everyone's like super shocked it's cool because it's very grounded like what the **** wrong with you like why are you acting like this he's like super strong you can't eat or hold 89 he keeps throwing everything out that he eats until that's a weird weird movie I forget what the **** it's called Jesus I heard of that okay you missed a few what did I miss as if well",
            "start": 1785.28
        },
        {
            "text": "or hold 89 he keeps throwing everything out that he eats until that's a weird weird movie I forget what the **** it's called Jesus I heard of that okay you missed a few what did I miss as if well there's a few that are still coming out to that we got to see before the hall oh yeah that's a good point that we're recording this before this podcast well before this post I will seem Rogue One is one right we're gonna see Rogue One which stuff is this week and then obviously the number one on my list is La La Land I have to see that yeah not come on yeah it's so goes into my topic which is gonna happen a couple of seconds but that's one of those where I really think that's gonna be a unique film I really might very much looking forward to it there's also Hacksaw Ridge and Moonlight that Hacksaw Ridge I got a phenomenal I didn't watch Hacksaw Ridge because I for some reason I have a weird aversion to Andrew Garfield doing an American accent or a southern accent partially cuz I think it sounds",
            "start": 1819.09
        },
        {
            "text": "Ridge I got a phenomenal I didn't watch Hacksaw Ridge because I for some reason I have a weird aversion to Andrew Garfield doing an American accent or a southern accent partially cuz I think it sounds terrible but everyone loved that movie if I was amazing I'm in Passengers I think it's also coming out still might be a 2017 movie now that I'm think about it but I think it's also a plane movie I'm gonna see that on a plane you also like War Dogs know that now is that that War Dogs is the one where I am charted movie Miles Teller and Jonah Hill yeah yeah yeah it's totally like I thought the trailers looked great and it came out and got bad reviews and then like in as you saw from my list I really get to the theaters and lessons for us doing stuff so then I saw I've seen it on my Amazon I added it to my list but that was even after you told me is like now it's fun it's fun it's totally fun it's completely ridiculous it's like it's like a more whimsical version of a Lord of War with that",
            "start": 1855.84
        },
        {
            "text": "it to my list but that was even after you told me is like now it's fun it's fun it's totally fun it's completely ridiculous it's like it's like a more whimsical version of a Lord of War with that Nicolas Cage movie where you place an arms dealer it's totally **** up I like that I thought I read something reviews - oh my god it's kind of unfounded this is a pretty good movie that that movie you just saw Passengers that's the one about them waking up from cry of sleep yeah that's that was cool about that one I gotta go see that when does that come when's it come on can't remember yeah he's gonna rival yet right nice one I saw the opening night at the Marina that's right you hater liked it or no I loved it okay I thought it was a little guy I can remember my complaint about certain things in works I really liked there was one specific thing I didn't like about it seemed like it would seem that goes a little obtuse like mmm there I don't want to spoil it there's something the aliens",
            "start": 1895.44
        },
        {
            "text": "in works I really liked there was one specific thing I didn't like about it seemed like it would seem that goes a little obtuse like mmm there I don't want to spoil it there's something the aliens talk about their intent very briefly about why they're doing this but they never wrap it up like like we need you and like yeah yeah like I'm like yeah that's I'm like why why why are you going it's the same problem I had my one hang-up with the Interstellar where I'm like why is this so complicated yeah yeah like if the if the answer it like why are you making it so hard to figure out just say what you need to say if you're this smart then you can be able to communicate yeah doesn't make any sense yeah it's it's it's a very interested uhz and kind of doesn't write Interstellar means less sense than Arrival Arrival part of it was the fact that there was a lot baked into them having to figure out what they were saying to figure out like their language and things like that right because they",
            "start": 1933.0
        },
        {
            "text": "than Arrival Arrival part of it was the fact that there was a lot baked into them having to figure out what they were saying to figure out like their language and things like that right because they kind of built or the main plot but with Interstellar they're like we put the wormhole out by Saturn we're gonna bring you to 1 planets don't know which of these is good it's like why don't you just put the wormhole like **** tell us where to go and have the wormhole just spit us out right in front of the **** plan to tell us which one it's just obvious because the planets really big and the other one they're really small so we're like let's try this way you can only go you only have time to go to you only have to time to go to two of the twelve so you got to figure out what it's like wise why just tell me where to go yeah put a **** sign post a boy me to the planet or another way you know in other work you away from that Matt Damon plan for God's sake it got tears I need people to",
            "start": 1969.87
        },
        {
            "text": "tell you movies you need to watch there's one coming out in a couple weeks it's the new Michael Fassbender movie Assassin's Creed yes I think you're gonna love it it's finally Anna it's gonna get do away with your biggest complaint about Assassin's Creed the gameplay I think we can all agree the best movie I saw was Batman suit now and the two stress that's animated garbage for real **** off the list my favorite one that I just went through his Room rooms that Noah stuck with I was a grateful that I liked the most angry I was really grateful",
            "start": 2012.54
        }
    ]
}