{
    "id": 2313,
    "video_id": "Y4PrCVBvaLs",
    "show_name": "Gameplay",
    "hosts": [
        "Tim Gettys",
        "Daniel Bloodworth"
    ],
    "title": "Let's Play Snipperclips on Nintendo Switch - Kinda Funny Plays",
    "description": "Sorry for the weird off-screen angle, Nintendo made us shoot this way.\n\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1484768079,
    "duration": 642,
    "transcript_chunks": [
        {
            "text": "What's up, guys? I'm Tim Gettys and this is Daniel Bloodworth from Easy Allies. Shout out to Easy Allies, support them Patreon.com YouTube.com/EasyAllies. Congrats on all the success, by the way. Let's get right into it. This is Snipperclips on the Nintendo Switch. We both never played, so we'll see how this goes. Everyone who's been playing this, though, at the event, this seems to be the sleeper hit of the event. That's what I'm, that's word on the street. Okay, so we're playing in the the table mode is what they're calling it, correct? Tabletop mode. All right, so I'm the yellow guy, Daniel's the little red one doing the tutorial here. I like the little foot stomps. Yeah, little kinky boots. Oh, I see. So we use ourselves to fill in the shape. There we go. We're professionals, MLG Snipperclips. How you get to cut the other character? Oh god, oh that's oh wow, that's interesting. So it's like whatever shape is left there gets snipped away and then oh cool, that's really cool. Yeah, okay, interesting. That's a cool mechanic. I the",
            "start": 0.28
        },
        {
            "text": "character. Oh god, oh that's oh wow, that's interesting. So it's like whatever shape is left there gets snipped away and then oh cool, that's really cool. Yeah, okay, interesting. That's a cool mechanic. I the I like puzzle games a lot, but I haven't seen one that used that. That's a great animation. I love the animation. Seems like a really good co-op game. Oh, okay. How do we, yeah, huh? Uh, this seems complicated. Oh, okay, okay, okay, cut. Oh, we have to do it at the same time, dude. Now I think we need to switch to cut the other. Yeah, so now now you reform the other way. Oh, I don't know if we're going to get the full thing. We all messed up. Yeah, I think we messed up. Oh, reform. Okay, and now now hold on. I'm going to rotate back. Oh wait, that's perfect. So we just snip at the same time. I think we're good. There we go. Okay, lovely. Oh, there we go. Work makes the dream work. Yeah, this is like Resident Evil 5 Co-Op right here. All right, great job on the tutorial. Yeah, I feel good about this. Now the now the work begins. This feels like",
            "start": 61.56
        },
        {
            "text": "oh, there we go. Work makes the dream work. Yeah, this is like Resident Evil 5 Co-Op right here. All right, great job on the tutorial. Yeah, I feel good about this. Now the now the work begins. This feels like it's going to be a good Let's Play game. All right, all right. So if you come over there, so if you fill it, is that enough? Can you just fill and cut? Oh no, now we switch. Do the opposite. I there we go. Go over, go over there first. Go. Oh, you're right. I think you need to flip the other way. Okay, and then cut. I also do oh wait, I need all me. Oh no, kill them all. All right, hold on. So now we'll go on top of each other, right? Okay, and then cut me. But if I cut you, then that's all of it, right? Oh wait, what cut? Yeah, that's why I'm trying to figure. Oh whoa, look at that. So what happened to you? So okay, so let me flip this way and then you go down, you crouch down. Uh-huh. Okay, let's try that. And then we did the we did the opposite. All right, I'm reform. I'm going reform. Okay, okay. Oh, got it. Okay, okay, okay, perfect. And I",
            "start": 146.72
        },
        {
            "text": "this way and then you go down, you crouch down. Uh-huh. Okay, let's try that. And then we did the we did the opposite. All right, I'm reform. I'm going reform. Okay, okay. Oh, got it. Okay, okay, okay, perfect. And I laugh about it. That's great. All right, hold on. So now you go the other way. There we go. Wait, I got to no, you had it. No, don't like flip. Keep rotating and yep, perfect. There we go. There we go. Yeah, look at that thing. Oh, oh, so we make pictures. Yeah, I like it. Okay, nice. This is one of those games that makes you feel really stupid and then really smart, right? All right, we got to push the pencil. Oh, okay. You got to make me skinny. So oh, I'mma I'll cut you. Okay, so now you can get in there. There we go. Now we got to get a basketball in there. Huh? You're going to have to scoop it close. See if you can try to. I think we're on the wrong end of it. Cut me a bit. Oh, oh, okay, okay. You guys the press the oh the pencil switch. All right, we got to figure out a way to get it on top of my head. You rotate right there and",
            "start": 240.92
        },
        {
            "text": "think we're on the wrong end of it. Cut me a bit. Oh, oh, okay, okay. You guys the press the oh the pencil switch. All right, we got to figure out a way to get it on top of my head. You rotate right there and then down and then up. Maybe it'll I think it'll go back if you uh go backwards a little bit. I feel so close. All right, now out your head. There you go. Damn that over ready. If you can scoop it on top of my head somehow. No, cut a chunk out of your head. Okay, right. Yeah, can you cut got the yeah, if you reform and then turn upside down and then go down. No, no, no, the other way. Okay, yeah, now like make a bowl in my head. I'm not really oh okay, okay, okay, okay. So now boom, there we go. Okay, oh no, too big of a scoop. Is it actually? I think that'll be okay. No, oh, there we go. That there we go. And then let it go there. Yes, unconventional. Oh, that's nice. Pum jump, push jump. Where's the Plus and Minus? It's right, it's there. Oh, okay. It oh my God, so clever. This is really clever. So one of us is got to get",
            "start": 350.4
        },
        {
            "text": "let it go there. Yes, unconventional. Oh, that's nice. Pum jump, push jump. Where's the Plus and Minus? It's right, it's there. Oh, okay. It oh my God, so clever. This is really clever. So one of us is got to get skinny. Yeah, boom, volume and pencil over there. We got to sharpen the pencil. Oh gosh, one of us is going to have to catch it. I'm going to yeah, let let's do the same thing again where that's hold on. I'll reform. Do you want me to cut you? Um, sure. Uh, do you want how do you want to do? Do you want to do the button thing again? I'll do the uh I'll do the button. Okay, there we go. But then uh how do we want to catch the pencil? Do you want to that try the other side? Try the bottom. Go all oh wait, damn it. Yeah, yeah, yeah, hold on. So that's what we need. So yeah, give me that. There we go. Okay, okay. Oh, you got to balance it or or pass it or you could just cut a deeper trench. Oh, we're going to need a deeper trench. Okay, you can use use your the top of the J. Nice, nice, nice to get in there. Yeah, oh, this is nasty. It's the sweet",
            "start": 465.12
        },
        {
            "text": "or pass it or you could just cut a deeper trench. Oh, we're going to need a deeper trench. Okay, you can use use your the top of the J. Nice, nice, nice to get in there. Yeah, oh, this is nasty. It's the sweet. Keep it coming. Keep it coming. Oh yeah, oh my God, it wait, what we doing? Okay, we just got to flip it. There we go. There we go. Yeah, oh yeah, this game is awesome. Okay, okay. All right, you want a there we go. We'll have to come back later, Daniel. Thank you very much for joining me again. Support them Easy Allies over everywhere on the all the internet stuff. Find us on Kinda Funny. Until next time, this Nintendo Switch, this a Joy-Con, you can",
            "start": 551.16
        }
    ]
}