{
    "id": 452,
    "video_id": "3tn_iHfdtEA",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Is Your Morning Routine? - The GameOverGreggy Show Ep. 51 (Pt. 2)",
    "description": "Colin Moriarty wants to know what our morning routines look like.\n\nGet free unlimited knowledge for 10 days at http://www.lynda.com/kindafunny \n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1416902403,
    "duration": 1780,
    "transcript_chunks": [
        {
            "text": "Colin , yes. What's your topic? I want to talk about our morning routines. You do a lot of things in the morning. Yes. Uh, I'm curious what you guys do in the morning and and uh, you know, how you prepare for the day. And uh, I will say that on week weekends, I don't really have any any anything that I do. I just get up and I just do whatever the **** it is I want to do. On weekdays when we have to go to work, I usually Cheryl get up a lot earlier than I do. So I only sleep from like 12:00 to 5: or so. And then like the next hour or two are like really just like lucid dreams for me. And I always like wake up like every 15 minutes because I'm just like a nervous person. And then I eventually roll over and I get my computer and I check my email and do all these things. And then I usually like watch like hockey highlights or read the news, whatever. Then sometimes I work out and then I take a shower. I think most of the time you work out. Yeah. And now it's when I'm in the bathroom that very specific",
            "start": 1.1
        },
        {
            "text": "like hockey highlights or read the news, whatever. Then sometimes I work out and then I take a shower. I think most of the time you work out. Yeah. And now it's when I'm in the bathroom that very specific things happen here. Here we go in a very specific order and I'm so OCD about it that if I do it out of order, I have to do it all over again. Wow. So I use this is one thing that my friend taught me in college and I've been doing it ever since and I pass it on to other people. You're passing it right now on the wall. No, this is a this is a cleanliness thing. Okay. Uh, I always start with green mouthwash in the morning and and at night I do it too, but I only switch it for about 20 or 30 seconds and then I take a toothbrush and I brush my my teeth with it in my mou like the the the mouthwash in my mouth for about 20 or 30 seconds. This is wait, so you're like doing like you're swishing around and you don't spit, you put the toothbrush. Okay. And this is apparently to loosen up the plaque and do all these",
            "start": 44.8
        },
        {
            "text": "for about 20 or 30 seconds. This is wait, so you're like doing like you're swishing around and you don't spit, you put the toothbrush. Okay. And this is apparently to loosen up the plaque and do all these things to keep you healthy smart. Then I drobe and I get I get in the shower and I brush my teeth in the shower as we talked about before. I just for some reason and I don't know why I just imagine the first time the Khaleesi got naked in Game of Thrones just in my head. I don't remember that part. Tell me. Uh, I think is when she gets in the bath when her brother's there first episode. It's like the first episode, isn't it? Yeah, when she like like the girl like she gets out of it maybe and the guy like like her handmaiden sort of clothe her and her brothers there. Her brother she was getting in and out of such a great great great. I just think about the get in the B they out of the B it's a it's a she walks into the Bing hot it's very similar. Yeah, that's the end of the episode wasn't there another part",
            "start": 87.16
        },
        {
            "text": "such a great great great. I just think about the get in the B they out of the B it's a it's a she walks into the Bing hot it's very similar. Yeah, that's the end of the episode wasn't there another part doesn't matter think bra got naked. Wow. You're like I really like that Hodor's dick. Um, big old dick. He got a big hog down there, doesn't he? I believe it. Uh, did you see it? Do you remember that? No, I'm not kidding. Wait, we've seen Hodor's Dick . Oh yeah. Oh, I didn't I didn't watch last **** like a baby's arm. I I said when not what did it look like but oh, I don't remember that. I saw you just made that up. Yeah, but it could be right. I don't remember like me Greg totally called me out. He was like what part of the episode exactly did you see your neck and I was like I don't **** remember dude it's been like Five Seasons Four Seasons who knows how many like I grill you on that. I'm like maybe I just missed oror do you really see Hodor's dick? Yeah. Oh yeah and it's really **** huge it's like the real",
            "start": 126.32
        },
        {
            "text": "like Five Seasons Four Seasons who knows how many like I grill you on that. I'm like maybe I just missed oror do you really see Hodor's dick? Yeah. Oh yeah and it's really **** huge it's like the real actor's dick or like I don't know I don't know the detail I'm hoping that it's a prosthetic dick because if not I got a lot of catching up to do in the dick Department yeah well it's genetic you're not going to be able to do anything about it well they have those pumps they do penis enlarging pumps yeah SE you're brushing your teeth with the stuff in your mouth yeah so I all right so I get in the shower brush my teeth now then I do things in a very specific sequence I I have a loofah and use bar soap now Ivory or Irish Spring rather I don't like the ivory stuff IR yeah Irish Spring you put the bar on the lofa yeah so then I take the loofah and put on water and then I and then I rub it all over the loofah I I use a liquid soap the liquid soap I don't like it because you go do it too quick",
            "start": 172.6
        },
        {
            "text": "bar on the lofa yeah so then I take the loofah and put on water and then I and then I rub it all over the loofah I I use a liquid soap the liquid soap I don't like it because you go do it too quick you go through it very quickly you do but it's easier to it Suds faster it gets a nice lather faster than the actual bar soap I use the uh uh don't we're going to get to your routine here in a second I don't really have much routine go ahead sorry continue it's okay so then I wash the next neck and then you know the chest the back the arms the Torso the crotch the crot how long do you spend on the crotch region just a few you wash your face your hair not yet okay not yet just sorry go all the way down yeah now it's hard for me mostly because I'm just too lazy uh I like wash like the top of my feet now I get back to that in a little while M okay then I take the loofah and I and I and I I I rinse it out or whatever then I use shampoo yeah and I wash my hair then I use conditioner now I leave",
            "start": 215.68
        },
        {
            "text": "now I get back to that in a little while M okay then I take the loofah and I and I and I I I rinse it out or whatever then I use shampoo yeah and I wash my hair then I use conditioner now I leave I I do conditioner CU I get like dandr you if I don't use conditioner okay I don't know why but that's what happens it's just your chemical makeup with your scout and then I leave the conditioner in mhm and now I take the bar soap back so you're smart a lot of people don't leave the conditioner in you got to read the directions if it's good conditioner it has to be in there for like two to three minutes right right you got to keep it in there yeah so I leave it in and then I take the soap back and then I I lather up this is when I I'll I'll go down actually bend over and wash my feet and like my ankles and stuff like that and then I'll wash my uh ears and my earrings are you still bent over at this point yeah yeah and then I wash like back my ear my ear my earrings and then uh I wash my face",
            "start": 257.2
        },
        {
            "text": "ankles and stuff like that and then I'll wash my uh ears and my earrings are you still bent over at this point yeah yeah and then I wash like back my ear my ear my earrings and then uh I wash my face and then I rinse it all off at what point do you fart on the wall it it it could happen at any time okay and sometimes doesn't happen at all when you interesting uh and then I got out of the shower now I was so OCD back in the day I'm not quite as bad anymore but I was so OCD that if I realized that I missed like a part of it that I'd like start washing my ear before I wash my like you know or I wash my face before I start wash my ear or something like that I would do the whole thing again and I don't know why this was like a this is like a ritual and then I got the shower and I dry off then I use my deodor and I put my fa I put my Luber on my hands my arms and my face and then I'm out yeah I use a lubber sometimes when I go into your bathroom is very oh do you it's good I just like the",
            "start": 291.36
        },
        {
            "text": "I use my deodor and I put my fa I put my Luber on my hands my arms and my face and then I'm out yeah I use a lubber sometimes when I go into your bathroom is very oh do you it's good I just like the word luider I like the word lather I was going to say said a couple times really great word uh so that's basically my morning routine and then I get dressed and then I uh I go to work now when I leave the house this is a whole another or deal of OC oh yeah I walk around make sure everything's unplugged and then I stand by the oven and the stove and I make sure all of the handles are off every day yeah every day then I stand by then I stand by the door and I just listen to make sure all the water is off everywhere for the record Tim said it's a good thing you have him sure except for on Saturday morning when I turn on the to as oven and I walk off and I come back and put something like God damn it col I plug the toaster oven in and then and then I lock the door and then I just shake it for a",
            "start": 329.88
        },
        {
            "text": "morning when I turn on the toas oven and I walk off and I come back and put something like God damn it col I plug the toaster oven in and then and then I lock the door and then I just shake it for a few seconds no don't be that person I know people like that that's that's where you're going to draw the line listening for the water running fine whatever and then every once in a while I leave the house and then I come back and make sure the door's locked and then I leave again I'll do that sometimes I do that sometimes no I haven't done that in a long time live for that was I had bout of OCD like this when I lived in home now I don't know like seventh eth grade or whatever where it'd be one of those things I'd wake up I couldn't sleep because I'd be worried if the garage door was down then I go downstairs unlock the door look at the garage door come upstairs all right I go did I lock the door to the garage I come back down I'd lock I'd make sure the door is locked and I go upstairs like",
            "start": 373.12
        },
        {
            "text": "go downstairs unlock the door look at the garage door come upstairs all right I go did I lock the door to the garage I come back down I'd lock I'd make sure the door is locked and I go upstairs like well why didn't I check the garage door then I go back in the process would repeat repeat repeat repeat man so what are your guys processes in the morning so for me I if it's a a weekday so like I'm going to work I'll I'll wake up and I'll set my alarm for way earlier like an hour earlier than I need to get up because I like doing that thing where I wake myself up feels good yeah it just makes me feel better like oh I still got an hour to sleep this is going to be awesome I hear it's really bad for you but I do a lot of things bad for me mhm and so I'll do that and then an hour later it'll go off and then I do the game every morning of okay how long can I actually sleep for like when do I have to get up and now Kevin picks me up in the morning most mornings good job C so I need to be there",
            "start": 410.44
        },
        {
            "text": "and then I do the game every morning of okay how long can I actually sleep for like when do I have to get up and now Kevin picks me up in the morning most mornings good job C so I need to be there when he's when he's there so I'm just like **** so I'll do the math there and every day I push it just a little more cuz you know he's going to wait for you he's not going to leave you Kevin's not going to leave you he would leave me he would definitely definitely leave me you got him his job show some respect so Jesus Kevin I do that **** and then I just push that limit and then it reaches the point I'm like okay I have to get up if I'm going to shower this morning now lately there's been a lot of mornings that I'm like guess what I'm not showering today like **** that oops Yeah Greg and I sit next to you at work yeah it's pretty it's bad you don't smell ever but sometimes you look like the dirty kid in class I'm pretty dirty looking and it's bad so but recently I've been doing that a",
            "start": 452.84
        },
        {
            "text": "sit next to you at work yeah it's pretty it's bad you don't smell ever but sometimes you look like the dirty kid in class I'm pretty dirty looking and it's bad so but recently I've been doing that a lot but when I don't do that I'll get up get in the shower my routine I have a a routine in the shower similar to yours where I do the things in the order I don't have to go back if I **** it up though I'm okay with it I'm just more like how do I **** that up I do this every day right right right it happens it happens I also brush my teeth in the shower people judge me for that and no it's perfect it's awesome do you store your toothbrush in the shower outside the shower but I bring it with me cuz at night you need to so when you're done like in your routine you're in there in the shower brushing your teeth then you reach back out and put it down I put it on top of the the door and then when I get out I open the door I drop myself off and I take the toothbrush to dry it off and put it",
            "start": 495.44
        },
        {
            "text": "your teeth then you reach back out and put it down I put it on top of the the door and then when I get out I open the door I drop myself off and I take the toothbrush to dry it off and put it back in I see is there not like any like fuzzies or anything on top of the door to the shower in the shower I missed the tinkle the morning tinkle you miss the tinkle what does that mean after I get up you pee before you go in the shower you got to do that oh sure yeah I need to pee every morning that's like the first thing that has to happen you ever pee show I am not I it's weird cuz I'm the top of guy that would be a supporter of that stuff but I like I just don't do it I do it every once I don't do it all the time but every once in a while I'm just like the hot water hits you you're kind of like you know kind of relaxed all I'm going to go for it absolutely anyone that doesn't that says they don't be in the shower on occasion they're lying I'm not against it I just it's not something that I'm",
            "start": 535.88
        },
        {
            "text": "know kind of relaxed all I'm going to go for it absolutely anyone that doesn't that says they don't be in the shower on occasion they're lying I'm not against it I just it's not something that I'm like no I don't look for I don't get out in the morning be like this oh I'm going to run to the shower to take a piss have you ever shot in shower I can't even say that stra no I've never done it I've come close though there have been times when I've like had a bad stomach I'm like like a fart turned almost **** and you're like uhoh and you have to just jump out that's the worst my I have this conversation a lot with my brother where we're like it's the worst possible thing that can start your day is when you you're like I'm good you get in the shower you're done with your regiment and you're like I I got to take a **** I got to go to the bathroom right now you got to get out of the and no matter what you can't really dry yourself off all the way because then your towel is going to be",
            "start": 577.48
        },
        {
            "text": "like I I got to take a **** I got to go to the bathroom right now you got to get out of the and no matter what you can't really dry yourself off all the way because then your towel is going to be spping wet and cold by the time you get back in and redo everything CU you can't take the chance that everything's not clean right have you ever had that happen when you're like you do it you come back maybe everything's not as clean as I thought it was and like it's the worst it's the worst effort you got to keep going doing the thing and then you get out of the shower you get your towel it is already it's cold and stop stopping wet no matter what and you slip because there's water everywhere all over the damn place it's the worst thing on the planet so I'm in the shower doing the whole process but for me besides all just like the what I'm actually doing it's more about what I'm thinking about yeah think think about what I have to do during that day I'm thinking about what what shoots I",
            "start": 617.12
        },
        {
            "text": "but for me besides all just like the what I'm actually doing it's more about what I'm thinking about yeah think think about what I have to do during that day I'm thinking about what what shoots I have to do what dumb **** I got to help Greg with and uh for those of you uh listening no no that's you got to come watch a YouTube video for Greg is pantomiming the masturbation **** I thought that was Tim rolling the dice on what he's going to do that day oh is that what it is he was just going through he like is it going to be my my guys and do day I'm like luck be a lady tonight I don't even know what you're talking about but I want to know he's beating that thing beat P my God beat that weener dog's head but what I'm really thinking about is what am I going to wear today and in that process is what did I wear yesterday do I do I is there any day this week that I want to wear something specifically and this goes this happens every day every day you worry about the day to like okay am",
            "start": 654.24
        },
        {
            "text": "is what did I wear yesterday do I do I is there any day this week that I want to wear something specifically and this goes this happens every day every day you worry about the day to like okay am I do I need to be on camera for anything today does that matter do I wear things that I'm not okay wearing on camera and I'm like every single day I have these the same questions hard somehow it's always a black shirt the black dark jeans and Air Force Ones first offir Force Ones I would never wear Air Force Ones but you get to stom in your Air Force I'm not a fan of that Jordans yes Air Force Ones no um but yeah so I have a rotation of clothes that I'll wear and I tried there's a couple standards that I'm like always go the go toos and then there's some that like I'll put back in the closet and then like every couple months I'll bring back so come tell me the decision on this the game over grey shirt today a poite a surprise to me I was excited to see it you don't usually wear our stuff it",
            "start": 694.04
        },
        {
            "text": "then like every couple months I'll bring back so come tell me the decision on this the GameOverGreggy shirt today a poite a surprise to me I was excited to see it you don't usually wear our stuff it was a calculated move apparently well this is Nick's shirt oh that's what I give it back to me so I need to give it back to you give it back right now also let's trade I'm now in the the worst part of the shower thinking process where it's like **** I haven't done laundry for a while so this is where the shirt comes up so the shirt well also cuz I knew that if I wore a black v-neck today Nick was going to give me so much **** why do I I don't give you **** for wearing the black vck I know but like I knew that you would have today it's just every once in a while the stars align at at IGN and I walk in and everyone's wearing a a black v-neck yeah you it's James it's Alex thanks Ty for starting that before you left no no no no no no yep tyr has the black crew neck he tyr does wear crew",
            "start": 737.44
        },
        {
            "text": "and I walk in and everyone's wearing a a black v-neck yeah you it's James it's Alex thanks Ty for starting that before you left no no no no no no yep tyr has the black crew neck he tyr does wear crew neck you were wearing a crew neck okay v-neck is the one that goes down to like your belly button no who started that Alex solia I don't know who started that it just became a thing where it was like it's like a me Alfredo I say we'll take credit for that we're the first ones with cuz it's not just a black v-neck it's the express yeah black v-neck yeah so I'm going to take that Ty the crew though and me and Brian malwitz we both bought black crews in honor of tyroo they call it the Tyro when you go into the Gap to buy them so these are all things you have to think about I'm like is Brian malwitz going to wear this today do I want to be twinsies do I not whatever and then I'll get out of the shower and put on that outfit go back get on my stuff make sure I have my wallet my phone I'll do",
            "start": 776.68
        },
        {
            "text": "going to wear this today do I want to be twinsies do I not whatever and then I'll get out of the shower and put on that outfit go back get on my stuff make sure I have my wallet my phone I'll do the tap down yeah you know and then oh I forgot doing my hair that's a big thing got how long does this take your hair not as long as it should I wish that I put more time into it I don't you got great hair you got got just like enjoy tossing the **** in taking the comb just being like **** okay Kevin's **** already outside cuz he's early as **** you got to stop coming early dude talk let's get some keep him on his toes Kev but yeah want his toast so and then I'll come to work and I refuse to do work until I get coffee I don't even like coffee you don't what's funny is but your your idea of a coffee by the way is a caffeinated hot chocolate he walks in and goes let me get a mocha I don't even say they know oh they know they just **** know now here's the thing I would just get hot",
            "start": 819.12
        },
        {
            "text": "of a coffee by the way is a caffeinated hot chocolate he walks in and goes let me get a mocha I don't even say they know oh they know they just **** know now here's the thing I would just get hot chocolates but I feel that'be weird no yeah my favorite thing about the Nick and Tim relationship is that 60 to 65% of the day is spent outside procuring coffee or some other Acer mall where I will leave at random times and run into you on the streets I will be at Paragon with an up at noon guest and I will look out the window and I will see you **** walking back from Starbucks and it's just like Jesus it turns out that Tim and I both share one thing in common we do a lot of our good thinking on our feet yeah it's the thinking is either they in the shower on the feet and it's weird when we shower I can't shower with them anymore since not not since the're restraining order yeah um it's weird because you don't know who's who's jerking what when you're in a shower with another man again",
            "start": 865.04
        },
        {
            "text": "shower I can't shower with them anymore since not not since the're restraining order yeah um it's weird because you don't know who's who's jerking what when you're in a shower with another man again you're rolling the dice and who gets to go first and who watches who's back wow it's like when Colin it's just that image I have in my head Colin just slowly bending over to wash the top of his his ears like the a little a little secret by the way is I walk around this house naked all the time oh I walk around my house all the time all the time when all the time I'm like and this isn't me being offed about it I'm hear a lot I know when you guys aren't and I'm I'm **** nak well there's actually those funny times when you don't know and you like go work out and then I'll be like hey Sr says you're waking her up or whatever you're like oh sorry I didn't know she was here well that's not me walking around n I'm not accounting for that but I know I have my ear to the to to to the you know to",
            "start": 912.04
        },
        {
            "text": "waking her up or whatever you're like oh sorry I didn't know she was here well that's not me walking around n I'm not accounting for that but I know I have my ear to the to to to the you know to the ground about the so is this something you're stripping down just to do no no like like instead of you know you take sometimes people go to the bathroom they take their dirty clothes off and then they bring them back in or whatever it's a whole thing right like and you have to bring your towel back to the bathroom when you're done I like to I like to get naked in my room walk to the shower naked got got dry off put the towel up and then walk back to my room so there is no back and forth that's it in the bathroom I'm INE once I'm out of out I like to think that uh the Colin doesn't just do it when you're not here like he knows when you're here but like he doesn't like gear it around like riding in too there are definitely times where I'm like oh they are home Wheels but I and I have I only",
            "start": 951.76
        },
        {
            "text": "you're not here like he knows when you're here but like he doesn't like gear it around like riding in too there are definitely times where I'm like oh they are home Wheels but I and I have I only need about three seconds so now it's go time and then I go I think I think everybody who watches the show knows col I knows that me seeing his dick would not it wouldn't be AIG impress have you seen it well no I've heard enough descriptions to know what I'm getting into at this point if I was if I was going to be impressed by your dick it would have to be touching the ground the way you talk about this 100% with what Tim just said at some point we should put we should put a categ patreon where if we hit a specific limit we'll draw each other's dicks like what we just what we imagine the dicks the look Kevin looks Kevin gets to look at each dick and decide how close to they came no we'll do a blind taste test with Kevin where he has to look at the dick and figure out who who dick is who you're",
            "start": 985.64
        },
        {
            "text": "look Kevin looks Kevin gets to look at each dick and decide how close to they came no we'll do a blind taste test with Kevin where he has to look at the dick and figure out who who dick is who you're going see you're going to see our thighs it'll be pretty obvious oh you don't have to draw the thigh you can do that in for shortening or like or like you know you put that in the background you know okay you're still talking about the drugs you just do oh I'm making Kevin looking at my dick what patreon go do we have to do where Kevin gets an iPhone my dick you think at some point I don't know why I think this but I think at some point if we and there's by all accounts we're going to continue to do this thing that we do around this table I have this Rising suspicion that because of that Rising we all have to see each other's dicks one day oh you'll see I'll show you whenever you want I I don't want to go outside guys right now look at Colin's dick I I don't not want to do the do the rest",
            "start": 1027.88
        },
        {
            "text": "we all have to see each other's dicks one day oh you'll see I'll show you whenever you want I I don't want to go outside guys right now look at Colin's dick I I don't not want to do the do the rest of the show talk about it I'm not adversed to seeing it I bet it's beautiful first off that's the whole thing is no one's adverse to seeing anybody's dick here we we've been together too long it doesn't matter I've been I've been in locker rooms before I've been I've seen a lot of other people's penises there's that for some reason at IGN someone tore off little divider what the **** is why the urinals we all made a reference to it and now it's just over and it's normal I walk in I see people did you do it there's two urinals there used to be a wall between the urals the wall is now gone what are you saying Kevin just say Kevin was at they do something called the brown brown Li some Tor it off in brown liquor Society they got hammered yeah someone was probably trash that's too bad why I",
            "start": 1065.96
        },
        {
            "text": "are you saying Kevin just say Kevin was at they do something called the brown brown liquor Society they got hammered yeah someone was probably trash that's too bad why I don't say drink now here's the thing though what the one of the reasons I'm afraid of anyone seeing my dick when I'm walking around after working out is because it's much like when you go you take you get out of the pool everything kind of just shs up now I've often had a thought in my mind where if Greg saw my dick then I'd be like well now you have to see it I'm going to have to show it to you later because I want you to I don't want you to have this image in me so I'm just coming in your room later and I'm going to show it to you I've told you this story before personally I think there somebody at this table I'm sure where I went to the doctor that one time and I was like oh I want to have them inspect a mole that was down there or whatever and so like the nurse leaves you alone you're",
            "start": 1103.48
        },
        {
            "text": "at this table I'm sure where I went to the doctor that one time and I was like oh I want to have them inspect a mole that was down there or whatever and so like the nurse leaves you alone you're like all right cool and this is like I was a young kid at the point nowadays I don't give a **** but like the nurse leaves and I'm like all right so I start like fluffing like I don't want this doctor to see this dick and think this is what my dick is cuz I'm in a cold room I I'm totally off my game I'm not comfortable obviously these are problems you got to fluff you always fluff is that what you were saying yeah this isn't my dick look at the ball well don't don't you don't fluff you got you just warm that's what you got to do just put like if you got if you got like a car heater and your like a seat heater in your car put that thing on the high before you go in there if you're having some sort of what kind of **** physical are you getting where you're going straight from the car right",
            "start": 1140.88
        },
        {
            "text": "a seat heater in your car put that thing on the high before you go in there if you're having some sort of what kind of **** physical are you getting where you're going straight from the car right in the doctor's office you go in they're like all right it'll be 30 minutes you sit there you're get to Highlights magazine you call me I'll be in my car why you got do I'm warming my dick I got to war this dick up you you take the North Face coat you put it over and you you lock the heat in and then you go into the doctor's office you wrap it around the front ways your balls are like at your knees when you're walking tearing the scrotum off each ball like each leg as you walk you know it's so stuck on wor dude like I'm telling you having fat thighs is a big problem for me because I'm constantly my balls are just constantly in in a state of flux the Batwing the funny thing is that I can tuck it all all away and and just walk around as if I don't have a dick at all as well the big thighs",
            "start": 1174.4
        },
        {
            "text": "my balls are just constantly in in a state of flux the Batwing the funny thing is that I can tuck it all all away and and just walk around as if I don't have a dick at all as well the big thighs come like who does that in a Buffalo Bal bill yeah buffal B yeah like so it's it's a blessing and a curse in that respect I guess my morning routine yeah I wake up 6:45 7:15 I'm so early and then you text us cuz I have a long I have a long **** way to go you have a car you have a nice life ahead of you time you're just like like I'll be like does Greg think that we're up at 7: 00 in the morning or do why is your phone distur or learn to sleep through it just I'm just giving you things to wake up to that are positive usually I love it it's rare that I'm like Hey Kevin **** this video up like he hey guys I'm warming up my dick hey stop putting things in playlist that don't **** go to the playlist cuz YouTube sucks Kevin Kevin wake up 6:45 7 sometimes later depending on how tired I am then I",
            "start": 1214.76
        },
        {
            "text": "guys I'm warming up my dick hey stop putting things in playlist that don't **** go to the playlist cuz YouTube sucks Kevin Kevin wake up 6:45 7 sometimes later depending on how tired I am then I look at the love of my life the one who warms my heart and I say patillo do you need to go outside cuz sometimes either patillo if he's sleeping down by the legs everything's fine but sometimes I'll wake up and he he'll feel me stirring it's right this it's right to this right dog in my face I'm like well let's go outside right away I'll put on pajama pants I'll take him out he'll do his thing or you just flip the script I go right to the bathroom poop first thing first well actually I'm sorry roll over I turn off the alarm look at Priscilla see what is he's giving me body language size then I pick the phone back up right to Twitter I want to see what's happening what have I missed what are people tweeting at me at 6 a.m. you didn't miss anything you'd be surprised what happened in the UK o",
            "start": 1263.0
        },
        {
            "text": "the phone back up right to Twitter I want to see what's happening what have I missed what are people tweeting at me at 6 a.m. you didn't miss anything you'd be surprised what happened in the UK o it's me K McDonald Tri do you Governor brought all these PS3s for you dude and then look at Instagram then I'm in in between all that I'm probably pooping getting that out of the way you poop in the morning yeah oh yeah big time Big Time how many times you poop a day you I'm I'm pretty regular now to the point of just just when I am in the morning morning I poop in the morning sometimes though however I'll tell you the exceptions Umami burger or amii I'm po oping when I'm done e like immediately after not immediately but at some point that afternoon I got I'm taking another poop there okay something about the spices I guess they're using those perian spices it's probably it might be the cheese but she supposed to bind you up it's all the grease probably yeah probably Peruvian spices on enough",
            "start": 1305.56
        },
        {
            "text": "about the spices I guess they're using those Peruvian spices. It's probably, it might be the cheese, but cheese is supposed to bind you up. It's all the grease probably. Yeah, probably Peruvian spices on enough that be cheese pizza. Didn't know about that in the recipe. I finished the poop, then it's right to the sink. Then usually I brush my teeth. I'll pop out the Invisalign retainer things I wear cuz I'm already done with them . Then my teeth don't mash together anymore. That's all I want out of it. Brush my teeth, uh, then shave, then shower, then get out of the shower. Then if I haven't walked Pat illo, walk Patillo, bada bing bada boom, uh, then go. Usually I leave the house and realize I've forgotten something and then I'm too lazy to go back and get it unless it's headphones. You never leave the house without headphones. I bring a a backup pair of headphones cuz I forgot my headphones so many times. Yeah, yeah, but more usually it's like on Sunday, like this was this Sunday, we go grocery shopping and I buy my food for",
            "start": 1351.24
        },
        {
            "text": "I bring a a backup pair of headphones cuz I forgot my headphones so many times. Yeah, yeah, but more usually it's like on Sunday, like this was this Sunday, we go grocery shopping and I buy my food for the week, which includes a whole bunch of beef jerky, a whole bunch of Cliff Bars, and a whole bunch of yogurt. And so then it's just the struggle every Monday morning not to forget any of that ****. And so literally this Monday morning I got my bag that I packed the night before, so excited I didn't forget it, made it to the street and literally I hit the sidewalk. I was like, ****, I didn't put the yogurt in the bag . And I look back at the house and I was like, no, I don't want to do it. Just walk down, bought a bagel. Got you far. Yeah, once I'm outside, I want to do it. Then I then you have the the **** indignity of buying the bagel from Irons ide, coming into work and finding out, oh, we bought Bagels. Why the **** isn't anyone goddamn texting me? I want woke at 5: in the after in the morning and I know",
            "start": 1394.8
        },
        {
            "text": "of buying the bagel from Ironside, coming into work and finding out, oh, we bought Bag els. Why the **** isn't anyone goddamn texting me? I want woke at 5: in the after in the morning and I know what what's up. That's a good Greg impression. Impression. That's my routine. It's boring. It's not nothing too exciting . I get on the Mun. Yeah, I wish one of us had did something super crazy. What's yours? Oh, you're looking at me now. I'm hoping you do something crazy. I mean, does Nick not do something crazy? Crazy. I do. I do do this weird thing where I I do the same thing you do first of all, which I set my alarm way too early and then I since I drive myself to work, sleep through it until I just feel like waking up. Let's be honest. Uh, then I what time you get up? You're yelling at me for getting up too early one and I I now get up late. I used to get up when I'd go running, I'd get up at 5: and then when I was like, **** that, I'd get up at 6:00 and I try to be work by 8: cuz I like being at IGN early. That's weird. I",
            "start": 1432.0
        },
        {
            "text": "I I now get up late. I used to get up when I'd go running, I'd get up at 5: and then when I was like, **** that, I'd get up at 6:00 and I try to be work by 8: cuz I like being at IGN early. That's weird. I would make myself no one's there to **** get in your way. You get you get things done. Yeah, I know, but then you still have to work till like 5:3 0, which is like w it's so long. Anyways, I work up, I wake up at about 8: generally. That's good. That's good. Uh, shower, do the whole shebang. When I lather, I do it with a uh shea butter, uh, that kind like brown sugar shea butter smell like like body wash, that's what it's called. Cocoa butter, I think maybe I didn't go into this. I'm sorry. I want to point I want to give a shout out to Christine Steyr. Of course, Christine Steyr has gone down this road now of the all organic products. Mhm, which I fought for a long time, but she gave me this body bar that's coffee and like oat or whatever ****. I want to eat this thing every goddamn morning. It smells so good and",
            "start": 1475.24
        },
        {
            "text": "organic products. Mhm, which I fought for a long time, but she gave me this body bar that's coffee and like oat or whatever ****. I want to eat this thing every goddamn morning. It smells so good and then I use a shampoo and conditioner that are just amazing too. That's fantastic. Uh, yeah, I get out, uh, and I generally go to Starbucks every day. That's what really starts my morning off. Oh, that makes sense. Every day I go to Starbucks and I get Venti iced coffee. The fact that he walks in with a goddamn coffee cup from Starbucks every day, you just put that together. What I mean to be honest, I thought he just kept the one from yesterday and just like used that. You think Nick Scarpino is involved baller? Nick Scarpino is baller. I didn't know you go in the morning though. Yeah, I go in the morning every morning. So I'm usually at Starbucks by about 9: and 9: 15. Sometimes if I'm if I'm running a little behind, which I generally am, go there and I try to debate whether or not I should buy breakfast at Starbucks.",
            "start": 1521.16
        },
        {
            "text": "so I'm usually at Starbucks by about 9: and 9:15. Sometimes if I'm if I'm running a little behind, which I generally am, go there and I try to debate whether or not I should buy breakfast at Starbucks. You should not do that. It's a terrible idea because I I'm addicted to the thing called the protein pack, which is three slices of apples, an egg, the fried the the Friday the weird Lavin thing. Yeah, the there's there's hard egg, a little bit of like an unleavened bread thing that has a Like A Raisin in it and then some grapes and some peanut butter. This thing's like 5 bucks. It's incredibly expensive for what you get and I'm addicted to it. So sometimes I can talk myself out of getting that into getting a Kind bar, which I've stopped eating now because they start to hurt my damn teeth cuz let's be honest, Kind bars went from being sort of a health bar to now they're just made of chocolate and or caramel making them more of a candy bar. So I digress. Uh, then I just go to work. Yeah, I've seen you get",
            "start": 1562.44
        },
        {
            "text": "Kind bars went from being sort of a health bar to now they're just made of chocolate and or caramel making them more of a candy bar. So I digress. Uh, then I just go to work. Yeah, I've seen you get pissed off when they don't have your little packs. Oh, I don't like that. Like it's I need it. I need it because it's like it's good. It's a good little energy boost. I enjoyed it when they used to have the bacon egg and ham sandwich, but then they started putting the bacon egg and ham sandwich on this weird ass bread. They're doing some weird stuff with. I don't like that at all. Bring back the Ciabatta. Ciabatta is what's all about. The Ciabatta bre is good. That Gouda, I got as they say. Oh yeah, I don't do anything crazy. Um, no, nothing. Okay. I mean, what are you going to say, Tim? I no, it's over. That's it. That's all we got. Mm, those are those are morning. None of us watch porn in the morning. No, nothing. I'm sorry. I'm sorry. Read porn in the morning. I mean, once in a while if I'm feeling fris ky, I'll look at like Gone Wild",
            "start": 1606.6
        },
        {
            "text": "mm those are those are morning. None of us watch porn in the morning. No, nothing. I'm sorry. I'm sorry. Read porn in the morning. I mean, once in a while if I'm feeling frisky, I'll look at like Gone Wild on Reddit, see what they're up to. What are they up to over there? Yeah, so every once in a while like if I was looking at something the night before and it's still on my phone, the story I check my phone in the morning first thing. I don't know why. I just I have a bunch of notifications. I read the novel that is Greg Miller's **** text today about the good news. No, I love it. I love I loved it especially today when you were like, hey, great news, Melissa Joan Hart just started following all of us. And I was like , that's what you tweeted us. Oh, is that is that what I talked about? Kevin Smith. Yeah, that was pretty awesome. That's great. No, I I always love your your great news, but Joan Hart followed all of y'all **** and Sean Finnegan and did not follow me. You're pissed. She also she also followed Alexis Kaz.",
            "start": 1655.88
        },
        {
            "text": "awesome. That's great. No, I I always love your your great news, but Joan Hart followed all of y'all **** and Sean Finnegan and did not follow me. You're pissed. She also she also followed Alexis Kaz. She did. Got a text from Lexus who I think is still in Hawaii. Yeah, and was like, did Joan Hart just follow you? And I was like, I think so. She's like, why did she follow us? I'm like, don't ask why. God works in mysterious ways, man. He just does. It's a good way of putting it. I want the cat to follow me then all you guys will be jealous. True story. The guy who did the cat's voice and now hold on, actually I'll just tell you the story. True story. The guy who does the cat's voice was none other than Lex Luther in the Super Boy TV show. Now true story on top of that, I'm just going off my audio cues. I never did the research on that, but I assume I'm right on that one. That also think that it's Matthew's best friend from Dave Matthews. No, no, from CU he was old. He was old. He wasn't young Sabrina the cat. Yeah, yeah, no",
            "start": 1694.32
        },
        {
            "text": "research on that, but I assume I'm right on that one. That also think that it's Matthew's best friend from Dave Matthews. No, no, from CU he was old. He was old. He wasn't young Sabrina the cat. Yeah, yeah, no wait, maybe Sabrina the cat, it might have been the cat from Hocus Pocus that he's the voice. That's very much correct . Yes. Now here's one for you. Are you ready? Is a deep cut. If you remember on top of all that, this guy was also on Seinfeld and I believe no, I'll **** that up. He was on Seinfeld. I can picture him, but I can't tell you what character he was. Yeah, I can't tell you what character myself. Time I head. We'll have to get him on the show eventually too. I I'm going to [Music] follow",
            "start": 1735.64
        }
    ]
}