{
    "id": 437,
    "video_id": "7gJu7_KAfxI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Colin's Crazy Colonoscopy Story - The GameOverGreggy Show Ep. 49 (Pt. 2)",
    "description": "Colin Moriarty gets deep about his recent Colonoscopy.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1415692803,
    "duration": 1377,
    "transcript_chunks": [
        {
            "text": "Colin , yes. What's your topic? This is a serious topic, Greg. I went from like, well, we went from Alzheimer's there. We we're going down the **** rabbit hole here. I want to use my brief time on the show this week to talk about what happened to me last week and to encourage people to take good care of themselves in a very specific way. Now, Greg, you know me well enough to know, uh, you know me better than almost anyone actually. You know that I have an notoriously terrible stomach and a terrible gut. I've had it like my whole life. Awful, just **** awful. And, uh, I've been dealing with this since I was a wee lad and no one's ever really found out what was wrong with me. I used to do I used to go to BU Medical Center and all this sort sort of stuff and they used to like do test. I mean , oh, you have IBS and all this kind of stuff and I get IBS syndrome exactly and I get no, I don't have Crohn's, thank God, because Crohn's that would be that's really bad. Um, but, uh, I get like these ing pains that just get",
            "start": 1.1
        },
        {
            "text": "and all this kind of stuff and I get IBS syndrome exactly and I get no, I don't have Crohn's, thank God, because Crohn's that would be that's really bad. Um, but, uh, I get like these ing pains that just get worse and worse and worse. And by the time I got into college, I used I get crippling pains where like I'd be in like the fetal position on the bathroom floor like like in like really bad shape. And my girlfriend at the time in college found me on the floor at that like I was like you the **** wrong with you you got drugs or something . Yeah, she probably did. Um, and, uh, so like this started this whole train of like, well, what's wrong with you? Nothing. You have IBS or you have you know, you have uh colitis or you have you know, like whatever. And then last year I got an endoscopy because they diagnosed me as you remember with blood test with celiac disease and I'm like, oh, you have celiac disease. This is the famous diagnosis we were going to E3 and you did a bunch of tests you were trying waiting for",
            "start": 46.6
        },
        {
            "text": "as you remember with blood test with celiac disease and I'm like, oh, you have celiac disease. This is the famous diagnosis we were going to E3 and you did a bunch of tests you were trying waiting for the results as we're on the plane. You get the notification that you had a message. So we we literally are starting to taxi and like they it's we're long past the please turn off your cell phones you know the doors closing thing and you leaned over to it buried your head into my body like this to listen to The Voice voicemail lady came by and was like sir you cannot be on your phone like I'm getting test results I'm getting test results then you tried to call while we were taking off and they came back and they're like sir we will have to cont I'm get T oh wow they we're in the war room and you finally got the test results and you cried. I started crying yeah for for Celia yeah I love beer I love beer and I'm also half Italian so I grew up in a New York Italian family eating eating pasta and all",
            "start": 91.08
        },
        {
            "text": "got the test results and you cried. I started crying yeah for for Celia yeah I love beer I love beer and I'm also half Italian so I grew up in a New York Italian family eating eating pasta and all you know bread and all and I was like this is ating I went literally a year and a half before they were like you really should get endoscopy because the blood test is just indicative that you have it and even though it's almost certainly right anyway C and so on I got the endoscopy they're like oh no you don't have cellia disease so I was like oh great thanks so not only do I not know what the **** wrong with me again but I wasn't eating gluten and uh and they're like oh you have a bunch of ulcers I'm like Okay cool so then I I was back on Long Island at home right before Comic Con in New York and I got the worst stomach pain of my entire life and I'm going to be very Vivid with everyone out there cuz I want you to really understand what was going on I want you to be able to take care of",
            "start": 136.2
        },
        {
            "text": "and I got the worst stomach pain of my entire life and I'm going to be very Vivid with everyone out there cuz I want you to really understand what was going on I want you to be able to take care of yourself I was like **** blood and like it was like really bad I was like oh my God like I have cancer you know or like something's like really **** you ever blood before yeah but not like this not like this and this is like that the Freddy Krueger scene when the bed opens up John he so cute oh well so I kill the pre one so the the the the blood was and the pain was like **** horrifying like horrifying horrifying pain as you know like it caused me to come to ComiCon late and um and yeah uh I was just like bedridden at home for like 3 days it was like really weird my in my old bedroom yeah you were home at least yeah exactly and I was like sending pictures of my poop to my dad and stuff like that was like is this all right classic col um but anyway I like I I started to feel better and",
            "start": 174.72
        },
        {
            "text": "you were home at least yeah exactly and I was like sending pictures of my poop to my dad and stuff like that was like is this all right classic col um but anyway I like I I started to feel better and blah blah blah but then I got you know a colonoscopy um and this is a weird thing for a young man to get then and the reason I want to tell everyone this and it'll be a very brief kind of topic is the the the feedback I got from a lot of the doctors and nurses all very nice people that were really really nice people you know professional but all every one of them was like you're really young you know like you're really young for this why are you so why like what's wrong like like oh you're so young and you should wait they were telling you like what's wrong when you're like I'm there cuz I'm shoting but they're like so like what happened oh you're so young exctly that kind of thing and and and what I wanted so I wanted to courage everyone is like that kind of bothered me because I was",
            "start": 220.12
        },
        {
            "text": "shoting but they're like so like what happened oh you're so young exctly that kind of thing and and and what I wanted so I wanted to courage everyone is like that kind of bothered me because I was like something's wrong with me and and they're obviously like looking into it and and and I'm getting my test results and stuff and they think you know hopefully everything's okay but I want to encourage everyone to like really ignore that **** no pun intended if uh so don't don't ignore **** no don't ignore the **** but ignore that **** if if something's wrong with you like really follow up on it because like it was very it felt discouraging in a way you know to be you're already there right I was well even when I was like seeing the the the general practitioner and their stuff and they're like well we don't think anything's wrong with you cuz you're young you know like embarrassing too but you know do the do the stool samples and do all those kinds of things then we'll schedule",
            "start": 259.32
        },
        {
            "text": "like well we don't think anything's wrong with you cuz you're young you know like embarrassing too but you know do the do the stool samples and do all those kinds of things then we'll schedule coloscopy right so I just wanted to encourage everyone like really follow because like getting oscopy is colonos is like very invasive and like and it hurt like it it's it's painful I like woke up during the colonos see you say this are you sure you did yeah so I'm pretty positive I mean I was pretty **** up but like and stick with me I remember watching video from the last time you had a surgery where you're all **** up talking to Cheryl yelling stuff like are you sure you didn't just hallucinate this well I'm going to find out when they call do we do we have this video I'm sure has it he sent it I used to a long time ago yeah yeah let's try to find that yeah I was like totally when I got my endoscopy I was **** wrecked like for like a day I was like totally messed up right now and if we",
            "start": 295.36
        },
        {
            "text": "it I used to a long time ago yeah yeah let's try to find that yeah I was like totally when I got my endoscopy I was **** wrecked like for like a day I was like totally messed up right now and if we don't we didn't insert right there wait when when was that uh like a year ago can you can you be more specific no like literally almost a year ago like no the new searching on Apple phones for the photos very helpful like I'm able to just track things down is it new to me it is so it's new to me think was like iOS 4 shut up but but that's it it's just a very brief and simple thing like really listen to your body and take care of yourselves uh because I probably should have done this stuff a lot sooner and conventional wisdom says that you don't get colonoscopies until you're 50 or so so like you know and they found a pup and they cut it out and hopefully everything's good and they took some samples and stuff like that but you know I just want to encourage people someone someone wrote on",
            "start": 333.24
        },
        {
            "text": "you know and they found a pup and they cut it out and hopefully everything's good and they took some samples and stuff like that but you know I just want to encourage people someone someone wrote on my Facebook something really profound because I took a picture of myself in a gown my a gown I just like posted as a joke and be like you know I got a colos you should do it too if you are having stomach pains like don't you know take care of that and someone's like even if you can get one person to listen to you you did a good thing so I just wanted to kind of put that out there that energy out there that you know what resonated most with me with that visit was like wow you're so young and this is so unusual well maybe it isn't and maybe you should maybe you should do these kinds of things if you really feel like you need to even if like everyone's conventional wisdom says that there's nothing wrong with you you know because there's obviously something wrong with me uh the other thing and",
            "start": 378.24
        },
        {
            "text": "you really feel like you need to even if like everyone's conventional wisdom says that there's nothing wrong with you you know because there's obviously something wrong with me uh the other thing and I just to for a little more you know to to to to light mood a little bit is uh the process of getting the colonoscopy beforehand is the drinking of the yeah the **** the fluid like concoction are you are you aware of this I would have been aware of this if Colin didn't send me a photo while I'm on vacation in Missouri have all these different XL like two what how many gallons it's well so here's the thing here's the thing they this it's like so excessive I was like telling the Nur like this is so unnecessary like they're like go to the store buy um magnesium nitrate which is in itself just a complete laxative they're like go buy duax which is the pill their pills and go buy mirax and I'm like okay and they're like go buy two things of Gatorade 32 oz Gatorade oh this is the doctor telling",
            "start": 409.72
        },
        {
            "text": "complete laxative they're like go buy duax which is the pill their pills and go buy mirax and I'm like okay and they're like go buy two things of Gatorade 32 oz Gatorade oh this is the doctor telling you to get Gatorade by the way sorry I'm a health nut and Gatorade is the shittiest thing you can drink I'm done I'm from Berkeley I'm done no I think I'm just saying doctors go drink Gatorade El yeah I think that's why they wanted well I think they want that cuz it's like it's got to hydrate you cuz you can't eat so I didn't eat what would you have them drink you he coconut water **** yeah does that have electrolytes yeah **** yeah sorry I just get angry does it have gum gum does it have chewies and gummies no did Michael Jordan drink it anyways the swamp so you know it's named Gatorade because it helped the Florida Gator yeah it did yeah that's true thank you commercials for Gatorade um so I just wanted to show you guys how excessive this was at four all right so my my thing was at",
            "start": 455.28
        },
        {
            "text": "because it helped the Florida Gator yeah it did yeah that's true thank you commercials for Gatorade um so I just wanted to show you guys how excessive this was at four all right so my my thing was at 9:00 in the morning the next day I hadn't eaten since 8:00 the day before you can't eat in the morning or night at night I didn't end up eating for 45 hours so Jesus from 8:00 p.m. on Wednesday I didn't eat until like 5:00 they have to have it like completely I mean you got to be yeah you got to be like got be clean and so and also I passed out when I got home so like there was another eight hours te um so they were like at 4:00 take two duax pills you're only supposed to take one and that will clear clear you out so they like take two of them and then at 5:00 take half the mirax which is eight servings of it so you can you can there's like 16 in the bottle that will clear you out 16 times take eight of them put them in the Gatorade and drink it within one hour and 30 minutes after that",
            "start": 500.52
        },
        {
            "text": "servings of it so you can you can there's like 16 in the bottle that will clear you out 16 times take eight of them put them in the Gatorade and drink it within one hour and 30 minutes after that it was **** game over for me but that was only but that was only half of it because then they were like at 3:00 in the morning get up drink the other half the other eight and then drink the entire bottle of magnesium nitrate when I tell you I **** 30 times in 12 hours it's no joke and when I tell you 25 of them was nothing but Gatorade that that also is not a joke there's your **** coconut water and I told him like I went in and the nurse was very friendly very friendly to me and my girlfriend and I'm like it's little excessive is really necessary like I've been on the goddamn toilet bowl all day and all night I was done after the first mirx dosage why do I have to keep doing this over and over again so that was much worse than the Fire in the Sky moment I experienced when I woke up",
            "start": 543.64
        },
        {
            "text": "all day and all night I was done after the first mirx dosage why do I have to keep doing this over and over again so that was much worse than the Fire in the Sky moment I experienced when I woke up during so tell me what that actually is like so I only memory so here's the thing I didn't know and I don't know if you guys know this I didn't know this and and and our friend Dan who we work with a reviews editor his his his uh wife's a doctor an anesthesiologist and he was like no this is true one of the one of the drugs they give you they give you and something in my ass yeah what does that mean like like I felt something I felt something I felt something in like I'm not even kidding like something in my ass and in me and like they H like someone like got on top of me like to make sure I didn't move and they probably like like up the dosage like really quick I got knocked knocked back out I know people who woken up mid like wisdom teeth surgery because it's twilight it's at Twilight",
            "start": 598.28
        },
        {
            "text": "didn't move and they probably like like up the dosage like really quick I got knocked knocked back out I know people who woken up mid like wisdom teeth surgery because it's twilight it's at Twilight sleep whatever yeah you know and they like you know yeah so like and I was I was just back out and the last thing and I don't remember anything else until like I was in a wheelchair she's on top I'm Dr. Ross call me ma'am one more time but she was she was she was super friendly and they were very professional so wait you come out of it and you're talking they getting the check down or whatever at the end you don't this doesn't come up no because the doctor didn't even come out to see me a nurse came and said like here's your results the doctor will call you next week the the first time when I had the endoscopy the doctor came out to talk to me and then Midway through was like you have no idea what I'm saying so I'll just talk to you next week cuz I was like yeah like that was when I was",
            "start": 702.44
        },
        {
            "text": "I had the endoscopy the doctor came out to talk to me and then Midway through was like you have no idea what I'm saying so I'll just talk to you next week cuz I was like yeah like that was when I was when I went got my endoscopy the famous the story Sher always tells is that you know they have the little heart monitor on your finger and I kept taking it off to Flatline cuz I thought it cuz I thought it was funny and she and she told me this time I was like going like I was like in slow motion going like and she like like hit hit my hand away did you guys see the video probably not but last week um somebody did some surgery some girl and her friend some girl did surgery I don't know details on it YouTube Days her friend taped it and it was so funny because the girl was like super upset and she's like what's wrong are you okay she's like I'm not Nicki Minaj wake up and be Nicki Minaj and it's so funny right that's has Nicki Minaj reached out yet not that I know",
            "start": 741.2
        },
        {
            "text": "was like super upset and she's like what's wrong are you okay she's like I'm not Nicki Minaj wake up and be Nicki Minaj and it's so funny right that's has Nicki Minaj reached out yet not that I know of which is upsetting because she should she really should she was just so she's like do you think Nick and Minaj is pretty she's like yeah I'm not that pretty like it's a brain it's an interesting thing the drugs are insane though so so just so what the drugs are insane after all of that so after all that so I'm getting my results back but I just you know the doctors the one thing I because I have Kaiser and the the they're really good like I like them a lot and like they've always been really nice thrive thrive exactly that's they're saying they've always been very professional very nice um very helpful whatever but it was just that one thing where I was like you know I'm already here and I'm in the process but what if they're saying this like or what if people are getting this message",
            "start": 784.64
        },
        {
            "text": "very helpful whatever but it was just that one thing where I was like you know I'm already here and I'm in the process but what if they're saying this like or what if people are getting this message that it's just they're a little young you know it's unusual to me it just stuck out as like I want to encourage people to really kind of take care of this earlier because so many people have like me I'm a ball of stress like I was saying earlier I'm just **** stressed out all the time for no reason and uh it really does take a toll on you right and I think that's why my stomach's so **** up when I played hockey I played hockey all those years I would throw up before games all the time like I was just like such a like a mess nervous you know like and you feel it in your gut that's where a lot of your nerves are like you know so like it's it's it's just something I wanted to encourage people to you know look into you're having stomach problems whatever like and and you're young and you",
            "start": 831.12
        },
        {
            "text": "lot of your nerves are like you know so like it's it's it's just something I wanted to encourage people to you know look into you're having stomach problems whatever like and and you're young and you want to you know keep going in general looking any problem you have the CPS up but that's such an old person problem right like like well sure but I mean get your colonoscopy on your 50 every 5 years whatever but it's like I'm 30 and I've had these problems my whole life so it's just I just one of those I call cancer at a weird time you know what I mean usually it's either your like leukemia and your a kid or you're like getting older and it's the something else right and I caught it right at around 28 right seven somewhere in there and it was one of those things of like yeah it been a while which is weird but yeah you know like I remember when my lymph node SW SW SW swelled up the first time right you and I was like oh well that happens all the time and then when it didn't go away I was",
            "start": 866.6
        },
        {
            "text": "which is weird but yeah you know like I remember when my lymph node SW SW SW swelled up the first time right you and I was like oh well that happens all the time and then when it didn't go away I was like I just should keep an eye on that and then I forget about it I remember that and it would pop up and then when this it was your friend it was your friend that told you that you should go to the doctor wasn't it like your doctor no it was by that point I knew well this is when I went back to Chicago for Po's wedding and I me and Christine it was Christine's first time in Chicago and I was watch Walking her down at a fancy purse shop that I always get wrong so I won't say which one cuz I'll screw it up cuz I usually say the wrong one she's like that's a cheap purse shop you're making me sound weird I'm like all right uh we were walking around and we were in there and she was like I'm going to go look at that person I'm like cool I'm going to sit down real quick she's like okay and she",
            "start": 902.76
        },
        {
            "text": "weird I'm like all right uh we were walking around and we were in there and she was like I'm going to go look at that person I'm like cool I'm going to sit down real quick she's like okay and she went away and I sat down I Googled heart attack symptoms cuz the walls were pulsating in and I was like something's very wrong and and then the internet was like that's not a heart attack I was like well I'm not going to call ambulance to downtown Chicago then didn't didn't your friend feel your neck well that what happened that was like this is like I had the the swollen lift nodes and then I had a lump over my collar bone and I was like oh yeah that's that's that was really weird obviously I knew something was wrong and so like that the walls pulsating was like all right I need to actually act on this and so at the wedding I talked to my doctor friend Nan Dr n about it and he was like I he's drunk too and he's like I'll check you and he he's doing the not and he's doing the whole thing yeah",
            "start": 935.16
        },
        {
            "text": "this and so at the wedding I talked to my doctor friend Nan Dr n about it and he was like I he's drunk too and he's like I'll check you and he he's doing the not and he's doing the whole thing yeah that's out out of the ORD did this blah blah and then one of Po's friends like a girlfriend who I KN knew as well obviously just by she's like oh if your lymph noes are swollen up it's probably just Hodgkin's lymphoma that's the one you want and walked away that's the one you and I yeah that's what it was when I went interesting but yeah but I went into that doctor's appointment thinking not trying not to overthink it right because you know I think throughout my life when stupid things happen you're always like well this is it this is something bad this is bad and you get there doctor's like no that's totally normal you've wasted time you're like I'm at 150 bucks damn it so when I went to see that doctor I remember I went for something totally I guess I actually don't remember I went for",
            "start": 971.16
        },
        {
            "text": "no that's totally normal you've wasted time you're like I'm at 150 bucks damn it so when I went to see that doctor I remember I went for something totally I guess I actually don't remember I went for something mundane and that and I was leading with the mundane thing and I was like oh yeah when these are SW up these he like okay and he's like the other thing is no big deal and he felt my neck he's like H and then he felt my thing and he went over and got a ruler and came back then he jotted something down left the room came back in he's like this is troublesome and you know I'm like oh okay and he's like his nurse came back in and handed me a posted note like this and said you have a you have it you have a cat SK or a pet scan you have a pet scan today at for and I was like we're moving that quick that's 2 hours from now like I have to call work like just go you do not have to call work you need to go I like oh uhoh and then everything was so spited from there and like when when I got",
            "start": 1008.96
        },
        {
            "text": "quick that's 2 hours from now like I have to call work like just go you do not have to call work you need to go I like oh uhoh and then everything was so spited from there and like when when I got the scan I guess it was the CAT scan I got the the scan or whatever and uh I'm in the tube and they bring me in and they only you know brought me down into about here or whatever and then I was in there for a while and they pulled me back out and they came over intercom and he's like oh yeah we're going to we're going to we're going to do phase two pretty soon here phase two pretty soon I'm like okay and I was like I don't they never said there's a phase two of this and I laid there for like another 10 minutes and they came back on and he's like sorry uh we're just trying to get uh approval from the doctor on call but he's not answering his phone and your doctor is not answering his phone either so just hold to tight no big deal and they came back like another 10 minutes later like all right",
            "start": 1046.24
        },
        {
            "text": "the doctor on call but he's not answering his phone and your doctor is not answering his phone either so just hold to tight no big deal and they came back like another 10 minutes later like all right well the stuff we gave you the you know the radioactive stuff to make it you visible that's about to wear off we wouldn't want to give you another doses so we're just going to take you off like okay and I left and I called my friend like this just happened I'm like I call him like I honestly because I get it must have been a CAT scan cuz I get pet scans are a huge deal anyways when I got the scan I cat SC called the guy and I'm like on the way I'm like hey like when you get a CAT scan can they see preview images back there he's like yeah I'm like all right and sure enough when you read my charts it was like the scan show that I had gross clearly below was they were like we want to go lower and see how bad it was but they couldn't do it in time and then everything turned out to be what it",
            "start": 1083.44
        },
        {
            "text": "it was like the scan show that I had gross clearly below was they were like we want to go lower and see how bad it was but they couldn't do it in time and then everything turned out to be what it was yeah I remember I I remember that man I remember that was a very emotional very emotional thing it became not for you you know I don't want to say it was it was easy obviously it was a very hard thing but it became when you knew that you were okay even though you still had it you were in the very beginning whatever you were like I'm going to be fine you were much stronger than everyone else was yeah I think I cried well mine were mine were all my stuff was all staggered right like I had time that I knew something was wrong and I knew it wasn't good and I knew this was like I had time to come to terms with everything whereas everybody else it was a light switch right where I like that night I had to sit out there at the kitchen table and call everybody call Mom call Dad call po call you",
            "start": 1117.08
        },
        {
            "text": "to terms with everything whereas everybody else it was a light switch right where I like that night I had to sit out there at the kitchen table and call everybody call Mom call Dad call po call you know I mean call all down this list of friends who I in like who immediately know something's wrong because I hate talking on the phone so get a phone call from me everybody's like are you think everybody's first guest was like you're marrying Christine no no no no dial it to something else why else would I call like do you have a disease I'm like yes cancer oh my God I was that with awkward silence for most the time the the the one of the uh it's it's funny now in retrospect but the one of the funny things I was thinking about about that time was the conversation with Colin when we were talking about um what we weren't talking about we were talking about when I went we went to the Jets game but you couldn't go yeah and uh it's the opening for I was like like you missed a hell of a game and",
            "start": 1154.12
        },
        {
            "text": "about um what we weren't talking about we were talking about when I went we went to the Jets game but you couldn't go yeah and uh it's the opening for I was like like you missed a hell of a game and you're like well no no it was like yeah yeah we went God what yeah that was a great opening for that episode but yeah yeah I I'll screwed up too but it was something along the lines of like Yeah well yeah that's when you got sick with cancer and you had to miss that Jets game and it was a great game yeah so anyway I just wanted to I wanted to just relay that that that because it's it's fun you can laugh at me and laugh at like my Mis forun of maybe having a fire in the sky alien type moment I want you to ask the I'm I'm I'm I'm going to I'm going to ask her and I bet she'll say no I hope so across the table not even the problem is maybe it did really happen they're denying that kind of **** yeah I don't know what you're talking about did someone jump on me and I felt like I had something",
            "start": 1190.04
        },
        {
            "text": "the table not even the problem is maybe it did really happen they're denying that kind of **** yeah I don't know what you're talking about did someone jump on me and I felt like I had something in my ass uh no Mr. Morard and I'm Dr. R yeah like that's what I remember is just someone like not like jumping over me like hovering over me but like someone just like like in like you probably started like SC moving around I think so yeah uh and they were like that's what I remember I don't know but uh but yeah I just wanted to throw that out there because it's I like the the story of the lead up to the colon osc because it was just so **** unnecessary yeah uh but also uh yeah just to encourage people to kind of take care of themselves listen to their bodies listen to even if things are unusual you might seem a little young a little maybe a little weird illness kind of thing you know it was it was very helpful for me to kind of get the endoscopy get the colonoscopy and and kind of tick",
            "start": 1231.48
        },
        {
            "text": "you might seem a little young a little maybe a little weird illness kind of thing you know it was it was very helpful for me to kind of get the endoscopy get the colonoscopy and and kind of tick those things off of course I still have no idea what the hell is wrong with me uh but you will now hopefully with yeah hopefully hopefully I will but yeah just kind of use that as an instructive kind of thing to you know you know don't ignore these things I ignored my **** for a long time again no pun intended if it comes back with they still don't know what's wrong with you Lyme disease lime disease nobody ever knows it's kind of true actually if I didn't catch it when I was back home on Long Island which is like you don't know it's it's like it can sit dormant for like years it's it's kind of weird that way yeah and can everybody like I don't know what to do really a bacteria or whatever the hell it is bad stuff would you write a story about that I did I tell you that story Missouri yeah",
            "start": 1275.52
        },
        {
            "text": "weird that way yeah and can everybody like I don't know what to do really a bacteria or whatever the hell it is bad stuff would you write a story about that I did I tell you that story Missouri yeah exactly lots of ticks in Missouri it was this long thing of like the CDC in Missouri technically didn't recognize Lyme disease because like uh there's a special strand of um this is I'm stretching here for things I did a long time ago a special strand of bacteria in it or whatever and they had never found that specific one so they couldn't say they had it but they had found like 17 different variants that were just like slightly off of it so clearly it was there but they couldn't scientifically do it so I did this article about all these people who were coping with it and dealing with it in Missouri and yada y y work on this thing for like 6 months the longest piece I ever did at the trip and uh I'm driving home from one of my appointments with it or whatever and I sit down at my desk to",
            "start": 1309.28
        },
        {
            "text": "and yada y y work on this thing for like 6 months the longest piece I ever did at the trip and uh I'm driving home from one of my appointments with it or whatever and I sit down at my desk to write up some notes or whatever and I **** you not I feel something on my arm and I look over and there's a tick crawling on my arm like what the **** they knew I was about to blow them up they s their their agents out to get me **** ticks don't trust him for a second not [Music ] ever",
            "start": 1346.44
        }
    ]
}