{
    "id": 429,
    "video_id": "El7L61p9W84",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Root Beer Float Oreo Cookie Review - Oreo Oration",
    "description": "Why?! Why, Oreo?!\n\nThis episode is because of your support on Patreon. Thank you: http://www.patreon.com/kindafunny\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/kindafunny\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Whenever a noteworthy cookie comes, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1414850590,
    "duration": 460,
    "transcript_chunks": [
        {
            "text": "[ Music] What's up, everybody? Welcome to Oreo Oration. I'm Greg , and while you're out living your life, the fine people at Oreo are making endless variations to Milk's favorite cookie. So whenever there's one in the news, and thanks to your support on Patreon, I tear open new packages and give you tasty reviews without any calories. If you like that, like the video, subscribe to us on YouTube, share us with your friends, even your enemies . Today we're reviewing Root Beer Float Oreos. Now, if you want to talk about something out of left field, I've talked about on this show before, I cannot get over that there is someone still doing this. At some point , you think they would have used up all the flavors you could pair with an Oreo, but here's a Root Beer Float. You, it's limited edition, it comes out and you say, why not? I'll tell you now , here's my Root Beer Floats story. I, I'm not a huge fan of them. Once went to my childhood friend's house, Travis, he was still a child, I was still a child, childhood friends for a",
            "start": 0.55
        },
        {
            "text": "not. I'll tell you now, here's my Root Beer Floats story. I, I'm not a huge fan of them. Once went to my childhood friend's house, Travis, he was still a child, I was still a child, childhood friends for a sleepover, had my first Root Beer Float, threw up. Now, number one, this is why I don't like kids, they just throw up for no reason. Number two, just kind of soured the whole Root Beer Float experience for me. But once in a while somebody will be sharing those little, those little root beer gummies, you know, I'll get into it. All right, every oration begins with the patented first look and these are some tan jerks. There they are. They're pretty, they're pristine. We're missing one right there, gives me the nice, the room for the Holy Ghost. Woo! I didn't even get close to it. It was right here. I started this. It smells like root beer. Hold on now. Now that I'm close, right here is optimal when you get it. Take your, take your hand and do this and then yeah, if you can put your chin where my thumb is, that's going to be,",
            "start": 44.32
        },
        {
            "text": "like root beer . Hold on now. Now that I'm close, right here is optimal when you get it. Take your, take your hand and do this and then yeah, if you can put your chin where my thumb is, that's going to be, that's going to make it, it smells like root beer, but if you get really close, smells like some other candy I can't remember. Maybe that's just the smell of my brain cells. Nine, first look, impressive. They're there, they're, I mean, they're not, it's impressive that they're not broken. Wish there wasn't this, the white is blazingly white and I think it might be just because it's, it's paired with the tan brown, like, you know what I mean? Like something's going on there. Let's get right to taste, see what this guy's got going. Wow, he is, he is packed tight. I always talk about the these flavored ones being double stuff, that guy is pushing his weight class for sure on that one. See how it goes. Try to get, I'm going to try to get both in there even though I don't know, I guess, oh, so like, so like usually, you know,",
            "start": 86.0
        },
        {
            "text": "stuff, that guy is pushing his weight class for sure on that one. See how it goes. Try to get, I'm going to try to get both in there even though I don't know, I guess, oh, so like, so like usually, you know, like we did the other ones where you have the two colors, there's two different things, caramel and apple. This one I guess it's like the froth of the root beer, the ice cream of the root beer, yeah, ice cream, whatever. I know talking about another root beer story. I used to live next to Bill and Betty, they were nice people, they were my parents'friends. Root beer was the only like soda they carry in the house. What the, here's what's happening in my mouth, not in Billy Betty's house. It tastes like a Root Beer Float. The cream, I do not like the way the shortbread cookie is mixing with said cream, nor do I like the the the shortbread cookie on it on that one there. I'm going to go from a different column here. It was like, it was like soft , you know what I mean? It wasn't super hard. You want a a hard hard",
            "start": 137.16
        },
        {
            "text": "I like the the the shortbread cookie on it on that one there. I'm going to go from a different column here. It was like, it was like soft, you know what I mean? It wasn't super hard. You want a a hard hard cookie, much better. And know, and I'm checking my biases here about root beer and vomiting and Bill and Betty at the door. I just don't, it's, it's an overpowering taste and you can get the hints of the root beer there, but then it turns into something else that it's like when you're brushing your teeth, you know, and the toothpaste hits your saliva and it just keeps getting like frothier, that's the what it it feels like, but not like the mint part of it, just the froth part of it and then the shortbread cookie, no. Let's see how they pair with milk. Not terrible, but I would not, I can already tell you I would not, oh, got a little too excited there. I can tell you I wouldn't be, I won't be buying these again. One , let me call a moment. Two, that's him. Three, bad picture of him. You're a fascinating, fascinating",
            "start": 206.88
        },
        {
            "text": "not. Oh, got a little too excited there. I can tell you I wouldn't be, I won't be buying these again. One, let me call a moment . Two, that's him. Three, bad picture of him. You're a fascinating, fascinating creature. So they always say doctors that, you know, your sense of taste is really influenced by your sense of smell, right? We did the whole test with the hand, so you know how to smell them at home , but dunking them in the milk negates their smell, which then changes the taste. Still the frothy thing where I feel like it's getting bigger and bigger in my mouth, which happens often, but the taste is still off, still a little, it's still, it's still, still, yeah. H, let's go to twist test. One twist, great. Two, don't need another one. Also don't need eat it. Final score for Root Beer Float Oreos, I don't like the taste. Some people might. I'm, this is, this is going to be one of those ones where you're, there's a line in the sand here on how you feel about this cookie, which to me means I can't F, I can't go below five.",
            "start": 267.8
        },
        {
            "text": "some people might. I'm, this is, this is going to be one of those ones where you're, there's a line in the sand here on how you feel about this cookie, which to me means I can't F, I can't go below five. People will enjoy this cookie. I think it's got problems though. It's my review too, but I want to be in bias. It's the oration scale. There is a principle here. I'm going to go four, five, poor. It is a poor cookie. I know that I'm faulting it for things that aren't, aren't that is not its fault . Maybe you at home are like, I like when the toothpaste expands in my mouth. I like the root beer, but uh, I don't like this one. It's not bad. If you are like, oh man, root beer, like again, if it was a chicken wing thing, I'd be like, oh, I got, I like this, but no, just know that's the way the cookie crumbles for Root Beer Float Oreos. But what do you think? Let me know in the comments your review. Then make sure you keep coming back here for more reviews, but most importantly, let me know in the comments what Oreos I am missing.",
            "start": 347.64
        },
        {
            "text": "Oreos. But what do you think? Let me know in the comments your review. Then make sure you keep coming back here for more reviews, but most importantly, let me know in the comments what Oreos I am missing. There's plenty for me to review. They pop up all the time. You need to go to the comments, tell me what it is, where you found it. I guess how your day is going. I don't know, the stuff like that so I can go buy the cookies, do more reviews, everything else. Then make sure you keep supporting us on patreon.com/kindafunny because that's the whole reason the show is here right now is because of your awesome support. Then make sure no matter what life throws at you, whether it be a four, five cookie, whether it be a four, five man , keep coming back and keep on ding [Music] w",
            "start": 401.6
        }
    ]
}