{
    "id": 445,
    "video_id": "ffzjzZt5LFI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Would You Rather (Again) - The GameOverGreggy Show Ep. 50 (Pt. 4)",
    "description": "Colin Moriarty goes a second round with would you rather.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1416384002,
    "duration": 1382,
    "transcript_chunks": [
        {
            "text": "Colin, okay, so is someone making brownies? Is that what I'm smelling right now? Or Cher bakes a lot, yeah, Cher bakes a lot,'cause I would, yo, Shar Bear , you making brownies? Thanks. Alright, candle. Oh, it's a candle. Well, that's a disappointment. Smells good. You can't eat a candle. Um, try eat a candle. Uh, so, uh, you'll have to forgive me if there's any, any rep, you know, repetition on this. So I found out, you know, I heard, I didn't find out, sounded like you were hiding it from me. I heard that when I was gone, where one of the episodes you guys played like, you know, Would You Rather. Is it fair to say Would You Rather? You rather, Would You Rather? At this point, I'm going to say it's a game, a classic. Go well. Oh, we're doing Would You Rather again? Yeah, I think this is called the recurring segment. Mhm. Okay. Uh, so I thought I found a site called , I just, I just Googled Would You Rather, and a site called Rather with three Rs came up in the beginning. R. R. R. R. like George R. R. Martin. So this is R. R. R. Random.",
            "start": 1.1
        },
        {
            "text": "I thought I found a site called, I just, I just Googled Would You Rather, and a site called Rather with three Rs came up in the beginning. R. R. R. R. like George R . R. Martin. So this is R. R. R. Random, right? R. R. R. Rather Random. So I just thought we'd play a little bit of this, and I, I don't know exactly what the rules were about how you guys played it, and then we just talk about, we just talk about each one of these. I think the first one is very interesting, very, it's very thought-provoking. I, I don't know if you guys thought about this one or had this one, so forgive me if, if you, you have. Well, it's not the same. We did different with Veronica. It wasn't like this thing, right ? No, it was a different one. Ours was a BuzzFeed list. Um, would you rather have no one show up to your wedding, mhm, or would you rather have no one show up to your funeral? Funeral. It's name a question. Funeral. I think wedding,'cause weddings are really expensive. No one showed up, maybe I knew ahead of time, I could save some",
            "start": 47.08
        },
        {
            "text": "you rather have no one show up to your funeral? Funeral. It's name a question. Funeral. I think wedding,'cause weddings are really expensive. No one showed up, maybe I knew ahead of time, I could save some money. That's not how it works. They, no, that's not how any of this works. You'd go there and they would, you would have 50 plates of salmon and a thousand steaks that you ordered. The worst. Yeah, it's a lot of steaks. Probably funeral. I wouldn't care. Who cares? Exactly. You're dead. Who cares? The wedding's got too much riding on it because first off, no one shows up, you look like a, I mean , both you and your, your, your mate are unlovable. Yeah, no one likes you. You are both douchebags. Colin, you've both been punched in the head at Victory Hall. Yeah, right now only Tim's side of the wedding will be empty. We'll have to have one day, you'll have to do a prophecy to tell me if you see the other side being empty. I don't see. It's unclear right now , too cloudy, alright? So I want to blow my wedding out, like I want to make a big",
            "start": 92.6
        },
        {
            "text": "have one day, you'll have to do a prophecy to tell me if you see the other side being empty. I don't see. It's unclear right now, too cloudy, alright? So I want to blow my wedding out, like I want to make a big production out of it. You, yeah, wow, that's you at all. It's ridiculous. So if I did that, I'd want people to be there. So what do you, if it was up to, if I could blow out my funeral, I would, but I don't trust you guys are going to do that. The problem with you is this, we're to put your funeral, you'd want to be performing at your funeral. Yeah, I'm the type of guy that would stage my death to see how people react to it if I could. It's true. You should do that next week. Yeah, also video of it. Follow-up question to this before we, we go back to the original question. If you had the capability of taking all the money that you had saved up, you can either give that to a loved one or Tupac-style hologram at your funeral. Oh, where you rap to everyone by a hologram. What would you do? I would have to think",
            "start": 130.68
        },
        {
            "text": "all the money that you had saved up, you can either give that to a loved one or Tupac-style hologram at your funeral. Oh, where you rap to everyone by a hologram. What would you do? I would have to think about it. I'd probably end up giving the money. Alright, just because that hologram wasn't as cool as I wanted it to. I want to know in your head, what is a blown out wedding ? Oh, I can't, I can't tell people that are there. Fireworks. My secrets are there. Fireworks. Disney involved. Holy crap. Does, does every table have a chocolate fountain? I don't know. No, it doesn't. It hasn't got that far. It's a waste of money. Don't do that. Don't do that. A waste of money. If everyone likes it, have hot sauce in every table though. Crystal Hot Sauce or Frank's Red Hot? Frank's Red Hot preferably. I don't like Crystal. Really? It's the same thing. It's not, it's not, it's not really the same thing. No, it's definitely. I eat more hot sauce than any of you. Crystal and, and can't taste anymore. Next week, my topic's going to be, \"Here's",
            "start": 168.0
        },
        {
            "text": "it's the same thing . It's not, it's not, it's not really the same thing. No, it's definitely. I eat more hot sauce than any of you. Crystal and can't taste anymore. Next week, my topic's going to be, \"Here's one thing of hot sauce and one thing of hot sauce.\" Let's tell them to play that game with me. I'm going to game with me. Kevin, write it down. I'm gonna forget. Someone was stupid enough, uh, to my, my one of my good friends actually, uh, my friend Kevin from college, uh, didn't believe that I couldn't tell the difference between Coke and Pepsi, and then didn't believe that I could tell the difference between Coke that had been expired and Coke that was just bought. And I'm like, \"You're out of your mind.\" Expired? Yeah, like he had Coke that went bad like three months ago, and I was like, \"I'm not drinking.\" He's like, \"It's fine, whatever.\" And then he like had, we had, I have pictures on my phone of like all these taste tests. Oh, crap. I'm thinking right now, I'm doing my, I'm doing taste test topic. I'm going",
            "start": 211.28
        },
        {
            "text": "he's like, \"It's fine, whatever.\" And then he like had, we had, I have pictures on my phone of like all these taste tests. Oh, crap. I'm thinking right now, I'm doing my, I'm doing taste test topic. I'm going to bring in multiple things next week . That's a really good topic. I like that. Alright, would you rather, this is an interesting one. It's a serious one, finally. Would you rather go back in time and meet your ancestors pre-180 0s, or would you rather go way into the future and meet your great-grandchildren? Future. Future. Yeah, crap, old people. I'd like, \"Who won every World Series?\" God, you're doing and make all. There's no coming back, I think. Oh, I just got to go. I don't want to go. I don't want, I don't like my ancestors. I mean, they're great people , but no, the future would be awesome. See what happens. Now, granted, there's always that concern you're going to go through the gate and it turns out there was an EMP and there's a bull that actually killed everybody and it's there and the monkeys rule now. Well, hold",
            "start": 248.2
        },
        {
            "text": "there's always that concern you're going to go through the gate and it turns out there was an EMP and there's a bull that actually killed everybody and it's there and the monkeys rule now. Well, hold on, hold on. Go back to the question again. Are we going to the future or are we just meeting our future people? Oh, crap. Way back in time . Okay, and meet your ancestors. Go way into the future and your great-grandchildren. We're going. Yeah, that's poorly phrased. They should have just said, \"Come back.\" Would you rather meet them or them? Why the crap would I even care? Either way, they're like three generations removed. I don't know who's after my grandfather. Why are they even a part of this equation? It should just be, would you rather go to the future or go to the past? That's funny that you say that because there's a, a sub-question on this one that says, uh, the real question is, would you rather travel to the past or future? Yeah, there you go. I mean, I'm gonna get there, be like, \"Oh, cool, you're my",
            "start": 285.04
        },
        {
            "text": "because there's a, a sub-question on this one that says, uh , the real question is, would you rather travel to the past or future? Yeah, there you go. I mean, I'm gonna get there, be like, \"Oh, cool, you're my ancestors. Neat.\" Yeah, anyways. Oh, you're my shitty little offspring. Offspring. Oh, right, it's the wrong way. So, yeah, hey, what up? I'm your great-great-grandfather. I did things on YouTube. Is that still a thing? Are my videos still up? How many views they have? Anyways, I'm going to go chill out and see what's happening. Did anyone make, is, are buffalo chicken burritos a thing?'Cause I'm sick of making my own. Thanks. Did Poo-Yie's ever put a buffalo chicken pizza on the menu? How did, how did all the Superman movies come out? Can I see those? Is there any good ones ? Did, did DC ever make a good movie? How many, how many decades do we have to go to get a really good Superman game? Tell me that hasn't happened yet. Alright, but I'd be terrified of opening the door into the future and yeah, it's just spores and crap that",
            "start": 322.08
        },
        {
            "text": "do we have to go to get a really good Superman game? Tell me that hasn't happened yet. Alright, but I'd be terrified of opening the door into the future and yeah, it's just spores and crap that kill you. No, that'd be cool. Maybe, you know what I'm saying? This is, oh, I'm sorry, Nick, go ahead. No, I was going to say, please, no, continue. My comment was complete. Now the whole show is ground to a halt because you, no, what if you were the one that brought the spores ? What if the spores had like, they had evolved? If I'm going back, yeah, that'd be the concern. Then I bring in things are not vaccinated for. Going forward, you would be in danger. You open it up and there'd be nukes and crap and all, all crazy crap. Scorpions. Probably nukes and scorpions. Scorpions like normal size scorpions or giant scorpions? Is this like Honey, I Shrunk the Kids? It's like Fallout. Yeah, like Fallout. Yeah, yeah. I think the scorpions are going to get, are going to have a big boost. I told you that my brother had a pet, my brother had a",
            "start": 364.32
        },
        {
            "text": "like Honey, I Shrunk the Kids? It's like Fallout. Yeah, like Fallout. Yeah, yeah. I think the scorpions are going to get, are going to have a big boost. I told you that my brother had a pet, my brother had a pet scorpion. 040 is really this year of the scorpion. I told, I told, I told that story on this show, I think once, that he had a pet scorpion. Yeah, what his name was? His name was Wellington. Wellington. Was that the end of the story? That's it. He just had a pet scorpion. He got it for Christmas. He never ate. He stabbed himself. He died after two months. Have you seen that video? Mhm. Jesus. You know, there's these people who like, nice people, I'm sure, but there's a scorpion in their house. It's not a huge one or anything , and they put a glass over it, and the scorpion figures out that it's trapped, so it just stings itself in the back to death. That's a, I can roll with that scorpion. That scorpion's got the right idea, right? That's my thing too. Just like, oh, you imprison me, and I just jump head first into the",
            "start": 402.84
        },
        {
            "text": "itself in the back to death. That's a, I can roll with that scorpion. That scorpion's got the right idea, right? That's my thing too. Just like, oh, you imprison me, and I just jump head first into the floor, break my own neck. Oh my God, can you guys imagine Greg doing that? No, I can imagine coming home and seeing Greg, broken neck on my kitchen floor, exploding. Broke it. He's just like, we don't have enough stuff. Kill me. Alright, so this one, this one is, I just went to Starbucks for five minutes. What are you doing? This one is brilliant, and I really need you guys to just think long and carefully about this one. Long, hard. Would you rather wake up naked and sore without any memory of the night before next to the Burger King telling you, \"You had it your way,\" or would you rather wake up, are talking the, the, oh, good lord, or would you rather wake up naked next to Ronald McDonald telling you that you were loving it? I mean, Burger King. No, McDonald, man. Yeah, no, that's a clown. That's next level for me, man. I'd",
            "start": 437.24
        },
        {
            "text": "oh, good lord, or would you rather wake up naked next to Ronald McDonald telling you that you were loving it? I mean, Burger King. No, McDonald, man. Yeah, no, that's a clown. That's next level for me, man. I'd rather get, have you seen the King? Now I know him. The King's creepy, but the King's creepy like we'd roll with him. He's creepy like you're creepy. The King. Yeah, no, you are creepy. You guys remember, remember Sneak King? Yeah, on Xbox. How can I forget Sneak King? The game of the year. Yeah, but like, no, like, I mean, think of it this way, honestly, with all due respect to Tim, the King is just a caricature of Tim because you imagine you remove, you remove the mask of the Burger King and it's just Burger King. It's the guy just like when you want as Halloween as yourself with a mask on your face. Yeah, I think you pull it off and he's just like, \"Hey, yeah, I wear that sometimes. It's what I do. I walk around like that too.\" I don't think I've ever seen you creep around like that. I do that. Okay, Creep King. Is that",
            "start": 480.48
        },
        {
            "text": "it off and he's just like, \"Hey, yeah, I wear that sometimes. It's what I do. I walk around like that too.\" I don't think I've ever seen you creep around like that. I do that. Okay, Creep King. Is that, is that what the Sneak King? Sne ak King. Yeah, Creep King. Creep King. I just remember that game on Xbox. They Xbox. I'm going Burger King just because I like Burger King more than McDonald's. Yeah, what? 100%. Yeah, I like Burger King better. The crap. No, you, you've heard they're big time Burger King fans. The Whopper. The Whopper. Here, what's surprising about you liking Burger King is that I like Burger King a lot too. Not, I don't really have allegiances when it comes to McDonald's or Burger King, but what I like about Burger King is their mustard is so potent. Yeah, I know. I don't , we, the Whopper. I order the cheeseburgers. The pickles taste amazing. Mustard and ketchup on point. Not cold. That's the other thing we need. Has anybody developed the technology just to have mustard and ketchup left out'cause I hate",
            "start": 525.68
        },
        {
            "text": "the cheeseburgers. The pickles taste amazing. Mustard and ketchup on point. Not cold. That's the other thing we need. Has anybody developed the technology just to have mustard and ketchup left out'cause I hate putting cold mustard and ketchup onto my warm. Was that when we talking about that in Kentucky about the whole Arch Deluxe or whatever it was called where they kept it separate? Giant McDonald's fail. This one's kind of morbid. It's very, it's actually implicitly morbid. Would you rather know the date of your death, mhm, or the cause of your death? Neither. Jeez. I'm gonna say date. Really? Yeah. Oh, that's bad news. I don't know about that. Well, then you would know it. It'd be over. I'd rather know. I'd rather know neither of them. I'm not choosing. But imagine, imagine you know the cause.'Cause if you know the cause, if you know the date, it's like, okay, it's going to happen today. If you know the cause, it's like, the cause is car crash, right? You're just like, crap. Well, yeah, like I'm thinking of it",
            "start": 565.92
        },
        {
            "text": "know the cause. If you know the date, it's like, okay, it's going to happen today. If you know the cause, it's like, the cause is car crash, right? You're just like, crap. Well, yeah, like I'm thinking of it that way. I'm thinking of it from personal enjoyment. No, you choke on a chicken wing. Greg. I eat chicken wings three times a week. The funny thing is that you think like, it's like Calvinism or predestination. Like you think that like, alright, I know I'm going to die from choking on a chicken wing. I'm never going to eat a chicken wing again. But there's going to be some sort of rendezvous with a chicken wing. You have that Destination-style chicken wing bounces off and kill. Yeah, there's an explosion. It like shoots out and then the bone goes through my heart. Yeah, or a giant chicken wing comes and chokes you. Just real naked chokes you. Alright, should when I go through the into the future to see it turns out chicken wings became self-aware and they're pissed. Yeah, they, I'd be, I would be there.",
            "start": 610.76
        },
        {
            "text": "chokes you. Just real naked chokes you. Alright , should when I go through the into the future to see it turns out chicken wings became self-aware and they're pissed. Yeah, they, I'd be, I would be there. Will Smith and I Am Legend. I'm the monster. Mhm. Patilla is really worried about what you're doing over there. Should we, uh, should we do a few more? Yeah. Oh, yes. Would you rather find true love or would you rather find $10 million? $10 million. Yeah, I agree. True love like fact, I guess. Yeah, like I, I, it's, it's undefined. I'm going to go with the love , which you can find on DistrictLines.com/KindaFunny. When can you find it? What year is that? 01? God damn it. No, vote for the, get the Moriarty Miller shirt. Boom. I'll tell you that right now, Tim, I was really impressed by that moment there. I was testing you and you came through with love. I want to, I want to tell people how happy we were last week. It was voting, and so many people were there. Presidential shirts from outside to the polls. Oh, really? Yeah, a lot of photos",
            "start": 643.88
        },
        {
            "text": "through with love. I want to, I want to tell people how happy we were last week. It was voting, and so many people were there. Presidential shirts from outside to the polls. Oh, really? Yeah, a lot of photos were sent our way of people voting in our shirts, which is amazing. Thank you. That is amazing. Our shirts.'Cause I don't believe that true love exists. We kind of talked about this like a couple weeks ago. Damn it, I wasn't on that episode. $10 million to me. You think that true love exists, huh? I know that true love exists. I know that companionship exists. You already said you take the money. I would take, I would take the money. Heart. You're already married. You already got the money. I have, I have my true love. That's what I was saying. Like, I'm already with, with the girl I love. But, but I mean, like, that's already, I don't have the money, so it's, I'm saying like, I'm without both. My conundrum isn't as dire, I thought. Yeah, okay, now you're putting interesting spins on it'cause I thought, yeah, picking money meant no true",
            "start": 697.84
        },
        {
            "text": "I don't have the money, so it's, I'm saying like, I'm without both. My conundrum isn't as dire, I thought. Yeah, okay, now you're putting interesting spins on it'cause I thought, yeah, picking money meant no true love. You, you wouldn't know it's true love. I guess that's, I think it takes the guesswork out of it. Yeah, I mean, I'm similar too. I found true love. Clearly, his name's Patilla. Patilla. Look at him stare at the camera. He just knows he's been raised to know the camera is on him. And then he's, well, now he's looking at Tim. People moving around. He wants to make sure. I don't know. I guess you all make good points. I do love Christine already, so maybe I could just take the money and run. But then maybe there's that nagging thing of like, maybe, maybe, maybe it's not true love and I could have had the chance to know something out there that's like, but maybe I would just learn that. Maybe I would just learn. Maybe there's something out there that's more loving, someone or something more true. Who knows? You don't know",
            "start": 735.24
        },
        {
            "text": "out there that's like, but maybe I would just learn that. Maybe I would just learn . Maybe there's something out there that's more loving, someone or something more true. Who knows? You don't know what this true love is. It's the scorpion. It's true. The giant chicken wing. That's a tough one. But yeah, if, if you can cop out and say that you're already in love, so it's over and you take the money, then sure, I guess I cop out and do that. I , I cop out. I know that's the problem. I think if there's no cop out, then I'd say true love. Here's an interesting one. Here it is. Alright, about time. This has been a boring, shitty segment. Would you rather go deaf in one ear or would you rather only be able to use the internet one hour per week? Deaf in one ear. Deaf in one ear. Deaf in one ear. I'm already hard hearing , so I don't know, I don't know the answer to that question. I, I, I like to, you know, I like music. I like playing music. I listen to music. You do like music a lot more than most people. Um, if it was both ears, I'd be, I",
            "start": 780.28
        },
        {
            "text": "don't know. I don't know the answer to that question. I, I, I like to, you know, I like music. I like playing music. I listen to music. You do like music a lot more than most people. Um, if it was both ears, I'd be, I don't know, that'd be a lot harder'cause like, I love music too. I wouldn't lose both ears'cause then it's just really messed up my life and makes it hard. Yeah, and then you, yeah, if it's both ears, then I, I'll, I'll lose the internet for a lot of time. Would you rather have $100,000 in real money or would you rather have $1 million in Amazon gift cards? Oh, man. Amazon gift cards. Gift cards. Yeah, I'm gonna go gift cards on that one too. Sorry. I mean, you can buy everything off Amazon. They Amazon Local. Pretty damn good. Yeah, only you can get his houses and stuff. Yeah, also there's gift card exchange. Random Nintendo things. They don't get along. Amazon and Nintendo. Yeah, it's upsetting. We're not missing much. Shocker. This is, this is also a thought-provoking one. Would you rather play Russian Roulette one time with one",
            "start": 820.56
        },
        {
            "text": "things they don't get along. Amazon and Nintendo. Yeah, it's upsetting. We're not missing much. Shocker . This is, this is also a thought-provoking one. Would you rather play Russian Roulette one time with one bullet? Well, would you play Russian Roulette one time with one bullet for $100 million? Oh, this isn't a would you. This is yes or no. Yeah, so, would you play Russian Roulette one time with one bullet for $100 million? So one in six chance that you'd lose. Yes. I think I would too. I would. Probably. You live with hella money or you're dead. Yeah, what's the difference? Yeah, what's the difference? Living without $100 million is as good as dead. This is what makes me laugh. Would you rather play World of Warcraft or kill yourself? What was that second option again? Would you rather play World of Warcraft or would you rather kill yourself? It's a random one. It has 3 00 and something votes. 300 something thousand votes. Oh, okay. Would you rather always know when someone is lying? No. Or would you rather always want to always",
            "start": 867.4
        },
        {
            "text": "kill yourself? It's a random one . It has 300 and something votes. 300 something thousand votes. Oh, okay. Would you rather always know when someone is lying? No. Or would you rather always want to always get away with lying? I mean, isn't that one way more valuable? Getting away with lying. Always want to get away with it? Is that what? No, you always get away with it. Oh, you always get away with lying. Oh, yeah, I do that. I don't want to think people are lying all the time. Or, and not even think, I don't want to know. Yeah,'cause then you're just telling me stupid stuff like, \"Oh, man, you want to come over? I can't. I got to go do this.\" \"Oh, you still want to come over?\" Why don't you just say you didn't want to come over? I feel like the first one just hurts you, and the second one you just get to kind of be a boss baller. Yeah, that's what baller feels like. That's what baller feels like. Let's do a couple more. Alright, just two, two more . Yeah, yeah. Tell me when, tell me when. When do you want me to stop? Would you rather always",
            "start": 916.28
        },
        {
            "text": "that's what baller feels like. That's what baller feels like. Let's do a couple more . Alright, just two, two more. Yeah, yeah. Tell me when, tell me when. When do you want me to stop? Would you rather always be this? No, I don't like that one. I'm gonna skip that one. I, I don't want, I don't want to waste that one. I don't want to waste on that one. Would you rather have an excellent relationship but terrible sex, or would you rather have an awful relationship with incredible sex? I choose the, the first one. Yeah, excellent relationship, terrible sex. Yeah, me too. Yeah, you don't want to be so,'cause eventually it all gets bad. Spoken like a true married man. I'm kidding. Yeah, I'm with that. Alright, we're gonna end it on this one. Final one. Would you rather have mermaids be real or would you rather have unicorns be real? Oh , crap, dude. Unicorns are sweet. Yeah, they are sweet. If you could own a unicorn, that's like, that's what I would get with my $100 million if I didn't blow my head off by accident. I'd buy",
            "start": 959.52
        },
        {
            "text": "be real. Oh, crap, dude. Unicorns are sweet. Yeah, they are sweet. If you could own a unicorn, that's like, that's what I would get with my $100 million if I didn't blow my head off by accident. I'd buy unicorn if it were real. Unicorns suck. What are you talking about? They suck. Would you rather have another sentient being who lives in the sea and has its own underwater kingdom, or would you have a horse with a horn? Oh, great. Yeah, because the, a series of assumptions about mermaids. The horse horn is going to, is, is going to, yeah, like it's going to rise up with its people one day and take over the land. No, see, no, this is going to be a dumb horse walking around, the thing on its head. Yeah, it's going to be awesome. I don't give a crap about horses. You put, unicorns aren't horses. Cheetos can ride them. Cheetos. Cheetos. I'm talking about unicorns right now. Cheetos into this. Cheetos. You don't bring Cheetos places. Places go to Cheetos. Yeah, that's what I've heard about him. Mhm. Have you guys seen the",
            "start": 1007.28
        },
        {
            "text": "them? Cheetos. Cheetos. I'm talking about unicorns right now. Cheetos into this. Cheetos. You don't bring Cheetos places. Places go to Cheetos. Yeah, that's what I've heard about him. Mhm. Have you guys seen the pictures of him lately? There's a lot of good photos. The pictures of him riding the unicorns. No, they exist. That's amazing. They do. Now you're talking the future talk. My God, at this future talk. Well, I, explain to me what a unicorn is then in your mind. In my mind? Yeah, it's, it's more of a just a being. It's a mythical being. Mhm . It's magical. You're not, you're not, so it's not a horse. Power that's underselling it. They're white most of the time. What are you? When the unicorns are real, what do they do? They just chill. They're super rare and you can own one of those and like an ocelot, too. Like only the, only time, yeah, a unicorn, the only time unicorns were ever cool was in Supergirl : The Movie when before the movie began, they did like whatever it was, Columbia Pictures, and the stupid unicorn. That was the",
            "start": 1046.04
        },
        {
            "text": "time. Yeah, a unicorn. The only time unicorns were ever cool was in Supergirl: The Movie when before the movie began, they did like whatever it was, Columbia Pictures, and the stupid unicorn. That was the only time unicorns ever mattered, and they're all dead to me now because Supergirl is dead to me. Man, they Harry Potter movie. Because I don't have it. According to Wikipedia, \"The unicorn is a legendary animal that has been described since Antiquity legendary as a beast with a large, pointed, spiraling horn projecting from its forehead. The unicorn was depicted in ancient seals of the Indus Valley Civilization and was mentioned by the ancient Greeks in accounts of Natural History. The Bible also describes an animal, the re'em, which some translations have erroneously rendered with the word unicorn.\" Now, give me notice the lack of horse, mermaid in that description. It's an animal with a horn. Don't we have enough animals with horns? Nope. No, we got a ram. I'm really, I'm really looking for, I'm really looking",
            "start": 1092.36
        },
        {
            "text": "Now, give me notice the lack of horse, mermaid in that description. It's an animal with a horn. Don't we have enough animals with horns? Nope. No , we got a ram. I'm really, I'm really looking for, I'm really looking forward to unicorns coming back, becoming endangered species, and them all living in zoos and being really miserable. Oh, and that's not going to happen to the damn mermaids. We're going to eat the mermaids. Are people that can speak? They have a kingdom of Atlantis. That's not going to stop the humans. They're going to be a delicacy. A mermaid. Well , they'll have weapons. \"Is a legendary creature with the upper body of a female human and the tail of a fish. Mermaids appear in the folklore of many cultures worldwide, including the Near East.\" Mermaids can't be dudes. I think merman. Yeah, I just looked up mermaid. Merman. Pop. Yeah, they'd have to be mermen. \"Mermaids appear in the folklore of many cultures worldwide, including the Near East, Europe, Africa, and Asia. The first stories appeared in ancient Assyria, in which the",
            "start": 1139.36
        },
        {
            "text": "Pop. Yeah, they'd have to be mermen. \"Mermaids appear in the folklore of many cultures worldwide, including the Near East, Europe , Africa, and Asia. The first stories appeared in ancient Assyria, in which the goddess Atargatis transformed herself into a mermaid out of shame for accidentally killing her human lover. Mermaids are sometimes associated with perilous events such as flood, storm, shipwrecks, and drowning things.\" What about it? Yeah, they're misunderstood. No, they're everywhere. You don't want to be. The mermaids live in a bad part of town. It's called the ocean. Crap happens. There's hurricanes and crap. People live in the Midwest. There's tornadoes. They're not mythical bad people. They're just, they live in the Midwest. That's something they deal with. Unicorns just, they live, they made the kingdom of the Midwest. They're just like, these people have made the kingdom of Atlantis. Is Atlantis have anything to do with the mermaid? I don't think that that's true. No, well, no, it's a sunken city, but I'm saying in",
            "start": 1179.68
        },
        {
            "text": "they're just like, these people have made the kingdom of Atlantis. Is Atlantis have anything to do with the mermaid ? I don't think that that's true. No, well, no, it's a sunken city, but I'm saying in this scenario it would be'cause that's where Aquaman, you know, city. Aquaman city. Land. Atlantis was just the, the sunken continent that was a kingdom of people, right? But the, anyways, and this in DC Comics, in pop culture folklore, the city of Atlantis, if, if it's still doing something down there, it's people who, it reminds me of Edgar Cayce a little bit. We should talk about Edgar Cayce one day on this show. Totally. Is he a unicorn? Give me something. Yes. Edgar Cayce was a, was a dude who used to have in, in the early 1900s, I think in the, maybe late 1800s, I think early 1900s, used to have visions about lost civilizations and like all, he was like, really, people should read, people should read up on him. Edgar C-A-Y-C-E is his last name, Cayce. And he used to draw maps of the world that like how they would look in 1900 or",
            "start": 1216.96
        },
        {
            "text": "and like all, he was like, really, people should read, people should read up on him. Edgar Cayce is his last name, Cayce. And he used to draw maps of the world that like how they would look in 1900 or 1950, 1960, 1970, about how like all this cataclysmic crap would happen all , all over the place. And he would talk a lot about Atlantis. Uh, people should read about him because he's a really weird and fascinating dude. I had one of his maps when I was a kid because I was totally fascinated with it. It was what the United States were supposed to look like in 2000 and didn't end up happening that way. And it was, it was all like messed up and he was just a totally weird dude, but used to talk about Atlantis a lot. I think, I think I, I think, I think not a lot of things that were totally wrong, but he talked about this other thing though. Well, no, he was totally wrong about everything. Uh , but he, he talked a lot about Atlantis, and I think he was actually one of the people that kind of in modernity and what about",
            "start": 1256.96
        },
        {
            "text": "this other thing though. Well, no, he was totally wrong about everything. Uh, but he, he talked a lot about Atlantis, and I think he was actually one of the people that kind of in modernity. And what about mermaids? I don't know if he spoke about mermaids. Just think how cool that would be. Another species that may wage war with us. Maybe we have to defend ourselves. They are an animal. No, no. And none of your rambling about this horse have any. You talked about the horse talking. I said, \"What do they do?\" \"They chill,\" is what you gave me. Yeah, we chill. We talk too. What do you think we're doing right now? Chilling and talking. Chilling and chilling and talking. Chilling and talking. See, I guess I don't like the fact that the unicorns would have to live on our land already. Yeah, but see, are they paying taxes? Are they having? Well, there's the Pegasuses, and then there's, don't even get me started on Pegasuses. The Pegasus, Pegasi, Pegasuses. That's the better of animals. Pegasus. Crap. Yeah, if you're talking about a Pegasus, I'll take",
            "start": 1294.68
        },
        {
            "text": "a Pegasus over anything. It's badass. A Pegasus with unicorn. A horse with wings for Christ's sake. Why is it a unicorn and not a unihorn?'Cause it's stupid. But it has one horn, not one horn. It's Greek. Why isn't it a uni-horse?'Cause it's not a horse. Nick, I thought you were on my side about. I don't know who, I don't know whose side I'm on anymore. Uh, by the way, just real quick, you search for Edgar Cayce. Second thing comes up is Edgar Cayce, Atlantis. Cool. But nothing comes up for Edgar Cayce mermaids. Damn it. Okay, too bad. Well, there you go. Thanks, Colin. That was a good one. Yeah, it was fun.",
            "start": 1335.72
        }
    ]
}