{
    "id": 438,
    "video_id": "njYP9uTlnys",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Female Orgasms - The GameOverGreggy Show Ep. 49 (Pt. 3)",
    "description": "Greg Miller has a bone to pick with the female orgasm.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1415779201,
    "duration": 1123,
    "transcript_chunks": [
        {
            "text": "Nope . My topic . My topic comes from a number of things. Okay. God damn it, Kevin. Hey, Greg. Yeah, I've got a special message from Dustin Ward. Greg prefers streaming at 144p. Thank you. Of course, that is the insult. Kevin insults Greg. It's one of our Patreon perks. We forgot to do it in the beginning of the show. Kevin texted me about it. My topic. I have a bone to pick with the female orgasm. You can't say that. And I know that's a little I have I have plenty of things to go. It's not It's not going the same. It's not going It's I know this sounds like a Tim topic. It's not though. It's a Greg Miller topic of wanting to be a better lover and a better person. All right. Uh this all comes from a YouTube video that I'm sure we're This definitely sounds like a Tim topic we're linking to right now. Have you heard of the Netherlands pop band Adam? No. No. Not yet. You You might have. I ran into their video. It has 14 million views at the moment on YouTube. What it is, they are an",
            "start": 1.1
        },
        {
            "text": "to right now. Have you heard of the Netherlands pop band Adam? No. No. Not yet. You You might have. I ran into their video. It has 14 million views at the moment on YouTube. What it is, they are an all female band. They put up their latest single and I can't get a date on this right now. So, I'm sorry if it's They've probably put out no other single since then, but they put up their latest single, Go to Go. Uh, and what they did for the the music video they put up is it is all three of the women singing the song like just sitting there or trying to sing the song while they're brought to orgasm by a vibrator. Now, you don't see the vibrator. I'll show you the photos there of the the screen caps of it. There, you know, it's from their shot tastefully and it's actually happening from the waist up trying to sing the song they wrote while they won't they don't say how they're being brought to orgasm. You imagine a vibrator. Some people claim they can hear a buzz or whatever. Exactly. And",
            "start": 53.84
        },
        {
            "text": "up trying to sing the song they wrote while they won't they don't say how they're being brought to orgasm. You imagine a vibrator. Some people claim they can hear a buzz or whatever. Exactly. And so as I'm watching this video, for the shock value of it, and it's not dirty at all. You can go see it if you're at a public library right now. Put it on. Crank up the **** speakers, man. Let your flag fly for Adam Netherlands pop duo or trio. Um what what annoyed me about all this is I'm watching this. I became incredibly upset that I will never know what that feels like. I thought about that a lot. This is my problem is, and this is what's so shitty about having sex with someone. Let me clarify that. So shitty about having sex with a member of the opposite sex is never really knowing what it feels like for that person. Well, then I have a bone to pick with the male orgasm. Yes, I'm aware. No, no, that this this is just my jumping off point for the conversation. This is frustrating for me.",
            "start": 94.56
        },
        {
            "text": "like for that person. Well, then I have a bone to pick with the male orgasm. Yes, I'm aware. No, no, that this this is just my jumping off point for the conversation. This is frustrating for me. And then and but see, I still And this is this is a Clerk's argument. It's in Clerks actually, you know, they Dante has this whole conversation about that there's no uh finesse needed to bring a a man to climax, right? Just need a a soft, preferably moist place. Preferably moist. Kevin Smith's a hell of a writer. Everybody tweeted, I'm telling him we love him. Um is and that's the thing, right? For a guy, I think when we think about getting a hand job or being brought to climax, right, it's simple for us, right? We've been doing it for years and years and years and years. It takes No, we just don't even think about it , right? Just make your hand like that and do that and it's over. Fine, great. The female thing, it's a pain. It's it I don't I don't know. It seems like And then this and the the",
            "start": 145.04
        },
        {
            "text": "even think about it, right? Just make your hand like that and do that and it's over. Fine, great. The female thing, it's a pain. It's it I don't I don't know. It seems like And then this and the the the the shimies and the shakes these people are doing. I don't do that when I'm getting a hand job or having regular sex. I guess what I'm about to climax. I like that all of this goes back to hand. I'm looking at you and we had the hand job converation not too long ago. This frustrates me. Does it frustrate everybody else? Then again, it's it applies to you because obviously you don't know what it means. Well, there's the whole thing that the female I mean, it's dumb. The whole like the female orgasm is a myth or whatever, you know? It's just been this like mysterious thing. It's not right. No, you heard it here first. Confirmation. Yeah. Uh, I just um I mean I think as far as anatomy goes, men are a little, you know, maybe it's a little easier to wrap your head around in there. Wrap your",
            "start": 189.36
        },
        {
            "text": "you heard it here first. Confirmation. Yeah. Uh, I just um I mean I think as far as anatomy goes, men are a little, you know, maybe it's a little easier to wrap your head around in there. Wrap your head around. Maybe not as much effort. Of course, a woman on the other hand might have to do other things to please herself. This is getting I feel like I'm like a really lame version of Dr. Ruth right now. I'm like this like Dr. doesn't want to just come out and say, \"How do you touch your vagina while having sex with a man?\" Twitchy. I'm just saying I I get your frustrations, though. I mean, I've often thought like, I wonder if they're the same. I wonder if it's I wonder if they feel the same. And that's the weird thing. I guarantee they don't. Really? How can you beat it just just because it just like the reaction seems different? Like it seems it just totally seems different. And like because I know I know even for the male orgasm, they're pretty much the same thing just different",
            "start": 230.88
        },
        {
            "text": "it just like the reaction seems different? Like it seems it just totally seems different. And like because I know I know even for the male orgasm, they're pretty much the same thing just different levels of intensity. Like sure, the difference between a great orgasm and a pretty like good orgasm because there's no bad orgasm. Um that orgasm suck. Those are all I mean it's it's the same thing. It's just more. You know what I mean? Um I I've had I would say I I can count on one hand the the amazing orgasms. What What do you mean the There were times where like I felt the like my muscle in my leg like shake and like my eye like twitch out those and that only happened like a handful of times and like that was on another level. But still it was on another level of the same thing. Whereas I feel like I talk to a lot of my female friends about this stuff a lot cuz I'm interested like these Tim topics on the show. Yeah, imagine them if I don't need to care about vulgarity and all that stuff.",
            "start": 283.44
        },
        {
            "text": "like I talk to a lot of my female friends about this stuff a lot cuz I'm interested like these Tim topics on the show. Yeah, imagine them if I don't need to care about vulgarity and all that stuff. things get used. Yeah, we really care about that here on the Game Over Ducky Show. I try to be respectable in front of people, but when it's just me and my friends, I'm not respectable at all. Yeah. And um or respectful. I'm I'm I'm respectable. I'm not respectable at all. But anyways, and I feel like all of their descriptions of orgasms are different. And I've heard multiple people say that like they're they can have 10 different types of orgas ms and they all feel differently and all this stuff. And like I know people that have never had orgasms. So, it's not that it's a myth, but there are people that haven't. And these are people that are sexually active trying to women specifically. Well, that's unfortunately as well. I think I think it's it's a little more tricky. And I think that",
            "start": 333.84
        },
        {
            "text": "people that haven't. And these are people that are sexually active trying to women specifically. Well, that's unfortunately as well. I think I think it's it's a little more tricky. And I think that girls are raised in a different way than boys. I mean, boys, it's very obvious. It's there. They're constantly growing up. If you see little kids, they're just constantly like And girls do that, too. But I think that it's it's more taboo for a girl to be taught about herself and how to make sure she's going to be okay and happy and bad. I think I think that's changed. So, a lot of women have just been weird. I I mean, I've had female friends who didn't know how to, you know, achieve pleasure themselves and then they start having sex with men and then the guys kind of like, I don't know. Yeah, I just assumed it's every all my magic and this isn't working. I've been really surprised because like I talk to I talked to our good friend Nick Scarpino a lot the producer seducer and he's often",
            "start": 374.8
        },
        {
            "text": "I just assumed it's every all my magic and this isn't working. I've been really surprised because like I talk to I talked to our good friend Nick Scarpino a lot the producer seducer and he's often blown away by how open my female friends are when it comes to this type of stuff cuz he's like dude when I was growing up like girls didn't talk about this **** and girls girls just didn't do that and they always thought I was crazy and stuff all my friends masturbate all the time constantly I was trying to think of a good all the time all the time just won't stop right now no talking like I got to rub one out like it's like they're dudes Like the idea of what dudes used to be or whatever, like I don't think there's any difference anymore. Like I like if you were to ask me between my core group of friends, like who masturbates more Vincent or whatever. Are these real names? You're predicting people? No, I'm just saying names or some girl's name. Sure. The same **** I think it's the same.",
            "start": 418.16
        },
        {
            "text": "of friends, like who masturbates more Vincent or whatever. Are these real names? You're predicting people? No, I'm just saying names or some girl's name. Sure. The same **** I think it's the same. Interesting. That's fascinating because I don't feel like it was like that when we were growing up. Colin, I don't know. I mean, I I I think that that there, you know, for heterosexual couples, like you were saying, I think there's a mystique for the man with the woman because, again, the orgasm is is undefined. And I think that that's there's something about that that's very interesting because there's two things about it that's interesting. One is, you know, as you grow older and and you know, you you you're in different relationships and stuff, you experience, I think, the way that different girls get off, which is interesting in of itself. I think in my opinion, you know, and also like the different levels like you're saying of like it seems like there's a huge like there's a huge",
            "start": 459.68
        },
        {
            "text": "girls get off, which is interesting in of itself. I think in my opinion, you know, and also like the different levels like you're saying of like it seems like there's a huge like there's a huge level in pleasure that you can that that builds up for some women that that isn't there for the man. I think the man is like a is a onetrick pony. I think the woman's body is much more refined. I think it's nuanced. It's nuanced. I think you have to understand it more. I think women are very unique um compared to men. And I think that um you're like a snowflake. Well, I I just think in I think in in in a sexual sense, I think that like, you know, women just they're just it's just more complicated. Um I actually my personal opinion is that the pleasure that they get when they're able to achieve it is much better than the pleasure that the men get. I think we just seem Yeah, exactly. We're assuming it seems like it is. They the reaction is certainly that of more pleasure, more sustained pleasure,",
            "start": 501.76
        },
        {
            "text": "much better than the pleasure that the men get. I think we just seem Yeah, exactly. We're assuming it seems like it is. They the reaction is certainly that of more pleasure, more sustained pleasure, longer pleasure. So that's that's where I get into this and I'm just, you know, throwing myself in the bus. I get into this is are they just over dramaticizing the whole thing? Maybe, you know, maybe because they're rarer because like I I would I am often shocked that it feels as good as they're making it seem like it is cuz I'm like I know I'm not doing that good of a job. You making it seem like I'm doing I mean there there's you're maybe I am. You were talking about the number of nerves in your gut. There what is it double the nerves in the clip than there are in the penis? Isn't that something? I'll go to the Google for that. But that that is a true statement that there's more nerve endings on the women's side. So maybe that's Women are also a little less inhibited with their",
            "start": 544.08
        },
        {
            "text": "something? I'll go to the Google for that. But that that is a true statement that there's more nerve endings on the women's side . So maybe that's Women are also a little less inhibited with their vocalizations because a guy might think, \"Oh, I'm going to look stupid if I'm like, you know, the frog, right?\" So women, you know, I don't know. It's kind of more of it's it's known and even watching porn or whatever, women are the more the vocal kind of, you know, I don't know, maybe men are also a little insecure about how they maybe maybe it has to do with sound or Yeah, it has to do with like norms like societal norms as well, right? But yeah, I just feel like it's more complicated for the woman maybe. Damn. Because the body is just a little more complicated with the woman on the **** button. Yeah. Uh **** has 8,000 nerve endings. The male penis has 4,0 00. So maybe so you know so theoretically and while the **** is quite small as powerful sensations can spread across a woman's",
            "start": 586.32
        },
        {
            "text": "button. Yeah. Uh **** has 8,000 nerve endings. The male penis has 4,000. So maybe so you know so theoretically and while the **** is quite small as powerful sensations can spread across a woman's pelvic area by affect by affecting 15,000 other nerve endings. Yeah. I think I think internet I think it's just I think it's just I think that the parts are just obviously very different and I think that it's frustrating. I don't think it's frustrating at all. I think it's fascinating. This we've had a topic I think on before. What would you what would you Yeah. Was it would you bang everybody if you were a girl? if you switched into a girl's body for whatever. And I said, \"No, the first thing I would do is masturbate cuz I want to know what everything feels like. I want to know what feels like. You got to learn how to drive the car before you put your right now. I don't have a license. They just put me behind the wheel and say I'm like I'm smashing into mailboxes. I don't know. I'm stuck",
            "start": 633.76
        },
        {
            "text": "You got to learn how to drive the car before you put your right now. I don't have a license. They just put me behind the wheel and say I'm like I'm smashing into mailboxes. I don't know. I'm stuck in ditches.\" Right. That's how I feel always. Now, for the record, but you gave me the evil eye cuz you saw I was brewing on something over here. You were saying it's obvious when you're a little kid. I used to think that when you got an erection, that's when you wouldn't be able to have sex. Oh, that's funny because like you watch like I remember watching TV or whatever with my parents, all these wrong, you know, sitcoms and yada yada yada. I think even there's a Seinfeld film, but I don't think I think it's a good example of what I'm talking about, but I was too old for it at that point of where like George is, you know, when George couldn't get an erection , right? So, he couldn't have sex, so he's sitting there in bed and he's like acting like he's going to hit it and he's all like",
            "start": 671.28
        },
        {
            "text": "of where like George is, you know, when George couldn't get an erection, right? So, he couldn't have sex, so he's sitting there in bed and he's like acting like he's going to hit it and he's all like embarrassed or whatever. In similar situations, like probably like Married With Children and yada yada yada. I assume that when it went hard, that was a problem. cuz I didn't know what I was doing in the beginning. Like something's wrong. Yeah. I thought it meant I had to pee. Yeah. Yeah. That's what it often does. I was going to say maybe my babysitter told me Kevin's mother. That's awkward. True story. True story of Kevin's mother. So, Greg, I I don't think, you know, in closing, I don't think that there's anything to be frustrated about. I think that you have to enjoy and embrace the mystique of it. try to discover the nuance of the lady that you're with and really kind of delve into the adventure, Greg. Don't shy away from it. Yeah. Don't shy away from it. Yeah. And just think that",
            "start": 708.32
        },
        {
            "text": "of it. try to discover the nuance of the lady that you're with and really kind of delve into the adventure, Greg. Don't shy away from it. Yeah. Don't shy away from it. Yeah. And just think that there's no there's no adventure with you because you're just another man, right? With the same **** one trick that you do, you know? Yeah . The woman is the real rare breed that needs to be taken care of. Sure. In this in this respect. Well, that see and that's what I always talk about, you know, to quickly have you withdraw your a comment. I always talk about this show I like to read I like to read my porn. I don't like to watch porn. I like to read stories about porn. I like the literotica. And the reason I like it is because it's this I didn't all put together till right now, believe it or not, is and the reason I like it is because it's usually written from a female's perspective of her enjoying sex. Now, again, she's not giving me it's not like a manual. If she was giving me more manual",
            "start": 747.04
        },
        {
            "text": "is and the reason I like it is because it's usually written from a female's perspective of her enjoying sex. Now, again, she's not giving me it's not like a manual. If she was giving me more manual instructions on everything I should be doing, that'd be helpful. First you must it was great sex because this happened first and then that's crazy though because I mean for dudes it really is kind of straightforward. Guys are very visual like I mean I'm not that was a stupid sound. I mean no that's the sound we make like it's right you see the visuals. There's visual and I was a great man. There's a defined Melissa we need a generic man voice. Perfect. You got the job. I think there's a defined end to the male orgasm, whereas the female orgasm end is undefined. Yeah, there's a bunch of different whole bunch of different **** Yeah, you can. Yeah, like I don't even want to get into it. Yeah . Yeah. I mean, really, this could I mean Yeah, we could be here all night. We could be here all",
            "start": 792.24
        },
        {
            "text": "whole bunch of different **** Yeah, you can. Yeah, like I don't even want to get into it. Yeah. Yeah. I mean, really, this could I mean Yeah, we could be here all night. We could be here all night. Where's the ladies in the house? Get in there. They're both in their bedroom. They don't come on camera. They don't come on camera for good reason. Well, I didn't. What was Oh, god damn it, Tim. I would have never ever put that together. You're horrible. I got a bone to pick. They're not going to come on camera. Relax, Greg. All right, you **** pervert. Uh, this is as good a place as any ever. Any any and ever. Before we jump to another topic, the final topic to talk a little bit about what we're going to do on Patreon for that because you remember we put out that Patreon exclusive episode. Yes. You people loved it. Thank you so much everybody over at patreon.com/kindaf unny had a huge great time with it. Huge time with it. That's not a huge time with it. Did you get there was there was",
            "start": 835.68
        },
        {
            "text": "Yes. You people loved it. Thank you so much everybody over at patreon.com/kindafunny had a huge great time with it. Huge time with it. That's not a huge time with it. Did you get there was there was there was a huge ground swell of enjoyment over it. Lots of people joined Patreon to get it lot. So we have a lot of new patrons out there. Thank you so much for that. Uh and we talked about in that episode that we were trying to figure out what we're going to do going forward for it. So now it's time to talk because then we're like well maybe we'll do an exclusive topic every week. Then we saw how much people loved the one event episode where they were like, \" You were so laid back black.\" Laid back. You can tell I took a week off. I I tried to do I tried to do a news video today at IGN. W That was rough. You can tell I have not read from anything in a long time. We were laid back. And so we want to give that kind of giant thing again. So what we're talking about is doing another Patreon",
            "start": 882.0
        },
        {
            "text": "was rough. You can tell I have not read from anything in a long time. We were laid back. And so we want to give that kind of giant thing again. So what we're talking about is doing another Patreon exclusive episode end of November because that's the month we're in now. I'm looking at you to make sure I I don't screw this up. End of November. That last week of November. one episode, another big but the one episode like last time was just normal episode where we do the four topics . What we're trying to do now is a little something different cuz you guys liked how how laid back that all was and for this one we're going to do one topic for the hour and a half duration, right? But it's going to be a bigger topic. Sure. An umbrella. Yeah . So instead of say Tim, what's your topic? We'll say Tim, what's your story? Or something along those lines. Yeah. And it's just like we'll have a topic and each of us will tell a story about it or something. I don't know. We haven't really thought too much",
            "start": 921.44
        },
        {
            "text": "what's your story? Or something along those lines. Yeah. And it's just like we'll have a topic and each of us will tell a story about it or something. I don't know. We haven't really thought too much about this, but it's something that we want to talk about for more than 20 minutes. Shocking. I want to bring her to speed. The show develops in front of them every each and every week here. And tweet at us also and let us know if you have any ideas for these crazy topics. Tweet at me, Tim Gettys, and let me know what your big topics are and we'll have big conversations on them. Yeah. And probably not next week, but the week after that, we'll do the next uh Patreon hangout. Our third I'm telling you that. I'm not asking. Don't look off from the distance. Don't worry about what's happening. This is something else I wanted to bring up about you that I never noticed. Usually I I inhabit your chair. Not it's it's just cursed in general. The cursed chair. It's not literally this chair that's",
            "start": 962.4
        },
        {
            "text": "is something else I wanted to bring up about you that I never noticed. Usually I I inhabit your chair. Not it's it's just cursed in general. The cursed chair. It's not literally this chair that's cursed. It's just the guest chair. Okay. So regardless of what chair you sit in, you're cursed. Fantastic. I hope you're not going on a scooter across railroad tracks anytime soon. Not anytime soon. God, you're really playing up the curse angle. It's something cool. I'm a I'm a I'm a positive human being. I believe in manifesting only good. So Okay. I've never noticed before, Colin, that when you talk on the show or tell stories, you kind of just look at the mirror. Yeah. Well, I that's the way I see Tim and usually you show. Oh , that's f'd. What are you looking at? You look at Now that Kevin's here, it's so hard not to just look at him cuz before he was here, there would be times where we're saying something and I would look at the camera because I knew he watched and it would be for him. But",
            "start": 999.44
        },
        {
            "text": "it's so hard not to just look at him cuz before he was here, there would be times where we're saying something and I would look at the camera because I knew he watched and it would be for him. But now that he's there, it's it's hard to And he has such a great smile. He's a great looking. How have the How have the photoshops been the best? Yeah. Remember, send photoshops to Tim here of what you think Kevin looks like. People are tweeting anyone named Kevin. Just pictures of them. I've seen Kevin Arnold, Kevin, every Kevin. Every Kevin Kevin from uh Home Alone, right? Was one of them. Yeah. Make sure you send them to Kinda Funny Vids as well. So, we're getting them on Twitter. Yeah. Like this. I was playing with the door the other day cuz I was trying to find something. But when the doors are shut, people can't see them. And then we have in California is a weird thing where like all the **** closets are mirrors. I have no idea why the **** anything is like like why you'd even",
            "start": 1036.08
        },
        {
            "text": "are shut, people can't see them . And then we have in California is a weird thing where like all the **** closets are mirrors. I have no idea why the **** anything is like like why you'd even want that. But they're here and everywhere I've ever lived in California. And it makes a good way for me. I can see Nick fine and I look at Nick a lot. But I feel like I'm not engaged with you and especially Tim because I'm angled this way. So it's my way to like engage even though he probably has no idea I'm looking at him half the time. Yeah. And uh and and you because you're right next to me. Nice. So it's very useful. You should try it. Okay. I like my Well, I look at the camera a lot. I talk to the people. Oh, I don't I don't I try to act like the camera's not there. Very nonchalant, Greg. Very nonchalant. Earlier today, I said, \"I'm Nick.\" Cuz I was adjusting the knobs. I didn't say it. I I malled at it. Yeah. They knew. They knew. They knew cuz they're best friends. [Music]",
            "start": 1071.36
        }
    ]
}