{
  "id": 451,
  "video_id": "ZDl3uK5-_OM",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Woman Suffers From Too Many Orgasms - The GameOverGreggy Show Ep. 51 (Pt. 4)",
  "description": "Tim Gettys reports on a news story about a woman suffering from orgasms.\n\nGet free unlimited knowledge for 10 days at http://www.lynda.com/kindafunny \n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1417075202,
  "duration": 860,
  "transcript_chunks": [
    {
      "text": "[ Music] Tim, yes, what's your topic while I try to find emojis for tacos? So my topic is an article I read on BuzzFeed today. It's a bomb. BuzzFeed, one of my favorite websites. We love it. You love BuzzFeed. I do a lot. I like it. You love it. This woman suffers from six hours of orgasms a day. She's a mother of one, a 10-year-old son , mhm, and she can suffer from anything up to 180 orgasms in two hours. This is a real thing. This is not, you got this from Buzz, not ClickHole. So she do, no, this is BuzzFeed. This is so suffer is the thing that made me click on this. I was like, I am interested in this. And now first off guys, I want to just say BuzzFeed is not clickbait. Clickbait is when you click on something, they're tricking you. If it's a trick, I wasn't tricked. I wanted to click on this because I was like, suffer, how is it suffering? They explained it. I got what they told me. So you now agree it's suffering now you understand ? Yes, which is crazy me because I'm like, what are you talking about suffering? This woman",
      "start": 1.1
    },
    {
      "text": "how is it suffering? They explained it. I got what they told me. So you now agree it's suffering now you understand? Yes, which is crazy me because I'm like, what are you talking about suffering? This woman just at any point things this this happens to her and she can't control it and she'll be in situations where it's incredibly awkward and she'll feel bad about herself. For example, when she goes to her son's school, she feels inappropriate being sexually aroused around young children, of course, and she feels like a horrible person because of this and it drives her crazy and she can't just be in normal functioning situations because she'll constantly be getting these intense orgasms and like there was like GIFs and stuff showing it. It's just like, damn, like she's trying her best, like you see her trying her best to like just keep her composer composure, but she just can't and that's scary. Yeah, what are you guys thoughts on this? And then I have a bunch of other questions. My my thought on this is",
      "start": 54.4
    },
    {
      "text": "her best to like just keep her composer composure, but she just can't and that's scary. Yeah, what are you guys thoughts on this? And then I have a bunch of other questions. My my thought on this is that luckily I watched as a kid a show called The Montel Williams Show and I believe he had someone of a similar variety on in that her story of like for you to bring it up or like and be like suffer like I immediately am right there. I can totally understand. I forget I forget what was happening physiologically to make this happen bi biologically to make this happen but yeah, like what a horrible thing. I mean, I think about it like just I mean again, this goes back to a topic we did in the GameOverGreggy Show. I'm sure Kevin's annotating to it right now where I was saying I wish I understood from a literal perspective what the female orgasms felt like from a female's perspective, right? But I mean if you try to even remotely flip the script, right? If it were just how awkward is it when you get an erection",
      "start": 96.76
    },
    {
      "text": "perspective what the female orgasms felt like from a female's perspective, right? But I mean if you try to even remotely flip the script, right? If it were just how awkward is it when you get an erection when you don't want an erection but you have an erection all the time like around a kid school, you're talking to somebody, you're trying to be an adult, a professional, whatever, you're trying to take care of your 10-year-old kid, like super awkward. Like I can only imagine. Yeah, true story about Montel Williams. Thank you, please. Montel, love up here. He served my my mom's long-term boyfriend, I just call my stepdad, uh, and him served in the Navy together. Really? Yeah, I would not have pegged Montel Williams as a Navy man. Are they do they keep in touch? I don't think so, no, but I mean they they at some point we serving together. What up Montel? How awesome would it be if someone Montel called you and was like, hey, what was the name of that bar we were at in Japan and you're like the some thanks man, thanks",
      "start": 139.08
    },
    {
      "text": "we serving together. What up Montel? How awesome would it be if someone Montel called you and was like, hey, what was the name of that bar we were at in Japan and you're like the some thanks man, thanks and that was it. That's all you and you hadn't heard from him in like 20 years. You're not going to hear from yeah, it's totally suffering that would suck. I now before I said if I had I read that headline differently it was just like woman has fact that she gets this would you still say that no no I mean if you're happy with it that's great if that's what you want to do and and you can function in life like that sure that's fine then it's not you know it's only debilitating if it's debilitating if it gets in the way of the life you want to lead but it sounds like this is something where she can't it's hard for her to function much like any other sort of handicap or debilitating disease and in that regard it sucks it put yourself in her shoes mhm it would suck if you were a guy and that had to",
      "start": 177.08
    },
    {
      "text": "it's hard for her to function much like any other sort of handicap or debilitating disease and in that regard it sucks it put yourself in her shoes mhm it would suck if you were a guy and that had to happen. I was going to say it would be a lot worse if you guy you'd literally be dehydrated for like you'd have to be just constantly swallowing water. So another question I had for you guys was obviously you guys if if this could happen to you would you do it? It's like obviously the answer is no no but what if it was for a limited time like for one day would you do this for one day? No, yes I would do I get anything or is it just day just you would know what it feels like two hours of orgasms? I would do it for one day sure I'm fine I'm good know orgasm feels like what two hours of it is I know we're doing guy orgasms right guy orgasms are better when there's like you build them up what if it's like a tantric orgasm so it just builds for two hours then bang you're done you fall asleep for the",
      "start": 219.12
    },
    {
      "text": "doing guy org asms right guy orgasms are better when there's like you build them up what if it's like a tantric orgasm so it just builds for two hours then bang you're done you fall asleep for the next two you shoot a bullet through the wall that's kind of you're talking about paint paint the room in a new color white I like how on the the Patreon exclusive episode I said something you're like oh I'm have to wait this this is way more vulgar you just said is way more V you were reading a sex story from lerotica where every other word not true I love how he just paints everything he he's there but Nick is only ever with us 10% of the time of the word lerotica so now any I'm trying to sell people on this Patreon exclusive episode I definitely I definitely tell sexual stories that I read off the internet but it's not Literotica it's similar to when you're like oh and you guys were going to order pet cheese we order PES Wells you don't even **** know what happens in this house I'm I'm on a",
      "start": 259.88
    },
    {
      "text": "internet but it's not Literotica it's similar to when you're like oh and you guys were going to order pet cheese we order PES Wells you don't even **** know what happens in this house I'm I'm on a strict I'm want to St no stop keep throwing the mic down and hitting Portillo in the eyeball you hit him right in the eye like I I want to know let's let's unpack this yes I want to know why this happens to her and if there's a way to cure her all right she was diagnosed with the condition 3 years ago and says it's ruining her life she developed it while shopping for groceries she suddenly found that everything she everything she saw smell touched saw smell or touch turned her on it made her panic she fell down and began to have multiple orgasms on the floor She somehow managed to get home when she continued to orgasm into the evening and she goes on to say it's embarrassing confusing and humiliating that's falling the grocery store yeah so what are the doctors doing for they have to do",
      "start": 305.12
    },
    {
      "text": "she continued to orgasm into the evening and she goes on to say it's embarrassing confusing and humiliating that's falling the grocery store yeah so what are the doctors doing for they have to do something or I mean let's be honest grocery stores are embarrassing humiliating and confusing most of the time anyway you been to a Safeway lately tack on an orgasm on top of that it's just the worst thing on the planet don't look at me like that Greg it was a funny joke I was waiting for a com it was slightly funny it was good no you made Colin laugh Colin doesn't laugh at anything he does he laughs at me more than you I just want you to put that out there it's on average Colin's sick of my stick we've been together quite a while that's cuz your stick generally just revolves around you rhyming two words that you think is funny and then you laugh for 55 minutes while the rest of us continue the podcast it's good though was fun doctors don't have a cure and she's upset about this yeah what's",
      "start": 351.44
    },
    {
      "text": "two words that you think is funny and then you laugh for 55 minutes while the rest of us continue the podcast it's good though was fun doctors don't have a cure and she's upset about this yeah what's the cure that's rough if there's like no hope for her yeah and she like every day without fail it just happens she had to quit her job and just you have to go on disability for that yeah yeah are we paying for this that's the worst part of it we're paying for this now I mean I don't mind paying for this oh I do I do you got to figure this down luck want what do you want to do she got a 10-year-old son to take care of this is that's the **** X Factor now the 10-year-old son because eventually he's he's not quite there yet but he's of age where like people are going to find a people are going to find out who he is his friends are going to come over like when they're 14 15 know when you're like real like real getting when they're real people yeah but like when they're getting like you know",
      "start": 390.12
    },
    {
      "text": "to find out who he is his friends are going to come over like when they're 14 15 know when you're like real like real getting when they're real people yeah but like when they're getting like you know like a 14-year-old just turn on by everything they do rub up against the mom occasionally just for just to see what happens just like see like you know like oh your mom's the mom that has orgasms all the time and well she was saying that like people would like will find out and we like look at her and she says it's **** the worst thing ever that turns around too probably and it's it's just it's crazy man like so for for dudes it's a little it's Messier but like if we took away that aspect of it and like if things were just like cleaner it just was a feeling and less of a like product cause and effect like I would definitely want to go a day and just feel how that is I think but I think after like the third or four one you'll be like I'm so done with this I don't need anymore probably",
      "start": 431.2
    },
    {
      "text": "and effect like I would definitely want to go a day and just feel how that is I think but I think after like the third or four one you'll be like I'm so done with this I don't need anymore probably you probably be so exhausted cuz I mean think about those times when you like I don't know if you guys have had this but there are certain instances where like you meet someone and you're so excited by them that you do it mult you'll have sex multiple times in one night yeah and then the by the third time you're just like we're just doing this to say we could yeah but we're just going to tell this story one day at a dinner party everyone's going to we're cool at a dinner party at the at the fancy exactly the fancy dinner party you brought your wife your brought theong Li yeah I did let tell this time I **** a girl three times we were so into each other but see I feel like that's the the reason that you're tired and like there's any pain is because there's you know a lot of physical ****",
      "start": 470.72
    },
    {
      "text": "time I **** a girl three times we were so into each other but see I feel like that's the the reason that you're tired and like there's any pain is because there's you know a lot of physical **** going on a lot of things banging against each other that's how sex works right yeah um but I think if you're just chilling and it's just happening like I don't know how tired you would get oh you'd be tired well you'd be like emotionally tired different type of tired it would be like a mind game you wouldn't know when it was going to happen freak you would just feel this table and just get wrecked just every two seconds let's go back to Colin's orgasm noise ah you is that what do you hear that a lot yeah oh Colin's at it again it sounds like it's from the hallway where he's naked how come when you orgasm it sounds like a baby hawk that's really cool that was like Big Bird Mickey Mouse oh shout out to Mickey Mouse by the way it's his birthday today happy birthday Mickey Mouse you",
      "start": 510.16
    },
    {
      "text": "come when you orgasm it sounds like a baby hawk that's really cool that was like Big Bird Mickey Mouse oh shout out to Mickey Mouse by the way it's his birthday today happy birthday Mickey Mouse you fictional you there you go that sounds rough I'll be interested to follow the story and see if I'm sure there's some like doctor that is going to get to the bottom of this yeah yeah I I hope okay the the wonders of modern science can cure Ebola and This Woman's no okay absolutely not we're just we're getting close no I don't think so I think we're just figuring out how to manage it okay good it's a virus isn't it yeah we can't cure viruses yeah I thought Ebola was just like a really really really bad version of like the I don't know I'm not a doctor I I it's hard to believe but I'm not you sound like a doctor you're smart like a doctor it's cuz I read Wikipedia and see like that it comes full circle yeah it's true you're welcome ladies and gentlemen that's the GameOverGreggy Show each",
      "start": 556.8
    },
    {
      "text": "sound like a doctor you're smart like a doctor it's cuz I read Wikipedia and see like that it comes full circle yeah it's true you're welcome ladies and gentlemen that's the GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bringing a random topic of conversation for your amusement if you like that we post the whole show for you up on patreon.com/kinda funny each and every Friday along with Bandcamp and Vimeo however we charge over there if you don't think we're worth your money no big deal don't worry about it go to youtube.com/kindafunny where we put the show up topic by topic day by day until the whole thing goes live on Friday for free as well as SoundCloud iTunes Stitcher Windows phone Android stuff Beyond Pod all those we'll just start saying podcast Services of your choice specifically though SoundCloud and iTunes those are the ones that I want to review us there we're new we need help getting you guys been great there's",
      "start": 603.04
    },
    {
      "text": "start saying podcast Services of your choice specifically though SoundCloud and iTunes those are the ones that I want to review us there we're new we need help getting you guys been great there's been a lot of great comments and reviews I don't know if you guys have seen the iTunes reviews oh they're really good good people people saying good things it's good we're at five five stars holy crap yeah we're doing really well there's no place to go but down from there uh in terms of other things to keep your your Noggin peeled for I don't know peel your Noggin no uh Fall Leader continues to go we have a new episode this week right now what you don't like that one Nick I'm put on I'm putting you on task you ready MH if you're listening to this early when Fall Leader goes live the next Thursday it'll be a Tim episode and there'll be a new shirt on districtlines.com/kindafunny the next Thursday is Thanksgiving right care about that no no okay people are watch you you're all you still",
      "start": 653.88
    },
    {
      "text": "it'll be a Tim episode and there'll be a new shirt on districtlines.com/kindafunny the next Thursday is Thanksgiving right care about that no no okay people are watch you you're all you still have computers at your house right come show we a lot of European and Canadian listeners too that oh it's me a European listen a a governor that couldn't give a flying **** less Chim I need a **** I read someone today I read someone to with a couple with a couple thumbs up saying your your accent your British accent is offensive and uh they want you to stop it's actually and I want you to stop with it because it's becoming it's just becoming more and it's Borderland racist that's what it is Borderland Borderland racist Pitchford rode in and said it is Borderlander let me know in the comments ladies and gentlemen if you want me to keep or lose the European SL Australian SL New Zealand SL whatever country I'm not sure British it's just British just like hard remember the whole joke was that",
      "start": 696.56
    },
    {
      "text": "and gentlemen if you want me to keep or lose the European SL Australian SL New Zealand SL whatever country I'm not sure British it's just British just like hard remember the whole joke was that I did it to offend I did to offend and make Kezza mad she Scottish exactly she wasn't even offending but then of course the oi is completely my Australian accent that I used to do on Games Scoop for Rupert Murdoch the whole thing is a long running inside joke Cinematic Universe exactly it's very much let me know in the comments if we should drop it keep it going so so forth also the shirt that's coming you guys are going to want this one you've been talking about it for a while request you want for sure so stay tuned for that keep in mind again if you're the Patreon person listening this early the Patreon exclusive episode of the GameOverGreggy Show Goes live Thanksgiving week as well I guess we'll put it up on Wednesday to try to keep it away from Fall Leader keep it away from everything else",
      "start": 745.56
    },
    {
      "text": "patreon exclusive episode of the GameOverGreggy Show Goes live Thanksgiving week as well I guess we'll put it up on Wednesday to try to keep it away from Fall Leader keep it away from everything else keep it away from all right so it'll go up Wednesday um it's if you gave a dollar if you gave a million dollars it doesn't matter you get it for free enjoy yourself go to lynda.com/kindafunny to get a tutorial for one of these things these people keep talking about make yourself better today.com P's got a new Bark Box video up go watch that don't tell him he hasn't we haven't recorded yet he doesn't understand that part he only when he sees the box he understands the big deal he knows behind those BAC eyes a flare late no not going to be no it's very late it's not that late yet Trel's asleep I guarantee it you said last night you came out and reprimanded me or you reprimand me you came out shut the door and I thought oh you guys are asleep and then I came on I heard you laughing like an",
      "start": 783.36
    },
    {
      "text": "I guarantee it you said last night you came out and reprimanded me or you reprimand me you came out shut the door and I thought oh you guys are asleep and then I came on I heard you laughing like an **** in there you weren't asleep nobody's asleep was a laughing you were saying I don't know if he was laughing guys ladies and gentlemen it's been our pleas tell me to be quiet oh ladies and gentlemen it's been our pleasure to serve you until next time keep it locked on [Music] Patillo look at the camera he doesn't know what's happening he doesn't understand look at this little blinker eyes of fear",
      "start": 822.08
    }
  ]
}
