{
    "id": 10,
    "video_id": "GTv8lq-Jxi4",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Homemade Spaghetti Sauce: A Conversation with Colin",
    "description": "Colin's part Italian, so today the topic at hand is spaghetti sauce. Will he reveal his family secrets?\n\nLeave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1346958009,
    "duration": 364,
    "transcript_chunks": [
        {
            "text": "I'm going to be honest with you, I like Olive Garden. What's up everybody? Welcome to A Conversation With Colin. I'm Greg, and this is my roommate Colin. Now, Colin says some crazy stuff every now and again, so every Tuesday and Thursday, I reach into my topic pile, pick one, toss it at Colin, we talk it out. If you like that idea for a show, make sure you like this episode, share it with your friends, then subscribe to us on YouTube. Colin, are you ready? Yes, today's topic of conversation is spaghetti sauce. Oh, now you got the half-Italian in you. How's that treating you? Uh, it's good; it's real good. My mom's Italian, okay. And so you grew up making spaghetti sauce here? Well, no, I didn't grow up doing that. That was your first job, wasn't it, making your mom spaghetti sauce? Yeah, it was my very first job. No, I grew up... even though I have an Irish name and I'm uh, I guess predominantly Irish; my dad's Irish, uh, my mom is Italian, and we grew up with my mom's family on Long Island, so uh, I grew up",
            "start": 0.36
        },
        {
            "text": "Job, no, I grew up. Even though I have an Irish name and I'm uh, I guess predominantly Irish, my dad's Irish, uh, my mom is Italian, and we grew up with my mom's family on Long Island, so uh, I grew up as an Italian basically okay to you then what's the key to a great spaghetti sauce? Time oh I like that explain yeah, uh, I think uh, we have our own recipe in my family it's very secret and I actually was tweeting about it not too long ago as I was making it I was showing people pictures and kind of explaining a little bit and I actually got a not so sarcastic uh tweet back or text message from my my brother-in-law who was saying my mom was looking at it and they're not pleased that I'm giving away too many of the secrets of sauce um but I think uh first of all I think jar sauce is an abomination. Jar sauce, the hell is that? Jar, I thought you meant like a Gia no, you mean like a jar, a jar pasta sauce, terrible, that's what I that's what I eat, what I grew up on.",
            "start": 38.32
        },
        {
            "text": "sauce the hell is that jar sauce oh jar I thought thought that was one of those words like a Giada no you mean like a jar a jar pasta sauce terrible that's what I that's what I eat what I grew up on no you don't want to eat that I don't I you don't have to I buy your sauce and you you can taste a difference it was delicious um but time is everything with with the sauce once you get it going it's a lot of work it's a lot of you're toiling away in the kitchen you're getting the meat together you're browning the sausage you're cutting up the garlic you doing all this **** but then you just let it sit six seven eight hours stir it every 20 minutes let it reduce real nicely it takes time and time is the essence of good sauce so now why are you hiding this from everybody why won't why why won't your family share their their secret if if I'm not supposed to eat jar sauce white bread Middle America kid how am I supposed to know what to go do I have to go download a Rachael Ray recipe or",
            "start": 78.8
        },
        {
            "text": "your family share their secret if i'm not supposed to eat jar sauce white bread middle america kid how am i supposed to know what to make do i have to go download a Rachael Ray recipe or something i'm sure those recipes are great i make the recipe that we make is bolognese um we are Sicilian uh which would indicate that we would actually use more um rustic ingredients like vegetables and stuff like that but this is not a sicilian recipe um and the bolognese requires uh a bit of knowhow in terms of uh at least in terms of ours of the little things you do to make it taste the way it does and every family has its own secrets and i don't think that i know plenty of mine are like you know my dad killed a baby duck once i don't go bragging about it okay well i'm not bragging i'm not bragging about this i'm just saying it's a secret and and uh every italian family that i've ever known and i grew up in a very italian area uh has their own secrets and you readily eat the sauce and maybe you",
            "start": 120.72
        },
        {
            "text": "about this I'm just saying it's a secret and every Italian family that I've ever known and I grew up in a very Italian area has their own secrets and you readily eat the sauce and maybe you can kind of taste that this guy puts a little bit of sugar in his sauce this guy likes to put vegetables in his sauce but you don't really know why you know how he's getting from point A to point B and that's kind of the fun of it when my mom taught me how to make the sauce and finally kind of bestowed upon me the knowledge she asked me to keep it to myself um and I did well then you started tweeting about it yeah and then I I gave away some of the secrets but like 10% of it like okay yeah all right uh so then tell me this then as an Italian what was your family's response when Olive Garden came in and kind of just made like nailed it just showed everybody what a time I'm I'm gonna be honest with you I like Olive Garden I think Olive Garden's pretty good but I don't eat it because",
            "start": 159.52
        },
        {
            "text": "Garden came in and kind of just made like nailed it just showed everybody what a time I'm I'm gonna be honest with you I like Olive Garden I think Olive Garden's pretty good but I don't eat it because I'm like I want to have Sunday dinner with my family I eat it because like I'm like oh this this chicken whatever the hell this is is pretty good over Angel hair pasta and I like it a lot but when I you know I I think very fondly back about my my childhood my my my grandparents are are dead now um but when they were alive and well uh we would go to my grandma's every Sunday my mom or my grandma or whoever would make gravy which is the sauce I may we call it gravy um and does that get confusing when you make mashed potatoes yeah it does it does it does pasta sauce on the potatoes it's one of those words like in the tri-state area like where I'm from um where you know the word hero for instance the word hero to a lot of people is gyro right but hero to us is hoagie and it's a sandwich",
            "start": 197.4
        },
        {
            "text": "Words like in the tri-state area, like where I'm from, um, where you know, the word hero, for instance, the word hero to a lot of people is Gryo, right? But hero to us is Heo, and it's a sandwich that you get, like you know, you get a meat hero exactly. Um, and so that's just another word, like you hear the word gravy used for sauce a lot, and that's just a word, I don't know where the hell that came from. Um, but yeah, I think very fondly about it. We Italians know how to eat; we eat really well, and uh, I'm really proud of the sauce I make. I think it's really, really good. It comes out consistently, which is the most important thing as well, but it's because of the time and the energy you put into it, the essence of my grandparents in our lineage in Italy are all those important things. Maybe one day I'll bestow upon you some of the secrets if you pay attention to me cooking it; you'll figure it out for yourself, not too much work for me. Yeah, yeah, you know I can barely put together a\n\nI corrected \"g y r o\" to \"Gryo\", assuming it's a phonetic error for \"Hero\", and \"h e o\" to \"Heo\", as it seems to be referring to the Italian sandwich \"hero\".",
            "start": 234.48
        },
        {
            "text": "maybe one day I'll bestow upon you some of the secrets if you pay attention to me cooking it you'll figure it out for yourself not too much work for me yeah yeah you know I can barely put together a plate of wings in there I don't want to go in there be cooking for six hours fair enough to each its own but I'm glad you enjoyed the sauce it was delicious you see I'll give you one of the secrets all right and this is a very common thing you break you know you form the meatballs I'm not going to tell you what I put in my meatballs but I say you form the meatballs you take about you know a couple packages of sausages five or 10 sausages if you have a big enough pan to accommodate them you brown them you're turning them you're browning them you're getting all the couldn't eat them yet and no you couldn't eat them yet but the key is to do that in the same pot that you are going to make the sauce in okay and then big old pot",
            "start": 272.6
        },
        {
            "text": "\"Browning them, you're getting all the flavors in. You couldn't eat them yet, and no, you couldn't eat them yet, but the key is to do that in the same pot that you are going to make the sauce in, okay? And then a big old pot, yeah, big pot. And you braise them on the bottom, and then you remove the meat, then you put the sauce in, and you work your magic with the sauce once the sauce starts to boil, you then reintroduce the meat into the sauce, and you let the meat cook in the sauce very slowly on the lowest heat you can possibly imagine for as long as you can possibly tolerate it. And the fat from the meat and all that stuff just makes it - it's just a million bucks, I'll tell you what. Well, Colin, I think that about wraps up this conversation. Thank you for your time. If you enjoyed this, make sure you like us, like this video, share it with your friends, you can follow us on Twitter, maybe Colin will give away some more secrets, uh, and make sure you subscribe to this YouTube channel.\"",
            "start": 302.88
        },
        {
            "text": "you like us like this video you share it with your friends you can follow us on Twitter maybe Colin will give away some more secrets uh and make sure you uh subscribe to this one here youtube.com/gameovergreggy until then we'll be back next Tuesday and next Thursday with new topics uh I hope you have a conversational day",
            "start": 338.28
        }
    ]
}