{
    "id": 539,
    "video_id": "bG7Qv921LcQ",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "State of Decay Year-One Survival Edition - Kinda Funny Reacts",
    "description": "We got the chance to play some upcoming Xbox One games. Here is what we thought about State of Decay.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1421780402,
    "duration": 237,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller and this is the pride Long Island Colin Moriarty it's good to see you Greg thank you for having me see too I'm glad that you could come and bring a friend uh Colin we just played State of Decay Year One Survival Edition I of course am a huge State of Decay fan ran around waving that flag for a long long time I want to know your impressions of it you never played the first game right no I watched you play it pretty extensively but it was just never a game I got around to playing uh you know our jobs at uh IGN had had us running around like maniacs basically so I was just playing a lot of games for work um no so this is the first time I sat down and played with I'm really impressed with it really okay why out for you uh I like open world games and I like games that don't tell you what to do so this is basically uh both of those things it's a nice open map I think they were saying there were seven or eight in-game kilometers to explore this town these",
            "start": 0.16
        },
        {
            "text": "games that don't tell you what to do so this is basically uh both of those things it's a nice open map I think they were saying there were seven or eight in-game kilometers to explore this town these different kind of neighborhoods uh I like the fact that you can go into any building y uh I like the fact that there's just zombies everywhere and there's no safety I like when you go to a menu that it doesn't pause there's a lot of really cool things about the game I think that are that are pretty writing I can see myself spending a lot of time with what I always talked about when we were if you didn't know this is State of Decay it's for the Xbox One it is the 360 PC version upred it's got Lifeline it's got Breakdown it's got the DLC packs in there it packs a new character New Missions all these little new tweaks but it's mainly the same game but immediately sitting down playing with it I'm reminded of why I love this game you know what I mean despite like janky animations or like you",
            "start": 33.28
        },
        {
            "text": "these little new tweaks, but it's mainly the same game. But immediately sitting down playing with it, I'm reminded of why I love this game - you know what I mean? Despite like janky animations or like you know rough edges here and there, the idea is so great: permadeath. You know, you've got to find other survivors; you go in, then you have to manage their relationships - are they okay? Are they hungry? What do they want? What do they need? Then you go out, yeah, and you know you're encumbered; you make a rucksack for your biggest things, and maybe you have to leave it to run away from a zombie attack, maybe you have to do this. It's just a cool world to get lost in, yeah. I - I agree when I was like kind of going through some houses over there, I like how some of the the houses are open; you just open the door quietly and kind of walk in. Some of them you have to bash the door open, but if you do that then zombies in the area might hear you and go in, and then you... but then you can make any building",
            "start": 68.28
        },
        {
            "text": "door quietly and kind of walk in some of them you have to bash the door open but if you do that then zombies in the area might hear you and go in and then you but then you can make any building like your safe house and it's just really cool there's a lot of like different kinds of components that I think are really promising about the game um even climbing like the old cell towers and and looking around right that is such a nerdy thing like can say okay you know the map's totally unexplored so when you get somewhere new you go to a vantage point and you just look around at question marks to identify that's a car that's a horde that's a house that's this and then it fills out your map and such a nerdy collector got to do everything M yeah I mean I I think that this is this is the type of game where I'm going to sit down probably play it on PC because it's coming out on Xbox One and PC same day um and uh I'm just going to sit there and just do whatever and even though I got a mission at",
            "start": 100.96
        },
        {
            "text": "where I'm going to sit down probably play it on PC because it's coming out on Xbox One and PC same day um and uh I'm just going to sit there and just do whatever and even though I got a mission at the beginning of my particular play through I didn't really care about that but I like the day night cycle I like you know the fact that you know you have to kind of keep the morale up your ammo is is shared by everyone in your group uh your supplies are pretty much shared by everyone in your group you're the leader until you die and then someone else takes over for you and I think that's cool too permadeath is really cool and not very well explored in a lot of games that we play and so uh being able to play a game where there is a finite end both in terms of the campaign and in terms of your own life is pretty neat I think and uh you know I'm ex I'm super stoked to play more yeah uh I thought a little cool tweak right uh State of Decay Year One Survival Edition is out April",
            "start": 132.6
        },
        {
            "text": "terms of your own life is pretty neat I think and uh you know I'm ex I'm super stoked to play more yeah uh I thought a little cool tweak right uh State of Decay: Year One Survival Edition is out April 28th the day after my birthday nice touch um digital Edition obviously it's going to be $30 bucks but if you are if you already bought it on Xbox 360 you bought the Xbox Live version there you get 33% off so you save a little money to jump out that's very cool yeah so to make a $3 game at $20 game yep so ladies and gentlemen what do you think of State of Decay: Year One Survival Edition I'm sure we'll be doing let's plays here on Kinda Funny but we want to know in the comments what you think then like subscribe share all that good stuff uh back us on Patreon go over and listen to Colin and Greg show over on Twitch get the podcast do all that stuff keep doing things until this game's out because that's how long it will take you probably do everything and say had our friend Mr. Silkscreen",
            "start": 164.92
        },
        {
            "text": "Greg shows up on Twitch, gets the podcast, does all that stuff, keeps doing things until this game's out because that's how long it will take. You probably do everything and say \"had our friend Mr. Silverback\" (or possibly \"Mr. Silversky\", but more likely \"Silverback\") until next time. It's been a pleasure to serve you.",
            "start": 202.04
        }
    ]
}