{
    "id": 497,
    "video_id": "N_jqr4Mzoio",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Kevin Smith",
        "Pandamusk"
    ],
    "title": "Kevin Smith Meets the GameOverGreggy Show Teaser Trailer",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n \nMusic by - http://www.twitter.com/Tonedeff",
    "published_at": 1420477670,
    "duration": 83,
    "transcript_chunks": [
        {
            "text": "from us we're this we're we're we're we're in his back cave we're we're in Kevin Smith's house This is really weird How you doing, Kevin Smith? How are you I'm excellent Um the producer SL Seducer is that tremendous I mean it's one of those things like every once in a while you have an idea you hear somebody say something you're like has that been said before and you run to the internet and do a quick Google search Yeah I I doubt anyone's ever put that together should Google it good things come up I'll tell you that much Really is it all in relation to you we had it going for a while where if you put Nick's name into Google like the first autofill was cocaine and I was like we're we're doing the Lord's work no it was it was it was cocaine then scumbag then producer Seducer now thankfully due to a marketing campaign of my own it's just producer",
            "start": 2.82
        }
    ]
}