{
    "id": 558,
    "video_id": "ullCx7I7te8",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Colin and Greg Play Mega Man 2 AGAIN! - Teaching Tuesdays",
    "description": "Colin Moriarty continues to try to teach Greg Miller how to play Mega Man 2.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1422389387,
    "duration": 1051,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, my name is Colin Moriarty. This is Greg Miller. Hi, this is Teaching Tuesday's right here on Kinda Funny Games on YouTube. Greg, yeah, we've been playing Mega Man 2 together. Yeah, he went first. Terrible, then Tim went, then Nick went. Yes, you picked Bubble Man. This was when the screen was full write-up creative robot masters. The Preachers are not crazy; they're robots. Yeah, I missed you didn't do very well. No, God, I was boys showing was borderline awful. Yeah, I would agree with that. I, I was I was expecting Tim and Nick to sit down and be equally terrible right, and then they were all great. They totally understood Mega Man on a level idea. Well, I'm very embarrassed; I want you to know my first showing that I would like to be sorry. I feel like after watching them in like getting a feel for the game, I'm like I see like you always said like it's okay to get hit don't worry about this keep moving shoot non-stop. Like I get it a bit more; I think that I'm",
            "start": 0.03
        },
        {
            "text": "them in like getting a feel for the game I'm like I see like you always said like it's okay to get hit, don't worry about this, keep moving, shoot non-stop. Like I get it a bit more, I think that I'm gonna need help since I've never had to use any of the items or a freezing time is a thing that happens now, yeah. I watched Nick \"Farm\" for goods for like 30 minutes in his let's play so I mean he is so here's the situation, yeah. There are three robots left: Quick Man, Bubble Man, and Flash Man. A Metal Manor is gone, which means you have the bubble weed, quick bloomerang, sheriff leaf shield, you're the metal blade, and you have the time stopper. Okay, um, two of these options are good for you right now. Okay, Heat Man I would stay away from until you beat Air Man not because you need his weapon, you already have the weapon that you need, a heat man, yeah, you don't have item two and you're not gonna be able to keep annotated okay okay okay so go at Air Man, go to Crash Man it's really",
            "start": 37.65
        },
        {
            "text": "weapon you already have the weapon that you need a Heat Man, yeah you don't have Item 2 and you're not gonna be able to keep annotated okay okay okay so go to Air Man, go to Crash Man it's really up to you I'm gonna go to Crash Man he looks like a straight shot he's got bombs for hands like what you'll see okay hey Colin you're not Mike shut up and stop making noise back there Crash Man you filming at somebody's house and they just think they can walk around just yelling the whole time here we go so I forgot how to play so I give me some yet oh crap and I can't shoot up right no but but if you go and if you could yeah go to the go over there and and I'm holding Portillo's now should we thank you were a million other man Oh Greg stop it go to next yeah press Start I know I'm sorry okay Colin mmm and now you cheat up Oh No so there you go you can shoot through them",
            "start": 76.17
        },
        {
            "text": "\"Huh, hold on, don't I start? Okay, go up to next. Yeah, Portillo, stop it. Go to next. Yeah, press Start. I know, I'm sorry. Okay, Portillo. Mmm, and now you cheat up. Oh no, so there you go. You can shoot through them or whatever. Shoot up. You can actually shoot me different directions with us. Oh, and I can do it on the wall. I'm coming - exactly. So you're good. There you go. And grab that. So you go a little bit and keep moving. I got there. You go. Music on. Crash man stage is awesome as epic music really fantastic music all the whole soundtrack is great, of course. Thanks, Walnut. I want to get shoot on bag that's what I'm saying. I'm sorry, I'm sorry. I missed and that I'm just excited to be past the first screen right that's what I don't frog which back no frogmen and you're alright. So these are called Mets. These guys here whoo press press press start okay like these guys here well now get near them and they'll poke their head and let you shoot so if you **** that run everything remember first rule Mega Man I\"",
            "start": 114.33
        },
        {
            "text": "Here who press press press start okay like these guys here well now get near them and they'll poke their head and let you shoot so if you **** that run everything remember first rule Mega Man I think yep so keep going yeah there we go got a kill for run run yeah that was pretty nice now you're gonna want to switch back metal blade cm dude this is crazy and now you're gonna use increasingly more complicated platformer puzzles - okay so I see I actually get on top of that I might just chill SEC though you got it now but yeah and so an interesting rule of thumb with these guys and it's interesting rule of thumb and Wiley's castle - because you're gonna oh oh that there can only be three on the stage at one time yeah you want to leave them there then no morning spawn so you might want to kill them right away okay okay good call good call that's cuz you're a badass man there's Mega Man and bad ask me that man I was like that was a canned Robot Master so let's see you're doing all right",
            "start": 164.27
        },
        {
            "text": "them right away okay okay good call good call that's cuz you're a badass man there's Mega Man and bad ask me that man I was like that was a canned Robot Master so let's see you're doing all right so far oh I'm telling you man I died something when I watch other people play Mega Man and somebody's never even watched that much Mega Man you know what I mean right now you're like watching an old Nicky Nick Nick over there I'm like well man if grandpa can do it any any adult any normal man can do it too grandpa's real good at grab on Nick's good at Mega Man except for the he's really good farming in that one tunnel and quickly for like like I watched the YouTube numbers on it was like really that that boy wasn't really I didn't really watch I don't kind of care why you could jump up there at this point well you know what I'm gonna I'm taking the scenic route people are excited to see me hanging in here alright so you could probably switch back just for a minute to eat and these guys got to",
            "start": 209.21
        },
        {
            "text": "point well you know what I'm gonna I'm taking the scenic route people are excited to see me hanging in here alright so you could probably switch back just for a minute to eat and these guys got to shoot him in the I have a question for you something we didn't I think so I have the the two down there you'll have a 1 and a 2 there eventually right now helium-3 which is a crawler you'll get wait no but I'm time on the head I have two lives down here right oh the - yeah sorry yeah you have to lodge okay really because you can go down to zero and then I have no energy tanks no if I was about that I have to use the energy tank it doesn't automatically use exact and you can get anything a little while but that's not like how Samus does it right same as you have a you you buy them it or you get them you acquire them and then Samus a Metroid will go to the next tangled about good okay but that stuff is refillable and X and Mega Man X you could refill your tanks they're not called you things",
            "start": 246.14
        },
        {
            "text": "them you acquire them and then Samus, a Metroid, will go to the next tangled about good okay but that stuff is refillable and X and Mega Man X you could refill your tanks they're not called sub-tanks both in Mega Man X okay and this you usually take one since CoD4 over can only hold for Mega Man 2 and Mega Man 3 gold mine there are none Mega Man 1 which is why the game so hard how long did it take if we need to make this pencil oh you didn't make it by himself but it was a team of a very small team so here you guys see that move I see him I see this **** hey hey you have to jump Adam and then jump back jump back yep so like jumped in the middle section of themselves just jump out Adam didn't jump back I'm here I'm thinking too hard about it I'm getting flashbacks to The Frog: if you fall you're not gonna help oh he's gonna respawn okay this is what I'm talking one I can't lose I can't lose it you can't die there well I know but I'm I can't lose focus here hold on just did",
            "start": 284.79
        },
        {
            "text": "if you fall, you're not gonna help, oh he's gonna respawn okay, this is what I'm talking about, one I can't lose, I can't lose it, you can't die there well I know but I'm I can't lose focus here hold on just did I lost jump forward and jump I totally understand what you're saying and what you want me to do just having trouble not to die right now so yeah try to you could probably warm up me a **** you **** come on come on come on yeah all right perfect keep going thanks buddy you're good you're out you're at the home stretch now so now you know what to say now these get the F to kill this guy dang on perfect it's a perfect way you approach up equipped the metal blades this part gets a little this part gets a little crazy right okay birds are gonna fly from right and left up here and drop eggs that spawn the little birds you're gonna need this BAM the metal blades like crazy up here can't I run out of metal blades yeah not really because it yep keep going keep going keep going go to the right one",
            "start": 320.1
        },
        {
            "text": "the little birds you're gonna need this BAM the metal blades like crazy up here can't I run out of metal blades yeah not really because it yep keep going keep going keep going go to the right one actually **** you and your **** man dig about yeah **** you and your **** I'm so sick this it's hard to believe Angry Birds is a ripoff of Mega Man but there it is I'm going hi this is fast as he can go Dr. Light is giving power boots got your good **** don't even bother with him **** you he's don't try for them it's like a broken oil tank you from Flash printed all right now here's where you're gonna get a little crazy right okay actually actually you didn't be there man so you really can't I can't you alright so you can't get that you take him you want but you have to drop back down and go back around again should I do it I don't really need you okay all right you know I'm really bad at this game though all right like I'm getting to a boss in a second right soonish yeah I",
            "start": 366.05
        },
        {
            "text": "down and go back around again should I do it I don't really need you okay all right you know I'm really bad at this game though all right like I'm getting to a boss in a second right soonish yeah I wonder you don't have item 1 or 2 so this is it this is gonna be a tough one so just drop back down you could just press A what no not that part I was like I tried to shoot at the side and then that guy was all like \"Not are you gonna do anything to me\" look at that nice drop rate then present - in my world it's alright so yeah you have to go back to your good ship cool then you got any time let me go back yep hey if it ain't broke don't fix it, egg dude and get out of here you **** hey **** egg new **** my Dudek dude I'm sorry I thought I was spamming the right way but I'm spamming the wrong way get to the right boom don't suck it **** **** you're getting close big you're really got a mouth on you don't you you know what man yep keep going keep going that's my Robot Master don't keep going",
            "start": 411.56
        },
        {
            "text": "right boom don't suck it **** **** you're getting close big you're really got a mouth on you don't you you know what man yep keep going keep going that's my robot master don't keep going doing bottles man **** that I'm gonna bother with him these guys are coming in here pooping on my car you're actually in there pooping on their car yeah shut up Nick no one can hear you I mean the ironic thing is you're actually taking thumbs on their car I'm not pooping I'm throwing blades while yeah jump jump up here and these guys are gonna come down from the office the sky yeah this **** you know wanna keep moving self yeah exactly so keep kind of wait for it yeah yeah you're good you're good you're almost to the stage **** that dude layer a lot of boss laughs oh you want to get tricky with your one Parkson blood oh all right yeah now what you definitely have enough energy to beat them so fresh start you gonna go use my hands are super sweaty all right you don't have the web the proper",
            "start": 468.42
        },
        {
            "text": "your one Parkson blood oh all right yeah now what you definitely have enough energy to beat them so fresh start you gonna go use my hands are super sweaty all right you don't have the web the proper weapon to use against them but you're not really a hard you gotta fight so can use your you need the air should be usually defined yeah but I think Crash Man is kind of easy if you just use the pea shooter so okay try it use the pea shooter use your E-Tank you might let's see okay so when I need when this thing's super low I gotta use anything exactly but let's let's see how you do because you might it might behoove you to actually kill yourself okay cuz you'll start right back we'll have a big loving conversation before we so just he'll shoot me shoot bombs and jumps around sit walk yeah nothing to do can I use the free stuff I don't think what I'm Oh son of a gun he's dropping these weird-ass Poké Balls remember use your invincibility to your advantage just spam just just now I mean",
            "start": 512.34
        },
        {
            "text": "to do can I use the free stuff I don't think what I'm Oh son of a gun he's dropping these weird-ass Pokeyman almonds remember use your invincibility to your advantage just spam just just now I mean so when should I be jumping like I see I come at you and drop the bomb the bomb doesn't explode immediately if the bomb runs into you it's gonna it's gonna hurt you but the bomb explosion will also hurt it's a kind of like bomb in it make a better one so you're gonna want to move away from him but constantly pepper it way like this but then stop into this and then we yeah yeah truck no try this with the air sugar he's really easy but I feel like I brought you here without it because I feel like you can do it I feel like you totally are capable then too yeah **** now I'm just **** milk he's always in the air now I see a little bit the only solution sorry so that's the we would I don't know wait it yeah don't use your you take you so what I do just died yeah you have one more life you could",
            "start": 553.31
        },
        {
            "text": "in the air now I see a little bit the only solution sorry so that's the we would I don't know wait it yeah don't use your you take you so what I do just died yeah you have one more life you could do it you're almost being too he's always he's one of those guys that's always gonna try to run into you uh-huh so you keep moving he'll shoot the bomb and somebody's always gonna try to run into you you have to just you have to just nail it but I feel like I mean like I'm I don't feel like that's good enough instruction for me cuz it's clearly not working every time I turn a shoot at him he's in the air I'm not gonna do it for you about it like yeah well he's if he's coming at you you know jump and shoot yeah I mean run you're on normal he's really hard I wouldn't brought you here on this boat because he would not allow me he thinks if he jumped when I jumped to not necessarily that's the core metal man you have nothing to lose here so at some point you're gonna be freezing but not yes I am",
            "start": 604.03
        },
        {
            "text": "he would not allow me, he thinks if he jumped when I jumped, to not necessarily that's the core Metal Man. You have nothing to lose here, so at some point you're gonna be freezing but not yes I am, I can't avoid them are you dead? The **** **** alright alright well I'm still having a performance, you did a great job, I didn't want to necessarily bring you, you could have chosen Air Man that would be fine then you go to Crash Man uses weapon on ya every man's stage is really hard I think for newer people and so I guess I'm glad you didn't choose that okay but let's do Crash Man, I'll see what we'll see how I do of course the stick here lazy gentleman if you're joining is I we've all we all go through till we die then Colin comes through and just the steam rolls the game and then after he beats the boss that I couldn't beat well switch it over to Tim then Nick if we need it we're just playing through this whole game in one let's play series I'm very happy that I got to your did you did a",
            "start": 659.59
        },
        {
            "text": "the boss that I couldn't beat well switch it over to Tim Gettys then Nick if we need it we're just playing through this whole game in one let's play series I'm very happy that I got to play Mega Man 2 again with you did you do a great job you did a great job I got I'm gonna give it to you thank you I really felt like I had a poor performance last time I was happy come around this time a better performance these construction workers are always sleeping on the job ones they get all pissed off when you catch them sleeping on the job then you get these guys what a living nightmare to be a sentient canister that controls the air it's always spinning you're always dizzy the animation when you think about how they animate that it's so cool you know like the frames of that I guess yeah it looks like it's spinning but it's not in a Funi all by himself yeah he did when you were a kid when you go in your dad's garage and pick up his buzz saw blades",
            "start": 705.4
        },
        {
            "text": "like the frames of that I guess yeah it looks like it's spinning but it's not in a Funimation all by himself yeah he did when you were a kid when you go in your dad's garage and pick up his buzz saw blades and said I'm around yes actually you get really mad well I would he had like these some of these doll's saw blades and I would try to attach one to my head like Metal Man you can't play with Oh wah wah wah good music man all the music's awesome you know you never talk about Mega Man music so I'm glad we know how that's gonna go Blue Bomber my brother you just movie speed a little bit yeah I think there's this guy again Old Sleepyhead Oh uh-oh I might grab that anything too better safe than sorry yeah I agree you asked around it's easier to go so what do you think of this stated I like the stay there like how gets all starry night yeah no it's cool a lot of different things yeah this is who this is which man am I fighting Crash Man Christ on his class man got you and he likes using bombs",
            "start": 749.32
        },
        {
            "text": "there like how gets all Starry Night, yeah no it's cool a lot of different things, yeah this is who this is which man am I fighting Crash Man, Christ on his class man got you and he likes using bombs, yeah threw him right at me couldn't do him couldn't avoid him he's so easy with the air with the air shooter but what'd you do did one one-eyed you just hit my poisons then feel like I just saw you a man we doing kind of that oh really you killed comes back boy and I'll there's just in your memory problems how good is a Dr. Wily, I don't think he is you know my roommate Chris who's a good good buddy mine in college was nasty he was from Long Island 2 News he was nasty a Mega Man yeah not as good as me I don't think not that I'm like the nastiest Mega Man player but he was good remember when I got Mega Man collection on PS2 he was like obsessed with it that was over so good it's good when you won the bird spawn and they just shoot him they just drop him right there because it'll break yeah",
            "start": 852.61
        },
        {
            "text": "Got Mega Man Collection on PS2, he was like obsessed with it that was over so good. It's good when you win the bird spawn and they just shoot him, they just drop him right there because it'll break yeah stupid birds don't ask Birds that's how they got that evening flu means stupid with that bird brain yep get out of here bird brain good dad info oh these guys is a problem they're like helicopter suction-cup guys with boxing gloves attached to another living nightmare. There you can spawn, you can like farm these guys like all they really wanted to do was the next thing, Peanut Man yeah they're easier to farm than word he was farming fishing so see like it I've made that up from you didn't have to I mean yours I see your time right now yours like you're kind of like it almost having sex with him yours on top of him it's like right into it yeah yeah you just have to **** battle he's going to stay on you it's a bloody back program to stay on him he's a robot thank you and then you get Crash Bonk.",
            "start": 914.81
        },
        {
            "text": "on top of him it's like right into it yeah yeah you just have to **** battle he's going to stay on you it's a bloody back program to stay on him he's a robot thank you and then you get crash bonk crash bombs aren't the most useful weapons they break barriers you can break barriers and like flash main stage and Heat Man stage with them and in Wiley's castle got right there the only weapon that works on one boss which we'll see in Wiley's Castle later on and they're actually Quick Man's weakness too but they're just not practical because if you don't hit so you shoot them in the knee explosion a few seconds we've yet hit the enemy with them then you have to wait to use one gotcha gotcha so that's it Greg I mean so now we have we have Air Man in Heat Man I do believe Tim's up next and we'll get to that I did I feel like maybe I missed out on going in the Air Man but I just don't feel like you would have succeeded yeah considering like you know your success or",
            "start": 977.63
        },
        {
            "text": "get to that I did I feel like maybe I missed director you maybe you should have gone in the air man but I just don't feel like you would have succeeded yeah considering like you know your success or lack thereof on bubbleman stage with some jumping yeah I feel like air man is all in the air lots of pits yeah I better look I'll see how these guys do with that for joining me oh thanks for having me and come back for teaching Tuesday's of course every Tuesday here on Kinda Funny Games more Mega Man 2 will do future games as well until next time see ya",
            "start": 1014.47
        }
    ]
}