{
    "id": 492,
    "video_id": "UTCgBxQGieM",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Power of Friendship - The GameOverGreggy Show Ep. 56 (Pt. 4)",
    "description": "Greg Miller talks about the power of friendship.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1420099206,
    "duration": 1486,
    "transcript_chunks": [
        {
            "text": "my topic oh what's your topic uh this this is something it's it's the topic of friendship now of course by watching this you're a best friend you already know that you guys know obviously we're all best friends are but I being with Dave and Colin is they're interesting friends because both of them had an instant connection with me I feel where we knew and then actually spelled it out that we would be friends the rest of our life because I remember when I first met Dave he came up to my place at noon it was my first time hanging out with him we went to lunch we did all these different things we're hanging out do all blah blah blah and then up at noon ended and you left and I remember going home and talking to Christine being like I just I love Dave that was so cool BL it was like I it's not like I have that connection with everybody like every time I'm like that was weird I hope we're friends and then that weekend you texted me out of the blue it's like hey Greg hang out",
            "start": 1.1
        },
        {
            "text": "it's not like I have that connection with everybody like every one at no game I'm like that was weird I hope we're friends and then that weekend you texted me out of the blue it's like hey Greg hanging out in my backyard and thinking about you I hope we have a friendship that lasts a lifetime and I was like you get it you get it you cut cut over to Dave Fenno he's going to the next person dear BL it was awesome talking to you G4 no but you know what I I think uh you know the the guy friend thing and I guess women friend thing too I I think in some ways it's very similar to romance you know how it is you see a pretty girl and she's just a pretty girl and you oh hey I'd like to go with that but then you meet a girl that there's a connection uh it's beyond just she's attractive to you there's there's there's your souls connect in some way and and you know this can be a real it might not turn out to be a relationship but this could be a relationship especially if you're married but uh D I",
            "start": 44.64
        },
        {
            "text": "there's there's your souls connect in some way and and you know this can be a Relationship. It might not turn out to be a relationship but this could be a relationship especially if you're married but uh D I don't do that I I I know you don't but I I think the same thing happens uh between men who discover a connection of friendship that it's it's you're connecting on a on another level that there's just something about this person that you like you might not be able to know what it is but there's just some and there was just something about you that I like plus um I enjoyed your energy and your talent and I just thought wow this guy's brilliant he's he's he's man I duped you he's destined for great things now three years later here I was talking about cold cuts we talking about good topic that was a good topic but but sometimes it's just you meet somebody and you dig them yeah and that's and I liked how you equated it to a relationship you know what I mean because that's what it is and I I I",
            "start": 93.44
        },
        {
            "text": "a good topic but but sometimes it's just you meet somebody and you dig them yeah and that's and I liked how you equated it to a relationship you know what I mean because that's what it is and I I I definitely take that for granted all the time especially with Colin like everybody knows Colin and I live together we work together we are together a lot you know what I mean and first off though I remember the first you remember the first time we met you just moved you just moved here we went out to Ed's  Ichiban Boba Tea which was the the Filipino uh karaoke in South city that was hosted by transvestites and D it was it was amazing San Francisco and it was amazing cuz You' get up to karaoke and they they were like the host and they were they were hilarious and they'd sit there and they would sing backup on your songs that's awesome so like you had like this whole thing and I used to go there in droves we'd go there all the time because Greg and I live close to it and I remember",
            "start": 146.04
        },
        {
            "text": "Sing backup on your songs, that's awesome. So, like, you had this whole thing, and Eugene used to go there in droves. We'd go there all the time because Hillary and I live close to it. And I remember when they were like, \"Oh, we're going to hire Colin,\" and Hillary was like, \"Greg, Colin sucks. He's such a little... blah.\" And so then we went there and came back, and you, we partied and drank there, and then we went and closed down Denny's together with Hillary. I remember closing down Denny's. How did you close it down at Denny's? There open 24/7? We closed it down to where I passed out, I guess. But it was like 3:03 in the morning; they turned the lights off. That was you passing out. You never go there, but you end up there. I saved the receipt. I remember being at one point when I was so drunk and I'm like, \"Oh yeah,\" and he said he hated me and I sucked, but you're awesome, and you're... and you go. But in his defense, I did suck. You had grown up from when you were an in young I",
            "start": 190.96
        },
        {
            "text": "so drunk and I'm like oh yeah and he said he hated you and you sucked but you're awesome and you're and you go but in his defense I did suck like you you had grown up from when you were an in young I wasn't nearly as bad as everyone made me have to be but no well not everyone but yeah because I was I also let's be honest Hillary hated everyone yeah that's true well I was I was you know I'm 30 now and I became a freelancer for IGN when I was 18 when I just graduated high school and then through college was freelancing for them and then they offered me a job when I graduated but when I was 19 in between I guess my freshman and sophomore years I was an intern at IGN um and I had like a huge mohawk and I was just like some kind of brash like East Coast kind of kid like loud kid and I think that just rubbed Hillary the wrong way yeah um Hillary and I actually ended up becoming great friends but um so when I came back I was I hadn't seen anyone for three years and I was like totally I think",
            "start": 233.56
        },
        {
            "text": "just rubbed Hillary the wrong way yeah um Hillary and I actually ended up becoming great friends but um so when I came back I was I hadn't seen anyone for three years and I was like totally I think I'm more of a grownup I don't think I'm still a grown up but um sitting here in your video game sweatshirt yeah on GameOverGreggy's YouTube show um but yeah no I remember I mean I feel the same way about Greg like Greg you know there's I have a lot of good friends I think and I think the the old saying the old adage that you know it's rare to have a good friend I think that's that's true but I actually feel like I'm blessed because I feel like I have quite a few good friends like people sitting around this fire and yeah but when I really think about like the people I'm closest to they all have a Common Thread and what's funny to me what was funny to me with Greg is that my best friend from back home and from college Ramon who's a character on the show that nobody knows yet Ramon we met we met when we",
            "start": 274.12
        },
        {
            "text": "and what's funny to me, what was funny to me with Greg, is that my best friend from back home and from college Ramon, who's a character on the show that nobody knows yet - Ramon. We met when we were freshmen in college, and we just clicked. Got to get you out more, and Greg loves him. Oh yeah, we totally do. And like, that was when I was like, there's something... there's the same thing about these two guys. I don't know exactly what it is, 'cause they're really not the same at all, but you don't mind that they like each other. No, I love CU cuz a lot of times with women when they get their friends together if their friends like each other... yeah. No, I think it was awesome. Like we went to Kentucky to go bourbon tasting like a huge group of us, and uh, there's a vac - yeah, it was for my 30th birthday, and like, and they were like inseparable. Yeah, and I was like this is awesome. You know, and you know for Greg, like, the way I feel about Greg is like... and I've told this to",
            "start": 313.12
        },
        {
            "text": "it was for my 30th birthday and like and they were like inseparable, yeah, and I was like this is awesome, you know, and you know for Greg, like for the way I feel about Greg is like and I've told this to people before and Cheryl knows it too is like I'm you know and I've said it before I'm beyond is that you know we are ostensibly married to each other and I really do a band man but I really do feel like you know Greg and I have lived together for a long time and have worked together for a long time he was my boss and we've never we've fought a few times but nothing serious and like never never gotten tired of and I really do see a situation like a real a situation where like Greg out lives and out my relationship with Greg like really outdoes like most of the relationships of My Life um to the fact where like I would I owe a great deal to Greg and I would do anything for Greg you know literally anything my favorite thing that's that's the I don't feel that way about a lot of people we",
            "start": 353.96
        },
        {
            "text": "the fact where like I would I owe a great deal to Greg Miller and I would do anything for him, you know literally anything. My favorite thing is that's that's the one person I don't feel that way about a lot of people. We have a definitive aim conversation because I still have archives of every aim conversation I've ever had - really incriminating. Got to hope Korea doesn't get in there, yeah, there's a hacker right now. What we really think of Sony PR in 2007? No, there is a definitive part in this one aim conversation like where I was talking about something else and then I'm just like you know what I really enjoy your company, we should hang out more, and you're like I agree we should, and then we went out. And that's still your ringtone on my phone is like when we went out and we went to P.F. Chang's for the first time ever, just sitting there chilling out, whatever. But like now you, the evolution of our relationship now right, like it always is - you're still the one who when you call me I don't remember the world",
            "start": 392.4
        },
        {
            "text": "just sitting there chilling out whatever but like now you the evolution of our relationship now right like it always you're still the one who when you call me I don't remember the world you're the one who can call me on my phone and make me stop what I'm doing immediately right whenever you come over when he he comes over and he'll say something to me and I'm mad at something else and I give him a really shitty response go oh okay well I don't care walk off and I'm like I hurt Colin I got to stand up and apologize to Colin how come it works with Colin but not with me I'm like okay well Greg's in a bad mood you're like yeah I'm in a bad mood Scarpino go **** off cuz that's our relationship like that our relationship that we vent borderline abuse you know we can vent each other so let since you're talking about friendship I have friends that I sometimes have not seen friends that I went to college with or high school with that I haven't seen in years but as",
            "start": 433.84
        },
        {
            "text": "vent each other so let since you're talking about friendship I have friends that I sometimes have not seen friends that I went to college with or high school with that I haven't seen in years but as soon as I see them it's like a day right hasn't been that yeah um I have those too like yeah I you know over the summer I was one of the best men in my buddy from College's wedding and that's the same thing we are not phone talkers and we aren't texters like if something happens like when I got sick right or when he got engaged like we talked to each other then but like outside of that no it's like those big things but you drop back in and it's family and that's you you and I as friends we're not in touch every day uh or even every week some sometimes I'll get a like you know I haven't talk to Greg let me just let him know yeah you know I just hey just thinking about you how you doing hope everything's cool um you type weird he's going out a water slide he B cell phone no you know it's it's",
            "start": 481.6
        },
        {
            "text": "Greg let me just let him know, yeah, you know, I just hey, just thinking about you, how you're doing, hope everything's cool. Um, you type weird; he's going out on a water slide; he's got his B-cell phone. No, you know it's it's it's it's it's um. But I always feel close to you, yeah, and um, you know sometimes friends or people that you think are your friends are trying to use you for something. Um, and I don't have an agenda with you, and at the same time I feel like um we're going to do some wonderful projects together at some point uh but without I don't feel like oh you know I need to call Greg and we need we need to build this we need get this we need to get this thing together and and uh what can what what can I do what can I work on and and and bring Greg in it yeah I don't have that I just you know I just you know I dig Greg, Greg digs me when there's something that's happening that I can help him out he'll give me a call if there's something I'm doing I can pitch it I'll give him a call um yeah no I mean",
            "start": 525.48
        },
        {
            "text": "know I dig Greg Miller digs me when there's something that's happening that I can help him out he'll give me a call if there's something I'm doing I can pitch it I'll give him a call um yeah no I mean that's the thing and that's that unspoken thing we have of like when we I mean we're down here I'm sure people know from Twitter and everything else we're down here to film with Kevin Smith tomorrow yeah and it was like oh man we get a hotel and I was like wait a second we don't need a hotel Dave Bautista's there and they're like is that cool and I'm like yeah Dave's like Dave what's up and I was like before you commit to that can you please text Dave thank you so much again you know and and you texted me and what did I text right back yeah sounds like a great time sure come on down come on down that's awesome we appreciate that I feel like it's it's harder to make friends as you get older though yes it is I feel like I feel like when I was in junior high I would be you had get some cold cuts every",
            "start": 582.56
        },
        {
            "text": "awesome we appreciate that I feel like it's it's harder to make friends as you get older though yes it is I feel like I feel like when I was in junior high I would be you had get some cold cuts every single every single person you met in junior high you were either going to be mortal enemies with or best friends like I remember I met my buddy Stu who is still one of my best friends to this day and we we almost got into a fight over a girl it's like seventh grade oh of course and I I was dating dating whatever you do from the sixth grade to the seventh grade this girl named  (I'm not going to say her name she still exists um I don't want her to get jealous that I have still good uh I haven't seen her since I was I imagine so she was quite she was hot from what I remember it doesn't matter follow me on this so so I was dating her and then she became we went to uh junior high together and Junior High we did summer school together it was in like pre-algebra whatever smart kid",
            "start": 629.32
        },
        {
            "text": "Matter, follow me on this. So, so I was dating her, and then she became we went to uh junior high together, and Junior High we did summer school together. It was in like pre-algebra, whatever smart kid class that I thought it was. And uh, she started liking this guy named Stu, and he was like a scrawny little blonde kid. And I was like, \"I'm gonna kick this kid's ass.\" What the hell? He was my girlfriend. None of us wanted to fight; none of us were fighters. I was more of an eater than I was a fighter. It was definitely bros before hos mentality. I did not know back then, but I felt it in my loins and uh, Spoken Man code. She ended up breaking up with him because we were like you know, we would shoot each other dirty looks, and like his friends were threatening to beat me up, and I was like threatening to beat them up. And no one was going to do anything 'cause we were little kids, but uh yeah. And it was the funniest thing. One day she broke up with him, and I found out, and I was like, \"Hey dude, sorry, you know that sucks.\"",
            "start": 670.64
        },
        {
            "text": "No one was going to do anything cuz we were little kids, but uh yeah, and it was the funniest thing. One day she broke up with him, and I found out, and I was like, \"Hey dude, sorry, you know that sucks.\" And he's like, \"Like, yeah, I'm sorry that was kind of shitty to you,\" and we've been best friends since that moment. Literally just saw him two weeks ago; he came up with his wife to San Francisco. He's like, \"Hey, you want to grab dinner? I'll be up there tomorrow.\" I'm like, \"Sure, like here that was it.\" And it's one of those things where you just pick it back up: \"Hey, how's the thing going?\" Oh, it was great. That was good. Your house is done; I flooded again. Great, done, great. Yes, it is what it is. But it's like the same story with me and Alfred Angelo too. I think I've told it a million times, but yeah, the Halo stuff. But before that, it all started with first day high school. We get in, and two of us sat diagonally behind her because we're like, \"That's the hot girl; yeah, we want to get to know her.\"",
            "start": 708.56
        },
        {
            "text": "but before that it all started with first day high school we get in and two of us sat diagonally behind the girl because we're like that's the hot girl yeah we want to get we want to know her but we're also like this is my competition this guy and we just both knew and uh neither of us getting the girl he probably he could have got it Alfredo probably could have got Alfredo got it like later in life uh he might have I don't know uh but yeah like that brought us together so hard and what really actually brought us together besides the the Halo stuff was um in that same classroom he ended up getting with a different girl and that girl ended up like they they broke up but like like he didn't really want to like he broke up with her he didn't want to he's Alfredo he's weird um but he then came to me as this like hey dude you're my friend now it's like can I talk to you I'm like yeah and that's like when we really bonded it's crazy girls bring guys together which they do together but it's",
            "start": 743.52
        },
        {
            "text": "to me as this like hey dude you're my friend now it's like can I talk to you I'm like yeah and that's like when we really bonded it's crazy girls bring guys together which they do together but it's it's interesting you ever you ever do that thing where you know you and your buddy go to the same girl's room you know like in college and you try to outweight each other I wouldn't win that fight so no um but it's interesting to me I remember doing that in Colt it's interesting that you say that it's harder to meet people as you go on because for me it was kind of the opposite like when I was young I didn't I I had friends you know little kid friends uh that but the only like real like ride or die friends Kevin sure and then so I kind of grew up with him and then after that look like it looks like a little miniature Rocky over there with his hood pulled up um and then you know when you're when you're that young it kind of becomes it transcends friend to family so I see Kevin as family more",
            "start": 785.52
        },
        {
            "text": "a little miniature Rocky over there with his hood pulled up um and then you know when you're when you're that young it kind of becomes it transcends friend to family so I see Kevin as family more than some and then I met my real core group of friends in middle school and till this day they are my best friends you stayed in guys yeah exactly I stayed I'm from the same place and then going into high school was like oh I don't need new friends I have my friends and then there was like a couple guys this guy James and Alfredo that kind of broke their way into it I was like even though I wasn't looking for friends that they came to me you don't have to look for friends as a matter of fact just like looking for love you you know you're looking for love all the wrong places it just happens you you meet somebody when you're least expected and that's the way friends are I didn't know with I thought I'm going to go up and do this thing and and leave and you know yeah but we're friends for life",
            "start": 829.76
        },
        {
            "text": "somebody when you're least expected and that's the way friends have I didn't know with I thought I'm going to go up and do this thing and and leave and you know yeah but we're friends for life I just think about to me what I what I what I enjoy about the you know the close like friends that I've had like throughout time is that I'm just very different from them you know like in a lot of ways but we all have this thing that binds us too like the things that Greg and I met about you know were video games and kind of nerd culture Greg and I are very different people like extremely different which is I think like why our relationship works and like why it's hard for me to even imagine life when we frankly don't live together then they'll say aren't in each other's lives like it's hard for me to believe that that will ever happen to be honest and but like when I think about like my buddy Ramon like we met because we're both musicians we both like music but we aren't the same at all",
            "start": 870.72
        },
        {
            "text": "for me to believe that that will ever happen to be honest and but like when I think about like my buddy Ramon like we met because we're both musicians we both like music but we aren't the same at all nobody is yeah exactly and I always and have you found that because every one of my friends there is there's something really wonderful about them and there's something that's not so wonderful about them and you you love them anyway and uh you know a lot of times you even with especially with people that aren't necessarily your best friends you you kind of weigh well this is the downside is the upside do I really want this person in my life at all maybe that's not even a friend just coworker uh but you know some people you you know you know what it's too much of a downside I'm out of there but with those people you really really connect with you know you you take that downside and ride or die buddies that you know they're crazy they're this they're that or the other but I know",
            "start": 907.88
        },
        {
            "text": "with those people you really really connect with you know you you take that downside I got ride or die buddies that you know they're crazy they're this they're that or the other but I know you know yeah they got my back all the way yeah yeah and that's that's crazy cuz like I was saying going through it I feel like I had my friends early on I didn't meet too many people and then I got to IGN it's just like there's so many people that are so like-minded to where I'm at right now and right now being the last couple years of my life and the foreseeable future of my life I feel like when you're growing up you kind of go through the phases and all that stuff but you hit a point where it's like it doesn't matter that you're 20 and someone else is 30 or that there's someone whatever the ages are it's like you guys are very similar you're friends you know what you're doing the older you get I I I think if you keep your mind open you can be friends with a wider variety of people I have friends",
            "start": 956.08
        },
        {
            "text": "It's like you guys are very similar, you're friends. You know what you're doing. The older you get, I think if you keep your mind open, you can be friends with a wider variety of people. I have friends that are older than me, friends that are a lot younger than me. Uh, and I actually cherish uh both uh hopefully for the wisdom of those people who are older and the knowledge of what's new and what's happened, and those people that are younger cuz it helps keep me young. Yeah, I think you know, yeah, I think open-mindedness when you meet new people is key. Like as I get older, I mean that I always think about my buddy Doug who I met when I was in college and we were roommates, and I didn't know him at all, and he was probably like the last person I met in college that I was like ended up being really close with because we were only there together for two years. And I remember walking into the room, and we had a shared room together, and uh he had a Red Sox hat on and like a Patriots poster.",
            "start": 995.48
        },
        {
            "text": "close with because we were only there together for two years and I remember walking into the room and we had to share a room together and uh he had a Red Sox hat on and like a Patriots poster on the wall and I was like you've got to be kidding me I remember like saying my mom, my mom like cuz I'm a huge Yankees fan and a Jets fan and in Boston like that shit's really serious with a lot of people you know like I used to get a lot of crap for wearing a Yankee hat us we've had people damn near killed out here games yeah because of the Dodgers and the Giants it's a it's a regional thing or whatever and I like and I was just like you got to be kidding me like it's so this sucks you know like and we ended up just connecting in a major way I was one of his groomsmen in his wedding and uh it was one of those things where I don't see him anymore he lives in Columbus now his his wife teaches at Ohio State and um we just we're together at a fire pit like just like this in Maine",
            "start": 1041.48
        },
        {
            "text": "and uh it was one of those things where I don't see him anymore he lives in Columbus now his wife teaches at Ohio State and um we just were together at a fire pit like just like this in in Maine when he got married and was just like just like that we turned it back on but you know I do have to give a shout out not just because they're here but like you know I I've developed a great affection for Tim Gettys and Nick Scarpino too even though we haven't you know been as close as I've actually known Nick for a really long time but um you know well Nick is hard to like yeah you got these always Smoked meats Guys these are really special D ay sandwich these are really special dudes like you know that I'm I feel really blessed that I know them you know that like I've gotten to know them and and they've taught me a lot about myself and put me in check when I need to be put in check too which is good um and uh I think I'm developing a very similar relationship to them that I've developed",
            "start": 1079.36
        },
        {
            "text": "and they've taught me a lot about myself and put me in check when I need to be put in check too, which is good. Um, and uh, I think I'm developing a very similar relationship with them that I've developed with people my age. I have an eternal agreement it's hard because good topic it is a really good topic, it's hard for us though, calling it because I think that like so much of our time is spent like as fun as this is, this is kind of work right, like we are we enjoy doing the podcast but it's also there's a lot of setup that goes into this planning all the stuff on Patreon all the stuff uh that we do. We had Sunday dinner was the first time you and I actually hung out just to hang out in probably six years yeah like not with without another thing that we had to do on top of that, like we all go hang out and it's fun but then there's also like let's stop the party for a second we got to talk business for a few minutes we got to figure out what's going to be the show or who's",
            "start": 1118.24
        },
        {
            "text": "like we all go hang out and it's fun but then there's also like let's stop the party for a second we got to talk business for a few minutes we got to figure out what's going to be the show or who's cutting this or who's editing that or Nick one of the t-shirts going up or Tim when when are we going to get back on iTunes um January January by the time this is posted we should be totally good I I just never thought through how stupid our plan is to spread this information CU every day I get texts from people or tweets where are why aren't you on iTunes and I'm like we just oh right you're not watching the YouTube you're waiting for the iTunes oh you have no idea that every episode we're saying it's going to be this giant like delug of information of like seven episodes thatch up people will for and forget oh yeah tot de they're good anyway this it was a good topic I I think that friendship's essential yeah it's really important don't overlook it and to the advice we always give to the",
            "start": 1159.12
        },
        {
            "text": "for and forget oh yeah tot de they're good anyway this it was a good topic I I think that friendship's essential yeah it's really important don't overlook it and to the advice we always give to the younger people too don't like I feel like a lot of that drama you have with your friends when you're a kid or irrelevant it's the people that are ride or die with you that will you will bring with you throughout your life that are really the ones that matter yeah um and and to have a friend be a friend I know it's trite but it is true um you have to be a friend you have to be willing to give it there are people out there that in the guise of friendship will try to use you and you have to have your guard up and and it's a thing that happens I think to a lot of people when they're young you're that roommate that well nowadays it's all cell phones but never paid the phone bill or never did the dishes and and no sense of responsibility to the Friendship uh there just I'm going to give them credit",
            "start": 1196.8
        },
        {
            "text": "that roommate that well nowadays it's all cell phones but never paid the phone bill or never did the dishes and and no sense of responsibility to The Friendship uh there just I'm going to give get as much as I can get from you until you're done and then I'm done yeah um and I think hopefully as you get a little older you recognize those people quicker and eliminate them from your life and find the people that really I dig you cuz I dig you and uh I want to be the kind of friend to you that you need cuz that's what I need MH absolutely friends they're important yeah and we love them how many of us have we love you your best friends for watching this show of course we've gone long do you want to go to your topic real quick or do you want to sit on it for I don't think it's going to be a quick topic that's my only that's my only thing yeah then it should be saved until that was a great to that was a great let's end up on that do say much myself worth for once in your life can I can I",
            "start": 1246.24
        },
        {
            "text": "The Power of Friendship - The GameOverGreggy Show Ep. 56 (Pt. 4)\n\ntopic that's my only thing yeah then it should be saved until that was a great to that was a great let's end up on that do say much myself worth for once in your life can I can I say one thing you say whatever want I am so happy you guys came down I'm so glad you reached out and and said hey can we stay down there this has been great thanks for dinner um I'm I'm loving doing this around the fire pit and uh it's just thumbs up always a pleasure thanks for hanging everybody go too.com order C for video he sells a full set of them by the way you don't just have to buy one you can buy all 18 can you tease anything you're coming up in that people should should people listen for you obviously um well let's see uh some Mixels cartoons are coming up didn't have to sign anything for that uh but I've got a number of other things uh some great cartoons coming up that I'm going to be in some games that I'm going to be in um but you know they make you sign your life away and if I told",
            "start": 1297.84
        },
        {
            "text": "uh but I've got a number of other things uh some great cartoons coming up that I'm going to be in some games that I'm going to be in um but you know they make you sign your life away and if I told you what it was they'd cut my balls off okay we don't want that and then I talk like yeah your what would you do then that's a the old balls off n you don't hear about him enough I say Dave it's been a pleasure Everybody follow Dave go to davey.com daveo on Twitter and Instagram he's all over there multimedia man that's what we call Dao you're right on The Cutting Edge of this internet just like the GameOverGreggy Show is of course each and every week four sometimes five best friends gather on this fire pit to bring a random topic of discussion for your amusement if you like that head on over to patreon.com kindof funny and give us a dollar or something a little bit of money don't have any money no big deal you can go to youtube.com/ kindof Funny Monday through Friday each topic is broken",
            "start": 1349.52
        },
        {
            "text": "to Patreon.com Kinda Funny and give us a dollar or something, a little bit of money. Don't have any money, no big deal. You can go to YouTube.com/KindaFunny Monday through Friday; each topic is broken out for you until the entire show posts for free on YouTube and iTunes. Sorry for all the people who like... there's one kid who's getting like seven reminders that we had been trying to tell him this information, and it never got there. We apologize. iTunes as well. We'll be back on track in 2015. Whole bunch of exciting stuff's happening in 2015, including uh the Kevin Smith show. We're talking about a whole bunch of other guest stars. We keep talking to so be looking for that uh go by your GameOverGreggy Show cup at KindaFunny.com store uh follow us all on Twitter uh you know support your favorite band Spotify is not giving any money so just go there, listen, buy their albums otherwise follow... follow @taylorswift13 tweet Robert Kirkman say you want J in The Walking Dead.",
            "start": 1397.2
        },
        {
            "text": "band Spotify is not giving any money so just go there listen buy their albums otherwise follow @taylorswift yeah definitely oh tweet Robert Kirkman say you want J in The Walking Dead for Ezekiel yeah yes and uh yeah so is it time to do the Day of the Fire Pit firewalk yeah you're welcome to do it who's going first think that works with let me get the mic off you before you ladies and gentlemen until next time it's been our pleasure to serve you good one that was worth the dollar that was worth the dollar what Tim Gettys used to say every time we started I got feeling my pants",
            "start": 1439.16
        }
    ]
}