{
    "id": 560,
    "video_id": "VbziubkJUvU",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Portillo"
    ],
    "title": "Female Ghostbusters Cast - Kinda Funny Reacts",
    "description": "The entire cast of the new Ghostbusters movie has been revealed! Here is what we think.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1422398153,
    "duration": 352,
    "transcript_chunks": [
        {
            "text": "what's up everybody I'm Greg Miller and this is the producer Nick Scarpino hey Greg hey how are you I'm well I'm really good yeah just an average day here at the Kinda Funny house I'm chilling out and then all of a sudden bam there is a new Ghostbusters cast it's finally confirmed the all-female cast uh run me through who these people are we got Kristen Wiig got Leslie Jones Kate McKinnon and Melissa McCarthy this is like this is an All-star cast as far as I'm concerned as as what we're trying to get to to accomplish with the next ghost what are we trying to accomplish with the next ghost we want that same sort of camaraderie that we had in the first Ghostbusters I think right you had Harold Ramis you had Bill Murray had Dan Aykroyd these guys all knew each other going into this they had all worked together out live writers all stuff so they had a great cadence when they went into that which I think was the secret sauce right uh we've got we've got a similar cast here right we've got",
            "start": 0.2
        },
        {
            "text": "All worked together out live writers all stuff so they had a great cadence when they went into that, which I think was the secret sauce right. Uh, we've got we've got a similar cast here right, we've got three well uh Leslie Jones and Kate McKinnon are currently on Saturday Night Live okay um they're players on Saturday Night Live Chris Wig of course is one of the star sets of SNL of Saturday Night Live uh she left to do some movies not the least of which was uh Bridesmaids which was done by this Paul Feig guy, which was directed by Paul Feig and who's directing this movie. Co-starred Melissa McCarthy who's in the movie now too right so they've already got one movie under their belt together. Melissa McCarthy was also in The Heat with Paula Patton, which I still stand by was one of the funniest movies ever made that movie's good, The Heat is good, I thought it was hilarious, no one else did not a problem on my own man okay you're allowed to do that what do you think of the cast? Oh yeah.",
            "start": 34.28
        },
        {
            "text": "movies ever made that movie's good The Heat was good I thought it was hilarious no one else did not a problem on my own man okay you're allowed to do that what do you think of the cast gr oh you've opened Pandora's box I don't know if you know this I'm a kind of a big Ghostbusters fan and so I wasn't aware yeah I knew I hid it really well so like when they announced first off I mean when Dan Aykroyd was talking about doing a third one I was like just stop just don't do it and then they're like we're going to reboot it I was like please just stop don't do it and they're like we're going to do all girls I was like just fine don't do this I don't think people kept asking me are you mad about being an all female cast I'm like no that sounds cool I just wish they wouldn't do it but then I got over it they're going to do it they're going to do whatever they want to do fine I like Kristen Wiig yes love I the the blonde from Saturday Night Live what's her name Kate McKinnon I've seen her in some sketches she's funny I'm not familiar",
            "start": 68.56
        },
        {
            "text": "do it they're going to do whatever they want to do fine I like Kristen Wiig yes love I the the blonde from Saturday Night Live what's her name Kate McKinnon I've seen her in some sketches she's funny I'm not familiar with This Woman's Work I'm not familiar with Leslie Jones these middle two those are the ones those are the wild cards I don't know how they're going to be I I do not watch SNL um uh I don't know their work I'm not familiar with their work at all however the Kristen Wiig Melissa McCarthy connection that's a powerhouse here's the thing is the Melissa McCarthy I liked a lot in Bridesmaids then I feel like all the other movies she's been I I think I'm I'm rough on her because she's done bad movies I blame her for that Jason Bateman atrocity Identity Thief which was I had not have not seen but I heard that people actually walked out of the theater I watched enough of it to be like this is terrible why would you do this but then she's doing she's one of these people",
            "start": 101.04
        },
        {
            "text": "not have not seen but I heard that people actually walked out of the theater I watched enough of it to be like this is terrible why would you do this but then she's doing she's one of these people who has one of those she has one of those weird CBS shows CBS of course runs shows for 9 years that you've never seen an episode of and don't know how they exist but they keep going Mike & Molly is going that's one of them she's fine okay where is she going to be which Melissa McCarthy am I going to get I don't know and I guess really she's only done one bad thing a show I don't know about and then she's been in a bunch of movies I haven't seen yeah I mean I I give her the benefit of the doubt especially with director Paul Feig I think that she is going to come she's going to bring it with Kristen Wiig they're going to have that camaraderie they're going to have that fun improvisational style where they you know might let the camera go a little bit and just kind of find the take that they love",
            "start": 138.88
        },
        {
            "text": "wig they're going to have that camaraderie they're going to have that fun improvisational style where they you know might let the camera go a little bit and just kind of find the take that they love and that be awesome again Bridesmaids was so good Bridesmaids was so good but that's that's the creative force they had on there as you know on The Game of Thrones show where we have four sometimes five amazing people who who who have this awesome chemistry it's all chemistry really you know as long as they have a somewhat coherent plot which let's be honest how much of a coherent plot do you need for a movie called Ghostbusters I mean we all saw the second one yeah was yeah yeah whatever it doesn't matter Paint It Black the the main problem with this Ghostbusters thing and this is not a reflection on them Paul or anybody just lay down practical effects do the Star Wars route don't go all CGI don't shoot the entire thing on green screen please I mean they're going to they have to right at this point",
            "start": 171.52
        },
        {
            "text": "on them Paul or anybody just lay practical effects do the Star Wars route don't go all CGI, don't shoot the entire thing on green screen please. I mean they're going to have to right at this point it's too expensive. They're not doing it for Ghostbusters yeah but with Star Wars you get Caruso right you got JJ Abrams doing Star Wars you can get you're going to give him the extra $50 million or $100 million he needs to do practical effects right. With this all you really need is Melissa McCarthy with a proton pack in her hand so it's called a what it's a proton pack, proton pack what's the blaster called Neutron wand in her hand just blowing away a chandelier yeah comedy that's comedy gold I guess that's standing behind her I'm looking forward to it. I of course I don't know I mean are they going to redo the suit are they going to redo the packs are they they are right they're probably I mean are they going to redo the logo are they going to is there going to be",
            "start": 207.96
        },
        {
            "text": "know I mean are they going to redo the suit are they going to redo the proton packs are they they are right they're probably I mean are they going to redo the logo are they going to is there going to be are they going to not have the Ecto-1 like how do you reinvent Ghostbusters in but I don't know I I guarantee they're going to have a lot of images to the original series I don't think they're going to throw the whole visual aesthetic style out the window they're going to keep a similar logo I wouldn't be surprised if they slightly redesigned it but they've got to have the the the sort of cargo flight suits they've got to have those they've got to have some kind of proton packs don't get me wrong ladies and gentlemen out there I'm not saying I I don't want to see changes of course we all remember Extreme Ghostbusters they changed a lot of things different packs different traps it was fine but I just don't know what to do anymore I mean I don't think it's as dire as you're making it it's not",
            "start": 250.44
        },
        {
            "text": "extreme Ghostbusters they changed a lot of things different packs different traps it was fine but I just don't know what to do anymore I mean I don't think it's as dire as you're making it it's not dire it's just everything I've known for 30 years is being rocked off of its block that's all it is right it's not that dire I wouldn't think of it that way I think I would think honestly I think out of anyone that could do a good job with this series yeah I think this this cast and crew of people can not they can add to it I don't think they're going to make something I don't think you can ever get close to create recreating something as amazing as Ghostbusters but maybe you can just do something good and fun and not completely take the series and tank it into the ground I don't think these people I don't think they're going to do it I think I I have I have a good feeling about this okay I'm torn because obviously I love Ghostbusters so much I like the I like this cast I wish him the best",
            "start": 286.04
        },
        {
            "text": "I don't think they're going to do it. I think I, I have a good feeling about this okay I'm torn because obviously I love Ghostbusters so much. I like the I like this cast. I wish him the best but I don't know ladies and gentlemen what do you think of the cast for Ghostbusters the reboot? Let us know in the comments and make sure you share this video with your friends and keep coming back to Kinda Funny for all these Kinda React videos mainly about Ghostbusters or DC stuff. Something happens about Marvel we probably talk about in Colin and Greg live if you're lucky",
            "start": 323.32
        }
    ]
}