{
    "id": 565,
    "video_id": "XRKMTGQIry0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "The Rules of Men in Women's Restrooms - The GameOverGreggy Show Ep. 60 (Pt. 3)",
    "description": "Tim Gettys unsurprisingly wants to know what the rules are of men using women's restrooms.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1422432002,
    "duration": 894,
    "transcript_chunks": [
        {
            "text": "Tim yes, what's your do so I'm hanging out with my buddy LS and he's just like Tim how come there hasn't been any Tim topics lately on the show. And I was just like well you know what, when you're on the show, I didn't tell you this but in my head I was like I'm going to bring you a Tim topic. So ladies and gentlemen, for the first time in a while here is a Tim topic. Jesus, what are the rules of the women's restroom? When will you go in? When will you not go in? When are you like... you know when will you go in with someone else? Does it like... are you ever going to go in with another dude? Will you go in with a girlfriend or a girlfriend? What are the rules, see they're foreign. That's like going to Mars, I guess actually it's more like going to the Moon. I've only been there a couple times. I don't know what that meant. Why okay good fun um so I can think of him off top my head I remember one time when at both are IGN stories uh Jim Ryerson and I came in to work on a Martin Luther King Day when no",
            "start": 2.82
        },
        {
            "text": "what that meant why okay good fun um so I can think of him off top my head I remember one time when at both are IGN stories uh Jim Rygiel and I came in to work on a Martin Luther King Day when no one else came in literally no one else and this is Brisbane offices and we filmed a video where we ran around being stupid in the office doing everybody's job and one of the things we did was like Jim came out of the women's bathroom he's like oh you got to go in there it's crazy and they went in there they like a couch and stuff like oh that's cool like no one was there I knew no one was there there was no chance was there really a couch I think so yeah I forget if I'm merging IGN women's I forget if I'm merging that with another women's restroom or not but he made a bunch of things went in there to film and whatever and then the other one was at current IGN down down on second and Brandon  Cross the women's restaurant yeah it's just the same as ours I went in there for the zombie shoot",
            "start": 83.48
        },
        {
            "text": "there to film and whatever and then the other one was at current IGN down on Second Street and Brandon crossed the women's restroom, yeah it's just the same as ours. I went in there for the zombie shoot of \"The Last of Us\" where they tried to put the makeup lady tried to put uh lenses in my eyes, that's it was 15 minutes of blinding pain in my eyeballs but I was in the women's restroom so I remembered it, that's it, that's my experience, that's really that's it. Yeah there might have been one when I was a kid and your mom would bring you in when you're a little kid, yeah that was weird right, yeah real weird. I've only been to the women's restroom twice in my life so far, it was uh I worked I used to work at a movie theater and uh just for two specific times I had to go in there and clean it but yeah what were the specifics I was like uh I don't remember I just remember how to mop up something or whatever like there was something that I had maybe had to get a plunger and be like",
            "start": 118.92
        },
        {
            "text": "it but yeah what were the specifics i was like uh i don't remember i just remember how to mop up something or whatever like there was something that i had maybe had to like get a plunger and be like someone dropping a big deuce yes or no but apparently i'm told that from the cuz the women's restroom is actually more dirty than the men's restroom yeah i've heard that too actually that way i do not believe and apparently like women's uh feminine hygiene products just get like put there well yeah you can't put them down the drain cuz they're whole thing is that they absorb everything that's why have little trash cans they absorb and then they become like sentient yeah and then they come after kill me i do not oh man i do not believe that they're dirtier than men's rest cuz men's restrooms are like definitely the nastiest disgusting thing well did you ever did you ever go over to like one of your friends like not girlfriends but a female friend's house in college this was a very",
            "start": 157.08
        },
        {
            "text": "are like definitely the nastiest disgusting thing well did you ever did you ever go over to like one of your friends like not girlfriends but a female friend's house in college this was a very I remember I'm not going to name names mostly because I don't remember her name it's my friend Christy's friend went over a place and this was like when a woman's not romantically interested in you they don't care so you can actually see how they really live that's the thing though then once they be then there's that like one week period where they are interested in you and then all of a sudden they're like all right the interest is over we're together or something and then that all goes out the window but I remember I was I was shocked cuz my bathroom was disgusting like when I was in when I was in college like that was before I kind of understood what what it meant to be clean like cleanliness was a good thing like you should clean your bathroom like you know once a week not once every",
            "start": 198.56
        },
        {
            "text": "in college like that was before i kind of understood what what it was what it meant to be clean like cleanliness was a good thing like you should clean your bathroom like you know once a week not once every four months so like when I had roommates that like there would be like barnacles like not not even algae anymore it would be like full barnacles growing you know you're like i don't really go to the bathroom next to that but i feel like cleaning it but then i went over to this girl's house and i was like this takes the cake it was overflowing the bathroom was disgusting there was like you could tell where she had sort of just like touched the the top of something because there was a handprint there from all the dirt like the dust that caked on and then gotten wet and then caked on and then gotten wet totally disgusting but i will tell you this back to the original topic is that I've been in the female bathroom quite a lot and this happens when you get married",
            "start": 233.44
        },
        {
            "text": "Wet, totally disgusting, but I will tell you this back to the original topic is that I've been in the female bathroom quite a lot and this happens when you get married because when you get married, there's some unwritten law that you're allowed to pee as a unit okay, especially at Starbucks because they still have the male-female bathroom in most Starbucks. So if I'm waiting and you have your wife there, and the female door opens first, you look back to the rest of line, you go it's sort of like when you get to go no matter what your ticket is, you get to go in like through the airline gate with your wife no matter what because you're traveling partners. Same with PING, I'm like I got to go in she's going in with me that is a good that's a good move that's always the weird one I guess I happened in more female bathrooms recently because of that where you're in a giant line and there's like there's guys come out like it's already broken down the line's broken down, there's no woman waiting to get in.",
            "start": 270.72
        },
        {
            "text": "female bathrooms recently because of that where you're in a giant line and there's like there's guys come out like it's already broken down the line's broken down there's no woman waiting to get in this happened at Chick-fil-A when we were at chick-fil right before Kevin Smith's a line full of dudes and then there's a girl bathroom but like dudes keep coming in there was some like douchebag degenerate like idiots in like dealing drugs out of the man's bathroom so which I I just blew them up when I got out of there just like banged on the door like really loud that's why one guy came out afterwards like looking around like 10 seconds later and I and I was just already sitting at the table um but uh I like yeah I just like to **** with people uh no I mean in that situation I've been in many men women's rooms because what I was thinking about when the question was asked was like how drunk am I because at a lot of bars you know there's the woman's room and the men's room but the girls",
            "start": 305.24
        },
        {
            "text": "women's rooms because what I was thinking about when the question was asked was like how drunk am I because at a lot of bars you know there's the woman's room and the men's room but the girls like I'll always if a girl is like in line with me and the guy gets out of the bath like the men's I'll just be like do you want to go like you can just go pee in there it's not like no you pervert and she and and often the girl almost I don't think the girls ever turn me down she'll go in got to try to be a little no then I'll go into the wom's room I feel like I feel like at bars like after 10 o'clock there's no women's and men's room if they're individual rooms I've never been in a woman's room that's like multiple stalls ever like since I was a kid you know like when like when my no I've never done that either but like if it's like just one like that's why I really like I really really love places and I think it's becoming a more of a a bigger Trend now at restaurants and bars where it's just",
            "start": 342.28
        },
        {
            "text": "that either but like if it's like just one like that's why I really like I really really love places and I think it's becoming a more of a a bigger Trend now at restaurants and bars where it's just like we just have unisex bathrooms dude like at Chick-fil-A it's just like it's a bathroom just if you're a woman go use it you're a man go use it gives a **** you know and like I I'm noticing that Trend more and more but if there's like yeah chick-fil-a I used the woman's bathroom there because it was it's just a room it's like I would in other words I would never use a woman's room if it was like a real bathroom with multiple stalls but if it's just a room like what's the big deal the one thing I am thorough about when I if I've ever done like in the few times I've done this or whatever is I make sure to clean the seat and you know like like not that I pee on the seat but just make sure like I don't want to be the guy walking out if multiple guys use it and then a girl walks in there's piss",
            "start": 378.6
        },
        {
            "text": "Sure to clean the seat, and you know, like, not that I pee on the seat, but just make sure, like, I don't want to be the guy walking out if multiple guys use it, and then a girl walks in there's piss over the seat, and she's like, \"She thinks I did it.\" So I'd rather wipe someone else's piss off the seat than have a girl that I'm... And I have to admit, what's crazy is how long do you think it takes? So I was at Starbucks the other day, as I am most of the days, and there was just one dude that's like, \"That's where he takes his morning ****\" so if you just happen to be there and have to go to the bathroom when he's in there, you're going to wait a half hour. So I'm waiting, and I wait for two to three women to go in and out, in and out, finally I'm like, \"I look around; I'm like, 'I'm just going to do it.'\" And this is a standalone room, like you're talking about, but this is a busy Starbucks, the Starbucks over on Chestnut, it's a high-traffic area.",
            "start": 410.6
        },
        {
            "text": "like I look around I'm like I'm I'm just going to do it and this is a it's a standalone room like you're talking about but this is a busy Starbucks the Starbucks over on Chestnut it's a high traffic Starbucks and I'm going to get the look legit when I come out risk that's from the woman who has not been waiting that long but she's going to look at me like it's been 30 minutes and I've just abused the system and I'm just going to have to deal with that look what you do is you come in you lock eyes with there you give her the this look which you're hoping gets across the fact that there's a dude shooting in the other one for like 45 minutes and you had no choice cuz you had to go you're like I had to go and then you put your eyes on the ground and you walk right out you don't even sit down that's special it's just like looking at people women he doesn't know just pointing at his dick yeah sorry P dick no sex no okay well we're you always got to check yeah ex I guess no okay we're not",
            "start": 445.4
        },
        {
            "text": "that's special it's just like looking at people, women he doesn't know, just pointing at his dick yeah sorry P dick no sex no okay well we're you always got to check yeah ex I guess no okay we're not going to have sex this brings up just the point of like the more unisex kind of bathroom style I think is good if it's individual rooms I don't think there's any shame in that at all women have to understand that's what the point I'm trying to make is I try to pay it forward like if I'm waiting in line, women's lines are often really long right like and women have to wait typically have to wait longer so that's I'm saying like a bar X or whatever if I'm there and like there's a woman's room and a men's room and I'm waiting and a woman's already there's already a few women in the in the line and I'm doing man waiting a guy comes out I'm like well one you can use the bathroom first if you want and and women always seem to appreciate that I'm breaking down the gender barriers I guess is what",
            "start": 480.16
        },
        {
            "text": "I'm doing man waiting a guy comes out I'm like well one you can use the bathroom first if you want and and women always seem to appreciate that I'm breaking down the gender barriers I guess is what I'm saying oh yes you are you're an ambassador for I like well it's cuz you guys here are in are in California I noticed that like the architecture is just different here and there's a lot more uh confined spaces a lot more tighter quarters and here where I'm in Texas everything's bigger yeah you got like 40 bathrooms to every yeah basically imagine like going to the men's restroom and you got like 10 urinals like lined up and then you have like other two stalls yeah basically and then the women's restrooms are like two like like stalls on both sides it's like yeah they and not to mention like the sinks are like four or five sinks in there like ready to go yeah I think I mean that's not just Texas that's most of California where you're not living in San Francisco where like even the B even just",
            "start": 516.76
        },
        {
            "text": "are like four or five sinks in there, like ready to go. Yeah, I think I mean that's not just Texas; that's most of California where you're not living in San Francisco, where even just renting a bathroom is like $10,000 a month. You know, it's like half a stall. The city's only 7 miles by miles, so there's just not space for anything. The reason I'm bringing this up is because I...I don't care. There's no rules for me where it's just like there's no rules for me. There are rules, but there's no rules in the sense of like I don't even need to think that far. I'm going to throw some scenarios at you because I think you're thinking that all things being equal, no one's there; someone's in that room. Go: Are there women if there are two women behind you in the line and you're waiting for the guy room? I was at Starbucks and KFC, and there was two restrooms—one was a guy/girl and one was a girl—which is weird, but it's going to Colin's point that like more women usually take",
            "start": 555.64
        },
        {
            "text": "room CU I was at I was at Starbucks and KFAX and there was two restrooms one was a guy/girl and one was a girl which is weird but it's going to Colin's point that like more women usually takes a little longer as the line backs up so I was like so there was Guy/girl and girl the girl opened up first my wife was there she's like do you want to go in with me I got the world's weirdest looks cuz I was like yeah I'm going to go in but everyone's like wait you've got you're not supposed to go in there clearly it's delineated but it did anyway you don't care no that doesn't f cuz the thing is like I'm going to be clean like I my level of cleanliness in a restroom is dictated by the cleanliness of the restroom right um which you know some people might judge me on if there's pee on the wall I'm gonna pee on the wall but if there's and if it's halfway through saying when you know when you walk in and it's just it's just wet everywhere it's like you don't even want to step it's like at that",
            "start": 591.16
        },
        {
            "text": "gonna pee on the wall but if there's and if it's halfway through saying when you know when you walk in and it's just it's just wet everywhere it's like you don't even want to step it's like at that point I'm just like I'm going to try to get it in like and I get to be honest I get the majority of it in it's not like I'm just not giving a **** but it's like I don't want to step that close to yeah you we've talked about this before Colin and I conversation with Col the piss Mist you know you get super close peeing the Urinal the UR you're getting splash back when I know it's already wet and covered in other **** like I got nothing you got to give that Urinal a wide birth yeah man who but what you the real question is who's going to do the upper decker in the in the uh I've never done an upper decker we talked about this on the show right that you did that one time yeah no I never did an up who did that one of your friends yeah it was one of my yeah I think it was no who did no didn't we",
            "start": 631.68
        },
        {
            "text": "Decker, we talked about this on the show right? That you did that one time. Yeah, no, I never did an \"up\" who did that one of your friends? Yeah, it was one of my... yeah, I think it was no, who did no, didn't we? Was it Nick? It wasn't me. What my... I had a friend that pooped in a drawer one time in a hotel room. What and yeah, he was so Hotel was like not as advertised when he got there. He was like, \"This place is a **** hole.\" Went and was like, \"This like the sheets are dirty, none of this stuff's been done. You haven't done it like we don't have...\" Decker story though, so we pooped in the drawer. He pulled the drawer out, pooped in it, put it back in. Yeah, I like that there for four days. I thought we had someone on... I should have done that on the last day instead of the first. I thought the specific story is we had someone on the show that did an \"upper decker\" Ren boom! It's when you poop in the top of the top of the tank, the tank of the no Tim's going to do that every time he comes to that",
            "start": 673.84
        },
        {
            "text": "Story is we had someone on the show that did an upper decker Ren bomb. It's when you poop in the top of the tank, the tank of the toilet. Tim's going to do that every time he comes to that bathroom; we're going to find it like Tim. We know it's you. You can't prove it. I almost want to tweet out about Coke, but see for me, it's like I feel like it's been increasingly frequent now where I need a pee and it's just like there's a couple dudes waiting to go to the bathroom with a girl's bathroom free, and I'm just like, \"All right, I'm just going to do it.\" And like I feel like a bunch of the dudes in line judge me. It's just like, \"I need a pee, dude.\" Are you ballsy enough to have to go number two in the women's bathroom? Though yeah, I I I often don't. I mean, I'm not a big public number two-er. Oh yeah, I have no choice if I got to go; I'm going to go. Yeah, if I had to, I mean whatever. I would definitely do it. But the other thing is, I found very few women that are like down to just go in the men's.",
            "start": 707.76
        },
        {
            "text": "yeah I have no choice if I got to go I'm going to go yeah if I had to I mean whatever I would definitely do it but the other thing is I found very few women that are like down to just go in the men's restroom and do their thing if they have to like so it it makes me happy Colin that you say that they're out there oh no they're definitely out I mean when everyone's drunk in a in a bar at midnight or whatever everyone will just you just have to pee like I'll **** pee anywhere you know give me a give me a discreet place to pee and I'll **** do it I got one good friend that every single time we go out to a bar she ends up having to pee and for some reason every time I'm with her the girl's bathroom is closed or the line's too long or whatever so I need to go she she's like Tim just come with me please into the the men's restroom and just stand and it's one of those things where it's like usually there'll be some problem like the stall door is gone or like Comic-Con which just doesn't",
            "start": 746.56
        },
        {
            "text": "Me, please, into the men's restroom and just stand. It's one of those things where it's like usually there'll be some problem, like the stall door is gone or like Comic Club, which just doesn't have a door - it's in the middle of the dance floor, that's so weird. So, there've been like so many times where I'm just like standing there while she's peeing; I'm just like, \"Guys, just no.\" Just things are happening here. I'm like, \"Well, this is my life,\" good friend. I got out of a movie the other day at the Kabuki, and apparently like three or four movies had let out at the same time, so every bathroom had a line around the block. The guys sort of realizing this were like in and out, in and out, in and out, in and out - right? One nice guy looks over and sees this line of women that's curving around the building for all this. Get in that bathroom, and starts fair like asking women very politely, \"Hey, we're all cool with it; I don't give a **** if you guys want. I will walk you.\"",
            "start": 788.16
        },
        {
            "text": "around the building for all this Pur -> around the building for all this Pure\nget in that bathroom and starts Fair -> get into that bathroom and starts Fair (no change needed, but \"Fair\" is likely a proper noun referring to a game or show)\nlike asking women very politely like hey we're all cool with like we don't give a **** if you guys want I will walk you into the men's bathroom and like into each stall -> like asking women very politely; he'll walk them into the men's bathroom\nand it took maybe five milliseconds before it like occurred to a woman like this I have to because everyone was they've been waiting for like 10 minutes and there's nothing worse than having to pee after a movie and like your brain just starts to break down you can't find because you made it that far two hours in you're 30 minutes in I got to pee but I can make you get the credits like I made it and you get out and there's a giant line -> and it took maybe five milliseconds before it occurred to a woman she had to go; everyone was waiting for 10 minutes, and there's nothing worse than having to pee after a movie\nand like your brain just starts to break down you can't find because you made it that far two hours in you're 30 minutes in -> and your brain just starts breaking down because you've been holding it for 2 hours, 30 minutes in\nI got to pee but I can make you get the credits like I made it and you get out and there's a giant line yep so that was really funny because I just as I'm I'm I'm starting you're you're peeing and you hear that most foreign of sounds where you start hearing a women's voice in the bathroom you're like no she's just outside oh no she's in the stall right next to me and there there was like five women when I walked -> I got to pee, but I can make them get the credits; it was really funny because as I'm starting to pee, you hear a woman's voice in the bathroom\nand there there was like five women when I walked -> and then there were five women when he walked\n\naround the building for all this Pure get into that bathroom and starts Fair like asking women very politely; he'll walk them into the men's bathroom and into each stall. And it took maybe five milliseconds before it occurred to a woman she had to go; everyone was waiting for 10 minutes, and there's nothing worse than having to pee after a movie. And your brain just starts breaking down because you've been holding it for 2 hours, 30 minutes in. I got to pee, but I can make them get the credits; it was really funny because as I'm starting to pee, you hear a woman's voice in the bathroom. And then there were five women when he walked.",
            "start": 833.28
        },
        {
            "text": "foreign sounds where you start hearing a woman's voice in the bathroom, you're like \"no, she's just outside\" or \"oh no, she's in the stall right next to me.\" And there were like five women when I walked out and I was like, \"well, whatever.\" What are you gonna do? What are you gonna do? What are you gonna do? Hey, they call that movie \"Mr. Peabody\" and the Women... Good topic, good topic, great topic",
            "start": 868.0
        }
    ]
}