{
    "id": 1796,
    "video_id": "15J9QYcN4NM",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "E3 Predictions - Kinda Funny Gamescast Ep. 73",
    "description": "It is E3 2016 prediction time! GET HYPE! (Released to Patreon Supporters 06.03.16)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1465563600,
    "duration": 5229,
    "transcript_chunks": [
        {
            "text": "What's up guys welcome to the first ever episode 73 of the Kinda Funny Gamescast. As always, I'm Tim Gettys joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hello. Hello. Good to be here. Reunited once again. Congratulations on a successful Kinda Funny Live. I'm one day we'll get you on a podcast with Jeff Gerstmann. It needs to happen. He's always like my substitute. Yeah. The cooler, better version of me. And that's one way of looking at it. I mean, he is one of the coolest user videos. A hundred percent hands down. I'm still working there. I'm still trying to get that title. You have quite the look on right now. This is a great look. This Metal Gear. Well that I don't know if that's how you want to model. That is not how you model jackets. No. Is it? So you model your boobs. You want in your jacket? Well on my way. But yeah, one day I want to, I want to talk to Jeff because he has a lot to say and I have a lot to listen to him say. Yeah. Have you",
            "start": 0.0
        },
        {
            "text": "So you model your boobs. You want in your jacket? Well on my way. But yeah, one day I want to, I want to talk to Jeff because he has a lot to say and I have a lot to listen to him say. Yeah. Have you listened to our Patreon exclusive one on one episode yet available at Patreon.com/KindaFunnyGames. One dollar gets you that one. And if you've never donated before then there's like 18 hours of podcast. Good, good, good, good. Yeah. So for the uninitiated over there, you can go to Patreon.com/KindaFunnyGames. Get all types of goodies over there. You get this show early. You get a, which you're going to want it this week. This one I can tell you right now worth the dollar, worth the dollar. But if you don't want to do that, YouTube.com/KindaFunnyGames, everything will be distributed as time goes on. Um, not the goodies though. The goodies, those are exclusive. Yeah. Um, today we're going to talk about E3 predictions. Yay. Wonderful. I've been really not",
            "start": 45.16
        },
        {
            "text": "will be distributed as time goes on. Um, not the goodies though. The goodies, those are exclusive. Yeah. Um, today we're going to talk about E3 predictions. Yay. Wonderful. I've been really not looking forward to this E3 just in the sense that nothing to my taste is necessarily going to be there. Nintendo's, you know, not exactly been, you know, showing its best hand. Sure. But as we get closer to it and as I made this list of things that may or may not be there, oh man, E3 is the best. E3 is the best. There was nothing better than the pre-E3 hype. The only thing better is the E3 hype. And then there's that post-E3 discussion. Yeah. My God. Is E3 really the best is the best, Colin. Is it the best? It's the best. It's fun. It's exciting. There's things happening. You see your friends, you see some developers, you see some announcements, too many friends. You don't really, I don't want anymore friends. I got a car, got a call. The you have a lot of people on Facebook.",
            "start": 83.96
        },
        {
            "text": "your friends, you see some developers, you see some announcements, too many friends. You don't really, I don't want anymore friends. I got a car, got a call. The you have a lot of people on Facebook. That's all there is. That's all there is. Now you get to go down there. Maybe you see some of your Insomniac friends. I will maybe see what some of my show you. VR game. You go out for some Indian food, maybe Jeremy Dunham rolls by and says you want to go out for some dinner. I can't sustain all these relationships forever. I mean, no you can't. I mean, but I mean people die. It's okay. Yeah. Someone's going to die eventually. I realized my excitement for E3 when I was talking to everybody at Kinda Funny Live 2. Oh yeah. And they're all, cause they're all just like, Oh my God, it's how stoked you. I'm like, wow, it is very soon. That's the thing about it. I think E3 is happening. E3 is happening. Will it be exclusive merch? Probably not. That'll be exclusive swag.",
            "start": 134.66
        },
        {
            "text": "how stoked you. I'm like, wow, it is very soon. That's the thing about it. I think E3 is happening. E3 is happening. Will it be exclusive merch? Probably not. That'll be exclusive swag. Uh, no, that's the thing is E3's definitely snuck up on me this year cause Kinda Funny Live was right there and now we're like, Oh good to take a breath and it's like, Nope, there I, I'm planning E3 for us. There's a million emails. And so like today booking that Thursday being as tired as I am, wait till you see the Thursday that was, I was like, this won't be a bad day. I'm like, Oh motherfucker. So I mean, speaking of all that, I want to get, get right into, well first off, shout out to Patreon producer Steven Insler once again, the homie making things happen over there on Patreon. Kinda Funny. Thank you. I'm going to do a scene as this is the E3 predictions episode. I want to, you know, let the people know what we know about E3. We know that on Sunday EA will",
            "start": 170.06
        },
        {
            "text": "Kinda Funny. Thank you. I'm going to do a scene as this is the E3 predictions episode. I want to, you know, let the people know what we know about E3. We know that on Sunday EA will have its press conference of sorts. Yeah. EA Play. I think they're calling it 1 p.m. Pacific Time. AK the only time that matters then Bethesda on that same very Sunday, 7 p.m. Pacific Time Pacific Time. They're going to announce some shits. Monday is when things get real. Microsoft 9:30 a.m. per huge per you to come in, drop some bombs, right? Ubisoft, Ubisoft, however the hell you want to say ubiquitous. You be Monday 1 p.m. liquidus. And I really hope that at that conference in the middle of it, you see here comes the money and Vivendi comes out and it turns out they bought him on stage at that for a moment. It's like all w w then Sony 6 p.m. coming in to wrap up the day. Give me a pound for ignoring that dumb PC conference. Oh yeah. Hey everybody who wants to look at the keywords that",
            "start": 205.32
        },
        {
            "text": "that for a moment. It's like all w w then Sony 6 p.m. coming in to wrap up the day. Give me a pound for ignoring that dumb PC conference. Oh yeah. Hey everybody who wants to look at the keywords that light up a different colors. Then Tuesday Nintendo coming through without even a direct. They're just doing Zelda all day. Yeah. They're a Nintendo Treehouse as they call it now. Tim. Audrey Drake will be repping. Will she? For sure. I mean she always does. I like Audrey a lot. Now Tim, yes, that's a lot of content happening. It is. What are we doing around it? We're doing everything around it, Greg. So all day Sunday and all day Monday around those conferences we, you, we will do and you will get a pre and post show of every conference. So pre leading into into it, you get at least a half hour, 30 minutes before every conference for sure. We're alive on Twitch.tv/KindaFunnyGames. We talked about it, let you know what we think is going to happen. Even in addition, last minute",
            "start": 256.0
        },
        {
            "text": "hour, 30 minutes before every conference for sure. We're alive on Twitch.tv/KindaFunnyGames. We talked about it, let you know what we think is going to happen. Even in addition, last minute stuff after this episode happens, then post show, we're going to do the Gamescast Spectacular where we do our breakdown and kind of analyze, right? Discuss all of the announcements and shenanigans that happened. Now two things on that front. If you're not one of these Twitch kids, you're not going to be able to, you maybe use catching news late. You're worried about missing it. All the post shows, the Gamescast Spectaculars will go live on YouTube.com/KindaFunnyGames pretty much immediately after and iTunes and SoundCloud and all the podcast, wherever you get the Gamescast, be there with the exception of the post show for PlayStation. When the PlayStation press conference ends, we are doing a live PS I Love You XOXO. Tim will be on it. I will. We'll all have your reactions",
            "start": 305.9
        },
        {
            "text": "there with the exception of the post show for PlayStation. When the PlayStation press conference ends, we are doing a live PS I Love You XOXO. Tim will be on it. I will. We'll all have your reactions there. We'll put that up as usual. We're not going to make it wait till nine AM. That'll go live in all the same place as usual, which is similar. What's happening with this show. But put a pin in that for one second because that happens Sunday and Monday, all these live things Tuesday, the show starts proper at noon when usually when Nintendo's conference ends, but now they're streaming all day. So who cares? Noon, the doors open. We are live streaming Twitch.tv/KindaFunnyGames from an undisclosed location at E3 with all sorts of guests, reactions, all sorts of cool stuff and shit. I can say shit, shit for you. Then Wednesday and Thursday, we throw off the shackles the first time I think like four or five years, I'm not shackled to a live streaming desk and we go play games and",
            "start": 344.88
        },
        {
            "text": "I can say shit, shit for you. Then Wednesday and Thursday, we throw off the shackles the first time I think like four or five years, I'm not shackled to a live streaming desk and we go play games and we do let's plays for you and we go do Gamescast and we go do all this different stuff and YouTube.com/KindaFunnyGames is populated with amazing content. Yeah, that was the thing. You know, last year we had a lot of feedback about what you guys thought of our E3 coverage and a lot of people loved it. We sat with Gamespot the entire time to the show and that was awesome. It was so much fun, but a lot of people were like, oh, I wish we got more let's play reactions or this and that. We're going all out on that. So we have been talking about it really is it's doubling down on what worked well with for us last year. Last year you guys came out in droves for the Twitch pre and post shows. So we're doing those again. You liked the interview stuff. So we have one day of that on",
            "start": 381.0
        },
        {
            "text": "worked well with for us last year. Last year you guys came out in droves for the Twitch pre and post shows. So we're doing those again. You liked the interview stuff. So we have one day of that on Tuesday here on Twitch.tv/KindaFunnyGames and then the rest. Yeah. Podcast breakouts, let's plays here and all these different things. We're just free to go do whatever and actually listen to what you want to see. If there's something that we don't have book that's breaking. That's huge. So keep it locked to YouTube.com/KindaFunnyGames. Now pulling the pin out similar to how the PlayStation press conference will end and we'll do a PS I Love You instead of a Gamescast. We are doing today something interesting. What usually you'd expect us to open with what are the predictions for PlayStation Play the annual game. I invented for Colin where we go through and do all these different predictions and then Colin goes really too in depth and Em Daug gives him two fifths of a",
            "start": 414.88
        },
        {
            "text": "for PlayStation Play the annual game. I invented for Colin where we go through and do all these different predictions and then Colin goes really too in depth and Em Daug gives him two fifths of a point. He gets really mad. That's still going to happen but as obviously a PS I Love You XOXO segment, that's how we do it. So what we're doing here is putting the PlayStation predictions at the end of the Gamescast and that will be topic of the show in PS I Love You XOXO. It's the first time the Gamescast cross PS I Love You XOXO has ever happened. I'm pretty stoked about it. So if you're listening to this on Patreon.com/KindaFunnyGames, you got it early. Congratulations. You get to hear Tots, Tots, Tots before anybody else on Tuesday. So because of that, we're starting off with a bit of that Microsoft. So I couldn't hear you over Greg's lab swallowing. What'd you say? What's coming? We're starting on so rough life today. Here's, here's what we're going to do with the, with the",
            "start": 447.72
        },
        {
            "text": "of that Microsoft. So I couldn't hear you over Greg's lab swallowing. What'd you say? What's coming? We're starting on so rough life today. Here's, here's what we're going to do with the, with the Gamescast. We're going to each topic, we're going to look at the different devs and publishers, right? Kind of go through the games that we know will be there and the things that we think might be there and kind of decide what we think is going to happen. Is it going to be a hit? Is it not going to be hit? Will it be shown? Will it not be shown? You know, if she would sell last year's show, you're familiar by now. Yeah. We're going to start with the Microsoft. Now before we do that, I want you guys to remember that last year Sony dropped the E3 of Dreams. It was called the Year of Dreams and we've gotten a lot of little tidbits and teases that this is going to be the sequel to that. This is going to be the Year of Dreams 2. Now specifically hearing that about Sony, but me being the",
            "start": 488.88
        },
        {
            "text": "and we've gotten a lot of little tidbits and teases that this is going to be the sequel to that. This is going to be the Year of Dreams 2. Now specifically hearing that about Sony, but me being the optimist that I am, yeah, I'm just going to hope that it's for everybody. Sure. Nintendo's already, you know, crushing my dreams, but everybody else needs to pick that up for me and they're going to raise me up to the skies and I believe that they will. So I'm going to be hopeful that all the good things are going to happen. So when I'm making predictions, I'm not predicting what I really think. Oh, you're swinging for the fences on this. You want to fucking want to hop out standing by it. Oh my God. I'm a stand fucking by him. Cop out. No, no, no, no. I can't wait. I fucking believe Colin. All right. So we'll see. I don't know when you're saying either your dreams. I was like, yeah, there were dreams. Was that I don't think the Media Molecule is ready to make Dreams 2. You know, no",
            "start": 526.06
        },
        {
            "text": "All right. So we'll see. I don't know when you're saying either your dreams. I was like, yeah, there were dreams. Was that I don't think the Media Molecule is ready to make Dreams 2. You know, no, no, no, no, no. I don't know. I don't know about all that. All right. Start out with Microsoft Scorpio. Will it be shown? Will it be talked about? Yes. Yeah. What do you think will be shown slash talked about? Uh, I think that they'll have a, so there's this thing. So Scorpio is for people that don't know is the, the new Xbox One code name apparently. Um, and it might somehow have something to do with Project Helix, which is the idea that they're going to start merging more closely. Xbox and PC Windows PC gaming together. Um, I do believe that Scorpio is not coming out this year, but I think that they have to say something about it now. Um, to, if anything, quell fear about it. Uh, that Xbox One is still viable and that Xbox One, the one you want to buy is still, you know, is still worth",
            "start": 567.26
        },
        {
            "text": "that they have to say something about it now. Um, to, if anything, quell fear about it. Uh, that Xbox One is still viable and that Xbox One, the one you want to buy is still, you know, is still worth it. Um, so I think that's the big part of it, right? For me and the Scorpio deal is going to be that, yeah, that's what we've talked about. Cause they leave at the same time and that one story, which we were talking about on Kinda Funny Live, right? Should've been broken into, I think they come out and they're like, guess what? Redesigned Xbox One, smaller, cheaper. It's here. We've listened to your complaints and your concerns. That's where it is. Here's this nice little price point for it. However, we are working, we are future proving, we are trying to make it better. We are trying to move you closer to this ubiquitous PC Xbox system. This is what Scorpio is and it's not ready for prime time. It'll be out sometime next year. A lot of vague things, right? So that you can get on board right",
            "start": 610.5
        },
        {
            "text": "closer to this ubiquitous PC Xbox system. This is what Scorpio is and it's not ready for prime time. It'll be out sometime next year. A lot of vague things, right? So that you can get on board right now and say, well, they, they finally made a smaller, cheaper Xbox and Gears is coming out, so why not get on board? I don't care. I don't, I don't need this. That and the other for how fancy it's going to be. Yeah, I think, uh, I think an Xbox One price drop might be in the order in order as well. They do a small one for sure. Uh, yeah. So the word is that there, you know, there's going to be a slim Xbox maybe there. I can't get any bigger. So, um, but uh, yeah, so I think that there's going to be quite a few hardware chats as well. There's also rumors that, um, Oculus, they're working on an official kind of VR partnership with Oculus. Um, so I wouldn't be surprised if that was mentioned as well in the kind of the hardware segment, but I think it would be foolish of them not to talk about",
            "start": 648.34
        },
        {
            "text": "kind of VR partnership with Oculus. Um, so I wouldn't be surprised if that was mentioned as well in the kind of the hardware segment, but I think it would be foolish of them not to talk about Scorpio because or whatever it will be called. It won't be called Scorpio, but uh, just because ignoring it doesn't make it go away and I actually think the marketplace is going to be a little skittish. Um, if you don't start talking about it now, a hundred percent people, if you come out and you say there's a smaller Xbox and you don't mention the fact that this thing that's all but rumored and all but true and Phil Spencer had been hinting at forever, then you're exactly where we are right now with PlayStation 4, correct? Where it's like, cool, Uncharted 4 is not and I was going to buy a PS4 for that, but I now know about that. There's this thing called Neo or PlayStation 4.5. So fuck that. Yeah, they, they unfortunately for Microsoft, they have way more time. It seems",
            "start": 692.24
        },
        {
            "text": "four for that, but I now know about that. There's this thing called Neo or PlayStation 4.5. So fuck that. Yeah, they, they unfortunately for Microsoft, they have way more time. It seems, it seems like according to the rumors before their console is ready, I still think it was, we'll get into the PlayStation predictions later. That's that Neo is imminent. So, um, they have, they have to say something because there's a probably more than a year between the conference and when Scorpio is actually going to hit market. And so they're going to have to sell a lot of back. They hope to sell millions and millions Xbox Ones in that time. If you give the market a reason to buy a cheaper and slimmer Xbox One, I think that's a smart move in the meantime in the interim. And those can obviously be on sale at the same time as well. So, so do you think that there'll be three at the end of the day, there'll be the Scorpio, there'll be the slim Xbox and then the normal Xbox. I think that",
            "start": 723.04
        },
        {
            "text": "be on sale at the same time as well. So, so do you think that there'll be three at the end of the day, there'll be the Scorpio, there'll be the slim Xbox and then the normal Xbox. I think that they'll be, I think they're going to, I think you'll have three moving around, but I think by the time Scorpio comes out, the slim Xbox will be the replacement for the big Xbox. And I think that they'll start liquidating those other Xbox Ones. If they haven't really stopped production already, I don't know. You know, I don't know anything about that kind of stuff. So in terms of Microsoft's thing, it's just that they need to push more Xbox Ones. That Xbox One is bloated and ugly and huge and probably way too expensive to make. So I think that they, they're not stupid. They see the PS4 and they know that a more powerful machine is way slimmer and way smaller and way sleeker. And I think that they can do better with Xbox One. I think they know that. So and the bricks outside of the system, it's",
            "start": 754.6
        },
        {
            "text": "that a more powerful machine is way slimmer and way smaller and way sleeker. And I think that they can do better with Xbox One. I think they know that. So and the bricks outside of the system, it's just like a whole mess. It's the Xbox One's kind of a mess when you really look at it in terms of like the, the hardware itself. So I think there's a lot of refinement that they can be done. And I think that that's going to be out way sooner than Scorpio. But by the time Scorpio comes out, I think the fat Xbox will be a relative. HoloLens. Will it make an appearance? Possibly. I don't know. I mean, I, I'm not so sure how one's ever going to make it the market, but it's a cool piece of hardware. They could talk about it. They did last year with Minecraft. I mean, it made sense, but unless they really have an intention of selling this thing and I'm not so sure they do. I wouldn't be surprised if it had something like it had last year, but smaller even where it is just like one, a mention",
            "start": 786.08
        },
        {
            "text": "really have an intention of selling this thing and I'm not so sure they do. I wouldn't be surprised if it had something like it had last year, but smaller even where it is just like one, a mention here or a mentioned there about the future and what they're possibly coming up for. And then yeah, on the show floor, there is a demo similar to how it was last year, right? Well, you're getting into this multiplayer match. Let's use HoloLens for it. And then you go and play. But yeah, the fact that they have been so quiet about HoloLens and there haven't been all this leaks and VR is running away with the conversation. I don't know if it's the right time to jump out and try to make a deal out of it when it is going to be a year dominated by Oculus and PSVR and Vive. And I think if you can come out and say, all right, cool. Like we are partnering with a Oculus, you know, there is going to be some integration here. That's a stronger message than we're still working on this tech. Don't",
            "start": 820.04
        },
        {
            "text": "come out and say, all right, cool. Like we are partnering with a Oculus, you know, there is going to be some integration here. That's a stronger message than we're still working on this tech. Don't forget about it. But I think that's farther off than people really give credit for backwards compatibility. Do you think it will be a big deal at the conference? No, I don't think so. It'll be another mention that last year we talked about. We debuted calling on backwards compatibility and now more than two or whatever X number of titles are available for you. I think it's like one of your bowl points when you're getting the ball rolling about what's happened in the last year of Xbox. Yeah, I don't think it'll make a big deal. It wouldn't make any sense at this point unless they had like some, I don't know enough about what's going on over there. Unless they had a series of substantial games that have yet been ported. I don't think it's worth talking about again. It would sound a little",
            "start": 853.52
        },
        {
            "text": "I don't know enough about what's going on over there. Unless they had a series of substantial games that have yet been ported. I don't think it's worth talking about again. It would sound a little redundant. All right. Get into the games here. Gears 4. We can assume there'll be a gameplay demo. Oh yeah. Gears 4 will probably be the marquee title though. Yeah. Crackdown 3. Yeah, that'll be there. Yeah. The big question for me, do you think that they'll do the multiplayer beta available right now? Deal with that. It's possible. I don't, they'll probably use something like that with one of their games. I don't know that that's going to be that game. Cause there's Sea of Thieves floating around as well, which I think is going to need a beta. And so I don't, I don't, I'm not quite sure what, like what their plan is with Crackdown 3, but they, they must show way more of that game. I think that that game's just cursor early in getting news every day for Kinda Funny Live and",
            "start": 887.62
        },
        {
            "text": "sure what like what their plan is with Crackdown 3, but they, they must show way more of that game. I think that that game's just cursor early in getting news every day for Kinda Funny Live and just reading about video games every day as I do. Like I just don't see that much shatter about Crackdown and, and I think the game looks really great. It's been quiet for so long. Yeah, but they need to start revving the engine again. They announced it too early. I mean, this is, this is a, this is a, they've announced almost all of their games too early actually. So it's with the exception of maybe Gears. So yeah, I think that that might be an, that might be an aside safe assumption to make, but I don't know. But Crackdown 3 will be a marquee title there as well. I think it'll be a marquee title and I wouldn't be surprised if it just went the usual way of Crackdown where they, it's not available right now for everybody. You put it with Gears. Remember that was the big run when",
            "start": 925.66
        },
        {
            "text": "marquee title and I wouldn't be surprised if it just went the usual way of Crackdown where they it's not available right now for everybody. You put it with Gears. Remember that was the big run when Crackdown originally came. That was the big deal when I got put in with Halo or whatever. Yeah. See my thing is I think that a so Crackdown obviously need to talk about a lot. I think Halo Wars 2 is the other big time that they're they'll show off and stuff. And my thing is they're either going to do the available right now for Crackdown beta or for Halo Wars demo. Okay. I w I think both of them will be announced. One of them will be a right now thing and one of them will be a down the road. So I thought the Halo Wars demo I think is more down the road. How far out is Halo Wars further out? I think that's a good Sega is making that right in one of their studios Assembly or Creative Assembly Creative Assembly. So I don't think that that that came to anywhere near being done. So I",
            "start": 958.1
        },
        {
            "text": "out? I think that's a good Sega is making that right in one of their studios Assembly or Creative Assembly Creative Assembly. So I don't think that that that came to anywhere near being done. So I would I would assume that they're not even remotely in alpha nonetheless beta. So I would say if you're going to have one of those games Crackdown would be the one you know cause I think Crackdown how they put a date on it. Is it's gotta be the fall or the spring. I don't think they have but I'll check around there. I don't know. I do not know. Um Sea of Thieves do you think that they'll have a nice demo for it during the conference? Yeah I think so. I I think you have to show Sea of Thieves because I feel like there's people that are interested in it. It's a different kind of game for Rare. And I wonder um I wonder if there's really actual actually a lot of enthusiasm around it or not. I think you have to kind of start revitalizing that as well. So that's the game you have to",
            "start": 991.18
        },
        {
            "text": "Rare. And I wonder um I wonder if there's really actual actually a lot of enthusiasm around it or not. I think you have to kind of start revitalizing that as well. So that's the game you have to sell. Yeah. Crackdown 3 just says 016 016. Yeah. I don't know that Crackdown makes it this year but I don't know that you even need it this year either. That's the other big thing. Sure. But yeah we'll see what happens. Cause I think ReCore supposed to be this year too. Right. So I think that we do you want to spread your games out a little bit? We'll see ReCore is the next one on the list. Do you think we get actual gameplay demo of that or just a gameplay demo in a release date? I think that that game's probably gotta be pretty much ready to go. That's an Armature game right? So that's being made in the States. It's been in development for a while. It's really cool. Gameplay last. I remember is the E3 trails. I don't think so. No yeah. So no way that's this year. It could",
            "start": 1028.36
        },
        {
            "text": "being made in the States. It's been in development for a while. It's really cool. Gameplay last. I remember is the E3 trails. I don't think so. No yeah. So no way that's this year. It could be. I think because I really don't I don't. I'm not so sure ReCore is going to be. It's a triple A game per se but I don't know that you know the bonafides of Armature and kind of what's going on with in a fun a and all that kind of stuff is really going to lend that to being a massive game. And I think that's a game you might want to just get out. That's not going to be a massive game at all. No that's good. That's one of those games that replaces the mid tier. I always talked about it right here is this game that Microsoft's behind but no it's not. I mean when you start looking at like I don't even a thermometer a barometer right? It's below Quantum Break for sure in terms of like how people are going to be hyped for it and what's going to happen. Yeah it's not getting TV",
            "start": 1061.58
        },
        {
            "text": "like I don't even a thermometer a barometer right? It's below Quantum Break for sure in terms of like how people are going to be hyped for it and what's going to happen. Yeah it's not getting TV commercials. Exactly. It's with a bunch of other games. Yeah no I know the best place to play the strongest Xbox lineup in years ever ever Killer Instinct. I'm sure we'll get something some character or whatever. It's huge. Cuphead I'm assuming will like during the conference. I think you get a release date for Cuphead too. Yeah. You think they make a big deal about it in the conference or is it just something that happens at the show? You know I think I would hope that they actually give it a release date and a like a standalone trailer not just an Xbox ID thing. I think that it's a big enough deal for them and it has been like like there's excitement for that game and I think that they they understand that and they know that and I think that hopefully it's a place where it's ready",
            "start": 1093.06
        },
        {
            "text": "deal for them and it has been like like there's excitement for that game and I think that they they understand that and they know that and I think that hopefully it's a place where it's ready enough to make big announcements about and I think that they'll kind of give it that promoted push that I feel like it's deserved and earned over the last couple of years with all the game of the show awards and shit. Yeah I can't I can't say for sure but it seems like Cuphead's one of those games that ID@Xbox identified and dumped money into and that game was supposed to be done way sooner and I feel like they went back to the drawing board with their extra capital and refine the game and I think it probably has to be ready to go at this point. Very complicated game to make because of the art style but I think you know that has to be this year and I would be surprised if that wasn't there and I'd be surprised if it didn't get released and I wouldn't be I wouldn't be surprised it was",
            "start": 1132.74
        },
        {
            "text": "style but I think you know that has to be this year and I would be surprised if that wasn't there and I'd be surprised if it didn't get released and I wouldn't be I wouldn't be surprised it was soon. I mean it should be I feel I feel like we've been talking about Cuphead forever. It's time to get that out because I think they did burn not goodwill but a lot of their limelight because it did when that debut of Cuphead everybody's like holy shit. And then it's been like okay yeah from what I from what I heard they went back to the drawing board a bit and added cause like the big critique was that there wasn't enough it's just boss fights. Yeah it was just boss fights. There wasn't platforming and stuff. And from what it sounds like if they went back and are having platforming stuffs which super awesome. I'm excited about that. Now getting into the more kind of completely unconfirmed stuff very speculative Battletoads. No I don't think so. I think that there's this",
            "start": 1167.94
        },
        {
            "text": "stuffs which super awesome. I'm excited about that. Now getting into the more kind of completely unconfirmed stuff very speculative Battletoads. No I don't think so. I think that there's this is the Crash Bandicoot of Microsoft. I don't think that I really personally do not believe Sony has any interest in and is not going to do Crash Bandicoot and I could be wrong and I really feel like the same things with Battletoads. I don't know like why you'd invest money in a series that's been dead for so long. It's nostalgic for some people and it'll be purchased by some people but we can see that you know they were wearing Battletoads shit and stuff because of Rare Replay and I think it's a red herring. I I don't know. I'd be surprised if it is it's a $0 game being made by some studio. Never heard of I don't think any of their like internals are working on Battletoads. I would love to be wrong by the way. I'm just being realistic. That's all. Halo 6. No we get a team. No no",
            "start": 1202.34
        },
        {
            "text": "Never heard of I don't think any of their like internals are working on Battletoads. I would love to be wrong by the way. I'm just being realistic. That's all. Halo 6. No we get a team. No no way. You don't think so? No. The interfere with Gears and stuff. You wait you interfere with Halo Wars. Hmm. See I think I think that at least a teaser is not at least at most a teaser I think might be a good idea just to kind of get that ball rolling on just the continuation specifically because Halo 5 was supposed to be the start of a new thing like to keep Halo relevant because at this point it is it's as relevant as it is. It's just going to keep kind of going but I feel like it needs that that fire of yeah it this year is Gears but Halo is coming still. Um I think it'd be good for them to keep that in the conversation and stuff. And I think a teaser would be a strong call for them. I disagree just because I think that we're starting to I mean we're already talking about",
            "start": 1236.88
        },
        {
            "text": "for them to keep that in the conversation and stuff. And I think a teaser would be a strong call for them. I disagree just because I think that we're starting to I mean we're already talking about games that are announced too soon. Games that have been in the limelight too long that like miss their arc. And uh Halo 6 is what a 019 game maybe like I don't I so it's like why would you ever ever say maybe 018 if you're lucky? So I why would you ever say anything about that game? Um now I think you just leave it alone and let you know I think they have to take some critical feedback but more importantly like I don't I said it before the game came out like I don't believe for a second that that game sold nearly as well as the other Halo games. And I think that they have to go back to the drawing board and figure out why that is and and um flush that out and figure that out and give them time to um you know 343 to make the game they want to make. So I",
            "start": 1281.0
        },
        {
            "text": "back to the drawing board and figure out why that is and and um flush that out and figure that out and give them time to um you know 343 to make the game they want to make. So I think it would be a huge mistake to announce a game two to three years before it's going to launch. Um even in a teaser and I liked the Halo 5 teaser. I thought it was very cute. You know I you know it was a desert and some of them I yeah it's a cute little kind of thing for people to wear the punch on the game bullshit advertising but uh but yeah to me I think you like yours take the limelight. I think that they understand that the trajectory of Halo is down. Um I think that's obvious. So um like years to have the limelight like yours looks fucking great and you know just let them and they have these other games that they have to get out like Scalebound and shit. It's like you don't want to you don't want to announce too many things. Yeah. So Scalebound do you think",
            "start": 1316.0
        },
        {
            "text": "them and they have these other games that they have to get out like Scalebound and shit. It's like you don't want to you don't want to announce too many things. Yeah. So Scalebound do you think that they'll actually give a release date? No I I think that when we saw Scalebound last year it was running like garbage. Um which I remember I was like wow I can't wait. They're even showing this. Um and I think they have a lot of work to do and I think Platinum is clearly spread very thin. And uh as you can see from their last few games that people just don't seem to like nearly as much. Their their stars falling like oh they're starting to fall. Yeah. So I think so I think they have a lot to prove with Scalebound but I think you only show it when it's time when it's ready. Um should they be at a Gamescom? I think that you'll see that there since that's when it was revealed the first time I think I think you'll get a trailer or some kind of mashup whatever but yeah",
            "start": 1352.44
        },
        {
            "text": "Um should they be at a Gamescom? I think that you'll see that there since that's when it was revealed the first time I think I think you'll get a trailer or some kind of mashup whatever but yeah you won't get a full fledged demo. You won't get a release date. Yeah. Any new IP shown? Yes. I'm sure like a big new IP. I mean yeah yeah maybe I don't I don't know what that could be. Um but yeah investing in new IP is smart. Like I was saying like I think I think both Sony and Microsoft suffer from the same problems which is going back to the well way maybe one too many times with some of these games. They need new they need new franchises. Um so it'd be smart to invest in that even if it's a second party and it probably is. And they are investing in that Scalebound new IP from a second party. Um we'll take away third party being published by the first party ReCore is obviously a new IP. So I think they continue to invest in that would be smart. That's how you I think those",
            "start": 1385.76
        },
        {
            "text": "a second party. Um we'll take away third party being published by the first party ReCore is obviously a new IP. So I think they continue to invest in that would be smart. That's how you I think those are the level of announcements you'll see just like you saw last year where it was like holy shit they're working on the NFL. Oh my God. So then the final thing for Microsoft do you think there'll be any big third party announcements on stage at the conference? I want to say yeah but then it just gets into this weird thing of like my knee jerk was like oh Mass Effect. But then it's like well EA's made such a big deal about that they don't they're not going to be at the show. Does this count? How does that feel? They had their own thing the day before but would they come out and do something special there? Um you assume Activision will be at Sony again. It just seems that's that's the new landscape. So then is it Ubisoft? You figure Ubisoft come out and they show off like Hey",
            "start": 1421.76
        },
        {
            "text": "special there? Um you assume Activision will be at Sony again. It just seems that's that's the new landscape. So then is it Ubisoft? You figure Ubisoft come out and they show off like Hey here at our conference we announced The Division whatever expansion multiplayer map here it is. Let's walk let's walk you through do the deep detailed demo like we sometimes do. I think I think EA will be there with Titanfall 2. Um I think that's a safe assumption. I mean that that is the home of Titanfall but that's that kind of makes an interesting point right? You think maybe they'd want to break out and go to PlayStation and be like Hey we're here finally. It's cause that that speech writes itself and they come out right? Ladies and gentlemen whoever from Titanfall 2 and the place goes wild come on. It's so exciting to be on a PlayStation stage. We saw a lot of success with Titanfall Titanfall 1. We're excited to be bringing to the PlayStation platform along with this",
            "start": 1455.12
        },
        {
            "text": "goes wild come on. It's so exciting to be on a PlayStation stage. We saw a lot of success with Titanfall Titanfall 1. We're excited to be bringing to the PlayStation platform along with this fucking Shuhei Yoshida mech you can get into. Yeah I see I see the opposite way where I don't think Titanfall 2 is going to be like a huge game. And uh especially in the proximity in which it's coming out to Battlefield and Call of Duty. I think fucking that game's not going to do as well as people think. Um and so I don't think you score and the people that that you know you've danced with the one that brought you and at least the Xbox fans that were there did did buy Titanfall. And so I think you talk to them and then you just put it out supplement or supplementarily on PS4 to get those gamers as well who are just interested. But I don't know if you want to fuck around too much with that. I think Titanfall still home is still on Xbox. So I mean out of all the third party games",
            "start": 1494.16
        },
        {
            "text": "gamers as well who are just interested. But I don't know if you want to fuck around too much with that. I think Titanfall still home is still on Xbox. So I mean out of all the third party games I think the Titanfall is probably the safest but they're interesting. No I'm with you. It's just one of those things of I think I don't think it would piss off as many Xbox fans cause I think a lot. I think if you own an Xbox you probably on a PlayStation 4 at this point. Not that I know that's don't get me wrong. I know there's plenty of people who don't but I just say that cause I know they're going to split the difference between both of them and I think EA is going to be at my at Sony with Battlefield. So um yeah that makes sense actually. So we'll see. I don't know who the hell knows. So moving on topic two we're going to go through all the third party guys that have conferences. So Bethesda EA and Ubisoft let's start with Bethesda Dishonored 2 demo release date. Uh yeah",
            "start": 1527.4
        },
        {
            "text": "So moving on topic two we're going to go through all the third party guys that have conferences. So Bethesda EA and Ubisoft let's start with Bethesda Dishonored 2 demo release date. Uh yeah you would assume so. November probably they've talked about it long enough. They've it's it's been known well long enough. Yeah. Arkane's definitely ready to go. Cool. Follow up for DLC. No I don't think so. I think you'll I think you'll talk about Fallout 4. I think we talked a little bit of those in PS I Love You XOXO. I think that the the ones they've announced are the ones that you're going to get. Um and I think it's time for them to move on. I think they're going to go quiet and Far Harbor was the big one. So it's like what you have a couple of supplemental if anything it gets mentioned in like and we also still have exciting things coming for Fallout 4 on top of Far Harbor which you just released for mods on these you know I think they talk about mods. I think they're about",
            "start": 1559.24
        },
        {
            "text": "in like and we also still have exciting things coming for Fallout 4 on top of Far Harbor which you just released for mods on these you know I think they talk about mods. I think they're about sales and they talk about the sustained support of it. New patches. I don't know that they want to do more content for Fallout 4. I don't I don't know that it behooves them to do that. It just doesn't seem like Fallout 4 is the same buzz at Fallout 3 yet. So uh I mean it has a substantial it's a fucking massive game but you know contextually speaking I don't know that it's worth it for them to do that. And Fallout 3 had five pieces of DLC including one only one Far Harbor type piece of DLC which was a Point Lookout. So um I think it's obviously going to be there. Uh but I don't know that it's going to be a linchpin. I don't know that anything from Bethesda Game Studios is going to be able to been at this particular conference. That was last year. Skyrim. Do you think",
            "start": 1601.68
        },
        {
            "text": "don't know that it's going to be a linchpin. I don't know that anything from Bethesda Game Studios is going to be able to been at this particular conference. That was last year. Skyrim. Do you think we'll see an HD collection version whatever for Elder Scrolls? I don't but I I don't think it's beyond their own possibility. I don't think you will but I don't think it's crazy. No I don't know. I feel like I don't know. It might be too hard to judge because I mean this is what I was saying at PS I Love You XOXO. It might be a little too harsh but it's just to say like I think people are kind of over the shit now in a way where it's just like let's see what you have. Go away and you know make something like we just got The Witcher 3. We just got Dying Light. We just got Far Cry 4 or 5. Probably these open world games that look better that run better that play better that are more fun. Like you got to figure it out and and so just take your time. You made",
            "start": 1633.28
        },
        {
            "text": "Far Cry 4 or 5. Probably these open world games that look better that run better that play better that are more fun. Like you got to figure it out and and so just take your time. You made hundreds of millions of dollars on this game. Just go away. But keep in mind I mean that's the thing. This is a work around a collection. We will work around to those issues right? Skyrim is beloved. Everybody. It's not it's not the same argument or problem that Fallout 4 has because it's a contemporary with those. This one is a callback to this world you did love. It's beautiful. It's still the same gameplay. It's still a clunky here and there but it's not in the same level of comparing it to The Witcher 3. It could be. It could be. The question then is like who's porting it and you know cause it's not Bethesda Game Studios and then which is possible. I mean they have other students that can do it. I just think that you remind people of the problems. I think Skyrim was a",
            "start": 1672.2
        },
        {
            "text": "cause it's not Bethesda Game Studios and then which is possible. I mean they have other students that can do it. I just think that you remind people of the problems. I think Skyrim was a beloved game. I think it is a beloved game but it came out five years ago and you know let's sleeping dogs you know live. Well so there's Elder Scrolls 6 and ETS. No no way. That game is so far away. Yeah. The same studio that does Fallout does does the Elder Scrolls game. So you there's no way that they that game is in pre-production I'm sure but no there's no way Wolfenstein. Yeah. I think that I think that I really do think that MachineGames will be there. So there's there's conjecture that MachineGames might be working on Quake which would be cool but I hope that that's not the case. I think Wolfenstein is going to have a new game that Wolfenstein: The New Order and The Old Blood were fucking awesome awesome games. And I think that it's time for them to show it. If",
            "start": 1707.34
        },
        {
            "text": "not the case. I think Wolfenstein is going to have a new game that Wolfenstein: The New Order and The Old Blood were fucking awesome awesome games. And I think that it's time for them to show it. If it's not this year it's going to definitely be next year. But I think you can see an Arkane like situation with MachineGames where they show the game and it comes out next fall. But that also doesn't seem to be in line with what Bethesda does. But then again they did that with Dishonored 2. So MachineGames has been quiet and I think that it's it's it's time and I'm so fucking excited. Like that's definitely what I'm most excited about because they are so good. So very good. Yeah. Doom DLC. Yeah probably. Yeah. Doom's people love Doom which I'm happy about. It did a really nice job. The new id Evil Within 2. Yes. You think it's a teaser trailer or a demo? What are we getting? I think so. I don't know that you do. So Tango Gameworks is Bethesda studio that does that game. Evil Within",
            "start": 1746.62
        },
        {
            "text": "new id Evil Within 2. Yes. You think it's a teaser trailer or a demo? What are we getting? I think so. I don't know that you do. So Tango Gameworks is Bethesda studio that does that game. Evil Within was a surprise hit. I think everyone that's safe to assume and I think it's safely sold much better than they thought it was going to do. I think the critical reception was great. The problem with this is I don't know if you stack MachineGames and Tango Gameworks in the same in the same space which and I think that MachineGames might be further along. That's my assumption. I don't know for sure because Evil Within seems so tortured that it seems like that studio needs a little bit more time. I don't know that you're going to get both of those but I think it's going to be one or the other. If it's both then in Bethesda is firing on all cylinders and that's gonna be fucking awesome. But Evil Within 2 is probably a 017 game and they're definitely gonna do another one. I can see you",
            "start": 1787.94
        },
        {
            "text": "If it's both then in Bethesda is firing on all cylinders and that's gonna be fucking awesome. But Evil Within 2 is probably a 017 game and they're definitely gonna do another one. I can see you getting them both. I think you just get them in different doses. I think yeah I think Wolfenstein or whatever MachineGames is working on is ready to go. And if it's Wolfenstein I think it is it's out this fall. I think it's that quick. I think it's that quick. That would be fucking awesome. But I think that the DLC came out last spring so I don't I don't know that they've had enough time. Yeah. We'll see. The good news is that they did develop as far as I know they develop all those SKUs internally and they're not. So The Old Blood the DLC wasn't on PS3 and Xbox 360 which means they were already walking away from that with fewer SKUs to make. So only PS4 Xbox One and PC could be quicker for them to make the game. They already have the engine. The engine is already beautiful",
            "start": 1831.38
        },
        {
            "text": "were already walking away from that with fewer SKUs to make. So only PS4, Xbox One and PC could be quicker for them to make the game. They already have the engine. The engine is already beautiful, already rendering the game really beautifully. So it's possible that it's ready this fall, but I don't know. I think those are both 2017 games. I would love fucking Wolfenstein quicker. That would, the minute that's announced, that's like my most. I feel like you get a deep dive of Wolfenstein at this press conference, whether it's fall or whether it's spring. And I think Evil Within is just a teaser trailer and then the logo at the end. Do you think that it's possible MachineGames is doing Quake? Anything's possible, but you, yeah, you'd really hope they, I think Bethesda is not stupid. I think they saw what happened here with people being excited about this Wolfenstein and this reinvigorated franchise. You know, finally somebody doing the name proud, finally giving this thing",
            "start": 1864.68
        },
        {
            "text": "I think they saw what happened here with people being excited about this Wolfenstein and this reinvigorated franchise. You know, finally somebody doing the name proud, finally giving this thing relevance again in the modern day. And I don't think you immediately gambled that away and put them on the Quake and say, do it again for the Quake. Yeah, I don't, I don't think so either. I think it's possible. Quake is under development somewhere, 100%, but I think it would be smart to let them do Wolfenstein one more time. Wrap that story up, that the new BJ story, and then go let them go to Quake and let that be out by 2020. Where I know I said BJ, it's BJ Blazkowicz. Everyone goes speaking BJs, go suck a dick. All right, Greg, thank you. Anything else for Bethesda? Um, I still kick around this idea that Prey comes back, but I, but I don't, but I don't know who would make, I mean, it's possible. I mean, there are two Arkane Studios, aren't there? There's been a lot of rumors about, about it",
            "start": 1896.68
        },
        {
            "text": "idea that Prey comes back, but I, but I don't, but I don't know who would make, I mean, it's possible. I mean, there are two Arkane Studios, aren't there? There's been a lot of rumors about, about it coming back. I've seen the last couple of weeks just on, yeah, I mean, that people have been saying that. I mean, I, I saw Prey five years ago. Prey 2. It looked awesome and it did look great. A great demo. I saw it when Skyrim was revealed. That's how long ago it was and it looked great. It actually looked better than Skyrim. Um, I think that's enough when you really think about Bethesda. See what's so intriguing about Bethesda. It's like the mirror image of Deep Silver in my mind. Like Deep Silver started to like rise in prominence a little bit, not as much, but then they just started like getting into bed and releasing random shit that like doesn't behoove like the long-term sustainability of that publisher. Right? So you get like Homefront and you're getting like they have Saints Row",
            "start": 1930.12
        },
        {
            "text": "into bed and releasing random shit that like doesn't behoove like the long-term sustainability of that publisher. Right? So you get like Homefront and you're getting like they have Saints Row, which is great, but then they're getting like Mighty No. 9, which people aren't really caring about, all these kinds of things. They're just kind of like middling, releasing these games. Like Bethesda seems to take care of its portfolio much more and for them to just release great games from great studios, a few a year, I think is the right way to go for them. I know that doesn't let them scale, but I think if they treat their stuff with great care as they've been doing, I think it behooves them. So I think when you think about a Wolfenstein, um, possibly Wolfenstein, the possibility of Evil Within 2, obviously Dishonored 2 has already been announced and coming out, you chatter a little bit off Fallout and Doom. That's almost enough, right? Like I just feel like you just walk away.",
            "start": 1972.24
        },
        {
            "text": "within 2, obviously Dishonored 2 has already been announced and coming out, you chatter a little bit off Fallout and Doom. That's almost enough, right? Like I just feel like you just walk away. Remember last year when we were going into this and doing pre and post on Bethesda, we were like, well, this is awesome. They won't do it again next year. And then they were like, they prove you wrong by coming out and having enough games, enough things. People care about that. They can't come out and do another E3 press conference. It's unbelievable. And if they keep cycling like this, that's why I say maybe you save Evil Within 2 for next year and that's when you announce Elder Scrolls maybe, but I don't know if you do that. Maybe that's when you announce a collection. That's when you bring back Prey, when you acquire a new studio. Um, that's when Wolfenstein is kind of coming out. So it gets the Wolfenstein 2 year to treatment. Um, it's, it's complicated, but I'm actually most",
            "start": 2002.54
        },
        {
            "text": "back Prey when you acquire a new studio. Um, that's when Wolfenstein is kind of coming out. So it gets the Wolfenstein 2 year to treatment. Um, it's, it's complicated, but I'm actually most intrigued by Bethesda with the exception of Sony. I'm most intrigued by that. What Bethesda does because I thought their, their press conference was quite effective last year. Do you think that Bethesda makes any appearances at the big boys conference? If they do it all, it will probably be at Microsoft. So although I think that they announced something that just never came to fruition or hadn't really, it's just kind of coming to fruition now and I feel like it kind of made them look bad. So I don't know that they don't need to do that. I don't, I, if I was one of these publishers, I wouldn't appear at anyone's thing. I just feel like we're doing our own thing. We're agnostic and we love everyone. I mean, I just don't think it's, I don't think it's good business. You know, that might",
            "start": 2033.36
        },
        {
            "text": "appear at anyone's thing. I just feel like we're doing our own thing. We're agnostic and we love everyone. I mean, I just don't think it's, I don't think it's good business. You know, that might be good business on the backend for them because they're obviously getting money, but optically I don't think it's smart. The only optic to it is I think it's an old way of thinking and the fact of, Oh well, we are a third party, so not every Xbox fans is going to, is they're going to watch Bethesda. So if I go to the Xbox conference and appear there, I'm in front of a new audience when in reality we all watch the same thing. And when you're doing a pre show or getting ready for the show, you really care about people are talking about what they already saw. So it's not like you're really losing them in the eyes. Yeah, we'll see. Yeah. Mm. Mass Effect: Andromeda. So many sports. Yeah. Man. What do you expect us to get? Release date really? Yeah. Like when you say release it, you mean like February",
            "start": 2064.62
        },
        {
            "text": "in the eyes. Yeah, we'll see. Yeah. Mm. Mass Effect: Andromeda. So many sports. Yeah. Man. What do you expect us to get? Release date really? Yeah. Like when you say release it, you mean like February blank or whatever a real day, February 17, whatever it is. Yeah. I bet we just get a year. I think it would be like trailer ends. Here's a year. I disagree. I hope I'm with, I'm totally want to fucking really stay with my own. I think they pushed it. I think they probably needed a few more months and I think that they're ready to, that they already have a date internally probably and they're, they're ready to go. I think it would be smart to announce that date. You don't want to tease the Mass Effect too much more. People are going to start getting impatient. It was probably a stupid idea if they were unsure the game was gonna be ready to announce it. They should have probably waited to announce it this year. But I think they're learning that they couldn't have foreseen that they probably",
            "start": 2096.28
        },
        {
            "text": "were unsure the game was gonna be ready to announce it. They should have probably waited to announce it this year. But I think they're learning that they couldn't have foreseen that they probably thought the game was going to be ready. I think that that game's safe to go in the Q1 and I think we get a date. That's awesome. I really, really hope that's true. Battlefield. We see extended. Oh yeah. That'll be huge. And I, that game looks great. Probably multiplayer demo use them. Yep. Then a Star Wars Battlefront. I'll let us, if there was the murmurings of the single player like DLC package, that could be interesting. But I think Battlefield 2 will have a single player campaign. I think, I think they mentioned it. I think they mentioned Battlefield 2. Oh yeah. Yeah. But I don't come out and talk Battlefield. Here's DLC. It's a new map. It's this thing. It's a tie into Rogue One maybe. And then here's what we're talking about. Battlefield 2 is coming. So",
            "start": 2133.56
        },
        {
            "text": "Yeah. But I don't come out and talk Battlefield. Here's DLC. It's a new map. It's this thing. It's a tie into Rogue One maybe. And then here's what we're talking about. Battlefield 2 is coming. So what with Star Wars, what do you think happens? So obviously this Battlefront DLC talk, maybe Battlefront 2 announcement or something, but anything else? Yeah, I think Visceral's game gets shown. Although I, I think that that game's far out, far out like so. So Visceral and Respawn are both working on Star Wars games. Third person ones. Apparently I think Visceral is way farther along. And so I think that that's a 2017 game. I think you show it. You have to kind of should have the pop of this game at this point. If it's a year to 18 months out, I think it's safe to do it. Star Wars has a lot of fandom, although they have to balance all this stuff with like the Star Wars Celebration shit and all that kind of stuff where they're going to announce things with Disney. So yeah, I don't know.",
            "start": 2172.58
        },
        {
            "text": "of fandom, although they have to balance all this stuff with like the Star Wars Celebration shit and all that kind of stuff where they're going to announce things with Disney. So yeah, I don't know. You have to balance that stuff out. I think Battlefront is definitely like a safe assumption, but I would love to see Visceral's game and I think it's time to name it. I think it's time to put a date on it, not a specific date, but a year and show us what it's all about. Bring Amy Hennig on stage, you know, do that kind of thing. I think it'd be great. I'd like to, I just don't think they're ready. I believe, I believe Titanfall 2. Definitely. Absolutely. Release date, the whole shebang. Yeah. Yeah. They, I mean, they already talked about how it's going to be in a release very closely. Like we already have a window actually. It's, I think it's something like three weeks before it's like September 9th to November 11th or something like somewhere in there. We know because they said it's going to",
            "start": 2211.54
        },
        {
            "text": "have a window actually. It's, I think it's something like three weeks before it's like September 9th to November 11th or something like somewhere in there. We know because they said it's going to be within weeks of Battlefield, which I think is a huge fucking mistake. But um, because they're going to, they're going to cannibalize their own game and Call of Duty is going to cannibalize it too. I think you'd really set thing in the spring to sit on it. But yeah, Titanfall 2 will be prominently shown. Anything else with the worth mentioning? I mean, I'm thinking I, I, so EA is like, I think you're going to see less mobile and all that kind of shit. Like that was the really grown moment last year. I think you'll see something from, um, you know, something Plants vs. Zombies related or PopCap related, which is fine. Some PopCap stuff. You're going to see them come out with somebody new, new IPs, new indie stuff that they're trying to go more something in the vein of Yarny. Yeah.",
            "start": 2247.72
        },
        {
            "text": "PopCap related, which is fine. Some PopCap stuff. You're going to see them come out with somebody new, new IPs, new indie stuff that they're trying to go more something in the vein of Yarny. Yeah. I don't think you're in gaming from Yarny 2 or whatever, but you'll get something like that. Right? Again, we are the company that makes these games that are juggernauts, so we can come out and actually finance these little games. These are different experiences. That'd be cool. And then do you think, God damn, for teller zero fucks given, spray and water everywhere. Does EA come out at anyone's a PlayStation or Microsoft's? Yeah, definitely. Yeah. The bad, the bad one when we're going the Battlefield 1, I think Battlefield at Sony makes sense and I think a maybe Mass Effect at Microsoft, but keep in mind the Battlefield that Sony does get in the way then of the Call of Duty thing Sony has been doing this generation. That's entirely, that's entirely true as well. But I think that, and that",
            "start": 2284.26
        },
        {
            "text": "in mind the Battlefield that Sony does get in the way then of the Call of Duty thing Sony has been doing this generation. That's entirely, that's entirely true as well. But I think that, and that could be in the, that can be in the fine print in the contracts, but I don't think Sony gives a fuck if that's going to be a problem. It's going to be for Activision and that could be something that they're not allowed to do. In which case, I think you, you switch those. I think Mass Effect goes to Sony and a Battlefield goes to um, to Microsoft. Although I think, I think Mass Effect's going to be a safe bet, a secondary or tertiary safe bet behind Battlefield and maybe Titanfall as EA games that would appear at the conferences. Um, so we'll see Ubisoft Watch Dogs 2. Yeah, absolutely. Just don't even fucking go South Park: The Fractured But Whole. It's the one we all care about. This is where it comes out and it gets fucking blown out of the water and you show what do you think we get? We just",
            "start": 2323.86
        },
        {
            "text": "even fucking go South Park: The Fractured But Whole. It's the one we all care about. This is where it comes out and it gets fucking blown out of the water and you show what do you think we get? We just got, do we get a demo or do we just get a trailer? Do we get a release? I think you get a trailer with game playing in it. Unlike last year's trailer, that was just them talking or whatever. I think it is showcasing stuff. I wouldn't be surprised if the ad it's extended to a point where there's some talking head out there explaining what exactly you're seeing like here. Cartman's dressed as a superhero and you see he's using this power to do this, that and the other. And I think it ends with like, yeah, we're aiming at spring 2017 kind of thing. Yeah, I think, yeah, I don't know that you put a date on it because of the history of the previous game, although it is a different studio. There was publisher problems with that game. Um, it was caught in the space between spaces and it was amazing",
            "start": 2360.0
        },
        {
            "text": "on it because of the history of the previous game, although it is a different studio. There was publisher problems with that game. Um, it was caught in the space between spaces and it was amazing that it was still good. It was great. Actually it was really fantastic. Um, but per Watch Dogs 2, I think Watch Dogs 2 is, is imminent. I think Watch Dogs 2 is October. Um, I think the game is almost done. I think that they've been sitting on it for a long time. Uh, they learned a lot from the original Watch Dogs, which I think was underwhelming to most people. Uh, Watch Dogs 2 is definitely confirmed that maybe they've been sending stuff. We've seen the logo already. We know everything's out. So I'm a little statement. Ubisoft put us saying that it, it'll be E3. Cool. So yeah, obviously that will be there. Yeah. I'm feeling good about it too. I mean, I feel like, you know, looking at, at Ubisoft's track record, it's like the Assassin's Creed was essence. I always say, I imagine this being very",
            "start": 2393.94
        },
        {
            "text": "be there. Yeah. I'm feeling good about it too. I mean, I feel like, you know, looking at, at Ubisoft's track record, it's like the Assassin's Creed was essence. I always say, I imagine this being very similar. Everything I didn't like about Watch Dogs, we fixed in Watch Dogs 2 or Mass Effect to Mass Effect 2. I mean, I, that, that, I think that all those changes were positive changes and I think it's super overrated, but yeah, you get, you, you learn and go Uncharted, Uncharted 2. I mean, yeah, you put out the game, you see what happens and Watch Dogs. See what people who set up with Watch Dogs is that that, that was, first of all, the first next gen game we'd ever seen, which is makes it kind of cool when you think about it. We didn't know what it was. We assumed it was from next gen console. They wouldn't say when they announced it, cause the consoles weren't out yet. E3 after E3, E3. Yeah. And then, and the game was kind of incubating for a while and I think that",
            "start": 2429.14
        },
        {
            "text": "They wouldn't say when they announced it, cause the consoles weren't out yet. E3 after E3, E3. Yeah. And then, and the game was kind of incubating for a while and I think that they were just the tip of the spear. So it's like hard to know what you're doing right or wrong. And so I think that they're just going to go back and they already have their engine. I don't think they have to like really fuck around with any of that kind of something. It looked fine. I think it's just the way it ran a little bit and also more of the content in the gameplay. So if they can just nail those things and Watch Dogs 2 is going to be a huge step ahead and that will revitalize what I think is going to be an Assassin's Creed like franchise that they're going to fucking run to the ground. I don't believe it's this year is my one thing. That's my one thing. I think that they've been, you know, like the box leaked or whatever this kid doing is whatever the hell it was today. But I",
            "start": 2462.22
        },
        {
            "text": "I don't believe it's this year is my one thing. That's my one thing. I think that they've been, you know, like the box leaked or whatever this kid doing is whatever the hell it was today. But I think, I think they're getting ready to get you excited about it, but I find it hard to believe that. But what, what, what comes from them this year then? Because there is no Assassin's Creed. Let's go through this then and then we can circle back to that. So Ghost Recon Wildlands. Yeah, I think that's got to be this year. That's got it. Is it, did they say 2016? No, but I, that's my prediction. Oh yeah. Then that's probably possible. I was going to say it's in the next calendar year. I think. I still think you got to get some of these other games that they released time to breathe. I think that they just released a fucking Tom Clancy game in December and then they released The Division. I don't know that you want to like continue to release these games that require groups of hundreds of",
            "start": 2488.42
        },
        {
            "text": "they just released a fucking Tom Clancy game in December and then they released The Division. I don't know that you want to like continue to release these games that require groups of hundreds of thousands or millions of people to play it. You know, like you don't want to cannibalize your own shit and then have to worry about getting cannibalized by other games. And I don't think you release that game next to Call of Duty and Battlefield. I think there'll be a fucking major, how well it's supposed to be this year. According to Ubisoft. Yeah, I don't believe it. I don't believe it unless it's a summer game, unless it's soon, you know, which is possible cause they show that game years ago. So it's like Ghost Recon Wildlands, we got, yeah. Then they show that game two years ago. I think it was last year was the debut. We've already fallen out on the ATVs falling out of the plane or whatever. Oh, okay. Then no, maybe it's not the show at all, but I don't think you released that game. They have to be smart",
            "start": 2518.54
        },
        {
            "text": "debut. We've already fallen out on the ATVs falling out of the plane or whatever. Oh, okay. Then no, maybe it's not the show at all, but I don't think you released that game. They have to be smart about prioritizing when they release these games and managing their portfolios. Like you don't want to go up against Activision games now, you know, any games like you just need, you need to, you need to go and at your own pace, they wait too long and they're gonna go up against Destiny 2 though. Wikipedia says 2017, so it's one of those games. Nobody fucking knows The Division expansions. I'm sure. Oh yeah, definitely. A bit about that. Definitely For Honor. Yeah. I mean it will be there for sure. They're going to do more with it. They made a big deal about it last year and everybody to walk away going, that seemed kind of cool and we really liked that guy's came. Now we'll get to see like him come back out with the cane and tell us more about the game. Yes. Then we get kind of to the question",
            "start": 2549.86
        },
        {
            "text": "that seemed kind of cool and we really liked that guy's came. Now we'll get to see like him come back out with the cane and tell us more about the game. Yes. Then we get kind of to the question mark. So Beyond Good & Evil 2. I don't know. I, do we even care? Is that even an E3 game? You know, do you know, but I think it is, I think it's definitely an E3 game in the sense of where else would they talk about it? Like they, they do, they would do that for the games journalists. They would do that for the people that are going to be like, Oh my God, and freak out in a room full of likeminded people. You know what I mean? I think that like those, those moments are things you need to think about when you're creating your, your press conference. I mean for that, what you're talking about, like you were talking about the core gamer, right? Like probably the people watching this. And so I would just do the PSX and granted it's not a, it's not a PlayStation exclusive, but I mean if",
            "start": 2587.7
        },
        {
            "text": "like you were talking about the core gamer, right? Like probably the people watching this. And so I would just do the PSX and granted it's not a, it's not a PlayStation exclusive, but I mean if you want a room full of fucking dorks like Colin and I, that's the kind where it is like it's finally happening. Holy shit. That'll go. A Splinter Cell. Does it come back? No, I mean, yeah, you have so much Tom Clancy shit and gestating. I don't know like why you'd want to, want to get too crazy with it. Far Cry 5. No teaser. No, no way. Too crazy. Now here's the Tim Gettys' pie in the sky. Prince of Persia. We have a hole with Assassin's Creed, so I'm thinking if there's any time to slide on in there, boom, surprise Prince of Persia game. That'd be awesome. Working on it. Here it is this fall. Jesus. Yeah. Who makes it though? I don't know. Ubisoft makes it, one of their 400 studios. I mean, I'm just quite, I'm just trying to figure out like who makes it and like where it comes from. I",
            "start": 2624.78
        },
        {
            "text": "Yeah. Who makes it though? I don't know. Ubisoft makes it, one of their 400 studios. I mean, I'm just quite, I'm just trying to figure out like who makes it and like where it comes from. I don't know that Prince of Persia has any residents. I think there's going to be a fall game, but I think it's going to be Watch Dogs. I just, I don't. Yeah, we'll see. I mean, we'll see. It's Prince of Persia, it's, it's been gone for so long, but that's one of those franchises that at any moment it can come back, you know, and I feel like it will at some point, you know, not now that Jake Gyllenhaal's moving on to The Division, you know, he's taking it as a curse to that game. Hopefully it leaves a nice little space for a good Prince of Persia. A Prince of Persia game would be dope if they were like, that'd be awesome. That would be fucking rad if they came out and said that. Yeah, I'm assuming Rayman we'll get something too. It's been, it's been a while. Let it go since Legends. So remember",
            "start": 2673.1
        },
        {
            "text": "that'd be awesome. That would be fucking rad if they came out and said that. Yeah, I'm assuming Rayman we'll get something too. It's been, it's been a while. Let it go since Legends. So remember games are excellent. No, they're not. They're games. What are you talking about? Pretty. Okay, fine. No, but they're awesome. They're awesome games. You're a hater, Greg. I am a hater. You're right. No, I admit 100% that I'm a hater of that and Crash Bandicoot. Oh my God. Fucking let them go. I don't even know. Let's let them die for a change. You know, the Rayman games did it well. They did die. They brought them back. Rayman Origins was great. Those two games were great. Didn't like them. You like them? Yeah, they were. They were awesome. You're crazy. I call Moriarty inside. Good job. Good. I feel like a winner today. Next topic. Nintendo speaking of winners. Um, so the show in Zelda, my predictions for this is that it is going to be the game of the show for people at the show. It is",
            "start": 2706.58
        },
        {
            "text": "I feel like a winner today. Next topic. Nintendo speaking of winners. Um so the show in Zelda my predictions for this is that it is going to be the game of the show for people at the show. It is going to be the talk of the show. Everyone's going to be like did you play Zelda? You know they're all going to be talking about it and it's going to go one of two ways. It's either going to be the second coming of Jesus or people are gonna be like they fucked up and I think that it's going to be good. I think it's going to be the former to that. And the further prediction is a little a little more nuanced is that I think that there will be a gameplay mechanic that is unique and interesting to Zelda that differentiates it from the Skyrims and the more open world things because everyone's expecting open world Zelda but I think there's going to be some gameplay mechanic mechanic that really ties this down to this is what the new Zelda is all about. I hope it's the second coming. You know",
            "start": 2742.34
        },
        {
            "text": "open world Zelda but I think there's going to be some gameplay mechanic mechanic that really ties this down to this is what the new Zelda is all about. I hope it's the second coming. You know what I mean? From every moment we've seen from that game is always like that's beautiful. That's cool. Wow. Is it going to be Skyrim meets Zelda which I would be all for. And so you really really hope especially when like there you know these leaks out of how long people are getting booked for for demos and stuff. Like it seems like it's going to be a deep ass dive into this Zelda world. And if that world is that fleshed out if there's that much to do that is super super interesting. There's rumors that it's a 90 minute demo. So I mean that sounds good. You know like that's a it sounds like the kind of demo that is endless. Sounds like the kind of demo that like they're just going to cut you off because they're just gonna be like okay go. Um you have two people and you say one",
            "start": 2785.06
        },
        {
            "text": "like the kind of demo that is endless. Sounds like the kind of demo that like they're just going to cut you off because they're just gonna be like okay go. Um you have two people and you say one guy you run that way. I run this way. And it indicates to me that you know it is open world. I think that's obvious. Um I'd be disappointed if that wasn't the case. Although I think we have to temper our expectations. I don't think it's going to be Skyrim. Um I think it's going to be um a more robust Hyrule that and I'm not saying you know obviously it's only a Hyrule or something like that. Maybe it's a Termina but it's going to be a robust kind of Hyrule that um that has side quests that had that's big and expansive. I don't think it's going to be Bethesda big. I don't think it's going to be Witcher big. I don't think it's going to be that dense. Um because that's not what Zelda is like at that point. What do you have there then? What do you really have is all the",
            "start": 2824.38
        },
        {
            "text": "think it's going to be Witcher big. I don't think it's going to be that dense. Um because that's not what Zelda is like at that point. What do you have there then? What do you really have is all the game. You're just not to have your dungeons and all this kind of shit. So got to have a mailman running around got the mailman you got every masks and all this and all this and whatnot. So I'm super excited. I think it's going to be great and uh I'm excited to see it. I don't know that it's going to be the second coming. I'd be shocked if it was anything but great though. Um they've been working on it. They took it out for a while. I think to retool it I think the retooling was mostly enough to do with NX but they might've been able to tweak the game in the meantime. And um well I'm most interested to see what this is like. When is it coming? And you know we're all tired of waiting for it. So let's like get going on it. Yeah. I definitely don't think it's going to be the second",
            "start": 2857.02
        },
        {
            "text": "most interested to see what this is like. When is it coming? And you know we're all tired of waiting for it. So let's like get going on it. Yeah. I definitely don't think it's going to be the second coming in the sense of it being one of those games where everyone is just like I've never experienced anything like this but I really do hope that it's it's a step up for Zelda and it's not just another Zelda because we've gotten to the point where we've been getting those and that's definitely not a bad thing. Another Zelda is still great but I feel like this this does have a lot to prove to Nintendo fans especially now when you know we're about to transition over the NX and this is that transition game. We all they've already said it's coming to both. So um that's important. I'm excited. I mean that that's definitely I mean believe it or not one of my most anticipated games just to see not necessarily to play it will be if it's great but I want to just see it like just",
            "start": 2890.5
        },
        {
            "text": "I mean that that's definitely I mean believe it or not one of my most anticipated games just to see not necessarily to play it will be if it's great but I want to just see it like just show it already. You know um they haven't I mean in my opinion I know that's not a popular opinion but they have not had a great Zelda game in many years. Now it's time to it's since The Wind Waker. That was the last one in my mind where I'm like this is a fundamentally fantastic 10.0 Greek game ever since then. I've just been disappointed with everything they've done and it's like the closest they've gotten to releasing a great game was a rehash of A Link to the Past. I was like great guys. So let's get down to fucking fundamentals and release the Zelda game and show us what you got. They have chops. We know they do. It's too bad. It's not gonna be on PS4 and Xbox One or will it and NX. I know you're out there. Uh Nintendo is also going to have a Q and A for Pokemon Go which I'm",
            "start": 2927.1
        },
        {
            "text": "have chops. We know they do. It's too bad. It's not gonna be on PS4 and Xbox One or will it and NX. I know you're out there. Uh Nintendo is also going to have a Q and A for Pokemon Go which I'm really excited about. You're going to be asking all the questions. Oh yeah. Is there a Charizard in the game? Yes. Take out you know Monster Hunter Generations Dragon Quest VII for one call. Buddy and a Tokyo Mirage Sessions. Hashtag Effie. So I guess there's like someone out there excited about that. Um so then moving on cause Nintendo doesn't have much. We're going to bulk in all the rest of the third parties that don't have their own conferences and you're starting with the big one. Activision. What happens with them? Obviously Infinite Warfare. Yeah that I mean that's there. That will be at Sony's conference. So that's not that fun to talk about. I think I think also at Sony's conference is Destiny DLC. Yeah. Um I don't think it doesn't need to is going to be there at all. Um",
            "start": 2965.48
        },
        {
            "text": "be at Sony's conference. So that's not that fun to talk about. I think I think also at Sony's conference is Destiny DLC. Yeah. Um I don't think it doesn't need to is going to be there at all. Um you do. I do. I think Destiny DLC and Destiny 2 teaser. I think I think what they do is Destiny DLC. Focus everyone on Destiny. Get back into Destiny. Destiny 2 will have its own event later this year October November maybe even December. Maybe it's a PSX something like that. Um and you announced it there. I don't think you want to fuck around with getting people confused and then cause then if you show Destiny 2 then it's like well all this new and great shit we're doing in Destiny 2 but you still play the old shitty Destiny and here's the deal. That's why you do a teaser trailer and you just expose that it's Ghost versus Ghost. Dinklage versus Nolan. They come right at each other. I see. I think it makes sense to release the teaser for the new one to get people excited but",
            "start": 3013.08
        },
        {
            "text": "and you just expose that it's Ghost versus Ghost. Dinklage versus Nolan. They come right at each other. I see. I think it makes sense to release the teaser for the new one to get people excited but then also be like and to build you up to give you something to do until then there's this because that way it does feel like you're not holding off waiting for the announcement of two. It's like okay we know it's coming. Yeah. Like this. And then you can kind of treat the expansion as Destiny. One is kind of a prequel gearing up for it both story wise and gameplay wise. And that's that would be fun for Destiny players. Um anything else from Activision? I don't think so. Conference around the show floor on the show floor. They got to show this fucking Ghostbusters game. Let me play this piece of shit. I want to see what this thing is all about. Don't forget to switch your weapons. Um and then 2K there's a whole bunch of Mafia Mafia. That'll be I imagine be it's big coming out",
            "start": 3052.36
        },
        {
            "text": "piece of shit. I want to see what this thing is all about. Don't forget to switch your weapons. Um and then 2K there's a whole bunch of Mafia Mafia. That'll be I imagine be it's big coming out party forward to Mafia. They're really looking forward to it. We already got a release date for that. October 7th. Really really excited. You're a six right? Six at the PC press conference. Yeah. Hey guys BioShock Trilogy will finally be announced. Yeah I think so. I don't know where or how you do that without announcing the new BioShock which is in development. So maybe I don't know. Do you announce it? Probably Microsoft's conference. Although I don't I don't know. I can't I was just thinking about that. Actually I said I'm like I can't wait. I can't wait to play by. I fucking love BioShock. I can't wait. And then that's when I'll go back to BioShock 2 and I'll finally go back to Infinite and beat it. Um but BioShock 3 is in development and um as sure as shit. And I",
            "start": 3090.0
        },
        {
            "text": "BioShock. I can't wait. And then that's when I'll go back to BioShock 2 and I'll finally go back to Infinite and beat it. Um but BioShock 3 is in development and um as sure as shit. And I don't know how far along it is. Um but I don't know that you would announce that game. I don't know that you would ask that trilogy too early. I actually think they're sitting on it to wait until the game's announced and then maybe having a release date and then you announce it closer. It's what's so Sony strategy for five years with every releases. So um that's why the Team Ico Collection for instance was such a red herring of when The Last Guardian was supposed to come out. Um so we'll see. I don't know that they announced it there. So then the big questions Borderlands 3 teaser no no way too early. They just released a game. Red Dead 3. You wish but that's not Rockstar style. Yeah. I don't know. I yeah it doesn't seem like something they would do. They'll announce it",
            "start": 3136.36
        },
        {
            "text": "no no way too early. They just released a game. Red Dead 3. You wish but that's not Rockstar style. Yeah. I don't know. I yeah it doesn't seem like something they would do. They'll announce it when they're ready. Rockstar makes their own events. That's the thing. So they're always it seems down on E3. So yeah I wish wish wish wish wish wish. That would be awesome. I think you're gonna get a Red Dead reveal a Red Dead 3 reveal within a few months at most of the game coming out. That's the one thing that I think I think that I think they might even announce it when it enters certification or something like that. Like why like why? Like they just saw what happened with Fallout and that was a five month lead up and you can even do it quicker than that. If they can keep their secrets and all that kind of something they have generally really good about it then I mean a map leaked and all this kind of stuff. But if you can just shut up about it and announce in August",
            "start": 3170.44
        },
        {
            "text": "their secrets and all that kind of something they have generally really good about it then I mean a map leaked and all this kind of stuff. But if you can just shut up about it and announce in August release in October that'd be awesome. Why not? They don't need it. They don't need a lead in that game. Doesn't need a lead in. I don't I I agree. I just don't think it's on the level of GTA where GTA could have been like GTA. You could do that. You can fucking announce that it's coming out tomorrow and that thing would sell a gazillion units. You need a little bit of lead. I think for Red Dead I think you need to remind people what it is and get it back into the consciousness because that is definitely a game that I fucking love Red Dead and they'd be like I didn't play Red Dead but I know everyone talks about Red Dead. So the next Red Dead I'm going to be all over. And I think that I think it's going to be called Red Dead Revolution. That's my guess. Hmm. Does it involve the",
            "start": 3210.72
        },
        {
            "text": "I know everyone talks about Red Dead. So the next Red Dead I'm going to be all over. And I think that I think it's going to be called Red Dead Revolution. That's my guess. Hmm. Does it involve the Mexican Revolution? Maybe. Okay. Square Enix. They have Deus Ex: Mankind Divided, Deus Ex. I'm assuming they'll announce the next GO game which will probably Deus Ex GO. Okay. Recently we saw a bunch of domains that was Just Cause GO Life is Strange GO Life is Strange GO be dough. Um rewind. Cause it also does. There's a Deus Ex Universe event on June 8th. Yeah. Then that makes sense. I think two major definitive isn't as review or not reveal but mentioned in some way at PS4's. Rise of the Tomb Raider. There'd be that. What? Yeah. What are you expecting out of your I mean Final Fantasy is the big chance to go there. Final Fantasy XV Kingdom Hearts 3 and Final Fantasy VII Remake. All right. Um I think a lot of those go into the PlayStation. They do remake my stuff. Um but yeah I think",
            "start": 3244.24
        },
        {
            "text": "chance to go there. Final Fantasy XV Kingdom Hearts 3 and Final Fantasy VII Remake. All right. Um I think a lot of those go into the PlayStation. They do remake my stuff. Um but yeah I think that uh XV obviously gets the the treatment. Kingdom Hearts. I mean Kingdom Hearts is always the weird interesting one where I'm always like I'm always like they're not going to show anything. I want them to show something but they're not going to but they always do. They always show something. So I think that they they continue that tradition at E3 and do show a new trailer. Um will it be the thing finally announcing the Star Wars or Marvel stuff? I don't know. I don't think this is necessarily the right time for that but I think that it's smart for Square to not give XV time to shine. I think it's really kind of like hit with everything. Just keep pushing because you've got to fucking make Square still sound like a good thing. Like the Japanese Square not just the Square",
            "start": 3295.04
        },
        {
            "text": "shine. I think it's really kind of like hit with everything. Just keep pushing because you've got to fucking make Square still sound like a good thing. Like the Japanese Square not just the Western Square which has been killing it recently. The Western Square is fine. I think because they they're firing on all cylinders. I disagree though. I think you let Final Fantasy XV come out. I think you even like left him on XV steel. So you come out and like let that mature. You have to remember that there's going to be Dragon Quest XI at some point too and that's going to be a big deal for them. So and I wouldn't be surprised if you saw Dragon Quest XI before you saw Kingdom Hearts 3. I just think I just still believe Kingdom Hearts 3 is really far away. I just don't I just don't believe that that game's any sooner than 2018. And so I just don't know that you I just don't know that you talk about it before 2017 maybe again. And I think Remake you're not going to see either. I think",
            "start": 3337.12
        },
        {
            "text": "that that game's any sooner than 2018. And so I just don't know that you I just don't know that you talk about it before 2017 maybe again. And I think Remake you're not going to see either. I think Remake I think that they might've realized that they might've fucked up with that a little bit and they should have messaged it better. And I think they should disappear for a while because I don't think you're going to see that one anytime soon either. The Final Fantasy XV is any indication. And since they insist on using a lot of the same fucking directors and producers on all their games which is dumb. And you know that the producer doesn't even know he's producing the game until he reads it on the internet. And so you know that's the kind of communication going on in Square. And we'll wait for the predictions for for me to give my thoughts on that. Um I'm getting texts. All right. Capcom. I'm sure we'll see Umbrella Corps in some fashion. Part is playable in the show floor. No",
            "start": 3372.64
        },
        {
            "text": "wait for the predictions for for me to give my thoughts on that. Um I'm getting texts. All right. Capcom. I'm sure we'll see Umbrella Corps in some fashion. Part is playable in the show floor. No one really talks about it but this is the announcement. The re the reboot of Resident Evil. You think right? Well so Street Fighter V DLC. I'm sure we'll talk about. And then there the rest of its questions the questions I have are Resident Evil. Yes. I think that's at Microsoft conference. Ooh Microsoft's. Yeah. Ooh that's good. That's a solid ask call. Then the thing is Resident Evil 7 or not Final Fantasy VII. Resident Evil 7 or Resident Evil. Resident Evil. I think it'll be I think it'll be Resident Evil: Something you know like I don't think it'll be seven though. See I think it'll I don't I think they won't have the colon. I think it'll just be Resident Evil because they're trying to stress that this is a new beginning that this is a new thing. And if you put a",
            "start": 3407.84
        },
        {
            "text": "think it'll I don't I think they won't have the colon. I think it'll just be Resident Evil because they're trying to stress that this is a new beginning that this is a new thing. And if you put a Code: Veronica on it. I think people are gonna be like Oh it's at least in some fashion. They're like ah it's not a real Resident Evil game. It's not the real thing I've been waiting for. Also be interested to see if it is Microsoft. I want to put it past him in a PlayStation thing. Going back to the roots. They're over working with Capcom very intimately on Street Fighter. Exactly. We've been at we're out here where I mean when people think of Resident Evil they think of it on the PlayStation. Like here we are we're here to talk. We thought it made sense to come back to PlayStation to show you Resident Evil. Man. That'd be awesome. I'm getting tingles. Adam boys does cartwheels in the background. Yeah. Classic Adam. Do we do we see Remake 2? Maybe. I don't know. That's",
            "start": 3447.12
        },
        {
            "text": "to show you Resident Evil. Man. That'd be awesome. I'm getting tingles. Adam boys does cartwheels in the background. Yeah. Classic Adam. Do we do we see Remake 2? Maybe. I don't know. That's something you show at E3. I mean they're working on it. They have this big salvo going on with the Resident Evil 4, 5, and 6 on next year. Car in chain consoles. The thing with Resident Evil is wherever it is it's coming out this year. That's the one thing. That's the one thing I'm confident about. Really? Yeah. Yeah. That's exciting. It's been a long time since Resident Evil 6 came out. I think people under under pre don't appreciate that. I think that that game has been in development for three years and I think it's ready to go. Definitely Devil May Cry and Mega Man. Don't Devil May Cry. No I think so. They tried with DmC: Devil May Cry. I mean Ninja Theory tried to do their thing with it. I don't think anyone really cared. Mega Man. I'm I firmly believe is in development. I'm insane forever. It's the",
            "start": 3478.4
        },
        {
            "text": "so. They tried with DmC: Devil May Cry. I mean Ninja Theory tried to do their thing with it. I don't think anyone really cared. Mega Man. I'm I firmly believe is in development. I'm insane forever. It's the guys from Dead Rising. I think it's entirely possible. I think that might be shown. I have a rumor. Right? Yeah. I think so. They have this cartoon coming out in 2017. I just don't think you launch that cartoon. I think the cartoon is definitely the canary in the coal mine. That's something else is going on. Why else would you do that cartoon? There's just no reason to out of the blue launch or Mega Man. Yeah. The one thing that gets me concerned about that is that the cartoon looks like fucking garbage. It looks like I made that that version of Mega Man. I literally I drew that Mega Man. I don't think no show me what your Mega Man looks like. Oh God. That's a stick figure man. With a cannon. It's pretty mega though. Does he have an erection and some kind of deformity coming out of his",
            "start": 3520.08
        },
        {
            "text": "think no show me what your Mega Man looks like. Oh God. That's a stick figure man. With a cannon. It's pretty mega though. Does he have an erection and some kind of deformity coming out of his back? Pretty much. Yeah. I but I don't know that Mega Man isn't Mega Man doesn't have power anymore. You know like I don't know that that's something you show at E3 but I do think a 3D proper triple A Mega Man game is in development and they better not fuck it up. That's all I'm going to say. They totally fucking dropped the ball. So many times Mega Man said disgrace. Don't fuck it. I should be embarrassed. WB. Yeah. We finally got there. Let me tell you what's going to happen. They are going to talk about what happens next with Lego Dimensions and I can't fucking wait. Number one I believe all the rumors and leaked images you've seen Supergirl and Green Arrow are real and they will be given away there. That is my prediction. I believe it",
            "start": 3554.64
        },
        {
            "text": "and I can't fucking wait. Number one I believe all the rumors and leaked images you've seen Supergirl and Green Arrow are real and they will be given away there. That is my prediction. I believe it cause I've seen it cause originally remember it was just the screenshots leaked of them. Like all right then video of them in the Lego Dimensions world leak. You're like all right well then maybe they're getting ready. Then they leaked in the little packaging. So it's like okay I believe they're going to be given away swag there which is interesting which I didn't know these toys life games did. But apparently every time you go to a Skylanders appointment they give you Skylanders. So it makes sense. So I'm stoked to get these toys. Let me tell you what and fucking see them and play with them. They'll come out later. I imagine whatever the next wave of it is but you imagine with that. Then you're going to come out and you're going to say time for year two of Lego Dimensions. It's",
            "start": 3598.88
        },
        {
            "text": "them. They'll come out later. I imagine whatever the next wave of it is but you imagine with that. Then you're going to come out and you're going to say time for year two of Lego Dimensions. It's more level packs. It's we're dialing back the team packs. I don't think there'll be a new disc based game this year. I think it'll be the next wave based and I think you'll get more DC characters. Obviously I think we finally get Harry Potter characters. If they are fucking crazy and things have worked out we get Star Wars characters. Maybe you get Marvel characters. I think that it's an interesting thing for them because they are still not promoting Lego Star Wars: The Force Awakens right. That's still something that's happening right now. That'll be there. They'll show that but we doesn't know who cares and so then how do you you don't want to mix the message that we have Star Wars as well but Harry Potter for sure. These DC people for sure. The problem is nobody cares about the handful of",
            "start": 3634.32
        },
        {
            "text": "cares and so then how do you you don't want to mix the message that we have Star Wars as well but Harry Potter for sure. These DC people for sure. The problem is nobody cares about the handful of people. I don't know where I think. Is that just a press release that gets announced? Is that just behind closed doors demos that you know it's all this stuff. Lame. That makes more people care about the end of my w thing was Lego stuff question mark. That's where I lead off. I'm so excited. Injustice 2. Yes. Thousand percent. That's one of my predictions to save it. Will that be okay. We'll say that then. Suicide Squad question mark. Something of that ilk. No. I mean that would that's what people when we did a recently we talked about Batman games right on one of the shows and what's next for Rocksteady. So many people chimed in saying Suicide Squad would be awesome. That'd be a good fit for them and it would be a cool fit for them because you have a bunch of heroes that are depowered.",
            "start": 3668.88
        },
        {
            "text": "Rocksteady. So many people chimed in saying Suicide Squad would be awesome. That'd be a good fit for them and it would be a cool fit for them because you have a bunch of heroes that are depowered. You know they're not Superman not breaking the world so you could have different things run on. I don't think that's what's going to happen. I and I also think that WB kind of gets it right now and especially after seeing the success of Batman because they were remember trying to fucking get a Dark Knight game together for The Dark Knight movie. Then it was garbage. They scrapped it and they just let Batman Arkham do its thing and they saw that explodes. There's no reason to force a Suicide Squad thing to try to make the movie or be in that realm so you have time to wait. Hopefully that movie is a success. You get to capitalize off of it later on and I don't think they're looking for the quick cash in. You do figure that they'll have the they're going to show on the show floor for sure.",
            "start": 3711.28
        },
        {
            "text": "is a success. You get to capitalize off of it later on and I don't think they're looking for the quick cash in. You do figure that they'll have the they're going to show on the show floor for sure. The Batman Arkham collection that leaves the door open of is Rocksteady ready. Are they up for something. Do they want to tease something. Is it their new game on any of these things. Do you see Shadow of Mordor 2. Yes. Although I don't that game is definitely coming and I think it's sooner than you might think but I don't know again where it fits. I mean Shadow of Mordor was big. Yeah. It's anywhere to the Microsoft's conference I think. Well sure. Sega always weird. There was have things going on. Somebody's going to be up when he's done. They've they've always done all the remasters. They got the Crazy Taxi and the Sonic Adventure and all that stuff. Shenmue, Skies of Arcadia. Maybe a new Sonic. Any of that stuff you think will be shown. What are those rumors of Shenmue, a Shenmue collection or",
            "start": 3743.68
        },
        {
            "text": "Crazy Taxi and the Sonic Adventure and all that stuff. Shenmue, Skies of Arcadia. Maybe a new Sonic. Any of that stuff you think will be shown. What are those rumors of Shenmue, a Shenmue collection or whatever. Yeah there was a Shenmue collection but they're not going to show that anywhere. Shenmue 3 is obviously in development so he's helping with them but no I don't I just don't think so. I can go away for a while. That'll be fine with me. Bandai Namco has been rumors of a Soulcalibur reboot. Yeah. Interesting. Yeah. I don't know. Tekken 7. It'll be that. Oh yeah. I'm pretty sure they'll confirm consoles all that stuff really state CD Projekt Red said no Cyberpunk 2077. Yeah. Witcher 3 DLC, Witcher 3 anything. I think you got your last piece of Witcher 3 DLC just now right. You would assume. Yeah. What was their big one. So I think that they're going to go dark for a while now. Double Fine. I'm assuming we're not going to get Psychonauts stuff. Nothing is a little too early for",
            "start": 3788.88
        },
        {
            "text": "assume. Yeah. What was their big one. So I think that they're going to go dark for a while now. Double Fine. I'm assuming we're not going to get Psychonauts stuff. Nothing is a little too early for that. That's a piece. We will get some VR talk for their the Psychonauts 2 game. Anything else. Nothing I can go from maybe a new game but that's not an E3 there. And then Epic has Fortnite, Paragon, and Unreal Tournament. Fortnite. Whatever happened. Yeah whatever it did. That never came out. No. Was that nothing. Four years ago. Yeah. I wouldn't be surprised for Epic says Fortnite dead but I have I have not kept abreast the situation. I'm sure there's an article out there somewhere or Epic says Fortnite dead. And then other games LawBreakers. Yeah yeah LawBreakers will be there at the PC Gaming Show. Do you think it's going to be a big deal. Yes. Although I don't I mean I don't care but I mean I love Cliffy but it's a PC game. I'm not going to but I think it will be a big game and I think the fact that",
            "start": 3829.36
        },
        {
            "text": "think it's going to be a big deal. Yes. Although I don't I mean I don't care but I mean I love Cliffy but it's a PC game. I'm not going to but I think it will be a big game and I think the fact that they've moved away from the free to play model is a big deal for that game as well. Yooka-Laylee. Oh yes. I don't think you see that anywhere that goes against the whole zeitgeist what they're doing. Yeah sure. Spirit of that game is its independence. Half-Life 3. No no I won't. It's the PC Gaming Show. Nintendo just announces like total like we lied Half-Life 3 playable Marvel games. Do you think we'll see Marvel announcements. No. I mean I'd love to know what Telltale is working on for because they announced that Marvel partnership forever but I don't think that's I mean I think your closest thing would be that they have the Lego tie-in ready to go. I think that would be what would make sense even because look at how like Telltale announced Batman right. Like they did it at the VGA or the",
            "start": 3870.48
        },
        {
            "text": "would be that they have the Lego tie-in ready to go. I think that would be what would make sense even because look at how like Telltale announced Batman right. Like they did it at the VGA or the game awards in just a trailer and that's how you would do it. So maybe that is around that but probably not. OK. And then but now we'll wait for PlayStation thing. That's when things get real interesting. And the last thing is do you think that we'll see in this kind of a broad question that goes even across the conferences. Do you think we'll see another Kickstarter style project like we saw with Shenmue. No not there. Maybe a PSX. That's not a thing you would do it either. And it's also the thing I think did it last year with what Shenmue wasn't showing PSX. I thought it was PSX. No was it. OK. Year of Dreams, bros. No I remember those. Oh right. Because that's when Bossman and all of them from games show us their mind and jumped on the chairs right. Right. It all ends together. That's",
            "start": 3920.24
        },
        {
            "text": "OK. Year of Dreams, bros. No I remember those. Oh right. Because that's when Bossman and all of them from games show us their mind and jumped on the chairs right. Right. It all ends together. That's still about a thing you do it either. That wasn't very popular move. So we'll call my little call. No I don't know. I think they learn. I think you do that once kind of thing. I don't think they go back to the well and there was a dumb thing to do. Cool. I was a PSX but now. Ladies and gentlemen it's time for Greg take it away. Tots, tots, tots, tots. That's right everybody. It's time for the first ever PS I Love You XOXO crossover with the Kinda Funny Gamescast. Hi Tim. Hi. Thanks for coming to join us. You're welcome. Tim are you aware of what we do every E3 Colin and I. I've heard a bit you know especially from Colin. What we like to do yes what we like to do is we like to predict what will happen at the PlayStation press conference. We make five predictions. Each one of us will",
            "start": 3956.8
        },
        {
            "text": "you know especially from Colin. What we like to do yes what we like to do is we like to predict what will happen at the PlayStation press conference. We make five predictions. Each one of us will make five predictions. Each prediction needs to be different. So we can't both say they're going to cancel the PlayStation 4. That's why we asked you to make backup predictions just in case you get there. Now of course there's five predictions. Colin Moriarty will find a way to break his into 17 parts. That way he can eke out tens of points to beat you and then make a big deal about it but then tell you you have the ego. That's how he'll do this. Don't try this happens on you. So Tim yes. Are you prepared. Oh my God. Yes. Would you like to lead off. I would like to lead off. I'm going to lead off with Final Fantasy XV. I think it will be at the Sony conference. I think that they will announce a PS4 bundle with Final Fantasy XV and the kicker to all of this Final Fantasy VII demo with Final",
            "start": 4004.0
        },
        {
            "text": "off with Final Fantasy XV. I think it will be at the Sony conference. I think that they will announce a PS4 bundle with Final Fantasy XV and the kicker to all of this Final Fantasy VII demo with Final Fantasy XV remake. exclusive to be a remake demo or is exclusive to PlayStation. No no no no not exclusive not exclusive. That day. The demo will be with everything. Yeah. But the bundles the cool exclusive fancy thing. But I think the big news is Final Fantasy VII Remake demo will be with 15. Are you going to buy the bundle. No I have a PS4. I know you're a big fan. I don't know. Just checking on. Never buy the game. Oh good. I'm glad. Thank you for doing that. And I will play the remake first. Colin what's your first PlayStation prediction for E3 2016. Where do I want to begin. Horizon will be shown. It will be delayed. They'll announce a game or they'll announce a release date of February 2017. So a specific date will be announced for February Horizon will come out. They'll apologize will",
            "start": 4042.0
        },
        {
            "text": "shown. It will be delayed. They'll announce a game or they'll announce a release date of February 2017. So a specific date will be announced for February Horizon will come out. They'll apologize will be a new trailer new gameplay Hermen Hulst will come on stage. Hermen come on my boy like you know we're sorry we need a little bit more time but to get you guys excited here. The system is mechanics game. They show it. It's probably going to be the biggest game that they show there and but I don't think it comes out this year. I think they dated for February 2017. Nice try Colin. That was one of my backups. You don't get to steal this for me. I'm swinging for the fences right away. Ladies and gentlemen the conference ends with a Naughty Dog teaser trailer. It's The Last of Us brand. Ashley Johnson's Ellie is not present. Those are my three parts to get some fucking points out of this thing because I think I think they're going to do a crazy person dude Uncharted 3 and then a",
            "start": 4099.92
        },
        {
            "text": "Ashley Johnson's Ellie is not present. Those are my three parts to get some fucking points out of this thing because I think I think they're going to do a crazy person dude Uncharted 3 and then a month later we had The Last of Us teaser trailer. That's all I'm saying. It's not crazy. It's Uncharted 4. You've had three months now two months now to make a fucking teaser trailer. It's not that hard. I had that as well. Last of Us Part II teaser trailer. But see I got I danced around there so I get more points. It was not a Last of Us trailer. I said the Naughty Dog teaser trailer conference ends with a two. See I did that. You'll learn. You peppered these in there. You get these little things. Gotcha. Like it's something. I had another slash but Mitch Dyer. All right. Okay good. Yeah. Say some shit. Don't get me wrong. I know it's wishful thinking on a lot of fronts but I do think that they seem to have this cadence now. That's how it's a man. You got to keep it going and I",
            "start": 4143.68
        },
        {
            "text": "Yeah. Say some shit. Don't get me wrong. I know it's wishful thinking on a lot of fronts but I do think that they seem to have this cadence now. That's how it's a man. You got to keep it going and I think that is also a fucking megaton way to end that I think because I think Sony's going to have a very very solid concrete thing of like here's this game and here's this is when it's coming. Here's this game and it got delayed but it's still coming. Here's this game and I think you need something that's looking far forward because I think that's what it is. I don't think it's going to be. We're showing The Last of Us Part II teaser trailer whatever to then lead you into thinking it's out next year. Yeah. No way Tim. What's your second prediction? I'm just going to jump around here. You know what? Fuck it. I'm going I'm going in order of how I had it. The Neo will be shown. It will be officially called the PS4K. Okay. $399 price tag. November 2016 release with a PS4 price drop",
            "start": 4178.08
        },
        {
            "text": "Fuck it. I'm going I'm going in order of how I had it. The Neo will be shown. It will be officially called the PS4K. Okay. $399 price tag. November 2016 release with a PS4 price drop down to 300. Now here's the thing. I'm at an extra little asterisk here. Earlier I was talking about the fucking Year of Dreams. We're getting the Year of Dreams. So he's trying to make motherfuckers happy here. This is doubtful but I don't give a fuck. I want it to happen. Some type of trade in service. Ah yeah. This is wishful thinking. Totally. I'm just saying I know cause you're the king of wishful thinking but Sony Sony has been been trying to make the people happy. Yeah. So I I think that it you know from a business perspective I can't wrap my head around how this would happen especially cause they aren't GameStop. Sure. Aren't you know doing this type of stuff but they are also the company that made the video about how to play your old games like talking shit to Microsoft.",
            "start": 4216.56
        },
        {
            "text": "cause they aren't GameStop. Sure. Aren't you know doing this type of stuff but they are also the company that made the video about how to play your old games like talking shit to Microsoft. So I do think that they understand the feedback they've gotten from all of this. And I wouldn't be surprised if even if this like the trading thing could just be some form of discount on the new one if you have an old one or some something but it's some way to appease people that already have a PlayStation 4 and either like enticing them to upgrade or letting them know that they're being thought about. The thought I'm of two minds on it. On the one hand they've had time to see this reaction see how mad people got get in try to they definitely have to figure out all of their phrasing marketing how they're going to tell you that this is a good thing but not something you desperately need. The other hand of course is that I am part of the crew that was like convinced that Oh they're",
            "start": 4262.32
        },
        {
            "text": "how they're going to tell you that this is a good thing but not something you desperately need. The other hand of course is that I am part of the crew that was like convinced that Oh they're launching the PSP Go. They'll have some kind of system for me to get my UMDs onto this device. I'll go into a GameStop and put it in a thing and get a little no fucking you got none of that shit. All right. Well I agree with you on the on the PS4.5 in terms of the price. I will say that I said I will say and this is not part of my prediction that it's going to come out alongside VR. October is what I said. So but I will say they'll also announce three different things about hardware. There'll be a PS4 Slim model announced and we'll come out the summer and we'll cost $249.99. I'm sorry. Is this 0? Yeah. Okay. Prediction. $249? Yeah. And they'll drop PS3 and Vita both to $99.99 each. I think they'll announce all of those things. So that I'm sorry run me through your the",
            "start": 4307.36
        },
        {
            "text": "sorry. Is this 0? Yeah. Okay. Prediction. $249? Yeah. And they'll drop PS3 and Vita both to $99.99 each. I think they'll announce all of those things. So that I'm sorry run me through your the prediction. So the prediction proper is PS4 Slim not the PS4K $249.99 out this summer. PS Vita $99. PS3 $99. Okay. Gotcha. Man. And for the record you agree with the Tim the Tim's $399 price point. You just left it off. Yep. Gotcha. Okay cool. My my Neo prediction was it's coming out October $399. It's awesome. No one's mad anymore. That's so funny. My second prediction October makes a lot more sense. I'm sticking with my November just for the sake of this. You guys won me over on the October. Number two for me Hideo Kojima is in the building. He takes the stage. He gives more details on his game with concept art behind him. Maybe there's a video teaser. Maybe but I don't believe it. I had that down as well. I had Kojima on stage. I'm glad you believe in me.",
            "start": 4346.56
        },
        {
            "text": "He gives more details on his game with concept art behind him. Maybe there's a video teaser. Maybe but I don't believe it. I had that down as well. I had Kojima on stage. I'm glad you believe in me. Thank you. I guarantee he does something there. You can't ask you. You can't have the one and only Hideo Kojima and not have them come out on stage and do stuff. Yeah. I think that's a good way to end it too. Just have them come out and it's just a team rallying thing. His name is one of the few names that has that power. I mean if you so here's all right so we're setting up a conference now. Now we're doing the fun thing where I get to build a fake conference. If if using what you're talking about and what I'm talking about we're at best a teaser trailer probably concept art you lead off with it. Fucking crazy ass montage you know PlayStation the best place to play great. And this way is darkness. And then just overthink ladies and gentlemen please welcome Hideo Kojima. And",
            "start": 4393.76
        },
        {
            "text": "off with it. Fucking crazy ass montage you know PlayStation the best place to play great. And this way is darkness. And then just overthink ladies and gentlemen please welcome Hideo Kojima. And like that place goes nuts. And he comes out and he gives this translated speech about how why he came to PlayStation what he's hoping to accomplish. Here's how my game looks you know concept art and dah dah dah the fucking stick figures. Yeah. Here's my redesigned Mega Man. You're not making Mega Man. I'll do whatever the fuck I want. I'm not to be trifled. All right. So we're on three now. Yeah. Number three Tim Tim Tim. Oh Destiny 2 teaser at Sony's conference. Okay. You think and you you're saying from what we're talking about earlier you're tacking that on what we're talking about early on the Gamescast available at Patreon.com. Kinda Funny. You're talking about tacking that on. So you think I believe if I don't know if they're going to Destiny 2 but I",
            "start": 4439.04
        },
        {
            "text": "about early on the Gamescast available at Patreon.com. Kinda Funny. You're talking about tacking that on. So you think I believe if I don't know if they're going to Destiny 2 but I do think it makes sense to be like here's the next giant piece of Destiny DLC. Yeah. And all one more thing kind of thing. And they just do it as what's all this thing. Yep. I think it'll be just a teaser but I do think it'll be mentioned at the Sony conference. Okay. Mr. Moriarty God of War 4 will be revealed. It will not be called God of War 4 it'll be called a God of War: [Subtitle]. It will be Norse related. Sony Santa Monica creating it 2017 release window. And it's going to be the showcase a game for Neo. Ah so you think they they introduce Neo explain to you what it is and like let's look at a game on Neo. It's God of War. We'll get into that. Oh my apologies. I'm sorry. I'm sorry. Didn't realize your three was bleeding into the four. They may have made up number",
            "start": 4483.68
        },
        {
            "text": "and like let's look at a game on Neo. It's God of War. We'll get into that. Oh my apologies. I'm sorry. I'm sorry. Didn't realize your three was bleeding into the four. They may have made up number three. Ed Boon gives us an Injustice 2 demo PlayStation get some exclusive character for the hell of it. I'll say Guy Gardner. Who doesn't love Guy Gardner with a fucking Guy Gardner Green Lantern? Oh he was a hothead though man who you'd like him. Colin you'd like him. He was fiery got punched out by Batman. Once no it was a big moment because that Justice League sucked Guy Gardner kind of sucks but he's one of those guys that sucks. So we all kind of like him. You know what I mean? He's bad. He's so bad. He's good. One time he turned into a guy called himself the warrior. This is after he gave up the Green Lantern ring. He would like more for this really muscular tattoos. Really dumb really dumb next prediction. Tim my boy Crashy B he's coming out. Crash Bandicoot will be",
            "start": 4520.96
        },
        {
            "text": "after he gave up the Green Lantern ring. He would like more for this really muscular tattoos. Really dumb really dumb next prediction. Tim my boy Crashy B he's coming out. Crash Bandicoot will be announced Crash. Here's my thing. Something Crash related and I'm not going to keep it that broad. We're either getting Crash Bandicoot PS4 or some form of Crash collection. Okay. I'm hoping for Crash. They know us for people know. Do you know? Is it too early? Yeah. Is there a ridiculous amount of things saying it's not happening? Yeah. Is there way too many goddamn rumors that make it look like it is happening? Yeah. And I'm standing with them in a perfect dream. This is in prediction. This is this is dream time not prediction time. Dude comes out in the costume with a megaphone. Yeah. What if Shawn Layden's in the costume and the megaphone hella shit. You've got Sony. If you're watching and you need a Crash Bandicoot. Jesus Christ can you imagine how can you imagine that'd be the",
            "start": 4567.44
        },
        {
            "text": "What if Shawn Layden's in the costume and the megaphone hella shit. You've got Sony. If you're watching and you need a Crash Bandicoot. Jesus Christ can you imagine how can you imagine that'd be the best? What if we just got you the suit and the megaphone and then just like we have to get him backstage and then you just come out. She weighs out there talking about VR. You just come out. I'm not going to leave you hanging dead. Days Gone announced Sony Bend's new game Fall 2016 PS4 exclusive. Ready to go. Looks great. Detroit: Become Human. We'll get a huge spot at the conference. Then it's revealed that it's coming this fall. Wow. Yep. Quantic Dream that quick huh? 01 they showed the PS3 tech demo 013 they said they were in pre-production. They revealed it in 015. Like it's been cooking. It's not I mean that'd be pretty cool. And that's the thing is like and they've been releasing their old games on PS4. You ever run ready? Okay. I like where you're at. I think there's something",
            "start": 4621.6
        },
        {
            "text": "It's not I mean that'd be pretty cool. And that's the thing is like and they've been releasing their old games on PS4. You ever run ready? Okay. I like where you're at. I think there's something there and I think there's something there and that is definitely me hoping but I feel like that is the kind of game that it's not like it's going to get a million TV commercials. You don't need to invest all this stuff for the people who care. They're going to totally get that and every E3 I think is going to care that that'd be exciting. That'd be fucking awesome. So is it my last one? Yeah. Number five. How do we play this then? If I if we have more predictions we'll go through and we can go through. Okay. So this is my last final one that counts. Yeah. Ooh. All right. All right. I got an easy one but I'm going to I'm going to go for the the more points one. If this shit happens. Persona 5 release date announced for America day and date with Japan September 15th. Fuck",
            "start": 4669.6
        },
        {
            "text": "I got an easy one but I'm going to I'm going to go for the the more points one. If this shit happens. Persona 5 release date announced for America day and date with Japan September 15th. Fuck you. Final Fantasy. I think I think you're right. I think you're right. I mean I don't know that it's gonna be there but I do think the game's coming out in September same day in the West. Yeah. Awesome. God damn. I hope so. I think a lot of the delay has to do with localization. The only thing that I'm I'm feeling iffy about is I don't know if Sony will have them do that and Final Fantasy XV do the console. Ah good point. Good point. But whatever double or nothing. Last one that counts. I think that all so this is gonna be a vague one. I don't know if you're gonna allow it but we're going to try it anywhere. All first party games they're going to come out in the beginning and they're going to announce the Neo right. 4K whatever. All games that were announced for first party will be",
            "start": 4701.12
        },
        {
            "text": "to try it anywhere. All first party games they're going to come out in the beginning and they're going to announce the Neo right. 4K whatever. All games that were announced for first party will be shown running on Neo. This will cause a massive controversy about what games are shown running how and how the games look on old PS4s. Um and Sony is going to have their hands full on a PR and a PR respect. Now is this going to be traditional uh PlayStation fuck up at a press conference where they don't announce that they don't say that everything is running on a Neo. I think it might say like everything's you see today will be running on Neo but they're never going to show the way the games look on the old consoles. And that's going to cause a lot of problems for them. That's my PR. That's my prediction there. So like Horizon, God of War, Days Gone, um Detroit: Become Human, all these games, Crash Bandicoot. So that's my prediction is that they show everything running on on the new",
            "start": 4746.08
        },
        {
            "text": "PR. That's my prediction there. So like Horizon, God of War, Death Stranding, um, Detroit, all these games, Crash Bandicoot. So that's my prediction is that they show everything running on on the new hardware, not on the old hardware. And this causes some sort of controversy because we do not know how the games are going to look for the other consoles. And this is where things get started to get a little muddy for them. That's my final prediction. All right. My final prediction, the word Vita gets said no more than three times. And I'm including anybody who comes out and it's like and it's cross play on PlayStation 4, 3, and Vita. That's the one that's that counts as one. I like not cause that's that is all they're going to fucking say. Said the word said, I don't know why it's some montage behind them. Some other dumb thing. They showed the Vita. They won't know. Said I like being says Vita. No more than three times. That's excellent. So what'd you have leftover leftover? I",
            "start": 4783.76
        },
        {
            "text": "montage behind them. Some other dumb thing. They showed the Vita. They won't know. Said I like being says Vita. No more than three times. That's excellent. So what'd you have leftover leftover? I had The Last Guardian gameplay demo obviously, but I think really state at the end of it. Mine one that is it's a crazy pie in the sky, but I've been saying it so much. The Last Guardian is out now on PSN. They finished the demo and they're like and it's available tonight on PlayStation Network and place goes crazy. I think that's suicide for them. I do too. I know. But I then it's available in the next week or whatever, two weeks in stores. I agree that it's fucked up, but I also think it could be an awesome move. And then my my last one was either The Last of Us 2 teaser or Uncharted 4 single player DLC. Sam, you play as Sam. Oh yeah. Yeah. Interesting. Interesting. That'd be cool. I don't think it'll be both though. Sure. No, I don't think so either. Call. I predicted one of the I only had two",
            "start": 4823.52
        },
        {
            "text": "DLC. Sam, you play as Sam. Oh yeah. Yeah. Interesting. Interesting. That'd be cool. I don't think it'll be both though. Sure. No, I don't think so either. Call. I predicted one of the I only had two leftovers. One was cause there was a few that people had used the mind or the ones that I came up with. Two. One was that multiple first party games will be showing PSVR support. I was thinking games like Detroit and God of War. So you mean like full on immersion? Okay. And the the one that I wanted to use, but I didn't was that I think the conference will end with Bloodborne 2 revealed and teased. So I just a logo they'll come out and say like FromSoftware and Japan Studio, two, they're collaborating on it. We'll have more information in the future on it. That's a good one. The one that almost made it, but didn't make it, but I want to make it, but then do I just want to make it cause I want to make it is that the Spider-Man game gets a teaser trailer. It is PlayStation exclusive. That rumors",
            "start": 4865.28
        },
        {
            "text": "it but didn't make it, but I want to make it, but then do I just want to make it cause I want to make it is that the Spider-Man game gets a teaser trailer. It is PlayStation exclusive. That rumors been kicked around forever and ever and ever. That Sucker Punch is working on. I feel I feel good about it. Yeah. I feel good about Spider-Man in some form. The thing is Marvel needs to have some big game and I feel like that there's been so many reasons. This one seems like the one that's been exactly so many Spider-Man rumors. This is the one that seems to make sense that they've been working on. And again, I want it to be Sucker Punch and I want it and I just like when I when I looked at the NeoGAF thread that day and I saw the Infamous Collection with a demo for it, it was like Jesus Christ, please be true. Jesus Christ, please be true. All right. All right, cool. Cool. So now twisting it back towards the Gamescast. What do you what what what are the what else you want to talk about?",
            "start": 4910.64
        },
        {
            "text": "be true. Jesus Christ, please be true. All right. All right, cool. Cool. So now twisting it back towards the Gamescast. What do you what what what are the what else you want to talk about? I'm trying to see what else we got that Sony could talk about. Horizon delay. I agree. I think that'll that'll occur. No Man's Sky. What what do they do if they're smart? Nothing. It's a teaser. It's in the teaser sizzle reel. Like let's not kick the hornet's nest. I'll get the internet riled up again. It let's not for like the umpteenth E3 show you this game and make you try to understand what it is. It's coming. You know it's coming. There was an insert on Uncharted. It's been all over the place. It'll be there. Um Shenmue any mention at all? No. I can see him mentioned somewhere, but I don't think it's like it's prime time placement or anything. Ni no Kuni II. Wish. But no no no no. Uh Persona 5. I mentioned it in my I think it's I think it's there. Yeah, I do. And I do agree",
            "start": 4947.76
        },
        {
            "text": "think it's like it's prime time placement or anything. Ni no Kuni II. Wish. But no no no no. Uh Persona 5. I mentioned it in my I think it's I think it's there. Yeah, I do. And I do agree with you. I think it's coming out in September. So in terms of that like with the JRPG kind of battle going on, do you think Final Fantasy is that their event? No, not at all. No. Hmm. What do you think they do show up? What Square? Yeah. Uh nothing. I think that like, you know, they I think Persona is going to be the main JRPG of the show. I think it's time for Atlus to take the stage and get that kind of stuff. I think that they're I think I like the idea of a PS4 bundle for Final Fantasy XV. I just don't know that that's in the cards. Um I think we've seen enough there's bad mojo with Final Fantasy XV at Sony conferences. Let's just say that. I think it's time you move on and uh Square just as weird with these conferences and stuff like that. I think I would love to see Atlus",
            "start": 4991.2
        },
        {
            "text": "Final Fantasy XV at Sony conferences. Let's just say that. I think it's time you move on and uh Square just as weird with these conferences and stuff like that. I think I would love to see Atlus have their their spotlight with Persona. I don't think you do both. So I don't know. I mean I feel like they killed it a couple of years ago at Sony's conference when they gave the the trailer that announced it was Final Fantasy XV and the Kingdom Hearts III trailer. Yeah. But Kingdom Hearts III is nowhere to be found. You know like like this is what I'm talking about are the Final Fantasy VII thing where they were like we're working on Final Fantasy. And then like later on the way we fucking I was even always producing it and yeah, it's three it's three fucking parts and we're never going to see it. It's three games. Final Fantasy VII apparently too big to be one game even though it was one game in 1997. I feel good. I feel good about the Final Fantasy VII thing because we saw it last year",
            "start": 5031.52
        },
        {
            "text": "see it. It's three games. Final Fantasy VII apparently too big to be one game even though it was one game in 1997. I feel good. I feel good about the Final Fantasy VII thing because we saw it last year at E3 when it was first announced and there was that whole trailer or whatever. And then we saw it at PSX and that was the thing to me where I'm like what the fuck? I didn't think we were going to see this thing for ever. I don't think you're going to see it forever. I think that a lot of that team is all hands on deck for VII and XV. I think anyone's even working on it. That's that's my prediction is like I I literally don't think anyone's even fucking working on that game. I don't I refuse to believe it. Infamous Collection has been thrown around a bit. No, it's that is wishful thinking. That was that Reddit thing that was too good to be true. That was the one that made me cry in the bath. That'd be great, but can you imagine? And then yeah, VR how much do you think is given to VR?",
            "start": 5068.0
        },
        {
            "text": "That was that Reddit thing that was too good to be true. That was the one that made me cry in the bath. That'd be great, but can you imagine? And then yeah, VR how much do you think is given to VR? That was almost one of my I think a lot of time. That was one of my ones where I almost doubled back to last year's prediction of at least at minimum 0 minutes of VR talk. But it is so hard to show. It is a big deal. I think you do do a giant segment on it being I think it's probably what 10 15 of you talking about it here. It is probably 10. This is the unit. Remember that here's the price we're going to I wouldn't be surprised if tomorrow we're putting out more pre-orders that was such a big deal. They went so fast. We've got another allotment coming for you to get it on the first day. Here's where you can get that thing. There's ways to do it, but then yeah, like we even saw, you know, it was PSX, right? The Rigid Motion demo with the disc that failed or whatever. Like they want",
            "start": 5099.44
        },
        {
            "text": "Here's where you can get that thing. There's ways to do it, but then yeah, like we even saw, you know, it was PSX, right? The Rigid Motion demo with the disc that failed or whatever. Like they want to take that chance again. I would I would be one of the big things I think you'll see is here's the PlayStation VR. Again, these are the some of the 90 whatever they said how many games was it that was going to be available by the end of the year? Like 76 or what are 1 0 in development or something. Yeah. Yeah. It's just a bunch of numbers. We want to show you a new one and I think it'll be a AAA game. It'll be like a game name. You know, it'll be like not BioShock, but BioShock, right? It'll be something where it has resonance to the rapper the rapper the rapper the rapper PlayStation All-Stars Battle Royale is back in a first person fighter use with the Move stick. But you can only play as you have you have to be a cat. You could only play as Toro. Oh my God. Yes. Yes. Ladies and",
            "start": 5142.64
        },
        {
            "text": "All-Stars Battle Royale is back in a first person fighter use with the Move stick. But you can only play as you have you have to be a cat. You could only play as Toro. Oh my God. Yes. Yes. Ladies and gentlemen, this has been the first ever episode 73 of the Kinda Funny Gamescast E3 predictions edition. I thought this was a damn good episode. I told y'all motherfuckers it was worth the dollar. And if you're watching this over on Patreon, I love you. I already cut it out. I already cut it off. Then you're not I guess until next week. I love you.",
            "start": 5185.36
        }
    ]
}