{
    "id": 1824,
    "video_id": "6HhplcDHk_M",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Ghost Recon: Wildlands E3 2016 Trailer - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nColin and Greg breakdown the Ghost Recon: Wildlands E3 2016 Trailer!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1465864201,
    "duration": 287,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening. Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up everybody? Welcome to another E3 reaction 2016. Kinda Funny YouTube, go to Twitch, do all. I'm Greg Miller. This is the pride of Long Island, Colin Moriarty. It's good to be here with you today. Good to be here with you, Colin. Colin, we're jumping into a little game called Ghost Recon Wildlands. Officially, its confirmation name, Tom Clancy's Ghost Recon Wildlands. Uh, what did you think? We saw it today in action. It was the first time since last time. Looks awesome. Yeah, right? Uh, yeah, I think I think this is uh, with the exception of South Park, probably the most anticipated Ubisoft announced Ubisoft game that we've uh, that we've seen. You assume that Far Cry is probably in the mix somewhere deep within the bowels of one of their studios, and I'm certainly going to be excited for that when they show it. But we saw this first time last",
            "start": 0.12
        },
        {
            "text": "assume that Far Cry is probably in the mix somewhere deep within the bowels of one of their studios, and I'm certainly going to be excited for that when they show it. But we saw this first time last year at E3, um, and then I couldn't wrap my head around it. Showed it, it was ATVs. I was like, what exactly is happening? It was a weird, it was a weird kind of reveal. I think they're trying to show the scope of the map. This is supposed to be a massive open world by Ubisoft standards. Uh, you know, the one thing I was really pleased to hear them say, and I really want to believe that this is metric driven, is that they you can play the game by yourself. They said that out front. Remember with The Division, you didn't really know. In fact, like we they went almost all the way to release until they really confirmed that you can play The Division by yourself. They're saying this almost a year out from the game's release, uh, which indicates to me that people are playing The Division alone or they're playing other",
            "start": 39.92
        },
        {
            "text": "that you can play The Division by yourself. They're saying this almost a year out from the game's release, uh, which indicates to me that people are playing The Division alone or they're playing other games, multiplayer games alone, and they want to know that they can play this game alone. And that's what got me really excited. So once they said that, I was in, because you know, much like many Tom Clancy games, it's usually squad-based or tactical. Um, and uh, I don't want to play like that, so I don't have to, and that's fun. And that was the thing, taking a glance at it when they were showing it today, showing all the things for me, it looked like, you know, Tim keeps bringing up Metal Gear, which I agree with, but it's Metal Gear and it's The Division, and then it's Far Cry. But honestly, every other Ubisoft game where it's you pop up and there's a million things to scan, figure out what you want to go do, what what kind of car do you want to take in, what kind of bike do you want to take? It's a Ubisoft game through and",
            "start": 75.48
        },
        {
            "text": "where it's you pop up and there's a million things to scan, figure out what you want to go do, what what kind of car do you want to take in, what kind of bike do you want to take? It's a Ubisoft game through and through, checkbox game, right? Exactly. This territory, let's get this, let's click off that mission. And that's what's fun about a lot of their games. So, you know, I I uh, I'm looking forward to playing it. I have questions. I want to see more of it, um, because I'm I'm curious how it plays. Like how that my experience in The Division par relates to that. I don't mean literally like, sure. I mean like I spent a lot of time with The Division, so can I expect a similar kind of game? Is it going to feel the same? Um, is it going to be like more tactical, more shooty? Seems like it's probably going to be a little bit of both. Go bang bang. And that's I mean, that's that was the thing that I was like really interested in in in looking at. By the way, the I don't know, I don't know if he's in this trailer or not, but he might be",
            "start": 108.36
        },
        {
            "text": "go bang bang. And that's I mean, that's that was the thing that I was like really interested in in in looking at. By the way, the I don't know, I don't know if he's in this trailer or not, but he might be the bad guy. Oh, the tattoo guy. That guy is awesome. Yeah, yeah, it's a really cool design. He got the like the cross on on his. I was like that, you know, pretty cool. But I, you know, you were making the Metal Gear comparison. I only spent about 10 hours Metal Gear Solid 5. It just wasn't for me. Yeah. Um, not that Metal Gear Solid 5 was as narrative driven as many of us would have hoped it would have been, but I I assume the the gameplay might be similar to that, but without the narrative hook. So it seems to be this is going to be a game with a longer tail, um, in terms of people playing it because you're just playing to play it as opposed to like get somewhere. Yep. It's a Ubisoft game. Jump in, go clear this, go get that. I have five out of these seven collectibles in this area. Da. And that sounds awesome. That sounds",
            "start": 144.8
        },
        {
            "text": "to play it as opposed to like get somewhere. Yep. It's a Ubisoft game. Jump in, go clear this, go get that. I have five out of these seven collectibles in this area. Da. And that sounds awesome. That sounds great to play. I I'll be looking forward to playing it with people even though I'm sure I'll do a lot of it on my own as well. Yeah, I mean, it's pretty too. I mean, a lot of this stuff is rendered in in, you know, cut scenes, but the stuff we saw in the engine, I mean, I was still seeing especially geographically, um, like I was like, this looks absolutely real. I'm so with the character models in there, it doesn't look quite that real, but there are parts of the demo we saw where I was like, this actually looks really phenomenal as well. And this game's been baking for a while. I mean, sure. Um, so, um, we had seen it, um, I think it was already in development for like a couple years. So, um, you know, it's what's funny is that Ubisoft has all these projects and and all these kind of um, similar kind of scoped games",
            "start": 179.88
        },
        {
            "text": "it. Um, I think it was already in development for like a couple years. So, um, you know, it's what's funny is that Ubisoft has all these projects and and all these kind of um, similar kind of scoped games like Rainbow Six Siege or The Division and now this and whatever. But yeah, we just kind of eat them up anyway and we enjoy them. The perspective might change, um, obviously the the thematically these things change as well. But um, there's something special about cocaine. There it is. It's all about that cocaine. Co. Yeah. Um, so yeah, I uh, I'm in and uh, comes out I think early next year. So yeah, March. What do you think, ladies and gentlemen, as we lead up to Ghost Recon's March 7th release date, 2017? We want to hear all your comments. Put them below. And then of course, keep coming back here to youtube.com/KindaFunnyGames all E3 long. Kevin's been getting these videos up so fast. I can also tell you, Big Kev Dog, round of applause for Big Kev Dog. Uh, we'll be tonight, of course, we're doing the PlayStation pre",
            "start": 212.04
        },
        {
            "text": "Kinda Funny Games all E3 long. Kevin's been getting these videos up so fast. I can also tell you, Big Kev Dog, round of applause for Big Kev Dog. Uh, we'll be tonight, of course, we're doing the PlayStation pre, during, and post show over on twitch.tv/KindaFunnyGames. And of course, Tuesday, noon to 4:00 p.m., all sorts of interviews, podcasts, and things happening on twitch.tv/KindaFunnyGames. But all the good stuff gets broken out and put it up here on YouTube anyway, so you got the best of both worlds. Until next time, it's been our pleasure to serve you.",
            "start": 255.2
        }
    ]
}