{
    "id": 1782,
    "video_id": "CJvChRWgZHI",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Portillo"
    ],
    "title": "Greg Gives Oxenfree Another Chance to Wow Him - Kinda Funny Plays",
    "description": "Greg played Oxenfree on PC and he had lots of issues. Will the PS4 version be better? \n\nNope.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1464969601,
    "duration": 1904,
    "transcript_chunks": [
        {
            "text": "What's up everybody? I'm Greg Miller and this is a Let's Play here on youtube.com/KindaFunnyGames, doing something special today. I guess not different special. I'm playing a game. What I'm doing is playing Oxenfree, and you may say, \"Greg, how is this special?\" Portillo, sit down. This dog, he just doesn't care. He's all up in this PlayStation business. Why this is interesting, why this is special, is the fact that I've played Oxenfree, and I am not one, as you know, to go back and play a game again. I usually say, \"Old game is old. I don't want to go back and play something I replayed.\" But I played Oxenfree, and very interesting setting. I played Oxenfree on a pre-pre-pre-PR pre-PR pre-release PC build. All right, you go away now. Then you're just a, you're just a dick dog. I don't know what to do with you anymore. Um, uh, pre-release, uh, PC build. And I know all of you out there, PC gaming is so simple. It ran like **** on my PC. It didn't do right. It wasn't the, the resolution wasn't set correctly and da D and",
            "start": 0.08
        },
        {
            "text": "um, uh, pre-release, uh, PC build. And I know all of you out there, PC gaming is so simple. It ran like **** on my PC. It didn't do right. It wasn't the, the resolution wasn't set correctly and da D and when you're playing a pre-release game, you don't know what's happening. I didn't know if it was the game or what it else was. So I played through and I was, I wasn't frustrated necessarily, but I was, you know, going through and not understand, not enjoying myself, not just because of it. But the other thing was that it was a pre-release. People had already played it, right? In my, in my friend group, my peer group of video game people, and they were already saying, \"This is on my short list for Game of the Year.\" If this would remember, Oxenfree of course came out on PC, uh, and I believe Xbox One, uh, quite a while ago. Just got to PlayStation 4. That's why we're doing this Let's Play here while I use my DualShock 4. Um, and I remember them all saying before I started playing, \"It's on my short list for Game of",
            "start": 39.72
        },
        {
            "text": "ago, just got to PlayStation 4. That's why we're doing this Let's Play here while I use my DualShock 4. Um, and I remember them all saying before I started playing, \"It's on my short list for Game of the Year. It's an amazing game.\" Uh, these Night School guys, they got it down. Of course, Night School, a bunch of folks from Telltale and Disney and different things. And for me, when I sat down and played, I had such expectations, right? That I sat down expecting to be blown away. It's one of those where I put it in, I did it to myself, right? And I remember playing through and being like, \"Well, when is it going to get amazing? When is it going to get crazy?\" Uh, and so I got to choose my choices here, right? I, I remember going through and being like, just, and then it ends. And I'm like, \"So, I didn't do it for me.\" And then I talked to like folks like Mitch Dyer when he was still working at IGN. He talked about how many times he had played it, how many, how many different things he was doing, how many. And I was like, I",
            "start": 81.72
        },
        {
            "text": "then I talked to like folks like Mitch Dyer when he was still working at IGN. He talked about how many times he had played it, how many, how many different things he was doing, how many. And I was like, I just, I was done with it. But then something interesting happened. I was done with it, right? A little bit let down with it. I wasn't like, \"Oh man, it was great.\" I was let down. I didn't think it was that. I think it's a good game. It was fun. It's interesting, right? Uh, obviously what we're doing is I'm Alex here. I walk around. We're, me and my friends are going to this island for the, you know, the yearly high school party, man, to party our asses off. But then things become afoot. And I enjoyed it, but I wasn't blown away by it. And so I put it down and never did think of it again. I thought, \"Hold on, I got to keep making my dialogue choices here.\" Put it down, never to play it again. But then as we got closer and closer to the PS4 version, I kept thinking, \"You know what? I might want to replay it. I might want to replay",
            "start": 122.84
        },
        {
            "text": "my dialogue choices here. Put it down, never to play it again. But then as we got closer and closer to the PS4 version, I kept thinking, \"You know what? I might want to replay it. I might want to replay it a bit.\" And so here we are. I'm jumping in right now. I'm talking over the entire intro, of course, which is not helpful to you if you're wondering how to play it. But then again, I don't want to spoil the story. Uh, the game of Oxenfree, interesting. This PlayStation 4 version introduces New Game Plus, which has now been patched into PC and Xbox One as well. But you get to go in here and have your conversations. And what, so what I didn't get the first time playing through, I guess, and since I didn't want to go back and replay it, was the fact that, yeah, things are different. Dialogue choices you make here, you know, change your relationships with people. It makes everything, uh, play out differently in terms of who your friends are, how relationships end, will this guy get with this girl, vice versa. So I'm interested",
            "start": 157.24
        },
        {
            "text": "change your relationships with people. It makes everything, uh, play out differently in terms of who your friends are, how relationships end, will this guy get with this girl, vice versa. So I'm interested to replay it on PlayStation 4 and try something new. But I thought I'd come in here and give you a little bit of love, give Oxenfree a little bit of love, because again, if I'm inclined to play a game and not for trophies, I'm not, does this even have a Platinum? Is this one of them fake ass games without a Platinum? Let's check. Hold on, because is it doing the Gone Home, as I call it, so much? Nope, this is a real game. Everybody tweet Steve Gainer and let him know Oxenfree's a real game. It has a Platinum. But Gone Home, of course, doesn't, because Gone Home is an experience, I guess, or whatever. Uh, so I, I try to think about why Oxenfree still has a hook in me or whatever, right? But like, you have these choices here, which are interesting. I'm playing my second time, not a New Game Plus. I'm playing, you know, my",
            "start": 193.68
        },
        {
            "text": "to think about why Oxenfree still has a hook in me or whatever, right? But like, you have these choices here, which are interesting. I'm playing my second time, not a New Game Plus. I'm playing, you know, my second time here. Hold on, there it is. Oh, there it is. Sorry, it's been a while. Just tap. Yeah, so I get to play, you know, my second time in a while. And so I get to make different choices. But the game and the dialogue trees, obviously, right there were set up for you to, are you a returning player, right? Like, oh, you know, this isn't New Game Plus, but I think it shows a little bit of how it was beforehand. Are you, you know, what, what radio? Oh, yeah, I have the radio. And you need to go through and find the radio. That song's been stuck in my head since I woke up this morning. But, oh, oh, actually, it's a little after 10:00, which means my dear friend Ren and his buddies are probably just touching down on Edwards Island for the yearly bash on the beach or whatever we call it now. But anyways, we don't call bash on the",
            "start": 238.24
        },
        {
            "text": "which means my dear friend Ren and his buddies are probably just touching down on Edwards Island for the yearly bash on the beach or whatever we call it now. But anyways, we don't call bash on the be, we call it ****. Oh, crazy. You're listening. Ren, here are the redheaded Bedwetters with baby carrots. And so I think I might have done Oxenfree a disservice the first time I played it. I played through it. I got my story like I usually like out of my games and then put it down. But I feel like it's worth replaying to go back and make different choices and see how I can influence the characters and see what I can do, because there's, there's a, you know, I'm not going to ruin things for you. There's a whole bunch of subplots here with her, Ren's original brother, the, the, this is her stepbrother here, Jonas, and how the families have merged together. But what happened? Why did those families separate? Uh, what in the separation of the family, you know, that being torn apart, what does that do to the other people",
            "start": 279.76
        },
        {
            "text": "how the families have merged together. But what happened? Why did those families separate? Uh, what in the separation of the family, you know, that being torn apart, what does that do to the other people in the game? What do, do with the other characters in the game? What are their relationships to Ren's brother and things like that? What are their relationships to Ren and how do they all feel back? I'm excited, I think, to sit down and give it another shot, you know, wholehearted fashion, if you will, this weekend at some point. Sit down, pour myself a beverage, dim the lights and go back into it. And that's an interesting thing for me. That's just not how I play games. But Oxenfree is interesting in the way that if you already saw it, right there, and like I said, now there's New Game Plus, but before there wasn't, you just replayed the game. They already have the shortcuts in there of like, oh, well, now you can go do this, you can go do that. Do you know this? Of course I know that. Well, great, there you go and jump in.",
            "start": 318.36
        },
        {
            "text": "just replayed the game. They already have the shortcuts in there of like, oh, well, now you can go do this, you can go do that. Do you know this? Of course I know that. Well, great, there you go and jump in. But to go in there now and tinker around and see how you can influence, now if you're just watching, you're like, well, what's, it's a ghost game. What's it? It manipulates time and space as well, which gets really interesting in not freaky, but it's used in interesting ways. Again, I'm not going to spoil it, but you know, you, you'll learn pretty quick that the map isn't huge. The island you're on isn't huge. It's Edwards Island. Edwards Island, of course, we're going to jump in. I don't even, oh, chug in there. Oh, see now what, what, why is that? Yeah, um, anybody need a smoke? If I have another bad experience with this, then no, I'm not going to bother with it. Oh, uh, no thanks. I mean, I literally just said the clean air thing. So what's going on, PlayStation? You can bum one off me if you're empty. I don't smoke. Oh, uh, no thanks.",
            "start": 356.92
        },
        {
            "text": "I'm not going to bother with it. Oh, uh, no thanks. I mean, I literally just said the clean air thing. So what's going on, PlayStation? You can bum one off me if you're empty. I don't smoke. Oh, uh, no thanks. I don't smoke. Last time I had one, it didn't go well. PlayStation 4 running its normal temperature. Know, don't know why it'd be chugging like this. Why it'd be doing it all framy here. But this is the problem, just like my PC version where I was like, well, this is annoying to play. It's annoying to move. Should be around. This is going to be annoying to play, annoying to move. I mean, I don't mean to be the guy to break us up already, but Ren, can you do me a favor? Can I have like two real quick minutes with Alex for a second? Now, before I didn't give him the quick minutes. I'm going to do here. Meet your friends. Uh, wait, is something wrong? What is it? We're going to give him two minutes and see what happen. Nothing's wrong. Nothing's wrong. It'll just take two minutes. Super fast. All right, Bud. Uh, look, I, I don't want to go up by",
            "start": 397.44
        },
        {
            "text": "is something wrong? What is it? We're going to give him two minutes and see what happen. Nothing's wrong. Nothing's wrong. It'll just take two minutes. Super fast. All right, Bud. Uh, look, I, I don't want to go up by myself. I mean, can't we just stick together? You're going to have all night to say like whatever. I'm trying to see how it'll be different. But since you want to meet up with your friends anyway, no, it's, it's fine. Ren, go on up ahead and we'll catch up with you. Why is the game so being all framing and crappy? You're telling me it's not a PC gaming thing. I guess it's an Oxenfree thing. Strange way to start off this game. Just runs like **** on everything. It'll be fast. Thanks, man. Talk to me. I'll just be up the hill in case whatever. Great. Ren, Ren seems nice. He's funny, you know. Oh, so just running in that reminds me of a guy I know back home. Yeah, I mean, he's just running **** in that like cut scene where, yeah, he's nice. Listen, I just wanted to grab you ahead of time and say you've been cool about",
            "start": 445.96
        },
        {
            "text": "reminds me of a guy I know back home. Yeah, I mean, he's just running **** in that like cut scene where, yeah, he's nice. Listen, I just wanted to grab you ahead of time and say you've been cool about everything. I have. I guess it's just for me. I, I, I've never moved anywhere, getting a new family at the same time. Kind of feels like I'm skipping the training wheels. Not that it's been bad or anything. You and your mom have been great. H, we'll make do. Lemons, lemonade. However that goes. An optimist. Oh, Christ. Yeah, I'm an optimist. Also worth pointing out, this is Erin Yvette voicing Alex. You know, we're from a million Telltale Games. Uh, Kenny is in here too. Gavin, I think this might be. I forget that I was in the basement at my old house. So this is, that was, um, that was Mike's room actually. So what happened to my, there wasn't that much to set up. Oh, I one. Oh man, I'm sorry. I didn't mean to bring it up. It's okay. You didn't know. Damn. See now this, and this is, so let's pause it here. This is what I'm",
            "start": 494.52
        },
        {
            "text": "to my, there wasn't that much to set up. Oh, I one. Oh man, I'm sorry. I didn't mean to bring it up. It's okay. You didn't know. Damn. See now this, and this is, so let's pause it here. This is what I'm talking about of why I did Oxenfree a disservice and I wasn't blown away with my first, first time I played through it, right? Obviously a bad, bad experience on the PC, whatever. But it's a game I think that's meant to be replayed, as Mitch Dyer would tell me all the time whenever I hung out with Mitch Dyer, may he rest in peace at his new job in Canada. He is not dead. He just, he's dead to me because he left San Francisco. But you see now, I already know parts of his, I already know Jonas's story, right? So now how do I want to piece them back together in the second playthrough to really flush it out? I'm going to say, \"Heard your mom's dead,\" right up in his grill. I don't care. I'm sorry. Yeah, you know, what are you going to do? We can catch back up with Ren now. I didn't mean to take so long. I ended the",
            "start": 547.64
        },
        {
            "text": "I'm going to say, \"Heard your mom's dead,\" right up in his grill. I don't care. I'm sorry. Yeah, you know, what are you going to do? We can catch back up with Ren now. I didn't mean to take so long. I ended the conversation and now we're running, running better now. There's the fair sign. Flag is flying. We are fun. Um, I think it's supposed to say, \"Running.\" Oh, I can look. I can look at little shops here. It's kind of kitschy, right? I don't know what kind of town let all these kids just go to the island and get **** up. But I like it. It's my kind of town. Uh, I think they block us off at night since nobody needs. But it's a game of personal relationships, this. Oh, right. You might think it's just about ghosts and figuring out what the hell's happened in the island. My one playthrough told me what's happening on the island. I figured all that out. So then the second one is about, and the third one, I assume, and the fourth one is about going through and I forgot this was making the right choices to get the perfect game.",
            "start": 591.72
        },
        {
            "text": "I figured all that out. So then the second one is about, and the third one, I assume, and the fourth one is about going through and I forgot this was making the right choices to get the perfect game. Monument to some submarine that was sunk off the coast. Oh, do the, the, um, the radio guide thing they talked about on the boat. You know, it's what, like 10.3. I just want to see how it works. Uh, okay, sure. I think they said it's 10. Named after the Hawaiian god of the sea, the USS Kaloloa was launched on January 15th, 1941 and commissioned into service at the end. This, you mean to me, something's be already kind of creepy in a way, right? I hate thinking about it. Yeah, I **** up. I should have played this game twice. But then who has the time sometimes, you know what I mean? There's so many games coming out. And if I didn't like it at first blush, why should? But it stuck with me. And that, that's the thing to Oxenfree. I might have been hard on in the beginning, but it stuck with me. Now, while I played again, a second",
            "start": 639.8
        },
        {
            "text": "like it at first blush, why should? But it stuck with me. And that, that's the thing to Oxenfree. I might have been hard on in the beginning, but it stuck with me. Now, while I played again, a second time, be like, well, you know what, that wasn't that much different. I don't, who knows, will I ever replay it? I am full of **** a lot. I'm a very busy person. I have many wiener dogs to clean up puke and pee from. So I have things going on, you know what I'm saying? J.L. the beatboxing music parks and facilities office. Friend's sister, Allison, used to work there. You'd like her. She's tall. Um, all right, now we're just going to run. We're just going to run and catch up with everybody. We got to find that Ren kid. Want I say Ren kid? Then that was the, the other guys and girls must be further off. You getting shitty. That's what I'm talking about where it was running ****. Not this is a tour with shops and a beach. Nobody lives here except for some geriatric named Mrs. Adler. But as God as my witness, we'll never mention her",
            "start": 688.28
        },
        {
            "text": "I'm talking about where it was running ****. Not this is a tour with shops and a beach. Nobody lives here except for some geriatric named Mrs. Adler. But as God as my witness, we'll never mention her or any other old person's name again. Will Adler be important part of the story? Trad recruits in the 1950s who had sneak dates over from the coastal towns. They literally called it tring. Uh, the beaten path officially ends here. The beach is past the fence. I think Jerry, there's my map. Now that's what I was talking about. The map doesn't seem that big and it isn't. But the way they use it, sometimes they kick you around a time and do all these different things. Stuff's happening. I'm going to say's happened on this island. This island, not your normal island. Perhaps haunted. Me that there's the way that it used to get over there, but I'm blanking on what it was. But it's not, I mean, it can't be too difficult. Well, look, there must be something. I mean, if Jerry got over, yeah, exactly. Jerry sucks. So I think the",
            "start": 731.44
        },
        {
            "text": "used to get over there, but I'm blanking on what it was. But it's not, I mean, it can't be too difficult. Well, look, there must be something. I mean, if Jerry got over, yeah, exactly. Jerry sucks. So I think the dumpster will get us over if it'll. We're going to go party with some kids though. Meet some ****. And I don't mean like I'm putting down the female gender. I mean, we're going to meet some people who are ****. They're just like **** people. I, I got it. But that's just me. I don't want to project on. Yeah, isn't this? I want to project to you thinking animal mask wearing freak out. Where's everybody else? Jesus, Alex. It's just supposed to be like a somewhat oversized kegger. And I, I should have let that play out. But you know, you're going to play this on your own. Maybe Kinda Sorta, Kinda Sorta Games, Kinda Sorta PlayStation games. You'll Play One Day. Kinda Funny. So I'm excited. I think, yeah, I think I this want I'm going to do. I'm going to make myself a good dinner. I'm going to sit there and",
            "start": 779.56
        },
        {
            "text": "Kinda Sorta PlayStation games. You'll Play One Day. Kinda Funny. So I'm excited. I think, yeah, I think I this want I'm going to do. I'm going to make myself a good dinner. I'm going to sit there and play Oxenfree, probably some headphones on, lights off, set the mood of a little bit creepy, a little bit what's happening. You don't know what's going to happen. I feel like I **** up and I don't say that often enough because usually I don't **** up ever. Oh, here we go. See, but it's chugging again. Oxenfree, just as I say before we get there, I should, I should probably mention, just as I say I want to play you again, you start running like ass again. God, this game. And I don't know, it's just a game I feel like I should like, right? Cause I'm a story ****. I love all the Telltale Games. Yeah, yeah, yeah. I love Gone Home so much. But totally, is a normal PlayStation 4? Is this optimized for PlayStation 4.5? Is that the problem? And are you telling me that I'm so cursed that every time I play, whether it be on PC, whether it",
            "start": 822.04
        },
        {
            "text": "so much. But totally, is a normal PlayStation 4? Is this optimized for PlayStation 4.5? Is that the problem? And are you telling me that I'm so cursed that every time I play, whether it be on PC, whether it be on PlayStation 4, I have to have a bad experience? Technically, as I look around this house that's built on the money I make talking about video games, I can tell you life isn't fair. What was the thing that you said to Alex back there? Do you have one of those vestigial tales or something? Tell, leave, leave it alone, Ren. All right, we got things going on here. We don't need you being a jerk. Hear you over there. Here we go. Some of the **** I was talking about. Tell story. Just one. Actually, she was just mean in my game. Maybe I'll be nice to her this game and everything will be different. Here's our Uncharted level. Hey, we started a fire down the way, but Nona wanted to play Beach Nanny. So, uh, yeah, everyone, this is Jonas. Jonas, everyone, hey, hi. And Jonas, that's, who are you again? Jonas, he's Alex's new in town.",
            "start": 866.52
        },
        {
            "text": "level. Hey, we started a fire down the way, but Nona wanted to play Beach Nanny. So, uh, yeah, everyone, this is Jonas. Jonas, everyone, hey, hi. And Jonas, that's, who are you again? Jonas, he's Alex's new in town. Fresh as the daisy stepbrother. Stepbrother, really? Yeah, I know. Yeah, he's a cool guy from cool North Valley. So show a good time. But you get the idea here. You build your relationships. I could have, you know, you said I was babysitting Jonas. He would have gotten mad. He would have been happy one bit. I want to play cool stepsister. Jonas, Jonas the stepbrother. You shouldn't be smoking, girl. Um, what's your name again? I don't like her. Not just is Clarissa, but she's, how are you her stepbrother? Why is it chugging like this? What is this game problem? I'll give you three guesses. I'm going to be sarcastic to her, cause I already don't like her. I know I don't like her married. That's all. She's getting remarried to a guy and that's the guy's son. So domino effect. Piss me off when it runs like",
            "start": 920.16
        },
        {
            "text": "to be sarcastic to her, cause I already don't like her. I know I don't like her married. That's all. She's getting remarried to a guy and that's the guy's son. So domino effect. Piss me off when it runs like this. Makes me go, I guess this is happening now. The **** play the ****. And the PlayStation 4 is hot, cause it's always hot. It's not like on fire. We're hit the pause button. We're going to resume. Still run tennis thing. We could quit and come back. Maybe that's it. But I, let's get to another save point. We **** with that ****, cause I hate that, you know, cause then it's going to go through the same conversation. And in a game all about conversations, want to sit here the same conversation. Thought more would show up. But, oh my God, it's just Alex and her new stepbrother, huh? That's it. That's who you brought, Clarissa. Come on, don't be mean. Supposed to be fun. She doesn't explain at all, at all in this game. Who said I'm not having any fun? I'm having fun. This is like frickin' Candy Land right now. She sucks.",
            "start": 985.32
        },
        {
            "text": "Clarissa, come on, don't be mean. Supposed to be fun. She doesn't explain at all, at all in this game. Who said I'm not having any fun? I'm having fun. This is like frickin' Candy Land right now. She sucks. Wait, aren't you all like friends? I'm friends with Nona and I'm downgrading Ren to like a creepy neighbor. And you, I just met. Hey, what about me? About you? Oh, I get it. I'm not even on the spectrum. You see, Jonas, normally this is like a 200 deep rager. But Pat had a party last weekend and and a bunch of kids got caught teeing the school. But this is great, right? We're on Edwards Island. Forget those losers who couldn't handle the weekend, who didn't think we could make it, who lost my invitation, who had to go on. We've been hearing about this for years and now we are going to do it. This, we're going to do it. We're going to do it here. We're going to party in the beach. I'd like to get you to the first creepy part. It's coming up. It's on the other side of the beach. You'll see a little bit of what Oxenfree is all",
            "start": 1034.08
        },
        {
            "text": "about. Maybe we'll end there. But first we got to get through how much of a **** Clarissa is. And again, I'm not saying like I didn't say we're going to go see some ****, meaning like we're going to go see some girls. I mean, we're going to go see some ****. And I don't mean like we're going to see literally see anybody's ****. Um, maybe though if you play this game right and you say the right things to the right people, big old brown eye. But I don't think that's how this plays out. I'm not, I mean, I didn't see like I said, I sold Oxenfree short, even though I keep saying that and then it runs like garbage just to prove me that maybe I did nail it. Maybe I was right in there. I is. And that's the thing. Do I just want to believe that Oxenfree is as good as people say it is or that I'm going to like",
            "start": 1084.0
        },
        {
            "text": "just to prove me that maybe I did nail it maybe I was right in there I is and that's the thing do I just want to believe that Oxenfree is as good as people say it is or that I'm going to like it as much as people say it is and that I'm missing something I don't know I'm happy to be coming back with fresh eyes but I'm not impressed so far with his chugging **** animations look at this this will be a good point we could quit out here and come back but then you guys you just want to see games and stuff but you're here right so here we've come through there fireman's great equalizer here's to hit this we're going to hit this quick button we're going to say stop this application close this application what are you doing application we'll come back in we'll see what's up you seem like you should have everything I want Oxenfree interesting story dialogue choices a good cast good art style but you keep **** it up don't **** it up this time I'm begging you also in partnership with",
            "start": 1122.24
        },
        {
            "text": "should have everything I want Oxenfree interesting story dialogue choices a good cast good art style but you keep **** it up don't **** it up this time I'm begging you also in partnership with Skybound who makes Invincible, Walking Dead so another reason I should really like this which you keep **** it up stop **** it up I don't like it I don't like it I don't like it when you **** up hope you understand signed Gossip Girl XOX all right this is your chance now Oxenfree don't what is there a ghost here as well I need to get my radio out to find the head the Headless ass crack man that just goes um what's the like thing to do here other than obviously go skinny dipping and mured by Jason Krueger yeah let's just get drunk It's supposed to be a party right hey where does that old woman live Oh you mean Maggie see if we could just run like this the whole time I'll be great everything be fantastic over three days ago it was all over the news local news anyway oldest living resident oh",
            "start": 1161.28
        },
        {
            "text": "live Oh you mean Maggie see if we could just run like this the whole time I'll be great everything be fantastic over three days ago it was all over the news local news anyway oldest living resident oh that's sort of a bummer yeah well we all got to go sometime in her case later than sooner and to answer your previous question Jonas the thing to do is lay on the beach and drink till you can't remember where you are and sometimes play Truth or Slap yeah let's play that we can inaugurate Jonas isn't it a Truth or Dare this is better than Truth or Dare because ends up licking someone you get drinking party smoking truth but if somebody can prove that you woring about their dead relatives which is kind of weird but whatever good uh getting to know somebody game yeah fun any excuse to hit run hey I'm the truthest truth whoever TR all right let's just get on with it okay so first we're going to I'll start Ren uh-huh come on fess up you want to go out with Nona right Clarissa wait wait wait I",
            "start": 1244.36
        },
        {
            "text": "I'm the truthest truth whoever TR all right let's just get on with it okay so first we're going to I'll start Ren uh-huh come on fess up you want to go out with Nona right Clarissa wait wait wait I want to hear oh man you're good at this well it's being see if I go down this line of questioning I can get them together I my first play through I like it when people are happy together know you want to sample the goods now just stay I mean I I I like her as a friend right that's I just like her as a friend that's that's all she's cool oh liar liar he's lying he totally likes her what Alex see how awkward high school was aren't you glad you're not there if you are there aren't you glad you get to leave in four years or less can we just drop this please all right Alex you get first Blood slap him like he stole something I can't believe this is happening this really doesn't I didn't play like this my first time not even my bir owez I didn't think you had it in you yeah she had to do it Ren I'm",
            "start": 1294.4
        },
        {
            "text": "like he stole something I can't believe this is happening this really doesn't I didn't play like this my first time not even my bir owez I didn't think you had it in you yeah she had to do it Ren I'm sorry backstabbing surprises for the trophy so Alex's turn oh great here we go what's your favorite stuff Clarissa oh boy yes Mom this is pretty fun just watching if someone were to ask you to describe me what would you say wow really swinging for the fences here I am swinging for fences you were an average girl with common thoughts jeez why don't you say what you w I don't know what I was expecting so okay Clarissa's turn now Alex you got a new brother pretty exciting I'm sure Jonas is excited or maybe I mean Alex is slamming isn't the right word maybe a little overwhelmed with just everything you know unsure it's a lot to take in and adjust what's your point Clarissa I'm just saying what Jonas is already thinking that statistics show if you get divorced once you're probably going to get",
            "start": 1340.96
        },
        {
            "text": "you know unsure it's a lot to take in and adjust what's your point Clarissa I'm just saying what Jonas is already thinking that statistics show if you get divorced once you're probably going to get divorced again and the fact is your mom divorced your dad so let's put his mind at ease and hear why okay just get to whatever point this is getting to the point is why' your parents get a divorce just so Jonas can he bad dog come Clarissa I don't really care why they got a divorce you know why Michael died and it broke everything and they couldn't handle it the end well now you know Jonas I'm sure Jonas die and everything will be fine okay Clarissa you what you know guys honestly I think I'm pretty much ready to do anything else besides this game wait let's let's not stop like this we should games over run I won and to celebrate I'm going to sit on the beach and drink and maybe if I'm feeling spicy even take a nap maybe we could and that's exactly what Nona's going to do what is your",
            "start": 1399.92
        },
        {
            "text": "games over run I won and to celebrate I'm going to sit on the beach and drink and maybe if I'm feeling spicy even take a nap maybe we could and that's exactly what Nona's going to do what is your problem Clarissa just what did we see relationship and then in a second we're going go over there your fing birthday it's going to be all **** Crazy, Alex you did absolutely nothing i' kick this if you guys in your scavenger hunt or playing Ring Around the Rosie happen to find anything more interesting than a slowly dying starfish you be sure to just let me know super sure we'll grab you if we find any um Island Bigfoots Island Bigfoots exactly well I want to inaugurate this **** by checking out the caves Nona want to come uh I mean I would I'm very clingy Ren fine Jonas you're a strapping young lad help boost me over the fence the cave's just uh Yonder that cave got bad business in it we're going to find it guys and then you're going to be like whoa Oxenfree isn't just about yelling at",
            "start": 1448.04
        },
        {
            "text": "lad help boost me over the fence the cave's just uh Yonder that cave got bad business in it we're going to find it guys and then you're going to be like whoa Oxenfree isn't just about yelling at people it's about crazy caves and radios you from again it's a small town near North Valley oh yeah is it nice if you like bars on the Windows bars on the windows and bars on the Alex you want to check out the C **** yeah dude yeah think I'm sitting around here all day waiting not to go in the caves Jonas don't be a shitty step bro toss me over this **** clearly death trap thing come on I'll push you over oh oh I forgot we never talked about ready oh what they the cave what your bet on a scale of 1 to 10 how weird is it going to be I'm going to say so definitely I know what's going to happen here he gets excited easily but he has the concentration of a goldfish the fact that he keeps demanding we see it must mean something all right hey Clarissa seems to be her normal annoying self sorry",
            "start": 1498.6
        },
        {
            "text": "here he gets excited easily but he has the concentration of a goldfish the fact that he keeps demanding we see it must mean something all right hey Clarissa seems to be her normal annoying self sorry about that yeah what's her deal anyway I don't know that woman's perpetually honor period okay it's true kind of oh and what the hell was up with you in the whole Nona thing with the gang I mean okay fine fun is fun it's a game called Truth or Slap Ren it's supposed to be a good really do I wouldn't do Ren like that but I have to I want to see different things now it really sucked actually well actually no I guess I did see that right I'm sorry I knew I do though it forced my hand and then they fall in love you take it so seriously will it be in your world who knows I am I mean I do but it's fine I'll just have to work the old Ren charm even stronger now Ren come on now who's ready to have their minds blown I if you don't mean that literally just get on with it what do I do oh wait actually I",
            "start": 1552.92
        },
        {
            "text": "just have to work the old Ren charm even stronger now Ren come on now who's ready to have their minds blown I if you don't mean that literally just get on with it what do I do oh wait actually I almost forgot going to take a little magic trip to Cupcake Town those look like brownies brownies magic what does that mean Ren does drug means they're en don't do drugs kids C don't do as Ren does well maybe just don't eat too much no promises that's my noise of Ren okay so see these little piles of rocks the kids before us always leave them here so you know where to try and tune in the signals so you're going to want to stand basically right around here and just tune the dial left or right until you start hearing some weirdness you want to talk about the beef some here Ren there we go holy crap wow it's even cooler than I thought it would be this is it what is it what's doing it maybe the tuning is like unblocking a weather balloon or something it doesn't make any sense the old",
            "start": 1604.4
        },
        {
            "text": "go holy crap wow it's even cooler than I thought it would be this is it what is it what's doing it maybe the tuning is like unblocking a weather balloon or something it doesn't make any sense the old weather going to work for the government one day I don't know if you move around it kind of changes too I think like over at this pile here come over here and try it this is so we should be **** with this but we will I know Clarissa and Nona should see this right I mean I know it's like weird with you guys or whatever for some reason but they they're fine where they are okay just what is Clarissa it sounds so yeah it sound sounds uh satanic not what I was going to say but close enough wait what was that here we go guys strapping at home there's like this is going to sound stupid but there's like something in here Famous Last Words famous no I see it too I'm sure there is something in there like a giant rabies-filled bat or a maniac who wears mannequin wigs or it kind of looks like like a",
            "start": 1717.92
        },
        {
            "text": "like something in here Famous Last Words famous no I see it too I'm sure there is something in there like a giant rabies-filled bat or a maniac who wears mannequin wigs or it kind of looks like like a pool or something like a freshwater one maybe let's check it out it's not that far in if it's a pool that'd be cool pools are cool guys um even cave pools to rhyme cool pool fortune favors the Bold you tell him Nathan Drake wait a minute Jonas well I am going to just rest against here because I think I think I mismeasured the Miss magic I cut him off you know that's on me I shouldn't have done that I'm just running around doing all this remember when she took the photo that's the photo she took you probably don't remember but it was on the beach and we were all arguing and look at how mad Ren is cuz I keep blowing up his spot with Nona oh ladies and gentlemen this is Oxenfree what's on the other side of the cave you'll have to play to find out it's running better now so maybe I shouldn't",
            "start": 1783.8
        },
        {
            "text": "is cuz I keep blowing up his spot with Nona oh ladies and gentlemen this is Oxenfree what's on the other side of the cave you'll have to play to find out it's running better now so maybe I shouldn't give it too much **** but this is my problem with Oxenfree I want to love it it keeps breaking my heart will I play more of it this weekend I will I will give this I will sit down and play through it and see if my new game my new game not my new game plus but just my new game fares differently if things go different for my characters if I end up in the same spot we end up in the same thoughts who knows I'm sure I'll talk about on the Kinda Funny Gamescast though so until next time keep checking youtube.com/KindaFunnyGames for a whole bunch of podcast segments occasional let's play holy **** did you know E3 is coming up really quick we are going to do buttloads that's right buttloads of Let's Plays there interviews podcast stuff there so is running like **** again so whenever",
            "start": 1837.36
        },
        {
            "text": "**** did you know E3 is coming up really quick we are going to do buttloads that's right buttloads of Let's Plays there interviews podcast stuff there so is running like **** again so whenever it loads something new it's weird I don't know what's going on with Oxenfree I don't know why it runs like this I don't know what the problem is until next time it's been my pleasure to serve you",
            "start": 1878.56
        }
    ]
}