{
    "id": 1798,
    "video_id": "Dc6bN7FhpQg",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Batman: First Look at Telltale Game - Kinda Funny Reacts E3 2016",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nGreg and Tim breakdown the first look at Telltale's Batman game.\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1465764818,
    "duration": 381,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening, Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up, guys? I'm Tim Gettys, this is Greg Miller. Welcome to the first recorded episode of Kinda Funny Reacts E3 2016. Do you think it'll be the first up? Do you think it'll ever go up? This will go up, this will go up. It'll, it'll be, it'll be. Will there be exclusive merch? Oh no, there will not be exclusive merch. So Greg, yeah, obviously we're talking about Batman: The Telltale Series. We are. Here we go. We got a logo, we got some screenshots today. We've seen the logo before. This is, yeah, but this is the first look at what Batman's going to look like. I do like their whole style here with The Telltale Series. It's a callback to the Animated Series. It's what you want. Like it a lot, right? So the, this Bat-logo, right? Is it reminiscent of any other? It's, I mean, it's a Batman logo, right? It's a big fat Batman logo. So I mean, people, you could",
            "start": 0.12
        },
        {
            "text": "Series. It's what you want. Like it a lot, right? So the, this Bat-logo, right? Is it reminiscent of any other? It's, I mean, it's a Batman logo, right? It's a big fat Batman logo. So I mean, people, you could, it looks like Batfleck, which looks like uh, Dark Knight, obviously. Short ears a little bit there too and stuff. We actually get to see the cowl a bit in the actual screenshots. What's exciting more than I think the art is awesome too, but this is the official announcement that Troy Baker is Batman, Laura Bailey is Selina Kyle/Catwoman, who you'll see in this thing. Richard McGonagle, this is a weird one. Richard, like, here's the thing, if you didn't know, there's a clique of voice actors in the world. There's Troy, there's Laura, there's Travis Willingham, who of course is in this as well as Harvey Dent. These people travel together. Sometimes they have Ashley Johnson, she comes into the fold. But now Richard McGonagle, of course, Sully from Uncharted, he is in this as well. He is Carmine Falcone. So now's one, one of the",
            "start": 40.48
        },
        {
            "text": "travel together. Sometimes they have Ashley Johnson, she comes into the fold. But now Richard McGonagle, of course, Sully from Uncharted, he is in this as well. He is Carmine Falcone. So now's one, one of the homies. All right. And then in true Telltale fashion, they have Erin Yvette, who's in everything. Here we go. Very good here. Now see, very small ear on Batman here, which I appreciate. What I like about the entire Batman outfit, now Catwoman for me, at least in this one, look very traditional Catwoman. Looks like your Rocksteady Catwoman, looks like your comic series Catwoman. Batman, a mix of different styles, right? Very small ears, which I like. So we're talking like, you know, whatever, yeah, Dark Knight, exactly. Frank Miller kind of stuff. But it's got like prime ears, yeah. It's got like armor uh, mechanics to it that look a little bit like the original New 52 Bat-suit that we saw right there, where that stuff where was placed on and done. Uh, to me, he looks like a leaner Batman, which I like. I think this is very much you",
            "start": 77.72
        },
        {
            "text": "a little bit like the original New 52 Bat-suit that we saw right there, where that stuff where was placed on and done. Uh, to me, he looks like a leaner Batman, which I like. I think this is very much, you know, not Year One, but it's the start of Batman's story. They're, they're doing this where he's been going a while. This is all what I'm guessing. I think I did a panel at South by Southwest with The Telltale guys where they talked a bit about this. They had no art to show. So he seems, you know, I think this is going to be their one of their first meetings. I'm hypothesizing on that. The fact that Harvey Dent, not Two-Face, would make me think that it's still very early in the career and everything that's happening. But I like what I see. I definitely like this style. I like, I like, I think the art's really nice. I, I'm weirdly surprised by this. I don't know why. I guess I should have expected this 'cause it's Telltale and their games usually look like this. But something about it, I just",
            "start": 119.16
        },
        {
            "text": "think the art's really nice. I, I'm weirdly surprised by this. I don't know why. I guess I should have expected this 'cause it's Telltale and their games usually look like this. But something about it, I just expected the Batman to be, I guess 'cause the first trailer was like so black and white. Sure. That I guess for some reason, yeah, I was expecting something a bit more in that style. But seeing this, I'm like, oh, this looks really nice. Telltale talked about it at that South by Southwest panel with me, right? And the fact that they are, in fact, they've tweaked their engine. It's, it's not, they're not saying it's all new or anything, but they've gone in and they're adding in physics and this, that and the other, and they're going to make it look and feel better. That's I think what's interesting about the background here is that in usual Telltale style games, right? Like I think it would be very clear, there wouldn't be this much depth of field and you wouldn't get the sense that these almost look like I'm",
            "start": 155.72
        },
        {
            "text": "here is that in usual Telltale style games, right? Like I think it would be very clear, there wouldn't be this much depth of field and you wouldn't get the sense that these almost look like, I'm not saying they're not art assets that they made, but they almost look like they're pictures they put in, which are giving it a very different juxtaposition. It kind of reminds me of the Spider-Man: The Animated Series theme song. Oh, sure. In the background with all that, right? So next up, we got this. There you go. Bruce Wayne. Now this is what's from the get-go been so interesting about The Telltale Series. What they talked about is the fact, and they talk about it in their press release here, in fact, the fact that for as much time as you spend in the Bat-suit, you're going to spend as Bruce Wayne in this. They really want to get into the psyche of what it's like to be Bruce Wayne/Batman, to be that character. Because we're games are usually really good at making you feel like Batman. Now granted, I'm very much one of",
            "start": 187.0
        },
        {
            "text": "want to get into the psyche of what it's like to be Bruce Wayne/Batman, to be that character. Because we're games are usually really good at making you feel like Batman. Now granted, I'm very much one of those guys that Bruce Wayne is the mask. Batman is, is Batman. Bruce Wayne died with his parents. Batman is the person. But to be able to be Batman in a Telltale Game, but be Batman while playing Bruce Wayne is going to be really fascinating, right? Not to make the, the, you know, hard-boiled choice every time, but to make the, I'm the aloof playboy and this is what happens to me. I mean, I think it's Telltale game is perfect for that thing. It's the only real way you can kind of get that experience without it being lame and boring. Like, makes it fun and interesting. Yeah, exactly. I mean, Rocksteady gave us a taste. I remember how much I loved the Arkham City opening of starting as Bruce Wayne, getting thrown into Arkham City and then getting to finally go out. But even that was just a taste. Now here we go, little bit more",
            "start": 223.04
        },
        {
            "text": "how much I loved the Arkham City opening of starting as Bruce Wayne, getting thrown into Arkham City and then getting to finally go out. But even that was just a taste. Now here we go, little bit more secrets and stuff. Exactly. We have the Batmobile here, which we'll see in one shot or radar or whatever, Bat-computer, obviously. But what's interesting to me is this guy up here. Now this is the biggest I've been able to see. I've seen it blown up. Uh, clearly a Bat-symbol. But I'm trying to decide, that's the new NX controller. I'm pretty sure. Confirmed. Mhm. Neo's going to go crazy. Throw them up. X going to give it to you. I'm trying to decide if it's, I mean, you see over here, it collapses, right? And it's a system diagnostic flight, flight, flight recorder data. So is this the Batwing and it expands? Is it? You think so? Yeah, a drone audio. Probably drone. That makes, I was wrong. It's not the, not. We're learning together as we go. You assume he's looking over his shoulder here, going to get ready to talk to Alfred.",
            "start": 261.56
        },
        {
            "text": "think so. Yeah, a drone audio. Probably drone. That makes, I was wrong. It's not the, not. We're learning together as we go. You assume he's looking over his shoulder here, going to get ready to talk to Alfred. He's like, where you're working on a drone? Where's my Batwing? Exactly. I need a Batwing right now. Uh, Vicki Vale in this game, maybe she gets to come down. That's who Erin's playing. Cool, cool, cool. But again, good look. There you go. Looking at the Batmobile. There's your first look at the Batmobile. It's a, it's an understated Batmobile. I'm not, I'm not like, whoa, what a cool Bat. It's, it's a cool car. It's a Batmobile. Looking forward to that. I'm looking forward to driving another better shot of Batman in terms of how big he is. Seems to be, yeah, like I was saying, a more manageable Bat, a younger Bat. I would say more manageable, you know what I mean? He's out the hulking Ben Affleck. Yeah. So yeah, that's it. Those are the, the first round of screenshots from Batman series. You of course, it'll be digital like everything.",
            "start": 298.32
        },
        {
            "text": "say more manageable, you know what I mean? He's out the hulking Ben Affleck. Yeah. So yeah, that's it. Those are the, the first round of screenshots from Batman series. You of course, it'll be digital like everything episodic. You can buy the season pass disc that they debuted. I think they debuted right with Minecraft, if I remember correctly, where you buy that and then you can get the rest of the downloads as you go. But I'm stoked. Yeah, it looks great. Till next time, stay here. Subscribe youtube.com/KindaFunnyGames. This is our first piece of E3 content. Tim wants to get Kinda Funny Games and 100,000 Subs on during E3. I think we can do it. Do you think we can do it? Tell your friends. Click on the Subscribe button. Colin shaking his head. He doesn't think he can do it. French toast really good, but he made good French toast. It's amazing.",
            "start": 338.0
        }
    ]
}