{
    "id": 1803,
    "video_id": "djaEjUBdwcc",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Walking Dead Season 3 E3 2016 Trailer - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nGreg and Tim  breakdown the Walking Dead Season 3 E3 2016 Trailer!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1465773079,
    "duration": 271,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening. Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up, guys? I'm Tim Gettys. This is Greg Miller. This is another Kinda Funny E3 2016 Reacts. Today, the big one. This is the biggest one you're going to get today. The Walking Dead Season 3 is coming this fall. Clem is there and part of her finger is missing. Can you believe it? I can't believe it, Greg. All right, so here we are now. Season 3, you know, there's been a lot of speculation. Are we going to have Clem? Are we not going to have Clem? What's going to happen? Pause it for a second. This trailer doesn't give much away in terms of, okay, here's what the story is going to be, here's where you are. What I want to point out, of course, we left off with the depending, the Season Two ends, multiple ending spoiler alert, right? Uh, pretty much though, I think canonically, right, we're going to say at some point she gets to Wellington. Maybe you got",
            "start": 0.16
        },
        {
            "text": "off with the depending, the Season Two ends, multiple ending spoiler alert, right? Uh, pretty much though, I think canonically, right, we're going to say at some point she gets to Wellington. Maybe you got to Wellington with Kenny and left him outside. Maybe you walked off on your own like I did. I think eventually though, you're you'll be you're get in Wellington in Ohio. Is where Wellington, Ohio is set. What I like about this one is we go, it's fall. I feel like there's a lot of brick, a lot of alleyways, which make me think of Boston, makes me think of real America as colard call it. Is that what it is? Who the hell knows? Let It Go. Uh, this is we got a walker here now. What's important about this that'll come up later, it took me a couple viewings to catch it. I'll point it out when it happens. He's going to turn around here and right here over his shoulder is a marking. It's like it looks like a 76 right there. You got maybe it's a 76 again that would play out into the Boston, the New England area about real",
            "start": 38.12
        },
        {
            "text": "around here and right here over his shoulder is a marking. It's like it looks like a 76 right there. You got maybe it's a 76 again that would play out into the Boston, the New England area about real America and everything else like uh, but we have a 76 there which this guy at the end is going to call out. But again, brick, cobblestone, fall, gives me that Northeast feeling. I don't know if that's what it is, maybe it's just going for. But here we go, burning car, no big deal. Got a walker eating somebody over here, hooray. Then he hears a noise. What? Boom! Ow! And then pot paw Clementine missing over here on her left a ring finger. Uh, maybe again, she got to Wellington. Maybe there are a bunch of **** there and you steal something, you get your finger cut off. Maybe they find out that you shot Kenny like I did. They cut your finger off. Who knows? Let it go. We get to see a much older, give me a pause, much older Clem. Uh, again, we're continuing to go on now. Of course, I am what they like to call an expert at young",
            "start": 77.64
        },
        {
            "text": "they cut your finger off. Who knows? Let it go. We get to see a much older, give me a pause, much older Clem. Uh, again, we're continuing to go on now. Of course, I am what they like to call an expert at young girls. I'm putting her somewhere in the 13-year-old range, 14-year-old range, probably 13 or 14. Tim, does that look like a 13 or 14-year-old? I'm give 14, 15. 14, 15. Okay. Doesn't talk. You say it's going to be Melissa. Pause right there. Again, 76 or whatever we want to call that marker is. He says, you know, that one was marked. We must be getting close. You'd imagine he escaped from somewhere that brands their people and he's coming back now. That's the thing. But most importantly, Clem's back now. I don't like that he's the talking character in this trailer. It makes me worry that of course we're going to play as him and not play as Clem because I want to play as Clem, of course. But most importantly, Walking Dead from Telltale returns this fall. Yay, Telltale. No shortage of games they're working on. Mhm. You think there's a",
            "start": 123.32
        },
        {
            "text": "play as Clem because I want to play as Clem, of course. But most importantly, Walking Dead from Telltale returns this fall. Yay, Telltale. No shortage of games they're working on. Mhm. You think there's a reason they didn't say Season 3 anywhere in this? No, I think I think we it's it's easy enough for us in our head to call it Season 3 and it will be called Season 3 and da da da. But you figure like it's The Walking Dead, right? It's the same way as like the comic is an ongoing thing. Should talk about issues or volumes or compendiums. So timeline wise, where because you know, the the games are in the same canonical universe like the comics. Where do you think this falls? Do you think that this is finally getting a bit more to where we're at in the comics? Because you definitely you definitely start pushing up against that. Yeah, like yeah, Michonne of course was them playing. If you're not aware, spoilers, the comics jump ahead in time at one point. Michonne's game from Telltale filled in her gap a little bit. It",
            "start": 164.96
        },
        {
            "text": "up against that. Yeah, like yeah, Michonne of course was them playing. If you're not aware, spoilers, the comics jump ahead in time at one point. Michonne's game from Telltale filled in her gap a little bit. It didn't really tell you that much. You didn't miss much. Um, of what's happening there. So yeah, we're definitely getting close to being at least concurrent with what's happening in the comics. But then again, it's always that weird thing like when you sit down and you talk to somebody about like what's the timeline of The Walking Dead? You're like, oh ****, like it's been a year. It's always that thing where you sit down like Telltale's the same way where we got the great Season One and then clearly it jumped so far ahead when we open with Omid and Christa, not Omid and Christa. We we open up with Omid and Christa when Clem's still small and then jump ahead. I think it was 18 months, wasn't it? 16, 16, 18 months or something like that. We jumped ahead and then here clearly more time's passed.",
            "start": 203.56
        },
        {
            "text": "up with Omid and Christa when Clem's still small and then jump ahead. I think it was 18 months, wasn't it? 16, 16, 18 months or something like that. We jumped ahead and then here clearly more time's passed. Well, there you go. Returns to the fall. Walking Dead. If you're hyped, let us know in the comments below. Thank you, Greg. I like you. You got an astute eye. That's what I do as they say. These these aren't just for show. These are glasses I use to look at 13-year-old girls. My God. I knew. See, I had a worry you were going to go there and then you did. That's Greg Miller for you. We'll see you soon. I need to buy a van.",
            "start": 236.76
        }
    ]
}