{
    "id": 1847,
    "video_id": "ebJXQ1qmv4Q",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Kinda Funny's Game of the Show (So Far) E3 2016 - Kinda Funny x GameSpot E3 2016 Live Show",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nWe all decide on our Game of the Show for E3 2016!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1466028000,
    "duration": 691,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening. Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up everybody? Welcome back to E3 2016 from the GameSpot C stage. Scott Roy's out there. What's up? A round of applause for Scott Roy making PlayStation games happen. Now this segment is why PlayStation is terrible. Now I'm one of your hosts from Kinda Funny, Greg Miller. That's the pride of Long Island, Colin Moriarty. That's the pure one. You said you like how long we been doing this? You kind of butcher. We're already, I don't like it very much. That's the pure one, Tim Gettys. That's the Producer Seducer, Nick Scarpino. Guys, we've come to the end of E3. It's over, done. We did it. Great show. Our time on the GameSpot stage is drawing to a close, so we figured just like last year, we would preemptively pick the game of the show. Why not? We have Nick, you haven't been on a lot of segments. I see, I assume you're out there. You've seen a million",
            "start": 0.12
        },
        {
            "text": "so we figured just like last year, we would preemptively pick the game of the show. Why not? We have Nick, you haven't been on a lot of segments. I see, I assume you're out there. You've seen a million games. I have seen every single solitary game that I wanted to see on the show floor this year, which is to say all I did was stand over like literally went a C shot and I'm there. No, I'm seen it much tomorrow, seen it much on Thursday as well. Very excited about that. But why let that stop us? Great. No, we've never, we, we got all our awards out here. I'm so happy. I already gave one away. I already gave one away to what'd you give it to? I gave it to Batman. Tell Batman you gave one to Horizon, right? Yeah. Then we have the game to figure out. So you guys still have plenty to give out. How now, Tim, here's the thing about this is I feel a lot of my choices I have locked in of things that have impressed me, done things for me, made me feel it in the tingly. Yep, yep, yep. You haven't seen Zelda yet. I haven't seen Zelda, which",
            "start": 46.48
        },
        {
            "text": "this is I feel a lot of my choices I have locked in of things that have impressed me, done things for me, made me feel it in the tingly. Yep, yep, yep. You haven't seen Zelda yet. I haven't seen Zelda, which is hard for me because it's right there and I can feel the Zelda. I can smell the Zelda. Yeah, I haven't played the Zelda. 30 minutes, 40 minutes, 30 minutes away from playing it. I've seen the trailer. Happy about this. What, what about you? Have you talked to people about it? Very little. No one seen it. Everyone just up here like, I haven't seen it. You Brown, didn't talk to him. I talked to him. I've heard good things from the little I've seen on the internet. People are excited about it. The trailer. I have a lot of questions, a lot of questions. So I'm not ready to give it one of my Kinda Funny approved game of the show, yeah, faces. Yeah, not ready to. But I assume that later today I will be. Okay, right now that spot I'm giving to tentatively to Horizon Zero Dawn again. Wow. Last year I gave it my, my",
            "start": 90.88
        },
        {
            "text": "game of the show. Yeah, faces. Yeah, not ready to. But I assume that later today I will be. Okay, right now that spot I'm giving to tentatively to Horizon Zero Dawn again. Wow. Last year I gave it my, my game of the show. This year still impressing me. That game looks fun as hell. That's a game I actually want to play. I want to get in. I want to get all over it. So I also saw the trailer for Zelda and I think there's a lot of similarities between the two. And to be completely honest, as of right now, before playing Zelda, I'm more impressed with Horizon. So I know it's, it's pretty shocking. You won't go until you get your hands on it though. I know. But, but still, I think I, I Horizon consistently impresses me, right? Zelda from the trailer so far, yeah, it's what I expected. Okay, which is not bad. Skyrim, Zelda, that's expect. But again, it's, it's kind of like the, you always talk about the Fallout 3, Fallout 4 thing, right? Where it's like, I kind of wanted to be blown away by Zelda. And again, in an hour, everything can",
            "start": 132.48
        },
        {
            "text": "expect. But again, it's, it's kind of like the, you always talk about the Fallout 3, Fallout 4 thing, right? Where it's like, I kind of wanted to be blown away by Zelda. And again, in an hour, everything can change. But uh, so that's that spot. Okay, there is another though that's confirmed. That's Detroit: Become Human. That is the problem. I did the, I did the Detroit: Become Human segment here and I almost gave David one of my faces. But the problem is, it's the same thing. I feel like this is our first year at E3, at least for me, my first time in five or six years where I'm actually going to play games tomorrow and see things and walk around. And so there's things I want to check in on before I just give it to Detroit. Detroit had an amazing presentation. But I need to know what's happening in Lego Dimensions. I need to know what's happening is, I know State of Decay is not here, but we have to talk. Can I give a trailer one of my Kinda Funny approved things not in the running for my game of the show? Go",
            "start": 183.12
        },
        {
            "text": "I need to know what's happening is, I know State of Decay is not here, but we have to talk. Can I give a trailer one of my Kinda Funny approved things not in the running for my game of the show? Go for one of my faces. See, that's my thing because like, obviously, looking at the, the press conference last night, there's a whole bunch of amazing looking games. Crash Bandicoot. What I give it moment of the show, undeniably for me, is Crash Bandicoot. I'm not going to give it one of these. Absolutely not, right? The Resident Evil 7, I think that's super, super awesome. I'm not going to give it, not going to give it one. You know, Spider-Man, undeniably, I'm sure that if I could play or see more actual gameplay of it, it would get one of these. But because we're not, nah. Detroit though, that's a game that I wouldn't necessarily be into and they sold me on it. And I think that's why they deserve one of these. Okay, I'm glad you're giving the Detroit is the Horizon of this year for me where last year I would have thought that",
            "start": 229.44
        },
        {
            "text": "be into and they sold me on it. And I think that's why they deserve one of these. Okay, I'm glad you're giving the Detroit is the Horizon of this year for me where last year I would have thought that would game would have uh, been interesting to me, but it totally was. Detroit, very excited for it. But you're giving Horizon a head today too, right? Yeah, because they're continually impressing me. Okay, just make it sure. Just make it sure. No, last year they were my wild card is what I'm saying. Wild card. Didn't expect them. Colin, where, where are your heads at? Horizon already has one and I think Horizon's the game of the show as well. I think we should give it to it again. Uh, I think that'll be funny one. And uh, also it's just, I think Head and Shoulders above a lot what's going on here. Uh, on principle alone. And I know that people, you know, you know, think we're PlayStation Fanboys and I don't really care. I'm not going to lose literally any sleep about it. Uh, is uh, I'm going to give this principally just on",
            "start": 270.2
        },
        {
            "text": "and I know that people, you know, you know, think we're PlayStation Fanboys and I don't really care. I'm not going to lose literally any sleep about it. Uh, is uh, I'm going to give this principally just on principle alone. Days Gone getting one. Days Gone. See, that's one of the ones where get one. I liked what I saw of Rising, but Days Gone seems to be really what I'll be after. A narrative driven. I'm running through. Nick, what are you doing? Kevin, we need a camera kit in about 10 minutes. God damn it, Kevin, why is he always ruining the shows? This is totally your fault and you know it. Get up here and apologize. Get up here and take your damage. Look, look at the wide camera and apologize. No, get up in there and you apologize. I'm sorry they can't hear me though. Just say you're sorry. I just, I didn't mean it. Um, so Days Gone definitely getting, getting one. I think the game looks awesome. Bend's coming out party. I'm really pulling for them. Uh, I think that they haven't had a chance to flex their muscles in a very",
            "start": 312.36
        },
        {
            "text": "so Days Gone definitely getting, getting one. I think the game looks awesome. Bend's coming out party. I'm really pulling for them. Uh, I think that they haven't had a chance to flex their muscles in a very long time. Um, working with others IP. And so, so I'm going to give it to them as well. And the third one I'm going to save until uh, further notice. Another one that I want to in my discussions of things that caught me off guard that I, I had no interest in, but now I do. Ghost Recon Wildlands. Uh, we saw that watching that. I was like, oh, like, I thought you had an awkward trailer last year and now you're showing this demo of a world I would like to go play with friends. I would like to go get lost in. Yeah, no, South Park's another one too. Fuck South Park. Yeah, that was going to be mine. I'm giving South Park. I'm, I'm considering it South Park just because of the title, just for the genius title that they have. But yeah, why not? That and Batman are the two that I am most interested in seeing. Batman, yeah.",
            "start": 360.56
        },
        {
            "text": "Park. I'm, I'm considering it South Park just because of the title, just for the genius title that they have. But yeah, why not? That and Batman are the two that I am most interested in seeing. Batman, yeah. I'm not going to see Batman because I'm not scheduled for it. But go with what's that? Tim's got a scheduled appointment, doesn't he? I thought so. Another Batman scheduled out there for you guys. Get it. I'm excited to see that. I'm excited to see Deus Ex as well. Oh, yeah. Deus Ex. You're a big fan of, you're a big fan of, big fan of that. So you just shooting the bull. What are you saying out of there? I'm trying to think. I'm trying to think of what I'm missing here because there has to be, has to be something. I'm going to break out my phone because I want to look. Oh, Last Guardian. Last Guardian. Last Guardian does not deserve any of your awards. Last Guardian deserves a w on the knuckles for no, no, no, no, definitely not. I'm excited. I get to play it tomorrow. Yeah, I think so. That's exciting. I think we'll have a lot more to say in",
            "start": 401.68
        },
        {
            "text": "of your awards. Last Guardian deserves a w on the knuckles for no, no, no, no, definitely not. I'm excited. I get to play it tomorrow. Yeah, I think so. That's exciting. I think we'll have a lot more to say in the coming days about where are things all lie. Are you? But so are we doing what we did last year, which was our uninformed flair into the, the ground pretty much of just picking a game of the show with Cisco or are we not picking a game of the show? If that's the case, then I vote for Persona 5. Persona 5 is not even like playable though, but it's there. So let's just throw a couple of on there. What do you think? I say we wait. Put it up there. You want to wait? I say we need to. I want you to see Persona. I need to see Zelda. I need to see Last Guardian. Colin needs to see, I'm sure everything that true. Yeah, by the way, yeah, lay quick little unassociated tidbit. I, I love you how much I year since 2011 that Vita is nowhere on the show floor. No, fuck really? Not anywhere over there. Nowhere. Not one Vita kiosk.",
            "start": 437.8
        },
        {
            "text": "the way. Yeah, lay quick little unassociated tidbit. I, I love you how much I year since 2011 that Vita is nowhere on the show floor. No, fuck really? Not anywhere over there. Nowhere. Not one Vita kiosk in Sony's uh, not one. That's no good. There's only two Vitas in this building and they're both in these men's pockets. I wish there's three. I've signed more than two Vitas today. Tim, all right, maybe one day when they bring back that Crash Bandicoot, you'll sign something. But until then, you don't have to worry about it. Today's that day. Greg, uh, what do you got here? Skyrim Special Edition. Elder Scrolls Online. Dishonored. It looks great. Dishonored looks great. Yeah, you know, I was saying, I was saying no to Resident Evil earlier, but I do think they showed enough for me to consider giving it because I just want to, I don't like, I don't want to give Spider-Man because that was just a trailer. I feel like Resident Evil, especially because we've had the kitchen thing before, I think there's enough context to potentially",
            "start": 482.88
        },
        {
            "text": "to I don't like, I don't want to give Spider-Man because that was just a trailer. I feel like Resident Evil, especially because we've had the kitchen thing before, I think there's enough context to potentially give it one of. I'll tell you what, like right now, if I had to vote game of the show, I'd vote South Park now that I've been reminded that that exists. Just because, just because, because South Park: The Stick of Truth, awesome. I can only wait for Fractured But Whole. Yeah, God of War. We haven't talked about. Is your mic down? Did we finally get rid of Colin already? Hopefully. Oh, there he is. Damn, damn, he's back. Yeah, then yeah, God of War, Days Gone. We've talked about that. That's Detroit. I want to see some stuff though. That's the big. Yeah, I think we should, we should marinate. All right, well, that's my question is, how do you guys know? You just roam around and figure out what's playable on the show floor or like based on appointments? Like, is South Park playable? Do we know that? I don't know, but I doubt it. I mean, we have a bunch of",
            "start": 529.32
        },
        {
            "text": "you just roam around and figure out what's playable on the show floor or like based on appointments? Like, is South Park playable? Do we know that? I don't know, but I doubt it. I mean, we have a bunch of appointments behind closed doors to play. Are you, are you going to spend extra time outside of those appointments trying to find? I don't think I'm have much time to do that. Probably not. No, I played, I played to the your favorites. So you should have appointments for what you want to see. Okay, so you should be there. That's why you're seeing all the sex mini game. Yeah, yeah. Is that what Beat Cop is? Senran Kagura is going to be all you. Nice D I did there. You're welcome. You're all right. So right now, confirm what you have or are giving a head to. Nothing yet. Detroit's the only one confirmed. Horizon has the tentative that might get stolen by Zelda. Horizon and Days Gone. All right. And I've only given it to Batman, but I have a bunch of things in a bunch of pokers in the fire for me to. I think South Park for",
            "start": 569.92
        },
        {
            "text": "that might get stolen by Zelda, Horizon and Days Gone. All right. And I've only given it to Batman, but I have a bunch of things in a bunch of pokers in the fire for me to. I think South Park for sure. I have to give one to because I loved it. It's, it's what I love. The South Park gameplay, then superheroes. Yeah, bring all that together. That work. I'm in for that. Good. All right, ladies and gentlemen, that's where we are right now with game of the show. We haven't picked one yet, but you can be sure that we will. You won't see it here on GameSpot.com if you're watching. If you're watching on youtube.com/KindaFunnyGames, you will see it there. Remember Wednesday and Thursday. You want me to go there? You just wave. It's fine. Don't worry about it. I thought they're editing it all together. They're not doing that anymore. Are the edits done? You don't know. You're fucking around. You're worse than Kevin. Anyways, we'll put up. No one's worse than Kevin. We'll put up our final pick there. But don't worry, there's plenty",
            "start": 609.64
        },
        {
            "text": "are the edits done? You don't know. You're fucking around. You're worse than Kevin. Anyways, we'll put up. No one's worse than Kevin. We'll put up our final pick there. But don't worry, there's plenty more here on GameSpot.com if that's where you are. Our all of our crazy friends from this crazy internet culture are doing crazy things here while we jerk off all over the fuck place playing other games. Not literally, Nick. Oh, figuratively. Jerk off with just pure joy like Sony did last night. Like Sony did slapping everybody in the face. Damn, the gifts are great by the way. Yeah, they're very good. Till next time, ladies and gentlemen, it's been our pleasure to",
            "start": 649.16
        }
    ]
}