{
    "id": 1778,
    "video_id": "erCio4QoAa4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Jeff Gerstmann Has Played More VR Than You - Kinda Funny Gamescast Ep. 72 (Pt. 3)",
    "description": "Is VR a fad or the future? Jeff Gerstmann's been playing all kinds of VR games over at Giant Bomb, so let's get his opinion.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1464786004,
    "duration": 1723,
    "transcript_chunks": [
        {
            "text": "topic number three Jeff Gerstmann has played more VR than you. You've played a lot of VR. Every time I I see one of these Fob Watch GIFs, you're out there, you're doing stuff. You're throwing the the the bowling balls, you're punching things, you're swinging around, people are dancing or just laughing like an idiot. Yeah, that's you know what, again, Insight. Uh yeah, they sent the headsets and we used them. That's awesome. Like, so I want to know about it because we have the Vive. We used it one morning and then our room's too small. We haven't done anything with it. And we're excited for PlayStation VR, but that'll get here when it gets here and da da. And Oculus, we're like, we don't we're not PC people. That's not what we're about. Sure, right? So for you, the more you've played, I mean, how how how do you can you quantify it? How many hours? How many games? I uh how many games? It's probably like 40 or I mean, you games in it, but you know, it's it's probably something like 40, 50, 60 around. And are you chasing it because",
            "start": 0.31
        },
        {
            "text": "quantify it? How many hours? How many games? I uh how many games? It's probably like 40 or I mean, you games in it, but you know, it's it's probably something like 40, 50, 60 around. And are you chasing it because you believe in it? Cause you enjoy it? Because your fans enjoy it? I enjoy it. People seem to enjoy our coverage, which is funny. Like you you talk to some other sites out there writing news stories and stuff, they're like, oh, VR tanks. Like no one cares about it. And actually does quite well for us. Yeah, but you know, we're doing videos and you're being goons with your friends wearing it, right? Yeah, basically like we're using it as intended, I feel. And there are some people out there that are, you know, trying to be in the serious VR community. Like those guys aren't showing the games right. And I'm like, no, I think we're showing them all the way right. Uh and it's, you know, I'm we're not necessarily playing things up to make things look bad. I'm just I want to put these headsets on and get like first",
            "start": 52.64
        },
        {
            "text": "we're showing them all the way right. Uh and it's, you know, I'm we're not necessarily playing things up to make things look bad. I'm just I want to put these headsets on and get like first impressions. In a lot of cases, we're going to try this thing. It looks like Breakout. I don't know. Put the headset on. Let's go. Yeah, here's yet another version of Breakout that I can play with a headset on. Great. Um and that's been the problem. Uh and it's the the same thing we say about Steam, you know, is you know, they there are just a lot of games that anyone can put out whenever. And so the Oculus Store is a little more curated for better or worse, cause that just means there's like really expensive bad games for sale there. Whereas like you see stuff that's like $6, $7 on Steam uh for the Vive. And there have been some really amazing things I've done in VR, but a lot of it has been, you know, the equivalent of like a mini-game, you know, like here's another take on Pong, here's another tennis thing, here's a",
            "start": 90.56
        },
        {
            "text": "have been some really amazing things I've done in VR, but a lot of it has been, you know, the equivalent of like a mini-game, you know, like here's another take on Pong, here's another tennis thing, here's a you know, another sport kind of vaguely recreated. Here's a half-assed kind of shooting game. Uh and all of it has been fascinating in its own way. And it's the sort of stuff that I look at it like my my take hasn't changed, you know, from from we did eight hour streams at launch for both headsets. Uh whatever it was. And it's like, it's it's really great. There is a future of video games feel to it, but it's all very expensive and most of these games are bad. So it's very early days. And eventually people will start to figure out what are the right ways to you know, it's sort of like, you know, know like iOS games were terrible when they first came out. Some say they still are. I was going to say, Colin, hold, sit back. Like you can okay, you can make a decent game for a touchscreen. Sure. And people have gotten better",
            "start": 134.76
        },
        {
            "text": "were terrible when they first came out. Some say they still are. I was going to say, Colin, hold, sit back. Like you can okay, you can make a decent game for a touchscreen. Sure. And people have gotten better at doing that in the years since the the iPhone became a big deal. Um I think VR is in that same state where like you just have a lot of people trying to figure out what they can do. And then you have a lot of people that are just like, hey, here's a quick way to make some money while people are content starved and and bought this $800 headset. And so some of that stuff feels a little bit like a scam. Um but then you play something like Budget Cuts, which is a demo that's uh that's on Steam. It's for the for the Vive. And it's like a full-on stealth game that like seems really intelligently built around the mechanics. And that was the first time that actually I kind of got down low to look through a vent and actually put my arm out to steady myself on a wall that wasn't there, right? And as soon",
            "start": 180.24
        },
        {
            "text": "the mechanics. And that was the first time that actually I kind of got down low to look through a vent and actually put my arm out to steady myself on a wall that wasn't there, right? And as soon as that happened, I was like, oh shit, it finally happened. Like it's the thing I've been waiting for uh the whole time we had been doing these streams, cause everything else was like, you know, I'm I'm not getting motion sick. I'm not feeling anything. It's just like, hey, here's kind of a dumb game. I'm going to keep hitting this ball and or I'm going to keep shooting this stuff. But like you you start to see little hints of people like, okay, that's a great mechanic that should be in everything that where it makes sense. And but then you see a lot of stuff where it's like, oh, well, you know, you can throw stuff. Here's a bowling ball. You can throw it. I don't know. We we rendered a bowling alley. We did some physics. There you go. Uh so it's it's it's all over the place right now. So it's like this wild west vibe and",
            "start": 219.08
        },
        {
            "text": "a bowling ball you can throw it. I don't know. We we rendered a bowling alley. We did some physics. There you go. Uh so it's it's it's all over the place right now. So it's like this wild west vibe. And I actually kind of like that about it. Uh except for the part where it's all super expensive. Yeah, I wonder, you know, it seems like people are trying to get on board that the mentality seems to be very similar to getting a launch game out. Reminds me of PS2 launch where there was actually a shit asinine amount of games for PS2 when it came out. They were just all bad. Surf's Up, H3O, man. Yeah, and and you know, like Summoner and what? There's like, I think even from put out like multiple launch games, which and it's like, which is like, and and uh it it reminds me a lot of that mentality where it's like these games kind of suck, but you're getting here because it makes financial sense to get here. And at least you're the first to try and see what works and what does. Same reason like Ubisoft would always have",
            "start": 254.96
        },
        {
            "text": "kind of suck, but you're getting here because it makes financial sense to get here. And at least you're the first to try and see what works and what does. Same reason like Ubisoft would always have like a bunch of Wii games at launch. There's the Rabbids. Yeah, yeah. Well, I mean, well, whatever those games were okay for what they were. I hate those guys. Yeah, they're terrible. Um do you think uh we asked this question to a lot of people um or or I do anyway that we we meet and we we talk to about success of the VR, whatever, because we're I I think Greg's a believer too. I'm certainly a believer in VR. I think it's awesome. Um I've not played nearly as many games as you have, but I do think it's a new way to play. I think it's akin to shoulder buttons. I think it's akin to analog sticks. I think it's akin to like just it's going to stay. It makes the motion controller thing from the Wii and the Move controller. It makes that stuff make sense in a way that it didn't before when you're looking at a TV, you're",
            "start": 293.16
        },
        {
            "text": "like just it's going to stay. It makes the motion controller thing from the Wii and the Move controller. It makes that stuff make sense in a way that it didn't before when you're looking at a TV, you're like, but this is around you. Yeah, exactly. In other words, I feel like it's like, well, like when we went from joysticks to D-pads, it was like, well, that's that's that makes sense. And this is the way it's going to be now. And I feel like VR in a way, even though it's maybe going to take a slice off, we're still going to play games with controllers. I've always said I think we're still going to be play games with controllers on screens in 50 years. I don't think I don't think there's going to be fundamental things that are ever going to change in that way. We just might not we might be doing it in different ways. But do you think that this will have long-term financial success even though it's expensive? And who do you think will win? Because um I don't really see a future since it is so prohibitively",
            "start": 330.76
        },
        {
            "text": "ways. But do you think that this will have long-term financial success even though it's expensive? And who do you think will win? Because um I don't really see a future since it is so prohibitively expensive and since there is such a niche that I don't really feel like everyone can win, right? Yeah, I I agree. Uh but also I think that not every player is in the space yet. Uh and uh I think things are going to change start to change more rapidly now that this stuff is out there. I think PlayStation VR is in a really good spot because they're going to hit a price point that makes more sense for more people. And they're going to be a little bit more focused on just, you know, like games that make sense for for that market. Hopefully, you know, they they'll I think they'll curate a little more tightly than than Valve does with Steam. Uh and and I think that will be to their benefit. The performance is there with that head. You hope that with PlayStation, right? It's the lessons learned from Move and all",
            "start": 359.48
        },
        {
            "text": "than Valve does with Steam. Uh and and I think that will be to their benefit. The performance is there with that head. You hope that with PlayStation, right? It's the lessons learned from Move and all these different things because that when they announced it, that's what I kept saying. I'm like, this looks cool. I'm terrified it's going to be another Move, which was like, hey, cool, I got it in. And they literally hand you Move controllers. Oh, no, what? No, don't know. I'm a guy on a chair sliding down a hill doing it with they like, what the shit is going on? And I think that that's actually my one concern about PlayStation VR is uh the the Move controller stuff uh not being as accurate as the Vive motion controllers. With the Vive motion controller, you can kind of move it as fast as your arms can move. Uh with the Move with the camera tracking on on the PlayStation Move controller, I was doing something recently, which I can't actually say what it was, but I was trying to move as fast as I possibly could.",
            "start": 399.52
        },
        {
            "text": "with the Move with the camera tracking on on the PlayStation Move controller. I was doing something recently, which I can't actually say what it was, but I was trying to move as fast as I possibly could. And I was moving faster than the Move could track me. Now, this is not final software. I think, you know, they've got some improvements to make in the libraries and some other stuff. But it was that feeling that I had when the Move controller first came out of like, this is doesn't track well enough. Uh and so that's my concern there. But also I think mobile VR is going to be really big, bigger than than I think some people might think because you'll have again, it'll be that price point sort of thing. And also the untethered uh nature of it. I had that moment on a plane within the last six months where we landed and I heard the lady like over the aisle go, what was that thing you were wearing? And he was taking off. I was like, oh, you know, I was like, oh my God, it's happening. People on planes just like",
            "start": 439.28
        },
        {
            "text": "we landed and I heard the lady like over the aisle go, what was that thing you were wearing? And he was taking off. I was like, oh, you know, I was like, oh my God, it's happening. People on planes just like, shit, it, doing this, looking at, being all weird. But the the other thing I think you'll see and and this might be the thing that actually changes more traditional games a little bit more than this is when augmented reality, when AR, or mixed reality, MR, I saw someone calling it recently, uh starts to kind of happen. Uh there's a company, I think they're in Florida, uh Magic Leap, they're called. And they've got like something like a billion dollars of investment. Uh very few people have tried their tech, but everyone I've talked to that has says it's the thing you want these VR headsets to be, that it's the real deal. Oh, wow. And there's a video on YouTube of it of uh like the DreamWorks or Weta or somebody. Yeah, Weta did the the the graphics on it or something. And it's like you're you're putting on",
            "start": 480.2
        },
        {
            "text": "the real deal. Oh, wow. And there's a video on YouTube of it of uh like the DreamWorks or Weta or somebody. Yeah, Weta did the the the graphics on it or something. And it's like you're you're putting on glasses, you're looking at an office, and then you're picking up a real gun that then gauges and dials and you know, pop a HUD pop pops up. And then you know, monsters start flying out of the walls and stuff. And and you're you're gunning them down. And apparently that works as advertised in this YouTube video. Uh and on top of that, they're a little bit beyond that. And apparently they're just straight up blasting the signal into your eyes. Jesus, which sounds really dangerous. Um and and so like it's it's, you know, they haven't been out there doing a lot of PR. Wired had a story recently that that kind of shed some more light on on what they're doing. But the thing that they said in there that, you know, when you first hear it, it sounds insane, but then you start to think about it, you're like, actually that",
            "start": 521.36
        },
        {
            "text": "some more light on on what they're doing. But the thing that they said in there that, you know, when you first hear it, it sounds insane, but then you start to think about it, you're like, actually that might work. Uh once the resolutions get to a point that they need to be is like, what if we just didn't have screens anymore? And the first thing people say is like, that'll never work because people want to have a social experience. It's like, okay, well, what if everyone's wearing the glasses and the social experience is still happening, but we're just all, you know, wearing the glasses and the screen is over here or we're all watching a movie and we're in different places or we're all playing a multiplayer game that way? Um you know, they're they're saying in that Wired article, they said that like their employees are pretty soon going to not have monitors on their desks anymore because they're just going to be using the tech uh for their computer screens. Like the resolution is is such that that's",
            "start": 563.52
        },
        {
            "text": "employees are pretty soon going to not have monitors on their desks anymore because they're just going to be using the tech uh for their computer screens. Like the resolution is is such that that's possible. It all sounds like a pipe dream. It all sounds insane. I'll believe it when I see it. But when you start to figure out what the future might look like of this stuff as the screen technology gets better, as the the resolutions improves, the refresh rates improves, the there's more power driving the the the headsets, uh you start to see that this could actually start to happen. And it'll get cheaper as more and more people get into the space and as as screen technology starts being made at a higher quantity. And that's the sort of stuff that starts to make changes. Like, okay, well, you know, yeah, maybe we'll still use controllers, but maybe we just won't have the screen. Uh and it sounds crazy. And I know there are a lot of people that are just like, that's never going to happen because I'm kind of",
            "start": 600.68
        },
        {
            "text": "we'll still use controllers, but maybe we just won't have the screen. Uh and it sounds crazy. And I know there are a lot of people that are just like, that's never going to happen because I'm kind of halfway there. But also the possible future when you start to spend a lot of time with a Vive and all this other stuff and realize this is a first gen product, uh what's that going to look like in five years? Yeah, I think that that's what I'm excited about because I know I identify I think with the big three right now, which I would say where we Vive, Oculus, and then Sony is is uh an Achilles heel for each of them, but also a route to success. And I feel like I agree with you that Sony um Lauren Landing was actually the one that that kind of convinced me that Sony was the one that was most was probably going to be most successful out of the game. I was like, that doesn't make any sense. But he had the whole this was a long time ago, the whole price point's going to be right there. Have a ubiquitous box.",
            "start": 639.96
        },
        {
            "text": "going to be most successful out of the game. I was like, that doesn't make any sense. But he had the whole this was a long time ago, the whole price point's going to be right there. Have a ubiquitous box. Um it seems to me that like and it's incredibly comfortable like the PlayStation VR. Like the they are a hardware company. They made it really really well. Yeah, I I agree with you there. I think their Achilles heel obviously is going to be hardware. Um I think that that's the whole reason why they're making a new console. And I think that until we can get onboard processing on these things, which is far away at an affordable price point that you're it's going to be be shitty to be tethered to this machine that you know is just not strong enough to run the games that it can really run. On the other side, you have Oculus, which I think is going to suffer from not only its high price point, but being first in a lot of ways, even though they aren't the first VR headset, you know, technically they are the",
            "start": 679.52
        },
        {
            "text": "you have Oculus, which I think is going to suffer from not only its high price point, but being first in a lot of ways, even though they aren't the first VR headset, you know, technically they are the first one of any visibility in this new kind of rush. Um but it reminds me a lot. I I was thinking about this recently. Reminds me a lot of N-Gage in in a way where everyone's like, what the shit is this shit? Who wants to play these games on their phone? And then three years later, everyone's playing games on their phone. And and Nokia's over here was like, I told you so. So I think that there could be something with that where it's like, it's too expensive, it's too soon. It's it's they but they have a lot of funding from Facebook, so they're good. And I think Vive has a visibility problem. So I think and I don't mean an optics problem from the machine. I mean, I think I think also like, you know, HTC is tethered to the phone market in a lot of ways. And they're not doing the numbers there that a Samsung is.",
            "start": 714.04
        },
        {
            "text": "don't mean an optics problem from the machine. I mean, I think I think also like, you know, HTC is tethered to the phone market in a lot of ways. And they're not doing the numbers there that a Samsung is. You know, there's a lot of stuff along those lines as well. Yeah, you know, like Oculus is having a ton of trouble just getting headsets to the people that want to pay for them. Yeah, that's what I've been reading, which is astounding. People that even I think supported it very early aren't getting theirs, but you can go in a store and buy one. Or well, so the Best Buy, they they must have done some deal with Best Buy a while ago that they had to honor, even though their shipment thing went totally sideways, right? There's no other reason why they do it. But it sounds like that Best Buys, you know, in some cases were getting like five of them. So it wasn't even going to put a huge dent in that pre-order market. Uh and was probably something they were just beholden to in a way they couldn't get out of. That's",
            "start": 746.72
        },
        {
            "text": "were getting like five of them. So it wasn't even going to put a huge dent in that pre-order market. Uh and was probably something they were just beholden to in a way they couldn't get out of. That's my guess. But but they're not talking about a lot of stuff. And they made some changes recently to the Oculus software that actually locks out Vive users. Uh some people had made some some kind of hacky uh middleware stuff that was running Oculus games on a Vive. They have since locked that up. Uh from the sounds of it, not on purpose. It's just some other changes they made to avoid hack and stuff. But uh still in early days, that's the sort of stuff that doesn't look great. But more importantly, I think they may be underestimated the early adopter market. And something that I I did as well. I thought like, well, make like the Oculus story makes sense. They put it out. You use a gamepad. Then when more enough people have the headsets, they go, hey, check this out. Here are some some controllers. But it turns out",
            "start": 779.52
        },
        {
            "text": "make like the Oculus story makes sense. They put it out. You use a gamepad. Then when more enough people have the headsets, they go, hey, check this out. Here are some some controllers. But it turns out anyone crazy enough to spend $600 is crazy enough to spend $800 and get a Vive and get the controllers right off the bat. And that is a much richer experience than what you get with an Oculus and an Xbox controller on a PC, right? The first time we got to play the Vive for me, and I think it was for you too, was down to Rooster Teeth and the Achievement Hunter. And like, yeah, like somebody tosses you the thing and you grab it in the space. Like the thing from that video where they where they like, you can totally do that. And it's crazy. Yeah, that was also the first time I had the experience where I was in I forgot my spatial I had no spatial awareness. And I shit nailed Nick Scarpino when I was I was playing like some game on I just turned around just whacked him. And I like, oh, shit, he was trying to",
            "start": 820.48
        },
        {
            "text": "I forgot my spatial I had no spatial awareness. And I shit nailed Nick Scarpino when I was I was playing like some game on I just turned around just whacked him. And I like, oh, shit, he was trying to film you being an for getting in close. Exactly, exactly. Yeah. Um yeah, so like all that stuff is is really great. Uh but at the same time, a lot of the games are very much not great. And everything is really expensive. You know, you have a case where like a game like The Climb that uh that Crytek made is like $50 on the Oculus Store. And it's not a it's not a very good game. Uh you have, you know, a lot of cases where like, you know, Job Simulator, it's a wonderful mini-game kind of thing. It's it's a great illustrative thing of the the power of the touch controllers and or of the the the Vive wands and and stuff like that. But also they at launch, they wanted like 40 bucks for it, right? Uh and yeah, they've cut price since then. So, you know, people are figuring, you know, when it comes to PlayStation, it'll be the same",
            "start": 857.6
        },
        {
            "text": "that. But also they at launch, they wanted like 40 bucks for it, right? Uh and yeah, they've cut price since then. So, you know, people are figuring, you know, when it comes to PlayStation, it'll be the same deal. Yeah, yeah. Like and that'll that'll be curious to see if you know, if if people have learned those lessons or if they're in so deep that they literally have to charge this for it because they need to try to make their money back. I'm sure they have to set a precedent too. I'm sure PlayStation will be pushing the pressure of what it's going to cost to put out a PlayStation VR game. But I also think that and this is something we talked about with Shu at GDC, which I think goes to point you were making earlier about curation, which is um having a a a a great volume of launch games makes sense for hardware that's proven. So we had it with, you know, the Sony ecosystem. Vita had a lot of launch games. PS4 actually had a lot of launch games. And we we know what these we know what these can do or",
            "start": 898.76
        },
        {
            "text": "for hardware that's proven. So we had it with, you know, the Sony ecosystem. Vita had a lot of launch games. PS4 actually had a lot of launch games. And we we know what these we know what these can do or whatever. I actually think the opposite is going to be should be true with VR, even though I don't think it's going to be true. And this is what I was trying to stress to Shu is like, you guys better find your four or five best games and you better leave it at that, man. Because you if you launch with all of these all this shit garbage, this is this is a new way that we have got to teach people how to play and and accept. And if you come out and people feel burned spending $100 on some of these shit trash games that I know are going to be on the PlayStation Network because they're on the PlayStation Network every goddamn week on PSN. You talk about like it's it's not unlike Steam or you like, oh, here's this like mobile like what is it, Tennis in the Face and stuff like, check out this phone game. We",
            "start": 935.96
        },
        {
            "text": "Network every goddamn week on PSN you talk about like it's it's not unlike Steam or you like oh here's this like mobile like what is it Tennis in the Face and stuff like check out this phone game we made work with the PlayStation it's it's unbelievable so I'm like I'm like you guys better take a different tack because I really do think this is going to injure the product if you like it's it's almost what I've been saying about PSN for years where I'm like you could probably get rid of 75% of these games completely and I don't think anyone would give a flying shit how much how much could this game with this broken the drop description like we were talking about on PS I Love You that's translated from Japanese that no one even proof what how many hundreds of copies is that going to sell I mean can you really just get rid of it and then when someone searches for a game of a similar name they actually find what they're looking for and it's good is there any be any quality control I do",
            "start": 967.8
        },
        {
            "text": "I mean can you really just get rid of it and then when someone searches for a game of a similar name they actually find what they're looking for and it's good is there any be any quality control I do think that there's an objective and so in VR what I'm saying I guess is there's a subjectivity to video games we talk about it all the time one man's trash is man's treasure I think that's true I do think in VR a little different I do think that there's going to be an objective measure of quality about how a game works how it runs and how and and its frame rate and all that kind of stuff and you must pay attention to that stuff because people have a bad experience with VR their first or second time they are never going to go back to it and you are going to lose them forever yeah I I I suspect that like the requirements I I actually like talking to developers I think the requirements for getting a VR game onto Sony's stuff there are more performance requirements than you would have for say a",
            "start": 1001.2
        },
        {
            "text": "like the requirements I I actually like talking to developers I think the requirements for getting a VR game onto Sony's stuff there are more performance requirements than you would have for say a traditional game uh so I think they realized that like yeah people get sick if they if they get this wrong uh so they'll they'll probably hopefully put it through the ringer there I hope so because that's that's my one major fear is that seeing PSN slowly turn into the App Store has really been distressing because it used to be it's still a place where you can play great games but I look at PSN all the time and I we pay very close attention to that ecosystem and I'm like what the hell is this shit these games that limp out out they're nowhere they're featured on the story like what the hell Xbox One is not that different you know their storefront is definitely you know but but at the same time like I feel like those games don't get featured very often and that's the difference and that's",
            "start": 1032.56
        },
        {
            "text": "one is not that different you know their storefront is definitely you know but but at the same time like I feel like those games don't get featured very often and that's the difference and that's that's the the problem you run into when you say hey anyone can publish on our platform we're open to indie devs like you want to do that because you want to get as many games as possible but that's also going to open the floodgates for a bunch of stuff that you would rather probably not see on your system um and so yeah I think if you're if you're looking at as closely as we are because that's our daily job is to go look at the new releases on Steam PSN all this other stuff and go like did anything come out no this week what's going on and you see like eight games that you've never heard of that you look at and go okay this like $1.49 thing is trash um I wonder how what percentage of the overall consumer base on PSN is actually digging that deep because it's not like the store's great at",
            "start": 1069.44
        },
        {
            "text": "that you look at and go okay this like $1.49 thing is trash um I wonder how what percentage of the overall consumer base on PSN is actually digging that deep because it's not like the store's great at exposing that stuff but then it then it brings up the the point of why should it be on there at all and that's that's a that's a whole another like topic whatever I'd love to see we've talked about this before some sort of objectivity panel at Sony or something where it's like 10 people like play a little bit sitting there and they Kryptonian robes up or down in a serious way being like we got this game we can put it through certification we can make a little bit of money on it like but should we even have it at all like can you all just play it and just tell me like and if 15 of you think we should have it then we'll put it up even if it's just okay but this is like then we then always brings me back like they're just such busted ass games on PSN and I just don't believe that they're",
            "start": 1106.56
        },
        {
            "text": "we should have it then we'll put it up even if it's just okay but this is like then we then always brings me back like they're just such busted ass games on PSN and I just don't believe that they're going to keep that away from PSVR no matter how stringent their QA and their certification is you know this shit's going to be on there and someone's first entry into this is going to be one of those bad games and they're going to lose them yeah but I think you know like the the dark end of that is the early days of or most of Xbox Live Arcade and the Xbox 360 where they kept a very tight grip on that and had like one game a week and sometimes that game was not great and you're like okay well I guess this game this this week's game sucks and then eventually loosened it up a little bit they oh we got two games we got three games but it was still like you know you would talk to developers and they'd be like it's I don't I don't want to work with them because like if a if we can't get through",
            "start": 1144.2
        },
        {
            "text": "got two games we got three games but it was still like you know you would talk to developers and they'd be like it's I don't I don't want to work with them because like if a if we can't get through this process it's not even worth like we we're wasting money developing this build at all if we're not going to be able to get on the store and then on top of that because of the way the store is built and I think this is a problem with definitely with Steam uh I think PSN the same deal if they don't get featured the game might as well not exist uh it's the thing you you hear about App Stores on phones all the time is if you don't get featured your game is Dead like that's starting to happen that's definitely happening on Steam uh and it's definitely or happening to a certain extent on Steam and I think it's happening more and more on consoles as well because you hear people saying like well we didn't get the promotional slot that that this platform holders holder said we were going to because",
            "start": 1177.92
        },
        {
            "text": "I think it's happening more and more on consoles as well because you hear people saying like well we didn't get the promotional slot that that this platform holders holder said we were going to because someone else came in and bought up all the space or whatever happened and this doubles back to what we were talking about earlier right where it's like okay cool I'm a I'm a big video game website I'm only going to cover the top 5% of games and so I just had indie developer hit me up that I need to respond to because we're so busy but an email I just like how do I get anyone to pay attention to my game like I'm trying I've taken all this feedback I'm hitting up you know podcasts with codes and trying to get people to play it and it's just not happening yeah yeah I think that's that's the the reality of it now is that you know every week like we we've started saying no to more games like we used to you know we used to record uh more Quick Looks than we do now but it was a situation where it's",
            "start": 1213.56
        },
        {
            "text": "of it now is that you know every week like we we've started saying no to more games like we used to you know we used to record uh more Quick Looks than we do now but it was a situation where it's like we're doing these games that like you know no one really wants to see like the numbers bear out to a point where it's like you know we should probably take this time and spend it a different way uh and so we scaled back a little like ever so slightly just like okay well if we're doing 15 now we're doing 1  you know like that sort of thing uh and yeah so we we spend a lot of time looking at games that we then go on to not cover uh because we look at it and go like I think we're yeah I think we're okay there we we did the same thing with Let's Plays we were doing a Let's Play every day and some of these were then just like cool here's this download that looks interesting oh we're playing that's not that interesting and the audience was like I didn't I wasn't even interested off the",
            "start": 1247.32
        },
        {
            "text": "and some of these were then just like cool here's this download that looks interesting oh we're playing that's not that interesting and the audience was like I didn't I wasn't even interested off the thumbnail or headline or name so I didn't come to watch it know like if we feel like we have something to say about a game if we come out and go like hey here's something you need to see or hey here's something you need to see so that you don't don't go down this road and buy this like that's the sort of stuff that we're more likely to spend our our time on uh and that's yeah I think that's been very frustrating for a lot of indie developers but they're kind of experiencing the same thing that big publishers experienced years ago when everyone said hey you know like we're going to come to your event but we're not going to write a hands-on preview of the kids game you're making because not no one in our audience wants to read that story um or hey we're not going to shoot as many",
            "start": 1285.64
        },
        {
            "text": "to your event but we're not going to write a hands-on preview of the kids game you're making because not no one in our audience wants to read that story um or hey we're not going to shoot as many interviews at this event as we would have three years ago because the numbers say that you know these five games you know that no one wants to to watch that video it seems like PR gets it right or developers and publishers get it we like for E3 I've been hit up so many I'm like cool game looks great not our thing that's not what we're known for so I can't really help you my audience does want to see that it's viciously cyclical I think too in the sense that like you know I do feel bad for some of these indies you were talking about 8-4 before and on someone pointed me to their podcast because when they had the Shovel Knight guys on they were talking about how they were going to get the game out and they were talking about how they identified me as like as someone who was like we know Colin loves",
            "start": 1320.92
        },
        {
            "text": "had the Shovel Knight guys on they were talking about how they were going to get the game out and they were talking about how they identified me as like as someone who was like we know Colin loves Mega Man we know he loves all these things we're going to go after him with Shovel Knight or whatever and really try to get him interested in it my first thing was like my first thing my first well my first thing was like I don't know how you guys could have made this game and not understood that this game was going to be huge but apart from that um you shouldn't have to be so uh so so shit focused to try to get your game out there yet because everyone's spamming their shit all the time at you you don't you can't see the you know you can't separate the wheat from the chaff as you always say so like the games that rise to the top like Axiom Verge or whatever or Shovel Knight or whatever in their wake or thousands of games that people tried to make you pay attention to in the same exact way",
            "start": 1355.48
        },
        {
            "text": "like the games that rise to the top like Axiom Verge or whatever or Shovel Knight or whatever in their wake or thousands of games that people tried to make you pay attention to in the same exact way so it's sad that people have to be so focused and kind of salvo certain people to try to get them to pay attention to the games and for most people it does not work and sometimes I think that ends up coming across as a little creepy uh when you feel like you've been targeted to like going to make you understand that this game is something you need to cover it's like especially then if you don't like it like I'm a big fan of these games this one's not that's how it goes sometimes like you got your wish yeah with Yacht Club specifically I thought it was funny because they I remember they emailed me and uh you know at the time when we were at IGN I still had no idea that you know they had like they they that they like you know we're like we know Colin is a huge fan of these games and",
            "start": 1387.0
        },
        {
            "text": "me and uh you know at the time when we were at IGN I still had no idea that you know they had like they they that they like you know we're like we know Colin is a huge fan of these games and in my mind like it makes sense but they showed it to me and I'm like are you shit kidding me this game looks awesome so like you totally are right like and I I'll totally write about it like thanks for for realizing I would be into this because I totally am yeah I I was so happy about that same thing with to a lesser extent with Axiom Verge which was a game that I was like super into as well but uh in its kind of preview coverage but for every one of those games I also had the the emails or the people being like this is your kind of game you're going to love this it's just like Mega Man and I play it or I'm like this game shit sucks like why are you this game is nothing like Mega Man like what what you insult the name Mega Man by dare it's like but it's one of those things where I'm like what",
            "start": 1422.08
        },
        {
            "text": "or I'm like this game shit sucks like why are you this game is nothing like Mega Man like what what you insult the name Mega Man by dare it's like but it's one of those things where I'm like what the hell are you talking about this game is like Mega Man now you're just taking advantage of me and it's it's a it's kind of a different kind of thing so I think that there's for all those hits where it's like yeah you're right I love this game and I think it's really cool and I'm going to I'm going to write about it because I think it's a lot of fun there were 10 misses where it's like you know and and that's where all the shit gets lost that used to happen at like a major publisher level too where I my understanding is for for some period of time my file at EA said that I really liked hockey so I would get into random conversations and I before I real before I had heard this from someone um EA people would be like hey how's going and then start talking about hockey and I'd be like yeah cool",
            "start": 1454.16
        },
        {
            "text": "so I would get into random conversations and I before I real before I had heard this from someone um EA people would be like hey how's going and then start talking about hockey and I'd be like yeah cool all right yeah hockey great I don't care I don't I don't you know I don't dislike hockey I liked a couple of EA Hockey games in 93 sure uh but you know uh and weird things like that like the well that's that's I guess some additional level of creepiness or whatever they're keeping a file on yeah when I first learned about that that publishers and this is true I guess maybe still I don't know is that like publisher PR agencies have little things about like this is what you like like the mine probably says Colin loves shit the apocalypse you know like the apocalypse and dystopia and all this kind of say Colin loves the apocalypse you know like all and all this weird shit and he and he and he and and I'm like I've never seen one but I've been and I wish I could just see what it says about me at EA",
            "start": 1487.96
        },
        {
            "text": "Colin loves the apocalypse you know like all and all this weird shit and he and he and he and and I'm like I've never seen one but I've been and I wish I could just see what it says about me at EA or one of these things over the years but at the same time it is really weird but it's surgical because it's and that's the word I'm really looking for it's not focus it's surgical and it's smart but the surgical shit goes off the shit reservation way more often than it doesn't when people are trying to make these tacked connections that don't exist my 2D side scroller is like Metroid I'm like no no it's not no it certainly isn't like Metroid thanks for wasting 15 minutes of my time and then you start to get disenchanted with these random blast emails you get and all these kinds of things as well and then things don't rise to the top and then it's the same shit over and over again and but that's like that's kind of just the vicious cycle it's led to a point where like you know we we",
            "start": 1532.6
        },
        {
            "text": "as well and then things don't rise to the top and then it's the same shit over and over again and but that's like that's kind of just the vicious cycle it's led to a point where like you know we we definitely do like we we get people just contacting us saying like hey here's a game and you know we'll check out some of them if it sounds interesting but there's a lot of stuff that we don't and and a lot of stuff that just you know like we we don't really cover uh Kickstarters if they have not crossed the funding line yet unless there's something very newsworthy about it like hey this major player got in isn't that weird right and then the story is more about hey how desperate are they good you know like that sort of thing um not always Time Has Changed he's down on his look those guys um but we just get non-stop Kickstarter pitches like hey here's the game we're launching the Kickstarter tomorrow here's our trailer it's like we're not going to run ads for your yeah like that's not",
            "start": 1568.8
        },
        {
            "text": "um but we just get non-stop Kickstarter pitches like hey here's the game we're launching the Kickstarter tomorrow here's our trailer it's like we're not going to run ads for your yeah like that's not what we're here to do and and you know if your game is good we'll point people to it when they can buy it uh by running video coverage then or something if if we think it's worth if we if we think it looks cool not taking a shot on concept art two years yeah yeah and and that's that's gone for a lot of people like we've been offered interviews with people who are you know major figures in the video game industry that have launched Kickstarters be like sorry no we just we're not going to do it it's funny though that it goes both ways I do want to say that there was this I was you're working at a place like IGN and you were so used to and I'm sure you had the experience of Giant Bomb and obviously GameSpot where you kind of reach out to someone and they typically answer you because they're",
            "start": 1602.8
        },
        {
            "text": "at a place like IGN and you were so used to and I'm sure you had the experience of Giant Bomb and obviously GameSpot where you kind of reach out to someone and they typically answer you because they're like oh this is probably could be fortuitous for me to have this conversation with this person in terms of like you know uh getting my game out there or whatever and I remember someone pointed me to this and I don't know if it still exists it was like this uh 16-bit style role playing game set in the American Revolution and it was like being Kickstarted or something like that and I reached out to them and I'm like yo this looks shit awesome like can we interview like and they never answer me and I'm like huh so it goes both ways you don't want to talk to me either sometimes you have to let the sleeping dogs lie yeah absolutely all right that was topic three and it was sponsored by Squarespace whether you need a landing page a beautiful gallery or professional blog or online store it's all",
            "start": 1644.4
        },
        {
            "text": "sleeping dogs lie yeah absolutely all right that was topic three and it was sponsored by Squarespace whether you need a landing page a beautiful gallery or professional blog or online store it's all included with your Squarespace website creating your website with Squarespace is simple intuitive and easy to do we did it with KindaFunny.com Gen 1 yeah we did it wow Nick Scarpino did it with KindaFunny.com Gen 1 because again Colin and I we just have a table we would sit here and talking to an iPhone uh you can add and arrange your own content and features with the click of a mouse you get free custom domains beautiful templates and 24/7 customer support start your free trial today at Squarespace.com and enter the offer code Kinda Funny to save 10% on your first purchase",
            "start": 1678.16
        }
    ]
}