{
    "id": 1881,
    "video_id": "GUaKHFrWUKY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Kindergarten Cop - The GameOverGreggy Show Ep. 134 (Pt. 2)",
    "description": "Nick questions if he needs a Kindergarten Cop remake.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1467097201,
    "duration": 1003,
    "transcript_chunks": [
        {
            "text": "Nick, what's your topic? Complete polar opposite from the one we just talked about. Uh, I was on the flight back from E3 and the very classic film Kindergarten Cop. Arnold Schwarzenegger, former Governor, very for IDE, uh, great ideas, uh, some bad ideas too, uh, not as bad as people think. I'll show we can dive into that on a later one. I'd love to actually hear your opinion on him. Um, my question is, now they've made a sequel, the Kindergarten Cop did, direct-to-DVD, direct-to-DVD, Dolph Lundgren, right? Where where he goes and looks for some sort of flashlight. Bill Bellamy was in that. Yeah, did you see this? No, I saw the trailer. Oh man, we got to watch this. It came last month. Um, so my question is, out of all the films they're remaking, why don't they remake Kindergarten Cop? Why can't they give it an actual wide theatrical release? Cast someone amazing in it. Stop remaking, make new movies. I mean, there's no way they could have captured that magic. That movie has something so special to it. That's my question to you, if should",
            "start": 2.85
        },
        {
            "text": "cast someone amazing in it. Stop remaking, make new movies. I mean, there's no way they could have captured that magic. That movie has something so special to it. That's my question to you, if should it be remade? No, no, absolutely not. I'm a fan of remakes overall, right? This though, no, no, no, no, no. Like I remember being a wee little lad watching this movie on the the late night like TNT and all that shit and I was just blown away. That movie introduced me to ferrets. Yeah, I love ferrets, illegal in California. And just just overall, yeah. Oh, trust me, every kid that grew up in the '90s knows that because they were I didn't I didn't know my my grand my grand my dad's dad had a ferret. But that's maybe you know, say your dad's dad was a ferret. He was also a ferret grandpa. The story of that movie though, I mean, it was it just captured you, you know, and just that end part. It was so intense. You wanted to make sure that everyone was okay. And God damn it, Arnold did it. The reason it wouldn't work anymore is because",
            "start": 58.56
        },
        {
            "text": "it was it just captured you, you know, and just that end part. It was so intense. You wanted to make sure that everyone was okay. And God damn it, Arnold did it. The reason it wouldn't work anymore is because there's no star in our world of social media and everything else that can make that move and make that pivot and have it be as funny as that was. Because remember, Arnold Schwarzenegger was still coming off of being The Terminator and being all these The Barbarian. I if I read correctly on IMDb, he literally left the shoot to go film a teaser for T2, right? So this puts it in context as like when this was happening, he was like the ultimate badass. And so there was no look behind the curtain that he wasn't always like that. And so for him to come out like, because they open that movie and I remember that trailer opening very much like it's his normal, yeah, he's going to kill all these people and be awesome. And then yeah, he goes in, has to be this like heartwarming kindergarten teacher and he's like the big man",
            "start": 108.16
        },
        {
            "text": "opening very much like it's his normal, yeah, he's going to kill all these people and be awesome. And then yeah, he goes in, has to be this like heartwarming kindergarten teacher and he's like the big man struggled with these little kids. I'm like, who would do that now? You know what I mean? Who would do? You don't have some like The Rock's awesome. Everybody knows The Rock's awesome. He's in, you know, Vin Diesel done a bunch of different, right? And none of those had the explosion though. Vin Diesel did The Pacifier and none of them, right? None of them had that kind of crossover potent. Hulk Hogan did a shit. Yeah, yeah, Mr. Nanny, whatever. Hulk did the nanny movie and then he he did the he was a space movie too. Yeah, that was where it's like that just doesn't even then it was like Hulk Hogan's persona was already so lovable and great that those movies didn't have those explosive appeal when Arnold Schwarzenegger comes out of nowhere and suddenly it's fucking awesome and everybody's like, oh my God, he's funny.",
            "start": 143.52
        },
        {
            "text": "so lovable and great that those movies didn't have those explosive appeal when Arnold Schwarzenegger comes out of nowhere and suddenly it's fucking awesome and everybody's like, oh my God, he's funny too. Yeah, I thought he could barely speak, but it turns out he can barely speak and he's funny. I'm actually convinced, and I can't really back this, actually, I could back this up. I'm convinced he got worse as an actor as as it goes. Like if you watch his stuff now and then you go back and watch Kindergarten Cop where he could he actually had decent scenes in that film. Like I haven't seen it as as an adult ever. So I'm watching this. I'm like, these are actually heartfelt scenes where he's emoting and he's he he has an emotional range in this. And then you go back later and watch like End of Days or whatever, like the the one he did he just did where he was like a a sheriff, a town sheriff, a giant Austrian town sheriff in Middle America and he's he's just one note the entire. But again, that comes down to",
            "start": 181.8
        },
        {
            "text": "like the the one he did he just did where he was like a a sheriff, a town sheriff, a giant Austrian town sheriff in Middle America and he's he's just one note the entire. But again, that comes down to the fact that I think like what he's getting what he's getting cast in now is like The Expendables or whatever, you know what I mean? Like, all right, be Arnold Schwarzenegger, you know what I mean? Don't you don't need range for that or whatever. But it's sad because I feel like he he actually started progressing as he was trying and then realized that he doesn't have to actually try. Well, I think it's just I think yeah, his career, I mean, he just kept getting those roles. It's just be Schwarzenegger. That's I used to worry about. Yeah, I'm just fascinated. I'm fascinated with you guys' perspective on this because I, you know, you all know that I I love terrible films. And in and in fact, Cop's Terri, my that's my question. Do you guys see Kindergarten Cop in the same light that I do where I hold it in very high esteem like",
            "start": 219.08
        },
        {
            "text": "you all know that I I love terrible films. And in and in fact, Cop's Terri, my that's my question. Do you guys see Kindergarten Cop in the same light that I do where I hold it in very high esteem like very I think it's a fun that's one of those great movies. I was talking to somebody the other night about movies that that movies that come on TV and you watch, you know what I mean? That's definitely on that list. So I think it's like, you know, Casablanca, no, but is it an enjoyable fun movie? I use would I use the term very high esteem for Kindergarten Cop? Probably not, probably not. But it's good. I haven't seen it in way too long, but I'm sure I would enjoy it. I'm sure that I would actually want to watch it comes on TV and I'm like, all right, this is my afternoon. This is totally one of those movies. I don't I don't have a crystal clear remembrance of the opening. Like I can tell you what like the notatum are and then Dominic Dominic, he's fucking this the the guy clearly supposed to be Steven Seagal. We",
            "start": 249.72
        },
        {
            "text": "I don't have a crystal clear remembrance of the opening. Like I can tell you what like the notatum are and then Dominic Dominic, he's fucking this the the guy clearly supposed to be Steven Seagal. We can't get Steven Seagal. Put a ponytail on that guy. I say Dominic Dominic, you you don't even remember your dad. Oh my God, they coming back in the back. We always knew they were going back like that. I was watching that trailer for Independence Day by the way. And and he doesn't say anything like that. The trailer the best. No, there one he's like they coming. They like they're back or something. But like we're like we always knew they were going to come back in the back. Oh man, that's all only life. So Nick, this this might warm your heart a little bit. Sure. I don't remember the context, but Kindergarten Cop was shown in my film studies class in college. I don't know why do this, but no, it it was I think it was for something about comedy, probably about comedic timing and like how to to cut comedy or whatever.",
            "start": 289.36
        },
        {
            "text": "shown in my film studies class in college. I don't know why do this, but no, it it was I think it was for something about comedy, probably about comedic timing and like how to to cut comedy or whatever. But uh, it it makes me happy that they see it in high regard. Yeah, you know, the school system that's what their teach kids now. It's just it's it's one of those rare instances, well, from the '80s where the absurdity worked, right? Where it all came together. And that because that could have been a huge disaster similar to Jingle All The Way, right? Where you were like, what is happening? This Nick, horrible film. Excuse you, Jingle All The Way, fucking Turbo T. He's got to get Turbo Man or whatever the fuck doll was. Jingle your face. And that's the same thing though. What it suffered from is they tried to do it again of like, all right, we'll put him Junior also, right? And Junior was one of those Jun Junior, yeah, it wasn't it was they were it wasn't good. But I mean, they were stretching and like, let's give you like a",
            "start": 338.56
        },
        {
            "text": "of like, all right, we'll put him Junior also, right? And Junior was one of those Jun Junior, yeah, it wasn't it was they were it wasn't good. But I mean, they were stretching and like, let's give you like a real plot to work with or whatever. You're going to have a fucking baby. Twins falling all this. Oh, I'm sorry. I was thinking Twins. Junior is later where where he became pregnant. Yeah, he was the first man to become pregnant. Twins was the one that actually Twins had some heart to it because they had Danny DeVito and Danny DeVito played the the other side of the G. Twins was two years before Kindergarten Cop. I like to look at them as kind of a trilogy. You know, you got your Twins, you got your Kindergarten Cop, and you got your Junior. It tells a nice little little story that Jingle All The Way is when they tried to take it too far. Jingle All The Way was probably the end of his career as we knew it. Like when you when you look at it, that's he peak really with probably Junior was probably on the way down.",
            "start": 384.44
        },
        {
            "text": "tried to take it too far. Jingle All The Way was probably the end of his career as we knew it. Like when you when you look at it, that's he peak really with probably Junior was probably on the way down. And then when you hit Jingle All The Way, you're just that much closer to End of Days. Jun when I saw the it was awesome. Junior, I remember it wasn't for me because I was a kid. But yeah, well, yeah, I know, but that was the thing of like, it was just another one where it was S. I just said Twins. We're talking about Twins. I thought you said Junior. I'm sorry. Maybe Twins. I liked Twins was good. I'm just trying to defend Twins. I Danny DeVito, it's where they were born and he and Arnold Schwarzenegger got all the good genes and Danny DeVito got the leftovers. And so I mean, it's kind of a genius concept. But you know, had a heart to it because DeVito is kind of a shitty guy and then realizes that the reason he is because of that is because of genes. And then he can rise above that. He can be better than that. Didn't they make a",
            "start": 422.2
        },
        {
            "text": "to it because DeVito is kind of a shitty guy and then realizes that the reason he is because of that is because of genes. And then he can rise above that. He can be better than that. Didn't they make a sequel? They call it was it the Triplets? I'm sure think it was. They did a lot of straight DVD. Get on it. Figure it out. I'm on IMDb. There's a sequel called Triplets. If they were remake Kindergarten Cop starring the fucking goddamn it, I would have to see that film. I know you would. Or starring Vin Diesel. Triplets is in development according to this. Yes, yes, yes. Uh, it's Danny DeVito, Arnold Schwarzenegger, Eddie Murphy. Oh my God, the Triplets. I don't know a lot about science, Kevin, but can we get them in every report? According to Arnold Schwarzenegger's 2012 biography Total Recall, Julius and Vincent Benedict discovered they had another brother who also came from the experiment. The other brother is played by Eddie Murphy. Sweet Jesus, this is a movie that never going to happen because Eddie Murphy doesn't do funny",
            "start": 460.72
        },
        {
            "text": "they had another brother who also came from the experiment. The other brother is played by Eddie Murphy. Sweet Jesus, this is a movie that never going to happen because Eddie Murphy doesn't do funny movies anymore. Um, I mean, he do family films a lot, but he doesn't do that specifically. He ain't Eddie. He's not Eddie anymore. That's that's a topic for another day because I I I used to love Eddie Murphy and then watching sort of his not decline, but sort of transition over to family films has been kind of sad for me. You're talking about a guy who had probably one of the best biting senses of humor from the '80s and '90s ever. And then he just couple things happened to him and he just couldn't do it anymore. Unfortunate. It reminds me of it reminds me of um, like anywh if he's declin or like which seemed to be partially like what he wanted uh, in a way. Oh, it seems to me it's it's very similar to Jim Carrey to me where I'm like, what happened? Like, what happened to you? And Adam Sandler too. But Adam Sandler's trying.",
            "start": 507.56
        },
        {
            "text": "partially like what he wanted uh, in a way. Oh, it seems to me it's it's very similar to Jim Carrey to me where I'm like, what happened? Like, what happened to you? And Adam Sandler too. But Adam Sandler's trying. Like these other two like don't really do much in them. Netflix is trying for Adam on Adam Sandler's behalf. Every fucking time I'm done watching something, it tries to push that stupid Adam Sandler David Spade movie. But have you watched the trailer? No, it didn't look terrible. Really? Yes, it's awesome. Like that's my boy. Turns out Pixels not as bad as everybody said it was. Really? Yeah, everyone hated that. Well, everybody hated without seeing it. Yeah, which was one of those like pot calling the kettle black moments. Like it came on TV. I was I was in Vegas with P.O. and it came on TV and I scoffed. He well, you P.O. sees every film. I'm he's like, well, you don't like Pixels. I'm like, it's I heard it's terrible. He's like, oh, but you haven't seen it yourself. And I'm like, no. He's like, we're watching Pixels. Oh my God, we",
            "start": 545.96
        },
        {
            "text": "sees every film. I'm he's like, well, you don't like Pixels. I'm like, it's I heard it's terrible. He's like, oh, but you haven't seen it yourself. And I'm like, no. He's like, we're watching Pixels. Oh my God, we watch Pixels. And I was like, this wasn't that. I mean, granted, I thought it was going to be trash garbage, you know what I mean? I was like, all a laugh or two in there. Was it better or worse than Click? I like it was better than Click. Really? Really? I didn't like Click that much. So there you go. I watch Pixels then because I like to Click a lot. This will be a fun one. We should do a commentary. Oh, totally. Because it had Walken in it, right? Yeah, it was like, whoa, zo true. Going to Bed Bath & Beyond. The scene the one scene in Pixels from the trailer that made me laugh was the Pac-Man's dad, which was like the funny misunderstood sand. Uh, yeah, I mean, my topic, uh, not nearly as deep as gun control, but I just wanted to so we come to the conclusion, Kindergarten Cop is an awesome movie. Well, it's my it is an awesome movie. We",
            "start": 584.84
        },
        {
            "text": "sand. Uh, yeah, I mean, my topic, uh, not nearly as deep as gun control, but I just wanted to so we come to the conclusion, Kindergarten Cop is an awesome movie. Well, it's my it is an awesome movie. We but I also I all disagree with you because I feel like if they announced that The Rock was doing Kindergarten Cop, we would all have to go see it. Well, yeah, we I just went and saw Central Intelligence last night. The Rock does anything. Again, I here's the thing I've I've noticed is I've gotten older. I go into movies now with the correct expectation. So when I went to see Ninja Turtles, Ninja Turtles ended and me and Tim's brother Greg walked out. We like, that was fun. All right, I had a great time. And Kevin came out. That was a bad movie. I like, what did you fuck expect from Ninja Turtles? It had Krang in it. Isn't that everything you want? No, it had Krang in it. It had ninjas. I was on top. Look pretty cool. Exactly. Oh, y'all got jokes. But it's you need another Bebop in it. It's very true though. I mean, it's similar to the",
            "start": 625.96
        },
        {
            "text": "that everything you want. No, it had Krang in it. It had ninjas. I was on top. Look pretty cool. Exactly. Oh, y'all got jokes. But it's you need another Bebop in it. It's very true though. I mean, it's similar to the conversation we had after we saw Civil War, right? Where it's like every movie kind of has its place now, right? And its place like the comic book movies specifically aren't necessarily to be great films. They're great popcorn films, right? When you go see it like I'm going to go see Baywatch when it comes out. Oh yeah, that's be funny as hell. Different, probably a bad funny. No way they're doing a hard R. Are they set to succeed right now? Going to be okay. So maybe maybe it'll be on the level of 21 Jump Street. I think it will. That's a really good call. They're going to hit that great. But to me, I feel like it's going to be on the same level as what Mike and Dave Need Wedding Dates or whatever that movie is with Zac Efron. That's that's its own tier. That you can tell a movie is that tier when they're like",
            "start": 661.68
        },
        {
            "text": "going to be on the same level as what Mike and Dave Need Wedding Dates or whatever that movie is with Zac Efron. That's that's its own tier. That you can tell a movie is that tier when they're like showing the movie a year before it comes out at Comic-Con and are going to be in a good movie. So let's make sure we show this movie. Although that that looks pretty funny, just pretty funny. It's not right. But Baywatch though, my money's on Baywatch. But you see, I did the right thing with Central Intelligence where I'm like, I like The Rock and I like Kevin Hart. And I'm like, I like watching their banter on Instagram. So yeah, I'll go see this movie. And then I was sitting down and I was I talked to the person one like, what are wait, are people do people like this? She's like, oh no, no, no, critics don't like this movie at all. Like, oh no. And then it start was like, oh, but this is exactly what I wanted out of this. It's The Rock and Kevin Hart fucking around for an hour and a half or whatever it was. Yeah, that's",
            "start": 705.76
        },
        {
            "text": "movie at all like, oh no. And then it start was like, oh, but this is exactly what I wanted out of this. It's The Rock and Kevin Hart fucking around for an hour and a half or whatever it was. Yeah, that's why I like Ride Along. Not a great film, but it's a fucking Ice Cube and and Kevin Hart fucking around for an hour and a half. It's funny. Yeah, see, I I feel like the I I I've talked about it. I'm keeping this list on my phone all the movies I've seen this year. And a lot of it has been that I I'll go on Amazon and I'll watch the trailer or I'll be like, I remember liking that trailer when I saw. I'll just jump in and I don't do any research. And then I come out. I was like, I enjoyed that fine. You people hated it. And it's was like, well, they're coming at it. A that was their job to go review it or whatever. Or they were super excited for it. It's like with Neighbors 2. I was like, Neighbors 2 looks great. And everybody's like, huh, it's not doing well in the reviews. And I never went and saw it. I'm like, damn it, I",
            "start": 746.4
        },
        {
            "text": "they were super excited for it. It's like with Neighbors 2. I was like, Neighbors 2 looks great. And everybody's like, huh, it's not doing well in the reviews. And I never went and saw it. I'm like, damn it, I gave up. I should have gone out there because I like all the people in Neighbors 2. Why wouldn't I like Neighbors 2? The Neighbors 1 was great. Surprising is all shit. Did not expect to like it. It was funny. Yeah, Neighbors 2 got that one girl. What's her name? Chloë Grace Moretz, right? Hit-Girl. Big fan of her. Awesome. Yeah, big Islanders fan. Is she really? Yep, huge Islanders fan. Get her on the show. She's going to be Ariel. She goes like all the Islanders home games. She going to be Ariel. What what is Ariel going to be in Little Mermaid? They a live action Little Mermaid. Yeah, unfortunately, it's not Disney making it. It's going to be some Bush. It's a whole thing. Also, Colin at Let's Play Live, did you notice that Nick threw up the L.I.? No, yeah, every time I came out. No, it's just the time we were on stage. But",
            "start": 779.6
        },
        {
            "text": "making it. It's going to be some Bush. It's a whole thing. Also, Colin at Let's Play Live, did you notice that Nick threw up the L.I.? No, yeah, every time I came out. No, it's just the time we were on stage. But every time I came out, I was trying to throw it out just you'd see it. But you're never proud of me than you. No, but I was never proud of me. You know, it's too busy getting booed by everyone in the stage. Not true. We almost won that game if you just cheated like I told you to. We I should have cheated, but I don't want to win like that. I don't care. I don't want to win. I don't win like that when it comes to those fuckers over at Funhaus. They can suck it. Yeah, I could I could I could have won, but I I chose not to win. L up. Fair enough. That's what it looked like. Sorry, sorry, Greg. Sorry, everybody. I'm so sorry. I'm going to go feed this topic was brought to you by Harry's. Stop compromising on your shave and get started with Harry's. For far too long, you've either paid too much for a comfortable shave or you've",
            "start": 815.96
        },
        {
            "text": "settled for a low price but low-quality razor. Harry's offer something you've never had before, a great shave at a great price. Harry's makes its own high-quality razors, cuts out the middleman, and ships them directly to you for half the price of the leading brand. Good shave, good price. It's simple. Get the best of both with Harry's. Harry's Starter Set is just $15 and that includes a razor, three blades, and your choice of Harry's shave cream or foaming gel. Which do you prefer and why? Let them know when you order. As an added bonus, you can get $5 off your first purchase with the code Kinda Funny. After using the code, you can get an entire month's worth of shaving for just $10. By cutting out the middleman, Harry's offers an amazing shave at a fraction of the price of drugstore brands and it's always free.",
            "start": 852.4
        },
        {
            "text": "code you can get an entire month's worth of shaving for just $10. By cutting out the middleman, Harry's offers an amazing shave at a fraction of the price of drugstore brands and it's always free. This is where I'm supposed to kick to Tim where he can tell you how he trimmed his beard with Harry's because he got a free Harry's. But Tim's not here because he's got to pee. Do you want me to you want me to knock on the door with a mic? You'll never make it over there. There's not enough cord. There's not nearly enough cord. Just how how good how how good does Tim's beard look trimmed with whatever he's doing? It's working so good for him. Um, you know what I mean? Yeah, I don't know. I I'm not in his bathroom while he's trimming himself while he's manscaping himself. Do you think he's using Harry's down there? Uh, I mean, knowing Tim, he's bald from the neck down. The yeah, but he's using the Harry's one the whole L. Probably. Are you using the Harry's just to trim up the beard or you going downstairs? So a lot of",
            "start": 894.4
        },
        {
            "text": "uh, I mean, knowing Tim, he's bald from the neck down. The yeah, but he's using the Harry's one the whole L. Probably. Are you using the Harry's just to trim up the beard or you going downstairs? So a lot of people have been asking me, Greg, at E3, they're like, your face looking fresh. And I was like, you know why it's looking fresh? Because that Harry's razor. I've been using that shit. Look at that. That's do it today actually. So nobody clean. It's none of our kids know. I I want to I want to say that I've used it down there, but I also uh, have access to the uh, what is it? The Venus razor, which I'm quite fond of as well because they have a lot of lotions on it and stuff like that. You got to use you got you got to do what you got to do down there. Are you talking about down there down? Yeah, down there. Okay, yeah, no, I haven't I haven't tried the Harry's razor down there yet. Well, Harry's Starter Set, it's called The Truman, is a great option for new customers. An amazing deal for just $5. You get the razor handle,",
            "start": 928.72
        },
        {
            "text": "moisturizing shave cream, there you go, and three of Harry's five-blade German engineered razors. Plus, there's a special offer for us as we already talked about. They'll give you five bucks off your first purchase with the promo code Kinda Funny. Go to harrys.com right now. For the shave set, that's Harry, H. A. R. R. Y. dot com. Enter the code Kinda Funny to check out to get $5 off and support the show. Stop compromising. Give Harry's a try today.",
            "start": 966.72
        }
    ]
}