{
    "id": 1777,
    "video_id": "igZO7MdY-Ug",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What You'd Ask Your Grandfather - The GameOverGreggy Show Ep, 130 (Pt. 3)",
    "description": "Most of us lose our grandparents when we're too young to know them. So, if you were able to talk to them as an adult, what would you want to know?\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1464764402,
    "duration": 1317,
    "transcript_chunks": [
        {
            "text": "my topic, yes. Uh, what I want to know, and I don't know how this is going to play for you because I don't know much about you, okay, and your family tree as it would be. But I was thinking the other day, because of course there was this hit topic on The GameOverGreggy Show called Grandma Miller and the sickly raccoon. If I'm lying, I'm dying. Uh, no, but I started thinking about it the other day and grandparents, and I was thinking about the fact that I would love to have a conversation with my grandfather. And when I say that, I mean my mom's James Kennedy, Jim Kennedy, uh, my mom's dad. Uh, and the fact that I only knew him when I was a child, you know what I mean? My dad's dad died when my dad was a child, so no connection there whatsoever. Grandma Miller, uh, passed away when I was in high school, so again, I'm not an adult, but I got to, I feel like, go through a progression with her where I wasn't, you know, playing with as many figures as you'd say by the time she passed away. But like, Poppy, write that down. Jim Kennedy, yes.",
            "start": 2.85
        },
        {
            "text": "but I got to, I feel like, go through a progression with her where I wasn't, you know, playing with as many figures as you'd say by the time she passed away. But like, Poppy, write that down. Jim Kennedy, yes. Poppy himself, like, he passes away and I'm, I'm bad with everything like this, must have been junior high-ish, but early junior high, mid, like, yeah, sixth grade, somewhere in there, maybe, or whatever. So to now sit here and think about like all the questions I'd want to ask him and have a, have him on The GameOverGreggy Show and do one of those one-on-one talk, have a beer with him, talk to him, because I feel like we would have gotten along as adult males, but we never had that chance, right? So I want to know if, if what you guys think on all that, because like, for me, I'd want to talk to him about World War II, right? I have his Purple Heart in my, really? Yeah, he, you know, he did the Normandy thing, he did all this crazy **** and I saw the photos and, you know, you, I think, probably interviewed him for some shitty",
            "start": 55.0
        },
        {
            "text": "I have his Purple Heart in my, really? Yeah, he, you know, he did the Normandy thing, he did all this crazy **** and I saw the photos and, you know, you, I think, probably interviewed him for some shitty like, you know, when you're writing on that giant like the, not, not loose leaf line paper, but the giant line paper. I like, my Poppy did that, that, you know what I mean? Like, but not like my Poppy killed 1,000 Nazis, exactly. I would want to know that **** like, what, the ears on a string? Like, what was that like to, you know, do that and live that life and see the world change as much as it did when he was around, you know what I mean? To have me sitting there playing with **** a Game Boy or whatever, or have the, you know, the first computer in the house that he was in or stuff like that. And then, but then just to get, I mean, to hear what it would have been like to see, you know, Glen Ellyn in the area around it in Chicago evolve into what it was and what that would have been like for him. And because I just think",
            "start": 94.44
        },
        {
            "text": "I mean, to hear what it would have been like to see, you know, Glen Ellyn in the area around it in Chicago evolve into what it was and what that would have been like for him. And because I just think about it now of like, this stems from the Grandma Miller sickly raccoon, thinking about my family or whatever. But then so much of just the fact of like, what we do, right? Of like, our jobs are to sit here and do this and da da da. And you go, you start peeling back through like what my dad is, his heavy equipment operator, right? And then my, my grandfather was his veteran who did all these different jobs and, you know, I think worked on rubs and stuff. They get all the stuff Greg talks about, all the fruit that you can eat in, talk about like, hey, what's this? And like, well, first off, I think we offer an invaluable service to society. Okay, definitely take their mind off problem. If you're trying to drop parallel that we're not real men because our fathers, no, no, I, well, I mean, that's the whole, that's the funny thing.",
            "start": 135.04
        },
        {
            "text": "to society. Okay, definitely take their mind off problem. If you're trying to drop parallel that we're not real men because our fathers, no, no, I, well, I mean, that's the whole, that's the funny thing. Like, they're real, the, the real men definition and **** like that, it's, you know, changing, evolving. Even when you like watch, I know, but it's, it's part of the point. It is part of the point of like, we definitely are the generation or whatever that just say stepped up like, sorry, we like wearing jeans and T-shirts. That's what we're doing. **** you. Like, that's what we do now. It's not just like what we do when we're gardening outside anymore. No offense to gardening, but I just remember that was like, you know, when my dad wanted to go **** around in the yard or whatever, some garbagey T-shirt and whatever, something looking like this. Yeah, that's true. I think, I think my, my grandfather's generation never, I never, I don't remember seeing any of those people in jeans. They were never in denim. Like, denim was, uh, like",
            "start": 175.12
        },
        {
            "text": "looking like this. Yeah, that's true. I think, I think my, my grandfather's generation never, I never, I don't remember seeing any of those people in jeans. They were never in denim. Like, denim was, uh, like the holy water, their vampire, right? If, if they hit denim, they would just melt away. Uh, it was always polyester. Yeah, it was poly, always. Like, every, like, and I always, I imagine because I never knew my grandfather, this is a great topic, by the way. Um, because I never knew any of my grandfathers, actually. I have three. My mother was adopted, um, and brought over. And so I had, uh, three sets of grandparents. I knew, um, my grandmothers quite well, but both of my grandfathers had passed away before, I think one of them, the last one had died before I was even, uh, when I think I was one. So I have, there's a picture of me as a baby with him, but that's pretty much it. And I look exactly like him now, not then, although he was bald, so there was a parallel back then as well. Um, so it's, it's fascinating that you bring that up.",
            "start": 210.52
        },
        {
            "text": "as a baby with him, but that's pretty much it. And I look exactly like him now, not then, although he was bald, so there was a parallel back then as well. Um, so it's, it's fascinating that you bring that up just because I, I, I don't know anything about him, literally. Like, nothing about. I know he was a navigator on a bomber in World War II. Um, he got my dad stationed, I think, at March Air Force Base during Vietnam, so he very well may have saved his life. Um, there's not, he was an accountant and a lawyer. I mean, I was just basically want to like start from the beginning, what the ****? Like, what, what brought you out here, you know, from Jersey to California? Like, why did you do that? I don't know any of the answers to this. And whenever I ask, that was a generation of people that didn't talk. So when I asked my parents about it, um, they, they don't really know the answer. They're like, well, you said this. I'm like, that doesn't really hold up. Like, I don't understand why that, you know, why that would do that. Um, and",
            "start": 251.36
        },
        {
            "text": "parents about it, um, they, they don't really know the answer. They're like, well, you said this. I'm like, that doesn't really hold up. Like, I don't understand why that, you know, why that would do that. Um, and I wanted to ask, I think I'd want to ask him if he was happy, right? You know, no part, that was a generation that didn't really, happiness didn't really even factor into their decision-making, right? They hunker down, marry someone, children, have some children, right? Provide. And that, and, and to you, to what you were saying earlier, that has, that came all the way till my generation, our generation. Um, where my, my parents, in order to leave the house, had to be married. So they couldn't leave the house. Like, my grandfather was like, no, you're not leaving this house until you've got a marriage proposal on the table. I don't care how old you are. And I think my, my dad left when he was 21 after college, got married, moved right in my, with my mom. They got married, they were 21 years old, and it was like, pumped out",
            "start": 295.12
        },
        {
            "text": "table. I don't care how old you are. And I think my, my dad left when he was 21 after college, got married, moved right in my, with my mom. They got married, they were 21 years old, and it was like, pumped out kids. And so my grandfather had, my dad is, comes from a family of five. Um, so he's got two, two brothers and two sisters. Um, that's, that's, that's astronomical to me. Like, growing, and they grew up in like a two, like three-bedroom house. Like, you know what I mean? Like, how did you make all this work? You know? And my, my grandfather apparently was an accountant who, who went to school at night for his, to, to get his law degree and then ran a law practice in San Diego. So I was like, what the **** is like, what's, what is all, what's going on here? Like, why San Diego? Why this? Did you have another family on? Like, what's, like, I would not be surprised if there's a whole other batch of Scarpino that look exactly kind of like me that are running around like in San Diego, maybe one day. But, um, but yeah, I mean, I think",
            "start": 337.92
        },
        {
            "text": "like, I would not be surprised if there's a whole other batch of Scarpino that look exactly kind of like me that are running around like in San Diego, maybe one day. But, um, but yeah, I mean, I think probably most likely I would have wanted to know about like, um, about the war and just his experience there, his experience being the Air Force during arguably the, you know, the most important war of in the last like thousand years, you know? Like, what was that like? What was it like knowing that you were a part of a, a giant machine that had to kill, had to kill? Yeah, you know, and that's the thing is like, it's the, that's, it's such a big, that's like, that's what we know about them, right? This gener, the Greatest Generation, right? That they had to do these and make the sacrifices. But to get down to like, yeah, the nitty-gritty of like, what day-to-day life was like and what did you look forward to when you came home, right? Like, I, I, I want to finish everything and just play video games, right? It's like, what were",
            "start": 377.76
        },
        {
            "text": "nitty-gritty of like, what day-to-day life was like and what did you look forward to when you came home, right? Like, I, I, I want to finish everything and just play video games, right? It's like, what were, what was that like for you? And what, how did you, how did you start smoking? And was, you know, all these different ****. He had an office. My grandfather Scarpino had an office, uh, right when you would walk into their, to their, uh, house. To the left was like the, you walk into the entryway and to the right was like the living room. Then was like the, the kitchen and and dining room in there. And then he'd have this little office that was off. And I would always, I was always fascinated by it because it was like a time capsule, right? Like, I never, this was a guy's office that I never knew. And it was, you looked in there and, you know how like grandmothers and when mothers turn into grandmothers, they do the same thing that the grandmothers used to do where they keep everything sort of like, like vacuum locked.",
            "start": 419.08
        },
        {
            "text": "in there and you know how like grandmothers and when mothers turn into grandmothers, they do the same thing that the grandmothers used to do where they keep everything sort of like, like vacuum locked, right? Like your room is the same it used to be back in the day. And I would walk in there and like, case in point, I found a pack of this. I mean, I was like, I was a **** kid that was smoking cigarettes behind parents' back. And you know, you'd find like packs of cigarettes from Air Force One and you're like, what the ****? Like, where did this come from, right? And you know, chances are someone just handed it down, someone had it, whatever, gave it away. And then he eventually got it to my dad and then I eventually smoked him and my dad was not happy about that. They were, they were disgusting because it was like basically like lighting a bale of hay on fire. I just kind of lit that, that was it. Um, I tried, I tried to refill them later, but I was like, I didn't really understand whatever. But, um, awesome. Yeah, it was, it was",
            "start": 454.12
        },
        {
            "text": "like lighting a bale of hay on fire. I just kind of lit that, that was it. Um, I tried, I tried to refill them later, but I was like, I didn't really understand whatever. But, um, awesome. Yeah, it was, it was crazy. And you know, I would go play in there. My grandmother would always have sort of a, an odd reaction to it, right? Because she, I mean, this is a husband she hadn't, hadn't really had in, you know, 15, 20 years. So she would be like, don't break anything, don't touch anything. Like, this is all I have to remember him by. And I was like, I, this is a treasure trove. Like, this is, this is, this is all I have to remember this guy by too, right? And no one will talk to me. And I had, there's like two pictures of the guy that I've ever seen. One was, um, him older and the other was him in his, uh, milit, and his Air Force uniform. The standard sepia toned, standing smile, trying to smile as best as he could, you know, because they didn't smile for, they didn't take pictures a lot back then because I guess the technology took like months. Someone",
            "start": 491.6
        },
        {
            "text": "sepia toned, standing smile, trying to smile as best as he could, you know, because they didn't smile for, they didn't take pictures a lot back then because I guess the technology took like months. Someone looked at him while he did and they just like carved it in snow. But I mean, to your, your point too, and I'll shut up about my grandfather, um, was that he just seemed **** cool. That's the thing is my grandfather seemed really cool. And I only know him as my grandfather. And when you're talking about being a kid, right? I only knew him as my grandfather at the end of his life when he was a sickly old man, you know, after multiple strokes and surgeries and emphysema and all these different things. Those are my memories of him. You know, my mom's memories of him are just like my memories of my mom, right? But even then, it's the same thing where my memories of my mom really start when she's a full grown adult and all, you know what I mean? Like, we were talking about, I think, last show or two shows ago, right? That like, in",
            "start": 534.48
        },
        {
            "text": "the same thing where my memories of my mom really start when she's a full grown adult and all, you know what I mean? Like, we were talking about, I think, last show or two shows ago, right? That like, in terms of my mother right now, I'm 33. So when she was 33, I was three years old, right? And I think about what an idiot I am now to see like, you know, like you, you start, my, I know my mom is an adult, but what she liked there as a, a young mother, as a newlywed, as all these different things. Like, we can talk to them about that. But then to try to, to try to even think about peeling that back for Poppy, that I don't even know how to begin that. I know what's crazy is I don't even know anything about my other two grandfathers. I, I met my grandma, my grandfather, my Grandpa Palini a couple times because I went to Italy. Um, but I don't remember very much. Then my grand, my grandfather Rali, I don't even know what he looks like. It's weird. He could be in San Diego right now. No, he's, they were older. My mother was adopted by",
            "start": 577.2
        },
        {
            "text": "but I don't remember very much. Then my grand, my grandfather Rali, I don't even know what he looks like. It's weird. He could be in San Diego right now. No, he's, they were older. My mother was adopted by her aunt, actually. So actually, technically speaking, one of my grandmothers is my great aunt. Okay. And so when she died, I mean, I was like, I was maybe five or six and she was 85. And so she was very old. Um, she was the one who was, that was, I mean, talking about generation, she was 85 in the '80s. So she was born turn of the century, I guess. Does that math hold up? That works. That's, she was a tough **** man. Like, she, I never saw her smile. I never saw her say anything nice. All I ever saw was the fist coming at my face when I said something stupid. So you saw that fist a lot. A lot. A lot. Yeah, I was say, yeah. Anyway, whoa, whoa, whoa. Hey, uh, well, my dad's dad, I, he died in the '90s, but my dad was kind of estranged from him for a long time, I think, or they just had like a bad, like, I don't really know anything about it.",
            "start": 618.4
        },
        {
            "text": "whoa, whoa, whoa. Hey, uh, well, my dad's dad, I, he died in the '90s, but my dad was kind of estranged from him for a long time, I think, or they just had like a bad, like, I don't really know anything about it. He doesn't really talk about, but they didn't really have a good relationship, so I didn't really know him. And his mom died when he was like 18 or 19, so I never knew her either. Uh, my, uh, on the side of my family, my grandfather died in the late '90s. And, uh, I think I've talked about it before, but he was like the patriarch of the family and it was very sad. And then memory I always talk about is that even though my parents were divorced at the time, I remember my dad hysterically crying that morning when his ex-wife's dad died. You know, that like, how powerful that man was in people's lives. And, and, uh, to me, it was, it was sad because I, I, I knew him and I loved him. I used to, I used to, you know, we used to go there every Sunday for dinner, for Sunday dinner and have, you know, eat gravy and and and, uh, you",
            "start": 666.0
        },
        {
            "text": "me, it was, it was sad because I, I, I knew him and I loved him. I used to, I used to, you know, we used to go there every Sunday for dinner, for Sunday dinner and have, you know, eat gravy and and and, uh, you know, pork chops and whatever, you know, whatever Italian **** they were cooking. And I used to watch like Wheel of Fortune and Jeopardy with him. And, uh, during the week when I was there. And, and, uh, I don't know, we just had like a really good relationship where we used to just lay around. I used to like cuddle with him basically and like watch these shows. And like, that's maybe where my love of like trivia nerdy **** came from because I was so of that stuff. But, but, um, when he died, my grandma kind of went senile and crazy and she died like eight years later, but she had no idea what the **** was going on anymore. And my, my major memory is, is, uh, the house that they bought on Long Island in Albertson, right outside of Mineola, so near the city. Um, they bought it in like '47 or '48 and we sold it when my",
            "start": 709.2
        },
        {
            "text": "on anymore. And my, my major memory is, is, uh, the house that they bought on Long Island in Albertson, right outside of Mineola, so near the city. Um, they bought it in like '47 or '48 and we sold it when my grandma died in like 2004, 2005. And we got, we just all went there and went through it. And I spent days in that place like finding prayer cards from like the '50s and like all this like crazy like, and just went through all of their ****. I'm like, this is kind of feels wrong in a way, but I'm like, I'm totally going through all your **** right now. Like, going through your drawers in your room, like all, like all these boxes of just ****, all this crazy **** in the, in the, in the basement. And, uh, it kind of gave me a little bit of insight into their lives that I never really understood because again, they didn't talk very much. And, you know, I was, I wasn't as, I didn't have the advantage that like, you know, my brother and my sisters had when they were older and they understood them a little bit more.",
            "start": 743.24
        },
        {
            "text": "they didn't talk very much. And, you know, I was, I wasn't as, I didn't have the advantage that like, you know, my brother and my sisters had when they were older and they understood them a little bit more. Like, my brother was an adult, my grandfather died. Like, so it was a little bit different for him. But my grandfather was, uh, you know, uh, he was in the war. He fought in the Pacific. And then, um, you know, he was a fine artist. Um, he owned a salon, like a, like a woman's beauty salon in New York City. Um, and like did hair and stuff like that too. That's awesome. And like, so he used to like cut my hair when I was a kid all the time. And I never really thought about it. I was like, why, like, why is like my grandfather cutting my hair all? Um, but he was like just a good man. And, uh, just like a, a solid like old Italian man. And, uh, yeah, like, I, I wish I could just, I would just be curious like what he would think of this life, like, like Greg was saying. And also, you know, what I could have learned from him if I had just",
            "start": 786.32
        },
        {
            "text": "man. And, uh, yeah, like, I, I wish I could just, I would just be curious like what he would think of this life, like, like Greg was saying. And also, you know, what I could have learned from him if I had just been a little more cognizant. But also if he wanted to talk a little bit more, he wasn't, he was very friendly and his disposition was very forward, but he wasn't, you know, I was like, I didn't, I didn't knew what World War II was when I was in, when I was eight or nine years old. I was into that ****. But I never really thought to ask him about it, right? Um, just imagine the things he could have told you, right? Yeah, like, you know, you and you like want to know like weird kind of like, there's just weird things you want to ask, things that might not even be super appropriate, you know, like, but like things that you want to ask anyway because like these people saw this. And this is the thing about the, the Greatest Generation is that like, they are dying, they're going. Like, we even saw that in Saving Private Ryan.",
            "start": 825.08
        },
        {
            "text": "you want to ask anyway because like these people saw this. And this is the thing about the, the Greatest Generation is that like, they are dying, they're going. Like, we even saw that in Saving Private Ryan in '97, like when that movie came out, which is one of my favorite movies. Um, like where they interview people and like, you see like these people are even then were, they're dying. And the people that stormed Omaha, like your, like your grandfather did. Um, I assume he was at Omaha. I'm sure that's where he was. Um, like it's, it's too bad that I wasn't more cognizant of, it's too bad that he didn't hold on. And the **** frustrating and obnoxious thing about my grandfather's death, as I've said before, is that he had colon cancer. Um, and it was totally preventable and he ignored it for like 10 years and it got too bad and too crazy and then like he died. And it could have totally been cured. And it's like **** infuriating, you know, like, um, that that happened because he was like, the story goes that he was like",
            "start": 860.52
        },
        {
            "text": "too bad and too crazy and then like he died. And it could have totally been cured. And it's like **** infuriating, you know, like, um, that that happened because he was like, the story goes that he was like having abdominal pain, like **** blood and doing all these things and just ignored it. Just like, I'm fine. That's what they did. That's what they did back then. And it's like, Jesus, man, that's why I, the light hurts my eyes. I go to bed, call the doctors. I'll be, that's basically that for me, Mr Town. Yeah, well, my dad had me pretty late in life. So my dad's probably around the same age as your parents, probably give or take five years. Okay. Um, so my grandpa was also in World War II. And, um, he, he was stationed in China, um, right around the time that they dropped the bomb. And so he was preparing to go invade Japan. And if that had not happened, then he almost for sure would have died. Um, and so I, I, there's a lot of stories that kind of came out as he was passing away. How long ago was that? Um, ballpark five, five,",
            "start": 897.04
        },
        {
            "text": "and if that had not happened, then he almost for sure would have died. Um, and so I, I, there's a lot of stories that kind of came out as he was passing away. How long ago was that? Um, ballpark five, five, six years ago. Okay. Okay. Um, he, he like just kind of like never told anyone really much about it. Him or his brother who, um, they were double married. So, so, oh, a dual ceremony. No, so they were, they were married to, so my grandpa and his brother married a pair of sisters. Oh, okay. Okay. So there we have like double cousin. When I first heard about, I was like, is that okay? So I think it holds up. Specifically my, um, my, I don't know what you call that, great uncle, great uncle. Okay. His, my grandpa's brother, he was, he was, um, in the Pacific and fought there and never said a thing about any of it. Um, and then as my grandpa was passing away, he kind of just like let loose. His mind was starting to go and his, he just kind of talked about the storm that he was stuck in for like a month on an, on like a aircraft",
            "start": 944.52
        },
        {
            "text": "as my grandpa was passing away, he kind of just like let loose. His mind was starting to go and his, he just kind of talked about the storm that he was stuck in for like a month on an, on like a aircraft carrier and just how awful it was. Like, everyone was sick and they were stuck and there's nothing they could do in like a horrible, crazy long storm. And so I really just want to ask like, like you said, the, the war is just like super seeing, hearing what that is like from, you know, the front lines, having, having to go do that. Probably, I mean, probably once to at the time as well. Yeah, of course. Specifically with that generation, you know, was very service. Yeah, 100%. But yeah, like I said before, he was very like, you know, he, he met my grandma two weeks later, they were engaged. Yeah. And and then, then he, he went off to the war, came back, they, uh, got married. We recently discovered like a, um, telegram he sent her from what must have been like where they were planning to go on their honeymoon. And it was an",
            "start": 1013.84
        },
        {
            "text": "went off to the war came back they uh got married we recently discovered like a um telegram he sent her from what must have been like where they were planning to go on their honeymoon and it was an adorable little message to someone he barely knew and you know they ended up hating each other like like uh they stick it out though no they they at some point I don't know when I think after my dad's youngest brother left um they got divorced and then some day my dad was calling them and they were calling my dad and then he thought he heard his Mom's voice behind my dad he like is is Mom there and they're like oh yeah we're we're living together again we're we're married again didn't tell any of their kids it happens just they got married again and then later like two years maybe even less than that divorced again so that's that's that's my dad's side of the family and then my mom's side of the family is very very interesting um I don't really know my Grandpa on that side just and kind of",
            "start": 1064.16
        },
        {
            "text": "that divorced again so that's that's that's my dad's side of the family and then my mom's side of the family is very very interesting um I don't really know my Grandpa on that side just and kind of an estranged family member there um my Grandma remarried and uh this hilarious tall skinny Jewish man who who's who is friends with Nelly in St. Louis, St. Louis yeah um he he like played his poker with him and went to his like birthday and like he apparently fun fact yeah Nelly has a tradition where everyone pins dollars to him for his birthday and my my Grandpa good tradition pinned an Applebee's gift card to him and he said it was his favorite present that's awesome that's very cool it's the gift that keeps on giving so I I don't really know much about my actual Grandpa sure and um he specifically like went into like Jehovah's Witness and I I kind of just want to know his history 'cause I really don't know anything about it I know that he had like some less than legitimate businesses and stuff",
            "start": 1117.4
        },
        {
            "text": "like went into like Jehovah's Witness and I I kind of just want to know his history 'cause I really don't know anything about it I know that he had like some less than legitimate businesses and stuff um so I I I just want to know how he got to each like step in his life I know like a couple just did different Landmark moments that's always the thing right is like yeah the nitty-gritty of all this like I know like you Grandma Kennedy the story was always she played she played cards without Capone ones and it's like that's awesome how does that how did that happen and it's like oh you know this that that the other and then it just happened like what like no like how does that what do you mean in the my the story where I'm like man me and Poppy would have gotten along right Poppy The Story Goes that uh there's one time they were this in like you know my Mom is a kid at this point or whatever but one day Poppy just came home with a giant box of meat and they were like where did all this meat",
            "start": 1175.0
        },
        {
            "text": "that uh there's one time they were this in like you know my Mom is a kid at this point or whatever but one day Poppy just came home with a giant box of meat and they were like where did all this meat come from and he's like I was driving home and all these cars were slowing down and going around this box in the road and I got out and it was this box of meat that fell off a refrigeration truck so he called and had like this neighborhood barbecue like all these people came over literally he's he was serious it literally fell off the truck literally fell off a truck I mean now again though that's the story that's been translated to me through Mom like did it really who knows maybe Poppy killed somebody for a box of meat and again would respect that hey why not yeah I my Mom has those stories too of of 'cause she moved from Italy over to Chicago and then I I guess they had some family there and stuff and so she would get free codes and **** that they quote unquote fell off trucks and for",
            "start": 1221.52
        },
        {
            "text": "too of of 'cause she moved from Italy over to Chicago and then I I guess they had some family there and stuff and so she would get free codes and **** that they quote unquote fell off trucks and for the longest time she actually legitimately thought they fell off trucks but guess they don't she had an Uncle Al that I guess ran ran a um a furniture store on the west side and I guess that was just a bad no one ran businesses there but he was really rich so we don't know why booming Furniture business we don't know why well cheers to all the grandparents if your grandparents are still out there go talk to them and ask the questions we can't do it for your folks I guess too even your your sister what does she do why does she why did she get that tattoo a useless **** bag Colin Jesus Christ I'm just saying I don't like her sister Colin what's your topic I want to just go quick quickly over uh our astrological signs and see what it says about us I'm sure bathroom's right out there it's",
            "start": 1261.4
        },
        {
            "text": "I'm just saying I don't like her sister Colin what's your topic I want to just go quick quickly over uh our astrological signs and see what it says about us I'm sure bathroom's right out there it's that door right there I'm going to pee also after you okay then",
            "start": 1296.92
        }
    ]
}