{
    "id": 1807,
    "video_id": "jzTo4PF-W2E",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "Kingdom Hearts 2.8 E3 2016 Trailer - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nTim and Nick breakdown the Kingdom Hearts 2.8 E3 2016 Trailer!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1465779851,
    "duration": 684,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening, Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up everybody? Welcome to Kinda Funny Games E3 2016 pre-E3 show coverage, but by the time you watch this, it'll probably be dead in the heat of E3. I'm Nick Scarpino, it's your boy Tim Gettys. Tim, there have been a lot of exciting things already happened, but what are we looking forward to now? What are we looking at now? Right now, we at Kingdom Hearts HD Remix 2.8. Now in case you're not Hearts HD Remix 2.8. Okay, good. I'm glad, 'cause 2.7 rubbish. Well, it's this game is actually titled, um, Kingdom Hearts HD 2.8 Final Chapter Prologue. So just in case you were little a little bit confused, I wanted to make sure that you were good. So what this is, Nick, obviously this is this is a a PlayStation 4 game, okay? Right. Kingdom Hearts HD Remix 1.5 came out on PS3, which included Kingdom Hearts 1 and um, Chain of Memories. Obviously, yeah, it's",
            "start": 0.16
        },
        {
            "text": "what this is, Nick, obviously this is this is a a PlayStation 4 game, okay? Right. Kingdom Hearts HD Remix 1.5 came out on PS3, which included Kingdom Hearts 1 and um, Chain of Memories. Obviously, yeah, it's Chain of Memories Classic, yes. And uh, that was the GBA game that they eventually then put onto the PlayStation, right? Um, then there was another one, I think was called Re:coded. Then we had Kingdom Hearts HD Remix 2.5, which was Kingdom Hearts Birth by Sleep and uh, 358/2 Days, okay? Or something. That was a DS game. Don't don't really remember what happened there. All right, so now since we're on our way from Kingdom Hearts 3 and everybody's so excited for Kingdom Hearts 3, they're like, you know what, let's make them wait a little bit longer. We can add a 2.8 in there. So we're getting 2.8. So what 2.8 is, yeah, what is 2.8? Uh, to educate you here a bit. So right here we're seeing uh, this is my boy Riku, okay? Riku, not Rikku. Rikku would be the girl from Final Fantasy X. I don't want you to get",
            "start": 55.64
        },
        {
            "text": "2.8. So what 2.8 is, yeah, what is 2.8? Uh, to educate you here a bit. So right here we're seeing uh, this is my boy Riku, okay? Riku, not Rikku. Rikku would be the girl from Final Fantasy X. I don't want you to get confused. Understand? Thank you, 'cause that was going to be my follow-up question. Mhm. So so here we got Kingdom Hearts HD Dream Drop Distance. Originally this came out on the 3DS a couple years back, okay? And it was called Kingdom Hearts 3D: Dream Drop Distance. Got it. It's the 3DS. H, got three dimensions. Dream Drop Distance. Got it. Yeah. All right, so chronologically this is the furthest along the timeline we've been so far, okay? This is past Kingdom Hearts. It's prepping you for Kingdom Hearts 3, but in in a very ancillary way, as Kingdom Hearts has been for the last decade. Mhm. All right, going forward a bit, you know, we just seen some more gameplay from it and that's cool and cute and it's looking good. It's looking HD for that's a 3DS game up-res. That's pretty impressive. Wow, that's really that's actually nice",
            "start": 104.76
        },
        {
            "text": "know we just seen some more gameplay from it and that's cool and cute and it's looking good. It's looking HD for that's a 3DS game up-res. That's pretty impressive. Wow, that's really that's actually nice looking. Yes. So here we got Riku and Sora doing some. So these are all games you've already played through? I have played through most of them. I actually did not play through Dream Drop Distance. Are you going to play through 3D? Nah, I think I'm okay. I'm read some summaries. The problem with with Kingdom Hearts is it's it's so vast at this point. There's so much going on that I'm super confused and it's like that's not really their fault, except it's entirely their um, I'm not sure anyone knows exactly what's going on in this trailer, but I'm happy that you know, hopefully somebody somebody does. So here Kingdom Hearts Birth by Sleep, okay, is the earliest in the the timeline so far that of these games that have been released. That was a PlayStation Portable game, PSP, back in the day, right? This came out",
            "start": 150.96
        },
        {
            "text": "Kingdom Hearts Birth by Sleep, okay, is the earliest in the the timeline so far that of these games that have been released. That was a PlayStation Portable game, PSP, back in the day, right? This came out after Kingdom Hearts, but then we get the nice little prequel action, right? It's about the Keyblade War. Mhm. Okay. Mhm. Yeah. So here all happen when people sleep, right? Here we have what? No, okay, no. When they're when they're born, they go to war uh, and they go to sleep. It's very there's no sleep. Oh, the birth. I get what you're saying. I don't understand what's happening with not really not really sure. But so to clear things up for you, here we got the 0.2, okay? I don't know if you missed that. Oh, no, I saw that. I thought that was a date. I thought it was the date that it comes out. No, no, no, no, no. Birth by Birth by Sleep PlayStation Portable game. This is a kind of is the prologue. It's the Final Chapter Prologue, as they say in the title of the HD Remix 2.8 um, final chapter um, the and this",
            "start": 186.64
        },
        {
            "text": "no, Birth by Sleep PlayStation Portable game. This is a kind of is the prologue. It's the Final Chapter Prologue, as they say in the title of the HD Remix 2.8 um, final chapter. Um, the and this math adds up if you think about it, right? 'Cause 0.2 plus 2.8 is three. Yes, that's awesome. Exactly. So we're going to get to three. So what this is is the story of Aqua from Birth by Sleep post-Birth by Sleep spoilers. I don't want to get too far into it, but she gets trapped in this place, right? She's here forever. She has to live her life out and stuff. What's interesting about this is this is it's kind of like when Metal Gear Solid gave us Ground Zeroes before The Phantom Pain. Sure. Okay, thank you. Um, or it's like a nice it's not a demo, but it's kind of just like a preview of what the game. Yeah, okay. Get your appetite a little bit. Or with Final Fantasy XV Episode Duscae. Mhm. Obviously, same thing there where it's just giving you a taste. So this is what Kingdom Hearts 3 is going to kind of look and play like.",
            "start": 227.96
        },
        {
            "text": "appetite a little bit. Or with Final Fantasy XV Episode Duscae. Mhm. Obviously, same thing there where it's just giving you a taste. So this is what Kingdom Hearts 3 is going to kind of look and play like. So that's exciting. Oh, it looks great. Yeah. Um, and so she's here. I'm a little confused with what's going on right here because this is Aqua, but in the background coming up, you see my boy Terra. I don't know how he's in there. How's he in this dream? This is this is so crazy, so crazy. So what do we on to? What is this? This is the final piece of 2.8. This is the kind of it, my understanding, it's a CG movie, okay? And I'm going to need to to look up some information here because all right, so recently there there was a mobile game in Japan in the foreign lands that uh, kind of dealt with the furthest backstory of Kingdom Hearts. So this is even pre-Birth by Sleep, pre-Keyblade War. This is before all the all the went down and uh, they recently ported that to American mobile phones calling in Kingdom Hearts",
            "start": 273.88
        },
        {
            "text": "of Kingdom Hearts. So this is even pre-Birth by Sleep, pre-Keyblade War. This is before all the all the went down and uh, they recently ported that to American mobile phones calling in Kingdom Hearts Unchained χ. Well, looks like an X, but it's not an X. It's actually the Greek letter Chi, okay? Yeah. So it's it's uh, you can kind of see it here. That's a this X is not an X. It's χ. It's definitely χ. So this is χ Back Cover, which is the the kind of the story of like the the five factions and the Foretellers. Mhm. Yeah. And um, it's uh, let me go through here. I'm trying to might be χ, by the way. Is it χ? Yeah, I think I think X, C H I I. Yeah, I think that's if it's an X, I think it's I think it's χ. Kevin, can we get a check? See what Greek I remember I had a K. It might be K. Alpha. Was it this this little X? All right, χ Back Cover. So anyway, it's the to prevent the destruction of all the worlds, five of the Grandmasters' apprentices who are later given the title Foretellers created unions to fight",
            "start": 319.4
        },
        {
            "text": "right, χ Back Cover. So anyway, it's the to prevent the destruction of all the worlds, five of the Grandmasters' apprentices who are later given the title Foretellers created unions to fight the oncoming Darkness. The unions obviously, Anguis, Leopardus, Unicornis, Ursus, and Vulpes. These are the things that you play in the in the Unchained χ. What do you call it? χ. χ Unchained χ. Quote me on that, I could be wrong. Fun browser or mobile games. I've been liking it a lot. Anyways, so all of this is setting up for Kingdom Hearts 3. Mhm. Um, I'm a little off-put by this section in particular. Like I'm not sure that I was really questioning the the backstory of Kingdom Hearts with like pre-Disney and all that stuff. I'm like, there's a distinct lack of Mickey here. I'm sure he'll get involved at some point. Yeah, I mean, maybe you don't know. Maybe it turns out like it's like Wicked, right? Where they go back and he wasn't the bad guy everyone thought he was Mickey. Yeah, he was just, you know, misunderstood.",
            "start": 372.88
        },
        {
            "text": "Yeah, I mean, maybe you don't know. Maybe it turns out like it's like Wicked, right? Where they go back and he wasn't the bad guy everyone thought he was Mickey. Yeah, he was just, you know, misunderstood. You're right, you're right. So so yeah, we're going through. We see all this stuff. It's who's that guy? I I don't know. Okay, but we're see of all these people or no, no, these are all new. These are new characters, new characters because there this is like back back back back in time. So they're prepping for the Keyblade War. Got it. Don't remember why. Not sure it was ever made clear. I'm sure. Do you think do they ever take the masks off or is that just kind of like a thing that is that the masks are new? Okay. The masks are new. So we we'll have to you're you're doubting right now, but it might if it has the magic, you got to go with it. Now the most important part for you to remember here for the title though, Nick, so it's Kingdom Hearts HD 2.8 Final Chapter Prologue. But the two is a Roman numeral. Roman numeral II. I",
            "start": 424.52
        },
        {
            "text": "you got to go with it. Now the most important part for you to remember here for the title though, Nick, so it's Kingdom Hearts HD 2.8 Final Chapter Prologue. But the two is a Roman numeral. Roman numeral II. I saw that point point. The the digit eight. Is it a digit? Kevin, can I get a ruling on this? That's the digit eight. Roman numeral me. It's the number eight. Yeah, that would be Arabic. What you call that? Sure. Yeah, that's an eight or an infinite on it side. No, but like what what is that called if this is a Roman numeral, what's this? What's what's it's the Standard Arabic. Yeah, we got so we got an Arabic eight. So that's cool. Then the most exciting part of this whole trailer, all jokes aside, bam, December 2016 worldwide. So we're getting this this year. So we're going to get a taste of what Kingdom Hearts 3 might actually play like for me via Birth by Sleep. What is new in this? What is new in this is the is the the movie, the the χ Back Cover movie and um, the The Birth by Sleep 0.2, which sort of",
            "start": 467.76
        },
        {
            "text": "play like for me via Birth by Sleep. What is new in this? What is new in this is the is the the movie, the the χ Back Cover movie and um, the The Birth by Sleep 0.2, which sort of the prequel, the sort of like a little bit of a taste of what we're going to maybe element of Kingdom Hearts 3. Great. Mhm. So and then the rest of it just for people who haven't played or remastered play 3DS version. 3DS and PSP. Yes, that sounds like a lot. It is. Sounds like for someone like me who might be wanting to jump into Kingdom Hearts, is this a good entry point for me? Absolutely not. This I think I'm just going to do it. I think I'm just going to do it. This is probably the worst the worst jump. Is it worse than when I decided just to play the last uh, Metal Gear Solid instead of play any? I think that makes a lot more sense than this. So what's weird about this is like I was joking earlier, the Kingdom Hearts HD 1.5 Remix or Remix 1.5, whatever, and 2.5. Those make a little bit more sense to play and",
            "start": 508.56
        },
        {
            "text": "makes a lot more sense than this. So what's weird about this is like I was joking earlier, the Kingdom Hearts HD 1.5 Remix or Remix 1.5, whatever, and 2.5. Those make a little bit more sense to play and those are on PS3. This is on PS4. So like Square takes so long even to re-release games that now on a different console generation. So it's like I totally expected like the rumors before 2.8 were announced were that it was going to be called 2.9 and it was going to include everything and that would have been exciting. Yeah, that would have been real exciting. But here they're like, okay, the one thing we don't have is the 3DS game. Let's get that in there and just add a bunch of new. So I don't know. I mean, theoretically speaking, they could just keep adding decimal points. They could it could be 2.8.1 2.8. They work all the way up to I mean, it's infinite, right? Kevin, infinite. But so again, December 2016. I'm excited that we're getting some stuff soon, but even more exciting is a little little thingy",
            "start": 552.24
        },
        {
            "text": "2.8. They work all the way up to I mean, it's infinite, right? Kevin, infinite. But so again, December 2016. I'm excited that we're getting some stuff soon, but even more exciting is a little little thingy thingy thing right here at the end. Kingdom Hearts 3 upcoming announcements this winter. Winter is coming. It's not that far away. I'm pretty excited about that. I well, I'm excited for you. I can't say that I'm specifically jumping out of my seat, but I like when you're happy. Big Hero 6 World, Nick. We're getting Tangled World. I don't know what else is confirmed, but lock lock me in a dark room and uh, wake me when it's winter time. We're probably getting Frozen. Speaking of winter, we might get Star Wars. We might get Marvel. It's very true. It is all packed into Kingdom Hearts 2.8.1. No, this is three is the Big Daddy. Okay. Oh, I see the Wolverine Claw is the three. Yeah, no, it's it's definitely finally going to happen. Well, eventually. Thank you so much for all of your incredibly relevant and pertinent information on",
            "start": 590.76
        },
        {
            "text": "okay. Oh, I see the Wolverine Claw is the three. Yeah, no, it's it's definitely finally going to happen. Well, eventually. Thank you so much for all of your incredibly relevant and pertinent information on Kingdom Hearts 2.8 HD Final Chapter Prologue. Uh, for those of you out there, please leave a comment, like this video, share it with your friends and let us know what you think of Kingdom Hearts. If it's as confusing to you as it is to me, which I'm guessing if you're watching this video and you willfully clicked on this, it's not. You probably know exactly what you're talking about. I have it all down. I know Tim got it down. You got it down. I have no idea what's going on. But uh, if you want more of this shenanigans, stick around Kinda Funny Games all E3 2016. We'll be here all week. Subscribe. Click somewhere. It's probably here. No, it's here.",
            "start": 637.28
        }
    ]
}