{
    "id": 1882,
    "video_id": "LJ_S2JR7j0E",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "The Future of Marvel Video Games - Kinda Funny Gamescast Ep. 74 (Pt. 4)",
    "description": "How excited are we for the start of the Marvel Video Game Universe?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467291602,
    "duration": 840,
    "transcript_chunks": [
        {
            "text": "All right, ladies and gentlemen, as always, this final topic brought to you by Patreon. So shout out to you, Steven Enzler, you're the Patreon producer of this month and pretty much every month forever. He continues to sit there, he's awesome, and I love you and support you as I look into Greg's eyes. I love look looking at my eyes, but feel Colin and smell Kevin. No, I don't want to smell Kevin. Think about Nick. I please not. I'm thinking about Nick. I smell that. Mmm, it's debatable. No, it's not. It's it's not debatable. Oh, I found out yesterday his balls are really hot. You got them hot balls. Yeah, I came in, I came the thing in, he of course shoves everything as close as he came to the door. So then I was like, I'll give him, this is what he wants clearly. So I sat on him and then I rubbed my butt around on him and I was like, oh man, your balls are hot. Damn, that's fucking erotic. At Starbucks today and he got one of those chorizo sandwiches, which are good, but I can't stand them and I've realized today why is",
            "start": 0.31
        },
        {
            "text": "him and I was like, oh man, your balls are hot. Damn, that's fucking erotic. At Starbucks today and he got one of those chorizo sandwiches, which are good, but I can't stand them and I've realized today why is because the smell, the smell smells like Kevin and I don't like smells like chorizo. And then he's no, the the Starbucks chorizo, I don't know that it's real. Not to smell Kevin, but he smelled my armpit like, oh, it smells like sweat. And I'm like, oh, Kevin smells like sweat. I don't that's a lie. I get it. He doesn't smell like B.O. There's a it's not like this, you smell it and you're like, damn, you smell good. I think let's play live. Maybe don't believe it. All right, this topic, all right, of course, brought to you by Patreon. All the Q&A, all that stuff. This one's brought to you by Prometheus and Bob over the KindaFunny.com forums. If you have a topic for us, go to games, nope, KindaFunny.com/GamescastTopic. Leave your questions just like my boy Prometheus and Bob did. It's a long one, but a good one. Wait, hold on. Kevin's like",
            "start": 45.28
        },
        {
            "text": "forums if you have a topic for us, go to games, nope, KindaFunny.com/GamescastTopic. Leave your questions just like my boy Prometheus and Bob did. It's a long one, but a good one. Wait, hold on. Kevin's like frantically pointing around and grabbing his phone frustrated. Oh, and the Patreon people, thank you very much. Didn't know we were doing that today, but cool. You're you're awesome. You make things happen. You get Kevin eating them chorizo sandwiches that I love smelling so much. Since we're putting a bunch of screen, we're doing a bunch of stuff right here the front. Kevin, put frog face on me for the next 5 seconds. Feel like I'm in a bad dream. All right, Prometheus and Bob asked, is Marvel about to take over the gaming world? Last week, Polygon spoke to Marvel Games Vice President Jay Ong and asked him if Marvel vs. Capcom fans would finally get some relief from his team either in the form of a new game or a balance patch. His response was vague but optimistic. There's nothing we can say at this time. Let's",
            "start": 91.48
        },
        {
            "text": "vs. Capcom fans would finally get some relief from his team either in the form of a new game or a balance patch. His response was vague but optimistic. There's nothing we can say at this time. Let's just say that we hear that a lot. We love our fans and we certainly want to please them. Beyond that, we can't say anything at this time, but who knows what the future holds. Marvel Games has a lot of things in the works, quite a few in the console space that are unannounced. What has been announced is a game to the Marvel Universe from Telltale Games and a new Spider-Man from Insomniac Games or PlayStation 4. What do you guys think? The answer is yes. This goes back to I've said it a lot this past week, but to bring you all up to speed, this goes back to you and I going to see Age of Ultron of that screening and Bill Rosemann coming out and being like, what's up? I'm in charge of Marvel Games. Here's the two other guys who are doing this. We are out to make awesome games. We have not done that in a long time. We",
            "start": 138.76
        },
        {
            "text": "Bill Rosemann coming out and being like, what's up? I'm in charge of Marvel Games. Here's the two other guys who are doing this. We are out to make awesome games. We have not done that in a long time. We are aware of our shortcoming. I'm paraphrasing obviously. We are out to fix this and make Marvel a force to be reckoned with in the video game industry the way it is right now in movies, as it is on Netflix, as it is on TV. And the first that was when they announced The Telltale Game where I was like, oh my God, that's awesome. And now they're announcing this Insomniac game and I think it's interesting because Insomniac for some reason to me means more than The Telltale one, but they're the exact same level of let's take our properties that we care about and give them to the people that make the best kind of games for those things. And this is it didn't I didn't understand the connection until Disney Infinity died and they're like, we're getting out of this, we're not going to do this anymore. And then it",
            "start": 175.92
        },
        {
            "text": "of games for those things. And this is it didn't I didn't understand the connection until Disney Infinity died and they're like, we're getting out of this, we're not going to do this anymore. And then it was like it clicked of like, oh, Marvel was just ahead of that in terms of like, okay, cool, we're not going to just go to Activision and say, here's a multi-year deal if you get a game out every nine months. All right, great, cool. And then Beenox is making Spider-Man for Spider-Man for Spider-Man. Start really good and go to garbage. Yeah, exactly. And so yeah, I think we're just to the tipping point right now where you're about to see, and when I say about to see, I mean announcements, you're about to see of all this start to pay off. What they so far, we know Spider-Man and that's it really, right? We know that something's happening at Telltale. We just talked about the last topic. No idea what it is, but you figure if that's happening, what are the be what think about the other best, you know, developers that are",
            "start": 215.92
        },
        {
            "text": "happening at Telltale. We just talked about the last topic. No idea what it is, but you figure if that's happening, what are the be what think about the other best, you know, developers that are making third person action games, first person, whatever. And what could that apply to a Marvel property? Where does that go? Like imagine an Iron Man game that's good. Yeah, there's so much potential there. The flight and all that stuff. That's awesome. Yeah, I'm excited. I'm excited for all this. I do kind of simultaneously worry and I'm super excited for a world where there's a shit ton of Star Wars games and a shit ton of superhero games where all of the top developers are just making these games. But it's like, whatever, as long as they're good. And that's the thing, as long if if they take it to the way Star Wars has where it's like, all right, cool, we have this property. We're going to give it to a bunch of developers. We want them to be great. Like, I mean, think about like, I know it's a long shot and I can't",
            "start": 251.2
        },
        {
            "text": "Wars has where it's like, all right, cool, we have this property. We're going to give it to a bunch of developers. We want them to be great. Like, I mean, think about like, I know it's a long shot and I can't imagine would have happened, but you know, like again, Rocksteady isn't owned by WB. So like, what if, oh man, what if there's a conversation going on over there of them taking on Iron Man or some other a Daredevil game, whatever. That'd be insane. And that would be a game immediately that everybody's like, yep, on board with a thousand percent. Yeah. What about what do you think, Colin? I know other than I think that the proper man, the the proper management of expectations and with games with Rocksteady and DC showed and Warner Bros. showed that you can get great games that aren't tethered to movies specifically and people still care about them. I think Marvel runs way more of a risk in the movie in every realm of oversaturating. And so, um, like I think you have to be very careful with the things you choose to do and",
            "start": 291.12
        },
        {
            "text": "still care about them. I think Marvel runs way more of a risk in the movie in every realm of oversaturating. And so, um, like I think you have to be very careful with the things you choose to do and the developers you choose to do, especially because the gestation period of games is way longer, um, than it is with a TV show or with even with a movie. So, um, so you have to just make sure you're setting the seas properly in a way that makes the most sense. But I think that you'll see more from them, um, in the AAA space from developers that you know. And I think that's a smart thing to do. I would love to see a games universe, a Marvel Games Universe. It's not tied to the movies or the comics or whatever, but the Spider-Man game is related to The Telltale Games is related to whatever else we got out there. Well, see, that's what's interesting from the the previous topic we were talking about, right? And the fact that like we're talking about, yeah, the gestation period is so long, right? Telltale can move quicker.",
            "start": 330.16
        },
        {
            "text": "Well, see, that's what's interesting from the the previous topic we were talking about, right? And the fact that like we're talking about, yeah, the gestation period is so long, right? Telltale can move quicker. Does that mean they're working on something different than what uh Insomniac's working on with Spider-Man? Exciting times. Go to the best people, give them the best stuff. Rondine Baron says, I had bought Wolfenstein: The New Order at launch and quickly grew bored of it. Sorry, it's all inverse. Uh, I was very disappointed. Recently, I decided to pick it up again and realized I had just needed to get through the awful beginning to experience one of 2014's best games. My question is, have you ever been unhappy with the game but then loved it after going back years later? Years. I don't know if it's ever been. I I remember the best example, and it's not even a great example, is I played a whole bunch of Red Dead and then got to Mexico. I was like, Mexico's fucking boring and left. And then I remember and",
            "start": 366.76
        },
        {
            "text": "been I I remember the best example, and it's not even a great example, is I played a whole bunch of Red Dead and then got to Mexico. I was like, Mexico's fucking boring and left. And then I remember and the usually when that happens, especially nowadays, if I leave a game, I'm never coming back, even if I have the best intentions of coming back. And I did come back to Red Dead and I did get through it and then it got awesome again. I thought personally, Final Fantasy VI took a lot for me. Yeah, I remember I started it and it was, you know, I played X first and then I went back to VII and then I played VI. And for some reason, I played first couple hours and I was just like, not for me. And then like years later, went back and now it's one of my favorites. Uh, Metroid Prime was similar too where I've started that game probably six times before I actually went through and beat it. All excellent game. Yeah, I don't know. I can't think of anything off the top of my head because I move so quickly that I rarely go",
            "start": 405.12
        },
        {
            "text": "game probably six times before I actually went through and beat it. All excellent game. Yeah, I don't know. I can't think of anything off the top of my head because I move so quickly that I rarely go back. Um, the last game I remember trying to go back to was Final Fantasy X and it didn't work out so well. So it's not quite the story he's talking about, but I told you, you just got to get through that intro in Wolfenstein and it's and then you're and then you're golden. SSJ Davey says, hey Tim and the coolest dudes in video games. When PlayStation All-Stars were announced, everyone hated on it for being a Smash Bros. clone, even though it didn't play like Smash at all. My question is simple. Why don't Sony just rip off Smash property and say, fuck it to the haters? Crash Team Racing did it to Mario Kart and dare I say Crash Team Racing is better. So why don't just coach Smash with PlayStation characters and let the great gameplay of Smash mix with PlayStation characters? That's what I'm saying. Too late. No.",
            "start": 442.84
        },
        {
            "text": "dare I say Crash Team Racing is better. So why don't just coach Smash with PlayStation characters and let the great gameplay of Smash mix with PlayStation characters? That's what I'm saying. Too late. No, no, no. The ship's out of the port now. But back in the day, I mean, then it was earlier in the first half. We were talking about Mighty No. 9. It's like that's the problem is like, it's Smash, but it's not Smash. I wanted to like PS Battle Royale more than anybody. Great. Give me more Smash. And then you play it and you're like, this isn't it. It's not even almost there. It's just like pretending to be almost there. I was like, damn, man. And there's no Crash in that. Come on. Step your goddamn game up. Now it would happen in 2016. Crash would be there. You'd be hanging out and everybody'd be happy about it. And you're right. Crash Team Racing is better than Mario Kart. We fucking said it. Damn it is. Double Dash. Oh, it's better than Double Dash. Absolutely. Chuck says, hey guys, I'm a big user of my local library. It's",
            "start": 479.56
        },
        {
            "text": "right, Crash Team Racing is better than Mario Kart. We fucking said it. Damn it is. Double Dash. Oh, it's better than Double Dash. Absolutely. Chuck says, hey guys, I'm a big user of my local library. It's how I read all The Walking Dead Saga and Invincible. While searching for my next read, I came across Call of Duty: Black Ops III. I put a hold on it and a week or two later it was ready for pickup. I have now put Quantum Break on hold as well. As someone who creates art, I'm a performer at The Second City. I know what it's like to not always get paid for what you create. I feel a bit conflicted. Is it a dick move to consume someone's work without paying for it? Thanks and I appreciate your hard work. Well, he's doing it the right way. I mean, it's a library. It's not like he's pirating other the games. You figure there's a barrier to entry for that. He has to put it on hold. He has to wait. The library only has one copy of Black Ops or something, one copy of Quantum Break. There's a difference there in terms of",
            "start": 514.92
        },
        {
            "text": "there's a barrier to entry for that. He has to put it on hold. He has to wait. The library only has one copy of Black Ops or something, one copy of Quantum Break. There's a difference there in terms of like somebody who goes up and like the whole entitlement, well, I bought too many games this month. I can't afford another one, but I can go just download this game illegally and play it forever and be done with it. Uh, I mean, I think when he's not in the financial situation he is now, you pay it forward and you buy more stuff, right? That's what we always talk about where it's like, yeah, 90% of the games we get are free. So like when I do see something that I want and I we're not getting it early, I'll go buy it. When I do when I play a game and I'm not even sure if I'll ever get to what I want in the season pass, but I've enjoyed the game like The Witcher. I'll buy the season pass out of my own pocket. You like, it's my way I feel of contributing back to it, the system that we're in. Yeah, that's my thing.",
            "start": 553.2
        },
        {
            "text": "pass, but I've enjoyed the game like The Witcher. I'll buy the season pass out of my own pocket. You like, it's my way I feel of contributing back to it, the system that we're in. Yeah, that's my thing with physical games. It's like usually we'll get the code or whatever, but I'm like, I want to buy this and I want the physical one. So I get that. I think it's, you know, it's obviously money is very important, but when these people that are making art want you to enjoy the art, I think first and foremost, at least a lot of them, depending on who it is. But I mean, I think we're a perfect example, right? Like I wouldn't call what we do art, but we are creating something and we put everything out for free, you know, in some way, shape or form eventually. And I think it's like, if you want to pay, pay, but otherwise just enjoy and spread the word. I think that there definitely is a value in liking something and telling people you like it and going from there. You even writing in talking about this is a good way to do",
            "start": 588.6
        },
        {
            "text": "enjoy and spread the word. I think that there definitely is a value in liking something and telling people you like it and going from there. You even writing in talking about this is a good way to do that, you know, kind of spread it in your enjoyment. The analog to him taking games out of the library is taking books out of the library, which has been happening forever where you could go and buy that book and you know, great, you get it money do this. They bank more books, more second edition, da da da. I think it's in the same field where if we're if the library is meant to house works of art, you know, pieces of Pop Culture, whatever, then this is fine. Tom Rosati says, Tom Rosati, hey guys, first time posting. Just want to hear your thoughts on talks of the Vivendi takeover of Ubisoft. Do you feel it could hurt Ubisoft or help them? As much flack as Ubisoft gets, they make some really great games and allow for their smaller studios to create games like Valiant Hearts and Grow Home. Yves Guillemot seems to be a very",
            "start": 624.68
        },
        {
            "text": "Ubisoft or help them? As much flack as Ubisoft gets, they make some really great games and allow for their smaller studios to create games like Valiant Hearts and Grow Home. Yves Guillemot seems to be a very passionate CEO and losing him seems like it would hurt the company as well. Also, that new Ghost Recon looks hella fun. Kinda Funny. Yeah, you risk whenever you go public, you risk hostile takeovers. So that's just inherent. It doesn't often happen, but does happen. And if they're taken over by another company, things are obviously going to change for them. Um, I think you'll just have to pay attention to how things change at Gameloft since that has already been taken over by Vivendi. Um, you also have to remember that Vivendi was in this space before with Activision, um, and Blizzard, right? And in 2011 01, and they didn't didn't seem to pan out too well for them. So, um, I don't know that they're partners that Ubisoft wants. Clearly, they don't want them, um, but they're going to probably get",
            "start": 666.92
        },
        {
            "text": "and in 2011 01, and they didn't didn't seem to pan out too well for them. So, um, I don't know that they're partners that Ubisoft wants. Clearly, they don't want them, um, but they're going to probably get them. So, um, it's fascinating to watch. I do think that it'll change what Ubisoft is because because there'll be new people at the helm. You it'll be what is the most important thing. I don't think the games that are on the slate now you have to worry about, but you do have to worry about leadership change over, people leaving, being forced out. What do you think it means for Beyond Good & Evil 2? I I hope somebody walks in like, no, nobody wants this. Final question comes from MC Biscuits 8675. Hey guys, what's your opinion on the majority of PlayStation's big exclusives being third person action games? The Uncharted series and The Last of Us are amazing and very successful, but now most of their IP seems to be very similar. Days Gone, uh, you know, Horizon, blah, blah, blah. My favorite type of game, so",
            "start": 701.12
        },
        {
            "text": "games. The Uncharted series and The Last of Us are amazing and very successful, but now most of their IP seems to be very similar. Days Gone, uh, you know, Horizon, blah, blah, blah. My favorite type of game, so I'm all for it. Yeah, it is. It is weird. But like, what else are we going to have? Like the only the perspective, the valid perspective in these shooty shooty boom boom kind of games is shooty shooty boom boom games is first person shooters. And they do those too with Killzone, although we haven't gotten one recently. I think that's that's just the way a lot of games are played these days. So they're not all the same. Like Days Gone and Horizon are open world role playing games. Uh, God of War is a more linear, tighter action game. Um, The Last Guardian is not a third, you know, person become is not going to give you the action experience. So I think that like you just have to kind of get a little deeper into the genetics of the games as opposed to just looking at them aesthetically. Yeah, they're all third",
            "start": 742.96
        },
        {
            "text": "give you the action experience. So I think that like you just have to kind of get a little deeper into the genetics of the games as opposed to just looking at them aesthetically. Yeah, they're all third person. I mean, it doesn't mean anything. You're going to see second party partnerships like everything that happens with Housemarque. Bring you the arcade titles that are side scrollers or you know, whatever. 2.5D Matterfall. Yeah, yep. It'll be there. Don't worry. There you go. And Paragon is there right now in beta access. No one tell anything about the game though. This has been the first ever episode 74, the Kinda Funny Gamescast. Thank you very much for joining us. We will see you next week. This has been fun. Like I have never seen any of these characters. You got Jax over here with his red arms, scuba man. This just looks like this looks like the Overwatch gorilla, but in a red outfit. Yeah, it kind of does look like Winston. I'm a nerd now. Deal with it. Greg, hit me up on PSN at Tim Gettys.",
            "start": 783.44
        }
    ]
}