{
    "id": 1864,
    "video_id": "LqmXqI6SNU8",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Geoff Contes"
    ],
    "title": "Dead Rising 4 E3 2016 FAQ - The Kinda Funny Gamescast",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nGreg sits with Geoff Conte and talks about Dead Rising 4\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1466190001,
    "duration": 773,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a Kinda Funny Gamescast E3 2016 special. I'm one of your host, Greg Miller, and as I live and breathe, Geoff Conte from Dead Rising 4. How are you? I'm good. How are you? Good, good. Uh, I'm going to move the mic like this 'cause you got to be, you don't be afraid of it. You got to talk into it. Like if you're going to move, if you want to address the camera, you got to do this. You want to address me, you do this. You know, you're right. Perfect. Right now, perfect. Geoff, yes, I lost my **** mind when Dead Rising 4 came out. I'm so, I'm such a Dead Rising fan, and so to have it come back, and then not only come back, but come back with Frank West. Thank you. Thank you so much. You're welcome. So I, I got to watch over a kid's shoulder as he played it 'cause you know, Microsoft gives Greg Miller no special treatment. Uh, bring me up to speed. What, what, what are you saying about the game so far? Okay, so this is uh, 16 years after uh, the first Dead Rising, the first Frank West appearance. Sure. Uh, he is",
            "start": 0.12
        },
        {
            "text": "special treatment. Uh, bring me up to speed. What, what, what are you saying about the game so far? Okay, so this is uh, 16 years after uh, the first Dead Rising, the first Frank West appearance. Sure. Uh, he is being drawn back into Willet, reluctantly being brought back to investigate something that's been going on in Willet again. So he goes back to uh, to investigate and find out what's happened there. Another zombie outbreak has happened. So I was going to say, did Willet eventually got put under, it was under control at some point? It was, it was, it was rebuilding and uh, so the town's rebuilt. It didn't end well for Willet at the end of Dead Rising 1. No, yeah, not so good. Not a good place. And uh, and so they've rebuilt and they've actually built a giant shopping mall to try and bring people in. As you do. As you do. As you do. Minnesota's been trying to get people in for years with that idea. Exactly. Yeah. And uh, so they tried to replicate that and uh, during the Black Friday weekend, yeah, um, zombie",
            "start": 39.04
        },
        {
            "text": "do. As you do. As you do. Minnesota's been trying to get people in for years with that idea. Exactly. Yeah. And uh, so they tried to replicate that and uh, during the Black Friday weekend, yeah, um, zombie outbreak. Gotcha. Gotcha. Gotcha. Again. Again. So weird. So right when the, the mall has been full of shoppers and there's all kinds of like holiday themed things going on, outbreak happens. Uh, and then about six weeks after that, Frank makes his appearance in Willet. Okay, cool. Yeah. And so what I'm always not lost with, but Dead Rising games for me, I play them and I love them so goddamn much and I, I play the, just play them non-stop. Yeah. What I'm lost with in, in the world right now in Dead Rising 4, what is the general populace's knowledge of zombies? Where are we at right now? Is everybody aware? 'Cause it's always like, you know, Frank's covered wars like that's happened and he covered this, but then there was, they discredit him. And so where are we right now in the world of Dead Rising? Yeah. Do people know?",
            "start": 85.84
        },
        {
            "text": "always like, you know, Frank's covered wars like that's happened and he covered this, but then there was, they discredit him. And so where are we right now in the world of Dead Rising? Yeah. Do people know about zombies and that's a real thing? People know about zombies and um, there's actually, we've got things like safe houses in the world that the, that the uh, civic officials will say, okay, have uh, have built. So they, they're prepped for another zombie outbreak at any time just in case. Sure. Of course. You know, in case, in case it happens, it's not supposed to, but just in case it does, they're ready for it supposedly. Um, so there are safe houses in the world. Um, and you see a few things around the world that sort of indicate that they, that they were sort of prepping in case something happened. Gotcha. Gotcha. Gotcha. So then, you know, it's so many years later, where do we find Frank West when we start the game? We find Frank West uh, somewhere else hiding out. Um, he's, he's taken his uh, he was discredited after",
            "start": 134.6
        },
        {
            "text": "gotcha. So then, you know, it's so many years later, where do we find Frank West when we start the game? We find Frank West uh, somewhere else hiding out. Um, he's, he's taken his uh, he was discredited after the first one went off, found himself a new profession, was living in uh, obscurity, we'll say. Uh, and is, that's when he's tracked down. That's when the story starts. Okay. Yeah. And so for you guys, how many, I guess, call back are there to Dead Rising 3? Like bringing in, is it, is it a lore or is it more Frank story from 1 to 2? And then there's Off the Record, but like, you know what I mean? Yeah, that was uh, as someone said today, Off the Record, not canon. Okay. But uh, that's not canon. Okay, good. Just making sure. Glad we're getting it out of the way. But um, it, it is progressive. So it is progressive to the, to the story of Frank West. Yeah. Um, but it's not something that people need to know. They don't need to have played the first games, know the story from the first two games to jump into this one. And uh,",
            "start": 177.56
        },
        {
            "text": "to the story of Frank West. Yeah. Um, but it's not something that people need to know. They don't need to have played the first games, know the story from the first two games to jump into this one and uh, and just start killing zombies and understand who everyone is. Okay, that's good to know. So then for you guys, I mean, you're making the fourth game here in Dead Rising. Yes. What did you want to bring to the table this time? Well, for us, um, one of the things that we always try and do is see how many zombies we can get on screen. Always very important for us. So we've, we're pretty proud of our efforts so far. What's the, what's the number this time? I'm an art director. I don't know numbers. Oh, God. Yeah. Lot. You say a lot. Lots. It looks, PR is saying a lot. Yeah. PR back there saying it looks pretty. Thousands. Let's say you thousands of zombies on the screen. Yeah. And it doesn't like teraflops. Don't, don't, don't. No, let's not. No, let's not do that again. Thousands of zombie. So more than we had in Dead Rising 3.",
            "start": 230.32
        },
        {
            "text": "say you thousands of zombies on the screen. Yeah. And it doesn't like teraflops. Don't, don't, don't. No, let's not. No, let's not do that again. Thousands of zombie. So more than we had in Dead Rising 3. So, so that was a good push. We also wanted to um, um, expand on the combo idea. So we've got combo weapons as always, combo vehicles as always. And now we're giving people the opportunity to combo Frank with Exo Suits. So that's something that we were revealing at E3. I saw the one I saw at the end of the trailer. He put on like a crazy Exo Suit, start wrecking shop. So the idea behind that is that uh, when Frank gets an Exo Suit, which is part of the stuff that's left behind by the military presence in the town, yeah, um, he throws that on. He can now interact with things in the world that he couldn't normally interact with. So in the demo, we have people ripping parking meters out of the ground, killing zombies with, with that, punching cars, knocking them down the street, wiping out hordes of zombies that way as",
            "start": 275.88
        },
        {
            "text": "with. So in the demo, we have people ripping parking meters out of the ground, killing zombies with, with that, punching cars, knocking them down the street, wiping out hordes of zombies that way. As you do. As you do. Yeah. And uh, we've also put a whole bunch of other stuff in the world that, that Frank can only use when he's got the Exo Suit on. Gotcha. Yeah. So then I guess for you guys, why come back to Frank West? You know what I mean? There had been Dead Rising, Dead Rising 3 when it launched with the Xbox One. Pretty much you brand new character, brand new area. It seemed like we were getting even further away from Frank. But now we're back to him. We're back to him. I think mainly because on the dev team, we love Frank West. Like he was such a great character. So we started looking at him and and talking about what, what he'd be like uh, this many years later. Um, and just, just to see what we could do to expand on him. So we went through a number of iterations with the character model. So Frank's like 50, I",
            "start": 323.72
        },
        {
            "text": "about what, what he'd be like uh, this many years later. Um, and just, just to see what we could do to expand on him. So we went through a number of iterations with the character model. So Frank's like 50, I think in this version of the game. About that. Yeah. So then we had all these debates around like, what is a 50-year-old like? Should he be slow as hell? And yeah, like how, and as we're, you know, as my boss Joe, what up Joe? Joe, Joe looks up to Frank because he's kind of his age. And uh, sorry, I just gave away Joe's age. That's okay. Um, and uh, we talked a lot about like how he would act, what, what his experiences in the past, what they would do to him now. Um, so it was a cool exploration and we ended up finding like really good voice talent for him and we found lots of really cool opportunities for like expressing who Frank is. Oh, nice. Yeah, it's really good. I think in the first uh, the first Dead Rising, Frank kind of wore his personality on the outside. Yeah, the jacket, the glasses, the whole bit. You kind of knew",
            "start": 361.08
        },
        {
            "text": "who Frank is. Oh, nice. Yeah, it's really good. I think in the first uh, the first Dead Rising, Frank kind of wore his personality on the outside. Yeah, the jacket, the glasses, the whole bit. You kind of knew who he was just looking at him. Yeah, at a glance. Yeah. So what we want to do this time was really um, emphasize the fact that Frank is a photojournalist and uh, and let the rest of his personality come out in the acting and in the uh, in the script. Yeah. So for you guys, and this isn't an insult, I hope, but like, is this a more grounded, real Dead Rising? Like, you know what I mean? Is Frank, 'cause that was always the fun thing about Dead Rising 1, especially, right? That it was like totally over the top B-movie and then I'm like getting a katana and just cutting everybody up or running across dead guys, that kind of stuff. So in terms of the action, yeah, that sense of humor, that tone is still in the game. We, what I like about Dead Rising really is that we can take a really humorous feel and apply it to something",
            "start": 412.36
        },
        {
            "text": "of stuff. So in terms of the action, yeah, that sense of humor, that tone is still in the game. We, what I like about Dead Rising really is that we can take a really humorous feel and apply it to something with a really intense, you know, intense content. Sure. Right. So Frank, um, Frank still has that kind of like silliness to, to him and you'll see it in the outfits he wears. You can throw different wet outfits on. Yeah. Um, and the kind of stuff, stuff he does in the game. So yeah. Okay. So he's still the crazy Frank we knew. He's still crazy Frank, but he's, he's more grounded and he's, he's a little bit older. Yeah. Yeah. Little. So does that play into it? I, I was going to say, is he slower? Is it, is he take longer to get up? No. Um, the way, how's his prostate? Is his prostate? Is he getting that check? 'Cause that's, that's one of the actually, the very beginning. Frank, get a prostate exam. Please, sir. No, he um, the way that we, we played out with him is um, he, he doesn't stick to landing is the way we like to describe Frank.",
            "start": 452.36
        },
        {
            "text": "one of the actually, the very beginning. Frank, get a prostate exam. Please, sir. No, he um, the way that we, we played out with him is um, he, he doesn't stick to landing is the way we like to describe Frank. Okay. Right. So he, he does all the moves, but it's not the superhero poses. Right. So he's, he's just a little bit clumsy. He's a little bit brutish. Um, a little bit more realistic that way. Yeah. Um, but he's still Frank. Yeah. Uh, is it more in the line of the, like you're saying, it sounds a lot like we're just returning to what, what Dead Rising 1 was, which is great. Is that mean no multiplayer? Are you talking about that? What were we on that one? Uh, we got multiplayer. Okay. Yeah. We're going to talk about that more as we get closer to launch. But uh, we're closer. See exactly. Yeah. Like how there, how you guys are, you, you, you there? You ready for launch? You getting there? You psyching yourself up? Yeah. Yeah. We got all the pieces there. We're just sort of like making sure everything's super fun. Um, we're excited. I'm",
            "start": 498.84
        },
        {
            "text": "you, you, you there? You ready for launch? You getting there? You psyching yourself up? Yeah. Yeah. We got all the pieces there. We're just sort of like making sure everything's super fun. Um, we're excited. I'm excited to get back and just finish it off. Yeah. And like, how long have you guys been working on this? Um, a while. Been with Capcom uh, for about a year and a half now. And uh, and it's, it's been in development during that time. I was going to say, 'cause it's one of those, I think, you know, Dead Rising is a franchise that so many people love. And it up until recently, it, you know, it didn't get leaked. Nobody knew that it was happening. And it was that thing of like, oh my gosh, that's great. 'Cause I had been predicting for a long time and do the thing where you clear your face so you don't give any tells if I'm right about a future one. I had been predicting you guys were up in Capcom Vancouver working on a Mega Man game. A third person in Mega Man, run around, do a million things, open world Mega Man game. 'Cause",
            "start": 550.88
        },
        {
            "text": "right about a future one. I had been predicting you guys were up in Capcom Vancouver working on a Mega Man game. A third person in Mega Man, run around, do a million things, open world Mega Man game. 'Cause Colin's been saying he wants that forever. Right, Colin? Am I right? Yeah, I'll write it. Colin wants to write it. He keeps saying. But that was my prediction is 'cause, you know, you guys are great at third person action games like that. That, that would be what it was. And then here you are, Dead Rising 4. And that's a major hole in my theory of what you were working on. We threw you off. You did. You, you threw me off the scent, as they say. So for you then, as we start to wrap this interview up, mhm. What is the most important takeaway for somebody about Dead Rising 4? Uh, the big takeaways are Frank is back. Yeah. Uh, bigger and badder than ever. Uh, all new ways to combo. And uh, just way, when you say that, I mean, we talked about the Exo Suits and, but I mean, like, I, we saw crazy ass candy cane weapons and stuff like that. Still.",
            "start": 593.36
        },
        {
            "text": "and badder than ever. Uh, all new ways to combo. And uh, just way, when you say that, I mean, we talked about the Exo Suits and, but I mean, like, I, we saw crazy ass candy cane weapons and stuff like that. Still. That, that's all, that's, that's part of Dead Rising and that'll be there in spades this time as well. Okay. Yeah. And then my, my big question, yeah, is it still like time based and everything? Like, do I have to worry about time meters running out? 'Cause I hate that. I, I hate it and love it at the same time. Like, I understand why it's there, but it still drives me crazy. Is like a completionist. I'm like, oh God, it's, oh God. Uh, only at E3 is there a time based thing. So during the final game, no time limits. But I could kiss you. Yeah. Yeah. Don't. I won't. I don't want to get anybody mad. Your significant other. I don't want coming after me or whatever. No, that's great news. Thank you very much for that. You're welcome. Oh man, I'm excited for Dead Rising 4. I am too. Out this holiday. Out this holiday. Xbox One. Xbox One. That",
            "start": 629.0
        },
        {
            "text": "coming after me or whatever. No, that's great news. Thank you very much for that. You're welcome. Oh man, I'm excited for Dead Rising 4. I am too. Out this holiday. Out this holiday. Xbox One. Xbox One. That PC stuff. PC stuff. Yeah. 'Cause it's got the, what do they call, what are they call in the Xbox thing with the, the Cross-Play? The Cross-Play. No, that's not what they call it. I think that's what they call it. No, they had a fancy name. What, Colin, what was the fancy name? Play on PC. No, Play on PC was not. Ah, geez. Do you know, PR guy, who? Xbox Play Anywhere. Xbox Play Anywhere. This is, this is different. This, oh, you don't have Xbox Play Anywhere. We're, we're on Xbox One and Windows 10 this holiday season at the same time. You're letting Phil Spencer down. He came out. He had this whole thing. They, they had a little graph. Traffic 48. And this doesn't have it. Don't worry. Everybody who watches this is a console player, not a PC dork. Ladies and gentlemen, this is Jeff. You're getting pointed at by The Coalition folks. Come hug them. Come",
            "start": 674.88
        },
        {
            "text": "and this doesn't have it. Don't worry. Everybody who watches this is a console player, not a PC dork. Ladies and gentlemen, this is Jeff. You're getting pointed at by The Coalition folks. Come hug them. Come hug. Come give him a hug. Go way, way. No, well, now it's just crotches. Now it's just crotches on camera. We're about to do some Gears of War stuff too. But ladies and gentlemen, right now, that is all there is to say about Dead Rising 4. I can't wait. I'm very excited. Thank you for coming by. Oh, you're an art director. Is the art cool? I've asked an art question, I guess. Uh, the art's the coolest. It's the best part of the whole game. Is it the best Dead Rising art you ever? It is. It is. I, it blows the rest of them away. Thanks, Nick. Thanks, Nick for everything about Dead Rising video games, E3, and whatever the hell Kevin does. Keep it right here on youtube.com/KindaFunnyGames.",
            "start": 718.72
        }
    ]
}