{
    "id": 1867,
    "video_id": "p3xF1gDUntE",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "John Vignocchi"
    ],
    "title": "The Rise and Fall of Disney Infinity - The Kinda Funny Gamescast E3 2016",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nJohn Vignocchi comes by and talks Disney Infinity!",
    "published_at": 1466267400,
    "duration": 2170,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening. Kinda Funny is going all out with let's plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up everybody? Welcome to a Kinda Funny podcast thing. I don't know. Tim, are we putting these on the Gamescast? Yeah, we're putting this up as a Gamescast. I'm one of your hosts, Greg Miller, alongside one of my best friends in the industry. No, you don't mean that. Vignocchi, I do. You know how much I love you. Oh, yeah. Bring it. Yeah, it's great cuz I actually say that um there's only one person in the world that I know that sweats as much as me and it is you. It is true. But you embrace it. I'm really embarrassed by it. Oh, no. I think I have like hyperhidrosis. Well, it's cuz it's just you're always you always have an excuse for it. Last year at E3, you showed up and you're like, \"Oh, I just did a bunch of shots of Sake.\" And I'm like, \"No, but I know you you sweat all the time.\" Actually, ironically",
            "start": 0.12
        },
        {
            "text": "have an excuse for it. Last year at E3, you showed up and you're like, \"Oh, I just did a bunch of Sake.\" And I'm like, \"No, but I know you you sweat all the time.\" Actually, ironically, it was a bunch of shots of Sake and it was at Katsuya and Activision was courting me for a job. You should probably ring them up. It's probably about time. Yeah. **** you, Greg. But that's the whole reason we're here. No, he's right. I get it. But at the same time, that was a good that was a good, you know, a good jab. I got you. Yeah, that's fine. I can take it. John Vignocchi, of course, friend. Kinda Funny. You've seen him many times on our shows talking usually about Disney Infinity. You were the face of Disney Infinity. Yes. And then Disney Infinity all of a sudden. But I was a lot more than just a guy that talked about the game. I mean, I love this. What else you got? No, I'm always sensitive about this because the guys at Avalanche and maybe some of the guys are are watching us right",
            "start": 37.44
        },
        {
            "text": "just a guy that talked about the game. I mean, I love this. What else you got? No, I'm always sensitive about this because the guys at Avalanche and maybe some of the guys are are watching us right now, they'd always be like, \"Dude, you do such a great job talking about the game and and what's going on and and I'm like, that's awesome.\" Like I also spend a lot of time actually like working on the game with the guys as well. And so I get sensitive about that. I see you're you're more than a pretty face. You're saying you some of the big some of the big things pretty face. Of course I of course I do. Are you kidding me? Look at that. Yeah. There you go. I think my chin actually hit the microphone at the same time. So, like what? So, you you worked on the game and you said in some respects like what did you like in some respects? Are you like the guy who said we need a lot of Hulks? No, wait. By the way, that was Patrick Klepek, right? Yeah. Okay. Patrick Scoops they call them. Yeah.",
            "start": 75.6
        },
        {
            "text": "like what did you like in some respects? Are you like the guy who said we need a lot of Hulks? No, wait. By the way, that was Patrick Klepek, right? Yeah. Okay. Patrick Scoops they call them. Yeah. Scoops. Uh, Hot Scoops Hogan. So, I just like I was like I read that and then I was like, hm. I'm like that isn't even like so that's that's a part of the story and and not I'm not going to say like anything about that was was right or was wrong or whatever it is but it was interesting how quickly stories were coming out about it and I think that there are still so many stories to be to be told maybe one day about what had happened and probably not right now. Damn it. **** it. Um where I've been told like uh I'm not going to tell you that you can go on Kinda Funny or you can't go on Kinda Funny but um well this is breaking your exclusive Giant Bomb deal you always have over there Jeff Gerstmann pulling the leash I'm sure there's no no even that there were they were more like like you",
            "start": 109.44
        },
        {
            "text": "of funny but um well this is breaking your exclusive Giant Bomb deal you always have over there Jeff Gerstmann pulling the leash I'm sure there's no no even that there were they were more like like you know if you would like to have a severance package or if you would like to look at future employment opportunities the Walt Disney Company it would not be a great idea to to get on camera and uh say a bunch of bad stuff. So sure I understand that. So fair enough. But yeah, Scoops wrote that thing and and um you know, I ran into him actually in front of LA Live, gave him a big hug and actually he caught me in a moment. Then you like kissed him like like in The Godfather. I don't see you, Scoops. Exactly. I was actually I was spooked at the time because um an article Sorry an article of that microphone. I know. Hi. An article just came out about an alligator eating someone at Disney World. I don't know if you saw that cuz obviously like E3's been crazy. Something just happened and I was",
            "start": 151.04
        },
        {
            "text": "microphone. I know. Hi. An article just came out about an alligator eating someone at Disney World. I don't know if you saw that cuz obviously like E3's been crazy. Something just happened and I was like reading there and I was basically had this crazy like in shock in office face like horrified. Yeah. And then Scoops walked up to me. He's like, \"Hey, Johnny V. What's going on?\" I'm like, \"Hey, hey, uh, sorry. I'm looking at something really weird right now. Hey, congratulations on the baby in the new house.\" Like, what do you have to say? Sorry. So, what I wanted to call this when you were supposed to be here on time and we're going to have a full hour. Get **** boy. I said I was going to be late by 15 minutes. Yeah. I'm And that and then you were like, \"No, no, no. Hold on there.\" And then he's like, \"That's cool cuz we're late, too.\" Now, I showed up at 3:17. Yeah. I don't know what we had gotten here like 3:05. So, I'm just letting you know like we could have been all in. I",
            "start": 190.72
        },
        {
            "text": "And then he's like, \"That's cool cuz we're late, too.\" Now, I showed up at 3:17. Yeah. I don't know what we had gotten here like 3:05. So, I'm just letting you know like we could have been all in. I wanted to call it the rise and fall of Disney Infinity. But what And what I want to start with, John Vignocchi, is you, Greg Miller. I want to start with you because I don't know I I know you as you came into my life with Disney Infinity. Really? That's really I remember the first time I spoke to you in person. Do you or not in person? And this the first time I spoke to you. Period. You remember this? No. Tell me. You were drunk in a car and you called Adam Boyes and we were playing Destiny and he put you on the speaker phone. Tell me how this goes. Cuz that was that was pretty much it. We were yelling at you. Well, no, I had known of you before. We had been in the same circles, but this is this was when we were yelling at you to get on. You're like, \"No, I'm out celebrating something. I",
            "start": 229.6
        },
        {
            "text": "yelling at you. Well, no, I had known of you before. We had been in the same circles, but this is this was when we were yelling at you to get on. You're like, \"No, I'm out celebrating something. I forget what it was.\" And then you had a few you were kicking them back. Um, so what what's the pre John Vignocchi life before Disney Infinity? How what how do you get involved in the games industry? I um jeez. I mean, in my in my young teens, I helped start up a video game website that eventually became a content affiliate of IGN. I know them. Um and then uh at the end of uh which one was it? Was it IGN Babes? IGN Cars. Which one? It's called Enigma. Um Oh, I remember that. I remember seeing that logo once in a while on the back end. Yeah, it was uh it was really cute. And I was like, I don't know, 13 or 14 at the time. And then um that actually helped me meet a whole bunch of different people at Midway Games. Yeah. Like Midway Games, for like some of your younger viewers, like creators of like",
            "start": 268.16
        },
        {
            "text": "know, 13 or 14 at the time. And then um that actually helped me meet a whole bunch of different people at Midway Games. Yeah. Like Midway Games, for like some of your younger viewers, like creators of like Mortal Kombat and NBA Jam, NFL Blitz, and they were like how Rockstar Games is kind of revered right now. I mean, they were just like super hot. Everything I did was so cool. Like, oh, the latest thing from Midway Games is going to be amazing. And so I met a lot of those guys um uh when I was running the website. And then eventually that led to like an internship and they brought me in like Kid Off the Street. I remember one guy actually I just hung out with uh John Root. He's a uh he's an animation guy. He runs VR LA right now and we we were hanging out last Thursday having drinks and he's like I'll never forget when you walked in and sat down in the desk next to me and he's like he's like I'm sitting there and I'm animating some new stuff for Blitz. And I'm like oh okay so they hired the",
            "start": 311.12
        },
        {
            "text": "I'll never forget when you walked in and sat down in the desk next to me and he's like he's like I'm sitting there and I'm animating some new stuff for Blitz. And I'm like oh okay so they hired the intern full-time. So are you a uh are you an artist? And I was like no. And he's like are you a programmer? I'm like, \"No.\" He's like, \"How about an animator? Do you know how to do anything?\" And I'm like, \"I'm just really here to help.\" And uh I'll do whatever. He's like, \"Yeah, well then help the janitor take out my trash.\" And then he high-fived Jeff Johnson, who was a lead programmer at the time, right? And they like they laughed right in front of me. Did they then drag you to the bathroom and give you a swirly? Yeah. I know. That's Midway back in the day. It was like if you're not a programmer, an artist, or have any type of skills and like what are you doing here? And honestly, it was just it took it took a guy by the name of it took a couple of guys like Mark Turmell, um George Gomez",
            "start": 348.72
        },
        {
            "text": "an artist, or have any type of skills and like what are you doing here? And honestly, it was just it took it took a guy by the name of it took a couple of guys like Mark Turmell, um George Gomez, and Sal DiVita, like three guys that had a lot of faith in me. I was like, \"So, okay, here's someone we're going to bring in from the outside, kid off the streets that really doesn't know much, and let's train them over the years.\" So, I started off in uh production, moved into design, um and then eventually went over to uh business development, product strategy, and then um helped start up a studio in Chicago outside of Midway Games for about a year before I came to Disney. Okay. And so, I've had like kind of like a crazy but I guess the thing is this for like for your viewers that are watching right now. Viewers, what's up? The key thing is viewers. Yeah. Community fans. I know you were doing fine. We call them Best Friends. If you want the Best Friends watching or listening right now, Best Friends.",
            "start": 390.96
        },
        {
            "text": "Viewers, what's up? The key thing is viewers. Yeah. Community fans. I know you were doing fine. We call them Best Friends. If you want the Best Friends watching or listening right now, Best Friends. Um the deal is that uh all I ever wanted to do since I was a kid was make video games. Yeah. And um it is actually true if you are persistent enough like you can completely follow your dreams. Sure. And now you can follow your dreams and also have dreams slightly shattered um and and be in a moment right like like right now where of course I'm I'm freaked out. I'm scared. I mean there's a lot of great things. I'm also like the type of person that's always like like sky's falling sky is falling and but but I mean that's the thing like yeah the so right now you you know your dreams have led you to the unemployment line and you seem to be taking it well as you move off right now but you're one of those guys right like everyone loves John Vignocchi he's going to get I'm sure they should be",
            "start": 430.24
        },
        {
            "text": "you to the unemployment line and you seem to be taking it well as you move off right now but you're one of those guys right like everyone loves John Vignocchi he's going to get I'm sure they should be beating down your door already but if not once they see this podcast they will be you're out there and available I mean there's a lot of people talking to me actually the coolest thing that happened to me the other night was Um, we went to a cool thing that um, Randy and Christy Pitchford put on and someone shouted out in the background, \"The game industry loves you. Don't be worried. We all got your back.\" That's a long thing to shout. Yeah. Like it was but it was like the coolest thing. Like it was like it was like more like JV, don't worry about anything. Game industry's got your back, man. Don't worry. And so I was Yeah. All right. Um, but in that moment, that was actually the one thing I think anyone could have said to me that actually was like, \"Thanks.\" Yeah. Um, cuz right now, not",
            "start": 474.72
        },
        {
            "text": "Don't worry. And so I was Yeah. All right. Um, but in that moment, that was actually the one thing I think anyone could have said to me that actually was like, \"Thanks.\" Yeah. Um, cuz right now, not only for myself, I mean, forget about me, whatever. Right. It's it's like the team and how the team has been impacted. And the number one priority for me is, okay, what's going on with the team and is everyone going to be okay? And it's um, thankfully, it seems like a lot of the guys are. Um, but at the same time, anything and everything that I can do to help out people individually that were impacted, I think is is the right thing to do right now. Um, and so I hope that I mean like for any gigs that I'm looking at, what I'm really trying to evaluate is beyond like it being a wonderful thing for me, whatever. Yeah. Um, how much of of the team can I protect and bring along and leverage their expertise and everything that they've done in in a new thing? So to me, I think that that's that's",
            "start": 512.32
        },
        {
            "text": "for me, whatever. Yeah. Um, how much of of the team can I protect and bring along and leverage their expertise and everything that they've done in in a new thing? So to me, I think that that's that's another like important thing that's going on. So I just yeah, there's a lot of people talking to myself and and to everyone on the team and um as much as I felt alone and feel alone, uh it's it's people saying things like that. I know, right? This is not supposed to be sensitive to he's actually this is a good interview, right? Cuz you've completely broken me down. Um and so here I am. But um it's it's about the team and it's about like um it's just nice things. I mean, even when you rang me up and or send me a DM, whatever the **** and you were like, \"Yo, come on and talk.\" I'm like, \"Well, I'm nervous because I don't want to talk a ton about Infinity because I don't obviously world's largest media conglomerate.\" Yeah. Could be. We're not here to get the dirt on Infinity or anything",
            "start": 560.88
        },
        {
            "text": "I'm nervous because I don't want to talk a ton about Infinity because I don't obviously world's largest media conglomerate.\" Yeah. Could be. We're not here to get the dirt on Infinity or anything like that. I It's just mainly I want to know like I cuz I what what what do you how do you describe the role you had cuz Yeah. I think for us, for you know, your Giant Bomb family, the audience who knows you that way, it is that you're the fa you're the one talking about, you're doing all these things, but like what what was your title and then like what was that job when you got it? Um, when I started basically, it's actually funny when I started uh so I had worked on um I came to Disney and they were like, \"Look, there's this studio called Propaganda Games. They're based in Vancouver. They're a bunch of ex-EA guys. Um they're working on a Pirates of the Caribbean RPG and they're working on they just came off the hotness of Turok and we're planning Turok 2 and then they were working on uh Tron",
            "start": 605.04
        },
        {
            "text": "bunch of ex-EA guys. Um they're working on a Pirates of the Caribbean RPG and they're working on they just came off the hotness of Turok and we're planning Turok 2 and then they were working on uh Tron Evolution. And the reason why Disney was attractive was because one of my old mentors at Midway Games, George Gomez, made the original Tron arcade game. And so I thought to myself like, well, what a wonderful story I could actually follow in his footsteps and work on like as they're making this true theatrical sequel to Tron. Yeah. I can work on a video game version. And they were like painted this entire idea like, oh, we're gonna do this big transmedia thing. Remember talking about like transmedia. And so they're like, the video game is gonna have a story line which is going to tie into the film and the film's going to have a story line. It's going to tie into books. And so I was like, well, that's really cool. Universe. I went and looked at Yeah. And then I went and looked at the Pirates",
            "start": 642.88
        },
        {
            "text": "and the film's going to have a story line. It's going to tie into books. And so I was like, well, that's really cool. Universe. I went and looked at Yeah. And then I went and looked at the Pirates game and the Pirates game showed a lot of promise. Dude, the what we always talk about the Pirates game is that the Pirates game was awesome. I remember going I was a Thank you for saying that. I was a I was uh not I don't I'm not trying to pull a column was right here but I like Propaganda and I remember going up Turok and I went up there and spent like two days there playing Turok and doing video and I remember on the board they had uh Turok ideas written down and I joked around about it and then like they were like well I was like asking the student like oh well you know we're three floors or whatever it was and they're like I'm like oh cool and I've only but I've only seen two like the third floor is this Pirates of the Caribbean game we're working on. remember it was the Epic",
            "start": 682.16
        },
        {
            "text": "floors or whatever it was and they're like I'm like oh cool and I've only but I've only seen two like the third floor is this Pirates of the Caribbean game we're working on. remember it was the Epic Mickey year uh with Warren Spector at E3 where pre-E3 judges week we went to and there was the wall was lined with stations to play Pirates of the Caribbean and everyone who played it walked away and was like **** that was a good game like we're looking forward to that and then just one day gone the only piece of dirt I'll give you from that no dirt I don't need the only no because it's sensitive to me is that the mandate was put out if you guys are nominated for RPG of the show um just nominated We know that this has legs. Um, and this is all old regime. We have all the great people there at Disney right now. What year was this? This would have been um 2009 2009 or actually it would have been I mean spring of 2010. Um, and I remember like, you know, text messaging any journalist that was",
            "start": 717.2
        },
        {
            "text": "Disney right now. What year was this? This would have been um 2009 2009 or actually it would have been I mean spring of 2010. Um, and I remember like, you know, text messaging any journalist that was there, you know, as part of that group that would listen and everyone's like, \"Yeah, it's cool, but at the same time, like we're kind of nervous because, you know, it's like a licensed thing and is the company really going to get into it?\" And, um, and that was one of the things that was like, look, I mean, even even some of the journalists are a bit worried about, you know, how this is going to turn out. Yeah. Um, it was cool, though. I mean, we had uh Dan Tudge was one of the guys who was actually running Propaganda at the time. He was a game director on Dragon Age. So, you actually had um some really really solid um uh game development people that were behind that game and just basically saying if you want to make this a compelling RPG, you know, this is the type of things that you",
            "start": 758.88
        },
        {
            "text": "um some really really solid um uh game development people that were behind that game and just basically saying if you want to make this a compelling RPG, you know, this is the type of things that you need to do. And what's funny about it, Greg, is that it would actually lead to a friendship that I have with someone still to this day, um, who I guess now was my ultimate rival, and his name is Alex Peters. So, Alex Peters was the game director on this Pirates of the Caribbean game. Yeah. And then a few years later would text message me and be like, \"Yo, moving to Santa Monica. Um, you're not going to believe what I'm working on.\" And he is now the VP of production on Skylanders. Gotcha. And so I was actually his publishing side producer. So I was based in LA. Like all the crazy stuff that he was dealing with from from the filmmakers and from studio and coming in talking about like what's the game that you're trying to make, who the characters you're trying to use, like all that kind of",
            "start": 797.92
        },
        {
            "text": "was dealing with from from the filmmakers and from studio and coming in talking about like what's the game that you're trying to make, who the characters you're trying to use, like all that kind of stuff. I was kind of his buffer for that. And he and I became really really close and then ultimately became huge rivals. Yeah. Um friendship was broken. I mean that friendship was broken. I mean whatever. Alex, if you're watching, which you're not. **** you. He might be now. No. He called me the other day. He's like, \"Oh man, sorry.\" But it's great news for us. Yeah, I know. Right. I'm like, \"Yeah, okay. Hey, I get it. That was like the one thing that was like so weird of like and I I don't know. I I'm blessed to know you and know developers and I'm blessed to know you too. Thank you. Uh know so much about the inside baseball of the industry and what it's like, you know, like the game over speech, right? Of trying to be like, \"Hey, thank you all for doing this.\" So cool, by the way. I'm",
            "start": 842.8
        },
        {
            "text": "so much about the inside baseball of the industry and what it's like, you know, like the game over speech, right? Of trying to be like, \"Hey, thank you all for doing this.\" So cool, by the way. I'm not going there. I don't need Don't inflate my ego. So, wait, whatever. I'm not going to play his ego, but here's what I'm going to say. Is it almost time? We're getting the time wash thing. Okay, I get it. Right. Sorry. I'm When the next guest comes in, that's when I'll know to stop. I just want to know how close we are. Try not to sneak. I stood up in the front **** row and I stood up for you and now I was the first guy that did. I got nervous like any nerd would. I was like you look around like, \"Oh no, I'm the only one.\" Okay, back down like when you try to poop outside. No, that was the thing of watch. But I did still stand up and clap for you. Thank you very much. Thank you. That means a lot to me. I I saw you, you know, I'll never forget looking fire that night, by the way. I was",
            "start": 878.96
        },
        {
            "text": "thing of watch. But I did still stand up and clap for you. Thank you very much. Thank you. That means a lot to me. I I saw you, you know, I'll never forget looking fire that night, by the way. I was going **** wasted afterwards. Uh, as you should. I know, right? Yeah. It was like it was funny cuz I've covered PlayStation forever, but Shawn Layden came in like when I'd already moved to like full host role, right? So Shawn never remembered me every time we meet and then like he gave me the award and it was like oh cool and like we at he gave me the word we talked about after think about uh Crash Bandicoot. Yeah. But no then at the like he meets me and I finally make a good impression. I'm like, he's going to remember me forever. And then that night I was walking and I got a giant burrito and I'm wasted and I run and I'm like, oh award. Uh, no. Where I was driving with that is the fact that when Disney Infinity, the news comes down that it's done. We never really won any big awards",
            "start": 908.72
        },
        {
            "text": "and I'm wasted and I run and I'm like, oh award. Uh, no. Where I was driving with that is the fact that when Disney Infinity, the news comes down that it's done. We never really won any big awards either with Disney Infinity, which always crushed me. Yeah. I always felt like we should have won some a whole bunch of great awards. We always got beat by Nintendo. Oh, the amias. No way. You're like part of that. So, everyone knows there's like this like gamer elite like journalist guys are part of a special panel and you guys I am not a judge. I am not an E3 judge. You're not. I don't know. I'm not Keighley wouldn't touch me with a 10 foot pole just let me Jeff let me be judge. Keighley is a good guy. Don't get me wrong, but like you were at one point part of I came down for judges of Elderon that votes on the hottest. That's not how it works now. No. No. How does it work? When I was at IGN, IGN had one judge and it was usually like your EIC. So, you know, Casey Lynch, Hillary, and now Steve Butts",
            "start": 944.64
        },
        {
            "text": "on the hottest. That's not how it works now. No. No. How does it work? When I was at IGN, IGN had one judge and it was usually like your EIC. So, you know, Casey Lynch, Hillary, and now Steve Butts, and he's the judge. They go down, but then they bring you're allowed to bring uh other journos to go and see the games and preview them, but I don't have a say in what's going to vote. I I mean, like, don't get me wrong, when I was at IGN or Kinda Funny last year, we totally stonewall you on awards. I never voted for you. You know what I mean? And then they announced Lego Dimensions and I was like, now here's a **** game. Here's a game. Wait, I can get a a VO recording contract as well. Yeah, this game rocks. **** you. **** you. No, whatever. I I am not in Lego Dimensions. I am not in Lego Dimensions. Oh, trust me. Anyone who was watching or listening to this knows my obsession is real with Lego Dimensions. No, it's cool. I'm like, I'm giving you a hard time. I know. I'm giving you",
            "start": 984.64
        },
        {
            "text": "Lego Dimensions. Oh, trust me. Anyone who was watching or listening to this knows my obsession is real with Lego Dimensions. No, it's cool. I'm like, I'm giving you a hard time. I know. I'm giving you a hard time. It's fine. That's what we do. That's how our friendship works. Please don't put my phone number on the internet. Um, I was And I actually did that like I really at that moment in time thought that that would be funny. Didn't realize how detrimental that was. But by the way, Dave Lang still has the same phone number. Everyone's like, \"Oh yeah, you got a new number.\" And I was like, I giggle about it. Wait, should I not have said that? No, you're fine. You're fine. It's great. Don't you know? It's the internet. It's the internet. No one's going to go back and look for Dave Lang's phone number. It's no big deal. I was like, like I'm like, \"Yeah, Dave was texting me this morning like whatever on Twitter like, oh, is it from his new phone number?\" And I'm thinking to myself like, \"No.\"",
            "start": 1021.2
        },
        {
            "text": "It's no big deal. I was like, like I'm like, \"Yeah, Dave was texting me this morning like whatever on Twitter like, oh, is it from his new phone number?\" And I'm thinking to myself like, \"No.\" Uh, I don't think so. No, I know. So, I mean, because I would have entered a new one. Anyway, I did hook him up though. I got him. I was like, \"I'm really sorry. Here's some passes to to Disney World or Disneyland.\" I mean, yeah. Yeah. Those days are done now. Yeah. But that was the interesting thing that I keep driving to and getting sidetracked is that when the news comes down, it was that weird knee-jerk reaction of so many people were like, \"Oh, that sucks.\" But at least now, you know, they'll be the Star Wars can go to Lego or this that or the other. And like even game developers, a couple of them said things online that were like that was a weird way to go about that and say that like why would you do that in this moment where you know all these people have suddenly you're talking about",
            "start": 1056.4
        },
        {
            "text": "them said things online that were like that was a weird way to go about that and say that like why would you do that in this moment where you know all these people have suddenly you're talking about like when so Jon Burton, I am talking about the one Jon Burton said that yeah he deleted them. He he clearly came to terms with it. He was wrong. So like to clear the air with that for what it's worth. So Jon said those things. Jon Burton for TT Games. Yeah. Yeah. Yeah. I mean he was the founder of TT and um so yeah he said those things and then um he and I went out to lunch I think last week. I posted a picture on Twitter and he was like hey I am so incredibly sorry for saying what I said in that moment. Yeah. And um and not not like in that moment like you know like just I'm so sorry for saying what I said. I wasn't I wasn't thinking straight in that moment and and um I'm really sorry. So, uh, that meant a ton to me and a ton to the team as well. We've all been there where you don't",
            "start": 1092.96
        },
        {
            "text": "saying what I said. I wasn't I wasn't thinking straight in that moment and and um I'm really sorry. So, uh, that meant a ton to me and a ton to the team as well. We've all been there where you don't think it through that point cuz his tweet wasn't like, \"Fuck Disney Infinity.\" It was like, \"Oh, you know, I'm sure Lego Dimensions had a part in this and and that's how it happens and that's competition.\" And it was a very like but hundreds of people suddenly don't have jobs. Yeah. Well, and Exactly. And so, um, it was actually really cool. Um, well the cool part was if there is a cool part that our community journalists investors I mean everyone was like dude this is so uncool right now. Yeah. So that was cool and then the fact that Jon actually then was like hey let's meet up I'd love to talk to you in person. So he and I met up and uh had lunch together and I have you met him before? Yeah. Yeah. Yeah. I mean, so like him and I at the same lunch, I mean, basically everyone's like, \"Can",
            "start": 1132.56
        },
        {
            "text": "to you in person. So he and I met up and uh had lunch together and I have you met him before? Yeah. Yeah. Yeah. I mean, so like him and I at the same lunch, I mean, basically everyone's like, \"Can I get a table away from those people?\" Cuz we're like I mean, just just **** yelling at each other, having so much fun. So many laughs. And um, he's a good dude. And he's a great dude, by the way. I mean, the guys at TT and and Lego Dimensions is incredible. And then, of course, Alex is over at Skylanders and and you know, their Imagineers looks great and everything that they're doing looks fantastic as well. So, um, you know, definitely no hate on any of those guys. And it was really cool that Jon said what he said. So yeah, thank you. And that's the whole thing of like if there's a something to take away from that, it's when you're wrong, admit you're wrong. You know what I mean? Like you have to be be it's so easy to ignore it and just push through it. But why not be a human being? Yeah.",
            "start": 1173.6
        },
        {
            "text": "take away from that, it's when you're wrong, admit you're wrong. You know what I mean? Like you have to be be it's so easy to ignore it and just push through it. But why not be a human being? Yeah. And when you spontaneous stupid, right? Like tweet your **** best friend's phone number on the internet. Like, yep, screwed that up. You know, so I'm I'm aware of doing dumb things. Exactly. So the question then for you, I guess you how long So I didn't realize you were at Disney that early. So, how long were you working with Disney on games? So, 2009 is when I started. Um, in 2010 is when I started working on late 2010 is where I started working on Infinity because Exidway people actually had jobs at Avalanche in Salt Lake City. And so, the guys uh the guy who runs uh Avalanche Salt Lake City, John Blackburn, um basically he was like uh here I don't want to What's wrong? No, because of my I had one cuff rolled and one nut. Now, that's a Peter Morris to you. Yeah. Okay. Cuz everyone was",
            "start": 1213.2
        },
        {
            "text": "John Blackburn, um basically he was like uh here I don't want to What's wrong? No, because of my I had one cuff rolled and one nut. Now, that's a Peter Morris to you. Yeah. Okay. Cuz everyone was making fun of him the other day. Were they? Yeah. Weren't they? I didn't see that on the EA thing. I don't know. I'm sure people people are mean all the time. Our chat was very nice during the hyper sensitive. It's okay. Don't worry. You're you're among best friends. Nobody's going to be mean to you here. Okay. Um anyway, so Blackburn basically uh he had gotten um mentions from a couple people that were that were at Avalanche like, \"Hey, so this this John Vignocchi guy was working with the propaganda guys. He's based in LA. if we're going to have one of our producers down in LA to handle like submissions and QA and franchise management and build, you know, marketing and build all this kind of stuff out, um, we should, uh, we should talk to him. And so John flew me out to Salt Lake City. My",
            "start": 1254.64
        },
        {
            "text": "and QA and franchise management and build, you know, marketing and build all this kind of stuff out, um, we should, uh, we should talk to him. And so John flew me out to Salt Lake City. My meeting with them was in a bar. Great sign for about 7 hours. Okay, great sign. Um, and it wasn't about like are you good at your like are you good at your job or what qualifications or any kind of stuff. It was like people think that you're a great guy that are here at the studio that we like and respect. Um, do we like you as a person and can you actually work with us? And so I mean the questions were like interview questions were like what's the greatest game of all time? If you're stuck on a desert island, uh, what game are you going to play and why? Yeah. Uh, what is the most overrated game of all time? What is the most overrated game of all time? Yeah, you said that. Would you say because this is the fun interview question now? So, by the way, this is all now. Whenever I'm interviewing anyone",
            "start": 1294.96
        },
        {
            "text": "What is the most overrated game of all time? Yeah, you said that. Would you say because this is the fun interview question now? So, by the way, this is all now. Whenever I'm interviewing anyone, I'm like, \"Okay, if this person's going to come work with us and work on our team, like I have to ask you these questions.\" The answer is Half-Life 2. Ooh. Ooh, that's People think that game walks on **** water. And I was so bored. That's a biting one. Yeah, I know. I know. Well, PC gamers already hate me, so you said that before. Oh, well, I don't not directly. I've talked **** about Half-Life before. I don't know if I've ever just openly admitted amongst all of your peers that Half-Life doesn't do it for me. Yeah. Yeah. Half-Life the driving around. I'm bored. I got head crabs. Whatever. This is whatever. This guy there's a guy a preacher with a shotgun. All right. No, this is so fun. So, uh, like with the were the mechanics broken. I mean, it was just everyone was like, \"Yo, this is a 97.\"",
            "start": 1341.68
        },
        {
            "text": "whatever. This guy there's a guy a preacher with a shotgun. All right. No, this is so fun. So, uh, like with the were the mechanics broken. I mean, it was just everyone was like, \"Yo, this is a 97.\" Like, what was what did a Metacritic have? Oh, yeah. Something crazy like that. Yeah. I played on Orange Box on Xbox 360 and so I was just I'm like, \"This sucks.\" I'm like, \"Portal's awesome. Portal's great.\" Oh, that's the way to go. Yeah. What's your most overrated game of all time? Um, yeah. So, it changes. Sure. Between two titles, but I think the one I'd always go back to cuz like everyone's like, \"Oh, it's the the\" and the Metacritic was so high and all the journals like, \"This game is beautiful. It's fantastic.\" Um, the first Assassin's Creed was not very good. Yeah. Yeah. Did you really like it? No. I always talk about Assassin's Creed 2 is where I came on board. They fixed everything I didn't like. So I agree, right? But the first one I was like I picked up I'm like what is going",
            "start": 1383.28
        },
        {
            "text": "like it? No. I always talk about Assassin's Creed 2 is where I came on board. They fixed everything I didn't like. So I agree, right? But the first one I was like I picked up I'm like what is going on here? And then the other one it was the toughest too because at the time Alex Seropian was running the the Disney games group but it's like it came around and someone's like Halo I'm like I was like yeah exactly, right? I was like I'm like I I I agree and it's like okay I don't know if this is a career limiting move right now. Let's move on. Move on. Yeah. So, um, but yeah, it was a, uh, that's funny. Um, and it's always a great conversation to have when you're interviewing anyone for a game dev job is like favorite game, you know, one that you're stuck on a desert island with. If you're stuck on a desert island, what would be yours? Do I have the like I I don't like replaying games, so that's always the tough part. So, can it be one? I don't understand that. Sorry. That was probably",
            "start": 1425.76
        },
        {
            "text": "stuck on a desert island, what would be yours? Do I have the like I I don't like replaying games, so that's always the tough part. So, can it be one? I don't understand that. Sorry. That was probably peeking. That was great. Kevin did that. Kevin's playing phone games. He Yeah, exactly. I'm playing Candy Crush. Um, what I was going to say is but the platinum trophy on Uncharted which I saw you're about to I mean you have please I have sorry pardon me right but you have to have played it multiple times. Okay. So it's it's certain games. Yeah. For me the platinum trophy is a mark of I love this game and I want to and it's a stupid thing but for me it's like one of those things of I feel like that proves how much I love it. I it's one of those for me to be like it's it's always shorthand I when I meet a developer I loved your game so much I platinumed it and they did you play on my game? No I I barely played Disney answer this in my head like 30 seconds ago I'm like I should ask him",
            "start": 1466.88
        },
        {
            "text": "this is he talking about I know the answer can be **** no but I'm going to ask him anyway. Well, that's what sucks about Disney Infinity ending is like when they when when scoops came out and he had all these things about what may or may not be the next Disney can't confirm or deny it. I was like **** that sounds awesome. Like that sounds like it's getting to where I would actually be really into it cuz my my Disney Infinity thing goes like this. Disney Infinity 1 gets announced and I'm like I'm not a Disney guy. You know what I mean? Like that's cool. Not my kind of thing. That's I mean Chris was the same way like you know **** Disney. They they put Marvel in it for wave 2. I remember at Comic-Con walking by see I was like these figures look awesome. And I went in took the demo and I",
            "start": 1510.16
        },
        {
            "text": "was the same way like you know **** Disney. They they put Marvel in it for wave 2. I remember at Comic-Con walking by see I was like these figures look awesome. And I went in took the demo and I was like okay. And then it came out and Joy Fox hit me up and sent me everything when she when she moved over. Fox. Yeah. If anyone's looking for a great PR person, Joy Fox is a great PR person. 100% game developers. Big fan. Uh Joy Fox. Uh, and I played it and it was I popped it in. I played it and I did a stream for it. I we streamed it on Twitch. Thanks for all the promotion. And uh did you did you hit me up? Probably. Yeah. Well, I mean I probably tweeted you as it was happening. Now you text me by I have your number. I should do not do that. Please do not do that. Uh and yeah, it was just I was like, \"Okay, cool. It's simpler than I wanted it to be, but you know, I can see why this would be fun.\" And my thing was like, you know what? I'm going to play it on Vita. And then the Vita game",
            "start": 1544.4
        },
        {
            "text": "I was like, \"Okay, cool. It's simpler than I wanted it to be, but you know, I can see why this would be fun.\" And my thing was like, you know what? I'm going to play it on Vita. And then the Vita game took forever. And it finally came out. Forever. I'm so sorry. It's okay. It came out and then it was I had to keep the pad with me. Like I could have played on the train. I was hoping I'd be able to tag characters in and then like go. And by the way, I mean, and same type of thing. I mean, as we were going through like, okay, so what's iOS look like for like tablet and phone, like should it have a base, should it not have a base? I mean, all that kind of stuff. We're going through all of that nonsense. And that exact thought was the thing that we were like, uh, but we'll try it with Vita to do it that way. Because Sony actually said, we want it to be console parody, so we want it to be able to be exactly the same way. Even the the toys and the and the figure like the the face, all that",
            "start": 1580.88
        },
        {
            "text": "do it that way. Because Sony actually said, we want it to be console parody, so we want it to be able to be exactly the same way. Even the the toys and the and the figure like the the face, all that stuff. We want to be exactly the same. So that's why we did it that way. But I'm sorry I let you down. You didn't let me down. Well, I mean, you had to carry around. This is the thing. We were always like, what kid's going to want to carry around a near field communicator? Get on the plane, bring down the little tray, everything, right? Yeah. And of course, you're in economy, right? So you're like, but yeah. Yeah. And so then, but then it was like, okay, cool. Let's see what happens next time around. And I remember um, it was uh E3 last you brought by the Star Wars guys and then we did the GameStop Expo and it wasn't you, it was the other gentleman whose name I always forget Matt who Matt with one T. Jerk. He came by and showed the Star Wars stuff and I was like, \"Oh, holy crap.\" Like this",
            "start": 1612.08
        },
        {
            "text": "expo and it wasn't you, it was the other gentleman whose name I always forget Matt who Matt with one T. Jerk. He came by and showed the Star Wars stuff and I was like, \"Oh, holy crap.\" Like this is like a this is a real Star Wars game. It's not just running around doing this kind of thing. Yeah. Yeah. Yeah. It was really cool. I mean, Ninja Theory did a great job with everything they did with the um with all the combat with Star Wars. And then Studio Gobo did the Rise Against the Empire Play Set, which is the classic trilogy stuff. It was actually funny in the beginning when we had brought those guys together, Ninja Theory wanted to do all of the classic trilogy stuff and Gobo was okay doing all of the um uh what they called like the prequel Episodes I through III. And then we were like, uh but by the way, like the Episodes I through III are all about lightsaber combat and IV through VI are kind of all about vehicles and exploration. And like Ninja Theory, you guys are good at like",
            "start": 1651.36
        },
        {
            "text": "by the way, like the Episodes I through III are all about lightsaber combat and IV through VI are kind of all about vehicles and exploration. And like Ninja Theory, you guys are good at like lightsaber combat. When you look at like what you just did with DMC and what you've done with Heavenly Sword and like Gobo, I mean, you guys are all ex um Black Rock that did Split/Second and obviously have have some knowledge here of how awesome uh vehicle speeds. Yeah, exactly. And so um, we actually had to have a huge kind of huge but it was it was fun like you know exchange between the two groups of like we all met together and had drinks around dinner and talked about why this makes sense and everyone agreed but yeah there was a huge switch of developers um halfway through that and there are so many great stories like that one day I mean I always say this about the Pirates of the Caribbean stuff when I can one day tell all the stories um I think there are stories that people would",
            "start": 1692.08
        },
        {
            "text": "are so many great stories like that one day I mean I always say this about the Pirates of the Caribbean stuff when I can one day tell all the stories um I think there are stories that people would find so compelling someday um to here and like not naming names or whatever, but just like the stuff that we went through. Sure. In order to bring this thing together because it's the first property where Disney actually had all the characters merged together. Yeah. And um and multiple acquisitions happen during that and we had a lot of conversations with a lot of people about how their characters need to be treated and why and understanding what their franchises are and even some characters are so big that their franchises as well. And so just the the amount of knowledge that I have in my head and fun stories that we had along the way is something I'd love to be able to share someday. When you can't come here, don't go to Jeff Gerstmann. He doesn't care. Don't he just wants to be funny and",
            "start": 1734.56
        },
        {
            "text": "and fun stories that we had along the way is something I'd love to be able to share someday. When you can't come here, don't go to Jeff Gerstmann. He doesn't care. Don't he just wants to be funny and make fun of I would say or the New York Times. Go somewhere. Yeah. So then when it's all ending, do you find out about it like a day before we all do? I haven't. If you can answer that question, I'm not trying to I don't want to get you in trouble. I'm noticing. Yeah. No, it's it's not even that. I um I uh yeah I I probably can't that's fine. Okay. I mean I can't Here's what I can tell you. Um I I'll tell you about me just personally. Sure. Um and something that I went through and this is very personal. I can't sharing it right now. I have actually really great things going on in my personal life. And that's great. Whenever like everyone talks about like how's work versus how's personal like personal right now for me is is 98% like things are wonderful, right? And then 2% is work stuff. And",
            "start": 1776.96
        },
        {
            "text": "And that's great. Whenever like everyone talks about like how's work versus how's personal like personal right now for me is is 98% like things are wonderful, right? And then 2% is work stuff. And and work stuff was was really tough because I would have to go out and have conversations with people even though I knew certain things were happening in the background. Sure. And um so it was very tough for me to go out and still put a smile on my face and act like everything's okay. And even though I knew, you know, we were having conversations in the background, now um it's uh it's that was a listen to me, like as a man and as a as a guy in the in the game industry, right? It just it was um it was a life lesson for me. Yeah. Um and I always tried and and still try, of course, to do right by everybody. Sure. And um there's a lot of different people that you have to uh answer to whether it's corporate or or even you know yourself talking about yourself or or the people that you represent.",
            "start": 1822.8
        },
        {
            "text": "everybody. Sure. And um there's a lot of different people that you have to uh answer to whether it's corporate or or even you know yourself talking about yourself or or the people that you represent. So it was uh a really tough moment and one of the things actually that um was touching to me was when the announcement did come out some of our biggest fans in the community were like we could tell there was something wrong with Johnny V. Yeah. um just because you just you didn't you didn't you didn't have the spark. You weren't communicating the same way. Um things were dark about what was happening and um it was actually wild to me to notice that or to have people notice that that was happening. Yeah. And so um it meant a lot to me and then things like you know the other night when when when people have said that and just right now the amount of like outreach I mean yourself and and you know all the best friends out there everybody it's like uh it's it means so much. Um, and you know",
            "start": 1875.76
        },
        {
            "text": "people have said that and just right now the amount of like outreach I mean yourself and and you know all the best friends out there everybody it's like uh it's it means so much. Um, and you know, I'm just one guy, right? Remember that there's a whole bunch of other people that are impacted as well. And those people need support and love, too. And so, I just um like thank you, by the way. I mean, if I can just I get to say it real publicly right now. So, like, thank you. Um, thank you guys and everyone that's that's done anything for myself or anybody else that's um worked on this project because yeah, it really sucks. Um, I don't think that we were done by any stretch of the imagination, but it is what it is. we'll move on and hopefully whatever the next thing is is even better and even more cool. Well, that's the thing I mean I'm talking about where you know I you have no problem getting a job, landing on your feet and doing all these different things and on top of the fact that",
            "start": 1921.68
        },
        {
            "text": "more cool. Well, that's the thing I mean I'm talking about where you know I you have no problem getting a job, landing on your feet and doing all these different things and on top of the fact that you're awesome is like the community you built is going to follow you. You know what I Like the Disney Infinity community always astounded me and like they were they are fantastic individuals, fantastic people who had websites that were breaking things before any of the major that was I always talk about it now and I bring up all the time when I'm talking about BrickInq.com, right? And like how that's not a site I go to all the time but that they started with you know their Skylanders thing and their Disney thing and I remember that was the first time I really understood or had a great example I think when they leaked when they leaked uh wave two or whatever the hell it was. Um not them but like the the community of fans and I was like, \"Oh, right.\" Like, there are people and sites so",
            "start": 1965.04
        },
        {
            "text": "I think when they leaked when they leaked uh wave two or whatever the hell it was. Um not them but like the the community of fans and I was like \"Oh, right.\" Like, there are people and sites so dedicated to these games, these genres that they're able then to go in and get all these things that they have businesses they built off, right? I know. I know. I know. And so to get in there and get all this stuff and really go in and own a conversation and be be able to do stuff that IGN and GameSpot can't do. It's uh I'll tell you right now like the hardest thing that's happening is not slipping into like super sadness mode. Yeah. Because at the same time myself and a lot of the the other exec leadership on the team feel like we let down a lot of people. You didn't let anybody down. That's not how it like like that's how you feel. Yeah. Like but whatever. Pick up the pieces. Whatever. Other people are here and hopefully are going to have more fun. No, they're they're going to have just",
            "start": 2001.92
        },
        {
            "text": "not how it like like that's how you feel. Yeah. Like but whatever. Pick up the pieces. Whatever. Other people are here and hopefully are going to have more fun. No, they're they're going to have just they're going to almost cry, too. It'll be fine. Almost cry. Yeah, you were almost funny. No, I'm not going to cry. You want to end on You want to end on a happy note? Why is your personal life so great? Cuz I'm dating this really cute girl. She's right over there. You come over here and say hi. Come hug him on camera and then we'll end it that way. So, this is Colette Michelle Bar. So, I met her while I was on the road. She was writing for uh Nintendo Magazine. Now, she works for uh Square Enix. And um yeah, she's awesome. She's based in London, so it's a longdistance relationship. Holy **** **** That's really tough, man. That's really tough. But that's a that was a dumb move. Why? Falling in love with a girl in London. Good lord. Here's the deal. Like, here's the deal, Greg.",
            "start": 2039.76
        },
        {
            "text": "**** **** That's really tough, man. That's really tough. But that's a that was a dumb move. Why? Falling in love with a girl in London. Good lord. Here's the deal. Like, here's the deal, Greg. Whatever. So, here's what I'll tell you about this. Is the person that you're going to be in love with forever for the rest of your life? Are they really from your hometown or are they in fact on the other side of the world? I don't know yet. Oh, I'll have to find out. Well, I found my in London. A lot of great birds there. Birds. I love it. You're using London text. That's London talk. That's London talk. Ladies and gentlemen, this is John Vignocchi. You should all follow him on Twitter to keep up to date on where he's going next. You should not look for Dave Lang's phone number on the internet. You should continue to support John and everything he does because John's one of the best human beings I know and I love him quite dude. No problem. That's really nice. Sorry, I'm I'm sweaty, too. It's",
            "start": 2079.28
        },
        {
            "text": "should continue to support John and everything he does because John's one of the best human beings I know and I love him quite dude. No problem. That's really nice. Sorry, I'm I'm sweaty, too. It's It all just merges together now. Don't worry about it. Look how sweaty. Holy **** **** John. Why? Why even wear the **** dark shirt? I know what your strategy was. No. Have you heard Have you seen Have you seen these Anthony Carbon armpit diapers? No. Oh, I'll show them to you with the camera. He's got these armpit diapers. uh put in your shirt. They're not going to help your chest. I was doing interviews like I had like job interviews today, so I was trying to look presentable. Yeah. Um just don't open your coat. You're fine. What's going on? Anyway, sorry. Thank you for all the nice things you said and thank you for everyone for watching as long as you did. Ladies and gentlemen, like, subscribe, share, and keep coming back for all E3 content. Until next time, it's been our pleasure",
            "start": 2120.4
        },
        {
            "text": "you said and thank you for everyone for watching as long as you did. Ladies and gentlemen, like, subscribe, share, and keep coming back for all E3 content. Until next time, it's been our pleasure to serve you.",
            "start": 2155.92
        }
    ]
}