{
    "id": 1832,
    "video_id": "SPZxL-CLz4w",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Crash Bandicoot Remastered! - Kinda Funny Reacts E3 2016",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nTim and Greg react to Crash Bandicoot Remastered! We did it!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1465930830,
    "duration": 219,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening, Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. What's up everybody? Welcome another Kinda Funny Reacts to E3 2016. I'm one of your hosts, Greg Miller, alongside the one and only pure one, Tim Gettys. It happened, we saved the Bandicoot. Here's the thing, there's a trailer playing behind us. This is some Skylanders stuff. There's been rumors of this and I was like, \"Please don't do this to me. Please, after all of my life of wanting Crash Bandicoot to come back in the right way, don't, don't do it like this. Don't give me something I don't want. Don't give me these little toys. No, no, no, no. I want Crash. I want Crash to be back.\" And Crash is back! Remastered Crash One, Crash Two: Cortex Strikes Back, Crash Three: Warped, all being remastered. He said from the ground up. He said that. Great. That's what Shawn said. He said that. What Shawn? So we're not talking just like remastered Uprising. No, from the",
            "start": 0.16
        },
        {
            "text": "Back, Crash Three: Warped, all being remastered. He said from the ground up. He said that. Great. That's what Shawn said. He said that. What Shawn? So we're not talking just like remastered Uprising. No, from the ground up, the three Crash games that matter. What do you think ground up means? I don't know. I mean, if, if it means that they're going to treat it like they did in Uncharted and like kind of get the gameplay updated just a bit, you know, the physics and stuff so it's not as stiff using the D-pad and where just walking over edges and like totally sold on that. Graphics, do whatever you want. He looks a little stupid in the, the Skylanders. He looks good in the Skylanders. One thing people are really hating on him for looking like really stupid. I don't think he looks that stupid. He looks Skylanders. He's in the world of Skylanders, but that's classic Crash. We don't see there. Do you see a travel tattoo? I don't. They did it, Greg. They did it. They did it for me, Shawn. I believed in him. I believed in him. Yeah, and he",
            "start": 39.76
        },
        {
            "text": "world of Skylanders, but that's classic Crash. We don't see there. Do you see a travel tattoo? I don't. They did it, Greg. They did it. They did it for me, Shawn. I believed in him. I believed in him. Yeah, and he tweeted and then he tweeted a little heart at me 'cause he knows. Yeah, he knew. He knew how much this meant to you. This means a lot to me. I can't believe it happened. I seriously cannot believe this. I love how every time it's the music that set you off and like, I just don't know the music and they had that crowd shot, the music like, \"What?\" And then he turned around and Shawn Layden was walking out. He had the shadow cast behind him of Crash and, and you thought first you got really excited and then you thought it was just going to be this and then he came back and said, \"We talked to Activision.\" Oh my God. I mean, this is so exciting to me. I was literally shaking. We're going to break out, going to break out the reaction. Oh my God, I was so, so, so excited that I couldn't even like pay attention to it. I'm a little",
            "start": 81.4
        },
        {
            "text": "this is so exciting to me. I was literally shaking. We're going to break out, going to break out the reaction. Oh my God, I was so, so, so excited that I couldn't even like pay attention to it. I'm a little disappointed we didn't get a trailer of the, of the, the remastered things, but whatever. I get they want to focus on this and push. You imagine the re, the remastered things aren't there yet. You know what I mean? They're not. They, I saw a press release 2017. I was going to say the ink is probably just drying on the contract now, but oh my God, it's happening. And I like this. I think this is such a good step forward because this is giving Crash a shot. I honestly believe this is the best foot forward. Like a lot of people are upset that we didn't get a real Crash game. They think this is being like dripping you out of it. No, no, no, no. I think this is good. Getting a new Crash game, I don't think it could live up to it. I think no matter what, it would look stupid and they, they would be better than the original.",
            "start": 116.52
        },
        {
            "text": "out of it. No, no, no, no. I think this is good. Getting a new Crash game, I don't think it could live up to it. I think no matter what, it would look stupid and they, they would be better than the original and show you that the original games weren't that good. I think they would do something wrong, but this, this gives the shot of actually giving the originals a, a nice new coat of paint. Give it to the new generation of kids out there. See if they latch on to it and grab onto it the same way I did and hopefully then they can kind of make a, make a new one and see and then that could be good or bad, whatever. I don't even care at this point. I'm getting what I wanted. I wanted this. Yeah, and I never thought I would get it. PS1 games being from the ground up, ladies and gentlemen. From the ground up, ladies and gentlemen. What do you think of Crash Bandicoot being back? #TheBandicootIsSaved. Let us know in the comments below. Share this video with your friends and keep coming back all E3 long 'cause let me tell you,",
            "start": 153.84
        },
        {
            "text": "what do you think of Crash Bandicoot being back? #TheBandicootIsSaved. Let us know in the comments below. Share this video with your friends and keep coming back all E3 long 'cause let me tell you, we have crazy planned. We did it, guys. We did it. Thank you. Now, before you cut, would you like to eat anything else loud? You want to crinkle some more bags? I'm sure those got picked up on the microphones. You over there crunching on your Hot Cheeto.",
            "start": 193.76
        }
    ]
}