{
    "id": 1822,
    "video_id": "WxhzqfI1fq8",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "South Park! Ubisoft Press Conference Reactions! - Kinda Funny Gamescast E3 2016",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nAll the biggest Ubisoft news of E3 2016! South Park, Steep, Ghost Recon Wildlands!\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1465857331,
    "duration": 1051,
    "transcript_chunks": [
        {
            "text": "Kinda Funny is going all out with Let's Plays and reaction videos all week long. Subscribe now at youtube.com/KindaFunnyGames to not miss a thing. Welcome to the first ever Ubisoft E3 2016 Kinda Funny Gamescast analysis breakdown thingamajig. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Sweet merciful Jesus, two **** hours and I'm looking at my notes. They announced so much. There's so fewer announcements than Xbox. Xbox was this tight show. They had less somehow, but they made more of it and Ubisoft talked forever. My God, it's crazy. My first note is Ubisoft Aisha killing it. Very nice flow. I take it all back. Well, not the the Aisha thing that could stay, but the nice flow. Good Lord, lost it. The first third of the conference, no, maybe not third. It was pretty long. The first like eighth of the conference, everything everything up until VR was okay, okay, okay. Even with the dance number, yeah, like all right, stupid, but you got dance and you're",
            "start": 0.0
        },
        {
            "text": "third. It was pretty long. The first like eighth of the conference, everything everything up until VR was okay, okay, okay. Even with the dance number, yeah, like all right, stupid, but you got dance and you're doing something goofy and you have a giraffe nodding along with a very somber statement, man. And then it was like Wildlands, okay, this game actually looks cool. South Park, thank **** God, yes. Matt and Trey are entertaining. Talk at length. Show me your new combat system. Awesome. Division Underground, great. And then it was like, and here comes Palmer Luckey in VR and Eagle Flight. I was like, all right, let's just get in. Oh, we're going to we're going to play it on stage. Should just fell apart at that point. We're going to play it on stage and we're not just going to do one goal. We're going to play an entire match of this ****. Oh Jesus **** thing about this is that Ubisoft has the goods for the most part, for sure. Yeah, um, they're a great publisher. That's what I said on Twitter. I was just like, I can't",
            "start": 51.4
        },
        {
            "text": "match of this ****. Oh Jesus **** thing about this is that Ubisoft has the goods for the most part, for sure. Yeah, um, they're a great publisher. That's what I said on Twitter. I was just like, I can't believe this is going on and on and on. Just wrap it up already. I mean, I look at I look at these and I'm like, you don't need Just Dance at this conference. That that is this is not your audience. Eagle Flight shouldn't have been here. Star Trek shouldn't have been here. Grow Up didn't need to be here. Trials of the Blood Dragon didn't need to be here. Assassin's Creed movie didn't need to be here. They literally could have if it was Ghost Recon, South Park, The Division, For Honor, Watch Dogs, and Steep, that would have been a **** really tight hour-long show. The thing about it, the stuff you knocked off, I don't think needs to be knocked off, just totally cut down. Just Dance needs to be here. This is what we talk about E3. It is USA Today in the audience and what they're going to talk and Just Dance ****",
            "start": 85.84
        },
        {
            "text": "think needs to be knocked off, just totally cut down. Just Dance needs to be here. This is what we talk about E3. It is USA Today in the audience and what they're going to talk and Just Dance **** moves units like nobody's goddamn business. But I mean like the sit down talks with everybody did not need to happen when you're for the good stuff. For Honor, right? Like For Honor was like a media darling last year. Everybody thought it was great. Even that came out and just went on **** forever. This huge trailer for about it trying to set up this story over the and then we get out into the actual gameplay and even the game the gameplay is doing that thing where it jumps ahead. Now we go here and and what's disappointing like just to reiterate what I said is like, man, Ghost Recon Wildlands looks **** rad. For Honor looks great. Uh obviously Watch Dogs looks like a huge step in the right direction. That typical Ubisoft, let's make it better on the second try. Yeah, as all do, but we all often",
            "start": 124.4
        },
        {
            "text": "**** rad. For Honor looks great. Uh obviously Watch Dogs looks like a huge step in the right direction. That typical Ubisoft, let's make it better on the second try. Yeah, as all do, but we all often refer to Assassin's Creed to Assassin's Creed. Steep isn't for me. I'm interested to see how that game does, but it's super pretty and it's it's really quite interesting that they they were excited to announce it at the end. I mean, I I uh I'll be interested to see like what everyone's you know take is on that because it just doesn't seem like this is a like they are talking about this game like it's going to be a huge game for them. I just don't see that happening. No, that that I honestly I do not think that look good at all. I mean, I like Esports stuff like that. Like I like snowboarding games and that doesn't look fun. That look like a really dumb down version of a snowboarding game because there's also skiing, there's also Wingsuits, there's also this and it's like that's not fun and like the",
            "start": 158.8
        },
        {
            "text": "that doesn't look fun. That look like a really dumb down version of a snowboarding game because there's also skiing, there's also Wingsuits, there's also this and it's like that's not fun and like the Trials of the Blood Dragon, right? That's a cool. Everybody loves Trials. Everybody loves Blood Dragon, but even their in their entrance was too long. It's like, let's have them come out from the sides, do it, get to the point real quick because when they were like, I did Trials and I'm the king of I did Blood Dragon. I was like, okay, are you making a oh, you're combining your games. Okay, that's cool. But like, yeah, why don't we just punch you in the face and tell you about it? Why don't we just give you the **** Goods right away? I mean, even the South Park stuff, which was fantastic. My God, why was it so long? It was really long. There was like four every single segment had like four segments. Yeah, in this entire press conference. Yeah, I think that yeah, that was the thing that was really I mean, Watch Dogs, they really like",
            "start": 192.12
        },
        {
            "text": "long. There was like four every single segment had like four segments. Yeah, in this entire press conference. Yeah, I think that yeah, that was the thing that was really I mean, Watch Dogs, they really like just went on and on with Watch Dogs especially. I'm like, you already announced this game. Show us something new. Show us five minutes or whatever. They like, I really don't feel like regard like regardless of what the game is at an E3 press conference, there should be a rule that you can spend no more than five minutes on it. God, like I don't care what the game is. I don't care if it's a huge Fallout 4 type announcement or anything like just move on because like leave people wanting a little bit more. Like you're you're leaving everyone like like I was ex I'm exhausted watching that. Like that's that's my whole thing. It's like just five minutes, three minutes, four minutes, like just move on and keep it going. I'll tell you, man, Microsoft nailed the like you said, nailed the pacing. **** had it. Um and",
            "start": 225.76
        },
        {
            "text": "thing. It's like just five minutes, three minutes, four minutes, like just move on and keep it going. I'll tell you, man, Microsoft nailed the like you said, nailed the pacing. **** had it. Um and and they did so much more, but it felt so much better and so much faster and so much more exciting and not just because Phil Spencer is a good-looking fella. I mean, I I do want to give a shout out to Aisha though. Like I do. I think that having somebody like that crack the jokes and actually understand what the hell is going on really does help with everything. It just was way too drawn out and and whatever like the the interviews were so unnecessary. Like the Star Trek thing, cool. We don't need to talk to LeVar Burton about it. Yeah, I know. Like that's the thing. You had a polished package of them all talking about it. Great. Why did we watch that just to have LeVar come out and say it all again? Yeah, and then the movie thing. It's just like, I understand the movie being there. Like whether or not I'm excited",
            "start": 258.68
        },
        {
            "text": "about it. Great. Why did we watch that just to have LeVar come out and say it all again? Yeah, and then the movie thing. It's just like, I understand the movie being there. Like whether or not I'm excited for the movie, like I understand it being there. Show a trailer, show a snippet. Yeah, even the the package they made was semi, you know, exciting. But it's like just show that. Don't bring out the guy that's how is making a movie. Well, you put a camera down and you do things. No one's interested in that. Literally nobody. I don't understand who that serves. You know, Nick Scarpino only and he wasn't here to enjoy it. No, he does not like that stuff. Stupid. It's it's it's a little much. Like the you got to tighten these things up a little bit. And and that again, that's what's disappointing. Like EA for instance, was an hour or so and they really had nothing to show and that conference sucked, right? Yeah, that's the disappointing thing with Ubisoft is they had a lot to show, a lot of great games. I really do think",
            "start": 298.32
        },
        {
            "text": "an hour or so and they really had nothing to show and that conference sucked, right? Yeah, that's the disappointing thing with Ubisoft is they had a lot to show, a lot of great games. I really do think Ubisoft is one of the great publishers in the industry. Um and I play quite a few of their games and I'm looking forward to quite a few of these games as well. Ghost Recon looks awesome. South Park, I'm all over South Park. **** yes. Um and I Platinum The Stick of Truth on uh on PS3 and I'm thinking about doing it on PS4 because it's just so fun. That game is just so fun. It's a great weekend experience. Um so like they do have the goods. For Honor, you nailed it. Like really does remind me of Ryse a lot. The more you watch that, a **** happening. Uh that's exactly what I thought of before you even said it. In my mind, I was like, this looks exactly like what they were trying to do with Ryse. But um you know, yeah, like Tim's right. The Assassin's Creed movie needed to be there, I guess, or whatever. This conference",
            "start": 334.04
        },
        {
            "text": "my mind, I was like, this looks exactly like what they were trying to do with Ryse. But um you know, yeah, like Tim's right. The Assassin's Creed movie needed to be there, I guess, or whatever. This conference could have been an hour long. Oh my God, it's a good showing of games. It's a bad press conference. You know, like all the stuff here, I think that they they had a nice breadth of content there. Like a lot different types of games, a lot of different genres and stuff. And like gave us a lot of what what people need. Like people needed an update on The Division. You know what I mean? Even that's fine. I mean, I I I was interested to hear about that. You know, I I dumped quite a lot of time in The Division, surprising amount of time for a game I didn't really quite know it was going to resonate with me. Like over 40 hours, which is why I'm so excited about Ghost Recon because it's it's I you can play it by yourself and I enjoyed playing The Division by myself. So I was excited to see the update. It didn't really do",
            "start": 370.8
        },
        {
            "text": "hours, which is why I'm so excited about Ghost Recon because it's it's I you can play it by yourself and I enjoyed playing The Division by myself. So I was excited to see the update. It didn't really do anything for me. But yeah, like little snippets like that that are 90 seconds or two minutes long, get in and out. Yeah, make some announcements and bounce. So going through chronologically, they start off Just Dance 2017. The most exciting thing there, NX. They talk about it. X going to give it to you. So that's cool. Uh then they went to Ghost Recon Wildlands, which does look super awesome. Like I liked the the single player aspects of it look really really dope. Um you you can play entirely solo, they confirm. So the Colins of the world out there are going to be super super happy. The largest open world that Ubisoft has ever made. So cool. It looked really nice. It looked like a mash up of the third person, you know, of The Division mashed up with the open world Far Cry kind of stuff or even Just Cause. Yeah, um I",
            "start": 403.4
        },
        {
            "text": "has ever made. So cool. It looked really nice. It looked like a mash up of the third person, you know, of The Division mashed up with the open world Far Cry kind of stuff or even Just Cause. Yeah, um I was definitely getting Metal Gear Solid V vibes from specifically from the the helicopter going from section to section, even just kind of like the the motion and stuff. But definitely looks cool. Um March 7th, 2017. Then they went to South Park: The Fractured But Whole. Uh Trey Parker, Matt Stone came out. It's uh based on superheroes, Civil War specifically this time. Um if you get it, you get The Stick of Truth on PS4 and Xbox One for free now. Now December 6th, 2016. If you buy it now, you get sick. Yeah, yeah, right. You have to get it right now because we didn't expect it to come out this early. No, I I I didn't. Um considering how long the last one had taken, but that was really in Publisher hell for a long time and stuff like that. I mean, there was a lot of complications. Um so yeah, I'm",
            "start": 441.52
        },
        {
            "text": "early. No, I I I didn't. Um considering how long the last one had taken, but that was really in Publisher hell for a long time and stuff like that. I mean, there was a lot of complications. Um so yeah, I'm super St I mean, that's definitely one of my most anticipated game. Looks fantastic by the way. Yep. I like the combat stuff there. It's like almost like a strategy RPG small grid. It's pretty cool. Yeah. Um I think that was my favorite trailer so far from E3 was the the final trailer show. So funny. Like they they just topical humor in there. Um then Division, they talked about the Underground expansion coming June 8th or in August, August 2nd for PS4 users. Um there's also Ghost Recon, Rainbow Six and Splinter Cell costumes. You have to be a club. I am. Don't worry. Uh Survival expansion trailer. It's going to be the next Division thing that uh looks cool, I guess. Yeah, well, yeah, it didn't give off too much. You know, you're going to get beat up by bad guys and your guys will save you. Okay, then they got into the the",
            "start": 486.28
        },
        {
            "text": "next Division thing that uh looks cool, I guess. Yeah, well, yeah, it didn't give off too much. You know, you're going to get beat up by bad guys and your guys will save you. Okay, then they got into the the whole VR section. They they led with Eagle Flight. Eagle Flight. Eagle Flight. Yeah, the game game is probably going to be pretty cool, but it's not. Yeah, I just that's why I cut everything VR out. It's just doesn't show well. Hard. I'll give them credit that they had multiple people playing with VR on stage and it didn't totally **** up. Like it wasn't entertaining to watch, but at least the VR didn't **** up because so far I don't think we've ever really had any successful VR stories on stage. So credit to them for that. Uh but yeah, it was really confusing and hard to follow what exactly was happening and and uh again like VR, man. So it's expensive for you, but these multiplayer experiences that's like going to be even even harder to get four VRs, bring them over to the house. Um then they showed",
            "start": 529.48
        },
        {
            "text": "and and uh again like VR, man. So it's expensive for you, but these multiplayer experiences that's like going to be even even harder to get four VRs, bring them over to the house. Um then they showed the Star Trek, the Star Trek: Bridge Crew. I thought that looked awesome, but again, way too expensive. But so such a cool idea. It's a great idea. But I I was actually aesthetically, I was like, yes, game looks bad. Basic. Really bad. Not I mean, I mean, not everything looks bad. I mean, like I I to me it's yeah, I was like, I was actually shocked by the character models especially like yikes. VR games to me always they they look like it's like, okay, you get to be in a world where you're playing a PS2 through emulation. Everything's up-resed, you know, everything just looks that way where it's just like, it's not quite right. So until they they figure that stuff out, what it's the game though of like, all right, so what is the game? Well, the game's going to be like the like I was saying earlier, the iOS games where it's like that",
            "start": 568.16
        },
        {
            "text": "until they they figure that stuff out, what it's the game though of like, all right, so what is the game? Well, the game's going to be like the like I was saying earlier, the iOS games where it's like that you work as like the space team and everyone sits around a table and yells controls at each other. Sure. So is it just going into the same battle over and over again? Klingons coming from over here. I'm sure it'll be a couple different ones, but it'll it'll just be more like randomly generated commands and stuff you have to do in specific orders. Okay, so like work together as a team. Um then the show the For Honor story trailer, which actually looks pretty cool. No, For Honor looks cool. I don't know if it's a game for me necessarily. I wasn't really sold on the gameplay. Like I thought the trailer was a lot cooler than than the game. Sure. I agree with that. But people have been into it from the yeah, well, that's the thing though. People it's like, you know, an educated sword fighting game. It's not mash",
            "start": 612.12
        },
        {
            "text": "a lot cooler than the game. Sure. I agree with that. But people have been into it from the yeah, well, that's the thing though. People it's like, you know, an educated sword fighting game. It's not mash buttons. It is like what what's he's about throw this attack, counter this way, then get back in there. Mhm. That that slower pace of I was really impressed by the death animations. I said that earlier that you like people **** up. I haven't really seen a game where people look like they get hit realistically and fall, you know, usually they all fly around like they they're weightless. But this had a nice weight to it where when people got hit, they just went straight down. Um I appreciate that. Uh February 14th, 2017 for that guy. Very romantic. Uh Grow Up, the sequel to Grow Home coming this August. Trials of the Blood Dragon. That's all we have to say about it. Yeah, another thing that went on way too long that could have been a really that could been I didn't play. I didn't even know that it was big enough",
            "start": 647.92
        },
        {
            "text": "the Blood Dragon. That's all we have to say about it. Yeah, another thing that went on way too long that could have been a really that could been I didn't play. I didn't even know that it was big enough to get a that could be a really cool thing of just like, hey, we're excited that we had this hit with Grow Home. Now we're bringing you Grow Up. Here's a here's a 30 second trailer off **** stage. Not come out there and talk. Trials of the Blood Dragon. I thought it was cool. I'm always a big fan of the available right now type deal. So that's interesting. Uh Trials was awesome. Blood Dragon is awesome. Combining those two, don't know how the hell that's going to work, but awesome. The trailer looked really cool. Um then they did the Assassin's Creed movie bit, which was **** boring as all ****. It's like, man, if you guys are going to talk about a movie that has cool action scenes, that's not how you sell it to people. Here's some behind the scenes of them filming the things you've seen in the trailer and here's",
            "start": 690.04
        },
        {
            "text": "guys are going to talk about a movie that has cool action scenes, that's not how you sell it to people. Here's some behind the scenes of them filming the things you've seen in the trailer and here's the trailer again. It's like, oh my God, come on. Um and then Watch Dogs forever. They just went on with that. Um I am completely impressed with their San Francisco. Um and that alone sells me on the game about the though the the thing about the gameplay is I think that uh the latter half of the demo, I'm like, uh this isn't fun to watch, but I think it'd be fun to play. Mhm. Um I think in context, like once you actually understand all the systems and stuff and you can actually play it a little bit faster, I think it'll be pretty cool. It'll be interesting because like it looking at I was like, oh this still looks like the Watch Dogs gameplay stuff that turned me off before of just like coming in and trying to figure out how to hack and what to do going back to it. The Drone part totally not into that. I thought it",
            "start": 726.48
        },
        {
            "text": "the Watch Dogs gameplay stuff that turned me off before of just like coming in and trying to figure out how to hack and what to do going back to it. The Drone part totally not into that. I thought it was uh super super slow. I I don't like that. I kind of just want to go in and just kind of play it a little bit more Acy. But um we'll see. It is coming November 15th, 2016. We knew that. Big fan of the soundtrack. We got Eric B. & Rakim. We got Run the Jewels. Awesome. Super **** awesome. PS4 players going to get all the DLC 30 days early. Yep. There's a Watch Dogs movie, which I guess is a thing. I'm sure they announced that, but just like all video game movies, things get announced. Who knows when's that actually going to happen? But the fact that they talked about the conference, I guess we see. Yeah, we'll see. That was weird. Understand why that like what that had to do with Jim Ryan and like what it was a Sony Pictures thing. Yeah, but he's not like that. Like he's not has nothing to do with Sony Pictures. So like",
            "start": 764.4
        },
        {
            "text": "was weird. Understand why that like what that had to do with Jim Ryan and like what it was a Sony Pictures thing. Yeah, but he's not like that. Like he's not has nothing to do with Sony Pictures. So like he's the head of PlayStation Europe. So it's like I I I was like so confused. I'm like, what the hell is like this? Why is this being announced here by Jim Ryan? Like what when you think big movie announcements, you think Big Jim Ryan. Big old Jim Ryan. Big old Jim Ryan out there going to give you some announcements. Jim going to give it to you. Um then that was quite the the you took a deep breath there. Yeah, there's a lot going on right now. New IP Steep to close out the show. He's dying. It's pretty much GoPro the game. Um if GoPro and Red Bull **** and made a game, it'd be this. It's Action Sports in a fully explorable open world coming in December. I was hoping more than anything that we would just get a rewind effect at the end of it and they'd announced Prince of Persia and they're just like, no, we",
            "start": 808.4
        },
        {
            "text": "explorable open world coming in December. I was hoping more than anything that we would just get a rewind effect at the end of it and they'd announced Prince of Persia and they're just like, no, we **** up. That's not happening. We're giving it to Prince of Persia. They didn't that happened. It's coming in December. I'm really down on it. I mean, it's I mean, it's just not I mean, I know that game's not for me. So I said on the show, it looked like a tech demo of like, oh, look at how you can do this and you can glide here and like I don't understand how what the narrative thread to that of making you go to do these different challenges are going to be. I was just more shocked that they closed with it. Yeah, I know that they always like to announce something new. You know, Watch Dogs for instance, was the first next-gen game we had ever seen and that was done at a Ubisoft conference at the end. But um the original Watch Dogs, but like they ended with that and I was like, this is cool. I'm sure this is going to",
            "start": 854.4
        },
        {
            "text": "next-gen game we had ever seen and that was done at a Ubisoft conference at the end. But um the original Watch Dogs, but like they ended with that and I was like, this is cool. I'm sure this is going to appeal. I'd be interested to see how this appeals to extreme sports fans and you know, you know, uh like more like winter sports kind of people. But um it it's not for me, but I was just so shocked that they actually ended with that. I didn't anticipate that that was going to be their big new IP. But it is totally to their credit. It's very different than what what I mean in many ways than what what they are known for. So they have a lot of guns and shooty bits, you know, like I think it's cool that they have something a little different to their to their credit. Although one of their biggest games is Just Dance, which has nothing to do shooting as well. Um but I think I mean overall, if we can just remove ourselves from the um the conference itself, which I think drag I we all agreed was way too long.",
            "start": 888.32
        },
        {
            "text": "Just Dance, which has nothing to do shooting as well. Um but I think I mean overall, if we can just remove ourselves from the um the conference itself, which I think drag I we all agreed was way too long, dragged on. The cool thing about it was uh just some of the games that I think are really worth being excited about. And I I really think like Ghost Recon, even though it was that heavily scripted, these guys were kind of like role playing almost. No, I don't know that anyone really plays like that. Um it the game looks really **** cool. Uh really really like a lot like that going be a lot of fun. I'm looking forward to playing that. South Park obviously looked fantastic. Um and can't wait to play that as well. And For Honor, I'm super intrigued by. Don't know that it's a game that's ultimately going to speak to me, but I'm paying attention to it. It's certainly on my radar. And Watch Dogs too. I I I I'll mess around with even though I wasn't didn't the original Watch Dogs in the appeal me. Everything else I",
            "start": 921.52
        },
        {
            "text": "speak to me but I'm paying attention to it it's certainly on my radar and Watch Dogs 2 I I I I'll mess around with even though I wasn't didn't the original Watch Dogs appeal to me everything else I can kind of you know leave and be totally fun I mean on paper it's a good it's a good conference but at two hours that's insane it should have been an hour long and force cuts and not all these interviews and you would have had something that really sang and everybody would say have a different tune right now yeah Wildlands looks great Star Wars looks great The Division's cool Eagle Flight like Star Trek could be a fun thing of getting out there doing it Star Trek could be fun getting out there do For Honor if it's your kind of **** sure grow up same thing Trials is awesome so why wouldn't Trials of the Blood Dragon be awesome good luck for the movie Watch Dogs great here's this action sports game yeah where you can look at the mountains that's how he ended it and also it's important that you",
            "start": 959.56
        },
        {
            "text": "Blood Dragon be awesome good luck for the movie Watch Dogs great here's this action sports game yeah where you can look at the mountains that's how he ended it and also it's important that you look at the mountains yeah yeah it kind of sucks cuz I I want to I want to say shout out to Ubisoft though for like for really bringing the heat it's just they delivered it in a weird way but um good job on them just for they got a lot of cool **** coming so congrats ladies and gentlemen this has been Kinda Funny Gamescast stay tuned right here on Twitch.tv/KindaFunnyGames for the Sony press conference which will be at Kevin or somebody please help me out it's uh 5:30 p.m. Pacific time there is when we'll be back and then the conference starts at 6:00 and we'll obviously be hosting it just like we do with Ubisoft and that's when shit's going to get **** real so be there post show and also YouTube.com/KindaFunnyGames go subscribe there for a whole bunch of trailer breakdowns E3",
            "start": 992.28
        }
    ]
}