{
    "id": 1880,
    "video_id": "X8os8ANM-qY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What We Thought Of Zelda - Kinda Funny Gamescast Ep. 74 (Pt. 2)",
    "description": "We all played Zelda Breath of the Wild.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467118801,
    "duration": 1081,
    "transcript_chunks": [
        {
            "text": "next up I want to talk about Zelda. We never got a chance, we never all got to talk about Zelda after we all saw Zelda. We talked about it, we did. It was before I saw it, it before I I played it afterwards. Oh, you did too. Yeah, we've all played Zelda. Tell me what you guys thought. I liked it. Uh, I wish the demo was a bit more like, all right, you're into this section now and here's how it's going to work. When you talk to people, let's talk to a Goron or whatever and go do something like that. Instead, it was, you know, the the all right, you're just in this open area for 15 minutes, run around, figure out the controls and then start from pretty much the start of the game and play through. And so I had to leave a little bit early, so I did the first thing where I got the Spire out of the ground and then I had a jet or whatever, but enjoyed what I played. Like, I'm excited for that game. I do want to play Zelda. Uh, it seems like it's interesting. I like the idea of how Link just wakes up after being",
            "start": 0.44
        },
        {
            "text": "then I had a jet or whatever, but enjoyed what I played. Like, I'm excited for that game. I do want to play Zelda. Uh, it seems like it's interesting. I like the idea of how Link just wakes up after being asleep for what is it, hundreds of years? They say 100 years. You wake up there and you're like ready to roll out and go and you got a little tablet and you put it in everything. Okay, tablets are dumb. Wii U tablets dumb, but whatever, whatever. I'm there, I'm ready. I the thing I like about the tablet is I was worried about that when I first saw and there was rumors on the internet over the last like year or whatever since they showed that first image where you saw it. Yeah, and uh, it it worried me that it I great, this is definitely going to be GamePad, you know, it's going to be a huge part of it. No, I think it's just more of an aesthetic thing when you is just a fancy looking map. So it's like, all right, cool. Doesn't seem like there's going to be more functionality than that. So yeah, that's exciting. No, I",
            "start": 41.52
        },
        {
            "text": "it's just more of an aesthetic thing when you is just a fancy looking map. So it's like, all right, cool. Doesn't seem like there's going to be more functionality than that. So yeah, that's exciting. No, I enjoyed what I saw. The fire effect looked cool. I like the idea of cooking food and doing all that stuff. I like the idea of it being in open world Zelda. I mean, it won't be obviously, I think it was pretty clear it won't be as uh fulfilling or as dense as Witcher or as Skyrim or anything like that. But I'm still down. Okay, cool. I'm going to climb up there and then I'm going to jump on my shield and ride it down like a surfboard. That's awesome. Yeah, I think that's the the most exciting to me is that the all the physics based stuff and I I like that it is just kind of a big sandbox and less open world in the traditional sense of like there here's a whole bunch of different tasks for you to do and it is more like the original Zelda where it's just go, yeah, there's a whole bunch of different stuff you",
            "start": 79.48
        },
        {
            "text": "the traditional sense of like there here's a whole bunch of different tasks for you to do and it is more like the original Zelda where it's just go, yeah, there's a whole bunch of different stuff you kind of figure out what you want to do and uh I like that the you can cut down the trees and they fall in different ways. So there's the physics there, but then yeah, also you can get on the the shield and use it as a snowboard um to go down the the hills and stuff and it's just like it's one of those games that makes you think, can I do that? Let me try. Oh, ****, I can. Yeah, and that's cool because it's been a while since I've experienced something like that, especially in a Zelda games. Zelda games have been so kind of just, you know, rinse and repeat, same thing over and over, which is why I'm happy that the demo wasn't what you were talking about. It's like, here, you're in a dungeon, go do the thing. It's just that it's left me with this feeling right where I enjoyed the demo, but I really haven't",
            "start": 112.8
        },
        {
            "text": "that the demo wasn't what you were talking about. It's like, here, you're in a dungeon, go do the thing. It's just that it's left me with this feeling right where I enjoyed the demo, but I really haven't thought about it since then. I I don't I didn't find the demo remarkable or mind-blowing. Like it's it's it's fun, sure. Yeah, I'm totally in for another Zelda. I want to play another Zelda, but I haven't been sitting here being like, man, that was an awesome part and I want to play that, but I don't want to go do that. Man, I I got the demo excited me, but what got me really going is afterwards, like after post E3, being able to look at everyone else's demos and everyone else's gameplay foot that they posted and just reading about it. The stuff that I didn't see, because the demo is huge, is crazy. There's so many different weapons you can pick up. You can use any weapon that the enemies drop and stuff. In in my demo, I got to use the little magnet thing a little bit. What I didn't know is that you can the magnet",
            "start": 148.6
        },
        {
            "text": "different weapons you can pick up. You can use any weapon that the enemies drop and stuff. In in my demo, I got to use the little magnet thing a little bit. What I didn't know is that you can the magnet attaches to anything metal, including your weapon. So you can throw your sword, pull out the magnet thing, attach it to the sword, and then use your sword as a **** like far away sword. Oh, far away sword. Yeah, better reach on your sword. Sure. **** awesome. Yeah, that's super cool. You can do stuff like that, because that seems like the type of thing that would be out of limitations, you know? Yeah, 100%. So that's super exciting. And I I like the just kind of the the system where there's the stamina, so it's like you can climb anything, you can go anywhere, you can run whatever you want, but or swim whatever, but it it's all based on the the time of that. And obviously, as the game goes on, I'm sure you get more, you like level it up. I think that's a really smart way to kind of contain the world and have it be open",
            "start": 183.68
        },
        {
            "text": "it's all based on the the time of that. And obviously, as the game goes on, I'm sure you get more, you like level it up. I think that's a really smart way to kind of contain the world and have it be open and very nonlinear and you know, you can kind of go wherever you want straight from the start. Yeah, while still limiting you from like going to the I agree 100%. Like I I think it's a really cool idea where it was to where I, you know, at one point I jumped in and I into the water and I started swimming and he's like, I don't know, going to make it. The guy next to me, then I'm like, I'll make it. And then I died. I like, well, next time. And I couldn't do it. Then I'm like, all right, well, I'm not supposed to reach that now. You know what I mean? Like it's clearly teaching me I'm not supposed to be doing that right now. And that's how you figure it out. Yeah, and I also like that it's it's Zelda enough and it's also different enough to keep me interested and be like, oh, ****, like they they they're giving us what",
            "start": 226.52
        },
        {
            "text": "now and that's how you figure it out. Yeah, and I also like that it's it's Zelda enough and it's also different enough to keep me interested and be like, oh, ****, like they they they're giving us what we asked for. See, I feel like that's what I'm going to get when I sit down and play with it and go through a straight play through. But yeah, when I for this gameplay demo, it felt like, okay, cool, this is what I was looking for. And I think it's I think it's pretty. I don't think it's like gorgeous. I think I think there's not a lot happening in the environments. You know, people have been arguing about this online if the game's beautiful or not. I think the art style is beautiful. I like the world of it, but it is definitely, you know, sparse environments in certain sections and D I mean, every last gen overall the sparse environment thing, I'm not too hung up on, because I'm not hung up on any of it. None of this is like, oh, ****, this game. It's just like, oh, I I because I I would rather there not be stuff than",
            "start": 259.96
        },
        {
            "text": "the sparse environment thing, I'm not too hung up on, because I'm not hung up on any of it. None of this is like, oh, ****, this game. It's just like, oh, I I because I I would rather there not be stuff than just, all right, here's NPCs that that have nothing really to say, but they're there. You know, I like that it's it is more like the wilderness. There isn't people just everywhere. No, I like that it is it it kind of just everything feels like it doesn't necessarily need to tell you a story, but there's a story to be made if you want there to be. And I like the little pirate coves or whatever where it's like there's enemies and I there's a hundred shrines to go find and all that stuff. And I like that it's like that stuff feels more important when there's not a bunch of random **** going on. Agree, agree with that 100%. When you jump on the map and you see how huge the map is, but you look at a section, you see all the different skulls and treasure chests, like, oh, I can totally see this being a Ubisoft game",
            "start": 293.4
        },
        {
            "text": "that 100%. When you jump on the map and you see how huge the map is, but you look at a section, you see all the different skulls and treasure chests, like, oh, I can totally see this being a Ubisoft game or a Shadow of Mordor where I set off and I'm going to go one by one to the yeah, I'll get to the story or whatever, but I'm going to instead go try to clear out all these different things. Mhm. I just I like that it's it's a really different approach and the whole the weather system and having to use the different like clothes and different armor and all that stuff, giving you a reason to change. Yeah, exactly, which is kind of annoying, because I was always a blue tunic Link, of course. Once I got that water, once I got that water tunic, I was rocking it all the time. He looks dope as ****. His armor though, yeah, he does look cool. Yeah, what about you, Colin? Um, I played it for about 15 minutes. Uh, now the the big caveat for me is that the and this is **** toned deaf Nintendo **** is that you can't",
            "start": 330.76
        },
        {
            "text": "though, yeah, he does look cool. Yeah, what about you, Colin? Um, I played it for about 15 minutes. Uh, now the the big caveat for me is that the and this is **** toned deaf Nintendo **** is that you can't invert the Y-axis in the in the demo. So like I could not play the game effectively like at all. Um, and so I was like really struggling because I play inverted. So I was like really struggling and this happens every so often like where a demo is like, no, you can't. A while, I'm like, you guys made a huge blunder on that one, because we we do exist. Um, we're breeding you out. And uh, so based on what I saw, I tried to like just play it uh keeping the camera kind of like level, um, so that I didn't have to think about it too much. And uh what I found was a game that I that intrigued me a great deal. Um, and uh I liked going into the menus and kind of you could tell how much more robust the game is, not by the world necessarily, but by the menus. Sure. Um, that there's like a deep um deep, there's a deep equipment",
            "start": 364.44
        },
        {
            "text": "liked going into the menus and kind of you could tell how much more robust the game is, not by the world necessarily, but by the menus. Sure. Um, that there's like a deep um deep, there's a deep equipment currency in this game in terms of like you have lots of armor, there are lots of weapon choices, um equipment and gear and like like to me it was like this is a real role playing game. This this almost feels like a Zelda. Zelda's actually real role playing game. I mean, we used to refer to to Zelda as being a role playing game or having role playing game elements, but it really doesn't. It's really an action adventure game in its own way. It's it's a Zelda game is a Zelda game. Um, there's a little bit of nonlinearity. You find that like Link to the Past, there's a little bit of like obviously you're finding equipment. You can buy, find things and not find things are heart pieces. So there's a lot of collectibles and and optional things. So the the spirit's always been there, but it's never literally been a",
            "start": 407.36
        },
        {
            "text": "equipment you can buy, find things and not find things are heart pieces. So there's a lot of collectibles and and optional things. So the the spirit's always been there, but it's never literally been a role playing game in my mind. Um, and this seems to be with its Skyrim influence or its open world Western role playing game influence, which is obvious. Um, and I'm glad that they finally looked outside and found that other people were doing their games better that they took that in. So when I was running around just for that brief time fighting enemies and kind of just exploring this wooded area, this sparsely wooded area, I found that it was it was a I agree. I think the art is really pretty. I think the direction is really pretty. The game is super dated looking. Anyone who thinks that that game isn't dated looking, I don't know if we're looking at different games, but like the gameplay, it looks like a PlayStation 3 game. I mean, you know, like for sure look like you doing that. Oh, yeah, people people",
            "start": 446.84
        },
        {
            "text": "dated looking. I don't know if we're looking at different games, but like the gameplay, it looks like a PlayStation 3 game. I mean, you know, like for sure look like you doing that. Oh, yeah, people people bristle when you say that, of course. Oh, yeah, dude. Um, I said that when I I I tweeted out, I was like, I played Zelda. It looks super dated, but I think it looks fun. I'm I'm excited to play it and I am. I'm going to play it. I'm going to play that game. Um, but people got really mad about that. And I'm like, dude, I just saw the game with my own **** two eyes. Like it it looks like it it was made five, six years ago. Like for sure. So, um, but that doesn't matter. The content of the game, I feel like is going to be there. Um, and it made me intrigued about Zelda. I've been really down on Zelda because Skyward Sword, just from what I saw, I didn't feel it. And Twilight Princess is real the real game. I really got my real Mainline console game from the series that I really got my my hands on on and was like, I just don't",
            "start": 480.0
        },
        {
            "text": "from what I saw, I didn't feel it. And Twilight Princess is real the real game. I really got my real Mainline console game from the series that I really got my my hands on on and was like, I just don't like this game. And with um even the handheld iterations, like I didn't really like Minish Cap. It was fine, but like Minish Cap was okay. The the Spirit game, the Spirit Tracks and whatever the **** the other one was with the stylus on. I I can't play games like that. So I just feel like Zelda wasn't being made for me for a long time. And when I played A Link Between Worlds, which I enjoyed, I was like, okay, this is great, but this is I've been to this world. I know this world. Um, there's a nostalgic factor to this, but it again, where is Zelda? Like where is the Zelda we need and we want? I feel like I feel like maybe this is that game. So I'm I'm optimistic about it. It brings back a sense of wonder to Zelda of what is over that hill and you can mark anything you and get there. So what will I find on that",
            "start": 519.92
        },
        {
            "text": "like maybe this is that game. So I'm I'm optimistic about it. It brings back a sense of wonder to Zelda of what is over that hill and you can mark anything you and get there. So what will I find on that journey to that spot, which I think has been missing for a while. Mhm. Yeah, and I think that I I like I like the idea of them spreading their wings a little bit and making a different kind of Zelda game that I think is certainly going to be outside of their own comfort zone. And I think that's why this game has taken so long to make and that's could be why the game so antiquated, not only because it's running on Wii U, which is super underpowered, but because it's been it was it's just been it's been gestating for so long as well. So, um, you know, I'm I'm interested to see like what the final product's like. I'm interested to see how long it is and robust it is. Um, and uh the one thing I'll say that I walked away from with this above all else is and I don't know I don't know a lot of people out there",
            "start": 558.2
        },
        {
            "text": "like I'm interested to see how long it is and robust it is. Um, and uh the one thing I'll say that I walked away from with this above all else is and I don't know I don't know a lot of people out there can relate, because I don't know how many people have been in Nintendo at E3 and played games there. They need to like not be up your ass when you're playing games at Nintendo. Like that was actually like my biggest takeaway is the actual experience of playing the game. No one did anything wrong. The people that I dealt with were very nice people. The man that was with me was very nice man. That was how, but it's like I've been playing games for 30 years almost. Like I'll figure it out. Like you're actually like putting a ton of pressure on me by standing over my shoulder and chattering in my ear and telling me what to do. Like just if you're going to give me all this time, just go away. Like I'll figure it out. If I have a question, I'll ask you, you know? And I felt I felt like it was a I know this is a",
            "start": 592.84
        },
        {
            "text": "me what to do. Like just go away. Like I'll figure it out. If I have a question, I'll ask you, you know? And I felt I felt like it was a I know this is a weird like Insider gripe, but it was just like I just played Horizon the day before and they like I figured it out. Like it took time, but like I figured it out. It was complex. But and so that was the it made me not want to sit there and like really learn, because I'm like this guy's judging me. He wants me to see certain things. I really just want to learn how to play the game myself. What I really learned about this new Zelda game too is that it's super complicated. Like that that was that was I I and he wasn't really he was trying to help me, but I was like, I could have just used a button map. That would have really been helpful to me. And it was there. He tell you about the Wolf Link amiibo. He did. He put it on the screen. But um, you know, it was just like, let me just, can I just I I hope Nintendo takes notes about",
            "start": 628.96
        },
        {
            "text": "really been helpful to me. And it was there. He tell you about the Wolf Link amiibo. He did. He put it on the screen. But um, you know, it was just like, let me just, can I just I I hope Nintendo takes notes about this. I'm sure they don't care. They don't care about anything. But but like, you know, let me just play. And um, if I have a question, I I'll ask you. I'm going to play the game my own my own way and learn the mechanics my own way. And I just feel like I felt so much pressure where I feel like I would have enjoyed it even more if I didn't feel like I was having this this person or these people around me like watching me everything I did as if I was going to run away with the Wii U console or something like that. Tried to you see that? Oh, I'm sure. I'm sure. I'm sure that's not the first time. I'm sure. Was it Logic? It was Logic. That was probably Logic. So that was so I so that's just a minor inside that I thought people would enjoy hearing, because I I just I only experienced that at Nintendo. See, I feel",
            "start": 663.04
        },
        {
            "text": "it Logic. It was Logic. That was probably Logic. So that was so I so that's just a minor inside that I thought people would enjoy hearing, because I I just I only experienced that at Nintendo. See, I feel like the only the only the thing was that in that 15 minutes to do whatever you want, they were doing that to me too. And then when it was like you started the game, they backed off. I think they wanted you to get the mechanics down to an extent. Yeah, they see mad at me. They were like, all right, we'll go to the the theater first. I'm like, I don't want to do anything that. Can we like just go upstairs and just like sit me at a kiosk and I'll play the Zelda game? Like I I'll, you know, I've played almost every Zelda game. I'll figure it out. Um, you missed the cool reveal though, because then the the screen went away and they pulled up the thing and this door opened up. Like, yeah, it's just like we so we had scheduled you had scheduled you had kindly scheduled the things on our our last day and that wasn't in the",
            "start": 701.12
        },
        {
            "text": "and they pulled up the thing and this door opened up. Like, yeah, it's just like we so we had scheduled you had scheduled you had kindly scheduled the things on our our last day and that wasn't in the original schedule. And I needed the time to do something else. So I actually had to go quickly anyway. I was only there for 15 or 0 minutes. But so that was just my minor gripe. But I so my takeaways in Zelda is like, uh I think it's pretty regardless of the fact that it looks dated. I think that uh the open world nature of it, although we've had open world Zelda since the very beginning, I think the open world, very open world nature, I think will provide its own density, even though I think the game looks scarce. I think there will be its own density there. I think that if you looked at Skyrim the same way, you'll find that it's just as empty. Um, it's just that there's a little points of interest. I don't think you have to have this flooded **** field of things going on all the time. So I agree with you",
            "start": 729.08
        },
        {
            "text": "you'll find that it's just as empty. Um, it's just that there's a little points of interest. I don't think you have to have this flooded **** field of things going on all the time. So I agree with you there. Um, and I'm really super intrigued by the complexity of the control scheme and the complexity of what you can do. Some of it makes sense, some of it doesn't. Mapping sword for instance, I think to a face button was weird. But having and I'm sure you can remap things and having and having the arrow like you aim and shoot with the same button. Like there's certain things where I'm like, this doesn't make any sense. You have triggers you can use, you know? So like I have to wrap my head around the way that they were doing things. And I think I'm right about the sword things. I think you draw it and and slice it with the same things. I think I kept like thinking I would I was I was like kept pulling **** out of my sack or whatever. There were definitely buttons there that were weird that I was trying to",
            "start": 760.72
        },
        {
            "text": "it with the same things. I think I kept like thinking I would I was I was like kept pulling **** out of my sack or whatever. There were definitely buttons there that were weird that I was trying to do going to what naturally would be there. Totally. No problem at all playing. I thought it felt great. Like getting Nintendo game does. It felt very intuitive to me and stuff. I also said that uh Pro controller compatible. Colin, yeah, that's what I play with, because I it didn't feel intuitive to me at all. I think it would have if I spent more time with it and it was getting I was getting better at it. I was also just kept worrying about the **** Y-axis over and over again. So, um, so yeah, pretty game. I think it's open for a good reason. There's a lot of mechanics there and a lot of equipment and RPG elements that I think Zelda much much need. I think this is a revitalization that Zelda needs. I don't know that anyone's going to play it, um, because it's going to be stranded on Wii U and we do not know the",
            "start": 797.84
        },
        {
            "text": "that I think Zelda much much need. I think this is a revitalization that Zelda needs. I don't know that anyone's going to play it, um, because it's going to be stranded on Wii U and we do not know the nature of NX and if anyone going to be interested in buying it yet. I think that there might be interest. I think there might not be interest. So, um, that'll be interest. So, well, we'll see. We'll find out. Um, remember that Skyward Sword is the last console Zelda and it didn't sell well. So, um, and it was on its console with 100 million units. So, um, they have much to prove here. I think a marketing blitz will be smart. I think that like letting people go hands-on in Nintendo store and other places. EB's losing her mind. She's really excited about Zelda. So, yeah, I was happy to play it. I was really honored to play it. It was cool. It was like a nice little reveal for me. I didn't expect that I was going to have time to do it. So thanks for setting that up. No, um, but uh yeah, also that little insider thing",
            "start": 827.96
        },
        {
            "text": "to play it. It was cool. It was like a nice little reveal for me. I didn't expect that I was going to have time to do it. So thanks for setting that up. No, um, but uh yeah, also that little insider thing about, you know, just like, just leave me alone and let me let me do my thing. Tell me I can put the Wolf Link amiibo on there. I don't care. No one cares about amiibo in that functionality. I'm excited to see what NX changes, because I think that it can make a game that I'm already excited about even better. I think that just if it gives me 1080, if it gives me 60, cool, because this was 720. And I think that that's an obvious thing. You know, they're showing this game and it is running on Wii U. So we're not going to get the the ultimate version of ultimate experience of it. But well, if you had the NX right now and you had Zelda right now, you could take it with you on the plane. Who knows? Little control. I thought it looked great. I'm super excited about it. And it again, it it looks like a simplified version of a lot of",
            "start": 863.24
        },
        {
            "text": "Zelda right now you could take it with you on the plane who knows little control I thought it looked great I'm super excited about it and it again it it looks like a simplified version of a lot of these games that I I don't want to play because it looks like too much of investment but this looks like it has the dumb down systems that I want to get into it where it's like it's not overwhelming in a bad way it's hey here's this what's overwhelming is the the size and scope of it all but it's things that I want to do and it's not stuff that I feel like is chores to to get done yeah it's new for I mean what's cool is that this is new for Zelda you know like this is a I still feel like the most open Zelda we ever had was the original NES and um when you really think about and get back to get down to brass tacks and you don't think about Zelda in terms of its aesthetic or it's it's um uh its feel but rather it's scope like the original Zelda was really super open and super nonlinear in its own",
            "start": 900.28
        },
        {
            "text": "to brass tacks and you don't think about Zelda in terms of its aesthetic or it's it's um uh its feel but rather it's scope like the original Zelda was really super open and super nonlinear in its own way um and I don't know that we've gotten that we had that a little bit with Zelda but not much and we had that like a little bit with Link to the Past in the Dark World and we had that a little bit with Ocarina of Time and a little bit with Majora's Mask but like we never had this like massive like world where it's like we're not going to tell you or gate anything off like you'll figure it out like you could really go to almost any corner of the map in the original Zelda if you wanted to as long as you had bombs and stuff like that so like I feel like this is the game this almost seems to capture the spirit ironically and interestingly of the original Zelda which I think is a super **** good game so that was the point yeah Aonuma was talking about how he that that one image the original image",
            "start": 936.2
        },
        {
            "text": "spirit ironically and interestingly of the original Zelda which I think is a super **** good game so that was the point yeah Aonuma was talking about how he that that one image the original image from the instruction manual from the first Zelda like that was the total inspiration for this game and you can totally see it visually and just in terms of the the scope and the gameplay elements and all that stuff um and they did an interview recently with Reggie and he was saying that you can beat the game without even having much of the story elements at all and I think that's cool I like that it's just like do whatever the hell you want tell your own story um I also think they're taking a lot of the classic Zelda elements like bombs and stuff I don't know if you guys got to this a bit but instead of just being the normal bombs that we know there's two different types of bombs one rolls with the whole physics based stuff and the other one is more of a square block that you just kind of",
            "start": 973.12
        },
        {
            "text": "instead of just being the normal bombs that we know there's two different types of bombs one rolls with the whole physics based stuff and the other one is more of a square block that you just kind of put down like lay as a trap for for when the enemies come by and stuff and it's just like little tiny tweaks like that I think really kind of flesh out the world and explain to you the type of direction that they want you to go but then let you go whatever Direction you want I think that's the most important thing um I liked being able to push the rocks and have it roll down the hill and like Crush people and they teach you how to do that so that later on I'm sure in the game there'll be much more advanced things where you get to play with the physics and all that stuff um and in the same way that old Zelda's taught you if there's a crack in a wall bomb it there's a secret in there anytime there's water and stuff when you have the magnet like already I know search the water there's",
            "start": 1010.4
        },
        {
            "text": "way that old Zelda's taught you if there's a crack in a wall bomb it there's a secret in there anytime there's water and stuff when you have the magnet like already I know search the water there's probably some metal thing in there that I can pick up to complete a bridge that I can walk across to get a treasure chest and all that stuff and I'm very very very very excited about this game I gave it my one of my three game of the show free three and I definitely think it would be my top one overall of those three so stay tuned Zelda X gonna give it to you",
            "start": 1044.08
        }
    ]
}