{
    "id": 1863,
    "video_id": "Z0gxn0Ol9Bk",
    "show_name": "Gamescast",
    "hosts": [
        "Chuck Osieja",
        "Colin Moriarty"
    ],
    "title": "Gears of War 4 E3 2016 FAQ - The Kinda Funny Gamescast",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nColin sits down with Chuck Osieja and talks Gears\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1466188201,
    "duration": 750,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations, welcome back to Kinda Funny Games. My name is K. Moriarty. I'm here with The Coalition's Chuck Osieja, whose name I butchered terribly before this but got my facts in order before we begin the video. Thank you, Greg, you're alone. Thank you so much. Appreciate you guys, appreciate you guys. Thank you, thank you. Doing, doing it, doing it. Uh, Chuck, thank you for joining us. It's E3 Day Three. We're all, I'm sure you're ready to go back. It's Day Three end, yeah, exactly. Uh, I'm sure you're ready to get the hell out of here, so we appreciate your time. I love LA. Uh, do you? No, no. Okay, I was gonna say, who likes, who actually likes LA? Not really. I didn't think anyone actually liked LA. Um, now you're here from The Coalition, developing Gears of War 4. Comes out Xbox One this fall, October 11th. October 11th, right before my birthday. Greg, happy birthday clap. Thank you. Uh, now, Kevin, that's enough. You finally turned 1. I turned 1. I'm ready to, I'm actually turning 18 and can buy my M-rated",
            "start": 0.0
        },
        {
            "text": "October 11th, right before my birthday. Greg, happy birthday clap. Thank you. Uh, now, Kevin, that's enough. You finally turned 1. I turned 1. I'm ready to, I'm actually turning 18 and can buy my M-rated games. And Gears of War 4 is going to be the first one. Uh, we're really excited to play. Uh, Gears of War 4 and I play Gears of War 3 together, um, when it came out back on Xbox 360. So I'm, I'm curious, how's development going? Like, how are you guys feeling about the game? You guys are really close now. Uh, we feel good. I mean, this week was a great opportunity to show it off to the fans. So the first time we really got reception with a large audience. We've shown it, uh, you know, a couple different places previously, but, uh, the reaction was really good. We had long lines, uh, all day, every day, and that's why I'm exhausted. Yeah, oh, I, I, I, I bet this must have been the most popular game at that booth. Um, I mean, this is really the tentpole title for Xbox. Don't know, I never got out of the booth. That's true. I'm just gonna",
            "start": 42.32
        },
        {
            "text": "Yeah, oh, I, I, I, I bet this must have been the most popular game at that booth. Um, I mean, this is really the tentpole title for Xbox. Don't know, I never got out of the booth. That's true. I'm just gonna, I'm not even, I, I don't have any evidence and any sort of data at all, Greg, but I'm going to go out on a limb and say Gears of War 4, most popular game at the Microsoft Booth. I mean, you're gonna have to make that assumption, right? Yeah, yeah, okay, mhm, good. Uh, they're on to something. We were in a theater, so we have no idea what was happening outside. I loved the demo during, uh, I wasn't able to go hands-on, unfortunately, but or even see it behind closed doors, but I loved the demo, um, that was shown, uh, during the, the conference. How'd you guys kind of pick that, that segment out, uh, to show everyone? Uh, well, I mean, E3 is all about bringing it big, right? I mean, so that was, uh, an example of one of the big new features that we're doing inside the game, which is the Windflares and and the, the system that we built.",
            "start": 82.32
        },
        {
            "text": "E3 is all about bringing it big, right? I mean, so that was, uh, an example of one of the big new features that we're doing inside the game, which is the Windflares and and the, the system that we built. It's going to impact lots of parts of the game. So for us, it was, uh, we have an amazing legacy to live up to. And if you, and we did this, you go back and watch all the other Gears of War E3 presentations, and each one's topped the last one. So for us, we had to go really big with that. No, obviously, I, I kind of wanted to talk to you a little bit about, about this, and I'm sure you guys get this question a lot, but does the team itself, I'm sure you don't, but does the team itself feel a little bit of pressure of taking this, this? I don't feel any pressure at all, but because you're, you're a big strong man, feels no pressure. But you have, you have underlings under you that are working on Gears of War 4. There's expectations with this series from minions, minions. I'm sure you have minions, many minions, probably 150",
            "start": 117.6
        },
        {
            "text": "pressure. But you have, you have underlings under you that are working on Gears of War 4. There's expectations with this series from minions, minions. I'm sure you have minions, many minions, probably 150,000 minions, uh, underneath you working. And they, you know, Epic, obviously, Gears of War 1, 2, 3, uh, Judgment was Epic and I guess People Can Fly, right? Um, do you, is that like kind of a crushing sort of pressure for you guys, or you guys kind of dealing with it okay? Uh, no, it initially, it's, it's, it's a good and bad kind of pressure, right? I mean, it's amazing to be working on one of the most iconic franchises in video gaming history. I mean, if you list your top 10, Gears is going to be in there. So from that standpoint, it's an amazing honor to be able to do it. The flip side is, it's been such a great run of games. So yeah, there is that pressure to make sure that, you know, I think about it similarly to what 343 went through with Halo, right? Taking over for Bungie, again, iconic franchise and",
            "start": 155.64
        },
        {
            "text": "a great run of games. So yeah, there is that pressure to make sure that, you know, I think about it similarly to what 343 went through with Halo, right? Taking over for Bungie, again, iconic franchise. And they had the right attitude about it, and we sort of adopted that attitude, which is, you got to do it right before you do it different. So for us, it was really important to make something that felt like Gears, and that when Gears fans picked it up, it felt familiar to them. And then it was, okay, where do you put the twists on it to take it in a different direction and move the ball down the field a little bit? What, what, what's the feed? I mean, obviously, the game's out only out in October, but have you been getting mostly positive feedback from the fans? I mean, are they excited to get a different take on, because I saw a little bit of a mixture post-Halo 5 with some people, you know, being a little hard on 343, which I think was maybe a little undeserved, because I feel like sometimes you can never live up",
            "start": 194.4
        },
        {
            "text": "I saw a little bit of a mixture post-Halo 5 with some people, you know, being a little hard on 343, which I think was maybe a little undeserved, because I feel like sometimes you can never live up to these expectations. Is this your first day in the industry? No, it's like my third. There's some haters out there. There are some haters out. You know, at the end of the day, we have to make the game that's the best possible game, and we do what we think is right for the franchise. And to be honest with you, I think that's going to satisfy most of the fan base. There's always going to be some people that you're not going to satisfy. I mean, everybody we talk to, we've talked to a lot of different people, and they'll come with a bunch of different angles. They'll say, you know, oh, Gears is old and tired, so why is it, why is it relevant anymore? Well, it's an iconic franchise. There are millions of people out there that play it and love it, and it's not, you know, it can be, it can be, uh, restarted, and it can be, uh, uh, an",
            "start": 228.08
        },
        {
            "text": "why is it relevant anymore? Well, it's an iconic franchise. There are millions of people out there that play it and love it, and it's not, you know, it can be, it can be, uh, restarted, and it can be, uh, uh, an opportunity to create a whole new, uh, version of the franchise. But you're always going to get people that go, no matter what you do, they're going to say, well, I wish you would have done something different. And so you're just not going to satisfy them. So it's up to us to make sure, you know, with Rod's help, you, we've got a seasoned veteran with, with Gears from the beginning to use his guidance to sort of understand what were, why did you make the decisions that you made when you were building the original Gears? Why did you not make certain decisions? Why did you go down this path and not one other? And then figure out, you know, how do you replicate that, replicate the feel, and then where do you take it after that to, to make it new and innovative and different? So I think what we're building in the",
            "start": 260.16
        },
        {
            "text": "and then figure out, you know, how do you replicate that, replicate the feel, and then where do you take it after that to, to make it new and innovative and different? So I think what we're building in the reception at E3 was fantastic. I mean, every, we had lots of cheering, lots of people loved it. I mean, nobody, of course, nobody's going to say to your face they don't like it, but, uh, the feedbacks were really positive, and we're really excited about where it's going. That's great. I feel like this is actually a good, uh, analog, Greg, when Greg and I saw, uh, and don't, don't hurt me, Microsoft PR man, but when we saw God of War behind closed door, Cory said something interesting that I'm actually, that I actually think could parlay to this particular, to this particular game as well, which is parlay. And I'm going to parlay, if you don't mind, which is that when they were making this new God of War, same acronym, so maybe that's the connection, uh, they had to justify everything that existed in the previous games, uh,",
            "start": 297.2
        },
        {
            "text": "to parlay, if you don't mind, which is that when they were making this new God of War, same acronym, so maybe that's the connection, uh, they had to justify everything that existed in the previous games, uh, that nothing was taken for granted. And I'm curious, did you guys take a similar approach to that where it's like, well, there's a, there's certain foundations of Gears of War that are always expected, um, and were you, in other words, is nothing sacred? Uh, did you guys want to really make sure that everything existed for a reason to make Gears of War a 2016 game as opposed to, it's a good way to think about it. For us, it was more, uh, nobody but really Epic and People Can Fly was a, you know, a faction of Epic. So they understood the, the franchise as well. For us, it was really trying to figure out why Gears of War was Gears of War, what made it Gears of War. So for us, it was about breaking down the franchise and understanding, you know, what were all the pillars of the game, what were the, why were the",
            "start": 329.96
        },
        {
            "text": "Gears of War was Gears of War, what made it Gears of War? So for us, it was about breaking down the franchise and understanding, you know, what were all the pillars of the game, what were the, why were the mechanics there? Like you said, what did they do? How did they work together? You know, I talk about Gears as being a deceptively simple game. It's a third-person cover-based shooter. It's not that complex. There's not a lot of verticality into it, right? But what's, there's a lot of beauty in the simplicity of it, and there's a lot of complexity in that simplicity as well. And that is, you know, there's a reason why, uh, the cover is laid out the way it is. It's to allow you to move through the, you know, through the combat smoothly. There are flanking routes set up all the time that allow you to, to feel smart when you flank an enemy or, uh, uh, you know, somebody in, in versus multiplayer. Uh, the way the, the roles of the enemies are really very specific. I mean, Epic had never really broken down that stuff",
            "start": 367.44
        },
        {
            "text": "smart when you flank an enemy or, uh, uh, you know, somebody in, in versus multiplayer. Uh, the way the, the roles of the enemies are really very specific. I mean, Epic had never really broken down that stuff because it was all tribal knowledge, right? When they started, they sort of built it and designed it, and, and they added more people to it, and it all just became, you know, myth and legend inside of Epic. So when we took the franchise and bought the franchise, there wasn't a lot of data that said, hey, here's why, uh, the Mirrors, which are the, the, you know, the enemies that look like you and play like you, here's why they do what they do and here's how they act. Or another category is the, the Pinners. These guys keep you in cover. They're the Mulchers, the Grinders, the guys like that. They, you know, their job is to hold you in cover so the enemies can flank you and get around you and surprise you. And then you have Flushers. These are the guys that, hey, if I'm going to sit in lockdown and cover, these are the",
            "start": 406.0
        },
        {
            "text": "to hold you in cover so the enemies can flank you and get around you and surprise you. And then you have Flushers. These are the guys that, hey, if I'm going to sit in lockdown and cover, these are the guys going to come push me out of cover so that I become vulnerable to the enemy. So all that analysis really helped us to understand what Gears is all about, and then that helped lay the foundation for where we need to go with the franchise. I'm kind of curious, too. We, we were talking a little bit about just, just a few moments ago about the pressure of taking over from Epic. And we've been talking a lot about them. I like just kind of looking at the, the catalog of games and kind of the ebb and flow of the franchises. It seems like Gears is really, like I said, that tentpole, that really important, obviously, game. It's always been one of the most important, you know, franchises since Xbox 360, but it seems like it might be the most important. Um, do you guys feel like this is a game that's going to come out",
            "start": 445.0
        },
        {
            "text": "game. It's always been one of the most important, you know, franchises since Xbox 360, but it seems like it might be the most important. Um, do you guys feel like this is a game that's going to come out, obviously, satisfy players and then be kind of supported for a long time as well? Because it's obviously going to be a game that's going to move units. It's going to, and by that, I mean software and as well as hardware. So I mean, is there like a support structure built around this game post-launch that's going to make sure, obviously, I'll let you guys decide whether or not this is the most important game in the, in the catalog. Uh, we seem to think it is, but, you know, everybody has a different opinion. So, uh, yeah, I mean, that was the exciting part about being The Coalition and, and having Microsoft acquire the franchise, right? Is that when Epic was building the games, the stories that Rod tells is that, you know, they built Gears 1 and never knew they were going to build Gears 2. And then when they built",
            "start": 479.52
        },
        {
            "text": "franchise, right? Is that when Epic was building the games, the stories that Rod tells is that, you know, they built Gears 1 and never knew they were going to build Gears 2. And then when they built Gears 2, they didn't know they're going to build Gears 3. So as a developer, when you don't know what the, you know, what the path of your franchise can be, and you can plan for that certainty along the way, it's really hard to design things that you want to get to a game or two games down the road or an iteration or somewhere down the road. When Microsoft acquired the franchise, we knew there was going to be a commitment to it, right? And, you know, the way that we think about it is Halo is, I'll say, Halo is definitely the tentpole franchise, maybe Minecraft, uh, in the Microsoft stable. And they, what they have done is laid a roadmap for us on how to approach, you know, these big multimedia, really cultural Touchstone type franchises where people talk about, and it's not just the Xbox One game or the PC",
            "start": 512.88
        },
        {
            "text": "have done is laid a roadmap for us on how to approach, you know, these big multimedia, really cultural Touchstone type franchises where people talk about, and it's not just the Xbox One game or the PC game. There are other, uh, opportunities that to move the franchise in different directions because Sera is such an interesting place, and Gears has such a rich history, not just with the three games, but they've got the books, they've got the comics, you know, they've got, I would argue, one of the best stables of characters of any franchise out there. So it's not just Marcus, or it's not just JD, Kate, and Del. There are a lot of different characters that we could choose to, to do stories about or to do interactive entertainment around. So that was really exciting for us because we knew that commitment was there, and now it's a matter of, hey, let's get the first one out and then figure out when we want to go, right? And that's what I was going to ask. It seems like you've already answered what was going to",
            "start": 553.44
        },
        {
            "text": "there. And now it's a matter of, hey, let's get the first one out and then figure out when we want to go, right? And that's what I was going to ask. It seems like you've already answered what was going to be one of my final questions, which was, Microsoft seems to be setting up some of its first-party studios in a way to really cultivate a specific franchise, not only a specific genre. So 343 Industries is obviously made to make first-person shooters, and they go to someone like Creative Assembly to make a Halo game that's not within their, the confines, but they still deal with the lore and they still deal with all that kind of stuff. So does it not feel constraining, but rather kind of freeing to know that this is kind of the world you're going to exist in and you're going to really explore it beyond that one or two games? Yeah, it's actually why we changed the name of the studio from Black Tusk to The Coalition, right? I mean, we again took a cue from 343 Industries, uh, because when for people who have been in the",
            "start": 596.28
        },
        {
            "text": "or two games? Yeah, it's actually why we changed the name of the studio from Black Tusk to The Coalition, right? I mean, we again took a cue from 343 Industries, uh, because when for people who have been in the industry for a long time or have worked a lot of different companies, one of the things that you get is you work on a project for a while and somebody goes, well, let's, you know, we work on first-person shooter, so let's do RTSs or let's do story-based games. And really, when you're building out a, a development studio, you, you tend to hire expertise around the things that you're building. And like anything, it's a muscle that you build and you get better at it and becomes something that you can hone and continue to, to build your expertise. As soon as you move away from that, you need to start learning different things, right? So for us, changing the name The Coalition was a message to, you know, people that wanted to come and work with us that we're going to be a Gears of War studio, right? Whether that's the, the",
            "start": 627.28
        },
        {
            "text": "things, right? So for us, changing the name The Coalition was a message to, you know, people that wanted to come and work with us that we're going to be a Gears of War studio, right? Whether that's the, the traditional third-person, you know, stop and pop shooter, or it's going to be something else, but it's really going to be around Gears of War. So that was really, uh, both freeing and defining for us as a studio, right? And it probably allows you to attract that talent that you need as well to build exactly. You don't get that person who comes in and goes, well, I, you know, I'll work on Gears of War now, but then I really want to do a racing game. And just go, look, we're not doing racing, Turn 10. Exactly. Uh, yeah, no, I think that makes perfect sense. And I really actually like that structure a lot because it gives the gamers a lot of predictability as well to know that, you know, Halo's, you know, Halo 5 is not the last Halo. Gears of War 4 is not going to be the last Gears. Well, Chuck, I really appreciate you joining us and",
            "start": 664.92
        },
        {
            "text": "a lot of predictability as well to know that, you know, Halo's, you know, Halo 5 is not the last Halo. Gears of War 4 is not going to be the last Gears. Well, Chuck, I really appreciate you joining us and taking the time. I know this feels like day seven, like you said, and I know you're probably exhausted. It's a lot of fun. Thanks for having. Yeah, no, no doubt. And so, uh, Gears of War 4, October 11th, uh, super excited to play it. Greg, even though I like to play all my games, games alone, Greg's forcing me to play it with him. This is, this is the king of co-op. You got to play this with somebody else. It's got couch, uh, split screen. I honest to God think Gears of War 1 might be the last game I played with you. So, and that was what, 2011. And right before that, it was Sanctum of Slime. Yeah, the Ghostbusters is the famous Ghostbusters game. Chuck, thank you so much. We appreciate you. Uh, safe travels back. And for more on all things Xbox and video games and Gears of War, I'm sure we'll be talking a lot about Gears of War in",
            "start": 701.12
        },
        {
            "text": "Ghostbusters game. Chuck, thank you so much. We appreciate you. Uh, safe travels back. And for more on all things Xbox and video games and Gears of War, I'm sure we'll be talking a lot about Gears of War in the coming months. Keep it tuned to Kinda Funny Games.",
            "start": 734.92
        }
    ]
}