{
    "id": 3737,
    "video_id": "7MU1zBW0vOo",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Andrea Rene"
    ],
    "title": "EVO 2018 Recap and Announcements! - Kinda Funny Games Daily 08.06.18",
    "description": "Get limited-time package for $39.99 at http://omahasteaks.com and type KFGAMES in the search bar.\n\nGet 15% off your first ThirdLove order at http://thirdlove.com/games.\n\nTim and Andrea run through all the biggest events of EVO 2018.\n\nHousekeeping:\nGreg MIller: BATTLE CREEK MEET & GREET TONIGHT. 8 pm at @BWWings (5775 Beckley Rd. Battle Creek, MI 49015).\nWhat’s Good Games Special LIVE! Episode on Wednesday Aug. 8th at 6:30pm\nTwitch.tv/whatsgoodgames\nYoutube.com/whatsgoodgames\nPresented by PayPal #LevelthePayingField\nThe Roper Report   -\n00:04:55 - Smash (Nintendo) Tune in on Aug. 8 at 7 a.m. PT for a Super Smash Bros. Ultimate Direct live stream, featuring new game information delivered by director Masahiro Sakurai. (40 April 8th 2014\n00:23:55 - EVO RESULTS 2018 - via Maddy Myers at Kotaku SFV\n00:34:55 - BANDAI NAMCO ANNOUNCED AT EVO\n00:36:20 - Dead Cells Reviews are IN!\n00:37:02 - THE LEGEND OF ZELDA: BREATH OF THE WILD NOW HAS AN OFFICIAL PLACE IN THE SERIES' TIMELINE (IGN)\n00:39:04 - Out today\n Reader mail   -\n00:44:00 - What were your favorite moments from RTX? - Connor Reese\n00:50:00 - Have you done any of the Solstice of Hero's event in Destiny 2 to Gear up for Forsaken? And if so how do you feel about this event? - ComebackxKid\n00:52:10 - Epic Games is ditching the Google play store for the Android release of Fornite, Do you think that this will pave the way for other developers to follow suit and cut the middle man out for micro transaction sales or since Fortnite is a big name that it can do this without any repercussions? - Tagless02\n00:56:30 - Where do you see PS4 sales topping off - Zach\n01:01:00 - Squad Up: @DuarteCRosa - Duarte \n001:01:45 - You‘re Wrong\nTomorrow’s host: Tim and Andrea\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1533589407,
    "duration": 3977,
    "transcript_chunks": [
        {
            "text": "[Music] what's up guys welcome to kind of funny games daily for Wednesday August 6 2018 it's Monday you said Wednesday why did I write Wednesday why does it feel like a Wednesday also this is the first games daily we've done in August August is a weird month yes anyone else agree with me on that I feel like August might be my least favorite one that's my birthday month Tim well happy birthday month the month to you but yeah we took the whole week off last week for our little little break we went down to RTX and i'm tim yeah this is andrea rene obviously what's good Tim many things I mean our GX was good I'm so happy you it was your first r-tx yes it was was it worth going it was absolutely worth going we always loved the opportunity to meet the people who watch the content that we make and listen to the show and getting to do that at the meet and greet at the panel and of course at the signing on Sunday was really look really cool yeah we had a blast let's play live was awesome we did",
            "start": 0.34
        },
        {
            "text": "listen to the show and getting to do that at the meet and greet at the panel and of course at the signing on Sunday was really look really cool yeah we had a blast let's play live was awesome we did another stand-up show and it was just fantastic everything about this might be my favorite r-tx and r-tx might be my favorite convention so it's pretty high standards there man we want to see everyone there next year I just realized why I said Wednesday I got smash brothers direct on the mine that's all and I'm thinking about and I was talking to Kevin right before I wrote this down about confirming some things for Wednesday so that is why ladies and gentlemen this is kind of funny games daily each and every weekday right here on twitch.tv slash kind of funny games we get together and go through all the video game news that you need to know you can watch it live on Twitch or if watch it on YouTube but whatever you want is more your thing you can do that youtube.com slash kind of funny",
            "start": 57.99
        },
        {
            "text": "all the video game news that you need to know you can watch it live on Twitch or if watch it on YouTube but whatever you want is more your thing you can do that youtube.com slash kind of funny games or if listening is more your thing just podcast guess what all the podcast services have this show to search for kind of funny games please review us 5 stars are preferred for I'll take it you know what I mean anything less please don't worry don't worry about it don't listen to me don't do that we want you to be part of the show you can go to California comm /k fgd to write in your questions or if you want to correct us for things we get wrong during the show and since there's a lot of Evo and fighting game conference we might get a lot wrong you go to California calm / you're wrong and we will correct it at the end of this show little housekeeping Greg Miller is not here right now because last minute on the way to Texas we got an email that a cool random opportunity in Battle Creek",
            "start": 94.86
        },
        {
            "text": "we will correct it at the end of this show little housekeeping Greg Miller is not here right now because last minute on the way to Texas we got an email that a cool random opportunity in Battle Creek Michigan so Greg is there today and tomorrow but he will be back but to make up for it if you were in the Michigan area if you know what Battle Creek is tonight at 8:00 p.m. at Buffalo Wild Wings he's doing a meet up if you want more information go to his Twitter twitter.com slash game of her Greggy I loved what's up tell your friends tell all your friends to Eminem might be they're not confirmed you know he's from Detroit so maybe who knows he'll show up Battle Creek Louisville and halo it's gonna be real interesting him him doing a meet and greet they're at a buffalo I didn't know there was a buffalo always but both Wild Wings are everywhere shout out to that man be dubbed ups and then you have a special thing in the housekeeping yeah I'm probably not much of this on the show tomorrow",
            "start": 136.08
        },
        {
            "text": "a buffalo always but both Wild Wings are everywhere shout out to that man be dubbed ups and then you have a special thing in the housekeeping yeah I'm probably not much of this on the show tomorrow too but for the first time ever what's good games is doing a live stream of our weekly recording of the podcast and it's being brought to you by PayPal's hashtag level the pain field so we're really excited to do the show it's just like our regular weekly show hold the paying field yeah I love a good catchphrase that's awesome it is yeah so we're doing this to kind of spotlight the gender pay gap in the streaming and online content creation community and we have some really cool stats so we're gonna have a convo about it later on in the show but if you guys have never watched what's good games and you're around at 6:30 p.m. Pacific time you can catch the stream on our twitch channel that's twitch.tv slash what's good games or youtube.com slash what's good games as well awesome please go",
            "start": 184.08
        },
        {
            "text": "and you're around at 6:30 p.m. Pacific time you can catch the stream on our twitch channel that's twitch.tv slash what's good games or youtube.com slash what's good games as well awesome please go support them you know shows being sponsored is a really big deal what's good this is their first kind of big sponsorship for their podcast and we want to make sure that we're supporting them so that more can happen so that you guys can grow and do more things that you want to do because you've been talking about some really cool stuff so I want to make sure that we get that stuff happening but in this episode of kind of funny games daily is brought to you by third love and Omaha Steaks but we will get to that later now let's start with what is and forever will be the Rope report o baker's dozen thanks for that Ken I really kind of wish that I just let that go a little bit longer than to see when he would stop Kevin koala my favorite human being first news story of the day of course I got to",
            "start": 232.02
        },
        {
            "text": "thanks for that Ken I really kind of wish that I just let that go a little bit longer than to see when he would stop Kevin koala my favorite human being first news story of the day of course I got to put it here this comes straight from Nintendo tune in on August 8th at 7 a.m. Pacific time for a Super Smash Brothers ultimate direct livestream featuring new game information delivered by director masa Hiro Sakurai I could not be more excited the only thing I don't like about this is 7 a.m. Pacific Time sucks will we be doing a live stream of course we will I need to record my reactions to this I'm so stoked Kevin will be there I will be there I cannot promise I will have any partner to be there with me because Andy's out and Greg's probably gonna be tired but you know what I'm gonna react my little heart out I am so stoked does this do anything for you Andrea not a thing I got the email and I immediately forward it being like oh snap the smash direct is coming and you know Britney has",
            "start": 282.18
        },
        {
            "text": "my little heart out I am so stoked does this do anything for you Andrea not a thing I got the email and I immediately forward it being like oh snap the smash direct is coming and you know Britney has been trying to get me excited about smash - because she's a smash fan but I just never got into smash back in its early years and I feel like it's like too far gone now you know because the other thing I've said this on the show before I'm a terrible loser like I get really salty when I lose and smash is highly competitive and there's a lot of you know smack talking and like I know it's a lot of fun but if I'm not winning not having fun and I know I won't win because I had to put too much practice time I have good ideas to get good have an idea that's gonna take a little bit of commitment from a lot of people ok but when smash holds me it comes out I want to go all in on it obviously content wise I kind of want to make a show or something whatever it may be just a live stream or whatever",
            "start": 329.55
        },
        {
            "text": "a lot of people ok but when smash holds me it comes out I want to go all in on it obviously content wise I kind of want to make a show or something whatever it may be just a live stream or whatever but of us kind of learning to be better and we can divide it into two sections x-mansion training tool where we get like what cuz I want it I'm just pulling it out of my ass by the way like this is like I'm not promising anything I just like something I've been thinking about yeah I want to reach out to some pro players like real pro players and get him over here to teach me Nick and Greg and Kevin had an Andy how to be better and then simultaneously I've been wanting to treat to teach Gary Whitta how to play because he's never played and he's interested okay so we can get you in that category and we can kind of have like a you know more like casual competitive trying to get competitive and then the casual trying to get them competitive okay yeah I'm intrigued the only snag in this plan is",
            "start": 382.65
        },
        {
            "text": "and we can kind of have like a you know more like casual competitive trying to get competitive and then the casual trying to get them competitive okay yeah I'm intrigued the only snag in this plan is smashes release date that's the only snag in this plan no the thing about that though is it doesn't matter cause we're gonna be playing smash for years so I think it's gonna be okay but yeah December 7th kind of a inopportune time content-wise yeah great time non content wise because I'm gonna have a break to play the out of this game yeah I cannot wait but let's get into this so there wasn't much information given there obviously it's an announcement of the stream so we'll have a lot more information on Wednesday boy did you guys write in asking Tim all the questions a lot of questions so Brendan Foley writes in and says hey guys good to have you back for kind of funny games daily the week has dragged yesterday Nintendo announced an upcoming Super Smash ultimate themed Nintendo Direct",
            "start": 423.63
        },
        {
            "text": "Brendan Foley writes in and says hey guys good to have you back for kind of funny games daily the week has dragged yesterday Nintendo announced an upcoming Super Smash ultimate themed Nintendo Direct this got me thinking what could they possibly announce that could warrant a whole direct everyone wants waluigi no matter how annoying and some of the cons from Donkey Kong tropical freeze but I fear all it will get is obscure no neighbors from Fire Emblem and octa path traveller what are your thoughts on what could be announced love what you guys do first off the obscure no-name our comic what people need to realize about Smash Brothers is there is a breadth of characters we're now over sixty characters so it's like what might be an obscure node amber to you is the biggest deal to someone else and I know that they went a little overboard with Fire Emblem in the last one but there's still a couple farm characters like Lin for example that are would make a lot of people very happy and then",
            "start": 471.96
        },
        {
            "text": "and I know that they went a little overboard with Fire Emblem in the last one but there's still a couple farm characters like Lin for example that are would make a lot of people very happy and then octave out traveler like that'd be another thing where it's like that game is huge right now and that would be so awesome we got him but because they're just so new that ain't gonna happen No I think let me read a couple more the questions don't like get into it as all as a whole bluejay says hey k of GD crew given the recent announcement of a new smash direct I have to ask what are your thoughts how long do you think the presentation will be what and how many newcomers and EKKO fighters will be announced thanks for all that you do and then Kris Herrera says dear counting funny games crew Nintendo announced yesterday that on Wednesday they would have a Smash Brothers focus Nintendo Direct but they have already shown its a huge amount of the game with e3 and weekly updates unless a brand new",
            "start": 511.38
        },
        {
            "text": "announced yesterday that on Wednesday they would have a Smash Brothers focus Nintendo Direct but they have already shown its a huge amount of the game with e3 and weekly updates unless a brand new single-player campaign is about to be announced is this the car that Nintendo has been hiding for all those that doubted that this was a new game and not just a port will there be another character revealed like I don't know banjo kazooie what is it that would get you hyped Tim for this a Nintendo director will there be any other big announcements as well love what you guys do so here's the thing I tried to get a couple Doc's together from the previous smash games to kind of look at what this might be because for smash 4 Wii U if you remember andrea was two games yes for Wii U and for 3ds that's correct they did a major smash direct for smash 4 on April 8th 2014 the 30s version came out first right yes so this direct kind of was an overview of the game talked about a lot of the modes I have",
            "start": 552.12
        },
        {
            "text": "correct they did a major smash direct for smash 4 on April 8th 2014 the 30s version came out first right yes so this direct kind of was an overview of the game talked about a lot of the modes I have I wrote down everything they went through it was just kind of like the differences between some of the versions what stages would be on 3ds what stage would be on Wii U they went into online for the first time they went into some of the game modes and explained the for fun and for glory which is like how smash handles online right for fun being though you're just playing smash casually with people online and from glory being the more competitive mode then they went through assist trophies and Pokemon some returning fighters they announced a couple new ones and then they announced smash run which was the single-player mode for the 3ds game then months later the 3ds version came out so that direct was 40 minutes all right a lot of content in there right very similar to this year's e3 where",
            "start": 595.44
        },
        {
            "text": "was the single-player mode for the 3ds game then months later the 3ds version came out so that direct was 40 minutes all right a lot of content in there right very similar to this year's e3 where Nintendo went fully on for about 25 minutes on smash ultimate right but then they did a follow-up one in October a couple weeks before Smash on wiiu so after the three ds1 had released but before it had come out in on wiiu and they did a direct called the smash for wiiu 50 fact extravaganza where they literally went through 50 different things of varying degrees of importance that they were announcing for the game and that's where they dropped a lot of huge bombs like GameCube controller support and the USB adapter thing and that 8-player smash was gonna be a thing and nobody saw that coming and then they announced Bowser jr. with all the Koopalings custom moves the single-player modes for the Wii U version which admittedly sucked ass and a whole bunch more stuff I think that this direct",
            "start": 639.33
        },
        {
            "text": "and then they announced Bowser jr. with all the Koopalings custom moves the single-player modes for the Wii U version which admittedly sucked ass and a whole bunch more stuff I think that this direct we're getting is going to be the equivalent to that and what excites me about that is a lot of those things were already announced in directed e3 so I feel like there's gonna be some fun stuff up there of Nintendo's sleeves that we're gonna get announced here I imagine there's gonna be a lot of game modes they're gonna really go in on what single-player looks like in the game and what online looks like in the game we don't know anything that's the like at e3 this year they really went into characters and they went into like little tweaks that they made and they announced the game controller but they didn't talk about game modes right so I imagine we'll see a lot of that it's interesting the timing of this considering they still have over three months to go until a launch but I would",
            "start": 689.79
        },
        {
            "text": "but they didn't talk about game modes right so I imagine we'll see a lot of that it's interesting the timing of this considering they still have over three months to go until a launch but I would imagine the game is pretty much finished that they're just in final polish right now in final balancing and things like that they're not like doing any like new feature ads or anything like that it's too way too close to launch for that particularly with how difficult fighting games are to balance but yeah I think this will be really exciting and I hope because of its timing that that means that Nintendo is going to bring something new playable to PAX West at the end of the month they traditionally have a very large presence there because that's in their backyard and I don't see why they wouldn't want to you know showcase their big release for the Fall so far with smash ultimate they've only had the one demo build that they debuted at e3 and then they just have been at different tournaments",
            "start": 730.9
        },
        {
            "text": "want to you know showcase their big release for the Fall so far with smash ultimate they've only had the one demo build that they debuted at e3 and then they just have been at different tournaments an Evo they just had it and at comic-con they had the same build so yeah a new build for pass would be very interesting obviously everybody's biggest questions are is the single player gonna be like a story mode I do not expect there to be a Subspace Emissary one that they hadn't brawl I just think that that takes way too much time and commitment and it'd be so great and we've seen other fighting games you know make sure to add that in and it's been like a highlight totally but that's few and far between I mean the the NetherRealm games definitely but otherwise it's kind of a thing that's just like oh there's this mode and I feel like smash has way too many characters and there's just way too much in the game at this point for the story mode to be anything of substance I feel like it would",
            "start": 775.6
        },
        {
            "text": "like oh there's this mode and I feel like smash has way too many characters and there's just way too much in the game at this point for the story mode to be anything of substance I feel like it would all just be top level fluff it brawl when that came out it needed that that was the one shining thing that brawl had that melee didn't and the cutscenes were cool but the gameplay really sucked like the problem with taking smash which is a fighting game but it's also kind of a platformer and it's also a lot it's also a party game it's also like getting a story into there is very difficult and I would rather than focus on game modes that work for what smash is instead of coming up with gimmicky stuff that's why I thought that the Wii U single-player mode wasn't good because it kind of turned it into a bad version of Mario Party and well I would much rather is the the modes from smash that do work than we've seen in the past like break the targets board the platform the home run derby hit",
            "start": 819.9
        },
        {
            "text": "it into a bad version of Mario Party and well I would much rather is the the modes from smash that do work than we've seen in the past like break the targets board the platform the home run derby hit the hit that on me the adventure mode and the event mode which is my favorite thing which takes classic Nintendo scenarios and I can make you do it so it'll be a battle between link and Ganon and it's like that makes sense you know a lot more of that I think will go a long way less of the gimmicky stuff let's focus on the fluff content right but knowing them does give you a lot of fluff context well I mean of course there is this is like their flagship title you know for the year and they are touting you know these impressive sales numbers and there's a lot of kids who are just getting into the Nintendo ecosystem for the first time so maybe they do want to add some that fluff for you know a younger audience people who maybe never played smash before people like me who have been a lot a",
            "start": 867.21
        },
        {
            "text": "the Nintendo ecosystem for the first time so maybe they do want to add some that fluff for you know a younger audience people who maybe never played smash before people like me who have been a lot a lifelong Nintendo fan but like have never purchased a smash game mm-hmm you are in for a treat I think this one's gonna change you okay it being on the switch you being able to play it on planes where I could play by myself and get you know a feel for the mechanics I know that there's like training mode like the single player there's many single-player modes there's some modes that are actually really good like just classic mode is simple it is it's like Arcade Mode and Street Fighter or whatever it's like that it'll get you hooked I'm really really excited to have you play this I just love your enthusiasm get him into the exciting stuff for this game characters we're gonna get some character reveals here I don't know how many I don't know what to expect for this direct in particular DLC",
            "start": 912.0
        },
        {
            "text": "enthusiasm get him into the exciting stuff for this game characters we're gonna get some character reveals here I don't know how many I don't know what to expect for this direct in particular DLC was announced at that the 50 fact extravaganza and they now so Mewtwo is coming and they tease that there'd be more and then smash what you had it came out and then Mew Mew 2 came out early the next year and then throughout their like it was a year and a half of continued DLC support that even included third-party characters like cloud and Ryu would you want to see you now it's like a Mewtwo level of hype I want them to announce the DLC is a thing for this game not this direct I want them to kind of at least give an idea of a roadmap because in an ideal world for me smash ultimate is essentially a platform that's gonna last the rest of the switch's life I want them to be like this is it is the ultimate smash bros we're gonna keep adding characters because characters are hype and that's what",
            "start": 957.57
        },
        {
            "text": "a platform that's gonna last the rest of the switch's life I want them to be like this is it is the ultimate smash bros we're gonna keep adding characters because characters are hype and that's what people want it will keep people playing this game forever right we're hidden a saturation point with Nintendo characters where we're kind of getting a bit more obscure with because you have to the game because like there's so many people yeah game I don't think the ultimate is gonna have as many newcomers as the other games of heaven every single game has added more than the last game hat in terms of new careful especially if they're like all of the previous characters are gonna be in this one like that's a lot to manage already totally and I see them kind of scaling back a little bit there and who knows when with DLC and depending on how long that that might change but when the game comes out I retail I don't think it's gonna have as many new characters as the Wii U version did but with",
            "start": 1007.85
        },
        {
            "text": "who knows when with DLC and depending on how long that that might change but when the game comes out I retail I don't think it's gonna have as many new characters as the Wii U version did but with the addition of Ecco fighters that they announced that at e3 which is essentially clone characters what's like reskin versions of similar characters that do have slightly different moves and different attributes but like they're very similar I think we're gonna see more of those than new characters maybe and I'm kind of expecting that to even bleed into third party so they announced Daisy as an echo character of peach at e3 I expect expect isn't the right word I can see them adding shadow as a sonic echo character and Ken as a Ryu have echo character and that makes sense and I can see knowing the the history of smash and history of Sakurai the director and his decisions I can see them doing that something to keep in mind for character announcements cuz a lot of people like asking for a lot",
            "start": 1050.8
        },
        {
            "text": "the history of smash and history of Sakurai the director and his decisions I can see them doing that something to keep in mind for character announcements cuz a lot of people like asking for a lot of crazy stuff is the design Bible for this game was completed in the end of 2015 so the chances of getting characters like spring man from arms in the retail game I say are very slim as a DLC character I can totally see it but we need to look at what was hot around 2015 for characters that might make in game which leads me to think that uh that Dixie column has a chance tropical freeze was around there for the Wii U Donkey Kong could use more representation so I can and they can either make it an echo character of Diddy but I also think Dixie has enough unique things about it that they make her a character but just because the design Bible was finished doesn't mean that Nintendo couldn't pivot even as late as like 2017 do you know if they wanted to really put the resources behind it and I",
            "start": 1102.0
        },
        {
            "text": "a character but just because the design Bible was finished doesn't mean that Nintendo couldn't pivot even as late as like 2017 do you know if they wanted to really put the resources behind it and I know that obviously like Sakura is very particular about his production timelines and the way that he runs his team but I mean I have to imagine like that was three years ago at this point you only the only reason I bring that up as a point is on the based on the history of the other smash games and one like could Sakurai super transparent with a lot of this stuff and he's said when the other design Bibles were done and when you look at it it's like oh it they never pivoted the exception being Sonic the Hedgehog which was only two months after they they wrapped their the thing they added that so I just don't expect to see too many currents that's a fair position to take I think that the latest character that we'll see in in the game would be potentially captain toad and I think he'd be a",
            "start": 1150.24
        },
        {
            "text": "so I just don't expect to see too many currents that's a fair position to take I think that the latest character that we'll see in in the game would be potentially captain toad and I think he'd be a very hard character to figure out because he doesn't jump and that's so key and smash but they proven before they can figure things out for characters that have weird situations I mean link jumps he just there's not a jump button but like he still it's not a defining characteristic of him that he does not have the ability because I he like dodge roles and stuff like that right or dad hops right but I I see what you're saying I don't think that that would necessarily mean that he they can't instrument something in the game great little Condor thing can pick him up or something but I want to ask you the first thing that came to mind when we're talking about you know announcements in this new direct obviously content content content but their big thing with the switch has been these you know",
            "start": 1192.33
        },
        {
            "text": "you the first thing that came to mind when we're talking about you know announcements in this new direct obviously content content content but their big thing with the switch has been these you know custom joy cons that have been with each of their kind of tentpole games I would love to see some kind of specialty switch hardware for smash if they announce GameCube joy cons and I'm not just talking color I'm talking a different shape that would be a game changer like they would make so much money on that and that would be such a great decision for this game I don't see him doing it but like I didn't see them adding hardware to make GameCube controllers supported on Wii U and they did that would get me extremely excited but and that's the thing is like they do things that people don't expect no one expected 8-player smash and like that's a pretty big deal and they they made it happen going through some other characters that I think might be there Simon Belmont I think is long overdue",
            "start": 1240.84
        },
        {
            "text": "no one expected 8-player smash and like that's a pretty big deal and they they made it happen going through some other characters that I think might be there Simon Belmont I think is long overdue from Castlevania and with how close Nintendo has been working with Konami on smash I definitely think that he will be in the game some Xenoblade character I'm not familiar enough with the franchise to know who done what I was saying earlier I don't think it'll be a Xenoblade to character I think it'll be Xenoblade X from the Wii U version character and then Gino from Super Mario RPG he's another one of those characters that's been asked for since the mêlée days and when we've seen little Matt get out and we've seen Ridley get added we've seen Sonic get added Gino is like the other one on that list so that would be a big poll but I don't know and then King K rool from Donkey Kong I don't know about licensing with rare and who actually owns him but if a Nintendo can make that work I think that",
            "start": 1288.54
        },
        {
            "text": "so that would be a big poll but I don't know and then King K rool from Donkey Kong I don't know about licensing with rare and who actually owns him but if a Nintendo can make that work I think that they'd want a lot of villain supports in the game so I can see them out of him but what's really interesting here to me is the fact that this direct is happening at 7 a.m. on 7 a.m. Pt which is perfect for Japan time because of that I'm not expecting any third-party Western characters as much as I want crash bandicoot to be in this game and to answer some guys question that would be my get hype moment crash smash is like the Venn diagram is a circle of Tim yetis hype but I don't expect I switch now yep I know but again the design Bible and also there's never been a Western third-party character in Smash and I'm a boy stealth on Twitter like weaning him talk all the time and you just like you need to look at things like that and to try to see where they're going and that could all change and",
            "start": 1332.66
        },
        {
            "text": "in Smash and I'm a boy stealth on Twitter like weaning him talk all the time and you just like you need to look at things like that and to try to see where they're going and that could all change and I would love that but crash minecraft Steve Rayman all these banjo kazooie like all these characters I think they have a lot less of a chance of getting in then a lot of the than the Xenoblade character for example you know and I think that the the fact that this direct is happening to target a Japanese audience also shows that that they want them to get excited about something like a Xenoblade character that maybe Western audiences wouldn't care as much about I'm so excited I'm so damn excited Wednesday 7 a.m. we'll do a live reaction let's see if I'm right about any of that second news story some Evo results from this year's Evo fighting championship series the reports are this was a very interesting evil a lot of really cool things happening a lot of upsets a lot of like new blood in",
            "start": 1380.75
        },
        {
            "text": "some Evo results from this year's Evo fighting championship series the reports are this was a very interesting evil a lot of really cool things happening a lot of upsets a lot of like new blood in the scene and some controversial moments to say the least going through some street fight five stuff this all comes from Nattie Myers at Kotaku if you're interested in fighting games at all they are amazing at writing about them and kind of giving you a good recap I always I check the articles over at Kotaku go read through these if you if you want to get a good understanding of all this stuff for Street Fighter 5 the 8th Street Fighter 5 competitors that made it into Evo 20 18s finals today looked very different from last year's lineup aside from last year's winner hajime katoki doe Taguchi every single one of the other finalists wasn't on last year's stage everybody assumed Tokyo would win but Eva 2018 finals have proven assumptions to be unwise time and time again the big contenders last",
            "start": 1431.24
        },
        {
            "text": "single one of the other finalists wasn't on last year's stage everybody assumed Tokyo would win but Eva 2018 finals have proven assumptions to be unwise time and time again the big contenders last year all got eliminated in this year's competition pools and in the very first match of the finals evo 2017 winner taquito got knocked down to the losers bracket two of the promising first-timers did get knocked out of the competition early including the American favourite Marcus the cool kid 93 Redmond gotta love these names as well as the Dominican Republic's Christopher Kaba Rodriguez this is something I've seen a lot of people on Twitter Tom out that in at least with the Street Fighter 5 stuff the the world was really represented in the Evo and that's super cool yeah fgc has always been a really diverse cross-section of players from around the world more more so than some other types of esports you know we see you know certain genres really having a strong presence from certain countries",
            "start": 1477.4
        },
        {
            "text": "diverse cross-section of players from around the world more more so than some other types of esports you know we see you know certain genres really having a strong presence from certain countries yeah you there's a lot big Asia dominance usually when it comes to the MOBAs and Korea has a lot of strong players yep while problem X showed off his conditioning in the winner's bracket so Kido battled his way through the entire losers bracket eventually facing the very fighter had put him there in the first place calle de fudo ai but taquitos experience in Akuma's versatility or nothing to deny and eventually the veteran clawed his way back into a bracket reset it was midnight local time by then but taquitos smile looked much weaker problem x looked tired sweating rubbing his hands over the bridge of his nose we had more fight left in him and in the end he scissor kicked his way to victory let's check that out and then Dragon Ball fighters after Dominique sonic fox mclean placed third",
            "start": 1521.96
        },
        {
            "text": "bridge of his nose we had more fight left in him and in the end he scissor kicked his way to victory let's check that out and then Dragon Ball fighters after Dominique sonic fox mclean placed third instead of his usual first in the injustice to finals earlier this weekend at Evo 2018 is wondered if the multi-game phenom was slipping his injustice two skills had only wavered because he was focusing on O one o his injustice new skills had only wavered because he was focusing on Dragonball fighters right but then during a Dragonball fighters exhibition match against his rival go chi go Wan Kishida sonic Fox kept dropping combos and lost several matches in a row it didn't seem like the blue fox could turn it around and win it all at evo 2018 but he did and he beat go ones winning streak this match was awesome I watched it and like this dude is a performer he wears this like blue fox mascot outfit and he takes the the hat off when he plays and him whether he wins or loses he puts it on",
            "start": 1569.75
        },
        {
            "text": "match was awesome I watched it and like this dude is a performer he wears this like blue fox mascot outfit and he takes the the hat off when he plays and him whether he wins or loses he puts it on afterwards I'm like celebrates yeah it's awesome nice a lot of showmanship there and then the most interesting one to me surprise surprise was the Smash Bros stuff oh no but check this out this is an interesting story that's been going on here the melee stuff was great as always them you know male he's been such a competitive scene game for them for ever since 2001 but smash Wii U has had its kind of ups and downs in both the fighting game community and the smash community itself because there's so many hardcore melee players right but they've grown over the last couple years but there's been a big issue facing the scene and here's where it is several Bayonetta players made it into the Super Smash Brothers for finals at evil 2018 this year although surprisingly last year's evil winter and",
            "start": 1613.83
        },
        {
            "text": "a big issue facing the scene and here's where it is several Bayonetta players made it into the Super Smash Brothers for finals at evil 2018 this year although surprisingly last year's evil winter and Bayonetta player Salem wasn't one of them Salem's upset last year coincided with the long-standing debate over whether ban Bayonetta's combo linking abilities made her an unfair opponent and after tonight's results that debate shows no signs of slowing down the crowd soured on Bayonetta early on when sixteen year old Bayonetta main captain Zach battled his way into the top eight finals to a course of booing from the crowd after wrapping up his controller captain Zach shot a business-like middle finger to the crowd I like Matt again watch this stuff he just goes out there just just like feeling it up and it's like oh this is not a good scene at all yeah the commentators noted their disapproval of the young players behavior but came down more strongly against the audience's booing which",
            "start": 1661.89
        },
        {
            "text": "it up and it's like oh this is not a good scene at all yeah the commentators noted their disapproval of the young players behavior but came down more strongly against the audience's booing which would continue throughout the rest of the smash 4 finals during their final match Lima died by accident and captain Zak flung himself off the ledge as well in a show of solidarity after captain Zach won that game and reset the bracket kicking off yet another Bayonetta versus Bayonetta best of five the crowd didn't sound happy but the two players on stage were laughing together like old friends in fact they didn't seem to want to fight at all anymore at the start of the final reset captain Zack and Lima faced their Bayonetta's toward each other and didn't attack for several seconds just taunting and dancing well I mean I can only imagine the frustration of you know practicing and practicing practicing going into evil weekend and then having the crowd just you know reject you like that it's just",
            "start": 1704.94
        },
        {
            "text": "dancing well I mean I can only imagine the frustration of you know practicing and practicing practicing going into evil weekend and then having the crowd just you know reject you like that it's just it would be really kind of defeating and deflating right like I would be kind of it would shake you a little bit you know so this is such an interesting controversy here because there's multiple sides to it right and there isn't one right answer but the crowd booing like they're at fault because that's up and don't do that but the game is broken where unless you're playing as Bayonetta it's not Smash Brothers anymore it's just Bayonetta the fighting game like everybody that's winning competitions they have to play Bayonetta because other characters just don't stand a chance well then why didn't the Evo organisers maybe talk with the players and say hey let's make a let's make a rule that no one can choose Bayonetta no that's the thing like there's been a lot of talk of banning the",
            "start": 1744.12
        },
        {
            "text": "didn't the Evo organisers maybe talk with the players and say hey let's make a let's make a rule that no one can choose Bayonetta no that's the thing like there's been a lot of talk of banning the character and they didn't and the crowd is responding to that I mean in fairness in the crowds defense like watching the same characters fight over and over again does get a little boring so they got they were stalling each other and like not going on with the fight and the Evo refs or whatever had to be like if you guys don't fight and finish this the third place winner is gonna be first and you guys are both disqualified and I like turn into this this real heated thing and they of course took it to Twitter 16 year old style talking a lot of about the haters in the crowd and whatever but it's like yeah the people weren't necessarily booing the competitors they were booing Evo for allowing this to happen half the crowd got up and left yikes straight up left the Grand Finals that's bad and it",
            "start": 1791.46
        },
        {
            "text": "yeah the people weren't necessarily booing the competitors they were booing Evo for allowing this to happen half the crowd got up and left yikes straight up left the Grand Finals that's bad and it just sucks like going into smash ultimate that this is the mash fours like final hurrah and it like went out like this not a good scene this is a question from CJ about evo says hey Andrea and Tim first time a long time did either of you turn into Evo this weekend I wanted to give a shout out to the amazing international competition and how well women and people of color performed particularly sonic Fox and Dragon Ball fighters little imagined in Tekken and problem X in Street Fighter 5 the fighting game community can get a bad rap from outsiders a lot of the time but this weekend was a good one to get a better glimpse at the true nature of the community well they're just competitively fierce but full of love and passion just make sure you close the chat window welcome back for and breaking",
            "start": 1834.45
        },
        {
            "text": "to get a better glimpse at the true nature of the community well they're just competitively fierce but full of love and passion just make sure you close the chat window welcome back for and breaking thanks for all that you do I didn't watch anything in full but I always check out the highlights and like I said earlier Matty Myers over at Kotaku always does a great job of like letting me know what the must-see clips are Kevin just knock something over did you watch any no I mean obviously we were both in Austin all weekend so I didn't get to check out any of the highlights because it like went out very late into the night yesterday but I'm planning to watch I've been to Evo I've been to you know the street fighter finals it's such an exciting crowd to be a part of and the energy and the passion truly is there and I'm glad that CJ brought this up because I mean not wrong that fgc has a lot of stigma around it and it's crazy because I feel like certain circles online from fgc are",
            "start": 1883.68
        },
        {
            "text": "the passion truly is there and I'm glad that CJ brought this up because I mean not wrong that fgc has a lot of stigma around it and it's crazy because I feel like certain circles online from fgc are incredibly toxic but when you're at Evo you get to actually be in the community and meet the meet the people who have traveled to come and watch like the best of the best compete it's a whole different scene it's a whole different vibe and super welcoming very friendly I mean you can just feel the love everybody has for these games and for the competitive scene and I think that's what's awesome about Evo every year it reminds people in the industry that like this is why you know fgc is important why it's important for developers to keep supporting that genre even though it seems like it's kind of waned in the last couple of years really the last decade in favor of more like shooter or action focused games but that being said I mean there's there's both sides to it you know it's it's",
            "start": 1928.02
        },
        {
            "text": "kind of waned in the last couple of years really the last decade in favor of more like shooter or action focused games but that being said I mean there's there's both sides to it you know it's it's unfortunate that the minority who are super toxic steal the spotlight from the people who are not yeah I have never been to Evo and it's not necessarily the type of thing that I'd be into just because like I don't understand fire here's the thing is over the last couple years every time I'll be at a convention around it's usually r-tx or Comic Con I'll see people that I go to Evo dude oh you Nev I'm like nah it's not really my thing is like no dude Evo is the biggest party convention of all time it's like moment you've ever and that's like over the last couple years I'm like you know what I would love this it's all hype it's all production it's all just insanity and I'm like I want to go but every year it's during something else that we have to do but one day I will make it to Evo because I",
            "start": 1976.17
        },
        {
            "text": "love this it's all hype it's all production it's all just insanity and I'm like I want to go but every year it's during something else that we have to do but one day I will make it to Evo because I want to be there and then see it all happen when there's the commentators in the shoutcasters do you hear them in the crowd oh yeah definitely Oh awesome because I the thing I liked least about going a live sporting events is not hearing the commentators yeah that's that's an interesting eSports choice that some games make I agree with you I think if you know like you want to be able to hear that play-by-play and at Evo you do yeah now I haven't been to every game at Evo so I don't know I've mostly watched a couple smash rounds at but mostly I'm there to watch the Street Fighter competitions but yeah they I mean it's a giant stage cuz like whenever I go to WWE events like I love them and they are just hype incarnate but it's kind of dull not hearing the announcers like lose their minds over",
            "start": 2025.57
        },
        {
            "text": "yeah they I mean it's a giant stage cuz like whenever I go to WWE events like I love them and they are just hype incarnate but it's kind of dull not hearing the announcers like lose their minds over stuff and you're kind of watching all right this is cool but I kind of prefer that home like oh god it's all Abaddon oh yeah for sure story number three more evil stuff Bandai Namco announced a whole bunch of things your eyes do not deceive you you're pounding heart does not betray you negan from AMC's The Walking Dead is making his way to Tekken 7 to deal a world of pain in the Tekken universe negan beloved by fans of The Walking Dead for his charismatic yet sinister demeanor is ready to destroy all challengers regardless of their stature in the Tekken Universe so it is the knee based off the show not the the comic I think this is a weird choice because you think negan you definitely think baseball bat you think you'll add the tech it is not a weapon space fighter so especially when",
            "start": 2070.03
        },
        {
            "text": "the show not the the comic I think this is a weird choice because you think negan you definitely think baseball bat you think you'll add the tech it is not a weapon space fighter so especially when Bandai also has so caliber six coming out let's see it was like a better fit yeah it was definitely would have been a better fit but I mean I don't know I feel like anybody can show up in the Tekken universe these days totally it's true and then cooler the eldest son of King cult and elder brother - Frieza I love very much joins the growing cast of characters in Dragon Ball fighters and finishing our evo 2018 announcement round out both Astaroth and sung mina are entering the Soul Calibur six arena to slice up opponents of a huge foes as they join the latest chapter of the stage of history in the Soul Calibur universe jerry pattee was probably very excited about that we'll ask him about it tomorrow ah Story number four not so much a news story just something I like bringing attention to",
            "start": 2117.79
        },
        {
            "text": "the Soul Calibur universe jerry pattee was probably very excited about that we'll ask him about it tomorrow ah Story number four not so much a news story just something I like bringing attention to when games are doing really well dead cells reviews are in and it is performing outstandingly GameSpot gave it a 9 out of 10 IGN a nine point seven out of ten push square nine out of ten us gamer a four point five out of five this game looks awesome I cannot wait to get my hands on it and I'm really happy that it's doing as well as it is so check that out if you are interested in if you do not know what dealt dead cells is do self a favor favor go youtube it right now it looks beautiful super cool and then final news story of the day this is a weird one The Legend of Zelda breath the wild now is an official place in the series timeline at legend zelda series timeline has recently been updated to include breath of the wild but it's not as well revelatory as you might think Nintendo's",
            "start": 2171.28
        },
        {
            "text": "now is an official place in the series timeline at legend zelda series timeline has recently been updated to include breath of the wild but it's not as well revelatory as you might think Nintendo's Japanese website has been updated with the new timeline and the breath of the wild sits at the end unconnected to any of the other three timelines thanks in an interview with for Mitsu breath the wild director or Jesus Christ fujibayashi says exactly which timeline it rounds out to is up to the players imagination I mean it does this surprise you at all I'm gonna continue the Tendo Japanese website has been updated with the new timeline oh man a copy pasted this twice hi rules this is a call from him Hyrule's history changes with time when we think of the next game and what we want to do with it we might think oh this will fit well and place it neatly into the timeline but sometimes we think oh crap and have to change the placement actually the decided history has been tweaked many times",
            "start": 2218.5
        },
        {
            "text": "it we might think oh this will fit well and place it neatly into the timeline but sometimes we think oh crap and have to change the placement actually the decided history has been tweaked many times they call this rejigging of Hyrule's history a new translation saying that strictly speaking the history doesn't change but rather new information in truths come to lights that is the most BS way seen we're gonna do whatever we want to do and you can't do anything about it that's why whatever we're the ones making this a news story so it's probably the problems on us who the cares about all this stuff I do like the idea of it being a new translation and it actually being the Legend of Zelda where it's like it doesn't all fit perfectly because it is just this thing that's passed down generation generation but then it also got a pisses me off because like well then why even try why even commit to it it's like the goddamn x-men Cinematic Universe where it's like great so breath the wild is",
            "start": 2268.69
        },
        {
            "text": "generation but then it also got a pisses me off because like well then why even try why even commit to it it's like the goddamn x-men Cinematic Universe where it's like great so breath the wild is essentially Logan where it's like yeah it takes place in the future what happened in between who knows but just like Logan breath the wall was the best ball game so there you go now it's time yeah it's gonna be a wild so we get another Zelda game and yeah well but if we wanted to know what games were coming out today where would we look Tim you would go the official list of upcoming software across each and every platform is listed by the kind of funny games daily show host each and every weekday dududududududududududu out today loot monkey bling palace on the switch that's it you gonna pick that one up today I have no idea what that is no I'm still playing I'm still playing overcooked - oh there you go you know what it's really impossible to play by yourself yeah that game frustrates me to",
            "start": 2311.7
        },
        {
            "text": "one up today I have no idea what that is no I'm still playing I'm still playing overcooked - oh there you go you know what it's really impossible to play by yourself yeah that game frustrates me to no end especially play with Greg is he's so good at it Greg and Joey are both really good at it I'm just like ah I forget to - hmm I always forget to - when in doubt - I believe the review embargoes are up for that tomorrow new dates what didn't the game come out no yeah I coulda sworn it was like August no team17 provided us with early copies no it comes out tomorrow yeah okay it was close new dates for you destiny - forsaken is having a livestream on Tuesday August 8th or 7th at 10 a.m. Pacific time on Twitch ITV / Bungie so if you're interested in that go check that out and the Nintendo clarified some things about Xenoblade from next month you'll be able to play the additional story DLC for Xenoblade Chronicles - entitled torna the golden country expansion pass owners can download it",
            "start": 2359.86
        },
        {
            "text": "some things about Xenoblade from next month you'll be able to play the additional story DLC for Xenoblade Chronicles - entitled torna the golden country expansion pass owners can download it from September 14th while the standalone retail release will be available on September 21st this is the first time confirming that there will be a standalone retail release where you don't need the original game to play it tokyo dark remembrance the anime style horror adventure from sony publishing label unties and charity mochi where a detective works as a sanity bending case comes to ps4 and switch this winter cool and a football manager 2019 is going to debut on November 2nd deals of the day for you can get a SanDisk Ultra Plus 128 gigabyte micro SDXC card which for the switch for just 26:54 guys a great deal for a lot of storage therefore your switch and now it's time for reader mail brought to you by 3rd love and Omaha Steaks let me tell you about this third love new sponsor for us exciting",
            "start": 2419.96
        },
        {
            "text": "a great deal for a lot of storage therefore your switch and now it's time for reader mail brought to you by 3rd love and Omaha Steaks let me tell you about this third love new sponsor for us exciting it is a company that does that does bras it's for the kind of honey all them kind of honey's out there Jia just got hers she's loving it it's really cool because it's a convertible pearl and I was like what is that Jia please tell me more it can be strut that can have straps or you can take the straps off it is just strapless this is all new to you this is all new information I was like that is awesome let's see here using thousands of real womens measurements third love designs it's bras with breast size and shape - it'll fit impeccably and feel even better the most sizes of any brand third love just added 24 new sizes making them the industry leader with a total of 70 sizes and as his key information because Jia is a half size and she was telling me that she loves this sizes are a real",
            "start": 2467.12
        },
        {
            "text": "love just added 24 new sizes making them the industry leader with a total of 70 sizes and as his key information because Jia is a half size and she was telling me that she loves this sizes are a real important exactly she's like this actually fits me how I want it to quality in every stitch the details make the difference from premium fabrics to expert design and convenience skip the trip you can find your fit in sixty Seconds online order and try it on home no more of those awkward fitting room experiences you ever have those oh yeah I just I straight-up deny and every time you go in there like let's do a fitting I'm like now I'm good yeah so I got some testimonials because obviously I don't have too much to say about this myself yeah but gia says yes it's very chic and simple the convertible and the strapless makes me very happy and then she reached out to her friends because she knew that they used these and have been using them for years her friend says very comfortable another",
            "start": 2519.08
        },
        {
            "text": "and the strapless makes me very happy and then she reached out to her friends because she knew that they used these and have been using them for years her friend says very comfortable another friend says there's no line showing when you're wearing the shirt yeah they have very pretty ones too that she has a basic nude one that's pretty invisible under most clothes and she also has a lacy black one that's very sexy and guys like it yeah I think about most women's they don't know how important the nude bra is to the wardrobe tell me more please as somebody who's on camera for a living almost my entire collection our new bras because you don't want that weird moment where you get like a colored thing showing in your shirt and then everyone's staring and then it gets awkward I have lots of friends who use 3rd love as well I'm waiting for my order to arrive I'm excited to try them out and they have nothing but really fantastic things to say and it's tough because as women sometimes we get",
            "start": 2560.75
        },
        {
            "text": "who use 3rd love as well I'm waiting for my order to arrive I'm excited to try them out and they have nothing but really fantastic things to say and it's tough because as women sometimes we get into these like habits of always going to the same place and getting the same type and it takes something like this where it's like hey we're gonna try this new company for me to like break out of like just going to pick up the same thing I always pick up so I'm actually really excited to try a new brand you you said you had friends that you stared love as well right mm-hmm what do they have to say they love it and I when I found out with it you guys were gonna be working with them I was like oh I've heard other girls I know talk about this company I'm really excited to try it out finally something I'm really excited for you to be able to try is there it's tagless so no itching I'm excited about that fabrics straps that won't slip lightweight super thin memory foam cups man all this is very",
            "start": 2600.44
        },
        {
            "text": "I'm really excited for you to be able to try is there it's tagless so no itching I'm excited about that fabrics straps that won't slip lightweight super thin memory foam cups man all this is very exciting stuff third loves knows there's no perfect bra for everyone so right now they're offering listeners 15% off of your first order you can go to third love.com slash games that's th IRD l.o.v.e comm slash games to find your perfect fitting bra get 15% off your first purchase that third love comm slash games for 50% off today and guys out there there's a lady in your life if you're trying to get him a present go for it third love.com slash games good time for everyone and also shout out to Omaha Steaks we talked about Omaha Steaks so many times on this show it's because we love it Greg Miller always talks about how for Father's Day he got his dad these steaks and then now his dad keeps getting Greg the steaks every every time he gets a chance with it's a birthday or Christmas or whatever",
            "start": 2644.24
        },
        {
            "text": "always talks about how for Father's Day he got his dad these steaks and then now his dad keeps getting Greg the steaks every every time he gets a chance with it's a birthday or Christmas or whatever and man this company is happy for it we get so much meat and it's a good time for everyone Kevin tell us about these steaks they're so good I have my freezer right now I love how they individually wrap everything because if you go to you know your local butcher or a grocery store if you don't want to use it all then you freeze the package and then you have to like unstick them from each other don't have that problem with them huh if I just want one steak by myself when Jon's off you know gallivant all about making deals I can just pull one single steak out of the freezer here's the thing they have three things they focus on here quality variety and customization all the highest-quality cuts with one-of-a-kind flavor all beef is USDA inspected for quality and aged for 21 days to unlock the",
            "start": 2689.26
        },
        {
            "text": "have three things they focus on here quality variety and customization all the highest-quality cuts with one-of-a-kind flavor all beef is USDA inspected for quality and aged for 21 days to unlock the full flavor and tenderness of the cuts all the best cuts of beef bison from the Golden Plains globally sourced and fresh frozen fresh seafood from Worldport seafood poultry pork veal lamb vegetables and desserts and almost eight gives you the option to customize cuts for your grilling needs you can find recipes with wine pairings etc I know you love them wine pairing oh you know I do right now Omaha Steaks is giving a limited time offer to listeners for the summer go to Omaha Steaks com type KF games in the search bar and you can get the Omaha Steaks grill ready collection for only $39.99 that is 80% off Wow here's what you've got to tender filet mignons to beefy top sirloins for juicy boneless pork chops for boneless chicken breasts for all beef Omaha steak burgers for traditional",
            "start": 2729.34
        },
        {
            "text": "that is 80% off Wow here's what you've got to tender filet mignons to beefy top sirloins for juicy boneless pork chops for boneless chicken breasts for all beef Omaha steak burgers for traditional kielbasa sausages four award-winning gourmet jumbo Franks what was that keV was that an audible gasp one Omaha steak seasoning packet and you plus you get four made from scratch caramel apple tartlets for free last bachelor Monday me and you or like we had dinner but we're just a little more hungry we just wish we got it we opened up our freezer we saw some of those sitting there and I was like it's gonna be a good night and goes it was again you give this limited-time package for only $39.99 when you go to Omaha Steaks com type KF games in the search bar and add the grill ready collection to your cart don't wait you want to get this offer soon in time for the summer go to Omaha Steaks com type KF games in the search bar grab your friends and family and fire up the grill reader mail time",
            "start": 2770.17
        },
        {
            "text": "your cart don't wait you want to get this offer soon in time for the summer go to Omaha Steaks com type KF games in the search bar grab your friends and family and fire up the grill reader mail time Connor Reese writes in and says what were your favorite moments from RT x this is a big open-ended question um one of my favorite moments from Archie X was the meet and greet that we did because it allowed us to have some really cool conversations with some people who are part of our community and listen to the show we met a girl an amazing artist who created some custom pieces of art for us and brought them for us to take home but more importantly she told us the story of how listening to the show inspired her to start taking Unreal Engine developer classes because she's like well I was maybe I can make art inside of video games and so now she's learning to become a video game developer and I was so blown away by the fact that she said that if she hadn't been listening to our show that",
            "start": 2819.73
        },
        {
            "text": "I can make art inside of video games and so now she's learning to become a video game developer and I was so blown away by the fact that she said that if she hadn't been listening to our show that she wouldn't have even considered that and now she's going to classes and hopefully she'll join the amazing ranks of video game developers out there hell yeah I have a couple I want to shout out we did a stand-up comedy night the second time a lot of us have ever done stand-up Nick obviously done a lot more and he hosted it was his first time hosting though and I thought he did a great job and I'm just so proud of our whole team and all the arty people that went up with us because even though it was my second time going up I was just as nervous as the first time and I was I was myself like I literally I literally thought I was gonna throw up in the hotel like it was bad and I usually don't have nerves like that but then once I got up there like I got this and once I got often like I feel so",
            "start": 2877.9
        },
        {
            "text": "I literally thought I was gonna throw up in the hotel like it was bad and I usually don't have nerves like that but then once I got up there like I got this and once I got often like I feel so good I'm so proud of myself for doing this and it's just this feeling of all of us pushing ourselves to do something that were uncomfortable with and I love that like seeing Andy like really put himself out there and you know and Greg who is always already out there but see him kind of try to hone a different craft I'm very proud of the whole team for doing that I'm especially proud of Joey for being on the ladies of let's play panel which was a fantastic panel full of amazing people and I thought that they all did such a good job I expected them to but it was really above and beyond anything that I I was expecting there was a very insightful panel they were they're all very funny women and I I feel really good that kind of funny was brought up by almost all of the people on the panel as people",
            "start": 2921.14
        },
        {
            "text": "I was expecting there was a very insightful panel they were they're all very funny women and I I feel really good that kind of funny was brought up by almost all of the people on the panel as people that they all like to work with and I'm I like that we've created a situation where these amazing people think that we are cool so that's awesome and also shout to snow bike Mike who once again killed the game at our panel was so awesome and it warms my heart that when we did audience Q&A one of the the people who are campaigning to for us to hire snow Mike Mike and I just think it's such a cool thing that the the community is rallying behind someone else in the community so he's a good dude such a good dude um comeback head says hey Tim and Andrea Andrea have you done any of the solstice of Heroes event for investing to to gear up for Forsaken and if so how do you feel about the event yes I have so I'm just starting to get into it with the with the what's good Guardians I first I think I",
            "start": 2963.44
        },
        {
            "text": "event for investing to to gear up for Forsaken and if so how do you feel about the event yes I have so I'm just starting to get into it with the with the what's good Guardians I first I think I wasn't confused about all of the contents that they were doing but the thing that I'm really most excited to dig into is going after this new power armor set so when you begin the the event you are you get low level gear it's like a 200 level full set of armor and then the idea is that you have to wear the set while you go and do all of these PvE items in the world and then when you go and into the crucible as well and at first I was really kind of angry because I've been busting my butt trying to get to the MaxLite level and then I had to wear all of us like 200 level gear and I'm like why am I doing this but at least I get to keep my super high-powered guns which helps particularly in the PvE stuff and so I'm looking forward to really exploring that and looking at my moments of triumph and",
            "start": 3013.54
        },
        {
            "text": "doing this but at least I get to keep my super high-powered guns which helps particularly in the PvE stuff and so I'm looking forward to really exploring that and looking at my moments of triumph and really kind of jumping back into destiny in a in a big way and I've really gotten more into it over the last couple of months but you know we're a month away from Forsaken now and and I've really just kind of rediscovered my love for this game and I know that there's still plenty of people out there who are upset about things from the game and I'm with you I'm not trying to take that away from you and I there's still more than I want to see so I'm looking forward to this livestream they're doing tomorrow morning to see if they're gonna announce it like really you know kind of finite changes to quality of life stuff but I've been really enjoying it and I just always love when they decorate the tower the Common Spaces it's it's fun mmm tag lesotho says hey KF crew I was wondering since Epic",
            "start": 3065.95
        },
        {
            "text": "quality of life stuff but I've been really enjoying it and I just always love when they decorate the tower the Common Spaces it's it's fun mmm tag lesotho says hey KF crew I was wondering since Epic Games is ditching the Google Play Store for the Android release of fortnight do you think that this will pave the way for other developers to follow suit and cut the middleman out for microtransaction sales or since fortnight is a big name that it can do this without any repercussions I think it might pave the way for other massive publishers to do this but for the most part smaller publishers are still gonna have to rely on Google's infrastructure primarily for the payments processing so epic has their own launcher of his Lee so they already have the infrastructure set up to handle all of these payments from all of these different countries around the world and that's like the big benefit to using a platform like Steam like Apple like Google is because the money part is really the",
            "start": 3109.29
        },
        {
            "text": "of these payments from all of these different countries around the world and that's like the big benefit to using a platform like Steam like Apple like Google is because the money part is really the complicated thing is that transaction especially when you talk about having an international release you're just doing it in one country wouldn't be as difficult and so I think that obviously the money is a big reason but EPIK is not exactly hurting for money right now so it's not the only reason and I want to bring up a story that was on polygon that was written by Ben Kuchera over there and it's he they reached out to Tim Sweeney of course the head of epic and asked him about this and why they decided to make this choice and Tim Sweeney told him regarding if it was purely a financial this isn't decisions said quote no that wasn't a factor I don't think we should fault Google or Apple for the appearance of clones or excuse me let me read the whole thing for context Epic Games is shaking",
            "start": 3154.72
        },
        {
            "text": "decisions said quote no that wasn't a factor I don't think we should fault Google or Apple for the appearance of clones or excuse me let me read the whole thing for context Epic Games is shaking up the world of mobile gaming by announcing it's not going to the official Google Play Store to bring fortnight to Android the game will instead only be available as a download direct from epics own website it sounds as if this was purely a financial decision I asked Epic Games CEO Tim Sweeney over emailed the hoods even partially a reaction to all the unofficial fortnight apps that already exists in the Google Play Store no that wasn't a factor Sweeney told polygon I don't think we should fault giggle or Apple for the appearance of clones they operate stores that accept hundreds of thousands of products from the developer community so it would be impossible to keep track of the original authorship and there's a reasonable DMCA notice process for developers to inform them when copyright",
            "start": 3203.25
        },
        {
            "text": "of products from the developer community so it would be impossible to keep track of the original authorship and there's a reasonable DMCA notice process for developers to inform them when copyright infringement does occur but epic games won't be able to rely on the built-in features of Google Play for things like receiving payments are making sure children can't buy skins or in-game currency without their parents permission these are problems that also exist in the PC version of the game and it sounds as if epic is mostly sticking to those strategies quote first of all no payments are possible unless you define a payment method for your fortinet account Sweeney explained then we support one-time payment so that a permanent payment method isn't remembered for the account will be working on more features along these lines over the coming months applicable to all platforms for epic accepts payments directly hmm so I think that this is an interesting response those are clearly big issues",
            "start": 3239.4
        },
        {
            "text": "more features along these lines over the coming months applicable to all platforms for epic accepts payments directly hmm so I think that this is an interesting response those are clearly big issues in the gaming community and why micro transactions have been looked at and why legislation around micro transactions is something many countries around the world are considering that being said I don't think they really need to worry about inappropriate content from Fortnight however I think you know the possibility for kids to spend a lot of money in for tonight certainly exists but hopefully parents are being mindful like don't give your children access to money totally I think that's what it really comes down to yeah so we'll see it's exciting news I love when there's like this like like switch ups like that right because it forces all their companies to reevaluate what they're doing and how their services work like even Google right and like this this whole situation with patreon",
            "start": 3273.87
        },
        {
            "text": "switch ups like that right because it forces all their companies to reevaluate what they're doing and how their services work like even Google right and like this this whole situation with patreon that's been happening over the last week it this reminds me of that where it's like for people that don't know like there was a big issue with how patreon changed their credit card processing assessing like where it comes from in terms of the from European side of things or American side of things and like it's really kind of over a lot of patreon users by content creators and you know having other options for for revenue is like super important and being able to control your own is always ideal and epic being like you know what we don't need to deal with your processing we can just do it ourselves very payed for the infrastructure why not use it right I'm sure like the people you know in the money department are like you know we spent and we invested significant money an engine and an",
            "start": 3319.93
        },
        {
            "text": "very payed for the infrastructure why not use it right I'm sure like the people you know in the money department are like you know we spent and we invested significant money an engine and an engineering and coding team to build out this infrastructure for our launcher how much more would it take and would that be a savings off of paying Google their platform cut you know we shall see final question of the day comes from Zak Zak writes in and says hey KF Gd crew welcome back last week Sony announced they have shipped eighty two point two million ps4 s I was listening to the EZ Allies discuss this love and respect to all the Allies and they mentioned something I never really thought about the ps4 will in all likelihood end up being the second best-selling home console of all time with a little more than twenty million to go until they surpassed current number two PS ones one hundred and two point five million where do you see ps4 topping off when all is said and done will it even come",
            "start": 3365.83
        },
        {
            "text": "more than twenty million to go until they surpassed current number two PS ones one hundred and two point five million where do you see ps4 topping off when all is said and done will it even come close to the PS 255 million love everything you guys do also shout-out to the Prez and one true champ for given kind of funny a week off it's such a great guy you know I was we also talked about this on what's good last week as well and how wild these these ps4 numbers are and how great it is that Sony is like having a fantastic generation I think that the ps2 was a phenom for a variety of reasons I don't think wait what DVD it being a DVD player that was a big thing to and also I think it was in an era of console generations where it just was offering something that no other consoles had really offered at that time in the library on that system was really fantastic I don't think the ps4 is going to top the PS twos numbers I honestly don't know if any console will ever be able to top it again",
            "start": 3407.05
        },
        {
            "text": "at that time in the library on that system was really fantastic I don't think the ps4 is going to top the PS twos numbers I honestly don't know if any console will ever be able to top it again just because of how quick the generations are going now that's the thing it's how many more options there are today the ps2 the DVD player thing going for it which honestly I think contributed to the biggest chunk of the the pie chart because I know so many people to this day that still have a ps2 that didn't buy a single video game it was just the best DVD player choice at the time and that's what Best Buy was pushing that's what Walmart was pushed and that's what everyone was pushing so people that didn't know video this is just my DVD player and that was right when DVDs were hitting that point of oh this is the time to get into this VHS is dead we got the matrix coming out there's all this stuff right so people invested there then what you're saying is absolutely correct the console",
            "start": 3461.26
        },
        {
            "text": "point of oh this is the time to get into this VHS is dead we got the matrix coming out there's all this stuff right so people invested there then what you're saying is absolutely correct the console generation was so long on than ps2 and that is probably the biggest reason it was so long with can consistent rate consistent great releases throughout its entire lifespan leading right up to the end God of War 2 came out like after the ps3 was out I want to say like I think that's a kind of not it was within months like it was so so so close and I think that's a testament to how much Sony cares about its first party lineup and you look at B s4 and like they care even more now but ps4 doesn't have that kind of x-factor of the DVD player I think so I don't think it'll outdo the ps2 it will definitely outdo the ps1 mmm and this thing we still got a couple years left and we have so many major releases that we know are going to push sales for the hard way spider-man alone right be such a huge",
            "start": 3504.55
        },
        {
            "text": "outdo the ps1 mmm and this thing we still got a couple years left and we have so many major releases that we know are going to push sales for the hard way spider-man alone right be such a huge win for them well not only that I mean obviously everything they showed it III is still coming down the pipeline but they also will continue to sell ps4 into the PS 5 generation I mean we saw the conversions from ps3 and ps4 really kind of take the first like two to three years I still know people who are gaming on their ps3 and I was like why haven't you gone over to ps4 yet you can get them you know throughout the year on various sales and so I know that's what I told them interesting no doubt though they'll cross that ps3 number so ps1 if it's the second best selling system at 102.5 what's interesting is I was like where's the wii i the wii is right around 100 million Wii is that 101 point six three yeah that is a very small gap there hmm and if the we couldn't even outdo the ps1 cuz like",
            "start": 3563.86
        },
        {
            "text": "is I was like where's the wii i the wii is right around 100 million Wii is that 101 point six three yeah that is a very small gap there hmm and if the we couldn't even outdo the ps1 cuz like like if the ps2 at DVD though we had the the blue ocean thing going for it where it's just like everybody was playing it so I definitely think be as far as gonna cruise past that and that's insane because that was like a that was a phenomenon yeah so if P is for cruises past that that means Sony has the top three consoles of all time yeah dope is that's insane now some squad up duarte see Rosa that is on Twitter D you arte c ro sa says hey guys kind of a very different squad up I'm visiting San Francisco from the 16th to the 20th of August and I would love to meet someone who has done or is doing an MBA at Stanford or Berkeley as I'm applying this year hit me up on Twitter if you feel like it much love Duarte hit him up I'm sure there's somebody out there that falls into that category but help",
            "start": 3617.23
        },
        {
            "text": "MBA at Stanford or Berkeley as I'm applying this year hit me up on Twitter if you feel like it much love Duarte hit him up I'm sure there's somebody out there that falls into that category but help your boy out Duarte see Rosa now it's time for you wrong you can go to conflate comm slash you're wrong to let us know what we got wrong during the show Andrea how do we do T G Bert says go one is actually pronounced go ichi ichi is one in japanese go beat you mmm-hmm hey tim says unsexiest comedian just to let you know sonic fox isn't wearing them mascot costume for fun he's a confident gay furry and he identifies as a blue fox not to be a mascot or anything like this it's been a point of progress so he's celebrated when he's open about both his sexuality and his furry identification 2018 is wild man twins is wild I did not mean any offense obviously any which way I mean but Roman ship for sure totally I'm trying to just but see what he says okay so I'm so sure is Ignacio says for the",
            "start": 3674.72
        },
        {
            "text": "is wild man twins is wild I did not mean any offense obviously any which way I mean but Roman ship for sure totally I'm trying to just but see what he says okay so I'm so sure is Ignacio says for the smash for Evo Grand Finals reset the allot of time where the two Baio players were stalling was around two and a half minutes that's really long while they held the neutral be special the two players were also getting pseudo interviewed by the MCS of the event a messy ending to smash part Evo unfortunately that sucks yeah Ignacio Roja says Tim mentioned rule 16 when talking about the Smash Bros Evo drama the rule has nothing to do with how team used it here's the link for the Urban Dictionary definition I want Andrea to read it did I mention rule 16 no I'm not going to read this up Ignacio alright I'll look it up and see how inappropriate it is no Ian mr. mr. Rojas mm-hmm rule 16 states that there are no females on the internet specifically in role-playing games and chat rooms rule",
            "start": 3724.46
        },
        {
            "text": "alright I'll look it up and see how inappropriate it is no Ian mr. mr. Rojas mm-hmm rule 16 states that there are no females on the internet specifically in role-playing games and chat rooms rule expanded rule 16 states that all internet men are men all instant women are really men and all internet children are policemen don't think I mentioned that because I don't even know what that would be in reference to but alright there's more Evo stuff let's see here strife II says for weapon based characters in Tekken 7 us um it's use obviously been a mainstay but knocked us for final fantasy is also in Tekken 7 using all of his weapons from 15 interesting wrong never thought I'd see Noctis Yoshimitsu and negan fighting not sure I needed to I did we I don't think we talked about Battle Royale fortnight Battle Royale be an early access did we know I don't I don't even know where that's coming from I'm okay another one no it's more Evo stuff lord of prone says the ps2 was out for six years",
            "start": 3781.55
        },
        {
            "text": "fortnight Battle Royale be an early access did we know I don't I don't even know where that's coming from I'm okay another one no it's more Evo stuff lord of prone says the ps2 was out for six years before the ps3 came out yeah but just because the ps3 came out doesn't mean they stop supporting the ps2 that's what our point was that that generation was supported for I believe a full decade yeah yeah before Sony stopped making ps2 s and stopped making ps2 games yeah here's the God of War stuff kebab says God of War 2 was released in March 2007 four months after the ps3 is released in Japan in the US and the same month ascend Europe and so that's an entire year after the ps3 launched so Tim was right wow that's nuts I didn't realize it was that long yeah that's it that's a testament and I feel like the ps4 is gonna see a similar type of situation depending on what ps5 is with iris compatibility we won't we might see who knows tomorrow it's gonna be me and Jared no it won't be Tim what",
            "start": 3854.18
        },
        {
            "text": "feel like the ps4 is gonna see a similar type of situation depending on what ps5 is with iris compatibility we won't we might see who knows tomorrow it's gonna be me and Jared no it won't be Tim what it's me tomorrow and it's me on Friday mr. Jared Petty is hard at work on some things over at hot flippa.com so he unfortunately will not be joining us this week oh great I mean why I love him but I love you too so it's gonna be great it's gonna be fine until then I love you it's good our pleasure sir that's true",
            "start": 3913.81
        }
    ]
}