{
    "id": 800,
    "video_id": "BcUEO_TrdQA",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Best Video Game Soundtracks - Kinda Funny Gamescast Ep. 17 (Pt. 3)",
    "description": "What are our favorite video game soundtracks of all-time?\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1430312400,
    "duration": 1437,
    "transcript_chunks": [
        {
            "text": "[ Music] All right, third topic of the day is actually, you know what, let's do the last one. Let's get it out of the way. Then the fourth topic , we just have one more sponsorship fin integration. What is it, Greg? The show alive? Is it ProFlowers.com? Why don't spoil it? All right, I'm pulling up the new ad. All right, okay, it's booting up on the Kindle right here. Why you boo up on Kindle? Cuz that's where I open my PDFs. What? That's weird. There's so much happening. It's Pro Flowers, ladies and gentlemen. Go to ProFlowers. It's back. Who just had a Pro Flowers? How the hell that happened? So proflowers.com, if you click the little blue microphone in the top right corner and type in Patron, that's P A T R O N, you will get 100 blooms with a free glass vase for just $19.99. And as you guys, you might know, I don't know if you're familiar with Pro Flowers. I've never heard of it. Okay, well, it's this website you can buy flowers and send it to whoever you want around the world, probably not. I don't think that's how what.",
            "start": 0.31
        },
        {
            "text": "if you're familiar with Pro Flowers, I've never heard of it. Okay, well, it's this website you can buy flowers and send it to whoever you want around the world, probably not. I don't think that's how what. You just knew where you could send it to. Dude, what if you knew where the bodies were? That's all. Well, I'm just saying what for a wake or a funeral. I'm sure you can buy a sure, but what about for like if I if I hypothetically stop, Greg. I don't know. I don't know if there's an address. I'm pretty sure you're good. It's a guaranteed delivery address. It's good. You can set the time you want it to be. It's all this all this good stuff. And uh you should do it for Mother's Day. It's great because you can just relax with Pro Flowers. You got this Mother's Day done. Your mom's going to be happy if you send her a bunch of flowers. I know your mom, Alfredo. Can I send flowers as Tim Gettys? So now we go and we redeem the codes and we just use this to **** with people. I like what your heads at too or send it to the",
            "start": 58.6
        },
        {
            "text": "of flowers. I know your mom, Alfredo. Can I send flowers as Tim Gettys? So now we go and we redeem the codes and we just use this to **** with people. I like what your heads at too or send it to the local Cemetery. Can we all can all of us make a pack right now to do this after the show and send them to FR? Oh my God. FR gets five deliveries of flowers at the same time. I love that space and M. It's like every half hour now. New we got some breaking news guys. We can make her day extra special by upgrading to a premium vase and add chocolates for just $9.99 more. Oh, that's sold s day caller over have the place smelling like vanilla bean and you're set. That's all you need now. Now here, I like I said earlier, I have a plethora of proflowers.com stories, right? They didn't stop there for the record. I didn't know this. Well, I'm just having three sponsorships in a world I can tell all my stories. So um the girl that I am currently dating now when we first my my girlfriend when we first started our little",
            "start": 95.64
        },
        {
            "text": "know this. Well, I'm just having three sponsorships in a world I can tell all my stories. So um the girl that I am currently dating now when we first my my girlfriend when we first started our little mingling and stuff, I remember I went to her house and it was one of the the most awkward moment. There's a delivery at the door and the guy opens it and it was proflowers.com delivery from some other dude and she was like so embarrassed by the whole thing cuz she had she hadn't talked to this guy for like a month, but it was flowers are just like I I'm putting people on blast right now, but it's just nameless people so it doesn't matter. But he's all like I hope he's a she was like she was like read me the note. Like you want me to read you the note? She's like sure. So I read it. It's just like hey, like I know you need space right now, but like you know if you want to talk, I'm here to talk. It's just like that is literally the opposite of giving her space your flowers and now here's the thing he sent",
            "start": 145.72
        },
        {
            "text": "I know you need space right now, but like you know if you want to talk, I'm here to talk. It's just like that is literally the opposite of giving her space your flowers and now here's the thing he sent the small basic version a basic **** never send the basic version of of the flowers you got to go Deluxe so that's an option for like $9.99 more you get chocolates and all this stuff come on and all this Step It Up step it up you all right there buddy I'm trying to Blink out stuff in my eyes this Does this does not refect poorly on Pro Flowers that's a that's a that really you really do have a face only a mother can love so bad want to get it out of my eye it's like it's like a fish out of water trying to gas for air I don't know oh my God anyways guys proflowers.com you should go use the promo code Patron p a t r o n and just remember if you're trying to impress a girl and you're trying to like if she needs space but you don't want her to have space which you should just you know do what",
            "start": 194.48
        },
        {
            "text": "code Patron p a r o n and just remember if you're trying to impress a girl and you're trying to like if she needs space but you don't want her to have space which you should just you know do what she wants if she wants space but if you're trying to make a good impression you always go to Lux guys come on got to go tox this Amateur hour Hillbilly Deluxe it's the only it's the only way all right third topic the day Journey it's a video game it's also a band but the video game is what we're talking about today but the music of the video game it's getting a vinyl all right yeah Special Edition little vinyl release for Journey beautiful art prints they're like art records so it's you get two of them they're art records what are they called vinyl they're records yeah but it's like the one they have art like art art discs I don't don't there's some specific name for it I don't really know what it is but hold on one second Hey Dad how are you I'm good I'm I'm hosting a show right now can I",
            "start": 249.08
        },
        {
            "text": "have art like art art discs I don't don't there's some specific name for it I don't really know what it is but hold on one second Hey Dad how are you I'm good I'm I'm hosting a show right now can I call you back yeah I'll give you a call back in a little bit bye I don't talk to my father a lot your dad's got that Midwestern accent I could hear it I've never talked to your D before so there's art prints on the vinyls themselves right and there's four different ones cuz it's their side a side B each so there's four different uh pieces of art all of them are the The Traveler with the the scarf going around so when you which Nick Scarpino I thought was bacon by the way we went and played Super Time Force Ultra had a PlayStation event he's like he The Traveler running around he's like why is bacon floating around this I'm like there pieces of fabric there a scarf it's a long St it's a whole thing anyway so when it when it spins on the vinyl it looks really pretty cuz then you see the scarf",
            "start": 291.28
        },
        {
            "text": "floating around this I'm like there pieces of fabric there a scarf it's a long St it's a whole thing anyway so when it when it spins on the vinyl it looks really pretty cuz then you see the scarf going around and stuff like that sure have you ever seen the picture discs on the vinyl spin I don't think so no oh it's really cool looking I like it a lot do you collect vinyl do you use vyl I have a lot of vinyl yes I get the vinal to listen to it not to look at it but you listen and look at it it's part of the experience oh I listen to music I don't look at music Colin you need to St it up anyway this is really exciting to me because first off I love Journey second off I love vinyl third off I like collecting physical Goods sure fourth off I'm a big fan of video game music in general so the topic here is video game soundtracks sure what are your favorites what are the best Metal Gear Solid Peace Walker Peace Walker it was a really good one you go peace walk I tried to import it and I I",
            "start": 339.84
        },
        {
            "text": "topic here is video game soundtracks sure what are your favorites what are the best Metal Gear Solid Peace Walker Peace Walker it was a really good one you go peace walk I tried to import it and I I failed cuz I was poor I think at the time see I have I'm a coniss yes when it comes to this video game music thing I own many of the uh many video game soundtracks and like orchestrated versions and live versions of all the **** and stuff like that I have an issue when the sound quality isn't good when like the the samples they use are like really like just weird midi things and all that stuff and peace Walker is one of those examples where it's like a lot of it like some of it was actually orchestrated but majority of it was like just weird electronic sounding **** which was like a step back after MGS 2 and three and four yeah have it your way like Burger King I liked it that's what I'm saying what what do you even I don't even understand what you mean was that a McDonald's thing with",
            "start": 381.8
        },
        {
            "text": "after MGS 2 and three and four yeah have it your way like Burger King I liked it that's what I'm saying what what do you even I don't even understand what you mean was that a McDonald's thing with I'm loving it no have it your way yeah and then you just said I liked it that's what I mean I think it was pretty clear man uh I recently played through the Uncharted series that soundtrack is amazing but there's only one soundtrack that matters I'mma take you for a ride Marvel vs Capcom 2 Marvel vs Capcom 2 had a dope ass sound listen to that forever that song sucks to kill myself I love that soundtrack so much because there's so many games that came out in the 90s that just have this weird feel to them where it's like what the **** were they thinking like the entire they're like all Marvel versus Capcom too we got all these Marvel characters we got all these Capcom characters what should they fight to this's weird electronic Jazz stuff yeah I was like jazzy music I'm like what all the songs are just",
            "start": 423.6
        },
        {
            "text": "too we got all these Marvel characters we got all these Capcom characters what should they fight to this's weird electronic Jazz stuff yeah I was like jaz zy music I'm like what all the songs are just like this hodg podge of just noise and it's on Loop always why why Colin I don't know because you can't fight the silence it'll be boring that's true uh I think that uh typically older game soundtracks are better because I think that um not necessarily chip Tunes not so not necessarily only midi I think even even make it an argument for PS1 or PS2 games it's that game soundtracks sounded a specific way they sound like video games games today sound like movies or TV shows so like I don't they don't catch my ear that much like Uncharted sound I don't even know a **** single song Uncharted and I and oh well yeah the the theme song but that's I don't think that's like an extraordinarily good song or anything like that in my opinion and I have the pl I had the platinum trophy in all three of",
            "start": 481.0
        },
        {
            "text": "I and oh well yeah the the theme song but that's I don't think that's like an extraordinarily good song or anything like that in my opinion and I have the pl I had the platinum trophy in all three of those games so I'm very intimately familiar with Uncharted what about this one boom that was more in Char just drums and **** I I don't there's vuua there went to the soccer game somebody shakes them they went to the soccer game uh digy do but when you think about like you know Mega Man or Castlevania or Mario whatever like those are iconic because they especially cap the Capcom NES games um and the Konami NES games are iconic because they sound like video games those guys were pioneering something that we had never heard before so it's not like shoehorning classical music or or more stoic soundtrack into something it's like this is a game with game music and that was awesome well what's really cool too about those about the older eras is that they were so limited with what they could",
            "start": 525.32
        },
        {
            "text": "soundtrack into something it's like this is a game with game music and that was awesome well what's really cool too about those about the older eras is that they were so limited with what they could do like on NES you could never have more than three sounds going at once so it's like if you had like layers of of instruments and all this **** it could never be playing more than three instruments so that's why most of the games there's just Baseline rhythm line Melody and that's it and that's why there's this feel to it that's very unique because of the limitations of it and that be that forced forced them to be more creative with what they were doing and kind of come up with these like um Melodies that just get ingrained in the experience of what you're doing like Wy's Castle in Mega Man 2 was just like that will forever anytime you hear even like two notes of that you instantly know where you are you know Castlevania and Metroid like holy **** Metroid like that is one of the most",
            "start": 568.08
        },
        {
            "text": "2 was just like that will forever anytime you hear even like two notes of that you instantly know where you are you know Castlevania and Metroid like holy **** Metroid like that is one of the most sparse soundtracks ever but it like perfectly explained where you were and like gave the the whole atmosphere of feeling well yeah I mean to the original Metroid especially um like NES Metroid the opening soundtrack like when you're at the start screen is awesome because it's just like it's just Chimes and then the whole I have a cold so I'm probably not g be able to go too high with a boat and it's like all like that's like classic you know like and that's just tones that's not even a song and uh there was it's funny because when you get what's so cool and Greg and I explored this a little bit when we did the Mega Man playthroughs and he was with me is like the music towards the end of the NES era was **** crazy complicated and like I don't know like how they did it and like what they",
            "start": 611.36
        },
        {
            "text": "when we did the Mega Man playthroughs and he was with me is like the music towards the end of the NES era was **** crazy complicated and like I don't know like how they did it and like what they learned but if you listen to like the original Mega Man music which is good to Mega Man 6 which is like orchestral by mini by mini standards it's the same Hardware um and there were games that needed better music on the NES and in and on the famicom Castlevania 3 in in Japan on fam icom had a special music chip in it that let it play music way more advanced than it should have been able to play um and that's why it's one of the great soundtracks of all time I think Castlevania 3 specifically um but when even when you get to like PS1 Final Fantasy 7 soundtrack for instance this is Iconic but again this was the fusion of like better sound quality we weren't doing midies anymore these were real songs these were real orchestras playing some of these songs um but they still sounded like game music",
            "start": 656.48
        },
        {
            "text": "this was the fusion of like better sound quality we weren't doing midies anymore these were real songs these were real orchestras playing some of these songs um but they still sounded like game music that was like what was so cool about it that's why when you have a game like Shovel Knight um that that soundtrack's awesome because it sounds like an old Capcom soundtrack it was music isn't unique to games it was the way music was employed in games that was unique yeah and that and that is that has been lost um unfortunately I think unless you're trying to go for an intentionally retro Style game MH um well what's crazy too is like you know people hear chip tune stuff and they're just like oh it's retro and it's like that's not true though like there is so much Styles within all of that where it's like you can make a if you hear something you be like oh that's Mega Man even if it wasn't a Mega Man thing like that's influenced by Mega Man that's Castlevania that's I mean Mario even is",
            "start": 693.8
        },
        {
            "text": "it's like you can make a if you hear something you be like oh that's Mega Man even if it wasn't a Mega Man thing like that's influenced by Mega Man that's Castlevania that's I mean Mario even is just like Mario Mario's very airy and and loose um when you hear those songs they're great and all it is is they're just chip Tunes they're just modern day original chip tune songs but they they have their roots in these different styles that are based on games and like I just think that's like really interesting and cool and like you bring up Final Fantasy I feel like when you're talking about game soundtracks like Final Fantasy is probably the the most obvious answer and uh I mean it's arguably the best when you look at as a franchise as a whole so many games that it it whether it was Chip Tunes or full Orchestra things or orchestrated versions of old chip tune songs it still works and like noou um matu did some amazing work and whether it's Final Fantasy seven six eight nine all of them have",
            "start": 732.0
        },
        {
            "text": "or full Orchestra things or orchestrated versions of old chip tune songs it still works and like Nob uo Uematsu did some amazing work and whether it's Final Fantasy seven six eight nine all of them have like amazing sound four four and six and seven I think are the are the king four maybe especially like it's funny when you think about final fantasy's iconic nature um someone you know you know um at some point musicians sat down to try to like obviously we have a composer but a lot of musicians probably worked on a lot of these soundtracks and at some point someone said sat down at a keyboard square and was like and played Four notes it was like and I was like you know it's like nailed it and like they didn't realize like what they just did you know and like how that would insert your brain like Wy's Castle or something like that or the Mario tune but I want to give a shout out to some newer music I think Mario Galaxy had really awesome music and and I think that um that again was a really",
            "start": 777.4
        },
        {
            "text": "Wy's Castle or something like that or the Mario tune but I want to give a shout out to some newer music I think Mario Galaxy had really awesome music and and I think that um that again was a really improper Fusion by the standards of 2007 of putting old school style with or toally or orchestral music the last stage when you're fighting Bowser that music's **** awesome the thing about Mario Galaxy that was crazy was that was one of the first times uh any company really was like **** it we're doing it's full Orchestra like we're going to actually use real orchestras to do the entire soundtrack not just a song or two um cuz like you were saying like Final Fantasy 7 like that was just samples that wasn't actually orchestrated um it wasn't until like even Final Fantasy 10 was like weird **** midi stuff like it wasn't actual or there was like a handful of songs that were um but Mario Galaxy like all the songs were either orchestrated or they were like the like the Mario 3 remix and",
            "start": 825.32
        },
        {
            "text": "**** midi stuff like it wasn't actual or there was like a handful of songs that were um but Mario Galaxy like all the songs were either orchestrated or they were like the like the Mario 3 remix and stuff like that were obviously electronic but um that was such a unique thing for Nintendo to do and it started with the Star Fox assault on GameCube which was their experiment and that was awesome because that took the game to the next level where it's like yeah it was a shitty game whatever but like the **** soundtrack was awesome and that was them dabbling in let's do a fully orchestrated thing to really make this feel more like Star Wars like a movie and totally worked and I think we saw that in Mario Galaxy when it's like that's what made Mario Galaxy feel so Grand like the gameplay was amazing the look The feel the world all that stuff but it's like I think the music made it feel out of this world um but like really though it did it gave it that like holy **** epic feeling of",
            "start": 865.24
        },
        {
            "text": "was amazing the look The feel the world all that stuff but it's like I think the music made it feel out of this world um but like really though it did it gave it that like holy **** epic feeling of like this is a real thing yeah it's one of the few gaming soundtracks I actually got because I was I was really into it I don't know I I I it's funny because when we talk about movie soundtracks we typically not always but typically talk about movie soundtracks in the way of like well what songs are on there and what artists are on there and stuff like that you think about like famous soundtracks even before when were kids like Romeo and Juliet and all that kind of stuff it wasn't about the native music it was about who you can get you know so it was like it was a big deal you know when they got all these bands or whatever it's not to say that there aren't guys like John Williams making their own orchestral music for movies because obviously they are and some of the most iconic music of",
            "start": 904.76
        },
        {
            "text": "got all these bands or whatever it's not to say that there aren't guys like John Williams making their own orchestral music for movies because obviously they are and some of the most iconic music of all time with Star Wars being in the Ze guys right now is is is John williams'work but we just gaming music is just unique because it's it's actually while we have like the soundtrack kind of mentality in movies that's the exception to the rule in games which is what's so fun so like when we play a game like crazy taxi or something like that or Tony Hawk like that that was movie style soundtracks but typically we get more native music and I think that that's like what's so exciting about it I just wish that it would be a little truer to itself because I do feel like with the fusion of movies and M with movies and games the music is losing its Soul a little bit which is why I don't really I can play most games today on mute I don't give a **** you know like I would never ever ever ever",
            "start": 940.48
        },
        {
            "text": "and M with movies and games the music is losing its Soul a little bit which is why I don't really I can play most games today on mute I don't give a **** you know like I would never ever ever ever play Castlevania on mute ever you know what I mean like but I can play Uncharted onare you know it's like it's like you're crazy I I don't know about that I mean the thing is there's differ **** all the time on like when I'm playing games now I would never do that when I was good there's a difference between soundtracks and scores you know like the movies would have their the soundtracks with all the license stuff but there still would be a score that somebody made um that gives it that the the feel even like something like fast and fierce it's all licensed stuff but like there is still a score that like like plays throughout it um but like things like Uncharted and stuff like I feel like the music because it is more of a movie experience like it is necessary like and like the characters",
            "start": 976.36
        },
        {
            "text": "that like like plays throughout it um but like things like Uncharted and stuff like I feel like the music because it is more of a movie experience like it is necessary like and like the characters have themes and like all that stuff and like it builds with the emotional goal that the game is trying to get out of sure but that's not what I when I play Uncharted that's not what I like when I think about the five best things Uncharted does I don't think about the music I think about the voice acting um I think about the writing I think about the gameplay and the environments and exploration storytelling isn't that because music get it's just easy to forget about like it's it's if it's it's when it's done poorly that you really notice it you know what I mean like and then like we're talking about like Crazy Taxi and offspring or even the Final Fantasy noise or these things that are driven in over and over and over again but when I stop and I think back to an Uncharted and how playing",
            "start": 1011.96
        },
        {
            "text": "about like Crazy Taxi and offspring or even the Final Fantasy noise or these things that are driven in over and over and over again but when I stop and I think back to an Uncharted and how playing through that without music would sound it would sound weird but I don't think when I'm playing it how great this sound that's fair that's fair yeah because it fits maybe that's the thing but again like I remember the music of those classic games I remember that's one of the best things about those games and I I I wouldn't pick out many games today where I'm like the one of the best things about the G is the music like I I I don't you know like that's that's not maybe it's not what I'm looking for anymore but I also don't feel like music says in your **** face anymore either maybe it doesn't have to be music was always playing when you play a game like I don't know even like one of the great games about NS with soundtracks is journey to cus sunsoft games like Batman and fester squ",
            "start": 1045.72
        },
        {
            "text": "have to be music was always playing when you play a game like I don't know even like one of the great games about NS with soundtracks is Journey to Silius sunsoft games like Batman and Fester's Quest and stuff like they had some good music in them but Journey to Silius was **** a masterpiece of sound soundtrack and that was supposed to be a Terminator game but uh they lost the license and that's an awesome game and I remember that playing that game the first time being like this game's fun and it's sides scrolling it's hard but that **** music's killer you know and I don't really hear it anymore that's why when you play a game like Shovel Knight I'm like oh the music's in your face again and this is the way it is and it's always playing and I don't know it's just I think the games have just changed and moved away from the importance necessarily of the I don't want to say the audio Fidelity because it's important with sound it's important uh with voice acting but I think music might be",
            "start": 1080.8
        },
        {
            "text": "changed and moved away from the importance necessarily of the I don't want to say the audio Fidelity because it's important with sound it's important uh with voice acting but I think music might be waning somewhat in importance yeah see I don't I could never agree with that like I love the old stuff so so so much just as much as you do like it's so important to me and like we are those weirdos that would listen to just eight8 bit music just because we we're into it and we like it um but I mean there's so many modern gam like Halo we haven't even talked about Halo and it's like that soundtrack is amazing and that is one of the I would say best things about the game it it really ties it all together and it's like it's very unique in what it is like it's when you hear that you know it's Halo in the same way that you can hear a couple notes of Dr Wy if you hear that Chet you're like oh Halo yep you know and it's like when they Halo and Metal Gear are two examples of this where it's like",
            "start": 1114.44
        },
        {
            "text": "in the same way that you can hear a couple notes of Dr Wy if you hear that Chet you're like oh Halo yep you know and it's like when they Halo and Metal Gear are two examples of this where it's like they have these iconic themes and even when the themes go away and there's just other music that's kind of inspired by those themes like with Halo 4 or with Metal Gear Peace Walker and all that stuff it's like there's still you feel the growth and you feel the like where it came from it might not be the exact same theme that you know and love but it's still the music grew just with the game and all that stuff I don't know I'm very big fan of so many different game soundtracks and I feel like I've boughten soundtracks of a **** ton of games I've never even played just because I'm like I think do you listen to them for leisure yeah like I buy I what what I always end up doing is like oh I love like I have Uncharted from like the collector's edition or whatever from that giant case I have",
            "start": 1152.64
        },
        {
            "text": "do you listen to them for leisure yeah like I buy I what what I always end up doing is like oh I love like I have Uncharted from like the collector's edition or whatever from that giant case I have that and I put on my phone and then it would pop up on my phone and I would just skip it every time because that's just not what I want out of Music usually you know what I mean and I finally deleted and I like Uncharted I think the music's great but I just I don't sit around and be like yeah I can go for the score right now yeah see I like listening to scores a lot and I feel like there's a lot of specific things that um I really enjoy there's a a series of CDs called Distant Worlds which is a concert that um a Final Fantasy concert and it's just a bunch of differental Fantasy music orchestrated they're on the third CD Now I love those I love listening to them all the time um most games will just take bits and like take usually just the themes and stuff from uh like Uncharted is one of",
            "start": 1194.08
        },
        {
            "text": "they're on the third CD Now I love those I love listening to them all the time um most games will just take bits and like take usually just the themes and stuff from uh like Uncharted is one of those where there's not too many songs that I'm like in love with but I love the theme and uh smashing live which was like they take it was all the Smash Bros songs it's just like a Nintendo medley if we're get to top best soundtrack Smash Bros wins because it's just like all the iconic Nintendo songs in one thing and Final Destination and uh it's just all those songs live and that's **** awesome that's great I listen that **** probably too much I just think the design aesthetic of games I don't know almost has demonstr moved away from the importance of music I mean I'm just because I'm just thinking about it I'm like when do you think the last point where matter was what Zelda 64 like I mean no I mean even later than that but I think it still matters like Galaxy I think it mattered because",
            "start": 1229.2
        },
        {
            "text": "about it I'm like when do you think the last point where matter was what Zelda 64 like I mean no I mean even later than that but I think it still matters like Galaxy I think it mattered because Nintendo just knew what they were doing with that g game is brilliant but I think generally when you think think about a game right like think about a shooter and you're moving from point A to point B on the map and there's a lot of Ambient sound and there's a sound of gunfire and all that stuff but there's no music there might be a flourish or a crescendo here and there as you turn a corner to a beautiful Vista or something like that but it's not there anymore you know what I mean like and that and like that like games would have been sterile back in the day without music at all times because like Mega Man if you were to play Mega Man in like in 2015 it would be like a huge open world game probably and all that kind of stuff but Mega Man was just a sides scroller and it had no **** context",
            "start": 1271.4
        },
        {
            "text": "Mega Man if you were to play Mega Man in like in 2015 it would be like a huge open world game probably and all that kind of stuff but Mega Man was just a sides scroller and it had no **** context so like the music was almost a piece of half of it yeah so like and it was important right and to me like so when I think about games like it's easier for me to think about the games where the music really did matter like Catherine um where like it really affected me as opposed to the games where I'm like I don't remember a **** single song out of some of these games I love you know I mean and it's just like I think I'm in for different reason like like that's the difference between like what you're saying does not um work with Halo like there's music very well timed with all the cues of all the things you're doing and it's like it is part of the experience is the music but then you play games like resistance where it's like what the **** the resistance theme you know",
            "start": 1307.64
        },
        {
            "text": "the cues of all the things you're doing and it's like it is part of the experience is the music but then you play games like resistance where it's like what the **** the resistance theme you know what I mean I don't know I have no idea or Killzone or whatever it is or Call of Duty or like Call of Duty like they always have these great intro music and these these montages and the the the kind of trailers yeah like but like when you play the game like I played almost every Call of Duty game as you have and I'm like I don't remember any of the **** songs I'm not even sure if there's songs playing you know like that's like that's how like and I'm like I don't know if I really care I don't think there is that's like I guess that's what I'm saying is like my mentality as a gamer has changed a lot where the expectation was like this must have good music back in the day and now my expectation is like it's like not even really that important it's it's the way I feel like Graphics almost",
            "start": 1344.64
        },
        {
            "text": "a lot where the expectation was like this must have good music back in the day and now my expectation is like it's like not even really that important it's it's the way I feel like Graphics almost where like I don't even care where the way the game looks is it fun you know like sure so I don't know it's interesting to hear different points of views about it um but I agree that like it would be really hard you'd be hard pressed to beat Nintendo at the soundtrack game and I think you'd be except for maybe Square and you'd be hard pressed to beat the old games over the new games I think with maybe some exceptions like Halo um and you guys seem to like Uncharted although with the exception of the intro SC I can't think of one song other than the the the the title screen dies it's like and Drake dies n that's it's like snake I can actually hear the Metal Gear song like that little yeah like that like that like I can hear yeah look like a jingle it's like cards for kids it's a jingle yeah",
            "start": 1376.12
        }
    ]
}