{
  "id": 803,
  "video_id": "NOpiXZda7H4",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "What Would You Rename Yourself? - The GameOverGreggy Show Ep. 73 (Pt. 4)",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1430377202,
  "duration": 864,
  "transcript_chunks": [
    {
      "text": "[ Music] Andrew Palum, who asks on Twitter, uh, if you had to rename yourself, what would you pick? What name would you pick? Just rename yourself , literally rename yourself. What pick? Remember, if you guys have topics for the show, tweet Nick Scarpino with topic in the, in the tweet and let me know what you want on the show like Andrew did. Anything? I mean, I, my brain immediately goes through the one name or the symbol, you know, like, like Prince, yeah, like the artist formally known as Prince, where people ask your name, you just give a card, like, how the **** am I supposed to call you? Like, when your table's ready, MH, you're like, figure it out, hash, figure it out, you know what I mean? I mean, when I was young, I was really stupid, as young stupid kids usually are, and, uh, I went by Timmy instead of Tim. And like, every once in a while, Kevin will call me Timmy. It's really funny. I don't, I don't know what spurs it, but you just do it. He does just be a dick hole. But, uh, every once in a while, I'll get the Timmy, but when I",
      "start": 2.8
    },
    {
      "text": "once in a while, Kevin will call me Timmy. It's really funny. I don't, I don't know what spurs it, but you just do it. He does just be a dick hole. But, uh , every once in a while, I'll get the Timmy. But when I was young, someone, you know, when you're little kids, you like do all these things, like you go by like your nicknames and stuff and it's like you take, if you say your name backwards or whatever and all this ****. I remember one of those things was the first and last letter of your name. And so for me, it was T and Y, so Ty. So for a long time, I was like, if I would, you, I wish my name was Ty because I thought Ty was a really cool name. And then I met Ty Rue. I'm like, that's weird. I actually met a Ty. Never thought that was a real thing than one. Yeah, so there shouldn't be though. There's more than one Ty. That was my like third grade answer, but now I don't know. I kind of like, I've never really liked Tim Gettys. Like, I was like, I wish my name was more of a thing than it is, but then over the last couple",
      "start": 76.52
    },
    {
      "text": "Ty was my like third grade answer, but now I don't know. I kind of like, I've never really liked Tim Gettys. Like, I was like, I wish my name was more of a thing than it is, but then over the last couple years, I'm like, it's kind of a thing. Like, Tim Gettys is a solid. We all got good names. Yeah , we all have really good names. I don't see, I don't like my last name. Nick, you don't like your last name? Yeah, it's too Italian. Scrappy Doo. Come on. Scarpino is such a sick name. Like, I feel like that last name makes you as cool as you are. It's just so damn Italian. It just, don't, don't, don't turn, don't turn on your people. I'm not turning on my people. There have plenty of fine Italian last names. Scarpino just seems almost comical as a last name, especially when you know what it means. What's it mean? I've talked about this before, but it means a little shoe. Oh, yes, little shoe. Yes, yes, yes. Yeah, which when you see a lot of people tweet at me this picture of Scarpino, I think is like in Montreal. It's like a",
      "start": 112.64
    },
    {
      "text": "talked about this before, but it means a little shoe. Oh, yes, little shoe. Yes, yes, yes. Yeah, which when you see a lot of people tweet at me this picture of Scarpino, I think is like in Montreal. It's like a shoe shop. They're like, how'd you get up here? I was like, you know, money. Um, I always wanted, um, like you think when you're like, you see this a lot with like celebrities right now that we're in internet Superstars, we should consider this as well. A lot of people pick the names that are striking with like few with the fewest amount of syllables, right? So like a lot of people like the idea of the two first names. So like Nick Daniel or Nick Marcus or Nick something, something along those lines where it's just Nick Marcus. Did that work, producer? Hi, Nick, Nick Marcus. And I, T, we talked about that a lot too because that's one of my wife's last names. Um, she has a hyphenated last name and so when we were great, just she had a hyphenated last name for her parents from her parents so she could have had the",
      "start": 158.08
    },
    {
      "text": "because that's one of my wife's last names. Um, she has a hyphenated last name and so when we were great, just she had a hyphenated last name for her parents from her parents so she could have had the triple hyphen. She could have had the triple hyphen. Um, but when, when we talked about it, she was like, because she didn't change her last name because she was like, look, dude, do you, is it really that important to you that I take Scarpino's last name? And I'm like, I made a, I made a actual deal with her. I was like, look, until I do something in this world that makes you think I want that guy's last name, you don't have to file the paperwork because it's a pain in the ass. Like, you got to redo everything. Yeah, it's like, I think you can do one form now, but if you don't do it at the time of getting married, I think it's a bigger pain in the ass. So I was like, maybe I'll take your like last name. We'll just, we'll just condense it all down. I'm like, Nick Marcus, hi, I'm Nick, Nick Marcus. Yeah, how dope is that? I mean,",
      "start": 201.8
    },
    {
      "text": "it's a bigger pain in the ass. So I was like, maybe I'll take your like last name. We'll just, we'll just condense it all down. I'm like, Nick Marcus, hi, I'm Nick, Nick Marcus. Yeah, how dope is that? I mean, it's dope as so as Nick Scarpino, Scarpo character. You don't want the character. It's less white. I don't remember exactly how the whole story went and it gets really complicated, but in my family there's my Irish side and my Italian side and my last names somehow could have been either Malon or Mc, so I'd be Tim Malon Tony or Tim McAn. McAn's a bad. Both of them. I'm like, ****, that's awesome as ****. Like, that makes me sound like a comic book character. John McAn's like son. I mean, I would love Tim McAn. I would rock. You sound like an IR. Like, McAn is like you're like a gangst in New York. Yeah, yeah, I think it's pretty cool. Like, he's just making knives out of random ****. You're like, Tim, just buy a knife. He's like, nah, this is what happens. Is that a pirate? Yeah, that, that wasn't Irish. I don't know what",
      "start": 240.24
    },
    {
      "text": "it's pretty cool. Like, he's just making knives out of random ****. You're like, Tim, just buy a knife. He's like, nah, this is what happens. Is that a pirate? Yeah, that, that wasn't Irish. I don't know what that was. I'm interested what, what Greg thinks of his name because you have, you have Gregor Miller. There's got to be a million of them, but you are the Greg Miller, right? So is that like, I don't think there's a Greg Miller that's bigger than you. Greg Miller definitely Greg Miller that are bigger than you physically because you're not fat anymore. Um, but you are like, like for, there's got to be a lot of them, but you're the Greg Miller. Yeah, does that mean something to you? Yeah, I like my name. I've never thought about not having it and it's a cool. My dad's a Greg Miller. His dad was a Greg Miller. Oh, you're, wait, wait, what? I didn't know that. Different middle names. Middle names. That's how you get away from the Jor. I like, what the **** you talking about? I didn't know you were like the fourth or",
      "start": 286.32
    },
    {
      "text": "oh, you're, wait, wait, what? I didn't know that. Different middle names. Middle names. That's how you get away from the Jor. I like, what the **** you talking about? I didn't know you were like the fourth or something like that. No, yeah, I thought I was GNA learn something new about you , but I didn't. You did. I learned something new about your dad and my grandfather and your grandfather. We all have different middle names. That's how you get around. Interesting. Okay, yeah, so your dad's Greg. I didn't know that. Yeah, yeah. Um, you heard him on the phone during the game. Oh man, he has, he has such a Midwestern accent. Good old Greg Miller. Um, yeah, I mean, I have a lot of problems, right? There's a lot of things wrong with me, a lot. I can't, I can't even begin to name them. My name, not one of those things that's wrong with me. I love my name. Yeah, your name's awesome. And, and that's like one of the things where I'm like, I'm fine and my brother to Dean, like we have great names. Your, your brother's name by the way, is it",
      "start": 320.76
    },
    {
      "text": "with me. I love my name. Yeah, your name's awesome. And, and that's like one of the things where I'm like, I'm fine and my brother to Dean, like we have great names. Your, your brother's name by the way, is it like, is a Star Wars name? Like it is that name where you're like, **** man, that's a cool name that you don't hear all the time that it sounds like he should be like the interim pilot of the Millennium Falcon. Like when Han's not there, it's like give it to Dean. Dean Solo will take it. You know, it's like Han's older brother that's like not quite as, you know, callous as Han is. So he's like, dude, give me the Millennium . Like that thing needs new **** rims. Like let's go. Like the tires on that thing are bad. Get them fixed. Give them to Dean. Yeah, I feel, I just feel like with, you know, for all of my psychoses and all the **** just random ass things that are wrong with me, like I'm, I'm happy with my name. I wouldn't want another name. I think any name would be a step down for me. Like I, I just think",
      "start": 354.52
    },
    {
      "text": "and all the **** just random ass things that are wrong with me, like I'm, I'm happy with my name. I wouldn't want another name. I think any name would be a step down for me. Like I, I just think that it's and my last name is, I love my last name and I, I love my last name because it's just become relevant again culturally. You, I used to get like very obscure references. Moriarty is obviously was written in books in the 18 in the late 1800s and be, you know, was Sherlock Holmes Nemesis, but um, and I used to get like one offs about that, but when Sherlock Holmes came back finally, not the show especially , but also like the movies and stuff like that, like I started getting it much more and people think that a lot of people think that it's not my real name. Like there are a lot of people stage. There are people out there that think that like K War is like a, is like a stage name or like my, my pen name, yeah, and I'm like, no, it's my name and I have no middle name. That's a tradition in my family. The males don't",
      "start": 396.28
    },
    {
      "text": "out there that think that like K War is like a, is like a stage name or like my, my pen name, yeah, and I'm like, no, it's my name and I have no middle name. That's a tradition in my family. The males don't have middle names. That's crazy for thas. Um, so yeah, Dan's just D Moriarty . I'm just Colin Moriarty. That's pretty cool. That's pretty dope. I feel like I met a lot of people with really cool names. I feel like I like girl names a lot. I don't think there's any guy name like because I often think about like if I have kids, what would I want to name them? Yeah, I don't think I have any names for a dude that I'm like, I like that a lot. It's just like there's girls names that are just like pretty sounding and **** pretty sounding **** really good. If I had to change my, if I had to like change my name, change my name like, like seriously, I've or name a child, I've, I always liked Vincent because my UNC, I have an uncle and my grandfather's name was Vincent. So Vincent Scarpino, Vince, Vin, Vinnie , come on, you can't",
      "start": 429.96
    },
    {
      "text": "name like, like seriously, I've or name a child, I've, I always liked Vincent because my UNC, I have an uncle and my grandfather's name was Vincent. So Vincent Scarpino, Vince, Vin, Vinnie, come on, you can't get away from that. That's good. My dad's name is Louis, so Lou, let me call him Big Lou even though he's like 5'6. Everyone, what I realize is that this is funny, we, I was talking about this with my friends when I was home on Long Island just a couple weeks ago is that we just call all of our each other's parents big whoever. Like how's big, like my dad's name is Gerard, like how's big Gerard doing? I'm like good, how's big Flo, which is like his mom. Yeah, and uh, but sometimes it gets a little insulting because we used to call one of our friends uh parents big something cuz she was actually big, not to her face of course. I think I feel like I, I feel like it would be insulting if you were to call her little as well, you know, little shoe. Yeah, little shoe, there you go. I don't know. So off top of your head, what",
      "start": 465.16
    },
    {
      "text": "of course. I think I feel like I, I feel like it would be insulting if you were to call her little as well, you know, little shoe. Yeah, little shoe, there you go. I don't know. So off top of your head, what would you rename yourself if you had? I don't want, I mean, if I had to, Robert, don't want to throw Robert in there. Robert, Bob, Bobby. I would rename, that's what you would name yourself as another Bobby. I don't, no, I'm saying Robert. Robert has a different variation. Bobby Miller, Bobby Miller. I thought I changed everything. Robert, I can see you as a Bobby though. Yeah, yeah, you kind of, you actually, I'm seeing you as Bobby from Bobby's World. Bobby's World, big old head generic. Yeah, I, I like that show. Yeah, who didn't? That was a funny show. How Mandale got it unlock. Yeah, the one thing, the one thing that I, I think is interesting too is that, um, there are, you know, we were talking about how many Greg Millers there must be. What I was surprised about with the internet, the Advent of the internet was how many Colin",
      "start": 510.24
    },
    {
      "text": "is interesting too is that, um, there are, you know, we were talking about how many Greg Millers there must be. What I was surprised about with the internet, the Advent of the internet was how many Colin Moriartys are. Like I was like, I can't believe that there's got to be like 20 of them. I'm like, this is incredible. I remember when I was at GameFAQs before like Facebook or anything was ever a thing, someone emailed me and was like, I'm named Colin Moriarty and I'm older than you, so I was Colin War first. I'll never forget that. I'll never forget that email. Better. Yeah, and I want to be like, um, I was born after you and, uh, I'm the verified com war on Twitter. Okay, see you later. Bye. Damn, damn. But no, it's so funny. Like there's a guy, there's like a really good guitar player out there near Colin Mori arty and like some other people, um, are you the Colin Moriarty? What do you mean? Like you said I'm the Greg Miller. I, I assume so, yeah, but I don't want to make that assumption. There's actually a hockey player named",
      "start": 547.2
    },
    {
      "text": "some other people, um, are you the Colin Moriarty? What do you mean? Like you said I'm the Greg Miller. I, I assume so, yeah, but I don't want to make that assumption. There's actually a hockey player named Colin Moriarty that's like in high school or col. I Google my name pretty often just see like what kind of **** people are talking about me and, uh, I run into like some of the similar of the guitarist and then like the hockey player and a few other people, but um, yeah, there's Greg Miller Photography and there's Greg Miller lockpicking for beginners and then there's a Greg Miller Elvis impersonator, but I haven't checked on these in a while, so maybe the Elvis impersonator hung it up, but it's possible. Yeah, there's another Tim Gettys out there and, uh, he, he makes a lot of dumb videos and like there was when he was younger and stuff and like he's embarrassed by them kind of and you know, just hopes that people don't ever over looking him and **** sounds like you. It sounds like you. Oh, it's no, no",
      "start": 586.24
    },
    {
      "text": "was when he was younger and stuff and like he's embarrassed by them kind of and you know, just hopes that people don't ever over looking him and **** sounds like you. It sounds like you. Oh, it's no, no, it's another Timmy. Sure, definitely. Yeah, is there, does he have a friend named Alfredo in a lot of these videos? He does . Yeah, yeah, it's different. What about Kevin? Is there Kevin in these videos? Kevin, uh, never has made an appearance in a video that went live. Okay, he's made appearances in some other ones and one day we'll see those. All right, I, I'm going to rename you guys then. Thank you. You're GNA be KY, you're going to be Galvatron, you're going to be sweet Jesus, you're going to be the Corpse Bride. Sweet Jesus is my favorite one. Sweet Jesus Getty. That's a dope name. That's a good name. Everybody take that if you're, you be J. No, I just, I thought you were giving us real names. I don't think you're just giving us fun names. B, I had a friend that named",
      "start": 623.84
    },
    {
      "text": "a dope name. That's a good name. Everybody take that if you're, you be J. No, I just, I thought you were giving us real names. I don't think you're just giving us fun names. B, I had a friend that named his kid Cal. I think it was from from Cal, uh, J. Uh, Nicholas Cage named his kid Cal after Superman. Yeah, he's a big Superman fan, which makes it even more sad the whole Death of Superman lives, but that's the story for another day cuz I'm going to see that movie when it comes out. He would have been terrible. Shut up. You don't know. That's mean. You don't know. He, he's won an Academy Award. I assume has he? Yes, he did. He went for Le in Las Vegas, but then afterward he decided to just do crazy stuff. Yeah, he's crazy. Su RS a crazy story. How crazy is it that one day we're GNA, I don't know if we'll ever meet him, maybe we will, but there's going to be just a bunch of Kes running around. Yeah, that's weird. It's kind of whack. Oh, because people are naming their kids Kes that this is the problem with this by the way when",
      "start": 665.12
    },
    {
      "text": "we will, but there's going to be just a bunch of Kes running around. Yeah, that's weird. It's kind of whack. Oh, because people are naming their kids Kes that this is the problem with this by the way when I, I was thinking about this with like naming your kid after you have no idea where that character goes or what happens to her or the things she does. So you better be very careful if you're naming your character kisi. There are two books left and she could be like a **** mass murderer or die a horrific death or something like that and your kid is now named after this person. Think about it. Yeah, think about if you Nam you were like, oh my God, I love that Cal Drogo guy. Nam my kid Cal. Cal Drogo. I remember howo went out like a **** Drogo. Sorry, this was a while ago, but I thought this so corny like that I think I was in college when this happened that there was like a big story about how a couple named their kid Espin because they loved ESPN. It's hilarious. I remember the first time I heard about",
      "start": 707.8
    },
    {
      "text": "I think I was in college when this happened that there was like a big story about how a couple named their kid Espin because they loved ESPN. It's hilarious. I remember the first time I heard about all this and it blew my mind was, um, when High School Musical came out, like that there was like after the first one came out like right before the second, they released this thing where in the last year it was the most like the top named kids were all named after characters in High School Musical. Like all out of the top 10, like five of them were or like the actors. Like this kid, one of there was a lot of Zachs and then Corbin Blue was one of them. I think Corbin was like world record for Mo most Corbin. Corbin interesting. Yeah, yeah, I was named after a TV show, Nick Eight is Enough, one of the kids from Eight is Enough, Nick at Knight. My brother loved that show. My mom was like, what was should name and he was like, how about Nick? Really? Yeah, that's it. That's what happened. There's no Nicks in my family.",
      "start": 748.72
    },
    {
      "text": "Eight is Enough, Nick at Knight. My brother loved that show. My mom was like, what was should name and he was like, how about Nick? Really? Yeah, that's it. That's what happened. There's no Nicks in my family. It's not like a name that I took after. I think we said this before, Kevin got named after, uh, Kevin Arnold. Kevin Arnold fun of me for that. What would you do Corps is in front of you? Oh my God, to lay down on top of him. All right, ladies and gentlemen, that's the GameOverGreggy Show. Each and every week, four, sometimes five best friends GA on this table, each bring a random topic of discussion for your amusement. If you like that, you can get the whole show early each and every Friday at patreon.com KindaFunny. But if you don't want to give us any money, no big deal, we break it out topic by topic day by day and put it up on YouTube the following week until we post the entire thing on Friday is an MP3 and video for your pleasure. Hit up the kindafunny.com store, get this producer Seducer shirt",
      "start": 789.88
    },
    {
      "text": "by day and put it up on YouTube the following week until we post the entire thing on Friday is an MP3 and video for your pleasure. Hit up the kindafunny.com store, get this producer Seducer shirt that looks amazing. It looks so cool. I shirt I was not able to do this who, but now I can do it. It just, just like that, the shirt gave me new abilities. Holy ****, it's amazing. Until next time, it's been our pleasure to serve you. [Music]",
      "start": 832.48
    }
  ]
}
