{
    "id": 2935,
    "video_id": "58EZezM64Hk",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Zacq Wenzel"
    ],
    "title": "Greg Plans A Murder - Kinda Funny Doodles",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1503678140,
    "duration": 81,
    "transcript_chunks": [
        {
            "text": "wait did Logan come on yet no next week I think Jen might be in town a week sure we'll make her cosplays Wolverine cheating the X-23 I'll dress I'll dress is Logan cheating dresses X-23 and then we'll make out everybody cut out she's just a child that's what gets me off the pervert Stone the pervert and I'll run to the security guard and I'll take his gun one in his head and then I'll turn around it'll be one whoever's coming at you job one in the chest one in the head yeah God wicked people a **** on this man I roll into the popcorn he's coming go they don't know what's happening about this time theater employees have started going back to work there's gonna be this like 16 year old chick there who's sitting there like she's getting she's getting ready make more popcorn yeah I were a lot she's like oh my god you're that and I used to **** hopper so she's down I put her in the Wolverine outfit dumped her top corner I put her movie theater outfit and like everybody I found my that I",
            "start": 0.03
        },
        {
            "text": "She's like, \"Oh my god, you're that guy.\" I used to hop on Hopper so she's down. I put her in the Wolverine outfit, dumped her top corner. I put her movie theater outfit and like everybody. I found my way to Logan. This is a genius plan, this is like some Lex Luthor stuff. I'm telling you, man, you'll give a man a fish, feed him for a day. Where's it going? Let a man think about murdering people, you'll feed on your popcorn first. There you go, Spiritus.",
            "start": 41.58
        }
    ]
}