{
    "id": 1998,
    "video_id": "_1QA3r95FyA",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Top 10 PS4 Games (2016 Edition) - PS I Love You XOXO Ep. 49",
    "description": "Thanks to Blue Apron for sponsoring this video!\nGo to http://www.blueapron.com/iloveyou\n\nGreg and Colin sit down in the new studio to hash out the 10 PS4 games you HAVE to play. And, yes, we know there are crosshairs on the solo shots. :P (Released 08.23.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: https://www.youtube.com/watch?v=KTyp0QNfJzk\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1471968002,
    "duration": 5720,
    "transcript_chunks": [
        {
            "text": "This episode of PS I Love You XOXO is brought to you by Blue Apron. Blue Apron's mission is to make incredible home cooking accessible to everyone. Blue Apron achieves this by supporting a sustainable food system, setting the highest standards for ingredients, and building a community of home chefs. Let me tell you something, ladies and gentlemen. I'm Greg Miller, and you might have heard me once or twice. Am I right? Anyways, I've used Blue Apron. It's good. They gave me Buffalo chicken sandwiches. I like that. For less than $10 a meal, Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com/ I love you. You will love how good it feels and tastes to create incredible home-cooked meals with BlueApron. So don't wait. That's blueapron.com/ love you. Get a whole bunch of crazy meals. Be a better cook. Impress your friends. Maybe",
            "start": 0.08
        },
        {
            "text": "feels and tastes to create incredible home-cooked meals with BlueApron. So don't wait. That's blueapron.com/ love you. Get a whole bunch of crazy meals. Be a better cook. Impress your friends. Maybe your significant other. Maybe impress yourself. That's how easy it is to cook a blue apron. You start doing it and you're going to be like, \"Wait, I did this myself.\" And then you'll look at the food and you'll look at yourself in a mirror. You'll go, \"Is this really me? What happened to me? [Music] What's up everybody? Welcome to PS I Love You XOXO episode 49. I'm one of your hosts, Greg Miller, alongside the pride of Long Island, Colin Morardi. It's good to be here with you today. It's good to be here with you today, Colin Morardi, on the brand new set at Kind of Funny Studios. If you're listening to the MP3, you [ __ ] up. You shouldn't have done that. I'm looking at the camera to address the people listening to the MP3 to let them know they [ __ ] up. Uh, it's finally here. This is the",
            "start": 39.12
        },
        {
            "text": "to the MP3, you [ __ ] up. You shouldn't have done that. I'm looking at the camera to address the people listening to the MP3 to let them know they [ __ ] up. Uh, it's finally here. This is the first. Now, it's all out of sync and out of order in our lives, as you know, Colin. Everything's chaotic, crazy. We're recording episode 49 in kind of funny studios before you record episode 48 while Tim and I are in Austin, right? And uh that's why this is a more uh evergreen episode as we would like to call it. That's a great point. But I want to say and and this might be shown out of order when we introduce everything, whatever. This is the I think the very first This is the first thing we've ever filmed in studio and filmed in. So, a round of applause for Kevin and Nick, all their work. Matt Scarpino making this thing happen, making this amazing set happen. Uh, hopefully it's the first thing we put put in the Twitch stream that it's also going into. You can you can stop. That's enough of",
            "start": 98.56
        },
        {
            "text": "Scarpino making this thing happen, making this amazing set happen. Uh, hopefully it's the first thing we put put in the Twitch stream that it's also going into. You can you can stop. That's enough of that. You don't have to keep doing that. So, yeah, to again, this is going to be an evergreen show where we're going to talk about we're going to make the kind of funny top 10 PlayStation 4 games lists here. We know how much people like lists and stuff. So, it's a we won't have the news of the day. We won't have the normal thing there. We do have some reader mail in terms of what people voted for for theirs. We got a song, we had all that stuff. But if this is your first episode of PS I Love You XOXO, it's a much different show when you see it as going. What we decided right is that if something happens, if Neo information leaks this week, if something else happens, we'll do an impromptu. We'll do an impromptu PS, I love you, XOXO reacts, what we'll put up on the podcast feed, we'll put",
            "start": 136.16
        },
        {
            "text": "happens, if Neo information leaks this week, if something else happens, we'll do an impromptu. We'll do an impromptu PS, I love you, XOXO reacts, what we'll put up on the podcast feed, we'll put up on the things, but right now this will be the show. That was a concern of mine was that this is a bad week to have to do this, but that's just the nature of the setup and and we are prepared uh if if I do feel like things are going to start leaking. You think cuz you figure this is going live. This is our, you know, in terms of PS I love you XOXO shows. This is the one that goes live the 23rd. So there's still a full week for someone to [ __ ] up and put out a whole or two weeks I guess. It's not the end of the world. It is what it is. We have to do this eventually, right? Because you have to leave. So, you know, to go you're going to be gone for a week. So, it all makes sense and it's all fine. Yeah, I think it's fine and dandy. Yeah. Uh, so everybody, thank you so much for your support.",
            "start": 171.92
        },
        {
            "text": "leave. So, you know, to go you're going to be gone for a week. So, it all makes sense and it's all fine. Yeah, I think it's fine and dandy. Yeah. Uh, so everybody, thank you so much for your support. Obviously, it's been a long year and a half. That's kind of funny. Uh, we're happy to be outside of the spare bedroom. Here we are in the brand new studio. That's all thanks to your your support. Whether you're a subscriber on iTunes, whether you subscribe to us on YouTube, whether you support us on patreon.com/kindfunnames or patreon.com/kindafoney, this is all because of you. Thank you so much for that. Uh, I also want to point out in a little bit of housekeeping news, next week will be PAX West. No longer PAX Prime, PAX West. I don't like that. I don't like it either. Uh myself, Kevin, Tim, Nick will all be up there. Colin will not Well, technically Colin's up there, but he's going to a concert instead of going to PAX. It was just it was just a kind of a coincidental thing actually.",
            "start": 208.48
        },
        {
            "text": "Nick will all be up there. Colin will not Well, technically Colin's up there, but he's going to a concert instead of going to PAX. It was just it was just a kind of a coincidental thing actually. Many months ago, I had scheduled put on the calendar like I'm going to be gone this weekend to see a show and uh and then it happened to be the PAX weekend that we and we didn't realize that for months actually. So, ironically, I'll be in Washington. Yeah. But, but you're not stepping foot in that convention center. No, not a prayer. Not Not a goddamn chance. We will be though uh 100 p.m. Sunday, September 4th is the kind of funny panel. We're also doing a whole bunch of Square AnnX panels, a let's play panel for with our rooster teeth friends, and I'll be hosting a South Park panel. So, plenty of good stuff happening at PAX. We'll have it all up on the website. Next week's show will have ads in front of it with all the information URLs to go to. But I wanted to insert that here. So, Colin,",
            "start": 246.32
        },
        {
            "text": "of good stuff happening at PAX. We'll have it all up on the website. Next week's show will have ads in front of it with all the information URLs to go to. But I wanted to insert that here. So, Colin, yes, if you didn't know, ladies and gentlemen, this is PS Love You XOXO. It is kind of funny.com's PlayStation podcast. It is the number one PlayStation podcast on the internet and it posts every Tuesday at 9:00 a.m. Pacific time for your listening pleasure on youtube.com/kindfunny games and podcast services around the globe. So please like, subscribe, share, leave reviews, do whatever it takes to make this show something different. If you're watching it during the live stream, maybe you want to go subscribe to it all the time now and never miss an episode and catch the backlog. We had we've had guests on. Shu Yoshida has been on. You know him. Let's begin the show this one time with what is and forever will be topic of the show. So Colin, we left IGN. We did when we were at IGN.",
            "start": 282.64
        },
        {
            "text": "we've had guests on. Shu Yoshida has been on. You know him. Let's begin the show this one time with what is and forever will be topic of the show. So Colin, we left IGN. We did when we were at IGN. [Laughter] When we were at IGN, we always had, you and I were the PlayStation team. Yes. We always had to go into these rooms and hash out the top 10 or top 25 lists, all these things. Just terrible. And then people would come in and, you know, they would be all like, \"Well, I want to do this.\" and they'd all what about this and you don't have this and we always like get the hell out of here. This is our job to make the list. If you wanted to do it, why why' I just waste my afternoon this? Then we'd all get in a big fight and we'd all break off and we'd kind of just do whatever the [ __ ] we wanted, right? But today we're going to do whatever the [ __ ] we want and do the top 10 PlayStation 4 games for 2016, August 2016. We're going to do it in a in a way that I think makes sense that's I",
            "start": 320.16
        },
        {
            "text": "right? But today we're going to do whatever the [ __ ] we want and do the top 10 PlayStation 4 games for 2016, August 2016. We're going to do it in a in a way that I think makes sense that's I think balanced and fair. Fair and balanced. The way we're going to do it is we're going to present each of our top 10 lists and then we're going to mathematically combine them to make the definitive top 10 list. The way we'll do that is the number one game will get 10 points, the number two game will get nine points, the number 10 game will get one point and then we'll just add the math together. The top 10 sums will right will then be made into the actual list. So, I think it'll be interesting how it all shakes out. Of course, uh now of course the rules we need to go over and I guess the guidelines. The rules and guidelines. These are our favorite PlayStation 4 games. what we would recommend and why we would recommend them. Is is the show going to be on is the show is not on my list. Show is a",
            "start": 365.68
        },
        {
            "text": "The rules and guidelines. These are our favorite PlayStation 4 games. what we would recommend and why we would recommend them. Is is the show going to be on is the show is not on my list. Show is a great baseball game. Do you want a great baseball game? Go get that. But we're not doing this thing where we're trying to build out a list that's super objective. This is Colin and Greg's list. There's no literally nothing. There's never been anything objective about a top 25 list. I always hated that approach. And yeah, so there's not going to be you're not going to see Street Fighter 5, although I don't think would be on there. You're not going to see a fighting game. You're not going to see a racing game. You're not going to see so no drive club, no whatever Need for Speed, The Crew, whatever the hell you play. And then uh just to have them. Yeah. So, you're going to see games that are very reflective of the games we play. That's just the way it's going to be. So, take that with a grain",
            "start": 402.08
        },
        {
            "text": "the hell you play. And then uh just to have them. Yeah. So, you're going to see games that are very reflective of the games we play. That's just the way it's going to be. So, take that with a grain of salt if you'd like. Uh, but this is a a honest or an honest presentation of our feelings on on the PlayStation 4 library so far. And what I figured out, we can talk about it when we kind of co collaborate and and and put this list together, is this list, my list, and I'm sure your list too, I was saying we were talking before for three years in pretty strong, pretty strong list. Oh, sure. Yeah. Uh, the other thing I want to cover is this something we came to. These are native to PlayStation 4 games or games that released on PlayStation 4 as well as the platforms at the same time, right? So, so the example there is Rzzog Gun is an example of a game that would be on the list because it came to PS4 and then it came to PS3 and VA later. So, it is on those platforms. Uh, but something like",
            "start": 432.8
        },
        {
            "text": "so the example there is Rzzog Gun is an example of a game that would be on the list because it came to PS4 and then it came to PS3 and VA later. So, it is on those platforms. Uh, but something like Dead Nation is not a PS4 game. It's a PS3 game that was ported to PS4. DC Universe Online, Last of Us. Exactly. So, uh, that's important, too. And the other thing I want to say about my list, and I don't know if your list is the same way, I've there are game there are a few games in particular that I might have included on this list that are on PS4 that came concurrent to PS4, but I played them on VA. Exactly. So, I can't really speak to the PS4 experience. Uh so, uh I wrote down six games in particular that I think I would that would be in consideration in some respect for this list that are not on the list because I played them on PS4 and not or Vita rather. I'm not saying that they would necessarily be on the list, but they would have been they would be on the list. You'd be having a",
            "start": 471.36
        },
        {
            "text": "not on the list because I played them on PS4 and not or Vita rather. I'm not saying that they would necessarily be on the list, but they would have been they would be on the list. You'd be having a conversation narrow down. So, those games are like Rogue Legacy. Ro Legacy is amazing. I played on Vita, too. It's a Vita game to me. I'm sure when we do our Vita list, when we do this Vita show one day, that'll be on there. Yeah, Wo Dave is a game that I really love. It's a it's a Mario Bros. original, not Super Mario Bros. but Mario Bros. kind of clone. I love that game. Three4ths Home definitely would have been on my list, but uh that's I played that on Vita. A blah probably not, but a game that I would have considered. Same thing with Foul Play. Uh played on Vita and Downwell. So, those games I want to throw out there is like, well, why why aren't those on the list or they they were not even under consideration because of the rule set. That makes sense. That makes sense. When we do Vita",
            "start": 509.28
        },
        {
            "text": "I want to throw out there is like, well, why why aren't those on the list or they they were not even under consideration because of the rule set. That makes sense. That makes sense. When we do Vita again. Yeah. And that will go the other way around where um you know if you played something I I don't even know PS4 games that you didn't play on VA. That's not very common for us. But no, not at all. If something's on the VA, I save it for the VA cuz I got to play something like goddamn Vita. What up, Gal Gun? Uh and the final thing I want to point out, not that I think it would have made our lists, but seeing as how this is kind of a snapshot time capsule. People will be coming back to this video hopefully if SEO works. Uh I want you to understand No Man's Sky just came out for us. I have not put enough time into it to know if I think it's one of the greatest PlayStation 4 games of all time. So, it's not in consideration here. But, it's like if you're watching this in the far-flung",
            "start": 537.44
        },
        {
            "text": "not put enough time into it to know if I think it's one of the greatest PlayStation 4 games of all time. So, it's not in consideration here. But, it's like if you're watching this in the far-flung future, that's, you know, like think of when No Man's Sky came out is like when we capped this list kind of thing. And, uh, I want to say the same, although maybe not as important to a lot of people. The Hyper Light Drifter as well, also Bound. Uh, so we have access to these games. Hyper Drifter is out by the time we're recording this. Bound isn't out, but we have it. Um, two other games that you might that might have made the list. I'm sure we'll update in the future. So, of course. Yeah. No, this is 2016 edition. When I have Cyborg Colin and hologram Kevin, we'll update the list. Um, so how we we're going to go obviously 10 to one, but we did open the floor for each of us to have three honorable mentions that didn't make our list. Do you do you want to start there? Sure. Okay. My first",
            "start": 572.96
        },
        {
            "text": "we we're going to go obviously 10 to one, but we did open the floor for each of us to have three honorable mentions that didn't make our list. Do you do you want to start there? Sure. Okay. My first one, and this is and I honorable mention shout out. If this was more my type of game, I think it would have had a better shot, but I want to represent The Witness. I know The Witness is amazing. I played the witness for an hour and a half or whatever, not being a puzzle guy. Had fun running around doing a few of them, but you know, it's it didn't hold my it didn't hold me. It wasn't what I wanted. This surprises me because this seems more like what we were saying that you're you seem to be pigeonholding. But when we get in here, you're No, no, no. When we get into the list, my number three choice is a game that I haven't sunk hundreds of hours into, but played enough to respect, understand, and know that in another life I would have been super into this. I and I I want to talk about the",
            "start": 608.32
        },
        {
            "text": "is a game that I haven't sunk hundreds of hours into, but played enough to respect, understand, and know that in another life I would have been super into this. I and I I want to talk about the craftsmanship of The Witness. I want to talk about the beauty of The Witness, the puzzle design of The Witness. I can sit here and objectively tell you that all that's amazing. And I think while it doesn't make get a spot on my favorite games because it's not one of my favorite games, I think it does deserve, you know, a conversation, a tip of the hat, as they say. A wink of the eye, rub of the balls. We haven't done We haven't done We haven't done a pregnant pause in a long time. What's your first honorable mention? Uh, Rocket League. Um, so, uh, the real, so Rocket League is actually a really immaculate and impeccable game. Yeah. The reason that I don't want to put it on my list is because I think it's a little disingenuous. Now, I called Rocket League being great, obviously, for a long way",
            "start": 648.16
        },
        {
            "text": "and impeccable game. Yeah. The reason that I don't want to put it on my list is because I think it's a little disingenuous. Now, I called Rocket League being great, obviously, for a long way out as a big joke and kind of running thing in our in our community. But, and I also dedicated, you know, about a week's worth of time into it before anyone had it, playing it, getting most of the trophies, really enjoying playing against the AI, playing against some people online when no one knew what they were doing. But the spirit of the game is it's multiplayer. competitive multiplayer in which I do not partake in at all because everyone's so good. So, um, while I respect The Shadow of Rocket League, uh, I think it's a great game. I think it's a really fundamentally interesting game. I think it's a different kind of game. Um, I don't necessarily want to put on the top 10, but I do think it is a fantastic mustplay game on PlayStation 4. I just don't think it belongs on my list when I kind of",
            "start": 693.44
        },
        {
            "text": "a different kind of game. Um, I don't necessarily want to put on the top 10, but I do think it is a fantastic mustplay game on PlayStation 4. I just don't think it belongs on my list when I kind of compared it and contrast it to other things that I was playing at the time. So, um, or since or before. So, sure. Uh, so Rocket League is my first honorable mention. Okay. My next honorable mention is Fallout 4. Uh I think I have a bad taste in my Fallout in my Fallout mouth right now. In Fallout in my mouth about Fallout 4 right now because of the DLC because the DLC came late. I jumped in. It no longer mattered, right? Like well I don't even remember remember what I was doing and who am I working with and I I got the platinum. So I have all these different saves and digging around and getting back and I was like it didn't even run that well, right? But Fallout 4 as an experience when it got here it was exactly what I wanted, right? It didn't move the bar. It was a prettier Fallout 3. It",
            "start": 726.0
        },
        {
            "text": "back and I was like it didn't even run that well, right? But Fallout 4 as an experience when it got here it was exactly what I wanted, right? It didn't move the bar. It was a prettier Fallout 3. It was a new Fallout 3. It was go to this new area and do all these new quests and do all these different things. But I still loved the [ __ ] out of that game. I played that game non-stop. I don't think it gets a spot in my top 10. I think the other 10 games I have here are better experiences or offered something different or gave me better memories. But Fallout 4 scratched an itch last year that I can't for forget or, you know, now sit here and armchair quarterback what I feel about it after the fact and compare DLC to it. Yeah, I think to me I I only played Fallout 4 for 25 hours or so and I only I mean that's a lot of time but bless you uh for 20 25 hours or so. Uh I think what I was surprised about Fallout 4 is it just doesn't seem to have a stickiness to it. The and I think it is because",
            "start": 762.96
        },
        {
            "text": "I mean that's a lot of time but bless you uh for 20 25 hours or so. Uh I think what I was surprised about Fallout 4 is it just doesn't seem to have a stickiness to it. The and I think it is because it's so derivative. I think they have I think they really do have to go back to the drawing board with this game and I do think it I don't know if it necessarily doesn't bode well for the Elder Scrolls 6. I think we'll see how people kind of go to Skyrim when it comes back out on PS4 and Xbox One, but um which is soon in the coming months. Uh, but what surprises me is that there's just doesn't seem to be a lot of buzz about Fallout 4. Now, I I know it sold really well. I know millions of people played it. I'm not saying that it's not a good game or a great game. I People aren't we no one It's not Fallout 3. We aren't talking about it. the audience isn't talking about it like we talked about Fallout 3 like or Vegas like like we walked in talking about Fallout 4 like when we were in the",
            "start": 804.16
        },
        {
            "text": "not Fallout 3. We aren't talking about it. the audience isn't talking about it like we talked about Fallout 3 like or Vegas like like we walked in talking about Fallout 4 like when we were in the leadup to Fallout 4 because I think it did you know I'll never forget that Games Cast when we were so excited about Fallout 4 and Tim who doesn't give a [ __ ] about it asked us like what does this game have to do to meet your expectations and what does it have to do to exceed them and I'm like meet my expectations it has to just be what I think it's going to be pretty fallout four to or three to exceed them it I have to be blown away and get into crafting and do all these different things and that totally didn't happen base building sucked I didn't have any fun with that. It was just Fallout 3 again prettier, which was great and fun and I enjoyed it. But if Fallout 5 comes out and I look at what's happening, I'm like, \"This looks just like Fallout 4,\" I'm going to be way less excited for",
            "start": 837.36
        },
        {
            "text": "3 again prettier, which was great and fun and I enjoyed it. But if Fallout 5 comes out and I look at what's happening, I'm like, \"This looks just like Fallout 4,\" I'm going to be way less excited for that. Yeah. Yeah. And they I I think they know better. Um my second honorable mention goes to Wolfenstein: The Old Blood, which was a basically a full game in and of itself, but it's it's it's a standalone DLC pack for Wolfenstein: The New Order. Um, and I really really loved what Machine Games did with this and uh really gave me hope before E3 when it was basically confirmed in an Easter egg that they're going to make a new one called the new looks like it's going to be called the new Colossus. Um, I really like what ID's been doing as we're going to see in a minute with their single player centric shooters. Yeah. Story-based shooters. And I think that, you know, Machine Games, even though there's a lot of experience on that team from other shooter studios, um I think Starburies and",
            "start": 871.04
        },
        {
            "text": "centric shooters. Yeah. Story-based shooters. And I think that, you know, Machine Games, even though there's a lot of experience on that team from other shooter studios, um I think Starburies and stuff like that, the the fact is is that they they're doing something really special over there. And I think that the the old blood um was really really awesome and really really impressive. And I really like the challenge mode especially. I didn't do all of them cuz some of them really hard, but you go back to certain maps and basically are racking up scores by uh killing people in certain ways and kind of doing things quickly and doing things completely. Um, so I really thought it was a it was a fantastic little piece of DLC. Affordable. People always ask me, should I get the new order? I get the old blood. And I say, you got both. Um, so you know, props to Machine Games. Really excited to see what they're working on. I assume that the next one will come out next year and we'll see D3, I'm",
            "start": 911.36
        },
        {
            "text": "old blood. And I say, you got both. Um, so you know, props to Machine Games. Really excited to see what they're working on. I assume that the next one will come out next year and we'll see D3, I'm sure. So, uh, so that's my second honorable mention. My final honorable mention is Valiant Hearts. I loved Valiant Hearts. Adored Valiant Hearts. I think when we talked about this like we're going to do this top 10 thing, I thought it would have gotten into my top 10 no problem. But I got there and put down all these PlayStation 4 games. And for some reason, it didn't crack into that. I feel like it was probably number 11. It's the one that's right outside. And I have a million reasons for why my top 10 is my top 10. But I can't sit here and not talk about Valiant Hearts, how great that story was, how interesting it was. The gameplay was. I had a good time. It was It told such a It was It It was such a great game showing you World War I and giving you all this these historical touch points",
            "start": 948.16
        },
        {
            "text": "how interesting it was. The gameplay was. I had a good time. It was It told such a It was It It was such a great game showing you World War I and giving you all this these historical touch points to it and these things you'd pick up and reading the newspapers or seeing what's going on here. It was a very cool game. Um, it's funny because Valiant Hearts was on my short list as well and uh didn't make my honorable mentions, but was probably in the last 15 along with Child of Light, which was another UB Ubisoft kind of art game. Um, I'm a little confused where these games have gone. I mean, the Child of Light and Valiant Hearts came out months apart and and and this is kind of within the same framework, I would say, as um Rayman. Uh, maybe not as high budget or as as well appreciated. Um, but I do think I agree with you. I think Valiant Hearts deserves an deserves a shout out and it's not really another mustplay game. It's an interesting game. It's an adventure game and and um kind of",
            "start": 985.44
        },
        {
            "text": "but I do think I agree with you. I think Valiant Hearts deserves an deserves a shout out and it's not really another mustplay game. It's an interesting game. It's an adventure game and and um kind of like a sidescrolling puzzle solving adventure game. Um but there's like kind of some action elements to it and stuff, too. I I think it's a cool a cool experience that I I do recommend to everyone, especially if you're into history or into that kind of thing. You're into kind of more somber and uh cerebral experiences. Exactly. Yeah. Stories and what's yours? My final honorable mention goes to Doom. Ah, you love Doom. I didn't beat Doom. I'm I'm about I don't know, I want to say 80% through it. I just other things came up and I just haven't finished and I was playing it very deliberately. like I was I've gone through every I think there's like 14 chapters. I think I've done 11 or 12 of them doing like getting every collectible, getting like every upgrade, getting every challenge really",
            "start": 1021.52
        },
        {
            "text": "I was I've gone through every I think there's like 14 chapters. I think I've done 11 or 12 of them doing like getting every collectible, getting like every upgrade, getting every challenge really like very in in it. So, I've actually played the game by hours probably way longer than most people who have beaten the game. Yeah. Um, so I'm confident in talking about it in in a somewhat of an authoritative way. And the reason I I alluded to when I was talking about the old blood, this single playercentric thing that Bethesda as a publisher has been doing, Doom obviously comes from id new look ID. this game Doom Doom 4 really um was in trouble and and it seems like it was remade on new ITTE and um there were very little expectations. Remember the the games embargo was all strange and and it ended up being good. It ended up actually shattering the expectations that people had of games not of games being released close to embargo or at embargo where everyone's like well it's a bad sign. And",
            "start": 1057.6
        },
        {
            "text": "up being good. It ended up actually shattering the expectations that people had of games not of games being released close to embargo or at embargo where everyone's like well it's a bad sign. And typically in the gaming industry that is traditionally a bad sign and it still is a bad sign. Um but Doom was the one that was like no it's it's actually a really great game. I just don't know if they didn't realize it or if it didn't mock review well or if they really just wanted to wait for the updates in the online component which is not important to the game at all. I don't think gives a flying [ __ ] about it frankly. Um what I was really surprised about with Doom is Doom always told a story kind of a cursory way about Demons on Mars is a very silly kind of shitty kind of you know sci-fi thriller kind of thing. But I was actually really surprised in reading some reviews where like the story doesn't matter. There's no story. I'm like there's an incredibly deep story actually in this new",
            "start": 1093.76
        },
        {
            "text": "kind of thing. But I was actually really surprised in reading some reviews where like the story doesn't matter. There's no story. I'm like there's an incredibly deep story actually in this new Doom. It's not necessarily an important or integral story to appreciating the Twitch gunplay that the fast fluid 60 frames that they have going on in this game, but it's really really really really surprisingly deep. If you go get all the cotices, if you read about the monsters and the weapons it's surprising like they've almost tried to ground Doom in a way and you know Doom I think from Doom 1 to two to three has gotten I guess more grounded if you want to call it that. It's never been grounded. There's nothing grounded about fighting demons on Mars but um and and in hell as well. Uh, but it's I liked that narrative edge to it. It's there if you want it, but it doesn't get in the way of the game. It's kind of similar to Wolfenstein in in that sense, although I think the the the the plot is",
            "start": 1131.12
        },
        {
            "text": "I liked that narrative edge to it. It's there if you want it, but it doesn't get in the way of the game. It's kind of similar to Wolfenstein in in that sense, although I think the the the the plot is more in your face in Wolfenstein and it's more essential because you do have a character who BJ Blasovitz is in Wolfenstein is a character who talks and interacts and does all those kinds of things way more than you would see in a Doom game. So, um, yeah. So, shout out to Doom and shout out to Bethesda. I mean, but Bethesda appeared three times in the honorable mentions. And and I'm confident in my own selections and your selections that I don't think any of these games appeared in each other's lists. So, right. Rocket League is not on your list, I assume. Or maybe it is. Or is it? I know Wolfenstein and Doom isn't. No, they are not. So, and none of yours are in mine. So, lots of great games. So, yeah. So, there are a lot of good games. And I also excited now to see what the list is how",
            "start": 1171.04
        },
        {
            "text": "and Doom isn't. No, they are not. So, and none of yours are in mine. So, lots of great games. So, yeah. So, there are a lot of good games. And I also excited now to see what the list is how the list is going to be made up because there's not there's no overlap yet. Although, I'm sure there's going to be overlap on this. Although looking at my list, I bet you there are only four games that we share. I'm going to say there's one, there's two. That's my guess. I think there's going to be three. Three. Yeah. Okay. Everybody remember that? Write it down because we'll forget as always. You want to start with number 10? Sure. Uh my number 10 is Dying Light. Ah. Um I think so. We've talked kind of a lot about this especially on Games Cast and this has kind of turned in a little bit of a joke running joke with our audience but this in another game called MadMax. Um I really just think Dying Light is and Dying Light's not a game I beat but a game I again I got so sucked into similar to The",
            "start": 1207.52
        },
        {
            "text": "running joke with our audience but this in another game called MadMax. Um I really just think Dying Light is and Dying Light's not a game I beat but a game I again I got so sucked into similar to The Witcher but in a better way for me where I really began to appreciate the craftsmanship of the game and the way the game's put together and the and the scope of the game. It's another zombie game which is unfortunate for a lot of people. I mean, it's the way we talk about Days Gone where it's like, oh, but it's just it looks like The Last of Us and and that game can really suffer. But I think Dying Light still made it into that window in early 2015 where I was like, well, you could still kind of get away with the zombie [ __ ] without it being a little trit. Well, what's interesting is you've been against the zombie thing for so long. So, for a zombie game to get you at this point, I mean, 2015, sure, but it was like you've been over it way longer than that. Yeah, I know it was over when",
            "start": 1249.68
        },
        {
            "text": "been against the zombie thing for so long. So, for a zombie game to get you at this point, I mean, 2015, sure, but it was like you've been over it way longer than that. Yeah, I know it was over when we even got The Last of Us. Um, and it's just that things are being done differently or the gameplay mechanics or the story or some sort of uh ancillary quality of the game drags you in. And I think with Dying Light, I just like the I like the crafting. I like the dayight cycle. I think it's really cool. Like you don't go outside during that night. It's really dangerous. It it you know, games like that really started with me with like Castlevania 2 Simon's Quest on NES where there's a dayight cycle and at night it's a little more scary. It gets darker. The enemies take twice as much damage. You're dealing with some new features, whatever. In in Dying Light, the game is brutal. Like at night, like you don't really want to go [ __ ] around outside. Of course not. No. You get scared when it",
            "start": 1283.36
        },
        {
            "text": "dealing with some new features, whatever. In in Dying Light, the game is brutal. Like at night, like you don't really want to go [ __ ] around outside. Of course not. No. You get scared when it starts. The sun starts. You don't get that warning. Yeah. And and the the enemies are like way harder. Like you can't really see them. You see them on your like HUD tracking you and you're like hiding and staying still. There's a there's a horror quality to the game that I think is underappreciated. And I really do think, as I've said before, that Techland um outdid themselves. That game sold many millions of copies. So, I'm not the only one out there that enjoyed it. Um and it had a long burn, too, which I thought was interesting. It came out at the right time at the right place. Uh, so I wanted, you know, I didn't want it to be like high up on the list, but I didn't want I would be remiss not to talk about Dying Light. Sure. Uh, I compiled I'm comp Oh, first off, I want to give a shout out to",
            "start": 1320.0
        },
        {
            "text": "know, I didn't want it to be like high up on the list, but I didn't want I would be remiss not to talk about Dying Light. Sure. Uh, I compiled I'm comp Oh, first off, I want to give a shout out to Tom Hawkins over on twitter.com/gameover right before we did the I threw up the question. Hey, we're about to do this show. What's your number one? What's your favorite PlayStation 4 game? Tom Hawkins chimed in with Dying Light. Said, \"Refreshing, fun gameplay. Intense. Looked great. Story wasn't amazing, but still pushed me through to the end.\" Uh, for me, starting at number 10, because the way we're doing this with points and stuff, I feel like these are throwaways, right? Like it's gonna be really hard for them to go. And not that this I wanted to put one in here that I think is new and I I'm really behind. And I put Overcooked in. I I [ __ ] totally dug my weekend with Overcooked. And there's two games on here in this list. I feel like they're like one night stands where I I played the",
            "start": 1352.8
        },
        {
            "text": "really behind. And I put Overcooked in. I I [ __ ] totally dug my weekend with Overcooked. And there's two games on here in this list. I feel like they're like one night stands where I I played the [ __ ] out of them when they first ca I first got them or did whatever. And it was great and I had a lovely time. And I don't Overcooks works well as co-op, right? Po was in town for the Weezer concert. We sat on the couch and it was literally like, \"Let's play something.\" And turned it on. I was explaining what all these games were. I was like, \"Oh, then this Overcook game. I don't know much about it, but we got to cook.\" And we sat there and we got obsessed with it to the point that it was all of a sudden we're sitting there shouting out what to do. All right, I'm going over there. Okay, I need a tomato. Bring in we were talking like we were tomato. We were talking like we're in a short order cook thing. And it's like just as we thought we had it, they'd add some new wrinkle to it of",
            "start": 1390.0
        },
        {
            "text": "I need a tomato. Bring in we were talking like we were tomato. We were talking like we're in a short order cook thing. And it's like just as we thought we had it, they'd add some new wrinkle to it of like, okay, okay, now you know you're not just doing soup, you're making pizzas. Okay, now you think you've got this. The place is haunted and the tables are going up and you can't get what you need. And then, okay, now there's cars. You have to move between do all these different things. And it was like, I'm a huge Diner Dash fan from back in the day. What a hu what a great move this is of bringing something back like that and then complicating it by making it co-op by making you go at it with somebody else, but work together and do all these different things, right? I mean, it's what surprises I'm looking something up, bro. What surprises me is no matter how good the game is, it seems like a waste of a space. I I'm interested to see what what I'm I'm I'm now I'm a little intrigued by a",
            "start": 1422.0
        },
        {
            "text": "I'm looking something up, bro. What surprises me is no matter how good the game is, it seems like a waste of a space. I I'm interested to see what what I'm I'm I'm now I'm a little intrigued by a little more intrigued by your list. Like what are you what are you playing around with here? Yeah. Um well, it's just like I feel like this generation is or this generation so far isn't defined by it, but my memories, what stands out when I talk about what we're doing here is the local co-op experience, the local competitive experience. It is Overcooked. It is Starwall. It is Gang Beast. It is Towerfall. It is Video Ball. It is all these different games that I want to sit on the couch and play with. When we first started kind of funny and we started doing all the different let's plays and we were trying to do like multiplayer Mondays and stuff, those are some of my favorite times and like screaming at Nick and doing all these different things. And so there's I wanted to give a slot to at",
            "start": 1456.24
        },
        {
            "text": "were trying to do like multiplayer Mondays and stuff, those are some of my favorite times and like screaming at Nick and doing all these different things. And so there's I wanted to give a slot to at least one of those games and get it out of the way here, right? Especially with our rules of like, you know, Overcook debuted everywhere at once. Whereas like Starwall was on PC and Towerfall Ascension was already on the what's the [ __ ] uh the shitty thing? Ouya. It was on Ouya and nobody cared and then it finally got over here. Like this is one that I think works is new and I think deserves a nod even though it's very very young in the game. Number nine for me uh is Super Stardust Ultra. Um so this is an interesting one that I think skirts the rules a little bit because Superstardust Ultra is in many ways Super Stardust HD. It's just it's a port, but it is an enhanced port with added features to it. Some new gameplay elements. I mean, it's it's it reminds me the way I felt about Super",
            "start": 1497.92
        },
        {
            "text": "is in many ways Super Stardust HD. It's just it's a port, but it is an enhanced port with added features to it. Some new gameplay elements. I mean, it's it's it reminds me the way I felt about Super Stardust Delta, which is a Veto launch game. Yeah. Which is still one of Vita's best games where it's it's pure gameplay. Super Stardust um is really really [ __ ] good and uh addictive in that housemart quality, right? We I I I played Alienation for fewer than 10 hours. I think you probably played it for, you know, maybe a similar amount of time or maybe a little bit more. Um, and I was surprised by how little it it hooked me because to me, alienation is too much to make it a Housemark game. It it loses sight of what made it a housemark game. When I talk about the Housemark game that can go the furthest, it was detonation where Housemark was like, we have the twin stick shooting that we're known for, the difficulty, the scorebased kind of stuff, and we have some of these elements, these",
            "start": 1537.76
        },
        {
            "text": "the furthest, it was detonation where Housemark was like, we have the twin stick shooting that we're known for, the difficulty, the scorebased kind of stuff, and we have some of these elements, these upgrade elements and these these collectible elements, but we don't it it's just enough. we're not gonna like we're not gonna make it a focal point of the game. And that was a huge problem for me with Alienation that turned me off instantly where I'm like this actually isn't about playing. This is this is about upgrading and looping and all that kind of stuff, but it's not for score and it's not for I'm like so the spirit of the game is lost. Yeah. Um it doesn't mean alienation is anything less than a good game cuz it is. But I am concerned that I couldn't believe it. I have a Housemark sticker on my on my computer. I I love that studio. I I I adore Housemark. I've adored Housemark for years and that was I was shocked by how little I cared about alienation after playing it which was like",
            "start": 1582.64
        },
        {
            "text": "on my on my computer. I I love that studio. I I I adore Housemark. I've adored Housemark for years and that was I was shocked by how little I cared about alienation after playing it which was like when Reszog Gun came out I was I couldn't stop playing it and so with Super Stardust Ultra which was ported by another studio but you know Housemark was involved and Sony obviously XD helped them bring it out I I just I was so pleased with it. I thought it was a fun game. It's Super Stardust. Yeah, it's the same game you played on PS3. It's the same game you played on VA. Now you played on PS4 but there's something about that that makes it so special. It's what I think is going to be what we find with Matterfall, even though we don't know anything about it yet from Housemark. I think that's going to be Matterfall to Reso Gun is that what I think is going to be Superstars Ultra like Superstars HD or Delta. So, I want to give a return to just arcade gameplay, right? And that's all that matters",
            "start": 1619.28
        },
        {
            "text": "to be Matterfall to Reso Gun is that what I think is going to be Superstars Ultra like Superstars HD or Delta. So, I want to give a return to just arcade gameplay, right? And that's all that matters to me with their games. If I want a story or upgrades or whatever, I'll look elsewhere. Maybe they can do it better and more effectively. They did it with Deton Nation, which I think is a far superior game to Alien Nation. Um, so, uh, nonetheless, uh, pure gameplay experience. Super Stardust Ultra. Okay, number nine. My number nine is The Witcher Wild Hunt. Witcher 3: Wild Hunt. Uh, you know, Witcher 3 on paper is a game I should not give a flying [ __ ] about. Uh, it is, you know, what I'm always making fun of. This high fantasy uh monsters and this and it's in olden times and all these different things are going on, right? I This is not a game that usually matters for me, but it hit at a time when I wanted a world to get lost in. I wanted an RPG to get lost in. And so to get it and get",
            "start": 1652.88
        },
        {
            "text": "things are going on, right? I This is not a game that usually matters for me, but it hit at a time when I wanted a world to get lost in. I wanted an RPG to get lost in. And so to get it and get in there and be Geralt and then learn learn, you know, I actually, you know, prefer Tris so much, right? And it wasn't even just trying to have sex in the game. It was like, I thought she was a cool character, so Yennefer shows up. I'm like, no, no, I'm good. I got, you know, and like to have those connections and do that. That's what those kind of games are about. When I'm talking about getting lost in a world, it's not just the fact that there's a million question marks to do, there's a million things to do, there's all these different things. I liked all the characters in that game that mattered. I liked Tris, you know what I mean? Yennefer warmed up to in the end or whatever. But then like you know chasing this girl that you're somehow connected to. And granted it was my first Witcher game.",
            "start": 1690.4
        },
        {
            "text": "I liked Tris, you know what I mean? Yennefer warmed up to in the end or whatever. But then like you know chasing this girl that you're somehow connected to. And granted it was my first Witcher game. So I'm like she my daughter or what? And I had to have it explained to me like oh okay cool whatever. The game's awesome. The game special. Uh I liked the combat in it. That was you know I mean you you know it as well as most of our fans man. Like I loved Kingdoms of Hummer Reckoning and I just want every game to have that kind of gameplay and this doesn't but it I thought it did have it not it did to an extent where I was rolling and dodging and I had different things. as I was slashing. It's not arcadey though. But it's And that's the thing. It's like it's weighted, don't get me wrong. It's different, but it still felt fast. I still felt in control, but not overpowered, not comically either way. Right. And so, it's another one of those things that's like I I'm never going to sit here in",
            "start": 1725.36
        },
        {
            "text": "different, but it still felt fast. I still felt in control, but not overpowered, not comically either way. Right. And so, it's another one of those things that's like I I'm never going to sit here in front and be like, I put 75,000 hours into The Witcher, right? I think I I think it's been so long now. I think it was 35, right? I don't think I ever made it out of act one because I just got lost doing everything. But it's one of those games to me. It reminds me so much of so many friends I had with the old GTA of like so much time got put into those games, but I don't know what I didn't finish the story. I don't know how it ends, but it didn't matter because every one of those side quests you go on, you find something, you know, that you're totally into this intrigue between this guy and his wife and this abortion or this, you know, this woman or this guy over here who's mourning the loss of his, you know, beloved and then it turns out that she's this horrible ghost. Like there was",
            "start": 1760.32
        },
        {
            "text": "his wife and this abortion or this, you know, this woman or this guy over here who's mourning the loss of his, you know, beloved and then it turns out that she's this horrible ghost. Like there was like so much intrigue there that I was getting in the bite-sized snippets that I wasn't too worried about the overall thing. I'm not even That's the thing about Witcher is that I I played for about 40 hours. I didn't beat it. Yeah. I got so sucked into the minutia of the game that I'm not even sure what the [ __ ] the game was about after a while because I was those things like do this for this person and do and get all these question marks and obsess over all this stuff and and as I've said many times ad nauseium that game's too much. There's too much. Um, now I respect why people appreciate that and that's awesome and I wish them the very best. I don't think the game is bad. I think the game's actually great. Yeah. Uh, it's just it it act the game also infuriated me and I I because I just",
            "start": 1799.84
        },
        {
            "text": "and that's awesome and I wish them the very best. I don't think the game is bad. I think the game's actually great. Yeah. Uh, it's just it it act the game also infuriated me and I I because I just felt like I was making no progress and this is, you know, when if you read the comments on the internet about when I say that, everyone's all mad about when I talk to people that I know, everyone's like, \"Yeah, it's like insane. It's absolutely ridiculous.\" We were talking to a friend of ours, high ranking person and another developer that we were talking to. Yeah, it was it was outrageous and and yeah, I was like I don't want something like Mass Effect where I'm like I need more like Mass Effect 1 2 and 3 were great. The games got less dense and less RPG- like as as it went on and that frustrated me even though I think the games themselves got better and the story and the plot was awesome. I was always like I could use twice as much Mass Effect, but with The Witcher, I was like, I could use",
            "start": 1840.56
        },
        {
            "text": "me even though I think the games themselves got better and the story and the plot was awesome. I was always like I could use twice as much Mass Effect, but with The Witcher, I was like, I could use half as much Witcher, remove half of this content and the game is still way bigger than almost anything else and it doesn't need to be this big. But I do appreciate the the the I I'm curious how many people wrote that game like like how there's a lot that world I mean certainly I'll I'll say this that was the most alive varied desolate bloodshed like just bloodridden war torn world I'd ever seen. I I couldn't believe the attention to every little detail in that game. And I do appreciate that. But for me, for the OCD nature of the way I play games, for the check boxes, I couldn't I after a while, I was like, I I can't play this anymore. I just can't. And it was actually more than 40 hours. I think it was like 60 hours, actually. Uh I played The Division for 40 hours. Um I just couldn't",
            "start": 1876.24
        },
        {
            "text": "while, I was like, I I can't play this anymore. I just can't. And it was actually more than 40 hours. I think it was like 60 hours, actually. Uh I played The Division for 40 hours. Um I just couldn't anymore. So I respect it, but I I but I mean I I at that point I was like, I put in way too much time. I got to move on. And I get that. And that's the thing. In another lifetime, in another world, another dimension, I've beat the Witcher, right? I've played him. I had so much fun cuz I could focus on it. But our jobs, you know, dictate that we move around so much. But I still feel in my 35 or 40 hours or whatever it was that I got my money's worth for sure. You know what I mean? And I often think about going back and jumping back in. It's just like when am I going to have the time and how am I going to remember and where is you know what I mean? There's all these different that game's dead to me just in the sense that not not in a bad way, but just in the sense like I you can't ro you",
            "start": 1918.72
        },
        {
            "text": "am I going to remember and where is you know what I mean? There's all these different that game's dead to me just in the sense that not not in a bad way, but just in the sense like I you can't ro you can't jump back into role playing games. You can't. Yeah, I know. You have to start them again and and it's like there's no there's just no way that I'm doing that again. So, shout out to Nick Free who uh gave us a tweet and said Witcher 3 was his uh favorite PlayStation 4 game. Set the new standard for Western RPGs. I I don't disagree with you in the sense of like man on a production value scale, on a writing scale on all this kind of just absolutely [ __ ] on what is doing. Exactly. That was the thing, right? That's that we always talk about Fallout 4 and how you always say it was developed in a vacuum, right? It was very much like heads down we're making a game and then it turns out what four months pri before that comes out five months before that comes out Witcher 3 drops and it's",
            "start": 1956.08
        },
        {
            "text": "in a vacuum, right? It was very much like heads down we're making a game and then it turns out what four months pri before that comes out five months before that comes out Witcher 3 drops and it's like oh [ __ ] they just changed everything they just changed the way they Wer 3 absolutely I don't want to say embarrassed what but as the game studios was doing with Fallout but but definitely like made them look bad from a graphical standpoint from a production standpoint the game runs better it looks way better it the graphics are better the writing's better the voice acting's better yeah like everything in the game and I was like this is done by like a Polish studio that no one really cared about CD Project had its own fans and stuff but It's the same thing with Techland with Dying Light. Like now they're on the scene. Now there's expectations. Cyber Punk, which who the hell knows when not coming out and Gwent obviously is a game that's coming out before that, which is a spin-off of",
            "start": 1993.52
        },
        {
            "text": "Like now they're on the scene. Now there's expectations. Cyber Punk, which who the hell knows when not coming out and Gwent obviously is a game that's coming out before that, which is a spin-off of Witcher. Um there's now expectations and we'll see how they deal with that. Bethesda has had heavy expectations and I don't think has been dealing with it especially well. They've been delivering what we expect. Can Cyberpunk and inevitably they're going to make Witcher 4, which will probably come out in the 2020s literally. Uh will they exceed expectations or meet expectations? And the same thing with Techland who I'm sure is going to make they're making two games right now and one of them will be Dying Light too. Yeah. Um, number eight for me is Outlast. Ah, um, I Outlast was close to being a launch game for PS4 if I remember correctly. Uh, and I was really impressed by it in a in a time when uh, survival horror is really in the [ __ ] except for some indie classics. I know people really",
            "start": 2024.8
        },
        {
            "text": "launch game for PS4 if I remember correctly. Uh, and I was really impressed by it in a in a time when uh, survival horror is really in the [ __ ] except for some indie classics. I know people really like S for instance, or which came out later or um, you know, we always talk about what I still think is the king of uh, survival horror which is Dead Space. We're not, which is a AAA game. We've just had a der of these games that really matter. And Outlast was really clever. It and I and I I I give Red Barrels a lot of credit. They're making a sequel. I'll be interested to see like what it's all about when it comes out. Um, but Outlast was cool because it was not about combat, which is not necessarily novel anymore, but you go into this this this insane insane asylum. You sneak in. You I you're a journalist. You're you're basically just looking for information and you're trying to survive, avoid enemies. You don't want to fight them. Hide. Use your night vision on your camera. Get the",
            "start": 2060.08
        },
        {
            "text": "a journalist. You're you're basically just looking for information and you're trying to survive, avoid enemies. You don't want to fight them. Hide. Use your night vision on your camera. Get the hell out of there. That's what I loved about it the most was that you were finding and it's a little ridiculous you're finding so many batteries for your camera. But I love the idea of like you can't see in the dark except for with the or except for the night vision on your camera. It's a cool mechanic. Now, are they going to do that in the new one? Are they going to have some sort of different clever mechanic? Should they have even made a sequel? I don't know. I'm glad they are because I like sequels. I don't think that's necessarily a dirty or bad thing. Um, but I I I really feel like that was a early on in the in the PlayStation 4's life cycle, that was one of those experiences where I was like, \"This is a really fantastic game.\" And um I really encourage people to play it. You can probably",
            "start": 2106.16
        },
        {
            "text": "early on in the in the PlayStation 4's life cycle, that was one of those experiences where I was like, \"This is a really fantastic game.\" And um I really encourage people to play it. You can probably find it pretty afford a affordably at this point. So um shout out to Red Barrels Outlast. Uh really really good stuff. Um especially if you like Survival Horror and I think I I think Survival Horror has gone ary. I think that's obvious. Seems like Capcom might be trying to bring it back with Resident Evil after PT kind of influenced it, etc. And so on. But these are all after the fact. I think Outlast was really one of those games that came out cutting edge. Yeah. In a way, in an ironic kind of way where everyone was like, well, Resident Evil 5 and six are like shooters now and all this kind of stuff. That's not what survival horror is all about. It's about survival horror. That's what that's what it's not about anything else. And and it's just the same reason why I love the typewriters",
            "start": 2134.16
        },
        {
            "text": "of stuff. That's not what survival horror is all about. It's about survival horror. That's what that's what it's not about anything else. And and it's just the same reason why I love the typewriters in the old Resident Evil games and the same reason why I like all those kinds of things. It's like it's just there's got to be a mechanic that makes it feel like you might not win. And I feel like in Outlast, it was one of those kinds of games. Now Outlast ending is terrible and like categorically terrible, but you know, it's so hard to end horror games or horror movies or horror anything. That's what I was going to say. I'm really fond of uh Rosemary's Baby and I'm really fond of The Shining. I really love those movies. Probably the with with Children of the Corn probably my three favorite movies. They all are terrible endings, but it's about the it's about the adventure. Rosemary's Baby Rosemary's Baby falls off a [ __ ] cliff, but man, they drop the baby off a cliff at the end, but they",
            "start": 2166.64
        },
        {
            "text": "They all are terrible endings, but it's about the it's about the adventure. Rosemary's Baby Rosemary's Baby falls off a [ __ ] cliff, but man, they drop the baby off a cliff at the end, but they they but they they uh it's all about getting there. That movie is fantastic. Uh and Alice is kind of a similar thing. So, I do want to set expectations there, but I do think it deserves to be on the list. Okay. uh in that theme of horror and stuff. My number eight is Until Dawn. What a fantastic game Until Dawn was. And I you talk about a game that seemed like it was it was gone, right? We play that thing for the first time. We're using move controllers. It's this campy8s kind of horror movie vibe or whatever. And we're like, \"All right, this seems whatever. We'll see how it turns out.\" Disappears off the face of the [ __ ] planet. Comes back and it's got Nashville's own Hayden Penitentiary. And that you we sat down and played it and even when we did the remember when they sent us that preview",
            "start": 2202.4
        },
        {
            "text": "off the face of the [ __ ] planet. Comes back and it's got Nashville's own Hayden Penitentiary. And that you we sat down and played it and even when we did the remember when they sent us that preview build and it was like running poorly on the test unit. There was still something to it that was interesting but you weren't sure if it was going to Uncanny Valley or how it was going to come together. And to finally sit down and play that game. What a brilliant [ __ ] idea. What a brilliant idea of going through that, you know, we're such big Heavy Rain fans going through this and watching these guys, the people who are making Until Dawn out Heavy Rain, Heavy Rain. You know what I mean? of like, yeah, the game doesn't end and yes, you can keep going and these little choices you're making in the butterfly effect, how is that going to influence your relationship with these people and how is that going to influence the different stories you get and how are you going to get to this point? I",
            "start": 2240.8
        },
        {
            "text": "the butterfly effect, how is that going to influence your relationship with these people and how is that going to influence the different stories you get and how are you going to get to this point? I thought it's also one of the best, you know, uses of the light bar and motion control, right, of that popping up and like actually feeling like, oh [ __ ] don't move, don't move, don't move, and like the controller rumbling a little bit to [ __ ] with you and stuff. Like there's general terror and fear there. Let alone the fact you're trying to make you make connections and you make decisions, right, where you hate this, you hate the this girl, but you love this girl or you love this guy and you want to see let's get them together as a couple. Let's make this work. Let's try to break up over here. There's all these different playthroughs that one of the reasons, you know, why I always love the Walking Dead game so much, right, is like I always talk about it being a coloring book and we",
            "start": 2275.92
        },
        {
            "text": "here. There's all these different playthroughs that one of the reasons, you know, why I always love the Walking Dead game so much, right, is like I always talk about it being a coloring book and we all get the same picture and we all get the same story and we shade it in differently and that's where it ends. This is that to the eenth degree of going through and okay, cool. What is this going to be by the end of it? Who is going to live? Who is going to matter? I just thought it was brilliant. It was awesome to play it. It was it was it's one of the very very very few games that I loved playing it and then I loved watching it. It was that played through it and then like we did, you know, our extra live stream and I tried to stay awake to watch Nick and Tim play it for the first time to see what they would choose and how they would go and then I wanted to see their differences and then talk to them about it or talk to somebody at a bar, you know, I mean when you're out with Marty or",
            "start": 2307.52
        },
        {
            "text": "see what they would choose and how they would go and then I wanted to see their differences and then talk to them about it or talk to somebody at a bar, you know, I mean when you're out with Marty or something. How did this play out for you? Yeah, I think Until Dawn um is really a special game, but also a game of of of of varying and shifting expectations. I think you're right. We saw the game a long time ago, as you said, at New York Comic- Con, I want to say in 2011, maybe when it was running on PS3, and it was it was interesting. I was like, \"All right, like and then they did disappear. They disappeared for a long time, for years, and and they and they they eventually re-revealed the game, and it was totally different, and it was it was something that Sony had clearly dumped money into. Super Massive is obviously a second party studio or had a second party relationship with Sony. Not so much anymore. They seems like they've gone full third party at this point. Um, and what I'm what",
            "start": 2339.84
        },
        {
            "text": "Super Massive is obviously a second party studio or had a second party relationship with Sony. Not so much anymore. They seems like they've gone full third party at this point. Um, and what I'm what I was so intrigued by was I felt like this game was getting short shrift by Sony. Um, and I feel like it was it was sad because Sony was putting a lot more energy behind The Order, which was definitively a bad game and their whole marketing budget seemed to go there. And so by the time Until Dawn came out later in 2015, it didn't seem like they really believed in it. It didn't seem like they really pushed it. didn't seem like they really released it at a smart time or in a smart fashion either. And that was super disappointing because I think I think Until Dawn is a super super great game. Interesting PlayStation 4 exclusive. Certainly one of the the strongest PlayStation 4 exclusives. And uh I agree an interesting game that Quantic Dream probably had to look at a little bit kind of",
            "start": 2375.84
        },
        {
            "text": "Interesting PlayStation 4 exclusive. Certainly one of the the strongest PlayStation 4 exclusives. And uh I agree an interesting game that Quantic Dream probably had to look at a little bit kind of closely. Now when we saw Detroit, I think that they're fine, but Detroit looks awesome. Um and it looks like they're back going to take the ball back and and be fine. Uh, what I was most disappointed about with Until Dawn though was it was the what happened afterwards. I thought Sony would have been smart enough and who knows what happened behind the behind closed doors behind the scenes to really be like we need to make this into a franchise. It doesn't have to be about these kids in this place. But until Dawn should be a franchise and you guys should take this money and go make this game and what we found out is that they're not making a sequel. Sony owns the IP. They can have someone else do it if they want. But those guys are going to go make games for everyone now. And and that's fine,",
            "start": 2413.4
        },
        {
            "text": "we found out is that they're not making a sequel. Sony owns the IP. They can have someone else do it if they want. But those guys are going to go make games for everyone now. And and that's fine, but it seemed like it was a mistake. It seemed like they Sony dropped the ball with that. Shouldn't let him get away. Um because what was funny was that no one had any expectations for this game and and you could tell at PSX in 2014 uh the way that that went over the crowd I was like this game is going to be something cool and and it it's one of those few games where I went in with expectations and it actually exceeded my expectations. I'm like this game and I remember telling you I played it first and I remember I remember I played it all in like a day or two and I was I remember you were gone or you were on a trip and I was like you have got to play this game. This game's fantastic. Yeah. And um and that's the same thing. I mean, you talk about games that have recently fallen apart for me",
            "start": 2447.04
        },
        {
            "text": "or you were on a trip and I was like you have got to play this game. This game's fantastic. Yeah. And um and that's the same thing. I mean, you talk about games that have recently fallen apart for me with that, right? Oxenfree, um, uh, Abzu, games that have come out where people are like, \"This is amazing. This is on my short list.\" I'm like, \"Oh, [ __ ] I can't wait to play this.\" And I sit down and play. I'm like, \"Oh, man. The bar was way too high. This is way underneath it for me. It didn't do it.\" To go into Until Dawn, having you said that, having the internet saying that, seeing the reviews, seeing the people talking about on streams and stuff, to go in there and still come away and be like, \"You're right. This was [ __ ] awesome.\" That's rare. Number seven for me is Mad Max. Ah um gonna stand by this game until the day I die. I think that this game got against short shift. I think this game came out at a bad time. Came out at the same day as Metal Gear Solid 5. So obviously",
            "start": 2480.64
        },
        {
            "text": "um gonna stand by this game until the day I die. I think that this game got against short shift. I think this game came out at a bad time. Came out at the same day as Metal Gear Solid 5. So obviously it's going to be compared to a game that I think is probably objectively superior in many ways. Um but I don't think it's superior in every way. I played Metal Gear Solid 5 for for 10 hours or so and I got a taste of it and I think that MadMax exceeds and excels in ways exceeds it and excels in ways that that uh Metal Gear Solid 5 doesn't. Now, the thing about Mad Max is that it's an interesting IP. Doesn't take it doesn't take advantage of the movie that just came out, which is a fantastic film, which is fine. Uh, but there's a desolate nature to the game. There's there's a there's a a direness to it. It's really It's really actually interesting that we talk about games being empty or lifeless, and then we talk about games being too dense. Mhm. Mhm. But the lifelessness and the lack of",
            "start": 2515.04
        },
        {
            "text": "to it. It's really It's really actually interesting that we talk about games being empty or lifeless, and then we talk about games being too dense. Mhm. Mhm. But the lifelessness and the lack of almost uh just anything to do in the game really like in in a meaningful way was part of the game's character because it's like this is like the end of the world, dude. Everyone's like fighting for oil. No one has water and it's over and and so of course there's like what do you expect to point? Yeah. Like the world's done. Like the the sandstorm taking everything over. There's no life and everything. And and I found its desolate nature beautiful. As I've said before, there was no more Journey really nailed the beautiful desert nature, like the a desert kind of thing. And Mad Max, I I there were vistas and I was like, I can't believe how pretty this game is. Now, from a gameplay perspective, it's like Batman light by the Arkham games light. And I don't really like the Arkham combat, and that's",
            "start": 2555.92
        },
        {
            "text": "and I was like, I can't believe how pretty this game is. Now, from a gameplay perspective, it's like Batman light by the Arkham games light. And I don't really like the Arkham combat, and that's not really what what did it for me. It was the car combat that I thought was really cool. Upgrading your car, having like chasing after these cars and using all this crazy [ __ ] to pull off their armor, and like people are jumping onto your car, and you're like swerving to get them off. And I was like, \"This is really cool.\" And and and having just played Just Cause, which is done by a different part of Avalanche that came out a few months later, having played Just Cause 3, just for a little bit, I'm like, I'm not so sure that this game is any like nearly as good as Mad Max. And and and so I understand why people didn't play it or didn't appreciate it. It didn't sell that well. I I I doubt you'll ever see anything from them again in terms of Mad Max. But I think that game deserves a little",
            "start": 2599.64
        },
        {
            "text": "why people didn't play it or didn't appreciate it. It didn't sell that well. I I I doubt you'll ever see anything from them again in terms of Mad Max. But I think that game deserves a little bit more love. And what I I I'm always heartened because I get a lot of tweets, you know, every so often someone's like, \"You're right about Mad Max.\" cuz I went back and played it was I got it for $20. I rented it or whatever. Someone gave it to me and I was like, \"You're right about this game.\" I don't know why I didn't play it. I don't know why I didn't pay attention to it. I really do implore people to give it another look. If you like kind of collectathons, if you like taking over piece, it's a very Ubisoft kind of style game. You take over pieces of the map. Um do these side quests. There's a main story through the game and all this kind of stuff. I think I think you'll appreciate it. Um unfortunately, I spent again, it's one of those games where something else came out and I never I never",
            "start": 2635.68
        },
        {
            "text": "story through the game and all this kind of stuff. I think I think you'll appreciate it. Um unfortunately, I spent again, it's one of those games where something else came out and I never I never got to the very end of it. I almost did, but it's one of those games where I probably spent twice as much time as I should have spent with it, too. Like I if I wanted to beat it, I probably could have and and saved myself 20 hours, too. But I was having so much fun just [ __ ] around. And that's I mean that's a sign of a great game. You know what I mean? And that that you always talk about it, right? Gameplay is king. So it doesn't have to just be the narrative that's driving you through. It is the you know the ab the check boxes and getting lost in a world. And that's what it always comes back to for me. And I think that that's what that game does is the game play is fun, but I also think that the game has character. Yeah. Like I think that the game has heart for all of its it's its uh for",
            "start": 2668.72
        },
        {
            "text": "to for me. And I think that that's what that game does is the game play is fun, but I also think that the game has character. Yeah. Like I think that the game has heart for all of its it's its uh for all that it's it seems like it's missing on the outside. That's part of the game is what it's missing and I think it's pretty cool. I I I I wanted to give that game a shout out. Who knows if it'll survive on the list forever, but Sure. Exactly. For now, I mean, I still think about that game. I'm like, I had a great time with Mad Max. Yeah. Yeah. Yeah. Uh my number seven is Ratchet and Clank. Uh Ratchet and Clank is a game I have not beaten still. What happened is it had come out. it sat on my it sat forever on my shelf or on my uh live area for the PlayStation 4 and I wasn't in the mood for it. I needed to be in the mood for that game and that mood wasn't there and I woke up one Saturday and the mood was there and I jumped in and it lived up to all the expectations you had set and",
            "start": 2697.76
        },
        {
            "text": "for it. I needed to be in the mood for that game and that mood wasn't there and I woke up one Saturday and the mood was there and I jumped in and it lived up to all the expectations you had set and everybody else had set. Uh it was beautiful. It was fun. It was funny. It was interesting. It was, you know, we're talking about games being too light or too dense. It was the the perfect amount of I'd be like, \"All right, cool. I'm almost done. I I'm ready to go to the next story beat, but I only need to collect eight more things for this one side objective. Why not stay here and do this? And then when it did open up and it was I had a whole bunch of worlds. Well, why don't I go after all the gold bolts right now? Why am I, you know, why not just go take care of that? Cuz I'm enjoying the gameplay so much. Sure, the story is fun. It's Ratchet. It's Clank. It's quirk. I'm having great time there. But I'd much rather just be in this world as long as possible. Go through and get as many",
            "start": 2736.08
        },
        {
            "text": "gameplay so much. Sure, the story is fun. It's Ratchet. It's Clank. It's quirk. I'm having great time there. But I'd much rather just be in this world as long as possible. Go through and get as many things. I'm going to get back to it when I'm in the mood, when the mood strikes, and jump into that way. But Ratchet came along and scratched that itch. And when we talk about games, that's what it is. And it was a throwback. It was a return to form. It was it was Ratchet again. Whereas there had been so many spin-offs and weird things. And then people had wanted to get back to a Kraken Time. And maybe Kraken Time did too much. It did too much with the characters. Too many different things that weren't what people wanted from Ratchet necessarily. Uh this was classic Ratchet and it was what I wanted at that time. It's literally classic Ratchet, right? I mean, it's it's a reimagining. It's not a remake or or just a port of the original, but it's a reimagining of what the original probably",
            "start": 2772.64
        },
        {
            "text": "wanted at that time. It's literally classic Ratchet, right? I mean, it's it's a reimagining. It's not a remake or or just a port of the original, but it's a reimagining of what the original probably should have been. Yeah. And so it has new worlds and it's rewritten. And one of the things that I I I walked away from with Ratchet and Clank, I agree with you. Ratchet and Clank's [ __ ] awesome. Ratchet and Clank I had I thought it was going to be fine, but we had been burned by that series so many times since A Cracken Time in 2009 that um I was like I I didn't expect that they were going to execute. And what I was surprised about were a few things. A they nailed one of the things that was was unfortunate about the first one. The tension between Ratchet and Clank. That was the thing that Insomniac admitted was a mistake when they made that game. Ratchet and Clank had an uncomfortable relationship and they did not like each other in the first game. Yeah. And it was weird and I didn't",
            "start": 2807.2
        },
        {
            "text": "Insomniac admitted was a mistake when they made that game. Ratchet and Clank had an uncomfortable relationship and they did not like each other in the first game. Yeah. And it was weird and I didn't like it and and I was like but I want them to like each other. Now you have no idea like they kind of skip and gloss over like their friends very quickly in this reimagin. He teaches them how to shake hands. But it's it's that's part of the charm is like I want them to work together. I'm not looking for a tension between Ratchet and Clank. Like that's not what I want. It's weird the tensions between really Ratchet and Quark in this and and and that to me is not that the story is necessarily important. It's the characters that are important in this game and and the game's well written, well acted. It is funny. It's very funny. And I was surprised by how funny. I was surprised that I was laughing out loud. It's the first time I was really laughing out loud at a game since since South Park.",
            "start": 2843.04
        },
        {
            "text": "It is funny. It's very funny. And I was surprised by how funny. I was surprised that I was laughing out loud. It's the first time I was really laughing out loud at a game since since South Park. Yeah. Um Stick of Truth. The gameplay is really fun and it it it it did what Sly 4 did, which was when Szaru released Sly 4 on PS3 and Veto, which was we were remind we were reminded of this character and reminded of its relevance in a limited way. Now, the movie didn't do anything. They [ __ ] ate [ __ ] on that movie. I don't think Ratchet and Clank is going to be as relevant as they hoped. Yeah. But I really do want them to make another one. And and I was surprised that they charged $40 for it. I thought it was a bold move. It sold probably way better than it was going to charted. They could have gotten away with charging $60 for that. I don't think anyone would have cared. I think they should be smart enough to make the game a little meteor the second time around. And I'm sure they will",
            "start": 2875.68
        },
        {
            "text": "have gotten away with charging $60 for that. I don't think anyone would have cared. I think they should be smart enough to make the game a little meteor the second time around. And I'm sure they will success. I think we're going to start moving back to Yeah. what you saw with the, you know, the ratchets that are more fleshed out. Yeah. So, I think, you know, the the 3D platformer is dead for all intents and you know, for for all intents and purposes, ukulele, son, is bringing it back. Ukulele is going to probably be awesome, right? Yeah. But that's not really the zeitgeist anymore. And I was glad that they were like, \"No, we can still have fun with this.\" And it's still fun. It felt great. It looked great. Um, it looked really great. I was saying that there were parts of that game where I was like, \"This is actually like gorgeous. This is gorgeous.\" Totally. Totally. Well, that was the whole thing that, you know, they'd always said, you know, we I would joke around. I did a bunch of",
            "start": 2912.64
        },
        {
            "text": "I was like, \"This is actually like gorgeous. This is gorgeous.\" Totally. Totally. Well, that was the whole thing that, you know, they'd always said, you know, we I would joke around. I did a bunch of interviews with Ted Price, you know, and did one of South by Southwest and how they would always be like, you know, we're getting through the PS2 or even when we put on PS3, it looks like a Pixar movie. It looks like a Pixar movie. It does. There's this PlayStation 4 version are totally parts that look exactly like a Pixar movie. So, like I said, like for all intents and purposes, like this is as close as we're going to get to that heyday, that PS2 specifically heyday or PS1, but really PS2 heyday of these kinds of games. I think that they might be smart to let it breathe a little bit. I'm still hoping that they're letting Sly breathe. Sly 4 obviously ended on a cliffhanger and I would like to play Sly 5. Um, Sly's gone for a long time. I think you're probably right. Yeah, but",
            "start": 2944.72
        },
        {
            "text": "bit. I'm still hoping that they're letting Sly breathe. Sly 4 obviously ended on a cliffhanger and I would like to play Sly 5. Um, Sly's gone for a long time. I think you're probably right. Yeah, but nonetheless, I I feel like Ration and Clank was a great victory. If it wasn't for Uncharted, I think that would have been the great victory of for PlayStation in the year. And I think that would have been totally fine. And uh I also feel like that the it's it's one of those exclusives that just snuck up. Yeah. We look at we looked at everything. We're like, where are the exclusives? And we're looking at the first parties. I wanted one of those people. And then I'm like, but I forgot like Yeah. that there was this was worth more because we had All for One and because we had Into the Nexus, which what really was supposed to be return form, but wasn't. and we and we had, you know, Frontal Assault and all that. I'm like, \"Oh, Jesus Christ. What are you doing to these characters?\" Because",
            "start": 2978.16
        },
        {
            "text": "which what really was supposed to be return form, but wasn't. and we and we had, you know, Frontal Assault and all that. I'm like, \"Oh, Jesus Christ. What are you doing to these characters?\" Because they're actually really fantastic. And Insomniac is a fantastic studio. So, props to them. And I'll really be excited. I'm sure that they'll announce the next one, too. So, maybe it'll be a PSX. I mean, I'm not They won't show up, but they'll be We're working on it. Will come out. Squiggles over on Twitter gave that Ratcheting Hank a shout, too. He said, \"Took me back to the good old days of no bills and no responsibilities.\" Colin, what's your number six? Number six for me is Wolfenstein: The New Order. Yes. Uh, so in the honorable mentions, honorable mention number two specifically, I talk about Wolfenstein: The Old Blood, which was the spin-off standalone DLC pack, which was basically just another game actually, really just shorter. The Wolfenstein: The New Order, with the exception of",
            "start": 3017.28
        },
        {
            "text": "Wolfenstein: The Old Blood, which was the spin-off standalone DLC pack, which was basically just another game actually, really just shorter. The Wolfenstein: The New Order, with the exception of its abysmal ending or beginning rather, which we talked about many times over. If they just cut that, they just cut that 30 minutes out. That game is awesome. That game is so awesome. Now, I know that alternate history is a little trit. We have resistance which was kind of carrying the banner for a while and Wolfenstein's always done this thing Mecca Hitler and all that kind of stuff. There's something really cool about the game and by the time you get to Poland and you get to that hospital in the beginning of the game once that intro is over thankfully you what you find is a game that is really really really thoughtful and what I love about it and what I think um Doom has borrowed from or ID had borrowed from it in a way and Machine Games and ID seem to be learning a little bit from each",
            "start": 3052.0
        },
        {
            "text": "really really thoughtful and what I love about it and what I think um Doom has borrowed from or ID had borrowed from it in a way and Machine Games and ID seem to be learning a little bit from each other which is cool being that they're in the same publishing family is the cool way you upgrade your character. Um, and you know, you you you you're you're upgrading yourself by doing things like, and it it sounds so straightforward, but in a shooter, you don't you really get things like that. Like, it's like sneak up behind these guys 20 times and you're going to be able to get this extra skill or get 20 head shot and you'll get this extra skill. It's just not something that's necessarily common to these kinds of games where your character is all about the weapon he finds, not about the character you're building. And I think that Wolfenstein did built character well with BJ Blas, making him human. Yeah. Um, and giving him agency in the game, but also like I love the commander structure in",
            "start": 3090.16
        },
        {
            "text": "you're building. And I think that Wolfenstein did built character well with BJ Blas, making him human. Yeah. Um, and giving him agency in the game, but also like I love the commander structure in in a lot of different areas and like the each chapter has multiple areas where like there are commanders and they have headsets and they're like you can see where they are and you have if you could sneak to them then that no one can call reinforcements and you can kind of sneak without killing anyone. So it's like the the the the variety of enemies was cool. it felt grounded for a game that's about mutating creatures and like you know pseudoarchchaeology and all sorts of [ __ ] that those games are about. Um I always had a soft spot for that series and I was so very impressed with the game when I was at IGN. I said it was I gave it like a 7 something because that that that intro was brutal and I really wonder on their heat mapping how because I'm sure they can see internally like how many",
            "start": 3129.68
        },
        {
            "text": "I was at IGN. I said it was I gave it like a 7 something because that that that intro was brutal and I really wonder on their heat mapping how because I'm sure they can see internally like how many people they lost because that intro sucks and it's not indicative. I can't believe it got through. I can't believe they they like left that in. And that's why I'm so excited to see the new Colossus, which is rumored to be the next Wolfenstein game that Machine Games is working on that they hinted at at E3 in an Easter egg during Quake, which was how will this one begin? Because I bet you it's going to begin, they learned everything that's going to begin with a bang and it's going to begin instantly. Just give me control of the character. I don't want to be in an airplane for all this time. I don't want to walk around like a [ __ ] you know? Just let me Wolfenstein's not necessarily about these big things. things about kind of sneaking around and and taking your time and reading documents",
            "start": 3171.28
        },
        {
            "text": "don't want to walk around like a [ __ ] you know? Just let me Wolfenstein's not necessarily about these big things. things about kind of sneaking around and and taking your time and reading documents and finding gold and upgrading your character and all that kind of stuff. And so there's like a cool RPG elements. I think that game deserves a lot of credit and I really implore people to play it. And if you don't have a PS4 yet, you can play it on PS3. There you go. Uh my number six is Tales from the Borderlands. Uh this is a game that completely took me by surprise. They announced this and I thought, what a stupid move. Like Telltale can do whatever they want. They're doing a Borderlands thing. You don't there's no action in Telltale games. How are they going to do that and make it make sense? I love Borderlands 2. Played the hell out of that. Played the hell out of the handsome collection. Played, you know, uh the pre-sequel that through that. And I don't play Borderlands for the",
            "start": 3204.08
        },
        {
            "text": "sense? I love Borderlands 2. Played the hell out of that. Played the hell out of the handsome collection. Played, you know, uh the pre-sequel that through that. And I don't play Borderlands for the story. I of course play Borderlands for the guns and the RPG and leveling up and having something fun to play with other people. Uh when this came around, I I got my code. I put it on my PlayStation 4 and forgot about it. And the story goes that, you know, I think it was 3 weeks after release, maybe two weeks, I was sitting there, I'd had a bad day, I had a beer, and I jumped into a game, started playing it, and I was like, \"This is the one I want to jump to another game. This is the one I want.\" Da da d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d d down the line till I saw it and I was like, why not? And 5 minutes in, 10 minutes in, I'm laughing out loud. Like that game is Telltale's funniest game. It is some of the best acting they have from, of course,",
            "start": 3242.16
        },
        {
            "text": "till I saw it and I was like, why not? And 5 minutes in, 10 minutes in, I'm laughing out loud. Like that game is Telltale's funniest game. It is some of the best acting they have from, of course, Troy Baker, friend of the show. Laura Bailey, friend of the show. uh they get on to they just I it caught me so offguard that that a property that I enjoy but don't really care about could enrapture me that way make me care about it make me care more about the world that I'll be more interested to go into Borderlands 3 and and play more around that and understand a little bit better of what's happening but I cared about different characters that are in that game that are in the Borderlands universe that I never cared about before you know what I mean catcher all these different people and then the way they introduce new characters and do callback X. It's some of I've talked to the Telltale guys before. You know, it's I think it's some of their It shows the power of how Telltale makes games,",
            "start": 3274.24
        },
        {
            "text": "way they introduce new characters and do callback X. It's some of I've talked to the Telltale guys before. You know, it's I think it's some of their It shows the power of how Telltale makes games, you know what I mean? Cuz we give them a lot of [ __ ] Their engine's garbage all the time. This different It still is apparently on Batman, which is unbelievable. I when I played on PC was fine, but I haven't played the PlayStation 4 version yet. Even when I saw it at E3, it was chugging and I was like, \"This is crazy.\" But nonetheless, yeah, I always call it Spade is paid for experiences. Um the fact that like Loaderbot was such a hit in episode one that they made him a bigger part throughout the game. He has some of my best lines like when they're like when when [ __ ] Ashley Johnson shows up front of the show as Gordis or whatever and he's like how was your day and he's like to be honest it's a mixed bag. That is one of the funniest [ __ ] lines I've ever heard in a video game. The way",
            "start": 3315.92
        },
        {
            "text": "front of the show as Gordis or whatever and he's like how was your day and he's like to be honest it's a mixed bag. That is one of the funniest [ __ ] lines I've ever heard in a video game. The way it's delivered the whole experience leading up to it and then to continue go and just it it suddenly went from this game that I was like all right that's on my PlayStation 4 to oh [ __ ] a new episode comes out like I'm going to pour myself a drink. I'm going to turn off the lights. I'm going to put on the surround sound and I'm going to have an episode. I'm going to have an experience. I'm going to have like a show I really like on television, right? Where I really care about the characters and I want to see where it goes. And this was for me. I always [ __ ] this up, I think, cuz I, you know, I I skipped Game of Thrones or whatever, cuz I didn't care about it for Telltale. And I think Minecraft was after it, right? But don't for me, it was the first time where Telltale was doing those",
            "start": 3351.84
        },
        {
            "text": "I I skipped Game of Thrones or whatever, cuz I didn't care about it for Telltale. And I think Minecraft was after it, right? But don't for me, it was the first time where Telltale was doing those amazing openings where, you know, Walking Dead's just Walking Dead. You know, they put up the logo and that's what it does. But these were the ones where they picked the exact right song and they would do things in slow motion and spin the camera around and it was like it felt like I was playing it felt like the start of an awesome movie every time like an intro to a movie that was really going to kick in and have a great time with and I had a great time with that game and that's why it's there. Well, what's interesting to me about Telltales Borderlands is that it was it's in that middle ground where like you expect you have expectations of Batman. Yeah. You have expectations of The Walking Dead. On the other end of the spectrum, you have games like uh The Wolf Among Us that where it's like",
            "start": 3384.16
        },
        {
            "text": "where like you expect you have expectations of Batman. Yeah. You have expectations of The Walking Dead. On the other end of the spectrum, you have games like uh The Wolf Among Us that where it's like [ __ ] What's interesting to me about this is like where the rumors that this Mr. Robot [ __ ] falls in, right? Um, does it become like if if if it's true and who the [ __ ] knows? I mean, they're basically at the point in which we're recording this, we have no idea. Um, but there's pretty good rumors about it because they're retweeting things from Evil Corp, which is thing from Mr. Robot and stuff like that, but does it fall within that spectrum of like no one cares? Does it fall into the spectrum of surprise? Are they doing something totally different? Um, Telltale's, even though I'm not into their games, uh, generally like, per se, I I I feel like I I I respect what they're trying to do because I think story has a very important place in gaming and and they're doing it in a way that in",
            "start": 3415.76
        },
        {
            "text": "their games, uh, generally like, per se, I I I feel like I I I respect what they're trying to do because I think story has a very important place in gaming and and they're doing it in a way that in a meaningful and complicated way. And I think that for all the [ __ ] we give them about their engine or especially I give them about their engine, which I think is deserved. I cannot believe that their [ __ ] doesn't run properly still for some people like years later. Game of Thrones was another example where people was eating people's saves. I was like, \"Are you guys nuts?\" It's like just go away and fix this for a while. You have plenty of flesh with cash. Everyone knows that. Um but at the same time, the writing the other end of the game, the writing and the characters so very complicated and it seems like things, you know, like Clement Time will remember that, you know, like it's a famous thing like on the internet now like someone will remember that. It's like but like they do",
            "start": 3449.28
        },
        {
            "text": "and it seems like things, you know, like Clement Time will remember that, you know, like it's a famous thing like on the internet now like someone will remember that. It's like but like they do remember that. And it's cool that that's like written in three episodes from now. And I can't imagine the complicated nature of the way that they have to go string theory on their walls and doing all this different stuff all this butterfly effecting that they have to do for their games. Speaking of until dawn and I think it's worth pointing out just for the record for full transparency of course I'm hosting that Batman show for Telltale over on their that game. But I would I you if you're watching this you probably trust my opinion but just a heads up if you wanted to be a hater or something I I I work with them on that show. Not that that would influence my opinion of Tales of the Borderlands six to seven months ago. My number five is Until Dawn. So, I'll kick it back to you. Oh, okay. Cool.",
            "start": 3485.6
        },
        {
            "text": "work with them on that show. Not that that would influence my opinion of Tales of the Borderlands six to seven months ago. My number five is Until Dawn. So, I'll kick it back to you. Oh, okay. Cool. But yeah, we already talked about. Yeah, I'm just making sure. Yeah, great pick. I'm glad it's there. I'm glad it's getting a lot of points. Uh my number five is Lego Dimensions. Uh Lego Dimensions is another one of those games that actually when it got announced, uh I remember going on Colin Live being like, \"That's stupid. We don't need another Toys Life game.\" And kids were like, \"Well, you love the Lego games.\" And I'm like, \"Yeah, but this will be different. Wake me when they have Ghostbusters and Superman.\" Everybody was like, \"Oh, they get teased in the trailer.\" I was like, \"Well, [ __ ] now. I'm buying Lego Dimensions.\" And then I went in Comic-Con uh last year, right? Yeah. 2015 was the first time I actually played it. And I play I sat down to play it and I was like, \"Oh, it's a",
            "start": 3518.32
        },
        {
            "text": "now. I'm buying Lego Dimensions.\" And then I went in Comic-Con uh last year, right? Yeah. 2015 was the first time I actually played it. And I play I sat down to play it and I was like, \"Oh, it's a Lego game.\" I And I know that sounds so stupid now, but I thought it was going to be something like Disney Infinity where it was characters dropped into a world and there's just some light RPG mechanic thing around them. You're running around doing [ __ ] And it wasn't going to be a Lego game, but it was Lego game. It was the same fan service. It was the studs. It was I I always talk about the stream when they came over and showed us they debuted Back to the Future with us and it was like Huey Lewis is playing and there's three versions of Hill Valley and there's all these references that I get as a huge Back to the Future fan and and Michael J. Fox and Christopher and it's like holy [ __ ] I remember freaking out and nerding out about this and nerding out about the fact that every character",
            "start": 3549.12
        },
        {
            "text": "a huge Back to the Future fan and and Michael J. Fox and Christopher and it's like holy [ __ ] I remember freaking out and nerding out about this and nerding out about the fact that every character you put on the portal pops in has their own HUD. Like it looks different. It looks like the out of time logo for Marty and there's you know donuts for Homer's hearts and all these. And I was saying this and the developer turns me. like, \"Yes, it's as if we care.\" And I was like, \"Oh, right.\" Like, I totally totally wrote this off as this was going to be a Toys Life kids game cash in, and it's not. It is TTG Games making however many you if there's 17 people you're doing in this wave, it's 17 Lego games in a way where they're doing everything you'd want out of it. I think all the the level packs have been awesome. They've been different. They've been fun. Actually, I didn't like Midway Arcade Pack. I thought that one sucked. But if you like Midway Arcade games, I'm sure you would have",
            "start": 3586.8
        },
        {
            "text": "packs have been awesome. They've been different. They've been fun. Actually, I didn't like Midway Arcade Pack. I thought that one sucked. But if you like Midway Arcade games, I'm sure you would have enjoyed it a lot, too. But there's something about it and like to sit there and have the game tell me, \"All right, now it's time to build the portal and now it's time to build the figures in the in the in the uh their cars or their team packs or whatever.\" Like I didn't expect to have that much fun. Like definitely one of the things I love the most about the game is sitting there and building the characters I'm about to put into it cuz I can still go play Lego Marvel Avengers or do whatever the hell I want to go do. But this is a game that scratches that itch of I don't want to be I don't you I know you give me [ __ ] all the time cuz like you are like literally you could just put your clothes in a little spindle and you'd be out the house and you'd have everything. And I I don't have that",
            "start": 3623.44
        },
        {
            "text": "know you give me [ __ ] all the time cuz like you are like literally you could just put your clothes in a little spindle and you'd be out the house and you'd have everything. And I I don't have that much stuff in terms of how I used to live or how I I live in the Midwest or what I have in my dad's attic. And I didn't want to go back to that. You know what I mean? I have rules about the fun co pops I'll buy. But like to have these Legos and have these different things and have these little guys and put them in and have these collections again of things that I use in video games. so much fun and the games are so much they're so interesting. They're so funny and there's so many different things happening and I'm just a big fan. Can't speak to that game. No, I know. So, I'm I'm going to move on if you don't mind. I don't mind at all. Don't worry about it. Number four for me is Ratchet and Clank. So, I'll kick it back to you once more. Uh my number four is Life is Strange. Life is Strange.",
            "start": 3660.32
        },
        {
            "text": "if you don't mind. I don't mind at all. Don't worry about it. Number four for me is Ratchet and Clank. So, I'll kick it back to you once more. Uh my number four is Life is Strange. Life is Strange. Um it's one of those I I think if you're going to talk about games, right, especially this is where we get into a very interesting three games I think in my list. So, we're talking about Lego Dimensions, Life is Strange, and what I put number three. I think that Lego Dimensions I'm over the moon about. I talk about all the time. I tweet about it all the time, right? I host the panels at Comic- Con. I'm excited for year two and I can't wait for all this content and da da da. But when I started getting to these things where I started these three games, I kept moving around. I kept moving around this spot of the 543. And I kept coming back to the fact that Max and Chloe and Arcadia Bay means something to me in a way that Lego Dimensions doesn't. Lego Dimensions is toys. I'm playing with toys",
            "start": 3692.16
        },
        {
            "text": "this spot of the 543. And I kept coming back to the fact that Max and Chloe and Arcadia Bay means something to me in a way that Lego Dimensions doesn't. Lego Dimensions is toys. I'm playing with toys and that's fun and I oh my gosh the Superman voice this is great in a Wonder Woman song and it's all what I want. But Life is Strange is another one of those Telltale like games, right? Where I went through and I made my choices and I played it out the way I was going to play it out and that was my story. That was my story as Max. And there's something special about that. And there's something I because I always talk about it with whether it's Walking Dead, whether it's Gone Home, whether it's a million other games, whether it's Life is Strange, like these experiences, these kind of narratives where I you go through and you live in these people's shoes and you make those choices strikes such a chord with me that Life is Strange I love from a story perspective. As a trophy hunter, I loved",
            "start": 3727.28
        },
        {
            "text": "where I you go through and you live in these people's shoes and you make those choices strikes such a chord with me that Life is Strange I love from a story perspective. As a trophy hunter, I loved going back for the platinum cuz they put in the collectible mode where it was fun to go through and try to figure it all out. Uh, I loved the choices. is I love the way it played out and I just love the fandom that's built around that thing and what those relationships were and it is such an interesting like I remember playing episode one and not being sold on it. I played it right at launch and I was like, I don't know, blah blah blah. And then I waited till they were all out and sat there and played it. And like getting it like that, like binge watching a Netflix show, going through it gave me so much more perspective and what it's like to again be an outsider in this high school and then to have superpowers, which I wouldn't know about, but I know about the outsider part. to have",
            "start": 3768.4
        },
        {
            "text": "gave me so much more perspective and what it's like to again be an outsider in this high school and then to have superpowers, which I wouldn't know about, but I know about the outsider part. to have superpowers and some of the choices you make and how that affects the timeline and going through and having really unexpected cliffhers or seeing different things or even when you rewind it you're like this will be the right choice and it not being the right choice. It was fascinating. It was really fun to play. I think uh you've you've made me very intrigued about about this game in a way that no one else has because it's it's interesting about a teenage girl. It's a I mean not that there's anything wrong with that. It's just like you hate teenage girls. I hate teenage girls. So, it's it's a that's a huge problem for me. But, um you know, I I'm like I just don't know that this game's for me. But the more I hear you talk about it, you know, it's very interesting to also think about maybe",
            "start": 3802.08
        },
        {
            "text": "that's a huge problem for me. But, um you know, I I'm like I just don't know that this game's for me. But the more I hear you talk about it, you know, it's very interesting to also think about maybe putting Don't Nod, the developer, in the same uh category as the way we talk about CD Project Red in a very affectionate way, the way we talk about Techland in the sense that like they made Remember Me, which was a game that was so mediocre that Sony dropped as an exclusive and Capcom picked it up at the last minute. It was published and no one gave a [ __ ] about the game. I platinum the game for some reason. But um and so like you we didn't know that they could they could do this and and it seems like they're charting a different kind of course for them themselves. Very different kinds of games. Um are they doing a second season or are they doing they're doing some digital TV show? Uh there had been what like they that I remember that day where like a whole bunch of Go games got",
            "start": 3840.0
        },
        {
            "text": "of games. Um are they doing a second season or are they doing they're doing some digital TV show? Uh there had been what like they that I remember that day where like a whole bunch of Go games got copyrighted. There was there was a Life of Strange Go got copyrighted URL got registered. I forgot. you have to imagine that they'll be back with because Square Enix by the way props to them um uh just in the sense of you know I I felt the same way about Satsuna which we talked about extensively which is a game the last game I platinum and a game I really enjoyed JRPG where they're they they seem to be identifying in some ways like these kind of more unusual games um from both the east and the west that are not necessarily AAA and not necessarily uh $60 games but games that seem to deserve an audience nonetheless. So deserve an audience is a great way to put it. Yeah. So no, you know, shout out to them. Yeah. Uh, number three for me is Mega Man Legacy Collection. Um, the reason I put this on",
            "start": 3872.64
        },
        {
            "text": "nonetheless. So deserve an audience is a great way to put it. Yeah. So no, you know, shout out to them. Yeah. Uh, number three for me is Mega Man Legacy Collection. Um, the reason I put this on the list was was multiple reasons. First of all, um, Digital, I think it's called Digital. I brought it up here. I always get it's Frank Safaly's company, Digital Eclipse, the guys that put this out, and I watched a really fascinating speech from GDC just a few months ago with him where he was talking about game preservation and the idea of uh, ROMs and the idea of piracy and all these kinds of things. And he was talking a lot about Mega Man Legacy Collection in the sense because they did that game where the reason that that game matters is because it's not they're not ROMs. They're not ports. They're actually they've actually emulated the NES to play these games the way the NES plays them. They are exactly right. And I can tell you there is I I don't know anyone in this world. I'm sure they",
            "start": 3913.04
        },
        {
            "text": "actually they've actually emulated the NES to play these games the way the NES plays them. They are exactly right. And I can tell you there is I I don't know anyone in this world. I'm sure they exist, but I don't know the person that knows those games better than me. Those six Mega Man games. I know those games inside and out. I know every [ __ ] pixel of those games, every note of their music, every beat of their gameplay. I know them. Especially when it comes to two and three. And they are perfect. They're perfect. They're perfectly done. They're perfectly executed. The slowdown's where it's supposed to be. The the the the flicker is where it's supposed to be. And I know that that people are like, \"Well, why do you want flicker?\" Because that's the way the game plays. Yeah. Yeah. Flickering was a way to make the NES run the game. The games were slowing down because there's too much [ __ ] on the screen at once. You can slow, especially Mega Man 3, you can slow the game down manually",
            "start": 3955.44
        },
        {
            "text": "was a way to make the NES run the game. The games were slowing down because there's too much [ __ ] on the screen at once. You can slow, especially Mega Man 3, you can slow the game down manually by shooting too much. And that's part of the gameplay experience. I wouldn't know how to play those games without that kind of stuff. If everyone's like, \"Mga 3 now runs in Top Man Stage when you fight the cats with the yarn and the the yarn battery for them.\" I'm like, \"There's no slowdown.\" Like I don't even know. That's like totally foreign to me, right? Since 1990, they've been playing with the slowdown and and they're like, \"No, the game is running the way it's supposed to run. The NES is emulated here. It's not they're not ports that are that are halfass or whatever.\" And I really respect that. I think this was really lost on a lot of people with this particular collection. Um because everyone's like, \"Well, where's nine and 10? They're both 8bit 8bit games.\" And I'm like, \"But they're",
            "start": 3995.12
        },
        {
            "text": "I think this was really lost on a lot of people with this particular collection. Um because everyone's like, \"Well, where's nine and 10? They're both 8bit 8bit games.\" And I'm like, \"But they're not NES games. The NES wouldn't run those games.\" And and where they look like NES games, but they're not NES games. And seven and eight, you know, are basically bastard childs in that series anyway, as far as I'm concerned, and most people are concerned that really love Mega Man. Um so the other cool thing that they did was the game was affordable digital and and retail, uh PS4, Xbox One, and then later 3DS. And we were talking about uh just to be just to be clear, I'm in the Nintendo 3DS version of the game. Sure. So I want to be clear about that as well. One of the one of the tests in that game is mine that I designed. It's called Morardi's test. Um and because I'm I'm guess a prolific Mega Man fan in the industry and they came to me and and that was one of the great honors actually for me.",
            "start": 4027.52
        },
        {
            "text": "is mine that I designed. It's called Morardi's test. Um and because I'm I'm guess a prolific Mega Man fan in the industry and they came to me and and that was one of the great honors actually for me. Um but what I thought was really cool about it was the challenge mode. So this reminds me a lot about what like endless mode and all those kinds of things did in Mega Man 10, but where they basically were able to hack the hack the games in such a way to patch them together in any way they wanted. And so when they were like Colin, you want to make a test. I was like, \"Yes.\" I'm like, \"What are the rules?\" And they're like, \"You can do whatever you want.\" So there are no rules. So like find this is the way I did it for if you guys want a behind closed behind you. Come behind the curtain. Come behind the curtain. When I did my test for the 3DS version, which they were like, \"Go find YouTube videos of of playthroughs. Identify the timestamps, literally the timestamps of when you want each",
            "start": 4063.92
        },
        {
            "text": "behind the curtain. When I did my test for the 3DS version, which they were like, \"Go find YouTube videos of of playthroughs. Identify the timestamps, literally the timestamps of when you want each stage, and patch them together however you want.\" And so I patched together parts of all six games in any way I want. And they were able to do that. You just jump through a portal and then you find yourself in Mega Man 6 and you jump through a portal and you find yourself fighting Magga and then you jump through a portal and you find yourself in Quickman stage and you jump through a portal and you find yourself in Mega Man 4 and Dive Man stage and I was like this is so cool. I never I never experienced anything like this. It's for Mega Man fans. Um didn't have a platinum trophy which is a huge problem for me but other than that it was a massive problem for me actually. I was like actually a crest fallen when they told me that you guys got to be kidding me. Here's my one thing cuz I'm with",
            "start": 4095.44
        },
        {
            "text": "problem for me but other than that it was a massive problem for me actually. I was like actually a crest fallen when they told me that you guys got to be kidding me. Here's my one thing cuz I'm with you and I'm not I'm not arguing but for somebody out there arguing with their computer why does this get on is not a re-release. It's not Oh, it's not a re-release because it's a compilation and a collection with new additions, plus all the art, all the music, the soundtracks, and all that kind of stuff. I think this game is detached enough from that particular rule where these are NES games that have been on lots of different things, but never put together in this particular fashion. And dare I say, and I've said it before and people scoff when I say it, these games are these games are way better from a gameplay perspective than pretty much everything we play today. Do they? And they sound certainly way better, too, because their soundtracks are absolutely epic. Um, so Mega Man Legacy",
            "start": 4127.76
        },
        {
            "text": "better from a gameplay perspective than pretty much everything we play today. Do they? And they sound certainly way better, too, because their soundtracks are absolutely epic. Um, so Mega Man Legacy Collection is a great insight into the way games used to play and used to be the things that informed the way games are today. Yeah. And I really feel like everyone the there's certain games everyone should play. Yeah. Everyone should play Mario, right? Um, in my mind, everyone should even play Castlevania. Everyone should play Final Fantasy. Like these are games you should play. And you should play Mega Man. And you must play Mega Man. And and and so buy the collection. It's cheap. Try Mega Man 2 or three. Don't start with one necessarily because one's really hard and it's going to turn you off. go back to that later, but try two or three and tell me that that game doesn't suck you in. Tell me that you don't especially if you go in blind. Everyone's like, \"What order should I beat the",
            "start": 4160.96
        },
        {
            "text": "off. go back to that later, but try two or three and tell me that that game doesn't suck you in. Tell me that you don't especially if you go in blind. Everyone's like, \"What order should I beat the bosses in?\" All that kind of stuff. Don't if you don't know. That's part of the fun. What part of the fun of nine and 10 for me was not knowing what the [ __ ] was going on in those games. I know that I know to such a molecular level the other six games that when nine and 10 came out, I was like, \"This is so awesome. I have no idea where to begin.\" Yeah. Yeah. And that was part of the fun. So, if you're going into Mega Man 2 completely, Mega Man 2, one of the classic games of all time, and you're going in totally blind, God bless you. That's so cool that you get to do that. A lot of us don't get to do that anymore. You have no idea where the [ __ ] to begin that game. That is the fun. Figure it out yourself. That's the whole thing, right? When people talk about, you know, if you could have",
            "start": 4197.92
        },
        {
            "text": "to do that anymore. You have no idea where the [ __ ] to begin that game. That is the fun. Figure it out yourself. That's the whole thing, right? When people talk about, you know, if you could have one game erase from your memory and go back, right? Like, this is a chance to go back and play like games that are awesome. I have nothing to say because I I'm terrible at them, so I never have those moments, but I understand what you're saying. Uh my number three is the controversial one and I but it's another one of my one night stand games and it's Rocket League. I am not didn't surp I was surprised that you were I'm sorry I was surprised that you were put on here. I understand. I am not ever going to sit here in front and say I am a Rocket League expert or something like that. No, it was that you went and played it uh at E3 that year. Uh PSX 20. I was confused after PSX in uh Las Vegas. You came back and you're like Dunham's game is awesome. Of course Dunham are you know former boss at",
            "start": 4230.96
        },
        {
            "text": "you went and played it uh at E3 that year. Uh PSX 20. I was confused after PSX in uh Las Vegas. You came back and you're like Dunham's game is awesome. Of course Dunham are you know former boss at IGN now working over at Psionics. Uh, and I was like, \"Okay, cool.\" And then when I went over and played it, it was like, \"Oh, [ __ ] No, this is awesome.\" And then they came in for that stream and ma I'm mainly giving it this because of that stream. And also cuz we're industry insiders. We understand the the scope of this game, what it does, what it means. But when you and me and I think it was Nick and Doug Perry played at on that stream was been Dunham and Doug Perry were playing on that stream together, that was some of the most fun I had ever had. And it was like, \"Holy [ __ ] is this game awesome? Is this game fun?\" the depth to it, the fact that we can get in right now and not know what the [ __ ] we're doing, but still have fun and run the ball and do all these different things. And",
            "start": 4263.92
        },
        {
            "text": "awesome? Is this game fun?\" the depth to it, the fact that we can get in right now and not know what the [ __ ] we're doing, but still have fun and run the ball and do all these different things. And then the unlockable start dropping and all these different things and the customization. It was like, \"Holy [ __ ] I can't wait to get this.\" And then we got it and then we went on a trip and then we came back and everyone online was too [ __ ] good. So then then it becomes less fun, which is why I didn't want to put it on there cuz I don't have that experience in that particular ecosystem. And I and that's why I'm I'm even separating myself from that when I put it on here is the fact that I mean I for me Rocket League's on a pedestal. I think it's like the success story of this generation so far. And I doubt I doubt anything will catch it on in that front of a game that went from being [ __ ] nobody knows what's going on to to being an esport and having all these things and having",
            "start": 4301.44
        },
        {
            "text": "so far. And I doubt I doubt anything will catch it on in that front of a game that went from being [ __ ] nobody knows what's going on to to being an esport and having all these things and having everyone talk about everyone playing. They made something also like 40 times its budget back. 40 times its budget. so awesome about that is that Psionics is a small team and they are a studio that deserves that and this is the little guy winning which in that maybe that's all swept up in the fact that this is a David vs Goliath video game story that now they are there and they can do whatever the [ __ ] they want now but it's also the fact that they did everything right with it and they here's free DLC and whatever we're doing Batman DLC and let's do this and blah blah blah and we're going to and they're constantly talking to their audience constantly talking to their fans but it still is that point that if you want to be me and you want to have a your friends over for some beers You can sit",
            "start": 4331.36
        },
        {
            "text": "they're constantly talking to their audience constantly talking to their fans but it still is that point that if you want to be me and you want to have a your friends over for some beers You can sit there and play local Rocket League and everybody can start at being terrible and go into it. And then if you want to go home and you want to be the person who's going to get nuts with it and get online, you can still go do that. You can still go be that and do those the amazing kickflip things. And like Pokémon Go, right, is this success story obviously and this runaway cultural phenomenon and that's broken through video games in terms of that, right? Like it's outside of just us and gamers. Rocket League. What is that to just gamers where it was like I remember when we were at GameSpot for something and they were doing an inoff huge tournament. I like that's really cool. And then I went and gave a speech at another video game developer who makes AAA games and they were having a Rocket",
            "start": 4370.08
        },
        {
            "text": "something and they were doing an inoff huge tournament. I like that's really cool. And then I went and gave a speech at another video game developer who makes AAA games and they were having a Rocket League internal tournament and it was like I remember when we went to um not I guess it was RTX RTX or PAX or whatever and it was RTX and Freddy Wong was there and he's like I am I'm jonesing to go play more Rocket League and he you know I was like oh I think they're doing a tournament. and he went entered. It was just like there's something about that game that if it's it's it is one of those simple to understand, difficult to master things, but it is that thing that's always there for you if you want it. And I it think it's such a [ __ ] masterpiece. I respect it. Yep. I respect that choice. Thank you. I'm glad you respect something I did. Number two for me is Reszo Gun. Uh Reszog Gun is still the best pure gameplay experience on on PlayStation 4. A launch game, Housem Mark. Again, yeah,",
            "start": 4409.76
        },
        {
            "text": "Thank you. I'm glad you respect something I did. Number two for me is Reszo Gun. Uh Reszog Gun is still the best pure gameplay experience on on PlayStation 4. A launch game, Housem Mark. Again, yeah, getting a shout out here. Um, what can you say about this game other than that it's almost perfect. I I I mean Reszo Gun is astonishingly good. And that was what again we we talked about Alienation uh a little bit earlier. That was what was so surprising about that particular game and why I'm actually way more excited about Matterfall is because they're they lost the plot a little bit with that game where they're basically diverging in two different paths where they're like we have the Stardusts and the Reszo Guns and we have the Dead Nations and like those other kinds of the nation games where they're a little deeper and when they really just focus on gameplay and scoring uh they excel in a major way. And what I realized about Reszo Gun was that at first it seemed a little complicated",
            "start": 4448.48
        },
        {
            "text": "they're a little deeper and when they really just focus on gameplay and scoring uh they excel in a major way. And what I realized about Reszo Gun was that at first it seemed a little complicated and even a little bit obtuse and then you realize that it's not complicated at all. Well, it's it's complicated to play if you want to master it, but it's it's very straightforward. You're upgrading your ship. You're finding uh weapon upgrades. You're saving the the humans. The humans that are dropping off, you have to save them. Um save the human. Very uh very uh rewarding platinum trophy to get as well. Um it later came to PS3 and VA, and it doesn't look the way the games, the voxels in the game are really do push the PS4, and it's it's not it's just not the same game on the other platforms, especially on VA. It's like very dumbed down graphically and aesthetically. But I really do feel like Reszog Gun is an exceptional game that is really hard to beat from just a from the reason that we've",
            "start": 4488.08
        },
        {
            "text": "on VA. It's like very dumbed down graphically and aesthetically. But I really do feel like Reszog Gun is an exceptional game that is really hard to beat from just a from the reason that we've all started to play games, which is not necessarily for story. These are additive elements. Reszo Gun doesn't give a [ __ ] about any of that. Reso Reszog Gun is just like it's just fun to play and it's it's fun to loop through the game. You can beat the game in a half an hour or 45 minutes and then you do it again and you look at the scoreboard and you see where everyone is. You hit triangle to like kind of sort it to your friends and you're like, \"God damn it.\" Like one just ahead of you. Yeah. Really really special game. It has that housemark magic. That game has that housemark magic that I'm confident Matterfall is going to have as well that I feel like Alienation was lacking. And so, um, what a huge get Sony has with this studio. They don't own them, but they have a very close relationship",
            "start": 4526.88
        },
        {
            "text": "Matterfall is going to have as well that I feel like Alienation was lacking. And so, um, what a huge get Sony has with this studio. They don't own them, but they have a very close relationship with them. I'm surprised they haven't bought them. Um, they just make great gameplay experiences, and I think Reszog Gun is the is the great gameplay experience on PlayStation 4, and I really would be surprised if it is ever beaten in that respect. I don't think it's ever going to be beaten from that pure Rush gameplay perspective, that old school aesthetic, that old school feel. Um, it's basically Defender on on steroids. And it is a very, very special game. And I've been beating the drum on that game for a very long time. And I was absolutely [ __ ] right about it. By the way, let's just let's just be very clear about that. Rocket League was Rocket League was a Colin was right moment. Yes, we're all excited about that. We all know that, right? Reszo Gun was one of those things where I came",
            "start": 4562.96
        },
        {
            "text": "just be very clear about that. Rocket League was Rocket League was a Colin was right moment. Yes, we're all excited about that. We all know that, right? Reszo Gun was one of those things where I came back from Gamescom before PS4 came out and I'm like this is the game everyone's talking about blah blah blah blah blah and we were talking about Knack and Killzone that kind of sucked. Killzone was fine, but I'm like somewhere within the PSN ecosystem is a special little downloadable game called DC Universe Online called DC Universe Online that I think so no in all seriousness we we ham up the Col was right thing but I was so proud of what they did with that game because we know those guys they're very they're friends of ours and they [ __ ] nailed it with Resun. So if you have not played Resun yet and you have a PS4 rectify that situation very very rapidly delete your Twitter and sort your life out. Uh my number two is also a game that gets here because of gameplay and it's Metal Gear",
            "start": 4605.2
        },
        {
            "text": "yet and you have a PS4 rectify that situation very very rapidly delete your Twitter and sort your life out. Uh my number two is also a game that gets here because of gameplay and it's Metal Gear Solid 5: The Phantom Pain. Uh I mean it was my game of the year uh in 2015. It was a game that I was I I go back and forth on how did I anticipate it or didn't I? Right. I am a huge Metal Gear fan. Uh my favorite my favorite video game of all time is now Metal Gear Solid Peace Walker. I can finally say that before that it was Metal Gear Solid which you know did all these different things. When I got ground zero and sat down with ground zero, I was so excited and then so crestf fallen. It did not live up to what I wanted it to be. The uh I did not like being dropped into I always felt exposed. I didn't feel empowered. I didn't feel like big boss. I didn't feel like I knew what the hell was going on. I was getting my head kicked in over and over again. So going into the Phantom Pain, it was a",
            "start": 4642.32
        },
        {
            "text": "didn't feel empowered. I didn't feel like big boss. I didn't feel like I knew what the hell was going on. I was getting my head kicked in over and over again. So going into the Phantom Pain, it was a very jarring experience of like, I don't know. Is this what I want? Is this going to be the thing I want? Am I going to go out and do these different things and feel like big boss? And I'll never forget going down to LA to Konami to do the the preview the day. I think what did we I played for a day, two days, something like that. Three days. I don't [ __ ] remember for a while. Well, I did. There was two. There was the review event and then there was just going down to play. But when I went down there just to play and it was like, \"Oh, [ __ ] This is This is what I wanted Ground Zeros to be. This is exactly what I want. This is HD Peacewalker. This is open world peacewalker. This is go on this mission, get do whatever the hell it is. Take out the high value target. Do whatever. But also",
            "start": 4685.04
        },
        {
            "text": "This is exactly what I want. This is HD Peacewalker. This is open world peacewalker. This is go on this mission, get do whatever the hell it is. Take out the high value target. Do whatever. But also export these resources. fing out these guys and then replay them over and over and over and over again to do that over and over and over again to build up mother base to do all this. It was everything I loved about Peacewalker minus the story which is why there's not a shot in hell of a Phantom Pain ever being my favorite game of all time cuz it wasn't the complete package. That's what that was what was missing for me with that particular game too. But I mean the game play is so good and it's still a game I intend to get back in platinum cuz I love that game and I'm close on it. But going I mean just there's so much awesome [ __ ] in that game of going through and fuling and and quiet and the different outfits and the Kevin you know what I'm talking about here. Kevin's nodding off screen.",
            "start": 4720.72
        },
        {
            "text": "just there's so much awesome [ __ ] in that game of going through and fuling and and quiet and the different outfits and the Kevin you know what I'm talking about here. Kevin's nodding off screen. He knows what's going on. Like godamn did I love the Phantom Pain. And it sucks that like yeah it looks like they cut off a whole bunch of [ __ ] at the end. Yeah it's you know Kajjima's swan song there. Konami of getting thrown out and all this different stuff. But it's like at least he went on this note of like this is a [ __ ] awesome [ __ ] game. And the gameplay was what it was all about of going in there and then feeling like I know this map. I've scouted this map because I've run this mission a bunch of different times and now I know I'm going to get in there and get out and do all these different things. It was just something special. Yeah. To me, I again, we talked earlier about Mad Max and about um coming out September 1st, I guess it was, right? Uh 2015. Was that the the date?",
            "start": 4759.04
        },
        {
            "text": "different things. It was just something special. Yeah. To me, I again, we talked earlier about Mad Max and about um coming out September 1st, I guess it was, right? Uh 2015. Was that the the date? September. Yeah, I think so. And it came out the same day Metal Gear Solid 5 came out. So that that was a distracting game for me. But then I played it for about 10 hours later. I think it was around December is when I actually started to sit down and play it Christmas break. Yeah. And it just I respect it. I think it's fun. It's not Metal Gear to me. And that was and that was a major thing to me was that it was like where is the story? The way the game began in the uh in like the hospital was awesome. Awesome. Awesome. I was like, \"This is so awesome. Why can't it just be this?\" Yeah. For 12 hours. Yeah. Why does it have to be this open world nuttiness that doesn't seem to be I know it started with Peace Walker really, but didn't didn't seem to capture what Metal Gear was to me. I'm a huge",
            "start": 4796.8
        },
        {
            "text": "Yeah. Why does it have to be this open world nuttiness that doesn't seem to be I know it started with Peace Walker really, but didn't didn't seem to capture what Metal Gear was to me. I'm a huge fan of Metal Gear One Solid 1 and Metal Gear Solid 2. And I am a fan of the MSX/ NES Metal Gear as well. Um, and I was just like, h it Shadow Moses was special. Yeah. Uh, the the Big Shell was special. Well, that was the thing. Like when I came when I came back from Metal Gear the review event and we were talking, you're like and I'm like, \"It doesn't It's like this game is amazing. This game's fasc.\" And I'm like, \"But it doesn't feel like Metal Gear.\" And you're like, \"What about the bosses?\" I'm like, \"There really aren't.\" I mean, that's shocking to me because that's what that was really the coolest part about the Metal Gear games, especially one and two, I think. Especially one and two. You kidding me? Fat Man, come on. Psycho man. Fat Man's my dude. And Darpa Chief. So that really was",
            "start": 4842.08
        },
        {
            "text": "coolest part about the Metal Gear games, especially one and two, I think. Especially one and two. You kidding me? Fat Man, come on. Psycho man. Fat Man's my dude. And Darpa Chief. So that really was shocking to me where like where we had a situation in in a sense that the game was divi divisive I think immediately but I think what I've seen anecdotally is that it's way more divisive than I thought. It seemed like a lot of people were giving me [ __ ] at first and I get less and less of it as goes on and then you read a lot of people being like it it to some people it's like this masterpiece and other people it's like it's a disappointment. Sure, I do agree with you that it is disappointing that it is it is it is Metal Gear's proper swans. I'm sure Konami will make another one cuz they're terrible. But um but Cojima went out like that and now we're going to get, you know, his his game, you know, PlayStation 4 exclusive. Um so I'm I'm I I think it probably belongs on the list because I",
            "start": 4882.8
        },
        {
            "text": "terrible. But um but Cojima went out like that and now we're going to get, you know, his his game, you know, PlayStation 4 exclusive. Um so I'm I'm I I think it probably belongs on the list because I know people really enjoy it and I know you love it. So I don't begrudge you that. But thank you for not begrudging me. But I I I to me it's it's um I was glad I played it so that I knew that I didn't like it cuz it was it was in the back of my head where I'm like I probably should give this a go. And for a couple hours I was like yeah yes yes and I was like oh I'm totally crazy. This is awesome. And then it opens up and then I'm like slinking around and like just on a horse for some reason and then I'm god de horse. What up? So yeah I don't know. And then the unanimous number one I assume we didn't share a list before. We didn't really drive that home too much. We didn't. I have to imagine yours is Uncharted four. A thief's end. Of course, that's my number one as well. And by the way, I'm",
            "start": 4923.04
        },
        {
            "text": "share a list before. We didn't really drive that home too much. We didn't. I have to imagine yours is Uncharted four. A thief's end. Of course, that's my number one as well. And by the way, I'm trying to I'm not I know you're tabulating right as we go. So, we'll see cuz remember we each did them. Points are assigned in the opposite order. So, now Uncharted gets two 10 making it 20 points, which means of course it'll be the number one game. Uh I don't feel like we need to talk too much about why Uncharted 4 is amazing for you. Uh if we do, I don't understand why. You have to go play the other Uncharted then play this one. And then you would understand of course the culmination of Drake's story. Uh it hits on all it it's got the best parts of Last of Us with the best parts of Uncharted in ter going to this dark place like we were also afraid that was going to happen with the Last of Us influences. Instead, it was the storytelling mechanics. It was opening up the areas. It was a",
            "start": 4967.12
        },
        {
            "text": "in ter going to this dark place like we were also afraid that was going to happen with the Last of Us influences. Instead, it was the storytelling mechanics. It was opening up the areas. It was a beautiful game. It was finally finally after four games, which I guess sounds like a knock, but finally after four games, letting you have the conversations you wanted with your supporting cast. It was answering the questions you've always wanted answered. It was the culmination of this entire journey Naughty Dog's taken on us and it was beautiful. Yeah, I think that the game I played it slowly over about a week and uh it's the longest Uncharted game. I think that's safe to say. Um except for maybe Golden Abyss. I was going to say Golden Abyss might be longer, but it also just felt long cuz we're on the go all the time, right? Yeah. Uh and at first I was like I don't know. I I was slow burn. Yeah. I was like I was like it's it's no less than great. It's an annoying game but I'm like is it you",
            "start": 5004.64
        },
        {
            "text": "on the go all the time, right? Yeah. Uh and at first I was like I don't know. I I was slow burn. Yeah. I was like I was like it's it's no less than great. It's an annoying game but I'm like is it you and I both love Uncharted 3. We love all of them but we we we both think Uncharted 3 is the best and I'm like I don't know that this is getting what Uncharted is and then suddenly it does and then suddenly and then suddenly it does get it. Now I have some issues core issues with Uncharted 4. I think Sam is in it way too much. I think it's weird to insert a character that means so much to Drake at the very end. At the very end you never heard a [ __ ] peep about him. I think it's weird that Drake now has all these new mechanics that they overuse over and over again. Like I love the hook. It's like, oh, he's an expert at this. He never even mentioned that he can do this in the other four games. But why does Elena look different every game? But the game is so overwhelmingly charming. Yeah.",
            "start": 5045.68
        },
        {
            "text": "like, oh, he's an expert at this. He never even mentioned that he can do this in the other four games. But why does Elena look different every game? But the game is so overwhelmingly charming. Yeah. And so so thoughtful in its puzzles and its its mapping of the way you go through. I like that. I like that the game opened up. I like that, but it didn't open up too much. It reminded me a little bit of like what Killzone tried to do with Shadowfall, but not to that extent where it's like it's not going to be a corridor shooter anymore. Now it's with Killzone and this is like it's not going to be a very linear experience. You're going to get from point A to point B, but how do you get from point A to point B? You're going to you're going to choke everyone out. You're just going to have a gunfight. I like that there's very little combat in the game. I think that's another one of those things that's really cool. The game, when you really think back on it, doesn't have that much combat. It's",
            "start": 5084.56
        },
        {
            "text": "I like that there's very little combat in the game. I think that's another one of those things that's really cool. The game, when you really think back on it, doesn't have that much combat. It's it's it's there's there's set pieces. There are things where you're fighting, but by and large I was like, there's not that much combat in this game. And I was like, that's refreshing. Uh, yeah, cuz that was always the knock against the Uncharted, right, of open the All right, we get a cut scene, then it's a you walk, you go somewhere, it's a monster closet. All right, now there's a puzzle, now there's a cut scene, monster closet, monster closet, monster closet. So, to me, it's it's one of those games that's so it's not perfect by any stretch of the imagination. And I do think that The Last of Us is probably better as far as Naughty Dog products are concerned, but I think I think uh Bruce and Neil did a very nice job. Stepped into big shoes, Amy's shoes, rewrote a lot of things, got rid of a",
            "start": 5124.08
        },
        {
            "text": "is probably better as far as Naughty Dog products are concerned, but I think I think uh Bruce and Neil did a very nice job. Stepped into big shoes, Amy's shoes, rewrote a lot of things, got rid of a lot of things, uh rescripted it, reworked it, and it took a little bit of time and we had to be patient, but I think it was worth the wait. And I really do love how it brings it all together. I love and adore the ending. Yes. Oh my god. I think the ending is extraordinary. I did not expect it. Me neither. Um, and cuz when they start to fade pull out and fade out, I was like ah like that that was I could leave them here. I could leave them here and then I didn't have to. And that was amazing. And and I think that for all of its pro for there's a few narrative problems. I think Naen for instance is not even a character. I love I just don't think she belongs in it. Uh like like I don't think she's she belongs they want her in there but I don't think she's needed. I don't think she serves any",
            "start": 5158.68
        },
        {
            "text": "is not even a character. I love I just don't think she belongs in it. Uh like like I don't think she's she belongs they want her in there but I don't think she's needed. I don't think she serves any purpose. Um so there is some like weirdness of that. But if you really want to get into the nitty-gritty that that should exist. Talbbit is that inch Uncharted 3, right? So, it's not like it's not like that's unheard of. Yeah. Um, so for me, I I I I unan I mean it's unanimous. Like I don't think there's any better game than Uncharted 4. It's a mustplay. I encourage people if they have not played the Uncharted games to play them all in order. Do not jump into Uncharted 4. I don't think there's any way in hell you appreciate Unchart you will appreciate the game for what it is if you do that. There are a lot of special moments in the game and I think they did a really nice job of paying homage to to what the hard work that they had they had put into the series for a decade. And it was it's s",
            "start": 5199.04
        },
        {
            "text": "are a lot of special moments in the game and I think they did a really nice job of paying homage to to what the hard work that they had they had put into the series for a decade. And it was it's s it was sad to see it go, but I'm also convinced that it's not done. Like I I I don't think I don't think that we're going to see it for a very long time. And I don't think it's going to be Drake. Um but I don't think we've seen The Last of Uncharted either. So it'll be a long time, I think, if you ever come back. So we we'll see what we'll see what happens. But yeah, I mean there there is no other choice than Uncharted. So while you finish the final tabulation, I want to toss out a few reader mail here. Of course, I had to put out the tweet. What was your what's your favorite PlayStation 4 game of all time and why? Cory Johnston said Drive Club. Never was a fan of track racers, but Drive Club made me very made me drive club made me very addictive, competitive, incredible photo mode, skill to",
            "start": 5234.32
        },
        {
            "text": "all time and why? Cory Johnston said Drive Club. Never was a fan of track racers, but Drive Club made me very made me drive club made me very addictive, competitive, incredible photo mode, skill to drift. Tyler Ferguson responded, \"Uh, regardless, I have to say Destiny. I know it's on other systems, but that game has changed the way I play video games.\" FA said, \"Transistor, gorgeous music and visuals and surprisingly fun gameplay. Lots of replay value, too.\" Shout out to Super Giant. We do love them. Uh, we had a you are at son of a gun I'll say instead of whatever the hell his name's supposed to be. Uh, Batman Arkham Knights great story and Mark and Ham Mark Hamill is the best. So much fun. Uh, this guy Jack Septic Guy said bloodborne son no reason necessary. And then Yen Anderson our friend over at Daybreak shouted out Shadows of Mordor. Brilliant transition of system messaging into character states and effects. Ne Nemesis system was Fabu. Yeah, I never played Mordor so I can't",
            "start": 5269.36
        },
        {
            "text": "friend over at Daybreak shouted out Shadows of Mordor. Brilliant transition of system messaging into character states and effects. Ne Nemesis system was Fabu. Yeah, I never played Mordor so I can't speak to it. Bloodborne was one of those games I was throwing around even putting on the list cuz I I did I did spend a lot of time with it. I felt like it would be disingenuous because I I had spent maybe 15 hours with the game or so and and I really liked it. Um compared to the Demon Souls and Dark Souls, I just felt it was a little bit faster, a little bit more accessible for me. Um but I felt like it was not again it was disingenuous for me to include it. So Colin, give me the final list. Well, because of ties there are 11 on the list because otherwise a game would arbitrarily be cut off of 2016. tied for seventh place because there are ties. Uh Wolfenstein: The New Order and Tales from the Borderlands. Uh sixth place is Lego Dimensions. Fifth place is Life is Strange. Mhm. Tied for",
            "start": 5313.04
        },
        {
            "text": "of 2016. tied for seventh place because there are ties. Uh Wolfenstein: The New Order and Tales from the Borderlands. Uh sixth place is Lego Dimensions. Fifth place is Life is Strange. Mhm. Tied for fourth is Mega Man Legacy Collection and Rocket League. Okay. Three-way tie at number three, Until Dawn, Reszo Gun, and Metal Gear Solid 5. Okay. Number two is Ratchet and Clank. Wow. And number one is Uncharted 4: Thieves End. That's a great list of games. Yeah, I mean that's a I mean that's a very solid list of games. Yeah. Well, thanks for doing it with me. Yeah, it was fun. We'll do it again next year. Uh, of course, ladies and gentlemen, this has been a interesting PS I love you XOXO. So, there's been, you know, we didn't do some of the segments, but there's still time to get some of the segments in. Like, PS, I love this best friend XOXO. This is where one of you goes to kind of funny.com/forums. You go to the PS, I love you, XOXO board, and post in the thread your PSN name with the",
            "start": 5350.08
        },
        {
            "text": "segments in. Like, PS, I love this best friend XOXO. This is where one of you goes to kind of funny.com/forums. You go to the PS, I love you, XOXO board, and post in the thread your PSN name with the reason why you need friends. Then, the other best friends from the kind of funny community find you on the PSN. They friend you, they send you lovely messages, and you all play games together. This one comes from Just is 23, the way it sounds. Just is 23. That's the PSN name. Hello, compadres. Been listening to Been listening since y'all left IGN. And I've got to say, there isn't a better group of people making content on the interwebs. But all slow jerking aside, I came here to find some fellow best friends to play with on the good old PSN. I don't have a ton of friends online, which usually leads me to play more single player focused games. But it's high time I got in on some of the sweet kind of funny community gaming action. I'm down to play whatever. So send me a friend request and",
            "start": 5388.88
        },
        {
            "text": "leads me to play more single player focused games. But it's high time I got in on some of the sweet kind of funny community gaming action. I'm down to play whatever. So send me a friend request and let's get let's let let the good times roll. My PSN name is just is23. Keep [ __ ] that chicken, boys and girls. Just is 23. Everybody go [ __ ] the chicken with just is23 over on the PSN. Send him his messages. Colin, are you ready for PSN's worst name of the week? Yes. This is where someone went to kind of funny.com/formums, went to the PS I love you explorer and posted their bad PSN name. Cuz as you know, Shuhei Yosha refuses to let you change your PSN name. And until he does, we will call out all the bad names so he understands why. This one comes from a gentleman named Alex. Hi, Colin and Greg. I'm Alex from England, UK. Oh, and this is my first time posting. I was a hardcore Xbox fanboy for many years, but decided to get both current gen consoles so I could play with my friends. My",
            "start": 5428.96
        },
        {
            "text": "Greg. I'm Alex from England, UK. Oh, and this is my first time posting. I was a hardcore Xbox fanboy for many years, but decided to get both current gen consoles so I could play with my friends. My gamer tag on Xbox forever has been and forever will be the generic Drop Shot 42. But I decided that my PSN name should be funny and memorable. Oh, how I regret that. My PSN name is Sausage Bandit 69. That's Sausage Bandit 69. As you can see, this name is ridiculous and unoriginal on its own. But I didn't realize until the next day when one of my friends called me out, that my name, as he pointed out, has been spelled wrong. Sausage is spelled wrong. I accidentally used two s's. It's s a u ss a g. Jesus bandit 69. Ever since I can't look at my name without pronouncing the word in my head as Sasarge in a pol in a posh sounding voice. I went to change my name but unfortunately you can't. You know it's impossible. Therefore I must now live the rest of my PSN days as the sausage bandit aka the",
            "start": 5472.32
        },
        {
            "text": "in a pol in a posh sounding voice. I went to change my name but unfortunately you can't. You know it's impossible. Therefore I must now live the rest of my PSN days as the sausage bandit aka the guy who steals sausages for a living. That's not how I read it. Please Shuhei, let us change our names. Thanks Alex in the UK. Please Shuhei hear him. Ladies and gentlemen, thank you for watching and hearing us. This has been PS I love you XOXO. Remember PS I love you XOXO is kind of funny.com's PlayStation podcast. So please go to kind of funny.com, subscribe to the YouTube channels, subscribe to the podcast, go to the Patreons and support us which makes crazy [ __ ] [ __ ] like this goddamn video wall behind us happen. It's amazing and insane and it's not as hot as I thought it would be. It's hot. It's hot here. But it's not as hot as I thought it would be. Right. No, it's not as hot not as hot as spare bedroom used to be. No, not as hot as I'm going to make your bedroom tonight. Oh, don't",
            "start": 5526.36
        },
        {
            "text": "It's hot here. But it's not as hot as I thought it would be. Right. No, it's not as hot not as hot as spare bedroom used to be. No, not as hot as I'm going to make your bedroom tonight. Oh, don't touch. Okay, my apologies. Also, remember that PS, I love you. XOXO posts every Tuesday at 9:00 a.m. on YouTube.com/kindfunnyames and podcast services around the globe. So, like, subscribe, share it with your friends. Remember, everything helps us get the show out to more people and that makes more video walls. Every episode of PS I Love You XOXO ends in a song in a segment we call singing a shoe. Hey, this is where one of you talented [ __ ] goes to kind of funny.com/psm. The M is for music and gives me an MP3 of your song and a YouTube video link for your song. I put the MP3 at the end of our MP3 and I annotate to your YouTube video at the end of our YouTube video. This one comes from Jack. Hey Colin and Greg, my name is Jack and I'm the vocalist and guitarist for the band Jar of Adams. We",
            "start": 5571.04
        },
        {
            "text": "and I annotate to your YouTube video at the end of our YouTube video. This one comes from Jack. Hey Colin and Greg, my name is Jack and I'm the vocalist and guitarist for the band Jar of Adams. We are a two-piece band based in Nottingham, UK. Oi. I'm not sure what our genre is, but I guess I'd say it's kind of bluesy rocky. I've been following you guys since beyond days beyond and I'm elated that you have been able to find the success you have. I submit to you our first song Nymphomaniac which we have released for free in an attempt to promote our band. It's available on to download on Soundcloud and Bandamp. You can find us on Twitter and Instagram atjarofadams and it's atoms of course and Facebook at facebook.com/jarofadams. Unfortunately, we haven't recorded a video for it yet. So, I put the music over a video of JeanClaude Vanam dancing on YouTube. He did and it's awesome. I hope you guys enjoy it. Best of luck in the future as you continue to grow towards superstardom. Well,",
            "start": 5610.16
        },
        {
            "text": "I put the music over a video of JeanClaude Vanam dancing on YouTube. He did and it's awesome. I hope you guys enjoy it. Best of luck in the future as you continue to grow towards superstardom. Well, thank you Jack for closing out the first ever PS I love you XOXO here at Kind of Funny Studios. Thank you ladies and gentlemen for watching the first ever video product from the Kind of funny studios. Kevin, how did you do on the camera switching? Was it jarring? No, you gave a thumbs up. Let me know in the comments if it was jarring. Well, I'm sure I'm going have to slow as roll. Is he flipping around a lot right now? Ladies and gentlemen, this is Jack from Jar of Adams, right? No. Yeah. Jack from Jar of Adams with the song Nyommaniac. Until next time, it's been our pleasure to serve you. [Music]",
            "start": 5657.12
        }
    ]
}