{
    "id": 1999,
    "video_id": "rPj1nLgEvCQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino"
    ],
    "title": "Let's Play Deus Ex: Mankind Divided - Kinda Funny Plays",
    "description": "Thanks to Deus Ex: Mankind Divided for sponsoring this video and the launch of Kinda Funny Studios.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1471998065,
    "duration": 2423,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to a let's play here on youtube.com/kindfunny games. I'm one of your hosts Greg Miller alongside the producer/seducer Nick Scarpino. Top of the afternoon to you. No one knows when this is posting. It could be any time in the the day. We're in our studio. If you're watching at night, congratulations. Yes, we are in our studios. We just launched Kind of Funny Studios. We did a giant live stream 12 hours and it was all brought to you by DSX Mankind Divided. That's what we're playing to do a let's play of right now. Now on the stream, Nick. Yes. You and I talked and we jazzed around. We played We did We did some of the jazz playing a lot of fun on the stream. You're selling me on the game. Okay. I've I I I the original DSX. Well, not the original, you know, Human Revolution. Didn't click for me. And then I've hosted a bunch of panels obviously leading up to this DSX. Everything I hear gets more and more exciting. And then you finally giving me the controls",
            "start": 0.24
        },
        {
            "text": "Revolution. Didn't click for me. And then I've hosted a bunch of panels obviously leading up to this DSX. Everything I hear gets more and more exciting. And then you finally giving me the controls letting me play. It worked. I liked the stealth. I liked the action when I needed to do it. I like trying to figure out where to move and what to go after. Cool. Very cool. Yeah. Yeah. I mean, it it's funny cuz it's sort of counterintuitive for the games that I normally like, right? Uh, which are just kind of Metroid. Yeah. Very I mean, it is kind of like a Metroid Van game, right? Cuz you are kind of you're solving puzzles. You're trying to find things. You're being You have to be a lot more strategic than just a game like you can't just run in. Yeah. You can't just your standard first person shooter, right? I try to do that. When I try to play like that, I I just get blown away. Right. So, yesterday on the stream, I hand it over to you. Your brain automatically goes, you're not pumping a",
            "start": 41.68
        },
        {
            "text": "shooter, right? I try to do that. When I try to play like that, I I just get blown away. Right. So, yesterday on the stream, I hand it over to you. Your brain automatically goes, you're not pumping a mile a minute on Red Bull like I am. You're like, \"Wait, let's let's do a little more.\" And you were able to get past. Let's put on my Adam Jensen shades and see exactly what's going to happen. Exactly. So, you went home, you played more. Played a little more. Yeah. I mean, the thing the thing with this game is every once in a while I'll throw myself into a game that I'm like, I'm just going to give myself a few months to play this, enjoy it, get walloped. I'm going to check every drawer. I'm going to try to upgrade everything. Um, and and this tends to be the game that I do that with. I don't know why. I mean, I just like the game, but it's living up to your hype as a fan. Yeah. So far. So far. So, what are we on what are we doing now? We're off on a side. mission. No, I think we're on a",
            "start": 75.68
        },
        {
            "text": "know why. I mean, I just like the game, but it's living up to your hype as a fan. Yeah. So far. So far. So, what are we on what are we doing now? We're off on a side. mission. No, I think we're on a main story mission, actually. Um, sin eater. Go back to the poster. Back up. Back up. There it is. Sin eater. I give my life not for augments, but so cool. So, now we're going to Where are we going to go? We're going to go up here. Where we want to go? Okay. Oh, this is a fast travel system. Yes. Okay. Okay. Okay. Now, actually, what do I want to do? I want to go here, I believe. Uh, let me check real quick and see what we're supposed to be doing here. This is already better than yesterday. Now you know where to go. You know what to look for. You know what you're looking for in here. Meet him at Ruski station. There you go. Rikaka Rika. Rusika station. I got there station. I thought it was Paul Rucka station for a second. All right, we're going to go here then. You know Paul Rucka? Uh",
            "start": 109.68
        },
        {
            "text": "him at Ruski station. There you go. Rikaka Rika. Rusika station. I got there station. I thought it was Paul Rucka station for a second. All right, we're going to go here then. You know Paul Rucka? Uh don't know Paul Raka now, but I'd like to. Is he a nice human being? Great dude. He was he was when I was in high school when I was a senior Paul. When I was a senior in high school, he was a freshman and he worked at AMC theaters and we made him write movie reviews for the paper and then he got me into see The Mummy Returns with in the in the theater screening before it came out and god did that break my heart cuz we were such mummy fans. The Mummy Returns wasn't that's the one with the rock, right? Yeah. Scorp the introduction. That wasn't that as good as the first one. No, Mummy was so good. Oh boy. They uh the one with Jet Lee was just like we don't even talk about that. Then we were final nail in the coffin. What are you doing here? Miller sent me to find you. Thought you could be in",
            "start": 149.28
        },
        {
            "text": "Oh boy. They uh the one with Jet Lee was just like we don't even talk about that. Then we were final nail in the coffin. What are you doing here? Miller sent me to find you. Thought you could be in trouble. But it's not. It's James. That could have be my grandfather. No, cuz he was James Kennedy. Well, my middle name is James. So, if I ever go on the lamb, look for James Miller. One minute. I'm in there running the show and the next day accuse me of trying to tamper with evidence. This guy doesn't these glasses he's wearing don't seem like they provide much function at all. No. I mean, this is a bomb site, so I guess he's crime scene. Looking for a crime scene. Yeah, he's looking for clues. Where those glasses? Maybe they're binoculars. We don't Yeah, probably just try to keep dust particles out of his eyes, you know. Usually it's happening. Um, so I just hacked this guy's computer because that's what you do. I'm actually not working with these people. This is like an Interpol style",
            "start": 191.84
        },
        {
            "text": "out of his eyes, you know. Usually it's happening. Um, so I just hacked this guy's computer because that's what you do. I'm actually not working with these people. This is like an Interpol style agency. I'm working with a different agency trying to infiltrate them, kind of figure out what's going on there. Well, there's terrorists a foot, right? There's a terrorist. We're trying to find the terrorists, but I'm also looking into these guys. Okay. Which is crazy. So, everywhere you go, you're basically everywhere you go about it's kind of fun because you kind of like am I going to hack you today? Are you getting hacked today? Am I hacking your computer? Am I stealing your secrets? This is like how you when you look at most people on the street, you're always like, \"Am I going to hack that person then?\" Just look at him like, \"Can I hack him to death?\" No, no, Nick. Not that kind of hack. I was going the sexual sense, not the murderer sense. Big Kevin knows what I'm talking about. He's",
            "start": 226.64
        },
        {
            "text": "person then?\" Just look at him like, \"Can I hack him to death?\" No, no, Nick. Not that kind of hack. I was going the sexual sense, not the murderer sense. Big Kevin knows what I'm talking about. He's nodding over there. He can't tell. He's taking a siesta. Oh, I missed this whole thing. But you know what? Continue. You don't need to hear about it. What are you going to Nobody wants to see this. We came for the action, the gameplay. I want to see you punch some guys in the nuts, then punch their heads off. And then I want to see I want to see your new stealth skills. I'm going to ask Bobc in there. I miss you not to do that. It's a blast site. There's debris everywhere and plenty of cops, too. Once you get past the turn styles and security offices, you should have a clean path to the tourist office where they have the scan. They don't see you. How many cops are inside? Because I don't know. Several. They all had guns. So, I didn't stop. All right. So, I got to go in there and get",
            "start": 258.48
        },
        {
            "text": "tourist office where they have the scan. They don't see you. How many cops are inside? Because I don't know. Several. They all had guns. So, I didn't stop. All right. So, I got to go in there and get something for him because he's one guy in an exo suit. Not doing so well today. My guess is they'll shoot first and bury the bodies later. Great. I got to build the guy an exo soon. All right. So, we're just going to continue. Continue. We're ready to go. We're ready to get in there. Ready to get stuff. That's the spirit. We need it. But you won't be able to just walk. So, I got to go get evidence. We got There's a lot of We're trying to figure out who this group is. I don't know if you didn't see the first mission in Dubai. This terrorist organization, this group with us. We think it's one of the same people that did the bombing that attacked Adam Jensen in Dubai. They wear cool gold masks. The forensic team set up a camp inside tourist agency. How far how many hours into the game are",
            "start": 293.36
        },
        {
            "text": "of the same people that did the bombing that attacked Adam Jensen in Dubai. They wear cool gold masks. The forensic team set up a camp inside tourist agency. How far how many hours into the game are you right now? That was like maybe an hour and a half, two hours. Okay, good. Yeah, it's not too far cuz I want to play this. Maybe not even that much. Get out. Easy peasy. Also, I mean, I like I said, I spent probably 45 more minutes last night than I should have looking for a key card to get into the last place when there was just an air vent that would have let me in. So, I was up against the wall. You got to be You got to take it all in, Nick. I don't know what you get. So caught up on the trees, you're missing the monkeys over here eating the bananas. You got to step back and look at that forest. See the monkeys and the trees. You know what I'm saying? trees through the forest. Yeah. See the monkeys in the trees, man. All right. So, I'm going the right way. Yeah. Yeah. Are you going",
            "start": 328.64
        },
        {
            "text": "forest. See the monkeys and the trees. You know what I'm saying? trees through the forest. Yeah. See the monkeys in the trees, man. All right. So, I'm going the right way. Yeah. Yeah. Are you going down to the giant yellow thing? This guy restricted to civilians. Like, do I look like a civilian? I can poke through your skull if I wanted to. Maybe I should take a look around. You thought wrong. This is a local investigation. You task force guys can I wish I could pull off an Adam Jensen look. Oh, you totally could. I couldn't wear a trench coat like that. I couldn't grow that. I can't grow that's like Darren Brazil facial hair. I can't wear a trench coat like that to be fair. Okay, so we're up against the same place we were last time. We got to look for a different way in this dink. I need I was like I need a key card for that. So, we can't do that. Lock that. Hack hack that key. Let's hack. Here we go. Hack the planet. There the key code. All right. So, great. Not great at hacking. So",
            "start": 364.8
        },
        {
            "text": "I was like I need a key card for that. So, we can't do that. Lock that. Hack hack that key. Let's hack. Here we go. Hack the planet. There the key code. All right. So, great. Not great at hacking. So far, you said this before and you got it in the in the in the uh in the stream. All right. Let's see. I mean, I just kind of You pick a route and depending on the route you're supposed to go sometimes. It's a capture detection 45%. 45%. Okay. So, we're probably going to get Ooh, that's not good. But let's try this. Can you can go straight through? Yeah, but I need both of them. Oh, I think on this one. Maybe I don't. Maybe I don't. Let's see. Yeah, let's just try cuz you were doing this during the stream and I didn't fully understand what you were doing. Trace program initiated. Yeah, I got to get No, it's not going to work. Access denied. Okay, so you got to get both of these these uh god. No, that's locked out. Okay, doesn't matter. It doesn't. No. Oh god. It doesn't matter. They know",
            "start": 406.16
        },
        {
            "text": "to get No, it's not going to work. Access denied. Okay, so you got to get both of these these uh god. No, that's locked out. Okay, doesn't matter. It doesn't. No. Oh god. It doesn't matter. They know you touched it. They know you touched it. Kevin is shooting at us. Don't stand there and cover your heads. Run, you idiots. That guy's got the right idea. Idiot. All right. So, I have a feeling we're going have to start this over cuz I don't think It's fine. It's fine. You're probably not going to get away from him on this one. Also, why the hell don't I have any augments? Yeah. What? Yeah, why don't you have augments? Do you have to repro them? Whoa. Jesus. [ __ ] You unleash you unleashed a sun. Yeah, I'm just going to die on this. Hold on. All right. Oh god. Oh god. Okay. So, yeah. I uh I don't have any ammo. I totally forgot to get more ammo. You're going to be super stealth. No. Haven't I told you that I like doing this in the new studio? Oh, great. How do you feel about that? I feel",
            "start": 445.44
        },
        {
            "text": "have any ammo. I totally forgot to get more ammo. You're going to be super stealth. No. Haven't I told you that I like doing this in the new studio? Oh, great. How do you feel about that? I feel great about it. I don't have long I don't know that I have long enough legs to do this. Yeah, it's it's very it's leisurely. It sets the pace. There's Jim Miller. Yeah, there's again. Could have been Could have been your dad. It No. Well, yeah, but you know, could be me. Could be in the future. Guys, I had to change my name. What'd you change it to? Well, I change it from Greg to Jim. We covered this. No one knows. We covered this. I already said if Thank you. It's my middle name. Thank you very much, Kevin, for being a true fan. That's why it is Gregory James Miller. I forgot every time I have to Hey, Aaron. What's Kraken? Okay, so I can't hack this cuz I don't have a security rating for it. That sucks. Got to go through this door. Nope. I know. All right, so we've decided that either I hack",
            "start": 487.84
        },
        {
            "text": "Hey, Aaron. What's Kraken? Okay, so I can't hack this cuz I don't have a security rating for it. That sucks. Got to go through this door. Nope. I know. All right, so we've decided that either I hack that door or these guys shoot me. Okay. Well, maybe there's a better way around. I was going to say there's got to be a vent. Okay. So, let's take a look here. So, again, this guy's going to say don't go yada yada yada. Don't shoot me. I'm just going to skip through that. Cool. We know we can't go that way. So, over here, we got the hacking. That's tough. There's got to be a key card somewhere. Sure. That's what I'm thinking. All right, double back. So, I'm going to double back and see if those have key cards. Maybe. Can't you pay one of them off and like put on their helmet? I tried to pay the guy off, but already late for work. Now I have to walk across town. You grew up against the wall, buddy. I'm not going to mess with talks like a triate. Imagine how many innocent people were killed.",
            "start": 527.36
        },
        {
            "text": "guy off, but already late for work. Now I have to walk across town. You grew up against the wall, buddy. I'm not going to mess with talks like a triate. Imagine how many innocent people were killed. No, it's Call like you can climb there. You turn the scaffolding. That's the rain on. Hey, it's me and I'm Greg. I played some games and I won some awards and I paid for Kevin's salary. Okay. Now, there's a little bit of an electrical arc there, so I'm guessing I have to turn that off first. No. Go. Yeah. Go turn on. Turn around. Turn on. Yeah. There you go. Oh god. Oh god. Oh god. I'm sorry. I get so I just want to shoot everything and just burn this mother. I'm glad they gave you four bullets. So don't shoot anything. Okay. No [ __ ] kid. Can I go in you? Oh, don't you can't go through there yet, Jen. Can't go through there, Jensen. Jensen. No, I can't go through there yet. Go through So now we got to trace the electricity back to where it's going. Back to its point of origin. Back to",
            "start": 565.84
        },
        {
            "text": "yet, Jen. Can't go through there, Jensen. Jensen. No, I can't go through there yet. Go through So now we got to trace the electricity back to where it's going. Back to its point of origin. Back to the ocular cavities. Now hold on. Don't go. Turn to turn. Give me turn to your left. I'm just looking this way. Okay. Yeah, it's your game. I'm just here to help. Where are you going? What you got? Turn to my left. I want to see Can you get in that thing? Cuz it looked like from the other angle you can get in that thing. This thing here? Yeah. What is it? Oh, it's just Okay. No, I can't get in that [ __ ] We're just exploring. Oh, it's it's going to alter back on. Oh god. All right. There's breaker. Turn that off. Breaker breaker. This is a big rubber duck. We got some conv. This is rubber ducky over the fish is in the pond. Colin, how many times you listen to convoy growing up? What? How many times you listen to convoy growing up? We got a great big convoy rocking through the night. We got",
            "start": 618.8
        },
        {
            "text": "over the fish is in the pond. Colin, how many times you listen to convoy growing up? What? How many times you listen to convoy growing up? We got a great big convoy rocking through the night. We got a great big and join our convoy. Ain't nothing going to get in our way. We want to take this convoy across the USA convoy. It was a song about truckers. I don't have any goddamn augments. What? What's going on with my augments here? Hold on. I don't know. What did you do to your augments? I don't have any. Did they remove them all from you? What's happening with the story? There must be a story thing, right? Oh, I had to get that configuration thing. So maybe I can't Oh, you know what? I turned them all off. That's the problem. Why would you do that? Oh, cuz of the overload, right? can like spec out Jensen your own way this time. Awesome. Okay, we don't want that. So, you can mix and match anytime you want, I believe. So, but I got a neuro configuration device that will allow me to have",
            "start": 663.04
        },
        {
            "text": "spec out Jensen your own way this time. Awesome. Okay, we don't want that. So, you can mix and match anytime you want, I believe. So, but I got a neuro configuration device that will allow me to have all of them. I think I went and I made a deal with some dude that will allow me to have all those. Satan. Yeah, the Satan be um All right. Dial it down. Dial it down. Yeah. I don't know how to turn these off, though. Hold on. Let's see. I think you're going to turn them on, right? No. Oh yeah, I want to turn my vision back on, but it'll overload my system. No way. One will overload it. Stealth avatar. There's no way one will overload it. I have nine practice points. I should probably upgrade some stuff. What should we upgrade? Um, I think vision is good cuz we can then see who's coming for us. Let's purchase that. All right. See, I Yeah, I got to activate this. This might destroy me, though. Maybe it takes Maybe it takes points to activate stuff and deactivate stuff. Can you activate",
            "start": 710.4
        },
        {
            "text": "us. Let's purchase that. All right. See, I Yeah, I got to activate this. This might destroy me, though. Maybe it takes Maybe it takes points to activate stuff and deactivate stuff. Can you activate anything? Cuz you're purchasing here. Yeah, I want to purchase this for sure. Okay. Okay. So, you still have 11 points. That only cost you two. You're already unstable though with 150%. Yeah. Is that what's happening? Yeah. So, how do I turn this [ __ ] off? Still want this though. Going to go in again. Can't. Guess I'm not leveled up enough to buy another one of those, huh? Do we punch through walls? No, it doesn't seem like we need that. What about lightning bolt? You were really excited about this last time. Well, sure. Yeah, if you get the lightning bolt, but I mean, if you're already 150%, you ain't going to get no. You're going to short out and forget how to say Antonio. Antonio Banderas. Bandas. Where do you see? Oh, yeah. System status unstable. How do I turn the stuff off, though?",
            "start": 759.84
        },
        {
            "text": "you ain't going to get no. You're going to short out and forget how to say Antonio. Antonio Banderas. Bandas. Where do you see? Oh, yeah. System status unstable. How do I turn the stuff off, though? I click on that one. Yeah. Oh, okay. Here we go. Sorry. Circle. Circle. triangle. There we go. There we go. We're bringing him back to speed. Okay. So, you like Ghostbusters? Shut this down. Shut this all down. Shut it all down. I want the eye, though. How come I can't I've never seen something like this. All right. So, I'm going to guess I can't use these until this is This is the power of high five, by the way. He just like every time he's like, \"Hey, high five.\" He like sends people to black holes right in through the balls. Okay, so system status unstable. Still at 13%. I don't understand. It's in deactivation mode. What's the one you activated to make it unstable? The hand thing. That remote eyes. Well, go to the hand. Try triangle that [ __ ] All right. That doesn't make sense. Me",
            "start": 805.76
        },
        {
            "text": "It's in deactivation mode. What's the one you activated to make it unstable? The hand thing. That remote eyes. Well, go to the hand. Try triangle that [ __ ] All right. That doesn't make sense. Me either. You're the one who's played through this. You're the only one who's supposed to understand what's happening. Let's just see what happens. Okay. You got your eye. Cool. The eye of Sauron. Great eye. Great reference to Harry. That guy's going to see me. Where am I right now? All right. Well, I don't know why I can't use the hand. We're just going to hack this deal fast. Oh, it's unlocked. Never mind. Don't need to hack it. Is like smoke's pouring out of his head. He's 300% over clocked or whatever. That's a PC term. Don't know what it means, but he didn't, you know, I'll be fine now. Okay, fine. Tragic bomb is outside. You see, you have to read all this stuff. Do you code P61? There's anyone looking to pick up a few hours of Have you Have you been running into a lot of jokes? I",
            "start": 852.08
        },
        {
            "text": "Okay, fine. Tragic bomb is outside. You see, you have to read all this stuff. Do you code P61? There's anyone looking to pick up a few hours of Have you Have you been running into a lot of jokes? I remember that was a big thing in uh it's Human Revolution. You'd find emails that were joking. No, not so far. But again, remember I was like really crazy last night when I played this. So crazy. Is it crazy? I'm impressed. You want me to play more? Tired. 12 hour stream. Come home. Going to play more of this. Double check things. Okay. I don't think this is anything important, but let's probably is. Let's try to hack the security panel. Hack the planet. Nope. Can't hack that. Okay. Don't hack. Sometimes the cool thing is you can hack in and find like cameras so you can spot people, figure out where they are. They're bathroom cameras. Yeah, there are b They're actual uh toilet cams. It's crazy. It doesn't make any sense, but it's kind of That's the future they live in. Back to the future.",
            "start": 903.84
        },
        {
            "text": "where they are. They're bathroom cameras. Yeah, there are b They're actual uh toilet cams. It's crazy. It doesn't make any sense, but it's kind of That's the future they live in. Back to the future. Nope. I hate that. Also, this is where this is why I like this game. It's like scanning planets. You're just like, I just want to just look at everything. Break open locks. Little [ __ ] Get that smoke grenade. Smoke grenade. Great. I don't even need a smoke grenade cuz like I said, I've turned a new leaf. I'm not going crazy anymore and just shooting everyone that's in sight. You know what I mean? I don't believe that for a second. You better believe it because it's true. Some crafting parts. Good, good, good. Okay, so this dude's Oh, they're gone. Okay, cool. No, there's a guy coming right right there. Okay. Are you going to kill him? I don't know what to do here. Well, when he turns his back. Oh, watch that. Then just break his neck. Here you go. Special delivery from Dr. Pain. Oh god,",
            "start": 941.84
        },
        {
            "text": "there. Okay. Are you going to kill him? I don't know what to do here. Well, when he turns his back. Oh, watch that. Then just break his neck. Here you go. Special delivery from Dr. Pain. Oh god, I don't have it. I don't have it. Jesus. What the [ __ ] Get your gun out and keep it trained right at head level. And then everyone who comes in, pop one. I got four, three, four. You'll get four in a row. And you can line some up like Deadpool. You'll get them all at once, too. Iron sight. There you go. [Music] That EMP is not going to help. Yeah, you're right. You're 100% right. I had a silencer on this thing, but I guess I don't. Go up. Go up. Go up. Go up. Go up. There's either locked. You only have the two. Stay out of his head, Kevin. It's getting It's getting rough in here. Here we go. So, I should have just not done that. I'm going to try to do this real quick. Let's see who this guy is. Still chilling over there. Well, he seems like he's in a He's tucked away. He's in cover as well.",
            "start": 980.72
        },
        {
            "text": "I should have just not done that. I'm going to try to do this real quick. Let's see who this guy is. Still chilling over there. Well, he seems like he's in a He's tucked away. He's in cover as well. I have to kill him. There's also a turret right there that's going to see you. Just run. Just go. Think so. Yeah, he's you're what you're doing there. Like, you know, shoot yourself across the way and just shoot him in the face. No, I was just saying get out of there. Just Just walk just walk to the cover you were going to. Oh my god. This is not how this is what should have gone. It's cool. They're not They're not going to see Can you take his hand? Yeah. And put his hand against this thing. You can drag bodies. We're going to take this con. We're going to take this convoy. Ain't nothing going to get in our way. Are you kidding me? Okay, I'm just going to go into this room. Sure. Shoot that guy. He's already dead. Shoot him. He's not dead. He's powering a fear, but he's not dead. Hey,",
            "start": 1048.32
        },
        {
            "text": "to get in our way. Are you kidding me? Okay, I'm just going to go into this room. Sure. Shoot that guy. He's already dead. Shoot him. He's not dead. He's powering a fear, but he's not dead. Hey, buddy. It's okay. Don't worry about it. Put him out of his misery. This is all you want. Yes. 100%. 100%. Just don't waste bullets. No, I'm not gonna waste Kevin. You don't know. He could be the final boss. He could be. He's just He's hiding in plain sight. Yeah. It's a great idea, right? I've always thought about that for a video game. Have one. You have a character that like you killed you think it's just random and then it turns out he was the bad guy all along. So, you just get to the final level and the bad guy's gone killed him. Or like the story just like it just it just everybody's like we we've lost we've lost Adolf Jeremy or whatever his name is, right? It's just like then the story just kind of goes nowhere. Adolf Jeremy is not doing anything bad anymore. Adolf Jeremy is just gone",
            "start": 1095.56
        },
        {
            "text": "we've lost we've lost Adolf Jeremy or whatever his name is, right? It's just like then the story just kind of goes nowhere. Adolf Jeremy is not doing anything bad anymore. Adolf Jeremy is just gone and nobody knows why. Then they find his body. They saw me. God damn it. That's what happens when you jump by a window. Oh [ __ ] They got them. They got them wall piercing bullets. Get rid of the EMP and fight human beings. Oh [ __ ] Get No. Get out. The thing is that everything does something in this. You know what I mean? Yeah. Every button does. Yeah. It's almost like they don't want you to play like a Twitch shooter. Well, you know, maybe they do, maybe they don't. I understand. It's the best laid plan. It's like Metal Gear, right? Where you're like, I'm going to do this completely stealthy and do that. The [ __ ] is now that I got like no guns. Bye bye. I should probably just restart this. You what? If you want to. Yeah. Why? What is it? 5:00. What time is it? Sure. Yeah, it'd be",
            "start": 1134.64
        },
        {
            "text": "and do that. The [ __ ] is now that I got like no guns. Bye bye. I should probably just restart this. You what? If you want to. Yeah. Why? What is it? 5:00. What time is it? Sure. Yeah, it'd be great. Thank you very much. Colin's girlfriend is going to take care of Pat. She's very nice. Hey, buddy. You all right over there? What are you doing over there? He's praying. He's trying to call Adolf Jeremy like I was talking about. Sir, where are you? And he's like, I'm hiding in plain sight. Don't worry, bro. Oh my god. This is not going to go well for me. This is not going well for me, ladies and gentlemen. I feel like this is the entire game for you. I mean, it's not usually. You're supposed to be sneaky. I was But have you ever been sneaky? Never in my life. That's the crazy thing. What the [ __ ] is going on over there? I just threw a grenade out. Oh, okay. I didn't see that. Oh, now now I see it. Read the newspaper. Oh, exiting the restricted area. Good. Oh, they don't know where I'm",
            "start": 1185.12
        },
        {
            "text": "[ __ ] is going on over there? I just threw a grenade out. Oh, okay. I didn't see that. Oh, now now I see it. Read the newspaper. Oh, exiting the restricted area. Good. Oh, they don't know where I'm at anymore. That guy was running towards you. Yep. He knows where I'm at. That guy's Watch. Watch. He's getting blown up. Don't you didn't even have to waste the bullets. He was getting gassed. He wasn't going to get gassed. God dang it. Oh, god damn. [Music] Oh [ __ ] Now, now we got it. Now we got an oldfashioned grenade standoff. If I've seen it once, I've seen it a trillion times. Mut assure mutually assured destruction, they call it. God damn it. So far, not going well for me, these things. Now, is it like Metal Gear Solid 2 though, where if you can sneak up with them, gun drawn, they won't know you're out of bullets until you pull the trigger? Now, I don't think that's that that's that's the way this board works. Well, that could have been one way to get him. Okay. Uh I got nothing",
            "start": 1239.84
        },
        {
            "text": "know you're out of bullets until you pull the trigger? Now, I don't think that's that that's that's the way this board works. Well, that could have been one way to get him. Okay. Uh I got nothing left. Okay. So, what are we going to do? Uh I'm going to go run over there. Yeah, probably. Okay. Who is Why is B. Midler so angry. All right. Here we go. Five bullets. There went There went three into a pillar. All right. Let's start this again. All right. Good. I blame myself. We know where to go. Trial and error. We tried to hack. Trial and error game play. It's a lot like Mega Man. Oh man. Try strategy. Doesn't work out. Let's try one more time. If I get in trouble, I'm going to call it the big dog. Ho ho. Greg Miller. Oh my god. No. You are you the DSX Mankind Divided Pro? You are. It doesn't It doesn't ring like the GoPro. You're the man pro. The man pro. Oo. I am the man pro. You're the manower. I know how all the equipment works. All right, let's Oh, where are we? Where are we? Oh,",
            "start": 1307.04
        },
        {
            "text": "It doesn't ring like the GoPro. You're the man pro. The man pro. Oo. I am the man pro. You're the manower. I know how all the equipment works. All right, let's Oh, where are we? Where are we? Oh, we're in here. M look. Yeah, you need that. See, little viruses and stuff that you can you can use to stop, you know, to help hacking. Sure. Probably should have looked around this room. A lot of actual stuff. A lot of helpful things I could use here, which is great. Is there a photo of Adolf Jeremy? No. Cuz if we could approve that's what he looks like, you could kill him and not have Oh, a weapons closet. Apparently, I just did not take my time. Look at that. It's just sitting there the whole time. All right, let's see where this guy does again. Reach out and touch. He's over there. He's coming to you. We're going to I'm going to wait for him to leave. Then I'm going to shoot that turret and then I'm going to [ __ ] this guy. Do you need to even worry about the turret though is what I think",
            "start": 1355.84
        },
        {
            "text": "to you. We're going to I'm going to wait for him to leave. Then I'm going to shoot that turret and then I'm going to [ __ ] this guy. Do you need to even worry about the turret though is what I think everyone would say cuz you can just It seems like you he turns his back and you cross the hallway and bam, that's done. That's like one less thing for us to worry about. Good point. I feel like we don't need to overthink it that to that that degree of widowing that man's wife. Yeah. Yeah. Make him move cuz he's coming. There you go. There you go. There you go. He's like, \"Man, just a giant rat walk through there. Just go.\" Okay, let's go. Oh, smart. Okay. Oh, they'll see the vent. Will they really? I don't know. Cool. Okay, I'm in here. Let's see where these guys are. Yeah, there we go. All right. Okay, so we got Mugsy Bogues right there. We got Now, if they see me, I got to kill them all, right? Have you tried talking to them? You're just uh you know, you're just the air shaft",
            "start": 1393.52
        },
        {
            "text": "go. All right. Okay, so we got Mugsy Bogues right there. We got Now, if they see me, I got to kill them all, right? Have you tried talking to them? You're just uh you know, you're just the air shaft maintenance man. Electromagnetic glass switch. All right, I'm going this where these guys are. There's one dude right there. I wonder. Okay, this guy should not see me if I jump down here. If I jump down here and crab walk on the desk, he'll never see anything out of the ordinary. Okay, there's an EG switch that's off right now. All right, I don't know what that does. I don't know if we know. Hit it. Can you hack this one isn't the question. Nobody knows. Nobody knows. Oh, I got a fortification. I don't know what the nuke does. I think it nukes stuff. Yeah. Yeah. I have no idea what how this works. I I just don't know what you're doing. You you go to each node. Uhhuh. And sometime it has a depending on you have to like basically hack each node. as you get to it, there's a percentage chance",
            "start": 1435.52
        },
        {
            "text": "I I just don't know what you're doing. You you go to each node. Uhhuh. And sometime it has a depending on you have to like basically hack each node. as you get to it, there's a percentage chance that the system will figure out that you're in it and it will start to back trace and lock you out. Okay, so uh that right there obviously like by the end of it, it it noticed me, but I had enough time to hack the final node like get to the actual database. So now I hacked it and I turned it off. So that's what I got to do. Now I can look for all this cool stuff. Everyone for some reason lost my key card. Yeah, I know. If anyone happened to find it, please bring it back. Great. Could have done that. It would have been nice. Lost key card. Check the washrooms. Maybe I had That's what it said. No, that's you wash. Right at the top. Have you checked the washrooms? You do spend most of your shift in there. Like you. There's the washroom. So, we need we need to go to the washroom and find a key",
            "start": 1499.6
        },
        {
            "text": "that's you wash. Right at the top. Have you checked the washrooms? You do spend most of your shift in there. Like you. There's the washroom. So, we need we need to go to the washroom and find a key card in there. Kev, can I get a poop report? Okay. A lot. How's that chicken wing? You're gnawing on over there. So good. All right. So, where do we need to go now? We got to get beyond these guys. Got to get a bomb. Give me the Yeah, let me see what they're up to. That guy's homiey's right there. Yeah, there's a [ __ ] ton of people up there. Yeah. What is this? That's a key card. I don't know if I want to open the door. Open the door. Yeah. Oh, is that the guy that would let you go through last time? No, I think I'm already past that guy. No, look. Yeah, it's that guy. It's not that guy. It might be that guy. It's not that guy. That's the door you can get into. It is. All right, guys. Now I'm in the restricted guy. Okay, so Oh, I'm actually out. So, he shouldn't shoot me now.",
            "start": 1535.28
        },
        {
            "text": "guy. It might be that guy. It's not that guy. That's the door you can get into. It is. All right, guys. Now I'm in the restricted guy. Okay, so Oh, I'm actually out. So, he shouldn't shoot me now. Theoretically speaking, no. If you walk in front of him right now, you're not going to get shot for sure. Right. Okay. So, you think? Yeah. Well, you're not you're not ne Well, you can't walk in the restricted area room there and be in front of the glass, but right here you find it. Great. You can't be like, I know where the [ __ ] key card is. It's in the washroom, you punk ass [ __ ] Hack it. Hack the planet. We tried to hack this one before. No, we didn't. We tried to hack the one over across the way. Did we? I thought I thought we did. Kevin, you seem to remember. Oh, here we go. Key card. Key card found it. Oh, gross. Everything's in the toilet. Look down. Get it. Snatch it out. Snatch out. Snatch out. Get it. Get it. It's got to be in here somewhere, right? Yeah. There it is. Found it.",
            "start": 1577.52
        },
        {
            "text": "card found it. Oh, gross. Everything's in the toilet. Look down. Get it. Snatch it out. Snatch out. Snatch out. Get it. Get it. It's got to be in here somewhere, right? Yeah. There it is. Found it. Just like my F. No, that was it. That was not a key card. You found it. Maybe it's in here. Well, you have to. It might be in there. It fell in the poop. Do you see a key card? Do you see the beast? Punch the keys. Maybe it's on here. excitable. Close the door. Maybe hand dryer. Like, what's happening in that bathroom? Why is Sean Finnegan in the garden? I don't know. I don't see a key card in here. Damn it. Thought we had it. I thought we did, too. Generally, when you get a a clue that says you spend a lot of time in the bathroom, that means that there's going to be a key card in here falling out. Check the floor. Checking the floor. Checking the floor. All right. Yeah, I was going to say, can you get things out of the trash can? Like if you threw the trash can, does that No. All right.",
            "start": 1612.32
        },
        {
            "text": "out. Check the floor. Checking the floor. Checking the floor. All right. Yeah, I was going to say, can you get things out of the trash can? Like if you threw the trash can, does that No. All right. All right. Well, we're mistaken, I guess. Let's go back. I want to go back. Oh, you know what? I think we have to go to the other room now, right? Oh, don't mind me, Uncle. I want to go back. This is the door you got busted trying to hack into, right? Okay. So, I can go back in here. Uh-huh. Oh, you think somebody brought it here? I think I got to get through that door, right? That was the dude. That's the turret. What's over there? Isn't there a door over there to get to? No, maybe not. I mean, the objective is still behind you. Is it? Yeah. See how it's got the little yellow or Yeah. No, it's in the restricted area. It's right It's through there. I got to go through here. Guys shoot me in the face. I was like, I don't like you looking. He's already thinking about these his fingers on the",
            "start": 1673.84
        },
        {
            "text": "in the restricted area. It's right It's through there. I got to go through here. Guys shoot me in the face. I was like, I don't like you looking. He's already thinking about these his fingers on the trigger. Another bathroom. Yeah, there could be other bathroom. Let's go check. I would think across the hall would be the women's or men's room, but that's locked. But is that going to be an easier hack? No. No. No. Not that one. Not that one. Not this one. Oh, you see this one? Because that's how bathrooms generally work, right? But I don't know why they key card entrance on a hack. Can you hack it? I can't. I don't have I don't have confidence. Oh, there you go. Can you No, you can't do that. You can't tear that fan out, can you? Let me go back here real quick. Kevin, we're not hacking it. All right, I'll try to hack it. Just like you couldn't hack it. Just saying he's trying. What did this thing do? The EG switch, man. Toggle it again. Oh, now they can't see me. Cool. Okay, that's",
            "start": 1721.04
        },
        {
            "text": "it. All right, I'll try to hack it. Just like you couldn't hack it. Just saying he's trying. What did this thing do? The EG switch, man. Toggle it again. Oh, now they can't see me. Cool. Okay, that's cool. There. There. Where? Turn left. Oh [ __ ] Oh jeez. Yep. Get him. Get him. Circle. Circle. It's too late. Game's up. Uh, turn around, though. Give me a 180. Give me a 180. Hold on. Hold on. Hold on. Just going to hide that body. Uh, what? Turn around. I'm concealing myself in the cover. All right. God, see, Greg. Yeah. You see, you could have easily gotten the thing I wanted you to get. No problem. Where is it? Turn around in there. Right there. What's on top of that computer? To your right. To your right. There's a key. What is that? Hold on. Well, I'm getting shot, everyone. They don't know where I'm at. The old throat punch. We're just going to stay here for a sec. There's something to the right of computers. Is that what you're trying to tell me? Yeah. Go. Yeah. Go. Jesus. [ __ ]",
            "start": 1759.8
        },
        {
            "text": "know where I'm at. The old throat punch. We're just going to stay here for a sec. There's something to the right of computers. Is that what you're trying to tell me? Yeah. Go. Yeah. Go. Jesus. [ __ ] Oh no. Where is over to the right? There's a computer tower on the floor. It looks like there's a card on top of it. Your turn. See what I can do here. Go for it. You got to invert your controls. Oh god. Yeah. Can you just change to make it easier on me? I've tried. I tried. I thought I thought to myself about a year ago. I said, \"This needs this needs to stop.\" Yeah. I'm not going to be an outsider for the rest of my life. I will not play pick up the controller after me and save my butt in a DSX Mankind Divided Let's Play unless I stop being inverted. But then I thought about the stick. When you pull back the stick, your head looks up. When you put that argument is the dumbest thing. Your head looks down. I thought I can't argue with that logic, Greg. If done right, no can't defend. And",
            "start": 1815.76
        },
        {
            "text": "you pull back the stick, your head looks up. When you put that argument is the dumbest thing. Your head looks down. I thought I can't argue with that logic, Greg. If done right, no can't defend. And that is this argument. Do you see what I'm saying? I do see what you're saying. All right. You've checked this. Oh, did you already unlock all this stuff? Great. Be careful. Look at the brain on you. Damn processor chick. That's cool. I hate processing chicks. Move that. Yeah, just throw that up there for put that anywhere. You got to retrieve. Oh no, it didn't work. He actually did come out. What's that trash can doing in there? You're good, I think. Oh, so he's no longer blocking it. Yeah, I know. But there's two other dudes over there. They're like, \"Hey.\" No, no, no. They're going to see you if you do that. That's what I want. You want them to see you? Yeah. Come get me, [ __ ] Cool. All right. F it. I mean, they're not going to come, but they're going to do something. That guy's not",
            "start": 1870.72
        },
        {
            "text": "you if you do that. That's what I want. You want them to see you? Yeah. Come get me, [ __ ] Cool. All right. F it. I mean, they're not going to come, but they're going to do something. That guy's not coming for sure. No, I mean, I would turn that back off so you can explore. Does that guy have a card on him? Check it. Look at the guard you just destroyed. I don't think so. But yeah, got the get those bullets anyway. And maybe reload your gun. You might need it. All right, so the I'm thinking you got to go the other way, right? The only the only place we haven't checked is that LA that area that way. We can't go through that door. You got to go back to the vent in here in the room. Yeah. What about hacking the other doorway? We can. We possibly could. You want to try to hack that doorway real quick? I've never tried to hack. I don't want I don't want that on my permanent record. Okay. As somebody who maybe Okay, before you cross, maybe don't Okay, they don't care. Doing lunges. All",
            "start": 1920.56
        },
        {
            "text": "real quick? I've never tried to hack. I don't want I don't want that on my permanent record. Okay. As somebody who maybe Okay, before you cross, maybe don't Okay, they don't care. Doing lunges. All right. So, triangle to hack won't do anything. So, you got to you got to hack those nodes, right? And if you if you go over the the file file folders, just kind of scroll over one of them, it'll tell you that's got a 45% capture detection ratio. Now, if you hit the nuke when when you're detected, I believe it stops. Okay. The attack. So, you have a couple. But, I have to hack each one of these. Yeah. You got to get to both of those. That's this guy or he just No, no, that's that's the bad guy. Okay. So, once he realizes that you're in, that's the the home computer, I guess. Just scroll over it. Yeah. So, that's the diagnostic. Once he figures out that you're there, it's he's going to start a trace back through the lines. What does fortify do? Fortify. If you hit it, it'll hit it. The back",
            "start": 1958.88
        },
        {
            "text": "Yeah. So, that's the diagnostic. Once he figures out that you're there, it's he's going to start a trace back through the lines. What does fortify do? Fortify. If you hit it, it'll hit it. The back trace will hit that. It takes a little bit longer to get through it. Okay. So, it'll stop it for a couple seconds. So, if you if it's not detected, you can fortify it. Okay. And then move on to the next one. So, you can fortify that one right now. Anomaly detected. Oh god, I hit the nuke. That did not do what you said I was going to do. Oh god. Oh, I think maybe you have to be over the note while you knew. Okay. Yeah, it's okay. Didn't It didn't uh alarm anyone. Yes, it did. [Music] Looks like we're having ground beef for dinner. And homie's going to shoot you right in the butt. He doesn't have egg on me. He don't have the egg on me. Don't go out there. See, this is inevitably what happens with me in this game. You are going to get blown up right now. Just stay. Don't move. I'm aware. Don't",
            "start": 1997.84
        },
        {
            "text": "egg on me. He don't have the egg on me. Don't go out there. See, this is inevitably what happens with me in this game. You are going to get blown up right now. Just stay. Don't move. I'm aware. Don't worry. I have a plan. Like that head shot while blinded. Did you get him? Yeah. Good for you. I didn't see it. It was all white. Back up. I need backup. Oh god. Watch my back. See, I like since it's not, you know, a shooter, right? I like that they are generous with the head shots. Makes me feel good. I can just line it up. Let Jensen get his lock. And I like these guys will have a combat rifle, too. It's nice. Make sure you pick up all those cuz I'm going to need them later. More people coming. I thought I heard something go. Oh, I thought so, too. But cool. We got in. Now, if you hack that wall panel, it'll turn the alarm off. Where? Right there. Can I get shot while? Yeah. Okay. There's just one to get, but Yeah. And so I have to nuke before I do I think I don't know really how the",
            "start": 2046.64
        },
        {
            "text": "wall panel, it'll turn the alarm off. Where? Right there. Can I get shot while? Yeah. Okay. There's just one to get, but Yeah. And so I have to nuke before I do I think I don't know really how the nuke works, but I think if if you nuke it while it's on one of the things Oh god. Oh [ __ ] That's on you. That death is on you. Cuz I would not have hacked. I would have kept moving. Smart. I'm going to win. I'm going to win. Panchia. The deep ocean installation known as Panchia. Try one more time. Was funded by a consortium of corporations. Got to get through this. We do. Mhm. For day six. Mankind divided. Everything is awesome. Everything you want. That's I know Kevin want to find that key card [Music] man when I did other things. I did other things at night. Hey baby do things. He said everywhere you want. Oh I see where we are now. Yes. So you're back. I'm going to come back around. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Maybe he's gone. Now he's in there with his boys. Is he?",
            "start": 2117.2
        },
        {
            "text": "you want. Oh I see where we are now. Yes. So you're back. I'm going to come back around. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Yeah. Maybe he's gone. Now he's in there with his boys. Is he? Oh, okay. Boy toys. So, we want that. Now, it's only obviously it's got a line of sight, that thing. Yeah, that's why I'm going to use my EMP ammo. Yeah, you probably could. I'm going to let Roy Jones Jr. here walk by. Pop one in that thing. Is it quiet? Is the gun quiet? questionable. But you only have a limited amount of time when it's Sure. Sure. Sure. I want I'm going to do it and then move out. Yeah. Yeah. There you go. Well, I I don't think about it. Roy Jones Jr. I would drag that body out of the way, too. Really? Yeah. Hold it. Just hold Yeah. There you go. Just get him out so the thing can't see it. Or leave it right in its ey line. I just leave a pair of feet like right where I can see it. Okay, cool. Good job. Just in case. Yeah, in case this guy needs a hard hat hit. This guy didn't",
            "start": 2191.6
        },
        {
            "text": "see it. Or leave it right in its ey line. I just leave a pair of feet like right where I can see it. Okay, cool. Good job. Just in case. Yeah, in case this guy needs a hard hat hit. This guy didn't even hear you. See, you're stealthy. This guy didn't even know what's happening. Maybe talk to him. See what's up. Hey, buddy. Shoot him in the butthole. Whatever. Talk to him, Greg. No, they're going to hear you. You're such a dick. He could have. That was like got a key card on him at least or something. He's in the restricted area. That's what Adolf gets. Man, why do you keep calling Adolf? Cuz I had a whole I had a whole story room. This guy was completely useless to you. What is the point of this server room? Oh, wait. There's a right there to the left down. What's that thing? That a nuke. Hacking some kind. That's some software. Hacking software. Dude, you're getting hacking software. Going to go EMP again on this muff. Yeah, nailed it. What's over here? A vent. Is that a vent? Can",
            "start": 2251.68
        },
        {
            "text": "Hacking some kind. That's some software. Hacking software. Dude, you're getting hacking software. Going to go EMP again on this muff. Yeah, nailed it. What's over here? A vent. Is that a vent? Can you go through there? No, you can't go through there. All right. Maybe just get the [ __ ] out of there. All right. How do they see you? There's a window in the door. Oh, son of a [ __ ] They didn't see me, though. They just saw something. They don't know what Bigfoot. Do they think Do they Do you think they realize they they just saw their death? Oh man, they're ready. Oh, they are ready. They know you're there. They don't know that I'm here. I think you just got to shoot your way out of this one. If I'm being honest, if I'm being 100% honest, I think it's fragrant time. I am just being honest. I think it's frag grenade time. I think it's morphin time. It's morphin time. They're definitely going to see if you go over there. Okay. Or not. I keep thinking that X makes sense to be the uh cover",
            "start": 2299.04
        },
        {
            "text": "I think it's frag grenade time. I think it's morphin time. It's morphin time. They're definitely going to see if you go over there. Okay. Or not. I keep thinking that X makes sense to be the uh cover button, but it's really L3. What does this guy think he's doing? What's going on? Shoot. I don't know. [Music] All right. Well, we suck. We'll get through it eventually. That was fun, though. Yeah, it was. What did you think, ladies and gentlemen? Tell us in the comments below how bad we are at DSX Mankind Human Divided Revolution. Close. So close. It's the Here's the thing is that it's DSX Human Revolution. Mankind Divided, but Mankind and Human are so close. Just call it Humankind Divided Revolution. It's out now on PC, Xbox One, and PS4. Thank you so much for sponsoring the Kind of Funny Studios stream. Everybody, until next time, it's been our pleasure to serve you.",
            "start": 2351.36
        }
    ]
}