{
    "id": 2653,
    "video_id": "2PzNQWeKiEk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "How Retro Has Changed - The GameOverGreggy Show Ep. 181 (Pt. 3)",
    "description": "Retro has changed.\n\nThanks to Dollar Shave Club for sponsoring this episode. Go to DollarShaveClub.com/Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1495609200,
    "duration": 1347,
    "transcript_chunks": [
        {
            "text": "There's no reason to use a cheap disposable razor or pay a ridiculously high price for gimmicks. Make the smarter choice and join Dollar Shave Club, like my boy Tim Gettys did. Have you seen him lately? No more neck beard; it's beautiful. Get a close shave every time, and you can't beat the convenience or the price. If you haven't tried Dollar Shave Club yet, you're missing out. It's an amazing shave at an affordable price. There's no smarter choice on the market, and right now they're giving away a one-month trial of any of their razors for $1 with free shipping. And after that, it's just a few bucks a month. There's no long-term commitment, no hidden fees, and you can cancel whenever you want. Get your dollar trial at DollarShaveClub.com/Greggy. I always remember growing up; I thought, \"Man, if I could have an arcade cabinet in my house, I'll be rich.\" That'd be so cool. Now it's like... that's just such a hipster thing that people just do. And it's like, I mean, honestly over time, I",
            "start": 0.04
        },
        {
            "text": "man if I could have an arcade cabinet in my house I'll be rich that's be so cool now it's like uh that's just such a hipster thing that people just do and it's like I mean honestly over time I think video games might be the worst investment for collectibles do you agree with that I mean I don't know are you off from different topics here yeah you know what let's segment this over here where like retro was going to be one of our topics like collectibl this kind of all fall into the same thing but it's interesting where anything's useless as a collectible unless there's maintained interest in it over time right right but I think that people like even games that I loved growing up they just don't hold up over time and it's interesting to like what's what to you would be the ultimate video game collectible from you growing up something you would play and you'd want to have it again see I mean my thing is again going back to the GamesCast with me and Andy did I think that the",
            "start": 51.16
        },
        {
            "text": "\"Ultimate video game collectible from you growing up something you would play and you'd want to have it again see I mean my thing is again going back to the GamesCast me and Andy did I think that the greatest single video game as something that you could buy in a store is the Mario All-Stars Plus World Collection on Super Nintendo. It collected Mario 1, 2, 3: World and Lost Levels, which is the Japanese version of two great collections of games that hold up today. They were the HD remakes of the NES ones, and that's a classic cartridge that at any point in my life I'm like, 'That's a **** classic.' Yeah, well I remember as a kid growing up my friends would have collections of comic books under their bed and it be worth so much someday turned out to be true. But occasionally there's one in there that's worth a lot and a bunch that are worth nothing. And I think of like the World Championship Nintendo cartridge, there's some things like that in video games that are like an individual thing that are rare but a collection.\"",
            "start": 97.08
        },
        {
            "text": "that are worth nothing and I think of like the World Championship Nintendo cartridge. There's some things like that in video games that are like an individual thing, that are rare, but a collection of video games over time is an interesting thing, but not something that's like this crazy thing that's increased in value because you've had this collection, and maybe it will like 20 years from now. But I thought it would be there by now. I mean every once in a while you see like articles written up about like this guy has every Wii game ever made right, and it'll be like a crazy room with all of it, and then it'll sell for something ridiculous. But a lot of times people aren't even trying to sell them; they just want to have it correct. And it goes into one of those things like Pokémon cards - they were the huge boom, and these are going to be worth so much, and it's like they were worth a lot for a while, but then over time it went down, but there's a lot of them that are still worth a lot",
            "start": 140.44
        },
        {
            "text": "were the huge boom and these are going to be worth so much and it's like they were worth a lot for a while but then over time it went down but there's a lot of them that are still worth a lot if you go on eBay and try to get a first edition Charizard now it's still going to go for a lot more money than a little piece of paper should go for sure yeah that kind of thing but if you have a cartridge like there's some stuff like Earthbound which I think has increased in value quite a bit because it was very rare but like if you had a like if you had Super Mario Brothers from the NES that's a that's a seminal experience for so many people if you had one new in the box that wouldn't be worth like 1,500 bucks you know maybe not 1500 but I think that that still even that inbox would be if we were to eBay like's let's try looking like new inbox Mario cuz I feel like even going back to like the PlayStation era trying to buy like a Crash Bandicoot new in box you're still going to pay like",
            "start": 173.96
        },
        {
            "text": "Were to eBay, let's try looking for like new inbox Mario. Cuz I feel like even going back to like the PlayStation era trying to buy like a Crash Bandicoot new in box you're still going to pay like $100 for that thing. I don't even know if Super Mario Brothers new in box exists cuz the thing with Mario is it that game got so cheap that I remember a point at Funco where they were selling the Super Mario Bros./Duck Hunt game for 9 cents, they were selling it for 9 which back then I was like what's the point, like you could buy so many of these and it's just like not even a thing. So here's a guy trying to sell Super Mario Brothers 3 brand new Nintendo NES factory sealed $299 he's trying to sell it. I have no idea if he's going to be able to. I forgot that's how the boxes looked, yeah just the square re my thing is growing up I uh I grew up I was born in 1989 which meant that any NES game I played was like the NES was done by that time so I had never even seen an NES box until years",
            "start": 214.0
        },
        {
            "text": "\"Growing up, my thing is. I uh, I grew up. I was born in 1989, which meant that any NES game I played was like the NES was done by that time, sure. So I had never even seen an NES box until years later because we would just buy a bunch of them at garage sales and they were just loose. So I might be eating my words here. Super Mario Brothers was on the Nintendo Entertainment System in 1985 - new fact: it seems like it was later than that. Mario 1 was '85, new factory sealed, it's for sale for $620, and that's always the hardest thing is like are people actually buying these things because you see like oh man, the Switch is sold out everywhere, it's selling on eBay for $900,000 - like no, it's not. Someone just has that number there, you know? Yeah, but here's a cartridge: Super Mario Brothers 3, ten bucks. Like that's yellow, I don't know because it's old as hell. Why is that red? Those don't seem real, yeah, or like a Super Mario Bros./Duck Hunt cartridge from back in the day - it's twenty bucks now.\"",
            "start": 257.88
        },
        {
            "text": "10 bucks like that's yellow I don't know cuz it's old as hell why is that red those don't seem real yeah or like a Super Mario Brothers Duck Hunt cartridge from back in the day it's it's 20 bucks now literally 9 cents at GameStop yeah so and it was when you bought it it was probably 50 bucks I don't more I mean that's thing like Earthbound was so expensive we 120 or when it first came out I think it was 90 I think it was like 80 or 90 but uh yeah I don't know I think it's what just like anything collecting something there is an audience for that thing right and if you have all of that thing it's going to be worth it to you and maybe not anyone else but the moment you have all of it and you say this is worth something people are going to look at it and be like oh yeah it's worth something they have all of it so yeah it was worth collecting for them it's like EarthBound we were talking about this being a huge collectible, EarthBound uncut complete box set new sealed SNES 80 bucks I would",
            "start": 304.4
        },
        {
            "text": "they have all of it so yeah it was worth collecting for them it's like EarthBound we were talking this being a huge collectible EarthBound: The Complete Box Set, new sealed SNES $80 I would I would have thought that would have been like $1,200 but then what's this one but see these are reproductions something them how this seems off $500 questionable we're just sitting here we this a show look laptop this is the one that I'm seeing that's 4 like the $4,000 one that's the giant box that is the actual EarthBound box Super Nintendo SNES EarthBound new in box brand new in original box VGA q85 I'm sure that means something to someone $4,000 very good all all good job Earth yeah know I don't know it's interesting cuz like I held on to I mean I still have so many physical games and at some point I had to I traded them in to get the next console because that's how things worked um in the 90s but I still hold on to a couple physical games like there's some things that I'm like this meant",
            "start": 346.44
        },
        {
            "text": "\"point I had to I traded them in to get the next console because that's how things worked um in the 90s but I still hold on to a couple physical games like there's some things that I'm like this meant something to me so I'm never going to get rid of it but I knew I'm like I can't go down this collecting Rabbit Hole cuz I will I'll go crazy and I'll buy all of them and I think that we're lucky that we are able to have things like Virtual Console and the PlayStation Network and Backwards Compatibility like being able to download stuff Xbox Super Mario World for the 40th time exactly but having it all in one place it's like the dream used to be oh man I wish I had arcade cabinets but it's like you really you just want one thing where you can play all all everything ever yeah the great it would be the greatest the digital collecting is something that I get involved with where it's like oh you know I I don't like to physically collect stuff or like knick-knacks I know that's a big thing in the\"",
            "start": 395.12
        },
        {
            "text": "the greatest the digital collecting is something that I get involved with where it's like oh you know I I don't like to physically collect stuff or like knick-knacks I know that's a big thing in the tech industry to have stuff on your on your desk I can't stand that I want a clean workspace but digital stuff I'll just have Archives of everything and if I get one thing I've got to get the rest of that's why I like achievements on the Xbox platform I get that one achievement I'm like well I'm playing this game for the next eight years until I get all them oh my God and do you think we're going the that route with Amiibo right now yeah definitely that's why I'm like I can't buy an Amiibo and whenever like people send us Amiibos I'm like I nope you need this thing away from me cuz I'll just get addicted to it I'm like I don't want that cuz once I have one I need them all cuz then you get that you get on that hunt where you find out about the super rare one which I don't know what the",
            "start": 432.76
        },
        {
            "text": "get addicted to it I'm like I don't want that cuz once I have one I need them all cuz then you get that you get on that hunt where you find out about the super rare one which I don't know what the really rare Amiibo is right now but you want that item and it's on eBay for I don't know 60 bucks which you know isn't crazy but it's like more than I want to spend for a plastic toy that I'm probably not going to give a about in five years but let me tell you why you would because uh Mario Kart just came out recently came out on the Nintendo Switch it was Amiibo enabled and so Kaden who has a full collection of Amiibos she brought them into the know and everybody unlocked every possible character on Mario Kart day one so she's the hob she has she had a whole little business going on there that's how it was stored money from people just be like hey you want to come by and rent out these let me see this that's a good deal so what's the most expensive Amiibo since we're in",
            "start": 468.08
        },
        {
            "text": "Going on there, that's how it was stored money from people just be like, \"Hey, you want to come by and rent out these. Let me see this, that's a good deal.\" So, what's the most expensive Amiibo since we're in this trend? Uh, for a while it was that gold one, I think Mario one right? Well, I know also the 8-bit ones were also like very limited when they sold out. Maybe it wasn't Golden Mario; there was some Mario, I think it was the 8-bit Mario. It might have been Silver Mario, not the... or maybe there's an unpainted Mario. Was that one? Think about right anyway. The one thing about retro too is as I mean you make a lot of video game content. We make a lot of video game content and we're constantly asked when we talk about these shows would you guys make a retro show? But retro shows to me are so hard because everyone's version of retro is different. Like my number one collectible that I would love to have, which I actually do have, um, is a cloth map from the game series Ultima. If you know what that is, yeah.",
            "start": 510.52
        },
        {
            "text": "everyone's version of retro is different like my number one collectible that I would love to have which I actually do have um is a cloth map from the game series Ultima if you know what that is yeah the original like RPG series on the Commodore 64 yeah it was a Commodore 64 game and it was uh you had a map of this World Britannia that they invented for the game but most people who were watching this and who watch don't they never played any Ultima games they don't care they might have played Ultima Online you know which is a totally different game but they just they couldn't care less about it and then you know somebody who's watching it to them some people who who watch our shows now retro to them is the original Halo you know because they started playing at Halo 3 or something like that and so it's like to me I I was a full grown adult playing Halo yeah well I mean see that's that's interesting because what I was saying about there's a couple games that I kept the physical",
            "start": 553.2
        },
        {
            "text": "that and so it's like to me I I I was a full grown adult playing Halo yeah well I mean see that's that's interesting because what I was saying about there's a couple games that I kept the physical versions of Halo and Halo 2 are examples of that because I'll never forget where I was playing those games and the experiences I had so that steel case Halo 2 oh yeah the limited edition one something about it I'm just like I'm never getting rid of this thing like this means something to me I I don't give a **** if it's worth anything like it's worth sentimental value I have a couple those sealed at home oh yeah yeah they have like that don't open until whatever day until release yeah yeah until like November 5th 2005 my brother and I cut school I believe and that's my brother I got my brother really into video games like he had fallen off for quite a bit after playing NES and SNES for quite quite some time and he jumped back in on Halo and he was awful at the at the start of it but then",
            "start": 596.2
        },
        {
            "text": "really into video games like he had fallen off for quite a bit after playing NES and SNES for quite some time and he jumped back in on Halo and he was awful at it but then he eventually started getting good and the most annoying thing for me was like when I would work all day at my job like my after school job and I'd come home my brother would be in my room like playing Halo with my friends all right get out of my room dude like what are you doing and so I remember he drove me to Best Buy to get Halo on launch day this is so great dude what a great memory Halo 2 new in the box goes for $22 goes for less than what you paid for it back then yeah what about the collector's edition all right let's find out collect collector steel case limited edition is I think what they call it I think the video game industry unlike any other industry and Nintendo's a great example of this they have the ability to cash in on that retro kind of nostalgia that",
            "start": 635.68
        },
        {
            "text": "Is I think what they call it, I think the video game industry unlike any other industry and Nintendo's a great example of this. They have the ability to cash in on that retro kind of nostalgia that people want by just making newer versions of the game. And Nintendo - everybody was going nuts on the Switch for this new Zelda game. Everybody I know says it's one of the best games ever, and I think the thing that makes it that way is because it plays like a Zelda game that they remember as a kids. It's light years ahead of it, but it's the way you remember it, and you kind of grow that memory and you add to it yourself. It's like it doesn't play the way the old game plays; it just plays the way you remember it. Yeah, well, that is the importance of nailing nostalgia. We actually talked about this - I talked with Ashly about this on a podcast over on ResetEra.com. Yes, uh, and uh, we were talking about that and how it's like the L.A. Noire games nail",
            "start": 678.48
        },
        {
            "text": "I talked with Ashley about this on a glitch please over on ResetERA first, you can check that out at resetera.com. Yes, uh, and, uh, we were talking about that and how it's like the old Lara Croft games nail classic Tomb Raider, the way that you remember those games playing because you go back to those games now and it's just like so bad, so hard to control, and the pyramid head yeah, yeah exactly. Collect Edition seven bucks, seven bucks there you go but man that thing's sexy, yeah invest in something else but with Nintendo, I think that uh they have that was unique to them for a very long time in the video game industry that now PlayStation is finally kind of kind of has like PlayStation been on for 20 years so they now have a stable of franchises and characters that people grew up on and I feel like Xbox sure yeah is Xbox is more about the experience and less about the games themselves I think where there's like you know Halo and Master Chief and all that people have their memories but people",
            "start": 720.0
        },
        {
            "text": "Xbox sure, yeah, is Xbox more about the experience and less about the games themselves, I think. Where there's like you know Halo and Master Chief and all that people have their memories but people don't necessarily talk about the memories of Halo they talk about the memories of the sleepovers they had and the LAN parties had and things like that. Whereas I with Nintendo it's the characters you know with PlayStation, Nintendo crushed first-party franchises they crush it and when it comes to Nostalgia like Pokémon right came out when I was in third grade and I there's nothing I'm more nostalgic for than the original gens of Pokémon. There are kids now there are seven generations of kids that grew up with a different generation of Pokémon that have that same feeling for those Pokémon, right? You know Nintendo just does the same thing over and over but it's all always to a new audience yeah like I'm always amazed we worked with a guy who his first Star Wars movies he ever saw were",
            "start": 764.48
        },
        {
            "text": "you know Nintendo just does the same thing over and over but it's all always to a new audience yeah like I'm always amazed we worked with a guy who his first Star Wars movies he ever saw were the original trilogy and he's like these are the greatest movies ever and you mean the prequel trilogy yeah I say the original yeah I meant the one through three I me the newer yeah talk about Blanchard is that serious is he is that no he genuinely likes them I think he genuinely likes those movies genuinely likes or genuinely liked no those are different statements no he has he has made a little bit of a turn and where he realized oh maybe these movies aren't great cuz I mean I grew up with themo I'd seen The Originals first but like going I remember going to the theaters and watching one and two and three and not I mean I was a dumb kid so episode one to me I was like dude the pod racing was cool had a **** in dual sided lightsaber are you **** kidding me they spoiled it in the trailer what",
            "start": 805.52
        },
        {
            "text": "three and not I mean I was a dumb kid so episode one to me I was like dude the pod racing was cool had a **** in dual sided lightsaber are you **** kidding me they spoiled it in the trailer what was that about never understood that hype episode one was great to me but you need hype for the new Star Wars movie after 20 years even episode two to me was like I'm still young but even I know that this is not a good movie at all my brother and I were so bummed out see watching too for me I was young to the point that like Yoda pulled out his lightsaber Yoda's going to **** fight oh my God and but then it's like years later I grew up I'm like wow what bad character development why would they do all that I was in the movie going what the the Buddha character has a lightsaber and he's jumping around fighting tiny lightsaber that's not what he does it was very strange to yeah but everyone in the theater was going oh my God I'm like this is totally hot of character this is so off brand for",
            "start": 844.88
        },
        {
            "text": "around fighting tiny lightsaber that's not what he does it was very strange to yeah but everyone in the theater was going oh my God I'm like this is totally hot of character this is so off brand for Yoda but uh yeah GoldenEye for the Nintendo 64 great Retro Game you would never want to play that game today but it's you know 30 bucks and so many people would identify that is one of the greatest games to ever be put out for a console playing it now is rough rough it's hard it had paintball mode though it did it did have the Golden Gun mode which I and GoldenEye think goes back to what I was saying about kind of what Xbox has was going for it where it was about the experience more than the game itself I think you're right you know with GoldenEye it was it was no one else could do FBS on console until GoldenEye kind of did it right and then I give Halo a lot of credit for getting it right in Call of Duty I mean the way I see it is GoldenEye kind of made it fun for Co-op",
            "start": 886.0
        },
        {
            "text": "until GoldenEye kind of did it right, and then I give Halo a lot of credit for getting it right. In the Call of Duty, I mean, the way I see it is that GoldenEye kind of made it fun for Co-op, uh, to be able to just play or not even Co-op, just multiplayer, and play with people in a room and have it be fun, and they perfectly nailed the one more match mentality. And then meanwhile on the PC side, of course, there were so many great first-person shooters, but a lot of them were story-based, and then there was Unreal, and there was Counter-Strike, which like they totally had their thing going right. But N64 still just had the hey it's just fun to control, and only had one analog stick, and there's no way this will be good, and it wasn't until that team went off and did TimeSplitters where they did the Dual Analog thing on PlayStation 2, and then Halo came in, we're like oh no, we're going to do this right, yeah, and like they just knocked it out, it yeah you",
            "start": 928.16
        },
        {
            "text": "and did TimeSplitters where they did the Dual Analog thing on PlayStation 2 and then Halo came in we're like oh no we're going to do this right yeah and like they just knocked it out it yeah you know what's going to be interesting to me for retro going forward is the generation of people who are growing up playing video games now a lot of those experiences what you talked about with your couch Co-op was your buddy next to you now that you're online friends yep and like I think about a game like Five Nights at Freddy's I cannot separate that from Markiplier so when people like you 20 years from now remember this game mean Five Nights at Freddy's I don't know what Mark will be doing 20 years from now hopefully he'll be happily retired or something like that but people will be their retro experience will be thinking about that personality that they experienced it with I didn't really have that growing up I had my buddies that I played games with my buddy Randy that I played Ultima",
            "start": 965.04
        },
        {
            "text": "experience will be thinking about that personality that they experienced it with I didn't really have that growing up I had my buddies that I played games with my buddy Randy that I played Ultima with yeah but I didn't have these personalities that then go off and do other things and it's like they're tied into that experience I'm curious to see how that'll be in a couple decades I mean I I've already lived through enough of that to see such a change where it's like I have my friends that I played Smash Bros with or you know what Mario Kart or whatever and then my buddy Alfredo he got so into the online first-person shooter thing in the MLG way and in the clan battles and in all that stuff and I'd be hanging out with him and he's talking me about all these friends he has and I'm like who are these people I go to school with you and he's like no man these are people I just play with online and like they would meet up and hang out and then like to see your friendship was over yeah no",
            "start": 1004.56
        },
        {
            "text": "are these people i go to school with you and he's like no man these are people i just play with online and like they would meet up and hang out and then like to see your friendship was over yeah no dude there junior year high school almost destroyed me and Alfredo because Counter-Strike just took over his life when it came to Xbox he just yeah was gone do you have any piano music we can play here sad play play The Leftovers music yeah yeah but uh no it was crazy man but then but he did that and then he introduced me to this whole group of of friends that he had I remember we went down and stayed with his online friends in LA and we just had a place to say and it was we had an awesome time terrible idea by the way I know yeah but now but now it's just it's kind of a normal thing like when when we do like community events like kinda funny live or any like we just go to packs or whatever there's a bunch of the community with like 12 people in a hotel room and i'm like that sounds like",
            "start": 1041.96
        },
        {
            "text": "when we do like community events like Kinda Funny Live or any like we just go to packs or whatever there's a bunch of the community with like 12 people in a hotel room and I'm like that sounds like a disaster been there but five people in the hotel room six people listen smells gross he was coming up for Kinda Funny Live too and we were we had just arrived from Austin and we were all going to the hotel say where you staying and he goes I'm staying in a in a a fan let me sleep on the floor in like a room with 18 other people and I was said I'm getting you a hotel room Trevor Starky I know that you were not on the official list of traveling people for this I'm getting you a hotel room so you don't have to stay on the floor oh man I appreciate apparently you did that's why you quit so thanks for the hotel room I'm out little did I know I was funding his recruitment and uh Kinda Funny at the time oh man the seeds were planted ear sorry we stole them from you guys it happened that",
            "start": 1080.24
        },
        {
            "text": "thanks for the hotel room I'm out little did I know I was funding his recruitment and uh Kinda Funny at the time oh man the seeds were planted early sorry we stole them from you guys it happened that was a thing where it was just like as we were talking about we we came to a decision at an Outback Steakhouse as good decisions are always made uh when me and Kevin are like we want Andy like Andy is the dude that we want for this this role and I was like oh man like see and that's important because we never said that actually turn about his fair play Greg is not getting married today he's packing to move to Austin and we're going to announce that Greg Miller's moving over to Rooster Teeth that's what I was saying I think the the on the drive over here he was on a flight too awesome to go record stuff with Y'all and uh and somebody was like man uh did like what's did you all trade spots I was like man Kinda Funny got **** or no Kinda Funny got **** with this trade like they totally got ripped",
            "start": 1126.12
        },
        {
            "text": "\"Y'all and uh, somebody was like, 'Man, uh, did like what's did you all trade spots?' I was like, 'Man, Rooster Teeth got **** or no Kinda Funny got **** with this trade, like they totally got ripped off.' Me or you, me? But one of our first things with that was we were like, 'All right, we got to talk to Rooster. We got to talk to everyone at Rooster Te**h**at might be upset about this and see if they're cool with it.' So we hit you up, we hit Jeff, we hit up our friend Lewis, and um, a couple of other people, and it went all the way up – talking to Matt, we end up talking to Ezra who was like 'Full Screen' and all that ****. So I'm like, 'Man, it went up there.' Well, we had to talk to the guy that Andy actually worked for, which is the head of the games division, yeah, and uh, yeah, he was...he might not be your best friend; he was very sad. No, I mean, he's an awesome guy, and we've talked many times since then, and I don't know what he says – you were a valuable employee, and Michael misses you. I know.\"",
            "start": 1169.28
        },
        {
            "text": "be your best friend he was very sad no I mean he's an awesome and we've talked many times since then and I don't know what he says you were a valuable employee and Mike Misses you I know I yeah I missed them too I miss them too but I I went what's that that life's over Andy Kevin tells me everybody back home is dead forget about them they're they're gone it's godamn it you're dead to me so I I think I wrote that on Twitter good luck good luck you're dead to me uh but I did the same thing too um even though it was pretty clear that Meg Turney was going to come and work at Rooster Teeth I called Phil the Franco and told him I said I said listen it's really rare that someone of the caliber of Meg moves to Austin so we're probably going to offer her a job and I wasn't asking for permission yeah you know because that's between us and Meg and Meg makes her own decisions in her career and makes very good ones uh but I you know with I just wanted to give him a heads up you know what I mean",
            "start": 1209.4
        },
        {
            "text": "yeah you know because that's between us and Meg and Meg makes her own decisions in her career and makes very good ones uh but I you know with I just wanted to give him a heads up you know what I mean and you have to be kind of careful about that too you know puts the employee in a great position because then the current employer might go hey we want to keep you exactly you know and that kind of thing but especially if you know people you want to be able to make sure that you do that kind of thing because that can you can go back and forth on that and it gets crazy and heart absolutely I mean it sounds super corny to say but every relationship requires communication you know and it's just like I feel like any even business relationships it's like you need to make sure that you're communicating what your side of the story is because otherwise they're going to think they're going to come up with their own version of what your story is and they're going to look at it more as oh they're",
            "start": 1251.76
        },
        {
            "text": "what your side of the story is because otherwise they're going to think they're going to come up with their own version of what your story is and they're going to look at it more as oh they're **** us instead of oh no this is just a total you know a business decision that is being made because people believe this is the right thing to do or or whatever it is you're going to end up in the same rooms again at some point exactly exactly and it's also like there's no reason to bite the hand that feeds when it comes to Opportunities and stuff like that so it's just like we definitely do not want to have a bad relationship with you guys like that'd be so stupid but no or or but if you can screw over somebody who hates then that's good the win-win well how have you party and you're like hey thanks for watching this episode of The GameOverGreggy Show click here to subscribe click here to support us on Patreon click here to see other episodes click here to go into a portal to take you to",
            "start": 1288.32
        },
        {
            "text": "for watching this episode of The GameOverGreggy Show click here to subscribe click here to support us on Patreon click here to see other episodes click here to go into a portal to take you to Kinda Funny Games I'm Greg kinda I kind of made all this happen but I mean not in like conceded way I'm just saying if I didn't want to do the Oreo Show ever then it would have never happened I hope Kevin isn't mad at me you mad at me Kevin",
            "start": 1327.04
        }
    ]
}