{
    "id": 2622,
    "video_id": "K9gfW4ByqWo",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Greg Miller Got Married (Continued) - The GameOverGreggy Show Ep. 179 (Pt. 3)",
    "description": "Genevieve Miller joins us to tell the whole story of her and Greg's love.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1494399601,
    "duration": 960,
    "transcript_chunks": [
        {
            "text": "\"Hey, it's me Nick Scarpino, the producer. SL Sedia, hey! Did you know that we're having a Kinda Funny Live 3 in San Francisco on June 3rd? That's right, the third annual event where you can come and hang out. How do you get tickets to that? You might have just asked yourself. Well, you go to kindafunny.com/kL3, and that's where all of the ticketing information is. You put in some sort of currency, and we give you back an electronic ticket that's good for one amazing live show. Do you see behind me? That's what it's going to look like... probably better though, maybe worse. No, it's going to be better! You know what moms love? Food! You know what you love? Food! Why not make some food with Blue Apron? Best friend, I wrote this ad for less than $10 per person per meal. Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. Choose from a variety of new recipes each week or let Blue Apron's culinary team surprise you! Recipes are not repeated within a year so...\"",
            "start": 0.08
        },
        {
            "text": "pre-portion ingredients to make delicious home-cooked meals choose from a variety of new recipes each week or let Blue Apron's culinary team surprise you recipes are not repeated within a year so you'll never get bored what's cooking in May glad you asked Patreon supporter James Hastings beef teriyaki stir fry with sugar snap peas and lime rice baked spinach and egg flatbread with sautéed asparagus and lemon aioli M sounds good three cheese baby broccoli strawberry with tomato and oregano dipping sauce crispy salmon and roasted potato salad with pickled mustard seeds and some kind of sauce I can't pronounce check out this week's menu and get your first three meals free with free shipping by going to blueapron.com GGY you will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron's so don't wait that's blueapron.com Greggy what else are you going to eat a shoe so here's my question for you guys then this is the is this the first time you guys have been",
            "start": 40.88
        },
        {
            "text": "with Blue Apron, so don't wait - that's blueapron.com Greg Miller. What else are you going to eat? A shoe? So here's my question for you guys: then this is the first time you guys have been together for an extended period of time where there's no end in sight? I mean, that's a POS way - no end, no end. I always because of my travel, I always have to have an end going; I always know when I'm traveling back. But the longest time we spent together was when I took 3 weeks off last year to go on one week vacation with my sister in Hawaii and then we spent two weeks together, and then we did two weeks - yeah, Christmas time is it different or does it feel exactly the same? Exactly the same. Oh, it's yeah, it's the same; it still feels that better 'cause I don't have the anxiety of oh I need to leave; there is that impending... it still feels like it's going to end, which is weird. And then I'm going to Raleigh on Sunday and then I'm going to LA - that's different though, 'cause that ends with a GI, I had",
            "start": 93.48
        },
        {
            "text": "is that impending it still feels like it's going to end, which is weird. And I'm going to Raleigh on Sunday, and then I'm going to LA - that's different though, 'cause that ends with \"A\". I had that problem where it wasn't a no-problem but uh when she left for two years for a year and a half for uh school, there was always that like oh **** she's leaving so it was like a great week and a half and then she had to go back. But then once we moved in together, like for the first month I'd say it always felt like it was going to end, like it always felt like oh **** when when do we need **** you're nevering well Sunday before we got married on Monday and Sunday I'm like I got overwhelmed by travel anxiety, I'm like oh God I got to check in for my flight I got to pack my stuff I got to leave and then I'm laying in in bed and I'm like no I don't this is really weird it's like this school anxiety of oh God fin coming yeah the finals are coming and it's I think it's going to stick",
            "start": 149.2
        },
        {
            "text": "and then I'm laying in bed and I'm like \"no, I don't think this is really weird\" - it's like that school anxiety of \"oh God, finals are coming\" yeah, the finals are coming and it's going to stick for a while, Gia said it didn't STI (yeah), no I honestly think it was about a month and a half (yeah) and then it goes away and then it's just normal today it finally struck me of what like we did yesterday - we moved from the old apartment studio into our new awesome apartment that I'm really looking forward to, we're trying to put together as fast as possible so people can come over because it's amazing but like in it I'm enjoying it and it's awesome and like it's just great to be together and have our own space and we're building this life you know what I mean but like in the bathroom today like there's the dual vanities and this awesome shower and this awesome tub and like marble everywhere it's amazing right, there's no marble how's the shower, what's it's off slate maybe is it is there two showers",
            "start": 193.08
        },
        {
            "text": "the Dual vanities and this awesome shower and this awesome tub and like marble everywhere it's amazing right there's no marble how's the shower what's it's off slate maybe is it is there two shower thingies no just one damn it but it's it's got great power oh yeah there's so much it's blasting the poop out of my butt you know what I mean you get crap down poop in the crack scrape that peanut butter out of that thimble God damn holy crap anyways wait hold on fumble gets tight bro what's the fumble don't worry don't just keep moving don't don't don't listen keep pooping keep going it I want to know what's a word in SYM is the thing you put on your pinky when you pee so you don't poke yourself oh I guess you put on your thumb maybe which is like a dice yeah okay but it struck me today of like what's what like there's this apartment's great but there's something to it that feels familiar what is it and it dawned on me that it feels like a baller ass Airbnb cuz the apartment's that great",
            "start": 228.16
        },
        {
            "text": "what like there's this apartment's great but there's something to it that feels familiar what is it and it dawned on me that it feels like a baller ass Airbnb cuz the apartment's that great and smells brand new and it's like awesome and I'm like what am I saying is more fun for reasons exactly cuz I'm not going to clean it the bed's already broken yeah now that's just cuz we moved it improperly but no big deal you know what I mean yeah but it's like yeah it's it's awesome right now everything's fantastic right now life's great thank you for coming thanks for marrying me thanks for importing problem the Canadian Goods so I mean we still need to get you a ring I still need to get a ring but we originally our plan was we're going to do this at the courthouse wedding then do a quote unquote formal wedding later on with like the whole deal yeah but now we keep talking about how great the first wedding was cuz the wedding was awesome the wedding was awesome I'm putting up all sorts of photos and",
            "start": 277.32
        },
        {
            "text": "later on with like the whole deal yeah but now we keep talking about how great the first wedding was cu the wedding was **actually** awesome the wedding was awesome I'm putting up all sorts of photos and leaving stuff out but it's like invite your friends that's the thing right oh we got now for the record no no for the record we got **told** over in the in the way of when you go I'm going to keep going this is going to be a long topic whatever yeah end the show okay good we keep talking about us I love it one one through four all right great uh when you go online to book your San Francisco courthouse wedding you go through and you have to get the marriage license you book an appointment for that and then you book an appointment for the ceremony and when you book an appointment for the ceremony it is like very clear hey heads up you guys come to get married and you can have six people that's it no more the other ones the extras would get escorted out by the sheriff they're like you cannot have",
            "start": 314.48
        },
        {
            "text": "Is like, very clear, hey heads up, you guys come to get married and you can have six people that's it no more. The other ones, the extras, would get escorted out by the sheriff. They're like, \"You cannot have more people here,\" you cannot do this. We're like, \"Oh **** all right cool.\" And like, it was going to be the fact that... Alright cool. But like my dad's wife, we're going to have to ask to stand wherever they tell you to stand, you know what I mean? She was like, \"I don't care,\" I totally get it right. And then we got there, we meet the judge or whatever, and the judge is like, \"So we have one extra person.\" He's like, \"What do you mean?\" He's like, \"The website says six but we have seven.\" He's like, \"You can bring 400 people, I don't care.\" I'm like, \"**** God damn it.\" They would have cared though if you had brought 30 people. 400 people, you know what I would have done? Meet and greet wedding calm your...",
            "start": 350.28
        },
        {
            "text": "you can bring 400 people, I don't care, I'm like **** God damn it; they would have cared though if you had brought 30 people. 400 people - you know what I would have done? Meet and greet wedding calm your butt on Monday to San Francisco courthouse. So we got married in the same courthouse, uh, my wife and I, and we got married on one of the balconies; we had to actually like pay per chair, yeah, of people that had to come see was just standing around. What you did, you rent out the place or no? No, no, you book it by appointment so you get like an hour. You can also rent it at night, yeah, you can do a function in there but we booked just that specific balcony 'cause we you know we walked around and liked the balcony; CU, we thought it was cool. Um, and we were like, \"Hey, we want to bring\" I think I think we had 14 people just come to the ceremony itself, sure, and then we had chairs set up for them, and each chair was like $50 or something like that.",
            "start": 386.28
        },
        {
            "text": "we were like hey we want to bring i think i think we had 14 people just come to the ceremony itself sure and then we had Chairs set up for them and each chair was like 50 bucks or something like that gosh okay maybe it wasn't that much but it was you had to pay to have them lay them out and then you have like an hour there and so we were like no everyone just meet us at the reception so we had close close family and friends watch us actually get married and then everyone else was getting **** bombed at the reception already which is the **** way to do that wedding was awesome you just **** go to the reception and party it's just i think you guys are doing it right i don't think you need to do the whole we talked about throwing a cool party like what if we threw a ball ass party in Montreal hey everybody come up here's the hotel BL Montreal yeah yeah no at that point you're going to make me go somewhere I want you watch you get married you don't want to come up to Montreal first",
            "start": 428.4
        },
        {
            "text": "hey everybody come up here's the hotel BL Montreal yeah yeah no at that point you're going to make me go somewhere I want you watch you get married you don't want to come up to Montreal first off think about it this way Kev big Kev dog you're going to go up there it's an easy sell we let's say we do a fall party of next year the leaves are changing color there's a whole bunch of new stuff to see you bring Po bear up there you're telling me Po bear is not going to like this your money is twice as worth much yeah it's true Putin man we were in Vancouver there's this place where you throw axes I'll take two hamburgers all right you won me over we're going to go to the axe-throwing place yeah we will yeah you kidding me now they don't they tell you you have to sign a waiver saying you didn't drink beforehand they don't breathe Alize you let me tell you from the horse's mouth so you're fine you're not supposed to say that they can't try me I'm over here to expedite",
            "start": 464.2
        },
        {
            "text": "drink beforehand they don't breathe Alize, let me tell you from the horse's mouth, so you're fine, you're not supposed to say that, they can't try me, I'm over here to extradite no, no, expedite, no, that's what I got hung up on Deport, no, EXtradite, try to extradite me, I dare you. A throwing Place, pretty sure we have a really good relationship with Canada, I think we extradite people all the time, that's why people don't go hide in they're not coming from you, they got nowhere to hide, other places like Mexico party. Well, our wedding was great because we didn't talk about getting engaged and stuff like that; we didn't talk about the wedding and stuff. The wedding was awesome, I cannot get over how great our wedding was, it was amazing. My vote is you guys just throw a badass thing, I you you go away for a second, someone announces you guys, you walk in, you do a fun dance over don't worry it's going to be great. How much money do I have to spend on the LED walls? Uh, I don't know, depends cool who's",
            "start": 501.44
        },
        {
            "text": "go away for a second someone announces you guys you walk in you do a fun dance over don't worry it's going great how much money do I have to spend on the LED walls uh I don't know depends cool who's sponsoring it who's buying tickets Dejour Douro pizza oh my God yes I love this wedding a Douro wedding we can't let uh what's his name got uh Taco Bell Dan got Taco Bell we can't let that stand we have to get JJ I'm so proud of what about a Tim Horton's wedding a what a Tim Hortons wedding yes too bad Tim Horton you listening we went to Vancouver my wife's like what the **** who the **** is Tim Hortons and why is he everywhere and I'm like it's like Canadian Starbucks except they have Starbucks also very hard D exactly but no the wedding was great um so the idea was you brought in your mom and sister I brought in my mom my dad his wife I'm good no uh in po everybody knows Po long time fans know Po he's been in the show lately with the Back a wrestling talk and all that ****",
            "start": 545.28
        },
        {
            "text": "your mom and sister I brought in my mom, my dad, his wife. I'm good, no uh, in po everybody knows Po, long time fans know Po; he's been on the show lately with the Backlog Wrestling talk and all that. Yeah, and it didn't dawn on me how awesome that would be for a while of having everybody together cuz it was cool to have them around you know people started rolling in Friday Saturday, the rest of them came in went to a dinner Saturday that was lovely Sunday went up to Napa did a wine tour which I had never done before that was fun like we had our personal shuttle bus yeah yes that sounds horrible personal short bus we had cheese on it we had a whole bunch of wines on it uhhuh Portell was allowed to come yeah he was very excited he was he was allowed to come yeah yeah yeah he was having a blast but then Monday we were going to get married and it turns out there's not much for me to do on the morning of my wedding cuz like she's got to get ready and do all this different stuff I bum",
            "start": 586.2
        },
        {
            "text": "a blast but then Monday we were going to get married and it turns out there's not much for me to do on the morning of my wedding cuz like she's got to get ready and do all this different stuff I bum around I had to go to Nordstroms I got a shirt yeah I was walking out of nord's room saw a jewelry store and I remember oh probably should do something special for her it's it's this day bought her this thing she doesn't even have a ring Infinity Stone - it's an Infinity uh symbol yeah with some stones in it but we can call it Infinity Stone and then yeah eventually Shark Finnegan calls me yeah and he's like hey I'm coming over to take the photos I'm like great and he's like problem though it's gridlocked and a bunch of streets are shut down we're all staying at the W Downtown because it's close to City Hall it'd be easy I want everybody in one central location and we're all waiting in the lobby to leave right well we're getting ready dude he calls me he's like I'm just going",
            "start": 632.56
        },
        {
            "text": "close to City Hall it'd be easy I want everybody in one central location and we're all sending in the lobby waiting to leave right well we're getting ready dude he calls me he's like I'm just going to go to City Hall CU I'm not going to be able to get to you in time and then get to the wedding at two and he's calling me at like 1250 I'm like oh okay let's get everybody else or not yeah 1250 I'm like let's get downstairs I try rally troops get him down there we get him down there and then I look walk out to Third and I and third's just closed and it's jammed it's gridlock on Howard and I look up at Market and there's all these protesters walking down Market and it's the May Day protest that I did not know was happening and I was like holy **** **** like everybody get Ubers we get I I talked to Waze like do you guys have those cars sometimes hotels people they have the cars they can just take you like no they're like you should walk up and take BART and I'm like that's a bridge too far",
            "start": 670.96
        },
        {
            "text": "to WP like do you guys have those cars sometimes hotels people they have the cars they can just take you like no they're like you should walk up and take BART and I'm like that's a bridge too far for me right now her in this beautiful wedding dress her awesome Aome shoes me and my awesome Converse shoes I'm not going to do this you know what I mean so order these Ubers the Ubers come climbing them she we split yeah she goes with her family and po I go with my family I have her cell phone in my pocket so I'm sending messages to PO that are being communicated to her and like it's just like a nightmare shout out to my Uber driver though Gam shout out to Gam Gam what up did so many illegal things to get me there I got in on the front seat with my dress and my bouquet and he's like oh my goodness this is my personal mission today and he got me there moments man now in a similar vein let's take a moment to curse our Uber driver from a week earlier where on Thursday my birthday",
            "start": 708.64
        },
        {
            "text": "oh my goodness this is my personal mission today and he got me there moments man now in a similar vein let's take a moment to curse our Uber driver from a week earlier where on Thursday my birthday we went to pick up my marriage license from the house book my Uber we go downstairs we climb into the Uber Uber goes he hit you know the thing goes now you're going to City Hall and the guy looks at and he goes no don't do it and we're like what he's like you're going to City Hall don't get married and we're like bro we're going there to get our marriage license he's like I'm so sorry I'm so oh my God I'm so and like no it's funny we that sense of humor but man what a what not a good time what an inopportune moment to make that joke **** bad thing to say probably never going to make that joke again so meanwhile my Uber driver we all just look like we're dressed in the nines you know I mean there's no easy way to look at a dude and be like oh you're getting married or whatever so he's just",
            "start": 749.8
        },
        {
            "text": "again so meanwhile my Uber driver we all just look like we're dressed in the nines you know I mean there's no easy way to look at a dude and be like oh you're getting married or whatever so he's just driving fine he's doing fine just not being crazy but I'm going back and forth with po where I'm like we are if we get to 9th and we still can't take a right we have to bail out there and walk across the protest holding hands I'm like they're they're nice protesters you know what I mean they're doing it for the right reasons they'll see what's happening and let us go but then I'm trying to figure they're a block down still and I'm trying to figure out how we're going to meet up and do all **** finally they start the protest abruptly stops that's good enough for us or whatever when I'm talking to sh shark shark's like I'm there but the protests are here I'm like **** BL we get there we're a little bit late but it doesn't matter because it's a city hall nothing runs well you know what I",
            "start": 795.68
        },
        {
            "text": "to Shark Tank, it's like I'm there but the protests are here, I'm like **** BL, we get there, we're a little bit late, but it doesn't matter because it's a city hall, nothing runs well, you know what I mean. Get there, uh, meet up with everybody, go through, get the thing, sign the paperwork, you sign the license, do all this cool ****, meet the judge, he's nice, has a British accent, which I think is weird for an American judge. Did you do it? No, I did not do the Oath of Office. Please, I'm here. Here's the thing: I would not dare **** with the judge who's about to marry me. Shout out to Sean Finnigan again, though. So he's like, \"Like the way it works is like the judge signs your marriage license and then he's like, 'Cool.' Where do you want to get married?\" Shows us the map. He's like, \"I'll meet you there. I'm going to do four other people and then just go boom boom boom and finish them all.\" I'm like, \"Okay, great.\" So we go over there; we're taking photos with Shawn, an amazing photographer for real. Like when we were like... we're getting",
            "start": 826.68
        },
        {
            "text": "people and then just go boom boom boom and finish them all I'm like okay great so we go over there we're taking photos with Shawn, an amazing photographer for real like when we were getting married we want a photographer like it's got to be Sean, I love Sean's work I always tell people afterwards I always forget like when Sean is doing not candids when he's doing like a posed thing like when he does like the Kinda Funny photos we take or whatever I forget how good he is at telling you exactly what to do and like totally not worrying about your feelings or what you want and I was like so like when we're waiting for the judge to come and Sean's like all right sit there Greg lean back a little bit more, art perfect move this hand do this, all you like we're just puppets but he makes great looking photos like awesome not everyone's used to that it turns out though so judge shows up I'm like oh **** it's time we stand up we go over there judge walks up he's like",
            "start": 864.08
        },
        {
            "text": "but he makes great-looking photos, like awesome, not everyone's used to that. It turns out though so Judge shows up, I'm like \"oh, it's time we stand up.\" We go over there; Judge walks up, he's like \"do you want your family up here?\" And we're like \"yeah,\" and Sean immediately is like \"okay, family, uh, we need a half-circle behind them. Judge, you're going to be down here, you guys are up there, and there are stairs.\" And the judge is like \"whoa, whoa, whoa, you want me to be here and them behind me?\" Sean's like \"yeah,\" and he's like \"I'm a short guy already. I'm gonna look so short.\" Sean just looks him in the eye, the camera just looks him in the eye, and goes \"you don't matter; family up here.\" The judge is just like \"oh, all right.\" I was like \"Fast Forward six months from now when Sean has a speeding ticket, and that's the Judge. Oh, who doesn't matter now?\" Yeah, exactly. Thanks for watching this episode of GameOverGreggy. Sorry, it was all about me and Jen.",
            "start": 898.56
        },
        {
            "text": "from now when Sean has a speeding ticket and that's the judge, oh who doesn't matter now **** yeah exactly again thanks for watching this episode of GameOverGreggy sorry it was all about me and Genevieve subscribe here support us on Patreon there go watch other videos over here and then there's always this mystery link that I forget what it does what does it do I don't know click on the mystery link where is it going to take you oh games kind of games go to KindaFunnyGames that's a good Channel to subscribe to",
            "start": 935.16
        }
    ]
}