{
    "id": 2633,
    "video_id": "x3d2MWyHQEo",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Do You Replay Games? - Kinda Funny Gamescast Ep. 120 (Pt. 2)",
    "description": "Are there any games we replay often?\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/kinda\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1494937801,
    "duration": 1052,
    "transcript_chunks": [
        {
            "text": "will there be exclusive births will there be special guests the answers to these pressing questions will be answered at Kinda Funny Live three be there Kinda Funny calm / KFL do we get your ticket now boy this episode of Gamescast brought to you by MVMT Watches they found on the belief that style shouldn't break the bank the watchmakers goal is to change the way the consumers think about fashion by offering high-quality minimalist products at revolutionary prices MVMT watches started just $95 dollars at a department store you're looking at four hundred to five hundred bucks but they figured out a way to just cut out the middleman and make everything way cheaper providing the best possible price which on classic design quality construction and that style minimalism everyone's always talking about you can probably stop being late to that thing that you're always late to and hey you might as well look good doing it get 50% off today with free shipping but and free returns",
            "start": 0.0
        },
        {
            "text": "always talking about you can probably stop being late to that thing that you're always late to and hey you might as well look good doing it get 50% off today with free shipping but and free returns they're going to move in watches calm / kinda that's MVMT watch is calm / kinda join the movement let's operate the day take I want to talk about replaying games okay what you guys are stance on this cm I'm glad you brought this topic up take you note for Kevin he'll get mad whole thing you know alright cuz I saw you playing with the pin I thought you are all set to do it you're actually pointing towards it I want to tell you something to the pen great look for you uh-huh this is a good look at hosting Kinda Funny Gamescast yes we feel a bit more I'm all fidgety what the **** is up with this fidget stuff by the way you know what I'm saying yeah we put up an article like with a bunch of links to fidget stuff and people just keep buying them what Mike did stuff so you know people get all",
            "start": 36.75
        },
        {
            "text": "fidget stuff by the way you know what I'm saying yeah we put up an article like with a bunch of links to fidget toys and people just keep buying them what Mike did stuff so you know people get all anxious Wow like that cube that distraction I got a thousand of them though yeah they just I don't think I've ever seen a product blow up overnight go this viral out of like from 0 to 60 and there's people buying a thing yeah you know I'm seeing every single picture on the Internet turns out 2017 is the year of everyone becoming anxious your center line yeah as I said I strained my back walking over and he had one even shown it to me alright that was actually a magic trick oh my wallet and Prada like Wyden replaying is yeah I hate you up about this yesterday cuz what happened is I I don't know your guys' distance on it and what your history is with it for me it was last night the excitement of getting my Minecraft Switch code and the email in the emails downloading",
            "start": 89.76
        },
        {
            "text": "Is I don't know your guys distance on it and what your history is with it for me it was last night the excitement of getting my Minecraft Switch code and the email in the emails downloading and then be like wow am I really gonna play Minecraft again? Like I could play it on Vita, I saw them, I got the Platinum in that. I could go chip away at that but is this one better? And but then it was just whole thing of like well what about replaying games in general and not even Minecraft - granted every world can be a different experience but what about like I'm like I can't wait for Super Mario World whenever they get that on the eShop for Switch. Like I've played that a million times, I've bought it many times, I think every time I buy it I probably play less and less. I just like having it and it's the same thing like PaRappa the Rapper - he's here and Little Big Planet goes out this week and what that means Patapon me I'd be commenting which is a different story because we'll play the **** out of Hatoful Boyfriend",
            "start": 131.4
        },
        {
            "text": "same thing like PaRappa the Rapper 'he's here and LittleBigPlanet goes out this week and what that means Patapon me I'd be commenting which is a different story because we'll play the **** out of Hatsune Miku: Project Diva on everyone will won't they do buy new and get one for the Vita the problem but I want to know like I even made a joke on the old shows you know old game is old or I don't want to play the game that I played before I don't know how you guys turn down well especially this year it's almost it's I feel bad if I'm replaying something I feel bad cuz I'm like I still haven't gotten to me oh yeah I still haven't got Dante with your two games like right at the hop there that I need to play I want my new game um and we're about to get into like I need to play more of Prey I'm going to **** around once and Justice for a little bit and then all of a sudden we blink in its Fall yeah and so going back and playing like Destiny, Larry at IGN talks about he played Mass Effect 3 130 times every time as a man",
            "start": 167.91
        },
        {
            "text": "and justice for all, and then all of a sudden we blink in its fall, yeah. And so going back and playing, like Destin from IGN talks about, he played Mass Effect 3 thirty times every time as a man, which I found flabbergasting. I was like, how did you not accidentally create any time to hear any different dialogue or do something bad? Say, hey, you know your favorite game of all time - you've played it twenty-nine times. One slide, you can plan a little bit differently than an external... it yeah, when the journey Wanderers naked this time, oh yeah, yeah. The rigor mortis, yeah. Um, and so like in my mind, especially longer games, I don't really play that being said there are probably ten games I replay on a yearly basis. Really, Journey is probably the most recent one, okay. Uh, but a lot of mostly Super Nintendo games you mentioned - Mario World, it's Super Mario World, The Legend of Zelda: Link to the Past, Super Metroid, Earthbound, Chrono Trigger - like these are games I go back to literally annually, really. Um, and then why what.",
            "start": 202.21
        },
        {
            "text": "Nintendo games you mentioned Mario World, it's Mario World, the Link to the Past, Super Metroid, Earthbound, Chrono Trigger - like these are games I go back to literally annually. Really, um, and then why what brings you back to him? It's I still do think the Super Nintendo is the best console of all time. I don't think I don't I feel like I don't say games peaked there but my personal taste in games not just peaked there - like I I don't think there will ever be a better Mario, Zelda, or Metroid game than those three as much as I love Breath of the Wild; she gets like a genre-defying game. Um, so I go back to there it's comfort food, it's knowing exactly what to do. I go back and play Banjo-Kazooie because it is it's muscle memory - like we played through all of Banjo Kazooie a year and a half ago on Christmas it was me Andrew and Alana and we played through the entire thing and got 100% and didn't need a guide, it was just like I remember doing this. I've done this enough; it's familiar and then the other",
            "start": 251.86
        },
        {
            "text": "it was me Andrew and Alanah and we played through the entire thing and got 100% and didn't need a guide it was just like I remember doing this I've done this enough it's familiar and then the other reason I replay games is this is to show someone something sure look if I start dating someone it's like I want to show them PT or I want to show them Catherine or The Walking Dead but other than that like I'm never going to go back and replay a 100-hour RPGs that's the thing when like you know one with the trophy little pop for like whatever weird Japanese RPG gene it is like played three times per season the hour the whole the other week yeah well yeah so Adam **** persona yeah yeah I can't find ya exactly I can't carve out any time I get to act like our 30th out there playing it twice yeah that's the thing I'm with you on it's just like it's so hard to sit there and be like I feel guilty playing more Persona because I feel like I'm missing so much now that the wheel was starting to turn",
            "start": 295.06
        },
        {
            "text": "the thing I'm with you on it's just like it's so hard to sit there and be like I feel guilty playing more Persona because I feel like I'm missing so much now that the wheel was starting to turn again let alone the things I left in late Dawn's dry like Neo was never for me but near Near since we did as a Square Enix stuff and I saw that for the first time really I was like near **** that game was haha yeah and now I get to fight the Square Enix CEO but yeah here's that game this year everyone most so many people are sleeping on like not on purpose but just on the fact that Horizon and Zelda and Metroid came out in that right in there but it's also of that quality though that's what everyone is saying I want so many people I trust online are like Patrick Leyden growth so much about me yeah like this is **** game of the year material and this is so insane Anteed play I love her Glenn yeah I'm all about it but I also don't play super long games begin wins like I think that it has like Zelda",
            "start": 336.75
        },
        {
            "text": "this is **** Game of the Year material and this is so insane Anteed play I love her Glenn yeah I'm all about it but I also don't play super long games begin wins like I think that it has like Zelda is the obvious thing for me where my messing a lot of time into that game Horizon I just try to do bare minimum just beat it I had a great time doing that but I don't think I'll ever replay Path of Exile you know like that's yeah yes experience that I need to go they added new Game+ - oh right in the update yeah hard mode native hard mode mode get her a new game plus it you can continue playing ok I have to be different because I technically your safe point before Ganon you can't say Dr. Ganic **** yeah oh well against the boss you know video yeah but I'm when you wear annually I'll play through a whole bunch of games most of the Mario's like the old mines a one two three world Star Fox 64 is on that list for me I go back to Pokémon Red and Blue and Gold and Silver really oh yeah man I",
            "start": 375.18
        },
        {
            "text": "a whole bunch of games most of the Mario's like the old mine's a one two three world Star Fox 64 is on that list for me I go back to Pokémon Red and Blue and Gold and Silver really oh yeah man I just love those you replayed Monika came to three yes and I yeah and I replayed them you know no I'd recently replayed that am I going to do this again yes I am yeah I totally am and I most the time I replay a Pokémon it's on an emulator of some sort like I remember for a long time with my PSP I had a Game Boy Advance emulator yeah I could use turbo mode so just it would speed things out yeah because the old Pokémon games are real oh yeah well but I think at the beginning that that fat that'll fetch out at PS2 ID Mr. Mason misstep Pika - I missed at Sonic Miss Fat Albert Luigi oh yeah I don't think I ever exhibit I need to re I think the game that I replayed be most is Super Mario 64 yeah I go back to that at least maybe not all the way through but the first half of that game like the first half of the levels",
            "start": 421.86
        },
        {
            "text": "I need to re-think the game that I replay most is Super Mario 64, yeah, I go back to that at least maybe not all the way through but the first half of that game, like the first half of the levels, I replay those things so much. That's really funny you say the first half because I could be encyclopedic about 100% of the first probably six worlds in Mario Oil, but if I got to like that there's one where we have to raise and lower the water, I probably haven't played this on that luck, yeah, definitely. I remember this one, it's the best thing is like, cuz, yeah, it gets progressively the levels get less and less interesting in Mario, suited for but that's story-related, anyway. On but I think the games besides that because those are kind of just played through them, the games I go back to play the most are things that don't really have a story or narrative at all, so Amplitude, Tony Hawk's Pro Skater, sure, like I love just going back and skating around for 15 minutes. I wonder when I think back in like the stories",
            "start": 471.57
        },
        {
            "text": "don't really have story or narrative at all so Amplitude, Tony Hawk's Pro Skater - sure, I love just going back and talking around for 15 minutes. I wonder, when I think back in like the stories were telling here right? The game I've replayed the most then is Metal Gear Solid 2: Sons of Liberty because I went that way. I don't always make the comment that you know it if it had a platinum, I would have it talking about back in the day - sure. Because I mean I played that thing non-stop and there was a moment where because I wanted all the dog tags, I want to know the ghost pictures, wanted all stuff and I remember playing freshman year college she's playing it over and over and over again getting everything and then getting furious when my years later my other college roommate borrowed it and came back with a different memory card in it - **** where's that never started and you kind of find them all of it was gone but it's like I never needed it again but I wanted it kind of thing while",
            "start": 517.44
        },
        {
            "text": "came back with a different memory card in it **** where's that never started and you kind of find them all of it was gone but it's like I never needed it again but I wanted it kind of thing while moving I finally looked down and tossed out my EA Sports PlayStation 1 memory card that had all my playstation 1 like Spider-Man says and like I'm never gonna be a cop don't worry about but that one was like there's this moment where Greg called me back in when he was finally playing it and it was like I'd already done the whole planning of it and I was in a friend's room and I walked him through I'm like wait what difficulty playing on he's like I'm sorry there's gonna be two more guards I left off they're gonna be here in the gym here and dadada and I hang up and the one guy was like what's wrong yeah how do you know and I'm like I wanna see it all yeah but I wonder as we talk about it how much for doers and even younger kids if they're still replaying the games they got because remember",
            "start": 552.75
        },
        {
            "text": "yeah how do you know and I'm like I wanna see it all yeah but I wonder as we talk about it how much for doers and even younger kids if they're still replaying the games they got because remember for us it was like you get a game on your birthday you get a game at Christmas then you gotta scrimp save whatever cut lawns go to fun : and make all these horrible trails to make sure you get that chance I wonder if that's happening if it is games are so easy because it's like the digital everything is made everything so easy to get more users games are cheaper you can download free games on your phone yeah dollar game that's amazing so many more distractions now for free as well I think also there's a difference though between replaying a game over and over and over and over and over again back to back and replaying annually right sure the different conversations because then the the latter is going back to some share whereas when you're a little kid and you only have Frogger",
            "start": 588.18
        },
        {
            "text": "back to back and replaying annually right sure the different conversations because then the latter is going back to some share whereas when you're a little kid and you only have Frogger, The Great Adventure on the PlayStation 2 oh yeah like my brother you get addicted to that Shaky played that Mark Echoes getting up like you know what's damn business yeah you love that game we got Uncle she got up he got so up yeah but like I like those games there's a ton that I just replayed the hell out here's what we had yeah but yeah I mean going back to stuff like Metal Gear Solid 4 is one that I would never necessarily want to replay the whole game yeah but just there's certain parts yeah I think I never want to replay the first segment but I'm like I always want to go back and replay that European noir one mmm the second one ended in the motorcycle chase yeah and there's like I want to be like Raiden and I want to go back to Shadow Moses like yeah like that stuff it's so awesome but you",
            "start": 626.13
        },
        {
            "text": "European noir one of my favorites, the second one ended in a motorcycle chase, yeah. And there's like I want to be like Solid Snake and I want to go back to Shadow Moses, like yeah, that stuff is so awesome, but you have to get through so much. Also, there's no way to play Metal Gear Solid 4 once you've got a PS3, which is the better one, yeah, they need to fix that. Dude, I mean, I guess the thing for me is just the fact that like I don't know, I want to replay games and I just can't because I feel like for me games are my main source of entertainment in the same way I don't like rewatching movies because I know what's going to happen. You don't like re-watching movies, no, I used to as a kid watching them in real time, it's like now it's fun to go back, you know? I popped in Metal Gear Solid: Twin Snakes a couple of weeks ago and I was packing because I was like, \"Somebody had mentioned I'm like, 'I haven't seen that forever'.\" And I popped back and I'm like, \"I didn't remember seeing it word for word,\" but games are the way when you're cool.",
            "start": 668.19
        },
        {
            "text": "I was like somebody had mentioned I'm like I haven't seen that forever and I popped back and I'm like I didn't remember seeing foreseen and it word for word but games was the way like when cool here's the HD Batman collection your enemy no **** yeah or you know I mean whatever I mastered at Batman: Arkham Asylum, I got a few hours in which is deeper than I normally get anything like yeah whenever it's like the times they've re-released Peace Walker with trophies and like I'm like in my head I'm like **** yes finally my favorite game of all time and then I popped on a playing like and something comes out of your distracted and it's over yeah and we live in a world now where remasters and just up res games and remakes and later are just so constant where it really does put this top of the test of what are we willing to replay and right aren't we there's certain games Metal Gear Solid 2 comes to mind and and three as well and Final Fantasy X and X-2 where I love this",
            "start": 706.02
        },
        {
            "text": "this top of the test of what are we willing to replay and right aren't we there's certain games Metal Gear Solid 2 comes to mind and and three as well and Final Fantasy X and X-2 where I love this game so much on PlayStation 2, so right when it's like oh man there comes there's HD versions of them and they're coming to Vita I'm like oh man I'm definitely in but yeah I remember playing Final Fantasy X and thinking I would give anything to play this portable yeah like if that would have happened oh my god I'd put so much time into it and then it happens I played the first five hours and I couldn't keep going that was I felt the exact same way, I'd love Kingdom Hearts 1, 2, and Birth by Sleep and they you know they came out this year on PS4 the entire thing and like I really feel like I'd be bad at my job if I put a hundred hours into these games and someone's like did you play it I'm like no no I can't and the same thing with Final Fantasy XII is coming out this",
            "start": 746.1
        },
        {
            "text": "like I'd be bad at my job if I put yeah hundred hours into these games and someone's like did you play near I'm like no no I can and the same thing like Final Fantasy XII is coming out this summer and that's my levity I lost my favorite game of all time, not in my mind yeah it's it's all the bottom sixes I go 12 9 6 ok yeah ok yeah yeah I pick it up and I'm not done with Final Fantasy XV yet because I've got a group like Banjo-Kazooie's uh top song Fancy Gates of all-time number one was Fall 2012 no it was Six and then XII and people were very mad at that and that was because Greg and I led that meeting exactly we both really it was we were biased exactly denim jackets good ideas handsome face get out of here leave good-looking son of a **** yeah the ninth oven was just furious because she's a XII fan yeah yeah we got the photo shoot today but then the Sun for me Crash Bandicoot N. Sane Trilogy comes in in the summer and I'm deaf I'm playing the **** out of that game yeah I get to",
            "start": 786.06
        },
        {
            "text": "She's a 12-year-old, yeah, yeah, we got the photo shoot today, but then the Sun for me, Crash Bandicoot main trilogy comes in this summer and I'm deaf, I'm playing the **** out of that game, yeah, I get the Platinum is achievable, I'm doing that, yeah. See that's what scares me about it all is, is how many times I've been stoked about something coming out like Bastion coming to Vita and I love that she and I played, I reviewed Bastion on Xbox and lost different stuff and played through it on Vita, and then one was like, \"All right, cool new game+ that's just like who you know,\" and I'm gonna take a break never come back, yeah. You know, I mean so like now that Patapon is coming, it's like I hope that I've taken so much time off of Patapon let alone Patapon One the enemy but then I do have a feeling it's going to be all the changes that were made for Patapon to Patapon 2 that I love so much they won't be there in one. I'm like, \"Yeah, put some trophy gnar,\" is like sort of worried as I am to replay games just for",
            "start": 835.05
        },
        {
            "text": "to be all the changes that were made for Patapon to Inori that I love so much they won't be there in one I'm like yeah put some trophy gnar is like sort of worried as I am to replay games just for that one reason i rewatch my favorite shows all the time I've seen Long Live the Queen a thousand times I've watched Lilo and Stitch seven or eight times and it came up four or five months ago yeah since one of the things like if I love a movie or TV you know I will just constantly watch it and force people in my life to watch I wish I wish I had that thing because they were the thing you're like when Smallville came on though you know here's every episode and I was like yeah an IV on Drew Infamous a comment I was like I'm gonna watch every episode and put up a review on the blog LS every any was like no you know like no I'll bet a pizza on it and I made it like four episodes in and I'm like cool I don't know I remember all this really well I don't need to be Rihanna forms of then you got stitches",
            "start": 872.79
        },
        {
            "text": "know like no I'll bet a pizza on it and I made it like four episodes in and I'm like cool I don't know I remember all this really well I don't need to be reminded then you got stitches your side slow down at Tom Welling going a little too fast there yeah I remember when they'd be released Devil May Cry HD collection I loved DmC one specifically ps2 era and three and I played a little bit Michael it's like it's something about I do we play a lot of games for a little bit just get a taste and sort of remember it right yeah like when they released Prince of Persia trilogy in HD mm on PS3 with a 3D mode that was garbage I'll remember 3D mode yeah and that trilogy is one of my favorite gaming trilogies of all time and a lot of people only like the first one I like all of them and when I was replaying it I beat the first one started playing through the second one despite really liked it I just I'm not gonna keep doing yeah totally gives you I started to realize I'm just doing it to",
            "start": 915.18
        },
        {
            "text": "I was replaying it, I beat the first one started playing through the second one despite really liking it, I just... I'm not gonna keep doing yeah totally gives you a bad reason to be no. Do we get anything and people like people right into Beyond Good and Evil all the time and be like \"like what are your thoughts?\" I play through half a day and I'm not liking it but I should finish it, right? And my thoughts... I know, like when you're tired and just like it's totally fine to bounce. Like, you're not doing a disservice to anyone and time is like the most valuable commodity we have. I feel like at least for me personally, money is probably the most valuable commodity, and so the second most valuable. And I'm like halfway through something and not feeling it as long as I don't get in trouble for work, I'm like \"yeah yeah fine, bouncing yeah yeah.\" So we're playing games, we bounce with it, we bounce with it now really. I bet you guys do you feel",
            "start": 964.5
        },
        {
            "text": "and not feeling it as long as I don't get in detention for work I'm like yeah yeah fine bouncing yeah yeah so we're playing games we mess with it we mess with it now really I bet you guys do you feel like you've replayed it I've worked with it I didn't run in there I shake my head and walk away an exam you refill next time I see you tweet about replaying the game on the same time again with it again I wanna confirm your action or if their effectiveness Shuhei Yoshida is fearless and put a item from this number one please list on PlayStation 4 please someone listen also a Sucker Punch Productions video go there making something or it's gonna call famous yeah it's a Nashville yeah yeah do it totally into it you can click here for more game stuff you click there for more non-game stuff you can click here to support us and guess what's over here I don't even know myself",
            "start": 1004.62
        }
    ]
}