{
    "id": 2663,
    "video_id": "Y6pHEY8iY5c",
    "show_name": "AMA",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Ask Kinda Funny Games Anything: May 2017",
    "description": "Greg answers Patreon questions.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1495904402,
    "duration": 1656,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to Ask Kinda Funny Games Anything for the month of May 2017 if you've ever watched one of these videos, the idea is simple: you ask us anything and we respond. But what happens is over on patreon.com/KindaFunnyGames - I guess Patreon.com/KindaFunnyGames now you can't just go to Patreon.com and expect to find this post without doing some research. Patreon.com/KindaFunnyGames, we post over there saying \"Hey it's that time of the month: Ask us anything.\" We put it up in the beginning of the month, you guys see who's going to be on the show - it's me or Tim Gettys or Nick Scarpino or Andy Cortez or any these other different people - and then you post questions there. And then at the end of the month we answer those questions here in this video that you're watching right now. So this is the games version; there's a Kinda Funny version over on YouTube.com/KindaFunny, that's about all I have to say about that. Let's get to the questions. First question from Patreon.com/KindaFunnyGames comes from Joey Finley",
            "start": 0.16
        },
        {
            "text": "of funny version over on youtube.com/ KindaFunny that's about all I have to say about that let's get to the questions first question from patreon.com KindaFunnyGames comes from Joey Finelli or fine no Finelli is what we're going to say Finelli Joey says what is one video game you never finished but wished you had I'll give you two the knee-jerk reaction was Vanquish played Vanquish liked Vanquish then I was late to the party Claudio (corrected from \"Clen\") was always talking about how great Vanquish was when I finally sat down to play Vanquish I might have been for game of the year when we were back at E3 and it was like okay cool I'll play it played a little bit of it loved it loved what I played never got back to it just went on vanish not a long game I could get back to it the real answer real answer straight up answer Catherine (corrected from \"Katherine\") from the Atlus team over there an Atlus game came to PS3 was awesome the problem with Catherine was it's really long like a lot of the games from Atlus",
            "start": 39.32
        },
        {
            "text": "up answer Catherine of course from the Persona team over there an Atlus game came to PS3 was awesome the problem with Catherine was it's really long like a lot of the games from Atlus Persona team and my problem was that I started it loved it played a whole bunch of hours of it and then went on a work trip for like it might have been E3 I was like gone for a long time I want to say I was gone for a week and when I came back I could not remember how to play cuz Catherine's **** hard is a really really hard and it's like you know building the puzzle or whatever climbing up the things you had to use like the tornado method I remember for these different blocks I totally **** myself was mult I want to say 30 hours in and did not remember how to play anymore and I didn't want to restart it and I didn't want to sit there and struggle and watch tutorials or whatever and so I just was like **** bye Catherine and never ever picked it up again never beat it feel like a horse's",
            "start": 86.64
        },
        {
            "text": "\"Restart it and I didn't want to sit there and struggle and watch tutorials or whatever, and so I just was like 'bye Catherine' and never ever picked it up again, never beat it. Feel like a horse's ass for that one; CU (Catherine) was so good, and I would like to have beaten it, but I didn't. But maybe one day it'll get a PS4 remaster. I don't want to play through it on PS now, but I could do that too, I guess. Right, it's probably on there; I think it's on there. Uh, Srahman says 'I know this question has been asked so many times, but I would love an in-depth opinion from my homie Mr. Greg.' I honestly have absolutely zero hype and no reason to purchase an Xbox. I own a PS4 and Switch, and their software is killing it, especially on the PS4. Do you honestly believe Scorpio will move numbers without any new and solid IP? And is Xbox in trouble? I don't ever like to say Xbox is in trouble; Xbox is in a very precarious and interesting position. The problem they face right now is as we know go down...\"",
            "start": 127.44
        },
        {
            "text": "any new and solid IP and his Xbox is in a very precarious and interesting position. The problem they face right now is as we you know go down, we're heading here, we're on the road to E3, all the sites like to tell you Scorpio is going to be revealed there's great things about it. The thing is that they've kind of **** it up in the way that I have an Xbox one, I like it fine, I bought it knowing it'd be like my exclusives machine and I'd play you know mainly on my PS4 for trophies and now with my switch I'm playing on the road all the time. The problem is that just cancelled games and the exclusives they have put out haven't been like the best thing in the world in terms of reception or critical praise or moving numbers, you know, I mean Halo and Gears don't do what they used to in terms of market share mind share, they do really well in terms of numbers we've seen the MPDs we've seen those stats um but like Quantum Break right was a new IP",
            "start": 170.92
        },
        {
            "text": "don't do what they used to in terms of market share mind share they do really well in terms of numbers we've seen the MPDs we've seen those stats um but like Quantum Break right was a new IP I was super into it a lot of people weren't it it granted it was still a hold over of like the old Xbox One mindset of TV and games merging into one experience I think that burned a lot of people and that's why when Phil Spencer came in was able to you know turn it around make it about games again but the fact of the matter is what do they have for games this year right like E3 is is riding on Crackdown 3, Sea of Thieves, and State of Decay 2 I love State of Decay 2 I don't I mean it's going to be hard to be like here's the Xbox one here's why it matters state of decay 2 I love it I love state of DEC 2 or what I love State DEC we'll see if we can actually do that um the real trouble they have is yes what how what all this means to Scorpio cuz it's all inter related right I of of course uh pulled",
            "start": 219.4
        },
        {
            "text": "what I love State DEC we'll see if we can actually do that um the real trouble they have is yes what how what all this means to Scorpio cuz it's all inter related right I of of course uh pulled the trigger right away bought my Xbox one day and date had it on launch day you know had the PlayStation 4 on launch day I wanted all that stuff and like when they released the Xbox One slim right I wasn't like oh I need to go get that of course not I mine works and even if it didn't I don't play it enough to justify getting another one right now and so I think that's what they're going to be at with Scorpio is the fact is you know today on the morning show somebody was asking me about do you think Crackdown is going to move over to be a Scorpio game uh ditch the whole idea using the cloud to make the game better and use the core processing and tera flops of the Scorpio you can't do that because then you are into the Wii U Zelda situation right like well sure Zelda should have just been put",
            "start": 260.0
        },
        {
            "text": "the game better and use the core processing and tera flops of the Xbox Scorpio you can't do that because then you are into the Wii U Zelda situation right of like well sure Zelda should have just been put on switch probably but you can't offend every Wii U owner who bought it for that reason or held on to it for that reason E3 not only at E3 does Xbox have to say here's a Xbox Scorpio and here's why it's awesome they have to say here's what's coming to your Xbox One Making Xbox One still relevant so that you're not burned by Xbox and then go **** Scorpio cuz that's how it could go right is if box doesn't have big announcements and doesn't have big games and doesn't have any Goodwill going into the Scorpio launch why would anybody buy Scorpio right now I'm at the fact of like do not knowing what Scorpio is is Scorpio just a PlayStation 4 pro at which point I wouldn't be super interested in it to begin with or is it like truly another step iteration whatever the **** you want to call it um",
            "start": 299.8
        },
        {
            "text": "Scorpio is a PlayStation 4 Pro at which point I wouldn't be super interested in it to begin with or is it like truly another step iteration, whatever the **** you want to call it. Um, they have to do two things: they have to support two platforms and they have to knock it out of the park on both of them. I think if you know Scorpio is just a more powerful thing, it's the next Xbox but it's not the next Xbox, but there's going to be games that are amazing on it, but you know what I mean? Then it would have been a slam dunk in the same way it should have been a slam dunk for PlayStation 4 Pro, but the messaging was so hard now the messaging is even harder on the Xbox side because it is how do I message this while also saying that everything's great over here like do you come out and hand and be like yeah we've canceled some games we've done that but we have like five exclusives are going to blow your mind here they are and then they look",
            "start": 340.0
        },
        {
            "text": "Here like do you come out and say \"hat\" and hand and be like, \"yeah, we've canceled some games. We've done that before.\" But we have like five exclusives that are going to blow your mind here they are, and then they look better and run better on Scorpio - kind of thing. I don't know, it's just that they're not in trouble; they're just... they can't afford to make any mistakes at E3. E3 has to be from top to bottom \"awesome\" on the Xbox front, otherwise it's going to sting even worse than a normally bad conference where like, \"oh, PlayStation had a better conference,\" Nintendo did something cool. This has to be, \"hey, we're proving the validity and reason you have these two different platforms on the market why they matter.\" It's a tall order, I think Phil Spencer and his team are up to it. I think they are smart folks; I think they have a good eye for games. I like the team... and so you'd like to think that there's just a lot of stuff behind the scenes in terms of like we have this, we have that.",
            "start": 375.68
        },
        {
            "text": "they are smart folks I think they have a good eye for games I like the team uh and so you'd like to think that there's just a lot of stuff behind the scenes in terms of like we have this we have that let's get ready get all the ducks in a row and then come on execute it3 and that's why it's been Quiet on the Western Front in terms of well what is what it crack down in State of Decay that's fine but what is the next big Xbox thing we'll have to wait till E3 and find out Nicholas Price says hey Greg you often mention you would make a kick-ass Superman game what would your Superman game look like Nicholas Price this is an old long running kind of funny not gag I should say but idea of hey I want to make a Superman game and I want to make a pitch video for it very much like uh Max Landis's pitch videos when he pitches a movie or something or when he did the Death and Return of Superman not that comedic and fun because I don't want to have that much time but I actually want to stand and do",
            "start": 411.36
        },
        {
            "text": "Ask Kinda Funny Games Anything: May 2017. Greg answers Patreon questions.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\nCheck out our store! http://www.kindafunny.com/store\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters\n\nvideos when he pitches a movie or something or when he did the Death of Superman, not that comedic and fun because I don't want to have that much time but I actually want to stand and do a teleprompter read of what my Superman game is so I'm not going to show you my hands here I'm not going to tip my cards but that video is still on my to-do list I will make it, I'd like to say I'll have it by the end of 2017 but you know what **** it we'll have it by the end of 2017 for you I'll do it for you Nicholas Price. It will happen, I will not let the video go to the darkness Morgan K gave it a tip, Morgan K left a comment on this here Kinda Funny Patreon Q&A ask me anything Hey Big Sexy O congrats to you and your Lady Marmalade on recently tying the knot wish you both all the happiness in the world smiley emoji thank you very much if you don't know I married love of my life Miller, um now with the Switch being out and having a lot of time with it have you touched your Vita.",
            "start": 451.28
        },
        {
            "text": "happiness in the world smiley emoji thank you very much if you don't know I married love of my life Greg Miller um now with the switch being out and having a lot of time with it have you touched your Vita since do you think it has replaced the greatest handheld on Earth what I'm really trying to ask you is dot dot dot is the vita dead to you love you Morgan Morgan the Vita is not dead to me the Vita will never die to me very excited to have Oceanhorn on it now I have that uh other game crap I got Oceanhorn and then there's the Rose in the Twilight is that right I've had it on my desk forever but I have a digital code version of it both of those are on the vita locked and loaded ready to go the real reason my Vita so answer your question have a touch my Vita since the switch came out I've touched it to move around I haven't touched anything to play it time's been so scarce in this run up to Kinda Funny Live three to getting married to moving to business changes to everything else um gaming has",
            "start": 494.4
        },
        {
            "text": "to move around I haven't touched anything to play it time's been so scarce in this run up to Kinda Funny Live three to getting married to moving to business changes to everything else um gaming has been very limited which I hate and so when I'm on the road usually I'm working on planes now or sleeping uh when I when Mario Kart first got it was just switched then I had Zelda and stuff like that uh I've let that be the thing Vita is usually with me it's just not getting played but now that there are things that I need to play on it I need to get to it I need to get that Oceanhorn going on it Vita is not dead to me I don't think Vita ever will be dead to me I just got uh the Vita mag the the one I like it's called the Vita mag uh they put out their uh one of their special editions that's the hundred greatest V games and they ranked them all I don't agree with they're number one Killzone: Mercenary guys come on uh and Persona 4 Golden number two come on but even paging through that there's a bunch of stuff",
            "start": 541.04
        },
        {
            "text": "greatest V games and they ranked them all I don't agree with their number one Killzone: Mercenary, guys come on uh and Persona 5 number two come on but even paging through that there's a bunch of stuff on there that I haven't played that's just in my back catalog that I you know either haven't played it or didn't get it or whatever so I need to go through and see that but the video will be around for me a long time you know what I mean because I think that's the the upper hand it has on the Switch is the fact that there's just such a vast library of V games to play Still, and so while the Switch gets its legs and gets and then eventually gets its arms um you'll still kick around the VA I'll still kick around the VA that's what it's all about **** I love the VA what a great system you know Josh M hi Greg congrats on the marriage it's heartwarming to see you two so happy I'm generally a PlayStation and Xbox guy but I got a Switch release day and I am loving it I am surprised by",
            "start": 579.72
        },
        {
            "text": "Josh M hi Greg congrats on the marriage it's heartwarming to see you two so happy I'm generally a PlayStation and Xbox guy but I got a switch release day and I am loving it I am surprised by a couple of things though the first is no trophies I'm not a big trophy or achievement guy but I think it would be awesome to get some little award when playing especially once they finally roll out Virtual Console games the second is more dealing with online play I know it was announced before but no chat in 2017 is crazy playing Mario Kart 8 or Splatoon with regular audio chat would be awesome I'm also shocked by how poor the servers seem Mario Kart 8 online disconnects especially when compared to the PS or Xbox one so my question is this are these things we should be dismayed about I love the switch and hoped and hoped it was big end finally coming into the present with some of these issues I'm not so sure I feel like once online play is money they need to be held to the same standard as",
            "start": 620.16
        },
        {
            "text": "switch and hoped and hoped it was big end finally coming into the present with some of these issues I'm not so sure I feel like once online play is money they need to be held to the same standard as Xbox One or PlayStation or PSN or Xbox Live thoughts in general thank you for thank you for time Greg much love to you in the entire Kinda Funny fam Josh well no Josh thank you uh you raise good points I think it is also one of those things of what matters to you as a gamer really um the trophies Achievement System not being there right for me I it always seemed like a no-brainer to have it there then they didn't do it and I was always I personally love the mind of like all right whatever like like I love trophies on the PSN I don't really care about my Xbox achievements so getting switch achievements I don't think would have changed that for me in terms of like oh man I'm enjoying this so much more Mario Kart having you know gold Marios and all these different things to go through",
            "start": 664.8
        },
        {
            "text": "I don't think would have changed that for me in terms of like oh man I'm enjoying this so much more Mario Kart having you know gold Marios and all these different things to go through and hang gliders and cars and stuff like that that motivates me to play that game over and over again right uh so and I I just want to get invested in it again uh trophies are where I'm going to be invested but even that I feel like again as I was talking on this video about being short on time now it's one of those things I hit Level 30 in trophies and like that was a good round that is a good round number to the point of I was playing Marvel Heroes Omega this weekend or whatever right and it wasn't until like five hours in I like what trophies look like because we talked about those in the morning show and I was like I'm not going to ever Platinum this game but now that I'm playing it I'm invested what else do I need to do and you pop and you look at him but it's like now for me that Boulder is",
            "start": 708.76
        },
        {
            "text": "and I was like I'm not going to ever Platinum this game but now that I'm playing it I'm invested what else do I need to do and you pop and you look at him but it's like now for me that Boulder is rolling up the hill that's such a steep incline of like well you know it's takes a lot to move the percentage points when you get that high in Trophy levels it's like that's a good number for me not that I'm saying I'm leaving Trophies by any matter I'm just not froing at the mouth to go get him in the same way I was but that es and flows there's times where I think I'm totally done like oh whatever and then soon then I'm playing Coffin Dodgers at 4 in the morning why easy Platinum I don't know what the hell's wrong with me so for the Nintendo side it didn't matter to me um I understand why matters to some but I think clearly as it's the best-selling Nintendo console they're talking about right it's doesn't matter to the majority of people that's not something there and also I kind of find",
            "start": 746.88
        },
        {
            "text": "to some people, but I think clearly as it's the best-selling Nintendo console they're talking about right? It doesn't matter to the majority of people that's not something there and also I kind of find it liberating after being so addicted to trophies on PSN that I don't have to worry about that on on Nintendo but that's just me in terms of the online play yeah online's got to get its act together it's ridiculous like when that thing disconnects or does whatever or drops and it right now it's kind of like ah whatever I'm playing a handheld and it's dropping whatever it is going to be crazy when I'm paying for it and that's happening then yeah that can't happen and it's the same thing The Voice Chat thing doesn't matter too much to me when we play you know when I'm playing online I'm usually doing it for a stream with the kids so I'm playing on Discord anyway so I have everybody there to talk to but it is kind of weird that it doesn't have it built in but Nintendo's always been",
            "start": 778.44
        },
        {
            "text": "usually doing it for a stream with the kids so I'm playing on Discord anyway so I have everybody there to talk to but it is kind of weird that it doesn't have it built in but Nintendo's always been family oriented blah blah for me it's for me it is the idea of it having being a shitty service and not connecting that's the big tech problems rather than the missing tech features are more offensive to me especially when you start paying but we'll have to see what happens when we get there also hopefully this isn't what they Envision for switch online it's just like hey we put it over the Mario game this is how the online's always work now we're just going to move it over there but who the **** knows Casy \"Coyote\" or Casy Coyote however you want to pronounce it do you and Jen Miller play Co-op multiplayer any games together often or do you game separately have you Overcooked or Mario Karted together yet and how quickly do you think it will tear the two of",
            "start": 813.4
        },
        {
            "text": "St Miller aka Tim Gettys play Co-op multiplayer any games together often or do you game separately have you Mario Karted together yet and how quickly do you think it will tear the two of you apart well Tim and I were in a long distance relationship for quite some time so in terms of do we play a lot of co-op games together we haven't no what we're more inclined to do is uh one of us plays and the other chills out and like if like so this past weekend right uh I wanted to play more Marvel Heroes she's like that game is not interesting to watch I will not watch you play that you can play that when I do something else instead how about what what else do you have and I'm like I have Prey and she's like I start Prey and so I'm playing through Prey with her next to me you know reading or checking her every so often but more importantly watching it talking to me like oh what's going to be that you know do you think you're in space yeah that's early Prey stuff and so like we",
            "start": 853.6
        },
        {
            "text": "or checking her every so often but more importantly watching it talking to me like oh what's going to be that you know do you think you're in space yeah that's early price stuff and so like we enjoyed that uh Mario Kart we have played together when I when I went and picked her up in Montreal and then flew back we spent that six hour plane ride with the switch in between us me on the Pro Controller her on the you know joycon grip uh playing and having a great time so we do that um but I think yeah I think it'll be it's going to be interesting as you know our relationship evolves and our marriage matures to see who who plays what and when and you know I are we going to play like stuff like Borderlands together again or what like I know she wants me to play she had started at her uh place back home with her roommate her roommate was playing Resident Evil 7 she was watching along with that while he played it I think she wants me to jump back in because she wants to see how it ends so I",
            "start": 898.12
        },
        {
            "text": "back home with her roommate, her roommate was playing Resident Evil 7; she was watching along with that while he played it. I think she wants me to jump back in because she wants to see how it ends, so I need to play Resident Evil 7 again. Which then I thought maybe I'll get trophies and then I was like maybe I'll Platinum it and then we're right back to the last topic where I say I'm over trophies but I am thinking about that, but that's a lot of work, but we'll see. Uh, I don't think it'll tear us apart cuz this just how it is. I mean she you know sucks it up during Mario Kart when I'm just destroying her, but you know she feels good when she gets second place in that game cuz she understands I'm a Mario Kart God as so many of you do as well because you've seen the skills, you've seen me clown out people, you've seen me destroy just every competitor ever possible on Twitch. Next up Jason Bond says do you think Nintendo will ever pull the trigger and just turn Mario Kart into",
            "start": 938.56
        },
        {
            "text": "clown out people you've seen me destroy just every competitor ever possible on Twitch next up Jason Bond says do you think Nintendo will ever pull the trigger and just turn Mario Kart into Nintendo Kart I feel like it's getting closer I feel like it's already getting close to this and would meet an Ever larger an Ever larger audience than it already does this is something I honestly this is going to sound stupid I know this is such an In The Weeds video game thing that we worry about that I don't think the general public has any idea that it's not Nintendo Kart especially now with Link and everybody else being in this uh you know Mario Kart 8 Deluxe I as a Mario Kart fan I never it never even really dawned on me that like oh right like Smash has all these characters that are from different Nintendo properties and this one's sticking to the Mushroom Kingdom until recently and so I don't know if there's other people out there who are really worried about that because carts",
            "start": 972.88
        },
        {
            "text": "different Nintendo properties and this one's sticking to the Mushroom Kingdom until recently and so I don't know if there's other people out there who are really worried about that because Cart's just so much fun in terms of what it does and how it plays right I think the next Cart you see yeah it'll be like this from the GetGo you'll have Link and stuff in there and it will be Nintendo Kart but I don't think they're going to change the name I just don't think that enough people are hung up on \"Wow, man, Nintendo Kart\" that means I can't be the Ice Climber or Mario Kart I can't be the Ice Climbers why you know what I mean like I don't know if you'll ever see Go full Smash but I think you'll continue to see the walls fall down I think it'll be majority Mario people but one day it'll get there, Hey Greg hope you and the crew are having a good day been editing this question a couple of times now with no question feeling right was going to ask about VR but questions just feel",
            "start": 1019.2
        },
        {
            "text": "there Israel C hey Greg hope you and the crew are having a good day been editing this question a couple of times now with no question feeling right was going to ask about VR but questions just feel forced so screw it I'll just go with the flow here what game unexpectedly captured your heart and left you feeling all warm inside I would say Puppeteer for me so Charming would have been a good PS4 launch title but tech-wise I can see I can see why they went with neck but Tech wise I think you're trying to say I can see why they went with the PS4 controller oh man what game unexpectedly captured her see I don't know if unexpectedly is ever the right word right because unexpected I have to know so much about games the retired answer is gone home I've talked about that a million times that I knew nothing about gone home played gone home by the end of it was like holy **** went and hug the ex-girlfriend like I like not she was my ex at the time went and hugged her right because I was like whoa this",
            "start": 1050.96
        },
        {
            "text": "about Gone Home played Gone Home by the end of it was like holy **** went and hug the ex-girlfriend like I like not she was my ex at the time went and hugged her right because I was like whoa this just touched me in a very interesting way uh but then I mean the other one that jumps out is Unfinished Swan but I had been following the Unfinished Swan's Journey right for so long that I thought that game was going to be right up my alley and be special and sure enough when I sat down to play it it was um those are the two answers but they're tried and true trying to come up with something new something clever something you haven't heard when I think about like games that touch me I'm like a that those are what comes to mind right yeah yeah I think that's them those the games sorry if you've heard those stories before uh Christopher Jay Brennan hey Greg congrats on getting married thank you I'm going E3 next month and was looking for tips General tips",
            "start": 1096.16
        },
        {
            "text": "them those the games sorry if you've heard those stories before uh Christopher Jay \"Brennan\" hey Greg congrats on getting married thank you I'm going E3 next month and was looking for tips General tips on Surviving E3 tips on what to do in LA tips on places to eat Etc should IO should I avoid eating at the convention not price-wise but quality any Insider info on what there is for the general public to do at E3 possible to get into Sony conference on Monday night lots of questions but trying to plan ahead of time appreciate the advice 1,000% do not eat at the conventions Center they have a little food court right out in front do not eat there now if you're in a pinch you you're in between appointments or something like that they do a taco truck they have a whole bunch of food trucks actually but the taco truck is one I can swear by uh so you got the Food Corp right out in front of the main hall then you'll go out and there's the back alley that connects both the Halls you'll see a whole",
            "start": 1136.16
        },
        {
            "text": "but the taco truck is one I can swear by uh so you got the Food Court right out in front of the main hall then you'll go out and there's the back alley that connects both the Halls you'll see a whole bunch of food trucks there they will be mobbed with people all the time you have to wait in line a long long time but that's better than the food court um if you want to go the opposite direction go to LA Live you can go to The Carver they got that roast beef sandwich some steamed broccoli you're feeling good it's a good meal again Line are going to be out the door for all these places it's E3 it's a convention everybody's going to be crazy there um inside information what the what there is for general public to do at E3 I have no idea I was talking to people at E3 about this it's going to be very fascinating to see how this goes for the general public at E3 I have a feeling if",
            "start": 1177.44
        },
        {
            "text": "general public to do E3 I have no **** idea I was talking to people at E3 week about this it's going to be very fascinating to see how this goes for the general public at E3 I have a feeling if I was a betting man I think majority of people are going to come away not angry but not fulfilled by this experience because you're not getting the E3 you think you're getting you're like you said like how do you get in the Sony conference Monday night uh Sony usually does a whole you can line up outside and they let select number of fans in the blog will have the PlayStation blog will have information up about that but that's the thing is like your ticket doesn't get you into the conferences once you're on the show floor you're on the show floor but most of the stuff You' want like really want to see is going to be behind closed doors and I I don't even mean like behind closed doors like hey a you know the Press is going to go see this theater demo of Uncharted 4 stuff like we did last",
            "start": 1214.2
        },
        {
            "text": "to see is going to be behind closed doors and I, I don't even mean like behind closed doors like hey a you know the Press is going to go see this theater demo of Uncharted 4 stuff like we did last year that Scarpino built a room for um that's another level I mean you're going to get to boo and it's going to be like literally like a bunch of doors closed in your face like CU, a maybe a few games outside but even those games outside there's a giant line for for normal E3 let alone now general public E3 and the the things on the floor for you to walk up and play like the Sony Booth are never like the hot thing they showed to the conference in terms of like triaA games you're going to walk up and it's going to be like The Ane Trilogy for Crash Bandicoot, which is fine and good and you know the indie games and all these little things they're doing not the big games so I don't know what your E3 is going to be like I don't know if booths and uh companies are taking it",
            "start": 1253.88
        },
        {
            "text": "the indie games and all these dumb not dumb the little things they're doing not the big games so I don't know what your E3 is going to be like I don't know if booths and uh companies are taking it seriously enough with a number of tickets sold to make a big presence about oh here's our public area here's how this works here's what goes on here I think it is going to be the thing that you're going to hear a lot of stories of people who are getting on a machine whatever but then they you know whoever from KitKat is coming by they get to cut the line because they have to talk about it and they have to do all this different stuff it's going to be Maybe I'm Wrong maybe it'll be a really well oiled machine everybody's going to have a great time to play everything you want to I don't know I know Koei's doing the LA Live stuff over there there's like panels and stuff that's super interesting but it's this weird thing of e3 isn't PAX Pax is all about the consumer and all about you going there and",
            "start": 1290.24
        },
        {
            "text": "Greg's doing the LA Live stuff over there, there's like panels and stuff that's super interesting, but it's this weird thing of E3 isn't PX Pax is all about the consumer and all about you going there and having a great time and everybody wants to give you freebies and take care of you and do that. I don't know if that same vibe will be at E3 because E3 has been for so many years the professional show, this is what's happening we're talking about the future of our industry and I don't know it's going to be interesting to see how business meets fandom here and what it actually comes out as Nicole Humphrey gave a question here and says hi Greg, oh and sorry Christopher said your other question was anything to do in LA. I don't know, no, I have nothing to tell you because E3 is not a fun trip for us, it's fun as see a lot of video games but it's wake up go to the conference run back to the hotel go out to some event that night probably have a few too many drinks with some people at that event or",
            "start": 1325.08
        },
        {
            "text": "it's fun to see a lot of video games, but it's wake up go to the conference run back to the hotel go out to some event that night probably have a few too many drinks with some people at that event or somewhere else pass out wake up and do it all over again do it all over do it all over again and then fly home so like I've never actually just bummed around downtown LA and had fun I know there's a Ralphs down there that I've bought stuff at before podcasts uh the Carver is good there's a The Tonga Room I think's there I've gone to parties there but like I don't like it oh there's a good taco truck not there's the taco truck in the back of E3 and then there's the JW Marriott on the corner across the street is an empty lot it's very scary but there is a taco truck that parks there often and it's good not great but after I won that game award and I I went back there I got **** drunk as **** at that Game Awards I stumbled out of the Game Awards and went over there and got a",
            "start": 1365.2
        },
        {
            "text": "there often and it's good not great but after I won that game award and I I went back there I got **** drunk as **** at that game WS I stumbled out of the game ws and went over there and got a burrito for like 2 in the morning burrito it was good french fries in it Nicole Humphrey hi Greg what's your naughty bear in other words the game you know is terrible but still enjoy playing I I think it's my mind it's not tip my tongue recently I think Marvel Heroes Omega right Marvel Heroes Omega not a bad game but it is just bashing the **** out of all these enemies right these waves and waves of enemies just it's like Dynasty Warriors right I'm just getting my level up so I get to a new power so I can do this it's not a bad game but it's like a game where it's like junk food where I'm just like I'm playing this and I'm having fun I'm just enjoying leveling up and doing all this different stuff it's not at all about a story or a narrative or gameplay or anything it's just like it's",
            "start": 1411.48
        },
        {
            "text": "just like I'm playing this and I'm having fun, I'm just enjoying leveling up and doing all this different stuff. It's not at all about a story or a narrative or gameplay or anything; it's just satisfying to do this. But it could be a mobile game; it could be a million different other things. It's just I'm playing it; I'm just doing it; I'm enjoying it while I do it, but it's empty calories. I'm not walking away like, \"Oh man,\" I'm not neglecting Persona to play it right, and clearly Persona is gameplay and story and graphics, and it's all this complete package of awesomeness. Whereas Marvel here is like, it's fun to be uh Jane Foster and throw Thor's hammer around and kill things and just do it over and over and over again, always getting a little loot, a little bit better, and debating if that stat buff's good enough, and watching my XP grow; it's just being goofy; I'm just a goon. Final question comes from RJ Davis hi if you could only play one game for the",
            "start": 1454.24
        },
        {
            "text": "bit better and debating if that stat buff's good enough and watching my XP grow it's just being goofy I'm just a goon final question comes from RJ Davis hi if you could only play one game for the rest of your life which one would it be but once you beat it and replay it you would forget everything in the game and it would be a brand new experience H interesting interesting interesting i' probably go Infamous: The Original (cuz I) I loved playing that so much especially when I didn't know what was around the next corner uh I love comic books as you know I love the presentation of that thing I love the story I love the story of the game that'd be fun and I I would say I would take it away and say not beating it but uh 100 pering it platinuming it because I enjoyed getting that platinum and I always had such great memories of trying to find that last blast shard because Infamous one didn't have a way to find blast",
            "start": 1493.04
        },
        {
            "text": "100 percenting it, platinuming it because I enjoyed getting that Platinum and I always had such great memories of trying to find that last Blast Shard because Infamous One didn't have a way to find Blast Shards um like other than you could pulse for him but it wasn't like obvious you know what I mean and I'll never forget at IGN, taking digital photos of my TV screen and then going home with a red marker that night and graying out buildings or reading out buildings as I went and staying up to like way too late couldn't find it had the whole map you know crossed out and the next day coming to IGN I was bitching about it showing somebody and I just happened to pulse and I saw it off in the water I was like ran over there got the Platinum freaked out I at the time I was the first person to platinum it's now somebody on PSN profiles has it before me I don't know how they did that voodoo magic cuz PlayStation confirmed on Twitter at the time that I was the first person to do it and it",
            "start": 1541.0
        },
        {
            "text": "to platinum it's now somebody on PSN profiles has it before me I don't know how they did that voodoo magic cuz PlayStation confirmed on Twitter at the time that I was the first person to do it and it was a big deal for me that's it ladies and gentlemen thank you so much for asking your questions remember if you want to be part of the show you can go to patreon.com/kindafunnygames or patreon.com/kindaFunny if you want to ask kinda funny questions uh you go over there first of the month or first week of the month we put up these things saying hey this is who is going to be on they ask us anything you leave your questions then we make this video then we put it up you hear your name read aloud on youtube.com/kindafunny or kindafunnygames you get your question answered everybody has a good time you help us make the content I got to go get ready ready for KindaFunnyLive 3 if you're watching this before June 3rd shake that beautiful ass over to San Francisco kindaFunny.com",
            "start": 1577.92
        },
        {
            "text": "has a good time you help us make the content I got to go get ready ready for KindaFunny Live 3 if you're watching this before June 3rd shake that beautiful ass over to San Francisco KindaFunny.com KFL 3 come party with us if you're watching after KindaFunny Live 3 I hope it went really well and nobody died until well it's going to be morbid if somebody dies isn't it shouldn't have said that probably people always say that oh you're feel bad if somebody dies now I'm like not really I I'm not God and it's not like I willed that to happen I hope nobody gets a million dollars at KindaFunny Life not if somebody gets a million dollars is KindaFunny Life I i' made that happen cuz I'm God now if both of those things happen then we got to talk about what I should and should not be wishing for at the end of ask me anything videos bye",
            "start": 1613.64
        }
    ]
}