{
    "id": 2006,
    "video_id": "cgDUxnRS9Zc",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "G.I. Joe and Star Wars: Nick's Toys - The GameOverGreggy Show Ep. 142 (Pt. 3)",
    "description": "Nick's mom finally sent all his childhood toys to SF. Let's go through them!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1472108401,
    "duration": 1427,
    "transcript_chunks": [
        {
            "text": "Kinda Funny Studios is brought to you by Deus Ex: Mankind Divided, now available on PC, PS4, and Xbox One. This new critically acclaimed entry into the Deus Ex universe once again has players taking on the role of Adam Jensen with an all-new arsenal, state-of-the-art weapons, and augmentation. See what all the excitement is about at dx.com. Nick, yes, what's your topic on this beautiful set you made? Uh, one of the fun things about the set is that we got to decorate it. Um, and this just happened to be one of those rare coincidences in life where uh, you just... it's Kismet, uh, in that I was having a Superman character, yes, exactly. Uh, Tim and I were having uh lunch with my parents down at Comic-Con and my mom mentioned, \"Hey, we still have all your old toys. Would you like them?\" And when my mom says that, what she really means is, \"I'm going to throw them out. Get your stuff out of the house! Get your stuff out of the house!\" She was like, \"We have a big Darth Vader thing,\" yeah, that's what the quote was, so I was like...",
            "start": 0.04
        },
        {
            "text": "really means is I'm going to throw them out get your stuff out of the house get your stuff out of the house she was like we have a big Darth Vader thing yeah that's what the quote was so I was like yes I want them because we're building this set and I think it would be awesome to maybe decorate some of the set with some of my old toys um and also please don't throw them out so called my brother and said yo mom's going to drop off he was actually going to drive the truck up with all the set components like two days later they were loading it so I'm like this might work out perfectly now granted it stressed Matt out a lot because I didn't exactly tell him what was happening she just showed up with him it was kind of fun and then she was already mad because she didn't get a hold of him but she didn't try it doesn't matter um long story short is they brought all my toys up and I thought I'd share some of those with you starting with some of the ones are on the set right now which you can see",
            "start": 54.28
        },
        {
            "text": "Try it doesn't matter, um, long story short, is they brought all my toys up and I thought I'd share some of those with you, starting with some of the ones are on the set right now, which you can see right here. Are all my Ninja Turtles right? So you've got Casey Jones; Splinter's behind him over there, but Splinter doesn't have his outfit; he's just a naked rat. He's butt-naked. Nobody actually has Splinter's outfit; that thing gets lost every week. Why are you making them naked? That's how everyone's Splinter looks, as SP condition sir. If I'm down, if I'm down, if Splinter... if I went into my dad's attic and got my big Ninja Turtles bag, I'd have a Splinter right all set to go. You know it's funny because your memory; you know they say in crimes, you can't really rely on eyewitness reports, not that great, right? Cuz your memory is different; you remember things differently. I remember having all of the uh the original Ninja Turtles right. What I didn't realize until I unpacked them was...",
            "start": 82.96
        },
        {
            "text": "Great, right? Cuz your memory is different, you remember things differently. I remember having all of the uh the original Ninja Turtles - Leonardo, the original Donatello, the original Raphael, the original Michelangelo, Mike, and some weird ass knockoff version of Donatello that's way bigger than the others. I can't even explain it. It looks like the movie version - no, remember when they put out the movie ones that had like the liver spots on them and stuff? Yeah, yeah, that's gross. What's this thing? Oh, it swims! Put him in the paint can. No, it's going to take all the paint off these things are like be careful don't touch your eyes after this. By the way, something happens to this rubber after 20 years that it becomes toxic - like I went home after we put these on and my whole face was...",
            "start": 125.56
        },
        {
            "text": "are like be careful don't touch your eyes after this by the way something happens to this rubber after 20 years that it becomes toxic like I went home after we put these on and my whole face was itching oh deal it's probably some ancient **** disease that you left behind on the toys they thought it was gone forever all right let's **** let's get to let's let's get I'm going keep pointing so we've got some other stuff we got some Robotech stuff back there we got some other stuff originally from the house um but this is the stuff that I didn't put up because I couldn't bear to part with it these are my G.I. Joe yay also when your mom said she was going to bring your toys I did not expect four giant crates and this well you have to remember also that my brother Greg what are you doing to there what's happening you put you're rubbing mint on yourself Jesus Christ uh you got to remember I had a brother so we had years of years of collecting these toys so a lot of these were mats as well um",
            "start": 170.72
        },
        {
            "text": "what's happening you put you're rubbing mint on yourself Jesus Christ uh you got to remember I had a brother so we had years of years of collecting these toys so a lot of these were mats as well um like half of these are probably mats cuz we just you know whenever one kid got a toy the other kid has to inevitably get a toy Storm Shadow Mark I there you go right here Storm Shadow Mark now I noticed that a lot of your guys are wobbly I dropped the back I feel so bad for you guys like these were the toys you dudes these are **** awesome Cobra Officer 1983 these are like the these are the 5-year-old children versions of to I was going to say look at this guy just touching his dick and he's got no definition he's got no articulation Barbecue they're three and a third in why cuz that's the that's the way that's the way they are I only **** with 6 in I know you had two frog men it's god-given right you have two frog men I do yeah awesome Destro here you go duplicates you can trade those in yeah this",
            "start": 211.24
        },
        {
            "text": "That's the way they are, I only **** with 6 in. I no you had two Frogmen. It's God-given right you have two Frogmen. I do. Yeah, awesome Destro here you go. Duplicates, you can trade those in. Yeah, this is the original Destro isn't that amazing? Now you asked another question, Colin. You said this is where all of the G.I. Joes are, but wear all their weapons. Yeah, their weapons in there. You have some backpacks, but we the weapons in the backpacks. My dad uh in in an attempt to save all of these toys kind of brought them together cleaned them all up did some surgery on them so you'll notice some of their legs are actually pretty tight cuz he put new rubber bands in there like new rubber washers in there found the right size washer which was amazing um and then separated all of the smaller weapons so they didn't get lost into Tupperware so I'll grab those right now. Oh, I thought you to say they threw them away or something two Cobra officers actually one's a Cobra one's a Viper and one's an",
            "start": 253.48
        },
        {
            "text": "so they didn't get lost into Tupperware so I'll grab those right now oh I thought you'd say they threw them away or something two Cobra officers actually one's a Cobra one's a Viper and one's an officer just look at the years of course this does blow my mind though this like three and three-fourths this is my favorite these look like McDonald's this is my faite these are all the uh Zartan cat ladies here weapons I well you kept you kept the um the things that the weapons came on I guess I don't know so you guys remember that the the weapons used to come on these like these trees and you pull them off so it would be they kind of look like weapon crates at that point right and you could see like the Ninja Turtles having their swords and shields hanging on them all right so here's something interesting that I didn't",
            "start": 285.76
        },
        {
            "text": "They they look like weapon crates at that point right, and you could see like the Ninja Turtles having their swords and scabbards hanging on them all right. So here's something interesting that I didn't realize until just right now: if you see this toy above my shoulder right here, yeah, that is what I thought was a Veritech fighter from Robotech; turns out it's not because it came with this Transformers figure, which is a Transformer, which is very weird. I don't know why it has that logo on it, that is clearly its packaging. That's Garak, that's that's one of the configurations of a Veritech fighter. Interesting, yeah, I mean Super Veritech malfunction. So here's what: so here's what I respect about your GI Joe collection; I have I have I have a I have most of these M.A.S.H. and I would say and and I have many you have two Bats by the way as well. Bats were Mars corporation's robotic soldiers, of course. I remember um what I'm impressed about with this is your GI Joe vs Cobra",
            "start": 336.16
        },
        {
            "text": "I would say and and I have many you have two bats by the way as well bats were Mars corporation's robotic soldiers of course I remember um what I'm impressed about with this is your G.I. Joe 2 Cobra balance and you have all the Dreadnoks as well which I which I think intentional so you know here's one you have uh Zartan in here somewhere you have the you have Buzz Saw in here somewhere as well is the Baroness in there I don't think you have the Baroness I think I had the bar I could have SW I had the Baroness but I could this is uh Cobra Eel I think right here here's another one Buzz Saw Snow Job this was this was uh uh wasn't uh didn't um Paon Rob Paulsen that's was his character what up Rob MH Snow Job see look look Jet Fire looks a lot different than that yeah that Jet Fire looks sad as **** yeah looks like you remember Beetlejuice Beetlejuice when Al Pacino's face got pulled out but here's what I don't understand is they must have bought the license from uh from Harmony Gold",
            "start": 383.16
        },
        {
            "text": "yeah looks like you remember Beetlejuice, Beetlejuice when Al Pacino's face got pulled out but here's what I don't understand is they must have bought the license from uh from Harmony Gold because look up Veritech fighter I mean it's me to turn into jets it is exactly the same color it looks exactly the same I mean it's from 1984 look I'll maybe maybe it was beforehand maybe Robotech ripped them off jacked so I'm going to bring out I'm G I want to pull out a few of the famous Joes and I want to see and Cobra I want to see if you guys I'm sure Nick will know another one of the I have no idea about any of these no God that's Sergeant Slaughter, ni Ser Slaughter you have half of Duke the rest of the Duke it's in here somewhere I think in the Tupperware this is Stalker Mark One right he came with a boat didn't he I don't even know who the hell that is I think he came with like an actual like small boat oh we have some of the actual Vehicles as well Lady Jay, Lady Jay",
            "start": 431.8
        },
        {
            "text": "one right he came with a boat didn't he I don't even know who the hell that is I think he came with like an actual like small boat oh we have some of the actual Vehicles as well Lady Jaye look at her look at her little legs give her a shake yeah they're a little loose right now they're not supposed to be like that they didn't what are you doing to Splinter are you making him uh is this a wrestling move or a sex move no it's a sex move it could be if did look like a Power one of my favorite GI Joes is Dial Tone Dial Dial Tone was uh and both of his thumbs are broken Dial Tone which is was when I when you broke a thumb on a GI Joe it was like the end of the day I had to like go to bed when I broke a thumb on a GI Joe because you're putting weapons that they uh Dial was like a Communications expert for GI Joe but I want to find this guy was my favorite and I can't remember his name be be is that Snow Job Beach Head I think this is Beach Head Lady Jaye so so the funny thing and what",
            "start": 473.6
        },
        {
            "text": "Expert for G.I. Joe, but I want to find this guy was my favorite and I can't remember his name - be he is that Snow Job, Beach Head, I think this is Beach Head Lady J. So, so the funny thing and what you should do with this, that's what he, that's uh Roadblock, Roadblock, yeah, uh, what you should do. So there's a really awesome website it's been up since I was literally in middle school, it's called YoJoe.com, it's insane how **** comprehensive it is, these beautiful shots of every one of them from 82 to 94, all angles, all their weapons, all their file cards, like different variations and you can go on, they have this cool thing where it's like look at you know you the famous G.I. Joe movie, you look at the inside of the leg and you can see the date from the wave that they're from, you start you start there and then and sometimes it's on their butts for a lot of guys that came with vehicles it's actually on their asses um and then you look and you can start like narrowing down who the characters are.",
            "start": 509.8
        },
        {
            "text": "and then and sometimes it's on their butts for a lot of guys that came with vehicles it's actually on their asses um and then you look and you can start like narrowing down who the characters are and then you can look at them you can see what variation you have and then you can see what weapons you have with them or whatever like this is Beach Head's original backpack for sure no way 86 has bro this one's just made in Hong Kong I'm guessing all of them were here's man there he is his belly is hanging out this is the wrong legs your dad put the wrong legs on this one this is not his leg his legs how do I know his legs say GI Joe on them he's he's a mercenary he's a bad guy mer well L did the best he could he didn't really watch the original series oh no this is Beach Head actually I think they're both Beach Head they might be both variations that's Beach Head for sure I could SAR I had Storm Shadow be one I had Quick Kick he's in there somewhere you have you had this dude was my",
            "start": 551.12
        },
        {
            "text": "think they're both Beach Head, they might be both variations - that's Beach Head for sure. I could see Storm Shadow being one, I had Quick Kick he's in there somewhere. You have you had this dude was my favorite, who the hell was this guy? I love the way this guy looked. Oh um it's a it's a technical name sci-fi maybe. I think I think that's Sci-Fi, there's Sci-Fi Mark 2, he came with a little satellite dish - was this guy's story that he got pulled through like a Time War, that's Cross Country. He's a mechanic, he looks like he's a Civil War soldier who got like sucked through and then had to keep fighting. Scooch a little in cuz you're profile and I'm not and I I don't like that just come this way yeah there you go restart the show yeah can we restart what's up everybody W so Nick there you go I like that so you know how this is all owned by Hasbro yeah so I've been reading Transformers Comics forever and currently the the Run they've been doing the last couple years has been fantastic of",
            "start": 581.88
        },
        {
            "text": "I like that, so you know how this is all owned by Hasbro, yeah? So I've been reading Transformers comics forever and currently the IDW run they've been doing the last couple years has been fantastic. Of course, they need to mess that up because they're comic books, so they're like, \"Oh man, we need to have a shared universe thing too.\" So now there's a freaking comic event coming up called Revolution that all the Hasbro brands are coming together - G.I. Joe, Transformers, all this stuff is going to be in the same universe, and that bothers me. But I need to deal with it. These are my MASK playsets now. I thought I knew I had Max Striker somewhere... I remember these so well; my brother had so many of these. They're huge because they would... I mean, this is so nostalgic. They would like hold on - this one did something cool too, I think. Oh my God, I can't remember what do these do? Remember what you say? This one transforms; they would just transform into other vehicles, yeah. Didn't this thing...",
            "start": 623.24
        },
        {
            "text": "on this one did something cool too I think oh my God I cant remember what do these do remember whatsay this one transforms they would just transform into other vehicles yeah didnt this thing didnt this thing didnt the gun come out when you when you didnt the wheels move the gun in and out of this holy **** give a mic oh whats wrong whats what this make you feel like this is ancient **** right well its funny cuz I I had not all like Im going to break this those are my Ninja Turtle toys you know like the ones he has the ninja turtles are cool and its its just like I got a lot of my toys from garage sales so like a lot of this shits like oh I kind of play with that its weird that like it came from somewhere so I remember this yes mask mask cant push it cuz it hurts thats the first time seeing that thats what that used to do dude I love this I love love this thing though let me you have loose mask figures loose no theyre all in there I think I here some more legs",
            "start": 664.36
        },
        {
            "text": "the first time seeing that that's what that used to do dude I love this I love love this thing though let me you have loose mask figures loose no they're all in there I think I here some more legs for the Joe's **** dude I want to do surgery on all these for you and put them all back together be a fun little thing and we can match all the weapons up and stuff so this is this was my my favorite part of this thing is that you would do this and then this thing somehow yeah like that and then you yeah but but there there's guns here that would that were attached to the wheels I the guns like yeah I think the gear is broken some micro machines that is micro oh no is it oh my God I remember I thought micro in my head are so much smaller than that micro I think are a little bit bigger than that okay a little bit they're more wide okay where did I put my phone oh here it is I got to send a picture of D maskk okay so so those are the GI Joe toys but not to be outdone she also included uh",
            "start": 715.56
        },
        {
            "text": "that okay a little bit they're more wide okay where did I put my phone oh here it is I got to send a picture of Darth Vader maskk okay so so those are the G.I. Joe toys but not to be outdone she also included uh my OG Star Wars yeah yeah now you have the you have the 77 to 83 line/ 85 oh yes no W was not in there so this is there be careful this covered in dust and I wanted to put this on the set but couldn't find a way because it's not as fun Nostalgia Kevin all right let's get let's move these over what do you want me to bust that's one of the covers for that thing oh okay do you want me to bust them off you want me to get dude these Star Wars toys have the straight armed Star Wars toys MH yes yesos I have no idea why I have BOS there's a lot of these in here that I don't know why I bought you got two so you didn't just buy this and has all of them no no this is what you you bought this and and it came with the stickers and you put them on and then you collected them slowly over time you have R5 D4",
            "start": 760.44
        },
        {
            "text": "you didn't just buy this and has all of them no no this is what you you bought this and and it came with the stickers and you put them on and then you collected them slowly over time you have R5-D4 why I have no idea I have no like here's what used to happen like I used to randomly just go to the mall with my mom and there would be a new toy and I knew if I I didn't have it or not right I like oh I already have it or not right Poe Dameron that's the bomb right there that's my most prized possession like he's got a little lipstick on the back that looks like a dog's dick this missile was glued in it was originally supposed to shoot and people's eyes were getting poked out with it yeah so they glued it init every one of them looks a badass I don't know what happen hey um Luke and uh Obi-Wan I don't know where the lightsabers are anymore the lightsabers just come out of their hands that little thing they were called telescoping lightsabers you have two snow troopers no idea",
            "start": 819.16
        },
        {
            "text": "I don't know where the lightsabers are anymore. The lightsabers just come out of their hands, that little thing they were called telescoping lightsabers. You have two Snowtroopers; no idea why I guess I forgot that day that I already had well no, that was the best thing you can have multiple. I remember all the foot soldiers I had. I get a toy you already have all the toys I want another foot soldier I want to be them to fight this is sad didn't realize this like you're talking about missing yeah that's sad that you were the head of the curve. You have Return of the Jedi Luke with his glove, A New Hope Luke. Wow yeah and then this guy who I don't remember him from no he's not a Star Wars character Dad but he looks more like your dad did the best he could. He we're going to put him with GI Joe's they're all fighting people yeah exactly fighting for our freedom yeah there's more but those are those are the cream of the crop from some of the toys that",
            "start": 855.24
        },
        {
            "text": "he we're going to put him with G.I. Joe's they're all fighting people yeah exactly fighting for our freedom yeah there's more but those are those are the cream of the crop from some of the toys that I used to have Obi is this obiwan that's Obi-Wan yeah he used to have a little key yeah he didn't have the clo yeah the so the reason he looks his legs look so chunky is because he came with an actual plastic cloak so did Yoda and some others and then you you but people would lose where and this is the 77 this is the New Hope run Obi-Wan so this is pretty cool this is and you can see here the telescoping lightsaber well you can't really see it in the picture cuz it's too small but the lights instead of putting the lightsaber in their hands the lightsaber would actually retract into their arms which is why they were straight he kind like one of those I do who does who doesn't want two Lando's I thought it was cooler if they were twins they're both 80 no these are actually different",
            "start": 898.12
        },
        {
            "text": "arms which is why they were straight he kind like one of those I do who does who doesn't want two Lando's I thought it was cooler if they were twins they're both 80 no these are actually different ones decoy octopus they're they're both Empire runs but the dates on the back are one this one has the dates on the left leg and see this is the cool thing about toys and like why people like go online and do all these things you're like an Antique Roadshow right now and this one has the dates like the 1980 um marking on the right leg but the maiden Hong Kong on on the left leg which um is on under the date on this one so these are somehow different but I don't know how oh no they're totally different the the mold is different on the belt this is cool Antique Roadshow C War already going around talking about your Star Wars toys these are totally different I bet you if you uh we should we should look as to why they're different one might came with a vehicle maybe or",
            "start": 930.16
        },
        {
            "text": "War already going around talking about your Star Wars toys these are totally different I bet you if you uh we should we should look as to why they're different one might came with a vehicle maybe or something or a where the Transformers were the Ghostbusters nice yes yes that's awesome oh my God the GI Joe the GI Joe vehicles were so awesome oh the X-30 give is oh yes see what I'm saying I have flown one of those have chook too back there somewhere dude I love the Cobra Air Force logo with the wings on it oh that's awesome and yeah I had I had God this is so nostalgic I know GI Joe was the best the best I guess she must have thrown away all of my uh who's going to fly this one today we're going to put this we're going to put the SEAL Team in here must to throw away all my Transformers boys cuz I used to have I had Optimus I I had the gun Megatron but he actually turned into like full size gun that was like this big that's crazy see that was like",
            "start": 975.16
        },
        {
            "text": "all my Transformers boys cuz I used to have I had Optimus Prime I I had the the gun Megatron but he actually turned into like full size gun that was like this big that's crazy see that was like before my time because remember when we transform it' be small enough for Starscream to grab like I I'm well aware the looked like it looked like the duck hunt gun it was amazing no no no the the it was like the metal uh the diecast metal Megatron when growing up in the '90s they Megatron wasn't allowed to turn into a gun so all of ours was a tank with a freaking bright neon orange uh thing on the tip of it so I was I was so jealous of anybody that had the actual Megatron **** yeah that was me it's gone now that's so probably worth at least $5 oh my gosh maybe 10 wow I don't BL well thanks for sharing thanks for having it this is awesome you're getting like a little look into like six-year-old Colin's life right now what what are you going to do with all these toys now storm in the closet",
            "start": 1039.52
        },
        {
            "text": "sharing thanks for having it this is awesome you're getting a little look into six-year-old Colin's life right now what are you going to do with all these toys now storm in the closet and then eventually I don't know we should restore these just we we're going to D I should bring my G.I. Joe collection one day I have it's asinine how big it is I mean yeah I guarantee yours puts me to shame no no I'm not saying it for that reason I'm saying like we would probably be able to fill you have some that I'm missing I mean it blows my mind you have this many dude you I have probably six or seven times that's insane like I don't like that just how when you were a kid because it was like my it was arguably the most popular cartoon at the time um and you just you bought into the Kool-Aid man I don't know like every time you'd walk by any toy store there would be like 30 of them that's all there was and then the Marvel stuff started and they made them for 12",
            "start": 1084.88
        },
        {
            "text": "**** you drank the Kool-Aid man I don't know like every time you'd walk by any toy rad there would be like 30 of them that's all there was and then the Marvel stuff started and they made them for 12 years and there were new ones every year like the coolest thing about buying them similar to toys today I'm sure is that like you would turn it around show all the waves but the waves of G.I. Joe's like in '86, '87, '80, '89 there was like literally like 40 or 50 of them and they were also cheap they were like $2-$3, $250-$350 yeah **** definitely so that's why you literally it would be like this we'd walk into like a thrift store right like a pharmacy had the Scoop Ice Cream that looked like little cylinders and I would walk down the aisle with my mom every day we'd be like \"fine\" and we go down the aisle and I was allowed to pick out one but that would happen like every week so think about that 52 weeks a year, no I mean for me in the '80s that's a good amount that's still",
            "start": 1124.36
        },
        {
            "text": "the Toy and I was allowed to pick out one, but that would happen like every week, so think about that - 52 weeks a year. No, I mean 250. That's totally insane. I mean for me in the '80s, that's a good $10. Oh yeah, Power R... like six bucks. Yeah. And Star Wars toys were cheap too. I mean because and the reason I know that is because I used to look at a lot of um and look to buy a lot of like carded Star Wars stuff and and carded G.I. Joe's and a lot of them themselves had the price tags on them from Child's World or whatever, Toys R Us, and like the prices are are insane on a lot of these toys in terms of like their their cheapness because even though they were more expensive based on the money in the '80s, they're not as expensive as toys are today by any stretch of the imagination. Like, money's not five times less valuable - G.I. Joe's wouldn't be you know in other words $10 today. Um but I I uh because even G.I. Joe or when Star Wars figures came out '95, '96 when they did the um the the the next",
            "start": 1160.8
        },
        {
            "text": "five times less valuable to the G.I. Joe's wouldn't be you know in other words $10 today um but I I uh because even G.I. Joe or when Star Wars figures came out 95 96 when they did the um the the next wave of them or whatever they were $49.99 at Toys R Us remember and they were I think even like 3.99 at at um Walmart but then you were paying $66.99 at KB Toys but KB had like the rare **** because fewer people bought him there so that's how I got Le like Princess Leia was really rare and Obi-Wan was rare or Lando was rare um stormtroopers were rare so uh but yeah I I I have it's so it's so cool man because like I have Wild Bill I have I have I have an old Wild Bill helicopter man that's how they also got you man they like I have a soft spot for these you have no idea man I have a soft spot for these you got the Joe and then did they come with the helicopter or did you have to buy them separately remember like they had a vehicle like you buy the vehicle did Wild Bill",
            "start": 1197.28
        },
        {
            "text": "got the G.I. Joe and then did they come with the helicopter or did you have to buy them separately remember like they had a vehicle like you buy the vehicle did they did he come in the vehicle did Wild Bill there was probably a variation I don't think this was the particular variation that did come with with the vehicle the cool thing was the bigger vehicles came with came with characters that you could only get with the vehicles I remember uh like uh not tunnel rat but one one of those guys Tunnel Rat's an awesome G.I. Joe but um I love their names uh well these are like names Tunnel Rat's like a name from Vietnam or whatever what was the medic's name that's Lifeline Lifeline that's right and there was another medic there was another medic later called Stretcher who was a guy who came with a stretcher he was like white and blue like this this is the original Snow Serpent the snow serpent came back in like '89 different colors came with like a snowboard so how how do Snow Serpent and Snow Job",
            "start": 1239.28
        },
        {
            "text": "he was like white and blue, like this - the original Snake Eyes. The Snow Serpent came back in '89 with different colors, came with a snowboard. So how do Snow Serpent and Snow Job differ? I think they're probably fighting each other; one's dead, one's Cobra got it. Um, but I don't remember all these... this is like Hydro Viper or something like that. I'm forgetting some of the names. Bats were cool. Oh, by the way, you have the original Snake Eyes, which is like a really coveted toy. Oh my god, there he is. You also just have disembodied legs floating around - that's probably the legs to the other guy, that's the Dreadnok. Dad just put him on wrong; although maybe dad just thought the GI Joe legs looked better on the Dreadnok. Exactly, he's playing a little bit. Game over, you should really start going in and figuring like, and fixing some of these - it would be fun. I, um... God man, I loved GI Joe for so long; like I was talking to my brother about where I had TMNT toys and some other",
            "start": 1272.72
        },
        {
            "text": "\"Start going in and figuring like and fixing some of these it would be fun I I um God man I I loved G.I. Joe for so long like I was talking to my brother about where I had TMNT toys and some other toys but like I was all about Joe for probably six or seven years like I bought them you know like new and then my brother so like the old ones I have from '82 like remember you might not remember your brother probably does and you might have had them at some point the original run in '82 their arms were straight I don't remember and that like kind of more like this and they're like super rare and and and worth a lot of money and then in '83 they started making them like this with like that's those are legs with like the arm that like curves in and stuff like that yeah so those original ones like the original Flint and Duke and all those kinds of guys um are I don't know I I just you should get your G.I. Jo's we should we should make sure we label them somehow so we don't get them mixed up cuz I\"",
            "start": 1311.16
        },
        {
            "text": "original Flint and Duke and all those kinds of guys, um, are I don't know, I I just you should get your G.I. Joes, we should we should make sure we label them somehow so we don't get them mixed up cuz I know they'll kill you, and then you and I should just have a let's play session with them that we just let's play with the G.I. Joe, I love that it's the original Viper, um, yeah, so I I just I used to just pour over yojo.com, people should go check that website out, it's so cool, it's like such a really if you're like a G.I. Jo nerd it's so cool they people have like all these pictures and all these variations all them you can go through all the file cards which is one of the cool things I wish I saved all that kind of stuff and I remember when we were at New York Comic-Con a few years ago I was going to the different vendors trying to find like an affordable G.I. Joe card for like less than $50 because I just wanted to open it um why because I wanted like I wanted that feeling like one more time of like",
            "start": 1351.52
        },
        {
            "text": "different vendors trying to find like an affordable G.I. Joe card for like less than $50 because I just wanted to open it um why because I wanted like I wanted that feeling like one more time of like like opening but like they were like they're so valuable and then I'd feel bad you know like someone went to Toys R Us in 1986 and bought you know Star Wars and then like put him on like in a box somewhere and then I'm going to come back in 2013 and like rip him out of his box to like a childhood dream they were meant to be played with that's the way it goes but I do want that feeling one more time anyway",
            "start": 1388.8
        }
    ]
}