{
    "id": 2005,
    "video_id": "gppP-KBJfs4",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Greg Miller's #7FaveGames - Kinda Funny Gamescast Ep. 82 (Pt. 3)",
    "description": "OK, we all know Metal Gear Solid: Peace Walker is on Greg's list, but what else?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1472130004,
    "duration": 1749,
    "transcript_chunks": [
        {
            "text": "Kind of Funny Games is brought to you by Dying Light: The Following - Enhanced Edition, now available on PC, PS4, and Xbox One. This new critically acclaimed entry into the Dying Light universe once again has players taking on the role of Kyle Crane with an all-new arsenal of state-of-the-art weapons and augmentation. See what all the excitement is about at dx.com. Greg, I want to hear your top 7 favorite games. Well, unlike you, I went and did all my research because I'm not a gentleman. Ladies and gentlemen, I have numbered them. Things happen. I went and watched the old ones; I did all these things. Number seven, Mario Kart Double Dash... wow, very interesting. Call Greg, Kevin, give me my one shot. Fran Mirabella 7.9, go f*** yourself. The biggest travesty in IGN's history was when that review went up. Mario Kart Double Dash? You want Tim to ask me why it's the best Mario Kart? Why is Mario Kart Double Dash racing? Tim, none... we don't got these motorbikes; we don't drive on walls; we're not f***ing using hang gliders.",
            "start": 0.04
        },
        {
            "text": "Dash, you want Tim to ask me why it's the best Mario Kart? Why is Mario Kart Double Dash racing so great? Tim, none. We don't got these motorbikes. We don't have we're not driving on the walls. We're not using hang gliders or any of this stuff. We're just racing and there's two of you for some reason but you don't play in the you're not just racing. There is another unnecessary gimmick. It doesn't matter. Give everybody their own weapons when you play it correctly. It doesn't matter when you play it correctly, one person, all your friends are going at it. It doesn't matter. This is one of I mean, you want to talk about the promise of the GameCube and what made the GameCube great. Obviously, what made the GameCube great was the handle but the second thing was it was built for multiplayer and for me Mario Kart Double Dash is on that pedestal of what I wanted out of mar what I wanted out of Mario Kart as a franchise what I wanted out of the GameCube as an experience I always talk about it.",
            "start": 63.8
        },
        {
            "text": "me Mario Kart Double Dash is on that pedestal of what I wanted out of Mario Kart as a franchise, what I wanted out of the GameCube as an experience. I always talk about it - you know my roommate Hayes bought it; we lived in a house with seven guys, and when he came home with that and Super Smash Brothers, like we came home and started playing these games. Smash was great, all right, great. Toad's Tour was awesome; we had so much fun with you know I love Toad's Tour but when we had Mario Kart Double Dash it was the one man where it was I was so dialed into it and everyone was so dialed into it where it would be I remember I'll never forget this - where we had it was everybody in our house, all of their girlfriends, all of our friends sitting there playing passing the controller you know fourth player, fourth place always getting kicked off. And I remember going to dinner with my then girlfriend and like we were both eating as fast as possible to get back and go play more - like that's how into this game we",
            "start": 101.6
        },
        {
            "text": "\"Place always getting kicked off, and I remember going to dinner with my then-girlfriend, and like we were both eating as fast as possible to get back and go play more - that's how into this game we were, and how well we knew those courses, Baby Park, and all these amazing things. And we're talking about favorite games right now, so that's the thing I get to objectively look at it and be or I'm sorry, totally uh, biasedly look at it subjectively look at it, and talk about the fact that it's the emotions tied to it, it's the experience of it. I was never a big Mario Kart 64 fan; it felt stiff to me - that must have been a timing thing, yeah right, it was a timing thing. It got into my life at college when you know I was in this house with all these people who wanted to play games, and this is one that was there, and it was a bonding experience. And I do feel that the Mario Karts of today are obviously so much more going on; they look better. I like having my Wiggler cart and my\"",
            "start": 141.28
        },
        {
            "text": "that was there and it was bonding experience and I do feel that the Mario Karts of today are obviously so much more is going on they look better I I do like having you know my Wiggler cart and my Cyber Slick wheels and all these different things I enjoy playing eight you know that but they I think to an extent they did get too cute with a lot of things and there is so much fat on it where I really do just want it to get back to being an awesome cart racer and I'm unlocking things I'm doing things sure but I don't feel like there's mechanics or things that I just don't fully wrap my head around or that there's you know ways to get around it if you're not just good at cart racing yeah if that makes sense I mean yeah the Mario Kart franchise is so interesting and how it's grown you know seeing it on the the Super Nintendo that that game was pivotal that game was so important to people and like just it created a genre in a lot of ways right um but then the N64 version really was",
            "start": 174.36
        },
        {
            "text": "seeing it on the Super Nintendo that that game was pivotal that game was so important to people and like just it created a genre in a lot of ways right um but then the N64 version really was the multiplayer here's battle mode battle mode exactly but I always thought 64 was um like radically different just because of how it looked because it was kind of like the 2D like Sprite in a 3D World it always kind of felt weird so you saying that it felt kind of sluggish like I agree with that like it was cuz always felt like you're controlling the character with the or controlling the world moving around a character like when you tried to hop it just never worked for me you know what I mean like drifting so seamlessly is what I I feel cart is yeah exactly um and I I don't love Mario Kart 64 but I feel like where that shines is battle mode you and I feel like battle mode Mario 64 battle mode is like unrivaled to this day in terms of Mario Kart and so I think that the the pure racing aspect",
            "start": 210.24
        },
        {
            "text": "I feel like where that shines is battle mode, you and I feel like Battle Mode in Mario 64 is like unrivaled to this day in terms of Mario Kart, and so I think that the pure racing aspect of it, it's it's great. Um, it's so Crash Team Racing, but uh Mario Kart Double Dash I did think added in terms of the the racing elements and stuff, and definitely in terms of the the course layouts and all that. I did not like the um the switching between characters specifically each character having their own special right was I like it was not balanced well for me, and sure maybe you just played with bad people, you know what I mean? You played and you weren't that good yourself, but me and my friends, you know we were sharp as spears. We we knew our characters, and that was the thing. It was that Smash Brothers vibe where it was I was rolling Baby Luigi, Baby Mario, that was my team, those were the people I was taking out, and everybody else had they had their own I was a big baby fan, I still am to this",
            "start": 252.88
        },
        {
            "text": "Brothers Vibe where it was I was rolling Baby Luigi, Baby Mario - that was my team, those were the people I was taking out. And everybody else was had they had their own... I was a big Baby fan, I still am to this day. Want to come see my van? No, the thing about it is, it just worked that way where it was what the things you like about Smash Bros. where you know Nick's going to sit on the side right and play as Pit and shoot arrows or whatever, and you're going to shirtless smash the **** out of the room - that was what it was in this game where everybody knew we knew each other's ****, you knew each other's how they were going to use the things and that's how you got around it. I think yeah, that definitely makes sense. Uh, there was a Super Circuit on the Game Boy Advance that one kind of went a little bit more back to the SNES one, and that I mean it was fun having a portable but that wasn't a great game. I mean shout out to Mario Kart DS - but that's what I'm saying I feel like they",
            "start": 295.28
        },
        {
            "text": "a little bit more back to the the SNES one and that I mean it was fun having a portable but that wasn't a great game I mean shout out to Mario Kart DS and but that's what I'm saying I feel like they really kind of perfected it um in Mario Kart DS except for snaking that exactly but uh that's in terms of like then adding all the extra stuff Mario Kart Wii adding the the bikes I think is that dividing moment for for a lot of people but playing Mario Kart 8 it's one of it's kind of like Smash Bros Wii U where it's just like is it the best one I don't know but I mean it's really damn good they really have iterated so much that it's just at a point where it's like you can't complain every time I whoop your **** ass at Mario Kart 8 for the Nintendo World Championship here kind of funny I'm reminded of how much I enjoy it how much I do like it but I'm just not drawn to go back to it for some reason I don't know why I think it's because we're grown ass men I think that really you know has a",
            "start": 331.28
        },
        {
            "text": "of how much I enjoy it, how much I do like it, but I'm just not drawn to go back to it for some reason. I don't know why. I think it's because we're grown-ass men. I think that really has a lot to do with it, and that's why it's my fave. And you're talking about it being a time capsule, right? A period of my life. So I totally get it. I can't hate on you for Double Dash even though I kind of want to. **** you, Fran Mirabel. Everybody tweet him; I said that. Um, number six on my list is Infamous again, another one we've talked about at length. You know what I mean? For me, it was what I as a comic book fan have wanted forever: right, like watching a talented developer Sucker Punch take on a comic book of their own, an original IP, go in there and tell their own story and make me care about all these different characters you know we talk about all the time. Like Cole McGrath is such a cool character because he was just a normal dude; he was just a bike messenger. He wasn't a great guy, and that's why",
            "start": 371.52
        },
        {
            "text": "characters you know we talk about all the time like Cole MacGrath is such a cool character because he was just a normal dude he was just a bike messenger he wasn't a great guy and that's you know exhibited by the gameplay of course if you want to be good or you want to be bad investigate that but his surrounding cast I found so interesting whether it be Zeke his best friend who's this goofy dude whether it be Trish who now his girlfriend who you now have to have this subplot with of like well his activation killed her sister should she does she have the right to feel bad about this because he didn't ask for this why you know she is she a jerk for that or not but then wrestling with those kind of emotions Kessler is a villain and then of course the ending with Kessler there's so many interesting points to that let alone sub bosses and things are going to fight in there let alone the race sphere let alone all these different people that are doing something else in this game it",
            "start": 406.76
        },
        {
            "text": "many interesting points to that let alone sub bosses and things are going to fight in there let alone the race sphere let alone all these different people that are doing something else in this game it was as a comic book fan you know you're a comic book fan comic book games are hard to do they're hard to find and we're talking about established people like you know what I mean like the Batman games of late awesome obviously Spider-Man games that's a you know that's a rough one let's and then even the one you're talking about let's do like uh X-Men or let's do the uh the Marvel Ultimate Alliance games fun gameplay are we playing it for the story are they really turning it on its head and doing something different no and so when you get your own world and you get to play through it and I I loved the comic book cut scenes that that's how they played out and like panels are moving and talking to you as they go I thought The Voice work was awesome the acting was great the choices were cool",
            "start": 439.72
        },
        {
            "text": "the comic book cut scenes that's how they played out and like panels are moving and talking to you as they go I thought The Voice work was awesome the acting was great the choices were cool as dated you know what I mean that's why I think one of the reasons like Second Son never makes it on our top anything PlayStation 4 list right because you play that and it is very much still Infamous one of like hey there's a floating icon over here and you jump down and started like well that's kind of you're making the Seattle that's like so perfect why doesn't it why does it work but for a PS3 game for Sucker Punch branching out for an exclusive that actually panned out which was exciting at the time being on the PlayStation team right like I remember when they showed that first trailer getting excited for it but then always having the thing of like wait and see wait and see but to get there and have the powers and have the ability to explore you know open world for so long when I'm",
            "start": 475.36
        },
        {
            "text": "Getting excited for it, but then always having the thing of like wait and see, wait and see. But to get there and have the powers and have the ability to explore, you know, open world for so long. When I'm thinking of open world or sandbox, I'm thinking GTA. And you're playing those games, and the reason Spider-Man 2 on PS2, or that generation, right, stands out all the time is because holy **** it's open world, and I can go do whatever. Yeah, I'm repeating the same missions, and oh my god, and all this other stuff, and the story is garbage. You were just excited to be a superhero in open world, and that's what they nail, and they continue to nail that sucker punch gets open world, sandbox so well. Yeah, I think that so I always talk about Infamous as the one game I... I think Infamous is fantastic, um, as well. I think it's a great game. I think you and I were both huge fans of it when it came out, and and I don't think I have the affection that that you have for the series, but and I think the",
            "start": 510.76
        },
        {
            "text": "um as well I think it's a great game I think you and I were both huge fans of it when it came out and and I don't think I have the affection that that you have for the series but and I think the second one's in a in a lot of ways far superior I agree we talk about this all the time gameplay wise I totally think so I think storywise and what I want out of as a package I liked Infamous One so much Infamous was an example of a game that just totally snuck up on me like I knew it was coming and and I just didn't care that much and well comic book stuff right that doesn't speak to you yeah and then I I had to write the guide for it when I was at IGN and so I I sat down and played I was like wow this is really awesome this is a really really awesome game uh relatable and I think what the see why second Sun was so disappointing was Second Son's gameplay was far superior to Infamous and Infamous 2 I think its powers were even really way cooler but it's it's uh and I think it's mobility",
            "start": 549.8
        },
        {
            "text": "see why Second Sun was so disappointing, was Second Sun's gameplay was far superior to Infamous and Infamous 2. I think its powers were even really way cooler, but it's it's uh and I think it's mobility and it's and all that kind of stuff turned to smoke up the PIP that was really cool in Second Son. It's just that it didn't have the heart, soul, and grit of Infamous and Infamous 2. It was a disappointment, and like you know, Cole is just a way cooler character. I think Seattle was nicely realized but I do think that Empire City and New Marais were way especially New Marais I think was a really really I think even place for the the the setup and plot of Second Son right. I feel like we were getting bogged down too much in like well let's it it looks so much real or so you know Seattle looks so much realer let's make it more real and the governments come in and done all this stuff and those are cool themes but they didn't pan out in the way that okay cool somebody set off a bomb now you have",
            "start": 583.24
        },
        {
            "text": "realer let's make it more real and the governments come in and done all this stuff and those are cool themes but they didn't pan out in the way that okay cool somebody set off a bomb now you have powers and there's other crazy **** that have powers doing all this **** all right now there's a beast coming and it's going to eat the world you're like these are comic book story lines that I thought were more fun to play whereas this one's like all right we're building F it's kind of a bummer with Second Sun just in the sense that I think they shot themselves in the foot like I I think the series will continue in some way at some point with someone but not with them um but we didn't expect that out of at least I didn't expect that out of out of Sucker Punch you these guys that mean Sly Cooper so we knew that they had some sort of pedigree in like this open world or at least this Hub World kind of situation but we didn't I I didn't know they had this in them and and uh they put they",
            "start": 620.04
        },
        {
            "text": "Cooper, so we knew that they had some sort of pedigree in like this open world or at least this Hub World kind of situation but we didn't I I didn't know they had this in them and and uh they put they put themselves on the map and I I really do feel like they are in because of the infamous franchise in the upper echelon and they're not NAU dog really contain is up there I think pany probably are up there above them but they're really up there with God of War and and um you know Santa Monica Studio in terms of the Sony first parties because of that Series so I'm with you on that thank you brother give me a pound yeah dog number five this is one that I predicted ladies and gentlemen when we did this before when our and I said I wasn't ready to put this on the list maybe with some marinating it would Gone Home, I'm putting it number five Gone Home is very much one of those games that just resonated and I know I've talked about it at nause a million times on here so I won't beat a dead horse right",
            "start": 651.28
        },
        {
            "text": "gone home I'm putting it number five G Home is very much one of those games that just resonated and I know I've talked about it at nause a million times on here so I won't beat a dead horse right but it's just a game that changed something in me in the same way I think now with distance from it and the way I talk about it and the way I bring it up all the time on shows for me it's a modern moment akin to Metal Gear Solid on the PlayStation one where I always talk about that game special to me because I just got to that point with my friends where I'd been asked before like are you still into games are you know this I'm like yeah but I don't know how much more I will be is it is it always going to be what the N64 is which is great but it's Mario and it's this and it's it's cartoony and it's not connecting with me on some emotional level I didn't say any of that I didn't know that's what I was saying or what I was thinking but then to get Metal Gear Solid and be like oh **** this is what",
            "start": 686.64
        },
        {
            "text": "connecting with me on some emotional level I didn't say any of that I didn't know that's what I was saying or what I was thinking but then to get Metal Gear Solid and be like oh **** this is what games can be this is where they're going this is they can be movies they can make characters I care about oh my God to get to goHome and have it be such a different experience such a different game going not knowing what it was thinking it was going to be a survival horror ghost game on like Outlast or whatever but then to get in there and learn these characters and have the Diaries and meet Sam and meet Lonnie and go through these experiences and get to the end of that game and be like holy **** this is what games can be and to me this is what the indie game can be this is what the smaller game can be this is what you know you go you and I then go and play Emily is Gone or Away Emily is Gone we go play Coming Out",
            "start": 725.84
        },
        {
            "text": "game can be this is what you know you go you and I then go and play Emily's Gone Away we go play Emily's Gone Away and see what it is you know we go play come I go play coming out simulator um uh uh driving in the car game three4 home three4 home we that one was the tip of the sword for me cbel right like it's these games that are telling me this is the power of games as we move forward and we get better storytellers and we get better experiences that you can be put you can literally be put in someone else's shoes live a day in their life and take something from their life and apply it to years mhm yeah I think uh you know you making me play Gone Home was one of the great favors you ever did for me because it was a PC game and and you know PC gaming is for nerds so I was I was I was worried about whether or not you know I would I would I would resonate I remember sitting in the office which was ended up being our studio um that we recorded everything in for a year",
            "start": 763.4
        },
        {
            "text": "I was I was worried about whether or not you know I would I would I would resonate I remember sitting in the office which was ended up being our studio um that we recorded everything in for a year and a half after that but uh I think what's special about Gears of War is not it's necessarily the beats of its story like a lot of people get upset that you know it's like oh it's social justice where like was about lesbians and coming I'm like that's actually really not what's important about it you had your chance to play it don't **** about yeah I don't whatever like yeah you definitely had more than enough um that's not why it's cool to me it's it's cool to me because like it had one of the great left turns um in gaming history in my mind it's you don't know that that's you know going into the game that that's what it's going to be and in fact for the half an hour or more it's like this is a what happened in this **** up house dead what's happening I always talk about it right like the",
            "start": 801.88
        },
        {
            "text": "game that's what it's going to be and in fact for half an hour or more it's like this is a what happened in this \"House of the Dead\" what's happening I always talk about it right like the time you come into the house there's the staircase there's over there instinctively for some reason I went left which is crazy when you find out the game just plays you know everything's where it should be but I somehow felt like I was on the right path for it but go left into the TV room that's on with snow like an emergency message and you find the \"Poltergeist\" book and I'm like here we go all right and I remember walking back to the door and just walking to the doorway and I'm looking right out the door and I kept going like this like going to the wall to the door to the wall to the door cuz I'm expecting some kind of monster goo ghost whatever to pop out at the other end and like spook me and when it didn't happen you like I inch out and I keep inching around the house",
            "start": 844.16
        },
        {
            "text": "to the door cuz I'm expecting some kind of monster goo ghost whatever to pop out at the other end and like spook me and when it didn't happen you like I inch out and I keep inching around the house like what is going on later and I I think that you know I I like the story about the girls and like how they find each other and stuff I think that's cool but that's not that's not the major beat for me like it's it's just the game is just is well done and and and I don't you know we've talked about this game this is a divisive game I think more than it should be um and there are games out there that people love and are critical Darlings or whatever and I just don't get so I don't mean this in a condescending way but there are just a lot of people that just don't understand like why this game's good because they really i' I've I've heard few people play it and and have any regret about having spent time with it you know it's a lot of people are just it's a walking simulator and all that kind",
            "start": 880.0
        },
        {
            "text": "because they really i' I've I've heard few people play it and and have any regret about having spent time with it you know it's a lot of people are just it's a walking simulator and all that kind of stuff maybe we need a definition of what a game is be seconds yeah it's like yeah you can there's a trophy for it yeah do you know if you know exactly what to do and how to do it um but to me it's it's one of those situations where I I just feel like um the the unfortunate thing about it is that I think more people need to give it a chance but I also think one of the unfortunate things about it is that it spawned games that are less thoughtful that like it seems like a game that people can make like it's an easy game to make you don't have to worry about AI and all you have an environment you walk around it and you know Firewatch comes to mind for me where I'm like this game just totally whiffed and and and and Gone Home just cracked the **** bat on the ball and hit it 425 yards you know",
            "start": 914.0
        },
        {
            "text": "around it and you know Firewatch comes to mind for me where I'm like this game just totally whiffed and and and and Gone Home just cracked the **** bat on the ball and hit it 425 feet not yards because that would be an insane hit that no one can do oh my god um so yeah I I think Gone Home's super special um the unfortunate thing is I think like similar to Journey to Abzu like where Abzu is a super tryhard Journey and like it doesn't resonate because of Journey because we already have a Journey I do feel like Gone Home is one of those games where it's like just I'm just going to let Steve Gayle do his thingz cuz I'm not I'm not so sure that any like there are very few Studios that can do this sure they kind of I don't want to say they pioneered this particular thing but in a way they did that's why I look forward to games like um uh Apartment which I backed on Kickstarter right which seems like Gone Home but it's different people and there is gameplay elements and you're",
            "start": 954.2
        },
        {
            "text": "Way they did that's why I look forward to games like Umurangi Girl, which I backed on Kickstarter right. Which seems like Gone Home but it's different people and there are gameplay elements, and you're switching things around with it. You we talk about Emily as a way a game that again you're not playing but you're kind of playing and you you're making choices but it's not like I'm walking around a house doing it. You can take this and twist it so uh I was looking through uh comments recently and I somehow stumbled upon that video and someone made a really really interesting um observation for our playthrough of it where they're like for me playing through it there was a point where all of a sudden I didn't feel immersed anymore and it felt like it was someone else's story and whatever and he's like and then I watched you guys' let's play and I found that moment because you guys stopped referring to it as I and started referring to it as he. I was like, \"That's really interesting.\" She when it",
            "start": 995.6
        },
        {
            "text": "like and then I watched you guys' let's play and I found that moment because you guys stopped referring to it as I and started referring to it as he I was like that's really interesting she when it starts getting all like date rap you I don't think we want to be attached to it as muchar on this guy number four is a slot previously inhabited by Uncharted 3 I'm putting in Uncharted 4 which is a cheat which is a cheat of course yeah it is because Uncharted 4 means so much to me because it is the payoff of the Uncharted story right like I don't know if I it's impossible to sit here and take them one by one piece by piece right Uncharted 3 was probably there again and it I mean I you know I still think Uncharted 3 10 out of 10 but I think it's it's there because again it's like well Uncharted 2 was a disappointment to me because it was B for beat Uncharted one and I didn't like Uncharted 3 was so different with it was Sully and Drake's story and there was more on this Uncharted 4 you get to",
            "start": 1029.84
        },
        {
            "text": "was a disappointment to me because it was B for beat Uncharted one and I didn't like Uncharted 3 was so different with it was Sully and Drake's story and there was more on this Uncharted 4 you get to right like and we'll keep it spoilerish free like we're not going to get crazy with it but like it's the culmination of that entire thing it's them having the convers cuz I'm Uncharted for the story right the game play is fun or whatever and it's beautiful but I love the characters and I want to know their story and this is the one where they do the they they have the conversations I've always wanted them to have they answer the questions I've always wanted them to answer there'll be moments of like we can talk about that later my go and then they talk about it five minutes later like no no we're talking about it now like oh yeah we're getting everything I wanted out of this let alone the ending let alone the power of that and let alone the you know importance of closing that book",
            "start": 1069.96
        },
        {
            "text": "talking about it now like oh **** yeah we're getting everything I wanted out of this let alone the ending let alone the power of that and let alone the you know importance of closing that book and putting Nate story on a shelf like I think it's a cheat because I'm so tied up like I am saying the Uncharted franchise is like number four for me right I mean but that's that's what's really cool about this this whole topic the seven fave games is like you need to look at the franchise and you have to make those hard decisions but it's like really all the Uncharted games are fantastic yeah so it's like the fact that there even is that conversation of is two better than three is four better than this whatever it's like that's so awesome because they are all so so so good and I agree I think four is the best that they they've had and I feel like they really again knew what they they had with two knew what they had with three and obviously with one and they're just like all right but what do",
            "start": 1102.12
        },
        {
            "text": "the best that they've had and I feel like they really again knew what they had with two, knew what they had with three, and obviously with one, and they're just like all right but what do the people that love these games want and they did that and that's the compliment yeah yeah four is fantastic it ramps yeah you know it's a it definitely starts I well I don't think I don't know if it's it's uneven but I think it's only uneven in terms of when we think about it as a video game and if that makes sense right like I like when you when you get back you look back at the journey when you go back and you Platinum it you play it over and over again like even at the time I remember being like I think it was night one you would come out and I was just a little bit hey like what do you think you're like it's kind of slow I'm like it is kind of slow but I think it's going somewhere it's starting to get somewhere and then when you get you see the entire Journey it was like oh we were",
            "start": 1139.44
        },
        {
            "text": "think you're like it's kind of slow, I'm like it is kind of slow but I think it's going somewhere, it's starting to get somewhere and then when you get to see the entire Journey, it was like oh we were ramping up to where we were to hit our stride to go with yeah it gets by the teens uh in the chapters it gets uh fantastic. I think what I like most about it is that it's not much of a video game like and I know that's weird but there's not it's not very shooty compared yeah compared to other games, the roping is like I have mechanical I have actually plot problems with that doesn't make any sense but uh it doesn't it doesn't make any sense. You got to suspend your disbelief in any sequel of course they're going to add things that don't make any sense but uh but what the takeaway is the ending, the ending is phenomenal and really turns things on its head and I really just want to reiterate if you haven't played it like I I really tried to stop people from jumping in the four without having",
            "start": 1176.16
        },
        {
            "text": "the ending is phenomenal and really turns things on its head and I really just want to reiterate if you haven't played it like I I really tried to stop people from jumping in the four without having played the trilogy on PS3 and some people did it anyway I 100% stand by the fact that that is stupid sure um and that you simply will not not and and there's just no way you get Uncharted Four without playing the other three like there's just no way any of it resonates with you the way it should um I just don't believe that for a second you have no attachment to these characters you don't know who Sully is you don't know who Drake is the scene in the attic for instance totally I mean I I disagree in the sense that I think people could play it I agree that you get way more out of it the just removed from I do think that Ford did a really good job of introducing the characters and why they're important even if you don't know it and again that's hard to say because I do",
            "start": 1212.92
        },
        {
            "text": "out of it the just removed from I do think that Ford did a really good job of introducing the characters and why they're important even if you don't know it and again that's hard to say because I do know it but uh the the scene in the Attic it's just like I feel like that does a good job of getting you to understand he's done things before sure you but I I just feel like it's such a waste like play the Ocarina of Time Trilogy before you play on agreed and fight for Fortune uh my top three games haven't changed so I'll go through them somewhat quickly uh number three is The Legend of Zelda: Ocarina of Time uh game changer for me uh I I put off playing that forever told my friends I didn't like Zelda I never really played one before and when Mike O'Brien finally gave me the cartridge and gave me his guide and he was like play this great game you know what I mean like you have to play it I put it in that night and say it up to 3:00 in the morning the you know night before I was to play my or take",
            "start": 1246.4
        },
        {
            "text": "and he was like play this **** game you know what I mean like you have to play it I put it in that night and say it up to 3:00 in the morning the you know night before I was to play my or take my acts which is a terrible idea don't do that I don't even know if they do the acds anymore but like it was a game that once you got into it and I I mean I'll never ever forget that I it's you know Tiger Greg Miller Story right of like the coming out of the Temple of Time being a grown-up Link and walking out into this world of Hyrule that had been bustling and amazing and colorful and it's just zombies I will and mummies and I was just like what the **** like running off and trying to figure out what happened and I always go back to in high school you know I'm playing in high school we did then one of the assignments in English class whatever in honors English was like write a college essay and compare and contrast two time periods in any of these books and I had read none of those books",
            "start": 1284.6
        },
        {
            "text": "one of the assignments in English class whatever in honors English was like write a college essay and compare and contrast two time periods in any of these books and I had read none of those books so I just wrote it about Ocarina of Time got to B Plus thank you thank you very much Mr. Kiefer but like it was that powerful of a moment for me and again it's another video game moment of what video games can be in the fact that The Legend of Zelda, which is this game that isn't voice acted and isn't amazing cut scenes that you know in this in this that and the other back then on N64 sorry there were voices in it listen yeah yeah rolling across Hyrule for hours and hours cuz it's a little bit faster than walking but like it it but like to tell me a story in that way and let me have that moment and let me connect with the Gorons in Zelda and want to know what's happening in Zora's Domain and all I mean come on that was an amazing amazing game it's crazy and this is the thing like hearing your guys' games",
            "start": 1322.72
        },
        {
            "text": "with the Gorons in Zelda and want to know what's happening in Hyrule and all I mean come on, that was an amazing, amazing game it's crazy and this is the thing like hearing your guys' games I'm like man how did I not put a Metal Gear on my list how did I not put a Zelda how did I not put an Uncharted that's great seven seven games is limited I think I remember playing Ocarina of Time in 98 um with Mike Pope who's my what up Mike, and uh I was really blown away by it I I wasn't convinced at that time that anything had to be 3D I was like very like very skeptical of this ninth grade tenth grade and uh it was a really great game now I think Ocarina of Time suffers from one thing in particular there's no Tingle in it which is a huge problem it also suffers in that it's not linked to the past yeah linked to the past an issue is awesome uh I think Majora's Mask is the better 3D Zelda game but I um for lots of reasons but I think that Ocarina of Time is an undeniable classic a very",
            "start": 1362.28
        },
        {
            "text": "to the past yeah linked to the past an issue is awesome uh I think Majora's Mask is the better 3D Zelda game but I um for lots of reasons but I think that Ocarina of Time is an undeniable classic a very important it's a 10 out of it's a very important game it's so so it's a perfect game I think it's like it it teaches you everything you need to know it gives you the sense of wonder every hour there's something that makes you go huh yeah cool you know and I say that now like I bet you that the 3DS remake is fantastic too I think they updated it in a a great great way and the the visuals of it are awesome and I think that people could play it now and it still be just as good as it ever was number two is Super Mario World we've put it on here it's been here we've talked about it before uh my my personal story with it right is that I was a Sega kid through and through Mario was always the enemy growing up I had to rep Sega and so when I I was super late to it probably seven or 8th grade going",
            "start": 1404.16
        },
        {
            "text": "story with it right is that I was a Sega kid through and through. Mario was always the enemy growing up, I had to rep Sega. And so when I was super late to it, probably 7th or 8th grade, going to Matt Noell's house, and I was there every day for a summer, we would hang out and go fishing and screw around or do whatever. And eventually, like he'd have it there, and he's like \"You should try just try it, just try.\" And I played it. Then every day he would just read comics or whatever, and I would sit there and just play Super Mario World to the point that when school started back up, I went to GameStop (not Funko land) and traded in a bunch of crap to get an SNES and Super Mario World. It's the only thing I ever played or bought for that SNES. I put it on the shelf, turned on Weezer's Pinkerton, muted the TV, and I would sit there and listen to Pinkerton on repeat and play Super Mario World over and over and over again. I mean, I can't hate on that. To this day, if I hear Pinkerton...",
            "start": 1449.36
        },
        {
            "text": "muted the TV and I would sit there and listen to Weezer's Pinkerton on repeat and play Super Mario World over and over and over again. I mean, I can't hate on that. To this day, if I hear Pinkerton, I think of Super Mario World, and if I play Super Mario World, I think of Pinkerton - it's just amazing, you know what I mean? Cuz I think probably in the same way Ocarina of Time is so seminal to me, Super Mario World was as well because that was my first real Mario game. Like, that was my Mario game, right? I guess I had a Game Boy with Mario, but like, this one was different. Great. This is my Mario and this was my Zelda. So, like you know what I mean? Like I remember in Zelda getting to the battle with Ganon or whatever, and uh when he's throwing fireballs, right? When you said that they can't see it too well, right? Can you move for a second? I don't think so, no it's not going to work. But anyway, battling Ganon... right when we got to that part, like, and I didn't know what to do.",
            "start": 1485.72
        },
        {
            "text": "it too well right can you move for the second call I don't think no it's not going to work but anyway battling on right when we when we got to that when I got to that part like and I didn't know to hit back the light balls when he threw his light I just didn't know what to do I remember talking to my Michael Bryan the next day he's like oh it's a call back to the old games you got to I'm like oh I never would have known that I never caught any prompt cluing me into that that's cool but that's the thing that was my Zelda game this is my Mario game and then my knowledge of both built on that to want to go back and play other stuff and then number one of course I make a big deal about it all the time Metal Gear Solid Peace Walker uh you know for forever and ever and ever it was Metal Gear Solid because of what it meant to me and what you know what I thought what that experience was and Po and I playing that you know all night long one night after we were in at Blockbuster with army man",
            "start": 1524.44
        },
        {
            "text": "because of what it meant to me and what you know what I thought what that experience was and Po and I playing that you know all night long one night after we were in at Blockbuster with Army Man: Sarge's Green Run was they're making a PSP Metal Gear like that's going to suck that'll be that'll be stupid oh there's gonna be Co-op BL blah and then to get that and go to that I'll never forget when they finally well actually when I went to my first and only TGS for IGN that was when they dropped the in Japan they dropped the demo or whatever and so we went back we uploaded to Ian's uh page that you could go there and get the file and put on your memory stick Duo and go get it and I remember sitting there at TGS playing on we were it was IGN was like partnered with Alienware or something but it wasn't IGN's Booth they had like a they were sharing this booth so I just sat there and like Caleb Lawson made DV tapes of me just playing there and people gathered around this booth that had",
            "start": 1558.36
        },
        {
            "text": "but it wasn't IGN's booth they had like a they were sharing this booth so i just sat there and like Caleb Lawson made dv tapes of me just playing there and people gathered around this booth that had nothing to do with Metal Gear to watch me play Peace Walker over and over and over again and I was like this seems like it's going to be awesome it seems like going to be awesome and then going to that review event in San Francisco and you walked into a room and you want to talk about a Greg Miller event it's in San Francisco it's 2 days eight or n hours a day and you walked in this room and it was just tables lined with PSPs and you just sat down with these things and you had everybody around you so and it was you know I was clowning this game out i was just destroying it but then to have like people need help and you'd go over there and co-op up with them or i would you know we i'd want to go farm over and over and over again get all the ai cores and stuff go back with Sam Bishop and sit",
            "start": 1598.48
        },
        {
            "text": "people need help and you'd go over there and co-op up with them or I would you know we I'd want to go farm over and over and over again get all the AI cores and stuff go back with Sam Fisher and sit there and go da d d d da and like then when it finally came out and we've talked about this with Jared Petty recently on the Gamescast the fact that our experience with our experience with mobile games is so different or you know portable gaming I guess because it was all right I took a train to work every day so I was I was obsessed with Metal Gear Solid: Peace Walker and it would be that all right cool on I would go there and just ping every random Wi-Fi I went by go fight the soldiers bring them in drop the ones I don't need improve my Mother Base staff all right build up Mother Base do this keep working on this and do it over and over and over again where train rides flew by and then it was the only the only time I can think of with a PSP game for sure and I guess it's kind of hazy I guess but I mean",
            "start": 1630.88
        },
        {
            "text": "this and do it over and over and over again where train rides flew by and then it was the only the only time I can think of with a PSP game for sure and I guess it's kind of hazy I guess but I mean in terms of like a game where you were sharing with somebody else where we I would make dates with people and go out Caleb and I would go to bars and play GameOverGreggy would come over to my house and we would just sit there and play Metal Gear Solid: Peace Walker to grind out and get better gear and get better things like it was so perfect for what I needed and what I wanted and it still had which you know the one thing because like obviously Metal Gear Solid 5 uh Phantom Pain takes all these things hdis them puts them on the PlayStation 4 awesome I'm glad everybody loves it the gameplay there is amazing but this Peace Walker still was metal gear it still was David Hayter and it was awesome cut scenes and it was it it was the f I always talk to talk about it right where it's really I think the first maybe only",
            "start": 1667.56
        },
        {
            "text": "Peace Walker still was Metal Gear Solid: Peace Walker, it still was David Hayter and it was awesome cut scenes and it was it it was the first I always talk to talk about it right where it's really I think the first maybe only Metal Gear that you can jump into and it makes sense from the get-go sure robot arm dude and P and whatever the hell's going on but nobody knows I mean even the people playing that but the fact but fact of it all was right is like you're this dude you're out of it you don't want to go back here's this tape from your boss your Mentor you you we've it's established already you killed this woman and she is talking do you want this Mission and he's like **** yes I have to take this Mission and go out on that and meet Solid Snake, not Strange Love, and get the horse and do all the it was just like what a **** ride that game was my God",
            "start": 1704.44
        }
    ]
}