{
    "id": 2012,
    "video_id": "Reio_Zg4vks",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Barbara Dunkelman"
    ],
    "title": "How to Swallow (w/ Barbara Dunkelman) - Love and Sex Stuff",
    "description": "Subscribe! https://www.youtube.com/kindafunny?sub\n\nSupport this show! Get the Love & Sex Stuff Shirt here!\nhttp://store.roosterteeth.com/collections/kinda-funny/products/kinda-funny-love-sex-stuff-shirt\n\nSubmit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\nWhere are you supposed to finish?\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nBarbara Dunkelman - https://twitter.com/BDunkelman\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1472486404,
    "duration": 212,
    "transcript_chunks": [
        {
            "text": "the time we were at this massage place the other day and they really got in there, Barbara Nick yes today's question comes from 43-year-old Cindy. Cindy says \"in my experience some guys will give you a warning that they're getting ready to come, leaving it up to me if I swallow or not, others no warning at all which is at times unpleasant and I think rude.\" If is there a standard guy etiquette for this? Shouldn't they always give warning signed sometimes unwilling swallower so she doesn't like it when they don't give warning. I don't think anyone does, anyone like it if you don't it gets everywhere if you swallow it it's neat it's gone sometimes it tastes good um not always sometimes a little tanky but I feel like the swallow is this beautiful beautiful gift that you don't assume you get to receive and I think that's the big important thing and like I think I always sort of give maybe it's not like necessarily A a word but at",
            "start": 0.2
        },
        {
            "text": "beautiful beautiful gift that you don't assume you get to receive and I think that's the big important thing and like I think I always sort of give maybe it's not like necessarily a word but at least some sort of non-verbal communication that the events it sounds a little like this not a warning you got a good second warning that's more than most people get in Earth you don't do that before it that's the thing on the show we talk about communication all the time this is a perfect example of that I think it's very important to like let them know what's going on and you about to cause an event like there's a thing that is going to happen it's going to be messy like no matter what it's going to be messy and weird and unpredictable so it's like I feel like you should least give the warning I think is required I think so too I got I got to be honest it's courteous for sure I don't think it's required 100% although it depends what kind of person you are I know I like the warning just",
            "start": 48.44
        },
        {
            "text": "I think it's required I think so too I got to be honest it's courteous for sure I don't think it's required 100% although it depends what kind of person you are I know I like the warning just because it it helps me know what I'm doing is good mhm the thing about swallowing that is kind of a post situation thing right it's not so much like it's the act at that point the deed is done so it's less about you know communicating like where you're at it's more just being like like the it not being a promise you talking about like not being a given it's like I think that at that point it's like it really is just kind of a bonus it's like it's so unnecessary it's just a way to take care of it I will say that there is a combination of the swallow and not having to swallow that one can use and that is the sort of as it gets closer you you use your hand you finish it off but the mouth just kind of keeps it there and you leave it open and then you kind of just let it yeah you leave it open so it",
            "start": 90.52
        },
        {
            "text": "is the sort of as it gets closer you use your hand you finish it off but the mouth just kind of keeps it there and you leave it open and then you kind of just let it yeah you leave it open so it comes out but it's not sand blasting your hair hair is okay eyelashes are the worst yeah nide your eye show you where I come from a bad deal your eye will just be like sealed shut here's the thing get to the B this sounds like a topic for another day I say we do a whole other topic just about the facial side and if it's not swallowed where does it go we should do that next time we're in Austin we should that would be great bar next time that might be great where can people find you uh well they can find me at r.com or on R's YouTube channel or if you want to just follow me and nothing else with r cuz those actually kind of weird uh twitter.com/BDunkelman and I'm BDunkelman on everything that is amazing you can follow me at Tim Gettys you can follow him at Nick_Scarpino and if you have questions",
            "start": 130.48
        },
        {
            "text": "r cuz those actually kind of weird uh Twitter.com be Dunan and I'm be Dunan on everything that is amazing you can follow me at Tim Gettys you can follow him at Nick Scarpino and if you have questions for this big beautiful show go to KindaFunny.com and fill out the form and we'll get right back to you and if you need some t-shirts in your life the ones you have right now are just RAB and have holes and **** you can go to KindaFunny.com/store and get these bad boys along with the Love & Sex Stuff shirt here you can also get Barbara's there 9/69 no till next time I love you m",
            "start": 168.04
        }
    ]
}