{
    "id": 1005,
    "video_id": "0Qnz7HNzO5A",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Final Fantasy VII and Metroid - Kinda Funny Gamescast Ep. 26",
    "description": "Tim and Colin discuss their worries about Final Fantasy 7 Remake, Nintendo gets flack for it's new spinoff games, we discuss which game series should be annualized, and we question what the most important franchise of last generation is. (Released 07.03.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1436533200,
    "duration": 4645,
    "transcript_chunks": [
        {
            "text": "Hey everybody, it's me, Greg Miller, and I wanted to let you know Comic-Con is coming up and Kinda Funny is going to be there. So if you're at San Diego, we have a bunch of stuff you can come do with us, and you don't even have to have a Comic-Con badge. On Thursday, we're going to Polite Provisions, we're doing a meet-and-greet there. 5pm, you don't need a Comic-Con badge, you do need to be 21. Don't blame me, those are the drinking laws in the United States of America. Friday, we're doing the Game Over, Gregi show at Petco Park as part of Geek & Sundry's studio stage. No Comic-Con badge is required, we're doing that at 3pm. And then I'm moderating a whole bunch of Comic-Con panels, if you do have a Comic-Con badge, so come hang out with me in the convention center. All the details are up on KindaFunny.com slash news, so head over there for the full rundown. What's up guys, welcome to the first ever episode 26 of the Kinda Funny Games cast. As always, I'm Tim Geddes, I'm joined by the",
            "start": 0.0
        },
        {
            "text": "on KindaFunny.com slash news, so head over there for the full rundown. What's up guys, welcome to the first ever episode 26 of the Kinda Funny Games cast. As always, I'm Tim Geddes, I'm joined by the coolest dudes in video games, Greg Miller, Colin Moriarty. Yay! It's your golden episode, because you just turned 26. I did. So this is your golden episode. If episodes were years, this would be how old I am. I mean, if episodes were years, the show would be as old as you are, that would make sense. Yes, but they're not, they're just episodes. Yeah, but the number is still how old you are. The numbers don't mean anything to us. Okay, this is a nice shirt, how about that? It is, I like it a lot. It's upsetting, there's a lot of origin story to this, I won't get into the whole thing, but I originally bought my pigeon shirt because I was jealous that Scott Lowe had a dinosaur shirt. Sure. And I wanted that dinosaur shirt, and they stopped selling it. So then I saw the pigeon shirt, and I'm",
            "start": 32.6
        },
        {
            "text": "bought my pigeon shirt because I was jealous that Scott Lowe had a dinosaur shirt. Sure. And I wanted that dinosaur shirt, and they stopped selling it. So then I saw the pigeon shirt, and I'm like, pigeons will do. So now I've just been on this- The dinosaurs are this guy. Yeah, this like struggle, I found the sharks, and here they are, they're the dinosaurs at the sea. So that was your story, that was like a long story? No, there's more details that we don't need to get into all that. You bought a pigeon shirt, and then later bought a shark shirt. Yeah. That was the story we just heard. Yeah, yeah, yeah. Okay. There's a Mickey Mouse shirt in there somewhere too. Yeah, it's part of your new prints. I just like all these like all over animal print stuff. It's good. It's a look. Do we still count Mickey Mouse as an animal? Mm-hmm, he is a mouse. I know, I know, don't get me wrong, I know technically he's a mouse. Yeah. But he's also a person. Guys, this is the Kind of Funny Games cast.",
            "start": 83.7
        },
        {
            "text": "count Mickey Mouse as an animal? Mm-hmm, he is a mouse. I know, I know, don't get me wrong, I know technically he's a mouse. Yeah. But he's also a person. Guys, this is the Kind of Funny Games cast. Every week we talk about video games, four topics broken up day by day, Monday through Thursday on YouTube.com slash Kind of Funny Games. Full episode on Friday at that same place. Also, you can get it early, Patreon.com slash Kind of Funny Games. It's great, you should do it. It's awesome. This one, it's worth a dollar. Yeah, yeah, yeah. Yeah, I don't know if they've been worth a dollar for a while. Oh man. But this one definitely. That's harsh. Okay, good. It's gonna be good specifically because the first topic of the day is Final Fantasy VII. Yeah. And I am so excited to talk about this. The remake's coming and I want to know you guys' thoughts on this. What's it gonna be? When's it gonna come out? Will it ever come out? What systems it's gonna be? All the questions, there's these",
            "start": 124.7
        },
        {
            "text": "The remake's coming and I want to know you guys' thoughts on this. What's it gonna be? When's it gonna come out? Will it ever come out? What systems it's gonna be? All the questions, there's these burning questions. Everyone's talking about it on the internet. Everyone's excited about it. Everyone's trepidatious, but why? Because they haven't started it. The director didn't know he was the director. That's clearly years away. That was my favorite story, was when, I think it was Nomura, right? Yeah. Was saying that, it was on Kotaku I think when they were saying that he didn't even know that he was in charge of the game. Until they saw some sort of slide show or whatever at Square Enix in Japan and he's like, wait, I'm the director of the game? And they're like, yeah, you're the director of the game. He's like, no one told me that. So off to a good start. Yep. Final Fantasy VII. Final Fantasy VII remake. Yeah, I mean, the reason people have trepidation about it is because, and they",
            "start": 163.7
        },
        {
            "text": "of the game. He's like, no one told me that. So off to a good start. Yep. Final Fantasy VII. Final Fantasy VII remake. Yeah, I mean, the reason people have trepidation about it is because, and they should, is because it's a Square Enix game coming out of Japan. So you have every reason to be fucking nervous about it. Not only in terms of its quality, but in terms of its timeliness. Final Fantasy XIII, very questionable trilogy. Some people like it, a lot of people don't. And so it makes sense to be nervous about this, but I think moreover people are nervous about it because it seems like Square Enix has a lot of balls in the air. And some pretty important balls as well with Final Fantasy XV and Kingdom Hearts III. Some very important balls together. So adding another important ball in the air when they're already juggling the clown known as Square Enix. And I don't mean that as a derogatory thing, but let's just imagine that the clown is juggling balls. You're painting this metaphor.",
            "start": 204.7
        },
        {
            "text": "air when they're already juggling the clown known as Square Enix. And I don't mean that as a derogatory thing, but let's just imagine that the clown is juggling balls. You're painting this metaphor. Exactly. I mean, two balls is usually enough. Yeah, two balls is enough. Three balls is, you know, it's getting crazy. So yeah, I think people are nervous about it because the game is so clearly in pre-production. Or just, you know, as I think the very much they use just entered production. So you're looking at 2019 probably for this game and I'd be shocked if you saw it before then. And that's like best case scenario 2019. Square hasn't had a lot of best case scenarios lately in terms of getting games out. Yeah, it's a problem just in the sense that this isn't something you do lightly. This is a game that is now 18 years old. It can't be just remade or remastered. They are releasing the PC port of it to kind of tie people over on PlayStation 4, which I respect. And I'll play it and I'm",
            "start": 248.7
        },
        {
            "text": "is a game that is now 18 years old. It can't be just remade or remastered. They are releasing the PC port of it to kind of tie people over on PlayStation 4, which I respect. And I'll play it and I'm excited about it. Actually, I'm very excited about it. But are you going to play through it? Are you just going to play it? Yeah, I'm going to play through it. You're going to beat it? Yeah. I haven't beat Final Fantasy VII since I think I was in high school. Man. Alright. Yeah, no, I'm going to play it and beat it. And I'm looking forward to it. It'll be an old kind of experience that I'm looking forward to. But this isn't a game that you just hand off to someone. It's important that they do this right, which is why I think that they could probably do it in three years, but I don't think they will. Because they have to now sit down with the script and figure out, like, well, do we want to rewrite certain parts? They have to sit down with the battle system, materia and all these kinds of",
            "start": 286.7
        },
        {
            "text": "will. Because they have to now sit down with the script and figure out, like, well, do we want to rewrite certain parts? They have to sit down with the battle system, materia and all these kinds of things. Is there anything that needs tweaking here? They have to be very, very careful with what they do with this game. This is a game that is going to sell millions and millions of copies and needs to be done right because Final Fantasy VII, while I don't think it's this incredibly sacred game that a lot of people think it is, the fact of the matter is a lot of people do think it's a very sacred game. So I feel bad for them now that it's real that they're actually doing it. It's something people have been asking for for years, but I didn't think they'd ever really do it. And I thought that part of it was the fact that they don't think they could do it. Yeah. So there's every reason to be nervous about it, but there's reasons to be excited too. So that's my thing. I'm very excited about",
            "start": 318.7
        },
        {
            "text": "part of it was the fact that they don't think they could do it. Yeah. So there's every reason to be nervous about it, but there's reasons to be excited too. So that's my thing. I'm very excited about it, but I'm just as nervous because there's no way that they're going to recapture the magic. There's no way this is going to be what people want it to be in their heads. And that's because really, that's my question, is what do you want it to be? What is it that you want? Because if you just want the exact same game, but just prettier, that's not going to happen. There's no way they'll ever do that. Should they even do that? Is there a purpose for that? And would that game even be the same release now? Now you're talking nerdy stuff. I'm going to go get coffee. I don't like Final Fantasy though. Yeah. Great. Now say it again. I started playing it and I never could get through it because it was really boring. No, I would want a scene for scene, shot for shot remake of the game. I think",
            "start": 361.7
        },
        {
            "text": "Yeah. Great. Now say it again. I started playing it and I never could get through it because it was really boring. No, I would want a scene for scene, shot for shot remake of the game. I think that's kind of how you have to treat it. It's not a reboot, right? So it's implicitly called Final Fantasy 7 Remake. Which they said that's not going to be the title. They only did that to show at the press conference at E3 that this isn't a movie, this isn't a whatever. This is a game. And to me that means, I think that, and this is what we always talk about with words needing definitions. I don't know what a lot of people think about with remake. But to me it means you remake what has already existed and you remake it again. Which means that you stay true to it. As opposed to a reboot which is like the Devil May Cry reboot from Ninja Theory or something which is a different game. Or the reboot of whatever movie has been rebooted in the last 7 years which is everything. So I personally want to",
            "start": 401.7
        },
        {
            "text": "the Devil May Cry reboot from Ninja Theory or something which is a different game. Or the reboot of whatever movie has been rebooted in the last 7 years which is everything. So I personally want to see something that's totally true to the original. I think there's something similar to Resident Evil on the GameCube compared to the PS1 one where it was very faithful but there was added stuff. That would be to me the ideal situation. I just still don't think they're going to do that. I don't either. To me, if they want to rewrite it, I think that's fine. The translation we got in the states on PS1 for Final Fantasy 7 is notoriously bad. As a lot of translations were at that point. When we were talking to Iga about Castlevania Symphony of the Night and I said to him, what is a man? He didn't know what I was talking about. And Ben Judd was talking about how that is not even in the original game of Japanese. He asked what is a person. And that's a totally different thing. So I think there's",
            "start": 438.7
        },
        {
            "text": "what I was talking about. And Ben Judd was talking about how that is not even in the original game of Japanese. He asked what is a person. And that's a totally different thing. So I think there's a lot of that kind of stuff going on in Final Fantasy 7. A lot of the translations are just bad. So if they want to rewrite it on the Japanese front to make it even better in their language and then have a proper localization like we get now, I think that's totally fine. But there are just certain things you cannot remove from the game. I think it's very dangerous to start talking about Final Fantasy 7 in a revisionist sort of way because I don't think that people that want this game want that. If that's what they wanted, they would get a new Final Fantasy 7 game which we already got with Crisis Core etc. That's kind of the problem though. This revisionist thing where if they were to rewrite it, you're talking about just making the quality of what already existed better. Like the grammar and",
            "start": 483.7
        },
        {
            "text": "Core etc. That's kind of the problem though. This revisionist thing where if they were to rewrite it, you're talking about just making the quality of what already existed better. Like the grammar and just the storytelling. Telling the same story more concisely and just better. Creating a better world with Midgar and all this stuff. But the problem is with what we've seen of the universe of Final Fantasy 7 since 7 has come out, there hasn't been anything that's been amazing. There's been some stuff that was decent. I enjoyed Crisis Core a lot. Yeah, I liked Crisis Core as well. Dirt Diserberous was obviously not very good. I mean, it's one of those things where everyone was so excited for that being a movie and continuing and stuff. But really what it comes down to is that movie was just fan fiction. Fan service is a better way to put it. It gave everyone what they thought they wanted at the time. But once they saw it, they're like, this isn't what I wanted. That's not Cloud. That's",
            "start": 522.7
        },
        {
            "text": "fan fiction. Fan service is a better way to put it. It gave everyone what they thought they wanted at the time. But once they saw it, they're like, this isn't what I wanted. That's not Cloud. That's not like why is Sephiroth back? All these questions came up and they weren't... You didn't feel fulfilled watching it. You were just like, oh this is cool, they're fighting. You know, but it just felt like a glorified CG cutscene. Which is great, but it's like that wasn't what Final Fantasy 7 was. It didn't have the humor and it didn't have the personality of the characters. And it was like a weird hot topic meets realism meets Dragon Ball thing. And we kind of saw that then go forward into the aesthetic of Final Fantasy 13. But what's interesting is I don't think, and especially now that we've seen this trailer, it obviously looks like God of the Children. It's like I don't understand how they could rewrite it without just making it more, for lack of a better term, emo. And just more",
            "start": 562.7
        },
        {
            "text": "we've seen this trailer, it obviously looks like God of the Children. It's like I don't understand how they could rewrite it without just making it more, for lack of a better term, emo. And just more fitting the aesthetic of the rest of the Final Fantasy 7 universe as opposed to the one standalone thing that is the original game. Sure, yeah. And this is the hazard of doing something like this. I don't really feel bad about it because I often said that the financial imperative is for Square to do this because they can make a lot of money doing it. And at some point you do have to listen to your fans. Final Fantasy 7 for many younger gamers put Square on the map when they were still Squaresoft. And it wasn't for me. Many of us were playing Square games before that. But for a lot of people that was a come to Jesus moment about westerners liking Playstation games, liking role playing games, liking Japanese games. So it's a game that holds a special place in people's hearts. Although I",
            "start": 618.7
        },
        {
            "text": "that was a come to Jesus moment about westerners liking Playstation games, liking role playing games, liking Japanese games. So it's a game that holds a special place in people's hearts. Although I don't disagree that they can go in different directions with Final Fantasy 7 or they can go in different directions with other games they remake. I think with 7 you have to be very careful because people are going to have a certain expectation of what it's going to be. And I don't necessarily think it's controversial to say that most Final Fantasy 7 fans want a prettier Final Fantasy 7. With cutscenes and beautiful environments and beautiful character models. I don't think they should fuck with the fighting system. I don't think they should fuck with the materia system. And have the same flow through the game. That's the one thing I still know the game in my head pretty well. Like where it goes and the places you visit. And those things are still important. So I'd be disappointed if they",
            "start": 665.7
        },
        {
            "text": "through the game. That's the one thing I still know the game in my head pretty well. Like where it goes and the places you visit. And those things are still important. So I'd be disappointed if they added a new town or a new playable character. That's not what your charge is right now. What you're charged with doing over the next few years is remaking what already exists. And I understand that the biggest problem, and people have brought this up in the past and I think it's a really important thing to think about, is that the people at Square Enix as in any game developer are creative people. And they want to make games and they want to implement their own ideas. And to be put on a task like this might be exciting for some people. But for many people it's going to be harrowing and it's going to be what they don't want to do. Because they have a certain confine in which they have to stay within. The rules have already been made. The parameters exist for Final Fantasy 7. And so they're",
            "start": 709.7
        },
        {
            "text": "to be what they don't want to do. Because they have a certain confine in which they have to stay within. The rules have already been made. The parameters exist for Final Fantasy 7. And so they're going to have to dance the tightrope dance of what can we do and get away with but how true do we want to keep it. And the fact is that they can't... The worst thing is that at the end of the day they're just going to get picked apart for what they did wrong. If they did try to perfectly remake the game, no one's going to be there like, oh good job guys. It's going to be like, oh you fucked this up, why didn't you do that? Like oh this character design is off. All these little things. And that's if they do it perfectly. If they try to actually remake what was already done. If they do what is going to end up happening and just kind of like make a spiritual remake. I don't even know. What is it going to be? What would you even call that? I think they should just call it Final Fantasy 7. And",
            "start": 744.7
        },
        {
            "text": "to end up happening and just kind of like make a spiritual remake. I don't even know. What is it going to be? What would you even call that? I think they should just call it Final Fantasy 7. And just be like, this is Final Fantasy 7. And that's... So like, yeah what you would call something like that? A spiritual successor? A spiritual remake? I don't know. What I know is that they have their work cut out for them. What I know is that this game is nowhere near coming out. Years away. Years away. And that's what's the most interesting to me about this entire announcement is we've talked about it so many times. Like this being what Square needed to do to please the fans and all that stuff. But it's funny that it happens now because now is the time when I'm like, this is not when they need to do this. They should have done it a couple years ago or a couple years from now. Like specifically with Kingdom Hearts and Final Fantasy 15. It's like, let's get those going. Let's get those good.",
            "start": 783.7
        },
        {
            "text": "to do this. They should have done it a couple years ago or a couple years from now. Like specifically with Kingdom Hearts and Final Fantasy 15. It's like, let's get those going. Let's get those good. Or else cancel one of them and make this the priority. Not that I would want them to do that. Specifically not this fucking long after I've waited for these games. But it's like, don't announce this third thing. It's just like, they're either going to work on it and it's going to take away from the other two games or they're not going to work on it and everyone's going to be pissed off that this game just keeps being shown in really obscure long CG trailers that, you know, a couple points down the line. It's going to be like, oh that character you saw in that trailer doesn't even... not even in the game anymore. As an outsider to this whole Square Enix thing, that's the whole point of what's going to happen with this. It's going to be trailer after trailer, talk after talk. Every show now",
            "start": 819.7
        },
        {
            "text": "the game anymore. As an outsider to this whole Square Enix thing, that's the whole point of what's going to happen with this. It's going to be trailer after trailer, talk after talk. Every show now they're going to ask about these three games and what's happening and the news will never be good. The news is never going to be, alright it's almost done, it's coming out this September. Finally that trigger is going to fall, or beephole they should say, for Kingdom Hearts, for Final Fantasy they're working on too with the guys going on their road trip. But it's like, now this is hanging over their head, it's looming larger than ever, you know what I mean? And I thought Playstation Experience was a weird thing to come out, toy with everyone's emotion, then just do the PC port, but then come out at E3 and say, oh no it is, what are you doing? What's the plan here? Well it's clearly something that happened in between. You think it's reactionary? It's everybody's reaction to it? Yeah I think,",
            "start": 859.7
        },
        {
            "text": "at E3 and say, oh no it is, what are you doing? What's the plan here? Well it's clearly something that happened in between. You think it's reactionary? It's everybody's reaction to it? Yeah I think, I don't know for sure, these decisions are made lightly, but it was about seven months, six and a half months between the announcement of the PC port and then the Final Fantasy VII remake which is just entering production now. And mind you we still have no idea who's making the fucking game, which is not a good sign either. So we know that Square Enix leadership is producing and directing it, but that doesn't really mean anything. Miyamoto is directing or producing fucking Starbucks, it doesn't mean anything. Unless you're the director or producer of that team, but a lot of these things are more symbolic or like, you know, like Inafune for instance is helping create, directing and producing ReCore with a studio that is 5,000 miles from Tokyo. So how intimate do you think his relationship",
            "start": 899.7
        },
        {
            "text": "symbolic or like, you know, like Inafune for instance is helping create, directing and producing ReCore with a studio that is 5,000 miles from Tokyo. So how intimate do you think his relationship really is with Armature on a day to day basis? Probably not very. And I'm not saying the game is going to be good or bad, but it's just something to keep in mind as an ancillary kind of thought. But the problem with VII is indeed, was this a reactionary move? And if so, good on them because they're listening to what people want. But, and I still think Final Fantasy VII Remake sells more than Final Fantasy XV. I don't think that's out of bounds to say, I don't think that's out of control to say, I think Final Fantasy VII Remake is going to be fucking huge. And it's going to be huge regardless of when it comes out or how good it is. But I agree with what Greg's saying in the sense that Square Enix is setting a weird optic issue for themselves where it's like, well, what do you do? Like, where",
            "start": 942.7
        },
        {
            "text": "when it comes out or how good it is. But I agree with what Greg's saying in the sense that Square Enix is setting a weird optic issue for themselves where it's like, well, what do you do? Like, where are your games? Like, when are they actually going to come out? And they have all these Western games coming out, which is great, you know, something like, you know, Tomb Raider, for instance, but which they're publishing. But it calls up interesting questions about like, how are they using their own teams and their own internal resources? And also, how are they tapping outside sources? Because as the stories that I was reading after III said, you know, Cyber Connect was connected to the Final Fantasy VII thing. And I haven't seen that since, which means that it's probably just a fleeting rumor. But I don't believe they're making this game internally. And one of the big questions you have to ask is who the fuck is making it? And then from there, you kind of go into a direction of, OK,",
            "start": 987.7
        },
        {
            "text": "rumor. But I don't believe they're making this game internally. And one of the big questions you have to ask is who the fuck is making it? And then from there, you kind of go into a direction of, OK, when is it going to be ready? And when are you going to announce the release dates for these other games that people are really waiting for? Because I know some people were mad at me when I said it, but Final Fantasy XV, the demo, the fact that they're patching the demo is still some of the stupidest shit I have ever heard in my life. Why are you doing that? You put the demo to get feedback and then you put it in the main game. Who cares about the demo anymore? It shows to me that they have a whole whacked out view of when these games should come out and how much time they should be taking on them. That's why I still say Final Fantasy XV probably fall 2016, Kingdom Hearts fall 2017 probably the earliest if not 2018, Final Fantasy VII 2019. It would have been nice for it to be ready on the",
            "start": 1021.7
        },
        {
            "text": "them. That's why I still say Final Fantasy XV probably fall 2016, Kingdom Hearts fall 2017 probably the earliest if not 2018, Final Fantasy VII 2019. It would have been nice for it to be ready on the 20th anniversary, but that would mean that they would have to accelerate the shit out of this. And I will say as an aside that Square has an interesting example, although an unusual example of how they can do this game, which is in Final Fantasy IV. When they remade IV on the DS, they made the characters like Chibi and all these kinds of things and they rewrote some of the story and balanced the difficulty, but it was the same game. And that's the example. I want to see a retranslation, I want to see pretty graphics and all sorts of things and throw in a few elements and balance things that weren't unbalanced and get rid of some shit that sucked. Or add some new things in if you really want to, but make sure it doesn't affect the fabric of Final Fantasy VII. So I actually think that is a",
            "start": 1059.7
        },
        {
            "text": "unbalanced and get rid of some shit that sucked. Or add some new things in if you really want to, but make sure it doesn't affect the fabric of Final Fantasy VII. So I actually think that is a great example of a game they've already done. Exactly, but so my question to you, Colin, is what is the percent chance that they'll do that compared to doing something else? And what do you think that something else is? Do you think that they would change the battle system to be more like 13? There's a lot of rumors about that. I know, but where do those rumors come from? The rumors are just rumors of people worried, you know? Sure, but this is the problem with Japanese game rumors, as I think a lot of fans of Japanese games know, is that some of the rumors are just unfounded, you don't know where they come from. A lot of them come from sites that we don't read and sources that are totally trusted that we just don't know. So it's hard to boil all that stuff down sometimes. So yeah, you have to",
            "start": 1100.7
        },
        {
            "text": "they come from. A lot of them come from sites that we don't read and sources that are totally trusted that we just don't know. So it's hard to boil all that stuff down sometimes. So yeah, you have to take things on a case-by-case basis with those kinds of issues, with the rumors and stuff like that. I think it's about 50-50. I think that it's going to be an internal fight with the team. And the good news is that you have some people involved in the leadership that worked on the original game and I think they're going to want to stay true to it. Aside from that is that they probably have looked at that game over the last 18 years and been like, I wish I could change something about this and now I can. It's not just a static on a black-bottom fucking PlayStation 1 disc anymore. Now it's something that they actually can get into the code and mold again. And so while I have faith that the leadership will keep it true, I also have faith that the leadership will now be able to rectify the",
            "start": 1136.7
        },
        {
            "text": "that they actually can get into the code and mold again. And so while I have faith that the leadership will keep it true, I also have faith that the leadership will now be able to rectify the issues that they were not able to rectify the first time around. So it's a super dangerous game, I don't know. Fucking with the battle system is a huge mistake. And that's what scares me. That is going to be the news that I'm most excited to hear. Is if the battle system, what they do with it, and if they change it. And it almost worries me though because it's just like, I don't know that the battle system makes sense with the aesthetic of Final Fantasy 7, what it is now, and what this is going to be. I think it does. Well because what we've seen of this CG trailer is that it's Advent Children. And from Advent Children the battles look like crazy ass Dragon Ball shit. That doesn't lend itself to Active Time Battle. Of we're just going to walk and hit and walk and hit, you know what I mean? So",
            "start": 1174.7
        },
        {
            "text": "from Advent Children the battles look like crazy ass Dragon Ball shit. That doesn't lend itself to Active Time Battle. Of we're just going to walk and hit and walk and hit, you know what I mean? So it's just like, I'm going to be shocked if they actually go through with that because they're going to want it to look right and to look modern and to look like a 2019 game. Yeah but ATB is still random encounters. It's turn based in the sense of stamina. So it's not turn based like Dragon Quest but it is turn based in the sense that you are taking turns. It's just that some guys go quicker than you and so eventually it stacks up where they lap you and stuff like that. So I think that is still classic. That is a classic way to fight in a Final Fantasy game. And they shouldn't fuck with that because then it has the law of unintended consequences. How does that affect the materia system? How does that affect... Like the materia system will not work properly if you don't have a system like",
            "start": 1217.7
        },
        {
            "text": "because then it has the law of unintended consequences. How does that affect the materia system? How does that affect... Like the materia system will not work properly if you don't have a system like that. It just doesn't work because then they become more like summons maybe but that's not really the intent of materia. The intent of materia is to make yourself stronger and attach it to your weapons and your accessories. And then it has the effect of how does it affect the enemy designs and the enemies and how many enemies there are and all these kinds of things. They can't fuck with that shit. That's what I'm saying though. I can't imagine... So ok. We're really in this game. In an Advent Children's style game. We're going to see ice monsters. Little like ice triangles. You know what I mean? Well they don't have to be triangles. In other words like I'm always thinking about the intro with the soldiers with the guns. And like the harrowing intro of Final Fantasy VII which is a fucking",
            "start": 1261.7
        },
        {
            "text": "Well they don't have to be triangles. In other words like I'm always thinking about the intro with the soldiers with the guns. And like the harrowing intro of Final Fantasy VII which is a fucking great intro. On the train and they go up into the tower. And you meet a bunch of humanoid enemies with guns. They're soldiers. They're Shinra like whatever guys. And you could... I think they're Shinra. I don't really remember anymore. You could imagine a situation where like in my head when I saw the three of them I was like I can't wait to see what this looks like. You know? There's still a place for it first of all. I know a lot of people think JRPG systems like that are archaic in a sense. Like ok. You're going to run around. You can't see the enemies. You magically appear in a battle with them and then you take turns fighting each other. I'm just saying there are games that do that very well still. And I don't think that's going to be a massive issue. So yeah there's like weird polygonal",
            "start": 1300.7
        },
        {
            "text": "and then you take turns fighting each other. I'm just saying there are games that do that very well still. And I don't think that's going to be a massive issue. So yeah there's like weird polygonal fucking garbage enemies. Well I was thinking about how cool are those Shinra soldiers going to look like in the remake. And how real are they going to look. And how is Cloud going to look in that fight with his sword and all this. I don't know. I think I'm talking less about that though and more about how the actual fight looks. Because it's not so much about the gameplay. Because the gameplay should be that way. But it's more about the aesthetics of what we're seeing. Is it really just going to be Cloud just kind of standing there bouncing waiting for the bar to go up and then walking up and doing a slash. Because from what we know from what the rest of the Final Fantasy VII universe is. It's never like that. It's throwing the sword up, jumping, grabbing, slicing, doing a million freaking",
            "start": 1337.7
        },
        {
            "text": "a slash. Because from what we know from what the rest of the Final Fantasy VII universe is. It's never like that. It's throwing the sword up, jumping, grabbing, slicing, doing a million freaking combos on him. You know what I mean? It's more like the Final Fantasy XIII battle system. Yeah if they put Final Fantasy XIII battle system which is fine. Final Fantasy XIII battle system is actually very good. I enjoy it a lot but it's not Final Fantasy VII. And that was actually one of the only good things about Final Fantasy XIII was actually the fights. I don't know man. There's just wasn't enough of them. That's the thing is that there are no answers and I don't think there are any answers at all. Period. That's the thing is what I'm saying is that I don't think they know. I think right now they're trying, they're probably rewriting the script and trying to figure out how the fuck they're going to do this. And it's all super nebulous. Yeah exactly. And the fact that the director didn't",
            "start": 1370.7
        },
        {
            "text": "they're trying, they're probably rewriting the script and trying to figure out how the fuck they're going to do this. And it's all super nebulous. Yeah exactly. And the fact that the director didn't know he was the director is all you fucking need to know about this project and how quick it was. Coming from fruition which is why I think it's a direct reaction to the ultimate troll moment at PSX in December. But that's nuts though that they're releasing that game. That they are releasing a PS4 native version of Final Fantasy VII and then going to do this. Even if it is a couple years later. It's confusing to say the least. I guess it's confusing. I don't think it's that confusing. I think it's them saying they expected it to be done earlier. It was supposed to be out by now. And them saying, to me it's not confusing at all. It's them saying here you have your Final Fantasy VII game and good fucking luck if you think you have any idea when you're going to get the next one. Which is",
            "start": 1413.7
        },
        {
            "text": "to me it's not confusing at all. It's them saying here you have your Final Fantasy VII game and good fucking luck if you think you have any idea when you're going to get the next one. Which is their whole MO. I still can't believe there are people that think that Final Fantasy XV and Kingdom Hearts III are like a year away. That's the shocking thing to me. I'm like you're out of your mind. But Goofy said it. So that's how Square Enix works. And I appreciate them. They clearly have a lot of money to burn. Because the burn rate on Final Fantasy XV must be astronomical at this point. And they're still going to put it out and they're patching the demo. I don't know man. They're a confusing company. But I do appreciate them. I think that this is a good arc forward for them. Now I just want to see Dragon Quest XI. Yeah. Of course you do Colin. Alright. So we're moving on into the second topic. Which is sponsored by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture",
            "start": 1449.7
        },
        {
            "text": "to see Dragon Quest XI. Yeah. Of course you do Colin. Alright. So we're moving on into the second topic. Which is sponsored by Loot Crate. Would you classify yourself as a geek, gamer, or pop culture nerd? Then Loot Crate is the subscription box for you. For less than $20 a month you get 6-8 items of gamer and pop culture licensed gear, apparel, collectibles, unique one of a kind items, and more. Make sure to head to lootcrate.com slash kfgames and enter the code kfgames to save $3 on any new subscription. Every month there's a different theme and you're guaranteed $40 or more worth of items all curated around that theme. They're all inspired by classic movie and video game stuff. You guys know this. We do it every month so it's great. This is the loot you deserve and the loot you need right now. Basically Loot Crate is like a friend who knows what you love and surprises you with an awesome present every month. And they ship to over 13 different countries. You have until the 19th at",
            "start": 1487.7
        },
        {
            "text": "now. Basically Loot Crate is like a friend who knows what you love and surprises you with an awesome present every month. And they ship to over 13 different countries. You have until the 19th at 9pm pacific to subscribe and receive that month's crate. So when the cutoff happens, that's it. You're never getting that crate again. So you gotta get on that. Go to lootcrate.com slash kfgames enter the code kfgames and save $3. It's gonna be cool. It's gonna be awesome. You should do that. You didn't tell me what the theme is this month. I don't know what the theme is. Cyber's coming gone. I need to know what's next. Yeah. I don't know. It wasn't in the thing. They're figuring it out. Thank you Loot Crate for your support. So this topic is about Nintendo. Something very near and dear to my heart. So at E3 they come out. They announce all these new games. People are thrilled. Some of that statement is true. Some of that statement is not. One of those games was Metroid Prime Federation Force.",
            "start": 1528.7
        },
        {
            "text": "So at E3 they come out. They announce all these new games. People are thrilled. Some of that statement is true. Some of that statement is not. One of those games was Metroid Prime Federation Force. People lost their mind. They were so excited. One of those games was Zelda Triforce. I don't remember what it was called. Who cares? Triforce Trinkets. Yeah. So there's that thing. And people did not like this. The internet uproar. They were angry. They were upset. The internet got mad? Oh the internet was really mad. I don't believe that for a second. So then Mega64 made a hilarious video that you guys should check out. That was making fun of the internet. Making fun of Nintendo. But really they're also making fun of Nintendo because that's how that all works. Yeah. It was ridiculous. It was really funny and they essentially pretended they were terrorists. And were a terrorist group that was upset that a real Metroid Prime was coming out. You're saying it's a funny video for Mega64. You",
            "start": 1567.7
        },
        {
            "text": "really funny and they essentially pretended they were terrorists. And were a terrorist group that was upset that a real Metroid Prime was coming out. You're saying it's a funny video for Mega64. You were also saying they've crossed the line. This might be too much. But that's Mega64. I'm aware that's Mega64. I love Mega64. But watching the video I was like, good lord. They just do what we would never do. Because I'm a punk ass bitch. That's why. They got balls. They really do got balls. They got three balls. Just like Square Enix. Three balls but not in the air. No. No. They got the good balls. Firmly in their sack. Firmly in their sack. Mega64. So they did this and then our boy Reggie Fils-Aime came out and he's just like, we get it. Look. Like we understand people don't, are very upset about this. Right? But you guys need to play it in order to really understand what we're doing. And we want to make sure that we're breathing new lives into our franchise. And you're talking",
            "start": 1607.7
        },
        {
            "text": "upset about this. Right? But you guys need to play it in order to really understand what we're doing. And we want to make sure that we're breathing new lives into our franchise. And you're talking specifically right now about Metroid. About Metroid. The reaction to Metroid. Yeah. The reaction to Metroid. Because people had a lot of issue with the Zelda game too. But that seemed to be a little less aggressive. But you know why? Because they know they're getting the Zelda Wii U that they want. They're getting Zelda Wii U. They've also had Zelda games in recent times. So, you know, the last Metroid game was Other M. Before that it was Prime 3. And Other M, a home run. Yeah. I mean, Other M. Well, we all thought Samus sounded like. Yeah. Other M had a lot of issues. But it wasn't horrible. I feel like Other M gets a bad rap for being garbage. But it really just wasn't good. Yeah. You know? I think there's something to be said there. Although, again, Prime 2008 was like the last real great",
            "start": 1647.7
        },
        {
            "text": "like Other M gets a bad rap for being garbage. But it really just wasn't good. Yeah. You know? I think there's something to be said there. Although, again, Prime 2008 was like the last real great Metroid game. So, for him to come out and say this. You're saying Metro Prime 3. Yes. Corruption. Right. Yeah, I just want to make sure you were. You said Metroid Prime 2008, which would be 3. Sorry. The last Metroid Prime. Which was what? Oh. Oh 2? Oh 3? Yeah. The last Metroid Prime game was 2008, was Metroid Prime 3 on the Wii. Right. Okay. And that was a great game. It was as good as the first, but still, it was great. So, there's no new Metroid Prime game announced. Out of nowhere they announced this Metroid Prime Ball Hunters. And then they renamed it Federation Forest. And there was Hunters on DS and all this stuff. And this looks kind of like a weird successor to that in some way. That no one asked for at all. And I think that's what we're dealing with now, is the fact that everyone's",
            "start": 1687.7
        },
        {
            "text": "on DS and all this stuff. And this looks kind of like a weird successor to that in some way. That no one asked for at all. And I think that's what we're dealing with now, is the fact that everyone's like, No one asked for that. Everyone asked for this. Why aren't we getting this? Why are we getting that? I kind of just want to know what you guys' thoughts are on this. Because, for me, I definitely agree with the people that are upset. I'm like, why aren't we getting this? I totally understand that. But at the same time, it's like, I don't think that this game takes the place of that game. And the fact that it has the Metroid name almost doesn't matter. It's a spinoff thing. And they're just using Metroid because the style of game is a shooter type thing. And it's like, Metroid's there. Shooters. It's like Mario. Just because a Mario party game's coming out doesn't mean that a Mario Kart game's not being made. You know? Yeah. Having hung out with Colin Moriarty long enough, and done",
            "start": 1733.7
        },
        {
            "text": "Shooters. It's like Mario. Just because a Mario party game's coming out doesn't mean that a Mario Kart game's not being made. You know? Yeah. Having hung out with Colin Moriarty long enough, and done Colin Moriarty live long enough, I already know one of the arguments he's going to make about all this, right? And correct me if I'm wrong, sir. Mm-hmm. Love her. Is the fact that Metroid historically doesn't sell. It sells fine, not juggernaut blockbuster. So that's why you're not getting the Metroid game you want. Now the problem with that, our line of thinking when we apply it to this other game, Ball Hunters, is the fact of why apply the Metroid franchise to that. If it already isn't selling, it's not going to sell this weird not Metroid game that you don't really want thing. You know what I mean? And that's the thing about Mario, right? Mario sells, and we already know Mario can be applied to a million different things, and the fact that Mario Tennis might come out doesn't stop the",
            "start": 1771.7
        },
        {
            "text": "I mean? And that's the thing about Mario, right? Mario sells, and we already know Mario can be applied to a million different things, and the fact that Mario Tennis might come out doesn't stop the next 3D Mario from coming out, right? Whereas with this, I think they're clearly searching for what to do with Metroid, right? Metroid Other M was a different direction of like, all right, let's see, Jesus. Prime critically acclaimed, everybody loves it, these gamers love it, but it's not selling. Can we sell it if we base it around a story and put the Remember Me guy in there and all this stuff? No, we can't. So what's the next way we play it? We put out the collection of all the Primes, right? It doesn't sell juggernaut. It's not a mega success, so now you go and reapply here. It's them searching, and they're taking this thing around trying to figure out what the hell they can do with it. It's similar in a way to what Sony did with Ratchet and Clank, right? Or Insomniac, really, I guess.",
            "start": 1812.7
        },
        {
            "text": "and they're taking this thing around trying to figure out what the hell they can do with it. It's similar in a way to what Sony did with Ratchet and Clank, right? Or Insomniac, really, I guess. But of just like, all right, we know Ratchet does well here. What if we do something, oh no, nobody likes those, nobody likes that. Okay, let's get back to just making Ratchet games. Like, where do you go and where do you put Metroid is the big thing. And to Collin's point of the fact that they don't sell well, and that's why you don't get the Metroid game you want, I've said it before on our programming, I'm like, from an outsider's standpoint, as somebody who didn't grow up with Nintendo but appreciates what Metroid does, right, is I would say go backwards with it and make a simple 16-bit Metroid, put it out on the eShop or whatever, get people stoked about that, excited about that, new fans come to it, everybody knows it's this awesome thing. It's 14 bucks, 20 bucks, everybody downloads it,",
            "start": 1851.7
        },
        {
            "text": "put it out on the eShop or whatever, get people stoked about that, excited about that, new fans come to it, everybody knows it's this awesome thing. It's 14 bucks, 20 bucks, everybody downloads it, plays it, loves it, and then you start to build the groundwork, or lay the groundwork to get yourself the next really big Metroid game. That would be amazing. I love that. I mean, I feel like that is the right way to go in terms of the core gamer and what we would want from Metroid if we're not going to get another Prime. Even if we are getting another Prime, I kind of want that. That sounds pretty good. Yeah, I mean, there's a few things that people ignore about this situation, I think. A, like Greg brought up, Metroid historically doesn't sell, and the whole series, 11 games, have sold about 18 million copies, which is nothing. What was the Souls number today? Yeah, we were comparing it to Dark Souls. Namco Bandai announces that Dark Souls 1 and 2 sold 8 million copies. So, like, right",
            "start": 1883.7
        },
        {
            "text": "18 million copies, which is nothing. What was the Souls number today? Yeah, we were comparing it to Dark Souls. Namco Bandai announces that Dark Souls 1 and 2 sold 8 million copies. So, like, right there you see a game that on average is selling three times more than a Metroid game. And Metroid has this cache with everyone, but it's not a game that people buy. I think that, you know, I like Metroid. I love the original Metroid, I love Metroid Prime, I love Super Metroid, although I think it's overrated. You know, there's a lot of good Metroid games to play, but the fact of the matter is people treat this like a marquee title, and it simply isn't. That's why Retro hasn't been making them. There's another thing that we ignore with Retro particularly is that people want Retro to make the game, and the possibility exists that they're autonomous enough to say, like, we don't want to make a Metroid game. And that's possible, too, and if that hypothetical is possible, then you have to",
            "start": 1921.7
        },
        {
            "text": "game, and the possibility exists that they're autonomous enough to say, like, we don't want to make a Metroid game. And that's possible, too, and if that hypothetical is possible, then you have to hypothetically assume that Nintendo then goes around and is like, well, what do we do with this franchise? If anything, remember, Metroid sells especially soft in Japan, and them going to Team Ninja, I think, was a way for them to be like, can we get the Japanese audience on board, and can we also make something that the rest of the world will like and buy, and the answer, of course, was no. So, to them, it's not so obvious what to do with Metroid. I think Greg makes a great point that if that's the case, then why put Metroid in and attach it to anything? I think it's that Nintendo's saying, well, we're trying to give you something, at least in the universe, while we figure out what we're going to do with this. As I've said before, Nintendo is in the space in between right now, so what do",
            "start": 1965.7
        },
        {
            "text": "we're trying to give you something, at least in the universe, while we figure out what we're going to do with this. As I've said before, Nintendo is in the space in between right now, so what do people want? Them to announce a Metroid game that they're going to strand on the Wii U so it sells half a million copies and no one gives a fuck about it? It's smarter for them to say, anything we have in production for Metroid, we need to shift over to the next console, and we need to be quiet about it. We have nothing to announce at this time. So, it's entirely possible. People are way overreacting to this. You're right, Tim. This game, existing with probably a budget of a couple million dollars, maybe, is not going to stop them from giving $15 or $20 million to a studio to make a real Metroid game. One doesn't exist at the exclusion of the other, and I think that is an important point to make, and you made it. And I think, in addition to that, though, it's not even just the fact that",
            "start": 2010.7
        },
        {
            "text": "game. One doesn't exist at the exclusion of the other, and I think that is an important point to make, and you made it. And I think, in addition to that, though, it's not even just the fact that they're two different games. It's that this is a 3DS game. That is a Wii U game, or whatever the hell, NX. Throw it up. But it's a totally different market. It's a different thing. This game could have just been Federation Force. Simply Federation Force. But why? Even if Metroid doesn't sell, Federation Force isn't going to either. Metroid at least helps a little bit in it. Also, it does what Nintendo does and create a Nintendo universe. You have all these different characters and they have all these different spin-offs and all this different stuff. Could the counter-argument be the fact that we're sitting around right now tossing around Metroid sales, it doesn't sell compared to Dark Souls, when Metroid Federation Force comes out and does even worse? Is the argument, at least to a Metroid",
            "start": 2035.7
        },
        {
            "text": "sitting around right now tossing around Metroid sales, it doesn't sell compared to Dark Souls, when Metroid Federation Force comes out and does even worse? Is the argument, at least to a Metroid fan's opinion, going to be, well, of course, now Nintendo is looking at those numbers and thinking it means even less? I don't think that's the case. I still believe in my heart that there's a Metroid game in development. I just don't think that they can say anything about it right now. Because there's nothing to say. The game might be embryonic or in pre-pro. It might have just entered development. It could be an NX game in which they're not going to talk about it at all. Metroid isn't dead. They know what Metroid means. And I agree with Greg. I would love to see a really robust, as we saw with Axiom Verge, a robust 2D side-scrolling Metroid, which we had seen on GBA and DS. But, you know, people just really overestimate the power of Metroid. I think Nintendo is probably, even though they",
            "start": 2093.7
        },
        {
            "text": "Axiom Verge, a robust 2D side-scrolling Metroid, which we had seen on GBA and DS. But, you know, people just really overestimate the power of Metroid. I think Nintendo is probably, even though they have to do some PR spin, to be like, alright, we hear you and all these kinds of things. And at their board meetings, they're probably like, who the fuck cares? No one buys Metroid anyway. So, we're going to make a Metroid game to please these people. But it doesn't matter that they're upset. The only people... Let's back up. The only people that care about this are the Nintendo hardcore fans, who are fewer and fewer as everyday passes. And when you diminish even that group of people to the people that care about Metroid, it's a much smaller group. And Nintendo's thoughts are in the exact opposite direction, which is like, they're going to be there anyway. So, what can we do? And they're going to buy Metroid when it comes out. And some of these people, if not a lot of them, are going to buy",
            "start": 2129.7
        },
        {
            "text": "direction, which is like, they're going to be there anyway. So, what can we do? And they're going to buy Metroid when it comes out. And some of these people, if not a lot of them, are going to buy this Federation Force game. So, let's not worry about them. What can we do to make Nintendo relevant again in the console space? And what games and franchises can we create, and I say create, to engender the goodwill of a new generation of people? Not regurgitate the same shit over and over and over again. And in a sense, them not doing another Metroid Prime half-assed not from Retro, but from someone else is a great example of them kind of treating their IP with care. Which I think is something that they, with the exception of Mario, do pretty well. So, Nintendo is going in a different direction. As we've said so many times, this is a new Nintendo. And I can feel it. I know it. This is a different Nintendo. And everything they're doing is different. So, Metroid fans should take heart that a",
            "start": 2174.7
        },
        {
            "text": "As we've said so many times, this is a new Nintendo. And I can feel it. I know it. This is a different Nintendo. And everything they're doing is different. So, Metroid fans should take heart that a Metroid game will come out. The people I really feel bad about are not the Metroid fans, and not Nintendo, but the people making this game. Because they're probably making a pretty good game, and everyone hates it already. It's not their fault. See, that's the thing about Nintendo games, though, is that whenever they're announced, whenever they're first talked about, everyone fucking jumps on it and hates it. And the media criticizes it, and all the comments like, this isn't what I want, blah blah blah, why this, why that? But then it happens, it comes out, and I think generally it's always a surprisingly positive reaction. We saw it with Splatoon, where when that game was announced, everyone was like, this is fucking stupid. Why isn't this Metroid? If we're gonna have a shooter, give me",
            "start": 2212.7
        },
        {
            "text": "surprisingly positive reaction. We saw it with Splatoon, where when that game was announced, everyone was like, this is fucking stupid. Why isn't this Metroid? If we're gonna have a shooter, give me Metroid. Yeah, why is everyone obsessed with Metroid? And then all this stuff, and they're so mad about all this stuff. It's in space. No, you're in space. Spies! But even with DS games, when these things are announced, these smaller things, it's like, why am I not getting a Zelda? Why am I not getting whatever? But then they come out, and you're like, oh man, I love all these games. So, I don't know, we'll see. I didn't play Federation Force, so I don't know if it's good or not. But going on to the Zelda game, so many people are like, I don't want this Zelda bullshit, I want a core Zelda game. I don't want a Zelda spinoff. I do too. That's what I felt when I saw that, but I'm like, it doesn't matter, they don't care what I want. But that's the thing though, Zelda is a franchise that we've",
            "start": 2254.7
        },
        {
            "text": "I don't want a Zelda spinoff. I do too. That's what I felt when I saw that, but I'm like, it doesn't matter, they don't care what I want. But that's the thing though, Zelda is a franchise that we've gotten so many core games from. You already see it on the horizon, that's the difference. There's light at the end of the tunnel for Zelda. You already see it, and you're like, oh my god, Skyrim Zelda is going to be amazing, right? Whereas Metroid, I think the fans feel adrift. Yeah, but even on the, not the console front, but the handheld front, it's like, we got Link Between Worlds, we got Ocarina, we got Majora's Mask, like the remakes, but still. There is a good amount of Zelda games, and when you add on the virtual console, when you add on all this other stuff, it's like, we don't need more Zelda core games. We don't need any of this stuff, but when it comes to the spinoffs, I'm actually happy this game is happening. Like, Four Swords Adventures was fucking awesome. I remember when it",
            "start": 2290.7
        },
        {
            "text": "Zelda core games. We don't need any of this stuff, but when it comes to the spinoffs, I'm actually happy this game is happening. Like, Four Swords Adventures was fucking awesome. I remember when it first happened on the GBA remake of Link to the Past, when you could play multiplayer, I was like, whoa, this is a really cool idea. And then they released the GameCube one. Granted, it was way too hard, and you needed way too many peripherals to actually make it work. When it did work, oh my god. It's like, it was a flip on the Zelda game, and it was fun, and it was unique. And that's what Nintendo's great about, is like, taking experiences you know and love, and then changing it up just enough to make you be like, whoa, this is a whole new experience, and I love this, and this is fun. Four Swords Adventures was fun. I loved playing with my friends. The co-op slash kind of multiplayer thing, that Nintendo kind of made a thing again with New Super Mario Bros. and all that stuff. And like,",
            "start": 2328.7
        },
        {
            "text": "Adventures was fun. I loved playing with my friends. The co-op slash kind of multiplayer thing, that Nintendo kind of made a thing again with New Super Mario Bros. and all that stuff. And like, that's their thing, and Mario 3D World and all that. And even Smash Bros. You know what I mean? Like, it's competitive, but it's just fun, and you can kind of just mess around and all that stuff. Right, it's not a big deal when you lose. You don't feel like you screwed up. It's like, they kind of have this really nice style of games that it's competitive fun. And this Zelda game looks like that. So, I don't know why people need, it's not, we're not not getting a Zelda game because of the Zelda games being made. Yeah, I agree with that too. And to me, two things stood out to me with that Zelda game. One, the 3DS is really showing its age. That game looks awful in terms of its aesthetic. But that brought to mind at E3 another thing to me, which is that they're going to make another Zelda game and",
            "start": 2380.7
        },
        {
            "text": "One, the 3DS is really showing its age. That game looks awful in terms of its aesthetic. But that brought to mind at E3 another thing to me, which is that they're going to make another Zelda game and it's going to be on their next handheld. They're not quite in the space in between 3DS yet, but I think they're pretty close. Because they cannot continue to extract blood out of that stone for much longer. That thing is so weak. Well, you forget that. NX is going to unify the platforms. Yeah, we'll see what happens with NX and what even that is. But 3DS is so weak that, and I'm not a graphics guy at all, but when I look at games like that, I'm like, this doesn't look bad, it just looks old. And eventually they're not going to be able to get away with that anymore. They're already kind of not getting away with it, I think, in some respects. And so, again, it's them saying, we have the space in between Zelda for you right now and we'll have the real Zelda. We just released a real Zelda",
            "start": 2419.7
        },
        {
            "text": "not getting away with it, I think, in some respects. And so, again, it's them saying, we have the space in between Zelda for you right now and we'll have the real Zelda. We just released a real Zelda game two years ago on 3DS. I don't know what the fuck people want. But you'll get your next Zelda game. So, again, this is a Nintendo that is riding things out right now. They're certainly riding the Wii U out and they're going to ride the 3DS out soon, you have to imagine. These games will migrate over and you're going to see your 3D Mario game and you're going to see your Zelda game and you're going to see this Wii U Zelda game probably ported over at some point. And they'll have something to say when it's ready. You see, Ubisoft had the luxury of announcing Watch Dogs, as I've said before, without announcing its platform. And everyone knew, but you couldn't really say. You can't really do that again. So while I expected that Nintendo might have been bold enough to do it with something",
            "start": 2457.7
        },
        {
            "text": "without announcing its platform. And everyone knew, but you couldn't really say. You can't really do that again. So while I expected that Nintendo might have been bold enough to do it with something like Metroid, they clearly are not going to say anything about the games until they have something to say about the hardware. And in a way, that is a unified message and a smart message, especially considering how woeful Wii U's rollout was. We don't even know what the fuck it was. So yeah, this is a Nintendo that's going to have weak offerings for a while, but it's because it's laying in wait and strengthening its future, which I think is actually the smarter move, instead of just shitting everything out now on a console which is totally fucking dead. And a handheld which is, for all intents and purposes, just not able to run their visions probably for much longer. People need to relax a little bit. Zelda will be fine. Metroid, you haven't seen the last of Metroid. It's impossible to",
            "start": 2495.7
        },
        {
            "text": "and purposes, just not able to run their visions probably for much longer. People need to relax a little bit. Zelda will be fine. Metroid, you haven't seen the last of Metroid. It's impossible to imagine you've seen the last of Metroid. You probably haven't seen the last of F-Zero or anything like that either. It's just like, all in good time. Nintendo put themselves in a bad space and they have to lay in the bed that they made. It happens. Get into bed, Miyamoto. Now. Lay down. Alright, topic number three comes from Patreon, from our boy John Ewing. I don't know how to pronounce U-E-H-L-I-N-G. Ewing, yeah, I would say Ewing. Alright, cool. John Ewing. It's a long one. Shuei Yoshida spoke about not being a fan of annualized series at DICE 2015. However, there's no denying that companies like Activision and Ubisoft make a lot of money doing so, i.e. Call of Duty and Assassin's Creed. Despite being money makers, the rush to make yearly deadlines and corporate obligations brings into",
            "start": 2535.7
        },
        {
            "text": "like Activision and Ubisoft make a lot of money doing so, i.e. Call of Duty and Assassin's Creed. Despite being money makers, the rush to make yearly deadlines and corporate obligations brings into question the quality because of bugs, as we've seen with Assassin's Creed Unity, or a perceived lack of innovation or stale gameplay and story from previous editions, like Call of Duty Ghost. Are there any series that you envision being on the cusp of annualization? Which of your beloved series of games would you love to see annualized, with the caveat that its normally extremely high standards may take a hit in order to reach the yearly quota? For example, instead of 9-10 scores every three years, it would generally get 7-8, with occasional 6-9s for stale-slash-excellent iterations. I think that's actually a good way to look at it. Thanks and keep up the great work. P.S. to Greg. M-I-Z. Z-O-U. Is anything on the cusp of annualization? I mean, no? Right? What would we think would be on the",
            "start": 2577.7
        },
        {
            "text": "actually a good way to look at it. Thanks and keep up the great work. P.S. to Greg. M-I-Z. Z-O-U. Is anything on the cusp of annualization? I mean, no? Right? What would we think would be on the cusp? You figure... I'm thinking. Like, the Assassin's Creed model, right, where it's different studios switching off, it seemed for a while that they were trying to do that with Arkham, right? And it wouldn't have been annual-annual, but when they brought WB Montreal into the fray, people were like, oh, now we're gonna start getting an Arkham game every year, every two years or whatever. Or a DC game, you know what I mean? Even if it wasn't Batman, but that type of thing. Exactly, exactly. And now WB Montreal, of course, this week, was announced that these things are out there, hiring for a new IP, so we'll see what that means, exactly. But on the cusp, I mean, you have to talk about a franchise that's super successful, and most people are smart enough now, I feel, to know that that's what",
            "start": 2616.7
        },
        {
            "text": "IP, so we'll see what that means, exactly. But on the cusp, I mean, you have to talk about a franchise that's super successful, and most people are smart enough now, I feel, to know that that's what he's describing. Was it Tom? John. John Ewing. What John's describing there is the fact, the matter. If you go to this annualization scale, you start to lose quality, you start to tire out the audience. And so, how do you make that work? I really feel like, and Colin, you can correct me if I'm wrong, Tim obviously, too, I'll allow it, for once. Assassin's Creed feels like the last franchise that kind of jumped on that annualization train, and now it's like, we're out of the station. I don't think you can pull that off again and do it. I mean, it's interesting, because I feel like we're in a renaissance of the annualization thing, and it's a very different type. Now it's way more important, but back in the PS2 era, there were so many games that they were annualized. In addition to the",
            "start": 2661.7
        },
        {
            "text": "a renaissance of the annualization thing, and it's a very different type. Now it's way more important, but back in the PS2 era, there were so many games that they were annualized. In addition to the Madden's and stuff like that, like Tony Hawk, Need for Speed, these games just happened every year. And then eventually, that style died out for a bit, and then it did come back with Call of Duty and Assassin's Creed. Guitar Hero. Oh yeah, exactly. Guitar Hero, Rock Band, and all that. I don't know, do you have any good examples? No, I mean, where my mind went in terms of recent is Assassin's Creed. I don't see anything jumping aboard that, because I don't think that the model is necessarily sustainable. I do disagree with what he's saying, that you exchange quality for regularity, because that doesn't necessarily have to be true. And I think Call of Duty is actually an example of that being true. Activision has the means to have three studios plus basically every one of their other",
            "start": 2703.7
        },
        {
            "text": "that doesn't necessarily have to be true. And I think Call of Duty is actually an example of that being true. Activision has the means to have three studios plus basically every one of their other studios jump in and out to help with Call of Duty in such a way that the same studio isn't responsible for the game every year, because that would not be possible. So, Call of Duty is on a three year dev cycle, which is normal for a game. Three years is a normal cycle for the creation of a game. So, you don't necessarily have to sacrifice it if you have the means in which to create top tier AAA games, which, whether you like Dislike or like Call of Duty, they're not bad games. Not even remotely are they bad. I've said before, and I'll say it again, Call of Duty has the best gunplay of any game. Like, they've just totally nailed it. Why companies don't just copy the way Call of Duty feels is totally beyond my understanding. But, what he is right about is the staleness factor, and I think that",
            "start": 2734.7
        },
        {
            "text": "they've just totally nailed it. Why companies don't just copy the way Call of Duty feels is totally beyond my understanding. But, what he is right about is the staleness factor, and I think that that is the big concern with a lot of publishers, because Call of Duty sales are not lowering, but they are plateauing. And what people have seen, I think, in the industry over the last two years or so is a great example of what happens when you leave and disappear, and then reappear with the game, and that game is Grand Theft Auto 5. Which essentially was annualized. It was annualized, and it was being done by a lot of the same teams too, and I think that they were extracting as much as they could out of that engine, and they saw great commercial and financial success. But what they didn't see is what they saw with Grand Theft Auto 5, which was a ubiquitous crossover game. Cultural phenomena. Exactly. Grand Theft Auto 3 and Vice City and San Andreas were great games, and people enjoyed them",
            "start": 2784.7
        },
        {
            "text": "what they saw with Grand Theft Auto 5, which was a ubiquitous crossover game. Cultural phenomena. Exactly. Grand Theft Auto 3 and Vice City and San Andreas were great games, and people enjoyed them outside of the gaming realm, mostly because PS2 was selling so well by the time San Andreas came out, over 100 million PS2s were out there. So, it was volume, right? And that's why people learned it. With GTA 4, when GTA 4 came out in 2008, there were not that many consoles out there. There were maybe 40 million at that time? Yet GTA 4 was a phenomenon that pushed hardware. What Rockstar saw was, this is the way we should be doing things. Making big, meaty games that we can stand behind, we invest a lot of money in the front, we get a lot of money behind it, and then we get a lot of money back afterwards. Plus we make really meaty DLC, which they did with The Ballad of Gay Tony and The Lost and the Damned, which were great pieces of DLC. I wish they'd do that for 5. I think they're focusing",
            "start": 2826.7
        },
        {
            "text": "Plus we make really meaty DLC, which they did with The Ballad of Gay Tony and The Lost and the Damned, which were great pieces of DLC. I wish they'd do that for 5. I think they're focusing more on GTA 5. But then they just went quiet again. And then they came back and they made all of their money back in one day from the development of Grand Theft Auto 5, plus hundreds of millions of dollars, presumably, in profit in a very short amount of time. And that probably raises the bells at Ubisoft and Activision being like, we don't have to support all these studios. Rockstar North is the studio that's making these games. And we can just support a 3 or 4 or 500 person team, plus our satellite teams and our PR people and our home office and all that kind of stuff. And then make a lot of money on the back end if we're more patient. And so I think what we're seeing is not necessarily a renaissance of annualization, but the exact opposite, which is the reconsidering of annualization that has",
            "start": 2862.7
        },
        {
            "text": "on the back end if we're more patient. And so I think what we're seeing is not necessarily a renaissance of annualization, but the exact opposite, which is the reconsidering of annualization that has happened for probably the last 10 years or so. And a way that they can pull back the reins a little bit and be like, we can be smarter with our money by investing more in the front and getting more in the back because this is more of an event. And that's why Call of Duty is plateauing. The sales aren't going down, but they're not going up. And that should be a worrying sign because a lot of these Call of Duty games are already in development. But I think that's the way they look at it though, is they're not putting all their eggs in that basket. That's just another thing they do. So it's like, whereas GTA, that's it. They just do that and that's their event or whatever. But then it's like, with this, I feel like with Call of Duty and Assassin's Creed, obviously Ubisoft makes a ton of",
            "start": 2906.7
        },
        {
            "text": "like, whereas GTA, that's it. They just do that and that's their event or whatever. But then it's like, with this, I feel like with Call of Duty and Assassin's Creed, obviously Ubisoft makes a ton of different games. So it's like, they can annualize. They have this cash cow, the reliability to get the money here, but then have the other things to get the money there and there. And it's just like, there's not too many devs that have that kind of reach, but Ubisoft, Activision, they are. Sure, but I think that Assassin's Creed is the canary in the coal mine, I think, because Assassin's Creed is big and it's going to be profitable and it's going to do well this year. And it looks fun. I'm not going to play it, but it looks fine. But here's the thing, I think demonstrably, if not anecdotally, excitement for Assassin's Creed is going down. And they're locked into this now. And the series is clearly coming to an end as well because it has to. I mean, they're getting to almost to modern day.",
            "start": 2951.7
        },
        {
            "text": "excitement for Assassin's Creed is going down. And they're locked into this now. And the series is clearly coming to an end as well because it has to. I mean, they're getting to almost to modern day. The game has to wrap up at some point. Then we go to space. Yeah, right. They probably will. I think that annualizing Assassin's Creed was actually a huge mistake. Because Assassin's Creed, in my opinion, I want to put that in my opinion, was never good enough to justify it being out every year. And so there's like two tiers of Assassin's Creed games, the ones that people accept and then the ones that are like the in-betweens, right? That people are like, well, Brotherhood wasn't really an Assassin's Creed game. I'm like, well, it was an Assassin's Creed game. What would have Assassin's Creed looked like if there were only four of them and they were fucking awesome? People stopped and focused and were like, let's see what we can do with this. Push the boundaries. Exactly. And I think",
            "start": 2985.7
        },
        {
            "text": "looked like if there were only four of them and they were fucking awesome? People stopped and focused and were like, let's see what we can do with this. Push the boundaries. Exactly. And I think Ubisoft, yeah, they make money and I appreciate their candor in saying we make these games every year because the market demands them every year and that's true. But could Assassin's Creed sell 15 million or 20 million copies if it disappeared? And is that a relevant thing to ask yourself? Because then you don't have all these dueling studios that you own that can be making other games doing the same thing. And I think that Ubisoft might be taking a hint at this because I was surprised to not see Watch Dogs 2 this year, which is clearly in development. And I'm not saying it's coming out this year, but I'm surprised I didn't see it at E3. And this might be showing a more careful approach to these games, a more judicious use of assets and resources, which I think Sony is really good at doing,",
            "start": 3029.7
        },
        {
            "text": "but I'm surprised I didn't see it at E3. And this might be showing a more careful approach to these games, a more judicious use of assets and resources, which I think Sony is really good at doing, which is why you will never see an annualized, they only have one annualized game, which is MLB. And that is a studio, Sony San Diego, that is totally dedicated to that game. And this also brings up a point that I brought up to Rammer at EA Sports when we were talking about NHL 16, which was, are these games eventually not going to be annualized too? In other words, are you going to make a platform? We often talk about it with Gran Turismo, which I think would be a game as platform and I think we're going to see that. And he was like, that is the, you know, I'm paraphrasing, but he basically said in the interview, like, that is kind of what we think is going to happen. And so I think the annualization thing is collapsing. I don't think you're going to see it. It's not like it's not an",
            "start": 3062.7
        },
        {
            "text": "said in the interview, like, that is kind of what we think is going to happen. And so I think the annualization thing is collapsing. I don't think you're going to see it. It's not like it's not an earthquake that's going to bring it all crumbling down now. You're going to start seeing diminishing returns because there are more games to buy, there are better quality games to buy. And when something like, what's a good example, like Uncharted 4 is a great example. When Uncharted 4 comes out, well, it's been four years since we saw Uncharted, you know, and that means something to me. I'd be less excited about Uncharted 4 if I, or if it was really Uncharted 6 and I had just played 3 or 4 and 5, you know, the last year and two years ago. Same thing with Fallout, right? We all flipped out to finally have Fallout 4 announced and know something about Fallout. Well, it's because it's been gone forever. We're excited to see it again. Whereas Assassin's Creed, like when Kotaku will leak",
            "start": 3098.7
        },
        {
            "text": "to finally have Fallout 4 announced and know something about Fallout. Well, it's because it's been gone forever. We're excited to see it again. Whereas Assassin's Creed, like when Kotaku will leak Assassin's Creed, you're like, all right, well, I don't even need to read it because I knew this was coming, I'm not excited. Where is it going to be? Exactly. Where is it? Once the time. Cool. Done. And there is a big difference, like there's a strata between the developers and really the publishers that seem to treat their IP with greater care and I think Bethesda is a great example of that. And then the stakeholders that are trying to make as much money, as much as humanly possible, as soon as humanly possible, which is Activision. And I'm not saying one is better than the other, but I'm saying that people feel much more positively about Bethesda than they do about Activision because Bethesda doesn't shove their games down people's throats every year. Bethesda could easily take the engine",
            "start": 3136.7
        },
        {
            "text": "that people feel much more positively about Bethesda than they do about Activision because Bethesda doesn't shove their games down people's throats every year. Bethesda could easily take the engine for Skyrim, could have taken the engine for Skyrim, given it to three different studios and been like, you make Elder Scrolls 6, you make Elder Scrolls 7, you make Elder Scrolls 8, your game comes out 2015, your game comes out 2016, your game comes out 2017. They could easily do that. There are fucking studios that fall all over themselves to make a fucking Elder Scrolls game or a Fallout game, but they don't do that. They did that with New Vegas and New Vegas was a game that took two years or three years, I guess, to make and it was awesome. And then they just disappeared. You know? You have to kind of hit and run like that to treat your IP with care. I think Ubisoft is certainly starting to bend the curve towards Activision in a way that makes me a little bit uncomfortable because I still",
            "start": 3171.7
        },
        {
            "text": "kind of hit and run like that to treat your IP with care. I think Ubisoft is certainly starting to bend the curve towards Activision in a way that makes me a little bit uncomfortable because I still think they're the most real, regular AAA publisher out there. I think you can learn a great deal by the more judicious use of IP that you see from something like Microsoft with Halo or Gears. I don't know. It's a dangerous game to play to oversaturate and annualize things in the AAA space. I do think there's room in the A space to annualize games. Yeah, there's a question of what should be annualized and whatever. I think it's when we get away from story and you talk about gameplay. You always talk about Castlevania, right? If they were to put out side-scrolling Castlevanias every year, you'd buy them and be thrilled. And they did. And that's the thing. We saw it in action and it was fucking awesome. It was glorious. It was a glorious time to be a DS owner and a GBA owner. But then they",
            "start": 3205.7
        },
        {
            "text": "buy them and be thrilled. And they did. And that's the thing. We saw it in action and it was fucking awesome. It was glorious. It was a glorious time to be a DS owner and a GBA owner. But then they stopped and whatever. So there are games that exist outside of the AAA realm that could be annualized because it is about gameplay. The experience is gameplay. The experience is not necessarily story. Two Mario games. That's how I feel about them. I say that and everyone bitches about it at the same time. It's like, whatever, dude. If it's an annualized game, cool. Just keep giving me it. With Mario Maker, we'll see that. To rattle off things, of course, Patapon for me, because I'm just playing that for the fun. So do that, right? So Patapon, I would think about Shovel Knight as a recent example, Hotline Miami, Rogue Legacy. I would love a Rogue Legacy every year. With a new dungeon, new castle to go down and take everything down. Those games where it's like, I don't give a flying fuck",
            "start": 3243.7
        },
        {
            "text": "Hotline Miami, Rogue Legacy. I would love a Rogue Legacy every year. With a new dungeon, new castle to go down and take everything down. Those games where it's like, I don't give a flying fuck about the story. I'm just here to play and have fun playing. That's what I want. Just give me that. Yeah, games that are cheap to make with low overhead that only have to sell 100,000 units to become profitable at $20 a piece is really the way to go. And I think that's totally possible, but again, it conflicts with the annualization as a platform as opposed to annualizing a product. And I think that this is a conundrum that needs to be overcome by some brave publisher. And I still think that the publisher that can do it and I think might do it first is EA. Because I think they have to do the math to say, we don't really need all of these studios making these games every year. We can take EA Canada and have them spend three years on a beautiful hockey game that we can then support after that. And",
            "start": 3283.7
        },
        {
            "text": "say, we don't really need all of these studios making these games every year. We can take EA Canada and have them spend three years on a beautiful hockey game that we can then support after that. And they don't need to worry about getting these things in a box. People don't appreciate how hard it is. These guys get a lot of shit. It is really fucking hard to make a video game. And they're making a game in nine months. Nine months! Same with the Madden team, all these sports teams. Yeah, so do San Diego, the guys do Madden, the guys do FIFA. People like to shit on EA, but the fact of the matter is those games are really hard to make. It's just unfortunate that those developers are put in that position where they have to make sacrifices as they did with NHL 15 last year, which was fucking awful on PS4 and Xbox One in terms of feature set because they didn't have time. So imagine a world where EA Canada had time and they could support a product for years and not have to worry about",
            "start": 3326.7
        },
        {
            "text": "awful on PS4 and Xbox One in terms of feature set because they didn't have time. So imagine a world where EA Canada had time and they could support a product for years and not have to worry about churning games out on an annual basis. It seems like the annualization thing is, like I said, certainly going to collapse. Not necessarily due to financial pressures, but due to the dearth of creativity when you have that kind of pressure. And I think Rockstar is the proof in the pudding, man. Grand Theft Auto is a fucking phenomenon because they do not fuck with it. And they treat it with care. And they could so easily fuck with Grand Theft Auto. Like I just said with Bethesda and the engine for Skyrim and the engine for Fallout 4, they could have been like, here you go, make a Grand Theft Auto game. You have two years. Grand Theft Auto, Chicago, Las Vegas. And they just don't do it. And they fucking make an enormous amount of money. I don't know. It's a complicated question. It's a good",
            "start": 3357.7
        },
        {
            "text": "game. You have two years. Grand Theft Auto, Chicago, Las Vegas. And they just don't do it. And they fucking make an enormous amount of money. I don't know. It's a complicated question. It's a good question though. Thank you so much, man. Ewing. Moving on to topic 4. Once again we are sponsored by Topps. Thank you so much, Topps. Star Wars Card Trader is the official Star Wars digital trading card app available now exclusively on the App Store and Google Play. Open, trade, and collect cards entirely online. Your favorite characters, vehicles, and locations from the Star Wars universe can be traded and collected anywhere at any time. Download today and for a limited time only get 5 or more free packs per day. Get the first cards from Star Wars The Force Awakens in vintage inspired 1977 Star Wars designs. Star Wars Card Trader is currently the only place to get Star Wars The Force Awakens merchandise. Collect from 30 years of officially licensed Star Wars trading cards from the vintage",
            "start": 3410.7
        },
        {
            "text": "Wars designs. Star Wars Card Trader is currently the only place to get Star Wars The Force Awakens merchandise. Collect from 30 years of officially licensed Star Wars trading cards from the vintage era through to today. With new cards being released every single day. Classic moments like Together We Can Rule the Galaxy as Father and Son, the medal ceremony, I Find Your Lack of Faith Disturbing, the arena battle in Genosis, all of them are there. Classic locations, Hoth, Bespin, you know what's up. From the team that brought you the award winning and top grossing baseball app Topps Bunt, download Star Wars Card Trader today. Head on over to Topps.com slash Kinda Funny. That's T-O-P-P-S dot com slash Kinda Funny. Thank you. Tim. What up? What is the update on the Watto card? The Watto card? Do we know about the Watto card? I do not know but we should look into that. There's a chance it's there. I hope it's the future version of Watto. Can you look for us? Star Wars Card Trader app?",
            "start": 3454.7
        },
        {
            "text": "Do we know about the Watto card? I do not know but we should look into that. There's a chance it's there. I hope it's the future version of Watto. Can you look for us? Star Wars Card Trader app? Watto. Download it now. Thank you. Thank you Kevin. Use the code Topps.com slash Kinda Funny. Don't screw this up for us Kevin. So, once again we are going to respond to the user questions and comments. If you want us to respond to your comments go to the Kinda Funny forums at Kinda Funny dot com slash forums. Go to the Gamescast forum and then leave your questions in there and we'll get back to you. Just like we're about to do to Lucas Betta. Lucas Betta! He wants to know what are the most important franchises that began last generation? That began last generation? Uncharted. Gears. Yeah, Gears. Uncharted. Assassin's Creed. Sure. I'm running through my shelf. Dark Souls. Batman. Yeah, the Arkham games. Sure. Dark Void. No, I don't know about that one. That game was pretty rough. Ash and Olaf",
            "start": 3494.7
        },
        {
            "text": "Uncharted. Assassin's Creed. Sure. I'm running through my shelf. Dark Souls. Batman. Yeah, the Arkham games. Sure. Dark Void. No, I don't know about that one. That game was pretty rough. Ash and Olaf North Korea are just saying everybody. I feel like there's some that we're... Resistance. Yeah, there are more than that. Dead Space. Yeah. It was just important franchises? Yeah. The most important. The most important. I feel like the most important are Uncharted and Gears. Those are now the two... Synonymous with their franchises. Or their consoles. The consoles, right? I mean, Microsoft still has Halo but Gears is up there. It's their other. Yeah. It's Uncharted. It's hard with Sony because when you think Sony, I don't think there is one game that you like. Yep, Sony in the same way that Halo is Microsoft. You don't think it's Uncharted? No. But I think that Uncharted would be it. Yeah. If you had to choose one. But for some reason, Uncharted doesn't have the same... I don't know what",
            "start": 3532.7
        },
        {
            "text": "is Microsoft. You don't think it's Uncharted? No. But I think that Uncharted would be it. Yeah. If you had to choose one. But for some reason, Uncharted doesn't have the same... I don't know what it is, but it doesn't have the same thing Halo does in terms of the link to the system. Sure. For a while they were trying really hard with LittleBigPlanet. That's from last generation. Yeah. We're putting Sackboy out there but then that kind of feels like it fizzled with LittleBigPlanet 3 launching broken and then nobody caring. Yeah, no one really does care about LittleBigPlanet, that's true. For a while it was doing real hot and then it just fell off. Oh, I believe E2 was huge. Yeah. But they made a mistake by... Oh, the Guitar Hero games. Oh yeah, and Rock Band. Yeah, that's really good. That's a good one. No. Didn't those games start on PS2? Oh, you're right. Yeah, that's PS2. Damn. Well, Rock Band. Rock Band. It's still kind of a... Yeah. That's a splinter of Guitar Hero. Still though,",
            "start": 3610.7
        },
        {
            "text": "a good one. No. Didn't those games start on PS2? Oh, you're right. Yeah, that's PS2. Damn. Well, Rock Band. Rock Band. It's still kind of a... Yeah. That's a splinter of Guitar Hero. Still though, I'd say Rock Band is different enough than Guitar Hero. Sure. That it gets its own nod. I think you're giving a nod. It gets the nod. I don't know. Yeah. That's all I can... Infamous. Yeah, I mean, yeah. Now we're just naming anything. Now we're just naming things that are... Now we're just naming things. We've gone down the list. Uncharted and Gears. We should have moved on. So, we're moving on. Interested on your thoughts on Sony promoting a Kickstarter in their press conference. Will this be something that happens again? Yes, it will be. And I said this, I think, on Colin and Greg. I was shocked by people's reaction to this because this is something I've been saying for years now. Because this isn't the first time Sony has done this. And... With Amplitude, right? They did it with Sports",
            "start": 3646.7
        },
        {
            "text": "by people's reaction to this because this is something I've been saying for years now. Because this isn't the first time Sony has done this. And... With Amplitude, right? They did it with Sports Friends, which was an even bigger example. Because I was like... I remember saying at the time, two, two and a half, three years ago, whatever it was, would be like, this is kind of weird, isn't it? Like, they're promoting this game and they have a blog post pointing to a Kickstarter. I'm like, if you believe it enough, you should just pay for it. And I said the same thing with Amplitude, which I think was fucking nonsense. Because they own that IP. So, it's different with Sports Friends, which is just a third-party game. They own Amplitude. And they still were like, okay, we'll give you the right to make a Kickstarter for it. So, I thought that was weird when that didn't resonate with anyone. I stopped talking about it. So, I was shocked. I think people just don't pay that close attention.",
            "start": 3700.7
        },
        {
            "text": "to make a Kickstarter for it. So, I thought that was weird when that didn't resonate with anyone. I stopped talking about it. So, I was shocked. I think people just don't pay that close attention. So, to a lot of people, this was the first time Sony ever did this. But it is not the first time Sony has ever done this. So, yeah, I think you'll see more of it. I understand why things are unsavory to people. It is weird. But you have to understand, there's a lot of complicated shit with this IP. Sega owns this IP. Sony is clearly going to help fund it in the back end, probably. It's unclear. I don't know. I don't see how you can make a game like Shenmue for $5 million. Doesn't make any sense. So, there are a lot of questions to be asked. But I am more shocked about how people are acting like this is a new thing Sony has done when Sony has done this before. That was the biggest thing I walked away from, actually, with it. I feel like it's a game that wouldn't happen without Sony",
            "start": 3734.7
        },
        {
            "text": "like this is a new thing Sony has done when Sony has done this before. That was the biggest thing I walked away from, actually, with it. I feel like it's a game that wouldn't happen without Sony intervening. So, can we, I mean, it's like, yeah, I mean, for Sports Friends, a little bit different. Amplitude, a thing you own. But for this game, right, that is tied up and there's so many different threads to it. Even Amplitude. Amplitude would never happen if it wasn't for this. That's just a game that's just not going to sell that well. Period. And I feel like it's going to sell better because they had a Kickstarter. That just kind of brought back the kind of publicity. And I think Shenmue is a perfect example, too, where it's like, the type of conversations being started now because they're doing this, whether or not they're negative, it's a way to go redness for sure. Right. It's one of those things like it's similar to when just in general Kickstarter happened and Colin had problems",
            "start": 3772.7
        },
        {
            "text": "doing this, whether or not they're negative, it's a way to go redness for sure. Right. It's one of those things like it's similar to when just in general Kickstarter happened and Colin had problems with it and stuff. I'm just like, well, I want that game. Like, it's not going to happen any other way. And granted, there's the examples of games that clearly would have happened without Kickstarter. But if this is how this game has to be to make it happen, okay, I'm fine with that. You know what I mean? Yeah. And I guess for me, it's like, it's definitely unsavory and it definitely is weird. But whether or not it would happen if it didn't happen, if there wasn't a Kickstarter, to me, that's the first thing. Just like, whatever. This game wouldn't have happened unless there was a Kickstarter. But on top of that, it's like, even if the game would have happened, I'm just supporting the thing I want. Like, if it's just an extra option, you don't have to do it. And it is as unsavory and weird",
            "start": 3803.7
        },
        {
            "text": "But on top of that, it's like, even if the game would have happened, I'm just supporting the thing I want. Like, if it's just an extra option, you don't have to do it. And it is as unsavory and weird as it is. It's like, whatever. If I want to support this thing, I'm happy there's an option, too. It's weird that they did it during their press conference, but at the same time, that's also the best promotion for a Kickstarter ever. Hey, everyone's watching this thing. I'm going to make it right now. Go do this thing now. That's business, man. That's smart. It's literally, hey, I want your money right now. I'm going to tell you something that's going to get you real excited. Alright, cool. When I finally convinced you to give me the Pat-a-Pound rights and I start my Kickstarter, I'm going to do it a similar way. Probably have PSX, though. That'll be good. I'm excited about that. Dan Phillips wants to know, are we fans of retro game collecting and have we ever thought about doing it",
            "start": 3846.7
        },
        {
            "text": "to do it a similar way. Probably have PSX, though. That'll be good. I'm excited about that. Dan Phillips wants to know, are we fans of retro game collecting and have we ever thought about doing it ourselves? Yeah, I'm a big fan of it. I have a big retro game collection. But I feel like it's something that will always exist, but the art of doing it is kind of waning because of the digital revolution. It's more important to me that these things are available digitally for everyone to play at some point as opposed to having a cartridge of an obscure game that is only playable on a cartridge. At some point, you have to worry about making sure these things are here for generations. History. Yeah. Yeah, I respect it. I'm a fan of it in terms of looking in collections and going through people's collections or being at the store. Whenever we go to a PAX and walk into the little things and marveling over cartridges, I remember. But do I do it myself? No. I really hate having collections. When",
            "start": 3881.7
        },
        {
            "text": "collections or being at the store. Whenever we go to a PAX and walk into the little things and marveling over cartridges, I remember. But do I do it myself? No. I really hate having collections. When I was growing up, I was very much like, if I wanted the new game, I had to hustle and trade in other stuff. So I was always trying to cycle out of collection, not keep a library going. When I was back in Missouri this last time, I was walking downtown, went into Slackers, which is the store in Columbia that resells video games and stuff. They had this huge collection of Genesis games, and we had just gotten the Retron. So I started pulling things off shelves and I had four cartridges in my hands. I was like, no, put them all back. I'm not going down this road of bringing them home to our small San Francisco apartment and trying to figure out where the hell they are for us to do two Let's Plays and never do anything again with them. I try to keep games over there on the shelf that mean",
            "start": 3920.7
        },
        {
            "text": "San Francisco apartment and trying to figure out where the hell they are for us to do two Let's Plays and never do anything again with them. I try to keep games over there on the shelf that mean something to me, like a bunch of Master System stuff and a signed copy of Infamous. I took a photo last week of Metal Gear Solid on the PlayStation 1. I try to keep the stuff that means something to me and everything else I'm not too worried about. I'm a huge fan of that stuff because I love retro games and I'm a hoarder when it comes to this shit. I like collections. I like having physical stuff. So the idea of having all the games that meant something to me, even in a small way, like, oh, I rented that once. That's weird, but it means something to me. There's something about having it that I'm like, I love this. But then you really have to question, is this worth going down this rabbit hole? Because I know how I get. If I bought Crash 1, I'm going to need Crash 2 and 3. If I buy Spyro 2, I",
            "start": 3962.7
        },
        {
            "text": "like, I love this. But then you really have to question, is this worth going down this rabbit hole? Because I know how I get. If I bought Crash 1, I'm going to need Crash 2 and 3. If I buy Spyro 2, I need to buy the first one and the third one, even if I didn't play the third one. I have this completionist thing in me where it's like, I need to just go crazy with all of it. It's the same thing with my Blu-rays. It's the reason I try not to buy comics, because that's just a rabbit hole of death. But when it comes to the retro games, it's like, I know one day I'm going to cave, and I know one day I'm going to spend thousands of dollars buying all my games. I can envision a future where I have a cool man cave theater, or whatever space you want to call it, where it's a nice TV and all the consoles are organized, out, and accessible. And when I do that, having Kevin come over and drill through the back of the wood to have it all go down one hole for every system. And then the walls being",
            "start": 4007.7
        },
        {
            "text": "are organized, out, and accessible. And when I do that, having Kevin come over and drill through the back of the wood to have it all go down one hole for every system. And then the walls being shelved and having everything. But that's not possible in San Francisco. That's when we sell this company to Google and I go retire to Columbia. It's interesting, but I definitely do really, really respect the people that do it. It's always interesting to see how into it they get. Sam Claiborne at IGN, whenever he gets excited about these random things that I never heard about, that's fucking cool. There's this whole ecosystem of people that buy and trade and all that stuff, and I'm super interested in that, even if that's definitely not something I'm... I don't care about having something just because it's rare. I do care about having the rarest version of things I care about. I love that I saw this happening. Bless you. Yeah, Colin looked very concerned for a second. I don't know where that",
            "start": 4047.7
        },
        {
            "text": "it's rare. I do care about having the rarest version of things I care about. I love that I saw this happening. Bless you. Yeah, Colin looked very concerned for a second. I don't know where that came from. But more importantly, Kevin has updated us. Uh oh. There is a water card. Yay! So he's a junk dealer. Thank you very much, Kevin. Good job. Goat Choker wants to know, why do indie devs suck at announcing release dates? Because they're a small team. Yeah, it's hard. I think that a lot of them are afraid to commit to dates ahead of time because they know they can get squashed pretty easily by a AAA release that happens the same day, which is unfortunate. And I also think that they have to send the games through cert and often get games kicked back to them, so certification is hard to get through. And they're typically less experienced at doing it. So when the game is catastrophically broken, certification is a really rigorous and weird thing for a game to go through. Where you have to",
            "start": 4097.7
        },
        {
            "text": "And they're typically less experienced at doing it. So when the game is catastrophically broken, certification is a really rigorous and weird thing for a game to go through. Where you have to make sure, you know, do you have the trademark logo after PlayStation every time you use it? Are you using the right button things? Is this clear that this is online? There's a lot of random shit that gets kicked back in certification all the time. And so I think that they're less prone to be able to deal with that initially. And then when it gets kicked back, they have to fix it as opposed to having a whole team of people to fix it. So I think there are a lot of reasons that they don't want to get too ahead of themselves until they are sure they are ready to go. As opposed to a bigger developer that is confident that they'll push their game goal and then send it to cert and then they'll get through. I think that probably has a great deal to do with it. Totally. I think it's just the fact that",
            "start": 4146.7
        },
        {
            "text": "is confident that they'll push their game goal and then send it to cert and then they'll get through. I think that probably has a great deal to do with it. Totally. I think it's just the fact that it's a huge undertaking to get a game out when you're 4 or 5, even 10, 12 guys. And so yeah, it's hard. The game's done what it's done. And there's less of a reason to announce a release date too because you don't have stockholders and shareholders to worry about. As I was about to read the next question, Kevin then texted me another great image that you're going to need to show this to the people. Please tell them this image of Boba Fett who is labeled as a Jango Fett clone. And he does not look cool at all. Finally someone's calling him out on what he is. A long haired hippie kid. Just out there to fight the galaxy. Thanks for that Kevin. Rog Former wants us to talk about bad ports and how much it matters. Relevant because of Arkham Knight running like garbage on PC. It matters a lot. It",
            "start": 4185.7
        },
        {
            "text": "to fight the galaxy. Thanks for that Kevin. Rog Former wants us to talk about bad ports and how much it matters. Relevant because of Arkham Knight running like garbage on PC. It matters a lot. It matters a lot when people like Kotaku or people like Kotaku break stories such as when WB knew it was broken. And released it anyway. It's a huge problem. As Playstation centric gamers like Greg and I are, we dealt with bad ports last generation. Where unless you were getting a game from a Japanese developer, it was typical that you would probably get the worst version of the game on PS3 every time. Yeah, Bayonetta Final Fantasy 13 was better on PS3. There was a lot of examples of that but very rare. Bad ports matter and it sets a bad rhythm for your console. PS3 became known as a place where you didn't play third party games if you had an Xbox 360. Because you, you know, they looked bad, they ran bad, you got them late. I mean we got games like Bioshock really late. Orange Box was a great",
            "start": 4233.7
        },
        {
            "text": "didn't play third party games if you had an Xbox 360. Because you, you know, they looked bad, they ran bad, you got them late. I mean we got games like Bioshock really late. Orange Box was a great example of a game that was awful on PS3. So it matters because then it has a trickle down effect on the library of games you get in the future and of course the money that the console manufacturer makes to put out more games in the future as well. The fact that Sony has nipped that in a bud this time and clearly has the advantage over Xbox One in terms of power means that they now have the advantage that they lacked last generation which I think matters a great deal. And I think it's proving out in the sales. Semiotic Love says how about ReCore? Was it revealed too soon considering it is only 14 months into development? Maybe. I was surprised that it was revealed that soon but I don't know. I think that Microsoft has to make moves to show that they have a diverse catalog of games and they",
            "start": 4279.7
        },
        {
            "text": "14 months into development? Maybe. I was surprised that it was revealed that soon but I don't know. I think that Microsoft has to make moves to show that they have a diverse catalog of games and they certainly do. I think they have the better announced catalog games of Sony by far. You know, in comparison. But I don't know how much Armature has been able to do in that short amount of time. The game can only be 15 months or a year and a half away. It's not maybe less than that. It's not unheard of. I think that was one of those announcements you put in your press conference to get people excited. That's crazy. I never expected it. But I don't know many people who have been hanging their hats on. ReCore is my most anticipated game. Because it was a cool trailer and that was it. Now they go into the darkness and maybe next year they come back with it. And it's good too. Like hey, here's a new IP. We are doing something new. You'll see it when it happens. Last question comes from Indie",
            "start": 4323.7
        },
        {
            "text": "into the darkness and maybe next year they come back with it. And it's good too. Like hey, here's a new IP. We are doing something new. You'll see it when it happens. Last question comes from Indie Rockstar 75. He says Tim, are you still excited for Kingdom Hearts 3 even though there's still no release date and it seems like it's never going to come out? Yes. We've talked about Kingdom Hearts 3 extensively on this show. We're going to keep talking about it because it's going to keep being revealed 10 million times in different ways. But my thing is, specifically this trailer at E3, I've watched so many times. Even last night I was at dinner with my friend and I showed him it because we're big Kingdom Hearts fans and he's not a guy that reads gaming sites every day. He's a lawyer. And I showed him the stuff and he's just like, fuck man, I'm stoked for this. I'm like, yeah, don't get too stoked. It's not coming for a long time. But really, looking at the trailer, I'm like, this game",
            "start": 4363.7
        },
        {
            "text": "showed him the stuff and he's just like, fuck man, I'm stoked for this. I'm like, yeah, don't get too stoked. It's not coming for a long time. But really, looking at the trailer, I'm like, this game looks awesome. The game looks good. It does look very good. Graphically it's amazing. There's certain scenes in that trailer that show how big the world is and I'm like, good lord. I never imagined a Kingdom Hearts game to be like this. So I think the game's actually going to be really good. If they take a million years to make it, whatever. I don't need to play it right now and I think that's the biggest thing. It was the reveal. They revealed it too soon. Everyone knows that. It's a big difference between, a lot of people have been asking me about Fallout 4 and how done I think the game is and I keep telling them I think the game's done. I think that they're in alpha and that they're probably polishing now and getting everything to a fine sheen and fixing bugs and squashing bugs. They",
            "start": 4415.7
        },
        {
            "text": "and I keep telling them I think the game's done. I think that they're in alpha and that they're probably polishing now and getting everything to a fine sheen and fixing bugs and squashing bugs. They announced a game that was done. Rad bugs. They were at the advantage of sitting on a game for years and revealing it at the right time. The way Bethesda did it is the way everyone should be doing it and I think you're going to see a lot more of that in the future. As opposed to the Kingdom Hearts kind of scenario which is the exact opposite. I'm curious about how... You talk about the world and I'm curious how complete that world is. I'm curious about how vertical that slice was that was shown. In other words, did they polish that to a sheen as you often do with a vertical slice? Or is there more of the game that looks like that and plays like that? I bet that there probably is a bigger portion of the game that plays like that. I think they're probably getting somewhere now with it. But",
            "start": 4443.7
        },
        {
            "text": "more of the game that looks like that and plays like that? I bet that there probably is a bigger portion of the game that plays like that. I think they're probably getting somewhere now with it. But it's just such a big difference from Fallout 4 which we only just wished for and was announced. The way they showed the game off and stuff like that, I'm like the game's done. They finished the game. Now they're going to... The quests are there, everything's there, the world's there. Now they have to go through and make sure everything works properly. But they announced the game and it was done and that's why everyone's so fucking excited about it. It's shitty that Kingdom Hearts is like that but I feel like a big difference with Kingdom Hearts is that I remember we were playing one and then I remember the wait for two felt like forever. And I don't remember the year's difference but I think it was like four or five years between one and two. Or maybe I was just young and it felt way",
            "start": 4487.7
        },
        {
            "text": "I remember the wait for two felt like forever. And I don't remember the year's difference but I think it was like four or five years between one and two. Or maybe I was just young and it felt way longer than it was. But then the wait between two and three, if you don't count all the other ones, it's been ridiculous. So the fact that they actually even announced Kingdom Hearts 3, I was like two years ago at E3 shocked. That it's like, they did it. They actually announced number three. This isn't some spinoff, this isn't whatever, it's happening. And I was very surprised with how much they showed during that first trailer. It was all CG, it was all whatever but there was gameplay in it. I didn't believe it was real gameplay, it just looked like CG gameplay. But then now that I see this I'm like, oh shit, that gameplay that we saw a couple years ago was gameplay. It just didn't have the Hudson stuff. So you're saying the vertical slice, I definitely do think that this is just what's done",
            "start": 4521.7
        },
        {
            "text": "oh shit, that gameplay that we saw a couple years ago was gameplay. It just didn't have the Hudson stuff. So you're saying the vertical slice, I definitely do think that this is just what's done with the game so far. But I'm surprised that even that much of the game is in a state to be shown like that. And it was two years ago too because we've seen other things like that. All the Disneyland rides being, I don't even know, they're not summons but specials or something. Either way, I'm more excited for Kingdom Hearts 3 than I've ever been. And that's the opposite of Final Fantasy 15. Which both of them I've been waiting for for about the same amount of time. And Final Fantasy 15 is getting to the point where I'm like, am I even going to actually sit down and play this? I don't know. Whereas Kingdom Hearts 3, I'm definitely sitting down and playing and I'm more excited than ever to do that. We'll keep getting excited, you'll be this excited in two years. Forever, yeah I know, it's going",
            "start": 4566.7
        },
        {
            "text": "Kingdom Hearts 3, I'm definitely sitting down and playing and I'm more excited than ever to do that. We'll keep getting excited, you'll be this excited in two years. Forever, yeah I know, it's going to be great. It still won't be up. Ladies and gentlemen, this has been the first and last ever 26th episode of The Kind of Funny Games. Tim's age! I'm 26 now. This is weird. I need to get used to it. I'm so used to saying I'm 22. Let's go. Let's go away. Yeah, I'm done dude, I'm done. Alright, bye guys. I love you. Bye!",
            "start": 4607.7
        }
    ]
}