{
    "id": 998,
    "video_id": "MYL1I850InY",
    "show_name": "Gameplay",
    "hosts": [
        "Alan Costa",
        "Colin Moriarty",
        "Kazutaka Kodaka"
    ],
    "title": "Let's Play Danganronpa: Another Episode With Series Creator Kodaka-San! - Kinda Funny Plays",
    "description": "There's a new Danganronpa coming this September, and the creator came all the way from Japan to show you!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1436382001,
    "duration": 1596,
    "transcript_chunks": [
        {
            "text": "greetingsand salutationsWelcome backtokindoffunny GamesMy nameissoverypleasedandexcitedtodaytointroduceyouKkakafromspikchofinJapanthewriterandorkindofvisionaryRmy seriesofAll Time namethank youthank youverymuchthank youverymuchI went to Anime Expo to come herepleasecomeands likeforthatandI always drop by and I hope to play more Danganronpa games in the futurethank youhave asTalkWeweingthe gamecomesOUTthink SeptemberinthewestnoramWhatisthisgamewhatisitcalledandWhatisterSo, let's start by giving a simple introduction to the game.Yes, it's a game called Danganronpa: Ultimate Despair Syndrome, which is an absolute spin-off of the Danganronpa series.This time, unlike previous adventure games, it's an action adventure game.However, the selling points of the Danganronpa series are the story and the characters, so it's a rare type of action adventure with a lot of overlapping stories. guys approP Why is it that this time it 's the third game to appear, and why isn't it a normal adventure game,",
            "start": 0.16
        },
        {
            "text": "characters, so it's a rare type of action adventure with a lot of overlapping stories. guys approP Why is it that this time it 's the third game to appear, and why isn't it a normal adventure game, but an action game? Well, generally speaking, when you say spin-off, it's usually made cheaply using the budget, or rather the materials, of games that have been made up until now, but if you do that, it's not very normal, or rather boring, so we thought we'd give it a try making an action game ourselves. So, yeah, gener Speaking from BUDisfairlyCheapon developmentLADthat saidhereallywanted tocreateanACTION GAMEACTIONExcuseme sodeWhatwantedto dosowheredothistake placeinthewarOB seeingONE FAM characterwheredo thistake placeGU Happy andareitasequis So where does it fit in as a series? Well, it's basically between 1 and 2. Let me give you a brief introduction to the series. Well, in the end of Danganronpa 1, the outside world is in ruins, or rather, that kind of place is collapsing.  What on",
            "start": 122.32
        },
        {
            "text": "basically between 1 and 2. Let me give you a brief introduction to the series. Well, in the end of Danganronpa 1, the outside world is in ruins, or rather, that kind of place is collapsing.  What on earth is the world like? That came up in the words, but it didn't come out in the pictures, so it's centered around that, and the story is about a character called Fukagawa Higashi, one of the survivors of the World, and the younger sister of Uchi Makoto, the main character of the World, and how these two girls stand up to this world of despair. So as you know the World We told that, but we not SH that and so we wanted to go ahead and show that in this game he wanted to show the outside WORLD and What it did become and to do that he decided to Bring Back from the first GAME and as well as introduce The First Game S their Journey through this you WORLD like the Real World of p so How did you SLEon bringing back this specific All to Ah, well, Daga has a lot of great characters, but why did",
            "start": 216.4
        },
        {
            "text": "The First Game S their Journey through this you WORLD like the Real World of p so How did you SLEon bringing back this specific All to Ah, well, Daga has a lot of great characters, but why did you make it have depth? Ah, yes, I really like killers, so I wanted to make an action game about them. The name of the game is Murderer, a killer called Genocide. No, it's Genocider, isn't it? GsequenceNow we're seeing morebthirdperson ACTIONsequencewith GENjackingher scissorstoAttack manumaclonesIknow whatinmeleActionand earlierwewere playing withgamesWhat is the flow of the game like?There is a story sequence, and then the action and so on.Could you please explain a bit about that?Well, the basics are that you progress through the game and when you reach a certain point the story progresses, so in a sense it's like a good old fashioned action adventure, but Dagonronpa fans are mostly not fans of action games, but visual novels, so in that sense the story is very rich and the action game parts",
            "start": 316.56
        },
        {
            "text": "a sense it's like a good old fashioned action adventure, but Dagonronpa fans are mostly not fans of action games, but visual novels, so in that sense the story is very rich and the action game parts can be used in whatever way you like, so I think it's an action game that even nobil fans can play.basically SpeakingGUTheVery traditionalGAME DESIGNknowtherea POINTthaterhappenstheresayACTIONSE moresequencethere sequenceAgain that saidAgaintheTeam veryvery soAgainthestoryis youknowaveryBIGPartOfTheGameatthesametimehealsoisAware thatgiventhefactthatthegamefansmoreusedtovisualnovelshewantedtomakeitsothatyouknowevenpeopleWhoW necessarilygoodatACTIONGameswereabletoandenjoyHavingGENJackisaplayablecharacterSuperpowerfulAthere otherthanthese Twocharactersseealotofobviouslypreviewstrailersall areotherIguoWell, it might be a story.If you can talk to them, are there any playable characters other than Fukagawa and, well, that's a problem?Well, there are only those two who can play.However, I think",
            "start": 372.48
        },
        {
            "text": "it might be a story.If you can talk to them, are there any playable characters other than Fukagawa and, well, that's a problem?Well, there are only those two who can play.However, I think that there will be unexpected characters like there anycameTalkingCON CONsincetakes placeisthereanybenefittoedtheGAMES INtermsofsaFiles This gameFor example, if a player has numbers 1 and 2, do they get something special? No, there isn't, but I'm happy that people who are playing are doing it.PeopleLittleexpor somethingBright corisSYWell, the one on the bottom right is the True Bullet, which is a little theory, but right now it just breaks, but this is the initial equipment that you have from the beginning, and you can hit it normally like this, but the red part on Monokuma's left eye is its weak point, and if you hit it at its weak point, the next ball will grow bigger like a cannon and you will be able to kill Moma in one shot.Yes, ISISTHEBullScreenRightNowweUSBull",
            "start": 445.64
        },
        {
            "text": "left eye is its weak point, and if you hit it at its weak point, the next ball will grow bigger like a cannon and you will be able to kill Moma in one shot.Yes, ISISTHEBullScreenRightNowweUSBull bulletWhichisjustAveragedamagedealingbulletasasyouwhenyouHitMONInhisWePOINTTHENEXT bulletDomoredamagekindofoneofthestratforusingWell, there are other things, and as you progress through the game, they increase more and more, and Mako will be able to control things like a shotgun,  You'll be able to get things like machine guns and things like grenades and things like that. ThingsEXMONthere alsolikeSHUNthere likemaunThingslike thatthereequiteandhe seemsto be switchingthatthe gameWordsuseGENfor meleandthen obviouslyyoucanuse for DistanceUm, you're right, yes, yes, is that something the player can do at any time?Or, well, there are batteries in the upper left corner, and those are what the Genocider's gauge is.Yes, ACTifatTOPleftScreensenseeWhats likeyellowbatteries Whatthoseare",
            "start": 557.52
        },
        {
            "text": "the player can do at any time?Or, well, there are batteries in the upper left corner, and those are what the Genocider's gauge is.Yes, ACTifatTOPleftScreensenseeWhats likeyellowbatteries Whatthoseare actuallythegagetobeabletoIDEJackand WhencanuseHowever, there is a mode that can be difficult to use before you start the game, and a Genocider mode, and if you use the Genocider mode for people who aren't good at action games, you can use it as much as you want.This Genocider is, yes, mean thatbecauseofthosebatteriesasyoucanseedecreasingrightnowHertimeisLimitedattheBEGINOfTheGameHoweverthe Playercanchoose",
            "start": 630.08
        },
        {
            "text": "at action games, you can use it as much as you want.This Genocider is, yes, mean thatbecauseofthosebatteriesasyoucanseedecreasingrightnowHertimeisLimitedattheBEGINOfTheGameHoweverthe Playercanchoose betweenthegenoMODEandegenoMODEThereisnotimeityyoucanuseHerWheneveryouwantasmuchpossibleasasyoulikeandthenTHEELimitedasyouseeRightNowandAgainthereasonfordoingThatisbecausehereallythoseplayerswhoWcomfortablewithACTIONGamestobeableWhatisThingsaboutAdventurevisualvGameswaskindofanonlinearityTherewasastoryyoucankindofexploretandbuildrelationshipswithpeopleandAllThesekindsofthingsistheresimilarELinthisgameareyouabletoseesomeanyyouwanttoseetheminareAretherepeoplemeetthatabletoBuildrelationshipswithonlytoMayWatchthem DIElateronWell, one of the features of the series is that, of course, there is a beginning, middle and end to the story, but within that, you can go a little away from the main story and create relationships with other characters, and the player can enter into places that aren't",
            "start": 654.72
        },
        {
            "text": "beginning, middle and end to the story, but within that, you can go a little away from the main story and create relationships with other characters, and the player can enter into places that aren't really related to the story.  You can do that, right? So this game has that kind of element of replayability, but rather than that, you can meet other characters and make relationships, and there are various books that are dropped in various towns, and when you pick up those books, the conversation between you and Deep expands, and also, as I mentioned earlier, the surviving flesh of the first game is in various places in the towns, and there is a list of where they are, and by picking it up, you can see the story and the sub-stories. I see, right? That will deepen relationships, SHOW more personal so as The Game you find of characters that will be familiar to players who play the previous Games, locate them again like Are you Grand enem EM All, up until now it was just the biggest one,",
            "start": 723.28
        },
        {
            "text": "so as The Game you find of characters that will be familiar to players who play the previous Games, locate them again like Are you Grand enem EM All, up until now it was just the biggest one, but this time you can really fight normally, will there be any enemies other than the one? Yes, that's right, you're controlling these Mokumas, But the children are really children, aren't they? In this town, the setting is that children are using Monokuma to kill adults, and they are controlling the Monokuma clan, so you defeat Monokuma, but you also have to fight those children. Will they also appear in the second game? Well, it's a bit of a spoiler, so I'll just say that I'm very grateful for that. I have there again, more than one. Who You can develop relationships with that You Might have G to soon for inst or you get to Mature that relationship or Find New items and Good. So, in the case of the first and second games, for example, with the second one, you can talk to those characters again,",
            "start": 773.24
        },
        {
            "text": "for inst or you get to Mature that relationship or Find New items and Good. So, in the case of the first and second games, for example, with the second one, you can talk to those characters again, build up those relationships, and is there a reason to play the game a second time, more than the first time? Yes, that's right. There are stickers in various places that say they are the players of hope for the children who are controlling this town of hope.  They are hidden, and by collecting them you can get Monokoma medals, which change the movie scenes, so there is a lot of depth to that. Yes, what is this time's Moma? This time's is basically buying the movie data and the music, so it's like a bonus. cameOUTonJAPANYear quiteofDistanceCome OutWESTITcameout therewhatwasthewhatwastheCritical receptionlikeforthisgamewherepeopleSuperexcitedtoseesomethingdifferentpersonallyasmuchasi wantDANGactuallySuperexcitedtojustexploringThisWorldinkindofadifferentwayandThisiskindofa",
            "start": 956.72
        },
        {
            "text": "receptionlikeforthisgamewherepeopleSuperexcitedtoseesomethingdifferentpersonallyasmuchasi wantDANGactuallySuperexcitedtojustexploringThisWorldinkindofadifferentwayandThisiskindofa nicedifferentwaytodothatsoowasthe receptionsomewhat similarPERyeah, it has already been released in Japan, and on the surface in Japan, well, yes, yes, to be honest, before the release I was asked why it was released as an action game, so I was asked that in particular because there were quite a few people who didn't like action games, but there are things like genociders and that preparation And so after the release, the story was the heaviest and most heartbreaking of all the Dagango games so far, so that was a special feature of the story. People",
            "start": 1058.68
        },
        {
            "text": "like genociders and that preparation And so after the release, the story was the heaviest and most heartbreaking of all the Dagango games so far, so that was a special feature of the story. People HerhaveasWordyouuseJapaneseITmeanslikeMaybehearteningknowReallyDEEPandsofarITactuallyhasforthatreasonhasoneofthehighestLevelsofyouknowPleasureandufromtheFanswerereallyImpresswiththatsomethingwasintentiondonekindofdrawbetweenWhatseemstobealighterormoreppykindoflooktothegamewithsomethingthatisactuallyevenDeeperandDARKER THANother TwoYou mentioned the heaviness of the game earlier, and the visuals are a bit silly in places, so did you intentionally make a very dark game? Yes, when I thought about what it is that is most despairing about this city being a city of despair,  I thought it was normal for a grown man to kill someone, and I wondered what the most hopeless situation would be, and I first thought it would be a world where children are constantly killing adults. I would have thought",
            "start": 1091.76
        },
        {
            "text": "for a grown man to kill someone, and I wondered what the most hopeless situation would be, and I first thought it would be a world where children are constantly killing adults. I would have thought about it if that was the kind of hopeless situation, and the theme is the two girls resisting. New skills sometimes drop in SK, and new skills are often equipped in EX, I think. No, no ...  There's a novel about people killing each other, and I don't know what it's like in this genre, but I see, that was originally a Western book, right? Yes, yes, I said that was one of the things that was in the game for PS2, and it was like a game where kids are constantly killing each other, and to be honest, I thought this game could be released in that format, but I felt like I wanted to push the boundaries because it's the kind of era we live in, and I wanted to create a world view like that as well. The way ThingsGU Open That game might not be available in Japan, but I was told that it would be a bit",
            "start": 1189.12
        },
        {
            "text": "because it's the kind of era we live in, and I wanted to create a world view like that as well. The way ThingsGU Open That game might not be available in Japan, but I was told that it would be a bit boring if you're too sensitive to the system, so I wanted to push the boundaries. Well, it 's really easy, but generally, how long does it take to play? Well, if you read the story properly, it's about 30 hours. [Music] It's a bit similar to Najaga, isn't it? That's right, yes, Actually, of course, that's true. I wanted to make that action game, but I couldn't ignore the fans, so I made sure to give them the things they wanted most.As heparticularlyattentiontoyouknow FansBLthoseTwothingsAWESOMEWellI appreciateyouguysComingovertothetokindoffunnyHQtoshow methisgameSuperSuperexcitedaboutit DANGRAnotherEpisodeWhatthereAnothersubtitletoDANGRAMP AnotherEpisodeult OhDRultradesp girlsalmostSay AgainohIseeIseeseeSorryFconfusingtoan ImakemakegettingIT availableSeptember inNorthAmericais",
            "start": 1367.12
        },
        {
            "text": "DANGRAnotherEpisodeWhatthereAnothersubtitletoDANGRAMP AnotherEpisodeult OhDRultradesp girlsalmostSay AgainohIseeIseeseeSorryFconfusingtoan ImakemakegettingIT availableSeptember inNorthAmericais thatalsoinEurope orEurope asomeAWESOMEand availableDigitally andatretail YesearlySeptemberin thewestearly Septemberin WESTThankyousomuch forjoiningmehereaThankyousomucha greatHonortohaveyou inmyhousebecauseFRa hugfan BEST and",
            "start": 1511.68
        }
    ]
}