{
    "id": 5022,
    "video_id": "fCHj8n6-RJo",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Imran Khan"
    ],
    "title": "Xbox News is Coming Every Month - Kinda Funny Games Daily 05.05.20",
    "description": "Get 20% Off and Free Shipping with the code GAMES20 at http://manscaped.com.\n\nBlessing and Imran discuss Microsoft's plan for showcasing the Xbox Series X.\n\nTime Stamps - \n 00:06:16 - Housekeeping\nTHE CORE STREAM IS HAPPENING! Core is the game where you whip up your own multiplayer video games, publish them, and play them with the world. THURSDAY at 3 p.m. PT join Greg, Andy, and the developers of Core as they make games and test them out with you. That’s right go download the Core Alpha right now at coregames.com and you can play whatever they create LIVE on twitch.tv/kindafunnygames. Follow @CoreGames on Twitter for updates!\nThere’s another sponsored Predator: Hunting Grounds Stream this afternoon at 2 pm! Kevin and SnowBikeMike are joining the insanity! twitch.tv/kindafunnygames\nRemember: We’re reacting live to this week’s Inside Xbox as they show off games for next gen. That’s happening this Thursday at 8am Pacific right here on Twitch.tv/KindaFunnyGames.\nThank you to our Patreon Producers: Mohammed Mohammed, Black Jack\nThe Roper Report   -\n00:09:08 - Xbox is doing monthly showcases leading up to the Series X - Jerret West, CVP, Gaming Marketing @ Xbox\n00:17:20 - Today, Xbox announced that they're going to do monthly \"xbox 20/20\" events for the rest of the year. They've mentioned that May will focus on third party games, while July will focus on first party games. My question to you, is where does that leave June? - Best Friends Q:Amplitude\n00:27:00 - We now know what’s up with Doom Eternal's Soundtrack Controversy - Matt Kim @ IGN\n00:34:00 - Now while it seems the relationship is strained (to say the least) is Id actually trying to heal the relationship for future games or was this just a blanket PR statement and they are never going to use Mick ever again? - Best Friends Q:Borzen00\n00:38:30 - THQ Nordic and Koch Media are trading IPs like Pokemon cards - Brendain Sinclair @ Gamesindustry.biz\n00:45:49 - Cyberpunk 2077 News Broadcast Coming in June - Joe Skrebels @ IGN\n00:49:10 - There’s a new Last of Us 2 trailer coming tomorrow\n00:50:00 - Mortal Kombat is getting DLC Revealed tomorrow\n00:56:00 - Out today\nReader mail   -\n01:00:40 - With Yakuza being another exclusive in the line of PlayStation ports coming, do you think Sony will create a PlayStation app similar to Xbox's beta app on PC? - Frankfurtter\n01:04:45 - Squad Up: Gondors Condor(Destiny PS4) - Irish_Manhattan\n0106:00: - You‘re Wrong\nTomorrow’s Hosts: Greg and Gary\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1588704546,
    "duration": 4087,
    "transcript_chunks": [
        {
            "text": "[Music] yo what's up welcome to kind of funny games Daily for Tuesday May 5th 2020 I'm when your host blessing at UA jr. and joining me is Imran the Don Khan Imran how you doing I'm doing I guess okay I literally just woke up and I was like oh [ __ ] got her to the show and that's been my entire morning so far that's the best it's the best and the worst thing because I found that a lot a lot of time during this quarantine like I'll wake up my and I'm like all right time for work but like it's the worst when you get out of bed and you're like alright immediately going live and when he takes your brain a minute to kind of catch up to the fact that like you're awake and you got to like actually like wake up wake up you know I mean I was able to squeeze in a shower so I'm not too bad but like last night I finished Lawler which is a task and then I I did the dumb thing of I went to the law Order subreddit I was like I wonder what people have to say about law over in 2020 well that was what",
            "start": 1.11
        },
        {
            "text": "last night I finished Lawler which is a task and then I I did the dumb thing of I went to the law Order subreddit I was like I wonder what people have to say about law over in 2020 well that was what I was doing do it now you guys are still showering are you not showering is going on show days like me too me too I was saving a lot of money on to unit these days it's like why why bother right what's the point yeah I mean yeah do it for you right I put off the order for myself nowaday just don't feel good with other people so I can understand the reasoning but me it's like whatever yeah the other person is my wife so it's like you know but you also to make a good impression on the dog yeah that's true yeah Imran talked to talk about a law-and-order because I've been seeing your tweets and I've been curious like why in the world are you watching Law & Order in 20-pin oh so like I think of this before but YouTube TV is now on ps4 which is just it's my ps4 is my de facto media box so I",
            "start": 48.66
        },
        {
            "text": "I've been curious like why in the world are you watching Law & Order in 20-pin oh so like I think of this before but YouTube TV is now on ps4 which is just it's my ps4 is my de facto media box so I just I added Laura as a show to new tpv which means every instance of elon order that's being broadcast on a channel YouTube TV tracks it's just recorded and then put so I can just watch it and just have all of our available to me so I thought okay there's four hundreds of the episodes I'll watch him so you're just watching it cuz it's there yes because it's there if I don't have to think about it I can pause in the middle of an episode it'll lose nothing so like okay is it also in kind of a random order mm-hmm I think they recorded a random order but they have enough metadata is that okay they show up in the actual like season order but like it's a random season right so I think so because like when I finished it yesterday it went from like season 20 episode 22 to like season 4 episode 5",
            "start": 102.3
        },
        {
            "text": "show up in the actual like season order but like it's a random season right so I think so because like when I finished it yesterday it went from like season 20 episode 22 to like season 4 episode 5 so that's crazy can you imagine being the the syndicator like whoever's job it is to sit there and make the schedule and be like I don't know I guess after we're done with this let's go to season 4 yeah what like I don't know I feeling kind of like a linear Briscoe episode right now might as well switch to that yeah as as an update to our previous episode together I've been watching more avatar last airbender is there anybody has been encouraging me to I am now probably like 3/4 of the way through season 2 uh and man the show is this shows a blast like I'm really enjoying it it took it did take until I hit season 2 for me to really get in the groove of it like season 1 was like all right like it was like it was good but I didn't really I wasn't really invested in the way that I felt like I",
            "start": 151.02
        },
        {
            "text": "until I hit season 2 for me to really get in the groove of it like season 1 was like all right like it was like it was good but I didn't really I wasn't really invested in the way that I felt like I should have been considering how people talked about avatar these are two I felt like things really ramped up in a way where I was like alright I get it now like I really I'm in this world I like these characters I'm meeting new characters I just met tall Toph tough talk and top is cool yeah it's lately tough oh yeah okay that because she is tough you know birth bender Toph is that originally when she was designed she's supposed to like a big burly like earthbender guy like as I like a big wrestler guy and then I changed the design the one of the wrestlers that competes in in the tournament that she like wins yeah yeah I think it was original design and they changed it but they wanted to keep the same personality because they liked it so it's that's basically how she was written yeah",
            "start": 200.22
        },
        {
            "text": "that she like wins yeah yeah I think it was original design and they changed it but they wanted to keep the same personality because they liked it so it's that's basically how she was written yeah that's perfect the idea is the opposite of what you expect like a champion earthbender to be yeah yeah and it's coming out to Netflix for anybody else who might have not seen it anybody that's that's that's similar to me who hasn't seen it I'd recommend checking it out I'm at the point where I can recommend Avatar The Last Airbender see the tables have turned it's great it's already you already watched the Great Divide then that episode which one without spoiling it which one is that the one where Aang takes people through a valley it has nothing to do with the rest of the series oh yes that was like yeah episode and like even the creator's advise people skip it so see I had a friend that was tell me that like that was the the lowest rated episode in Avatar like in the Avatar show and I",
            "start": 244.23
        },
        {
            "text": "was like yeah episode and like even the creator's advise people skip it so see I had a friend that was tell me that like that was the the lowest rated episode in Avatar like in the Avatar show and I really liked that it was like I liked that episode more so than like a lot of other episodes and yeah I thought was like a fun like little like like it was almost like a parable Oh like oh yeah look at these two these two tribes that have beef you know I thought all was fun there's there's one like where they it's kind of like a day in Ba Sing se where it's like yeah I just finished that episode you know what else is good video game news today's stories include Xboxes 20/20 vision answers on do eternal soundtrack and more because this is kind of funny games daily each and every weekday at 10:00 a.m. live right here on twitch.tv slash kind of funny games we run you that inner dnews you need to know about if you're watching live you can correct this when you get stuff wrong by going to kind",
            "start": 286.26
        },
        {
            "text": "a.m. live right here on twitch.tv slash kind of funny games we run you that inner dnews you need to know about if you're watching live you can correct this when you get stuff wrong by going to kind of funny comm slash you're wrong if you don't want to watch live you can watch later on youtube.com slash kind of funny games or you can listen later on podcast services around the globe by searching for kind of funny games daily to be a part of the show head to patreon.com/crashcourse or above get to write in and silver members or above get the show ad free with the exclusive daily post show now stop some housekeeping the core stream is happening of course core is the game where you whip up your own multiplayer video games publish them play them with the world Thursday at 3 p.m. Pacific time join Greg and Andi and the developers of core as they make games and test them out with you that's right you can go download core the core alpha right now on core Gamescom and you can play whatever",
            "start": 337.5
        },
        {
            "text": "join Greg and Andi and the developers of core as they make games and test them out with you that's right you can go download core the core alpha right now on core Gamescom and you can play whatever they create live on twitch.tv slash kind of funny games follow at core games on Twitter for updates they should call the newer alpha soft core oh my god and then like when the actual game releases you call it hardcore yeah absolutely this is why we should work in video game PR and Ron I know what things are important voices yeah we could be like pop agenda but like not pop agenda we could be rapid shift media could be oh [ __ ] media I'm down being oh [ __ ] media like [ __ ] Jerry what's that what like what's the right reference just like oh [ __ ] it's like didn't you just like the name oh [ __ ] media yeah that's the feeling that you're gonna get give people you know like oh [ __ ] it [ __ ] tetris all right I love Tetris oh [ __ ] [ __ ] tetris just make all this subject line start off",
            "start": 380.16
        },
        {
            "text": "media yeah that's the feeling that you're gonna get give people you know like oh [ __ ] it [ __ ] tetris all right I love Tetris oh [ __ ] [ __ ] tetris just make all this subject line start off with oh [ __ ] captions coming to switch it sells itself there's another sponsored predator hunting ground stream that's happening is happening this afternoon at 2:00 p.m. it's Kevin stoic Mike very joining the insanity of course I'm gonna be there Greg's gonna be there's gonna be it's gonna be what you've been getting over the past week of our sponsored predator streams they've been really fun predator hunting grounds has been a really enjoyable game it's especially enjoyable with friends playing together and so tune in for that again that's today this afternoon at 2 p.m. Pacific time remember we're reacting live to this week's inside Xbox as they show off games from next-gen that's happening this Thursday at 8 a.m. Pacific right here on twitch.tv slash kind of funny game so stay tuned for",
            "start": 429.66
        },
        {
            "text": "we're reacting live to this week's inside Xbox as they show off games from next-gen that's happening this Thursday at 8 a.m. Pacific right here on twitch.tv slash kind of funny game so stay tuned for that thank you to our patreon producers mom and Mohammed blackjack Mohammed and blackjack - never brought to you by manscaped but I'll talk about that later for now let's begin with what is and forever will be the Rope report it's time for some news we have six stories [Applause] you get over there Kevin yeah I'm great what's up oh you just sound like you sound like you were like kind of like like I don't know died a little bit over there but I change it up every day it sounded like the Wilhelm scream but like Baker's doesn't form yeah I was I was shaking my head as I said it it's not like oh you will him Connie it's not like you were like trying to keep quiet which I respect because we're doing these shows in houses with people that live in them that's true yeah by the way I respect the",
            "start": 473.13
        },
        {
            "text": "you will him Connie it's not like you were like trying to keep quiet which I respect because we're doing these shows in houses with people that live in them that's true yeah by the way I respect the Kevin I respect your delivery no matter how you deliver it yeah story number one Xbox is doing monthly showcases leading up to the Xbox Series X this comes from a blog post written by Jarrett West the CVP of gaming marketing at Xbox on a blog post titled Xbox 2020 join us as we look into the future of Xbox the blog post reads mm-hmm well it's already going to be a once in a generation year for gaming a new generation of consoles a wave of next generation games and the launch of new ways to play with game streaming 2020 has become the year that challenged us all and tested every commitment we have made in the face of Kobe 19 difficult tests tend to reveal your true priorities and for us they are the health and safety of our employees our fans and our partners we we also wanted to be",
            "start": 525.67
        },
        {
            "text": "we have made in the face of Kobe 19 difficult tests tend to reveal your true priorities and for us they are the health and safety of our employees our fans and our partners we we also wanted to be transparent in letting our players know what we are doing and what we are thinking during such a crucial time clearly this year has challenged us to rethink the way we come together to celebrate the important milestones in gaming and that means working with the knowledge that we may not be able to come together in the same place having seen firsthand the resolve of Xbox players families and friends coming together doing the right thing and staying home to help flatten the curve we've all felt energized to rethink our approach how can we share that feeling of excitement and anticipation we all get in gaming's biggest moments how could we capture and just in distribute that feeling I got when I joined Team Xbox that moment when I got to see what happens next so what's the store for 2020 this",
            "start": 572.65
        },
        {
            "text": "in gaming's biggest moments how could we capture and just in distribute that feeling I got when I joined Team Xbox that moment when I got to see what happens next so what's the store for 2020 this is a momentous year for Xbox with our next-gen console console paving the way for our for all our games and services to come together in even better ways here's what 2020 looks like just to start our goal remains to launch Xbox TV sex and halo infinite this holiday all 15 Xbox game studios teams are working are hard at work on next-generation games for xbox series X and Xbox game paths the best development teams around the world are working hard to have their games ready to put ready to play on xbox series X this holiday for PC players we plan to support the community by making all our major releases at launch available with Xbox game past for PC including Halo infinite wasteland 3 minecraft dungeons and of course Microsoft Flight Simulator we have new updates in titles lined up for Xbox",
            "start": 615.79
        },
        {
            "text": "releases at launch available with Xbox game past for PC including Halo infinite wasteland 3 minecraft dungeons and of course Microsoft Flight Simulator we have new updates in titles lined up for Xbox game paths for console and PC we're expanding project X cloud into new countries and on new devices and later this year project project and X cloud and Xbox game past will come together enabling you and your friends to play together in in more ways it's a lot in that saying something in 2020 a year which could be summed up as a lot with all this in mind we said we said we set out to create new touch points to celebrate gaming and share what's next next with our global community they continue to talk about Xbox 2020 which reads as follows starting with the may 7 s ode of inside Xbox which is happening in two days when you're acting to it live just remember tune in have fun with us we'll be showcasing what happens next in the world of Xbox every month which is why we're calling it Xbox 2020",
            "start": 663.52
        },
        {
            "text": "in two days when you're acting to it live just remember tune in have fun with us we'll be showcasing what happens next in the world of Xbox every month which is why we're calling it Xbox 2020 right it's like 20/20 vision they call any Xbox like 20-20 or 20/20 it's like a pun you see what they did then Xbox oh [ __ ] media these monthly moments will take place throughout the rest of the year and will be a way for us to engage connect and celebrate with with you about what's the store for the next generation of gaming including West decks for Xbox TVs X Xbox game studios Xbox game pass and Project X cloud every month will bring something different stay tuned to Xbox wire for more details for the Xbox 2020 may update will focus on giving you a first look at next-gen gameplay trailers and sneak peeks from a wide variety of publishing partners and independent developers from across the globe and industry including Ubisoft's recently announced Assassin's Creed Valhalla and here from from",
            "start": 711.64
        },
        {
            "text": "peeks from a wide variety of publishing partners and independent developers from across the globe and industry including Ubisoft's recently announced Assassin's Creed Valhalla and here from from game creators about what they're doing with their games on xbox series X will be confirming games that will utilize our new smart delivery feature which ensures that you always play the best version of the game she owned for your console across generations and all the games you'll see will be will be Xbox series X optimized meaning they are built to take advantage of the powerful Xbox Series X features that make games look and feel incredible including 4k resolution add up to up add up to 120 frames per second direct storage hardware accelerated Direct X ray tracing superfast load times and much more in July will dedicate time to focus on the incredible games coming from Xbox game studios a number of our studio teams are looking forward to sharing first looks at new gameplay insights from",
            "start": 756.19
        },
        {
            "text": "more in July will dedicate time to focus on the incredible games coming from Xbox game studios a number of our studio teams are looking forward to sharing first looks at new gameplay insights from development teams being optimized for Xbox series X and brand new game announcements we cannot wait to share this initial look at some of what some of what those teams are working on and run that's a lot that that that that came with that blog post in terms of like information and things that are going on with Xbox and their games what what's your takeaway from all this I mean so it's this to me like they say it is covert and all that stuff and yes I I bet that yes that did change some plans but this to me says that these are plans they've had for a long time and this is probably what they intended to do from the beginning was make inside Xbox more of a thing and drop those like generational like news tidbits month to month and this is a smart way to go about it especially in a time where",
            "start": 798.76
        },
        {
            "text": "to do from the beginning was make inside Xbox more of a thing and drop those like generational like news tidbits month to month and this is a smart way to go about it especially in a time where they're being lauded for their communication and transparency and people are wondering what's up with Sony why are they not saying anything embarrassed I was going hey we're giving you a schedule of when we're going to say all the things you want to hear yes I think this is really like the the smartest thing they can do like right right now like whether or not this was originally a plan or not I imagine I imagined plans got shifted right I imagine that they probably they probably wanted to have like monthly instances of communication with the audience but whether or not like maybe some of those were planned to be live events or some of those plans to maybe not be inside Xbox is the idea the idea that they're committing to some sort of communication or some sort of event happening monthly I",
            "start": 844.66
        },
        {
            "text": "were planned to be live events or some of those plans to maybe not be inside Xbox is the idea the idea that they're committing to some sort of communication or some sort of event happening monthly I think is is huge I think it's super smart I think it's super like the idea that you were kind of stretching out what could be like a huge event and not saying that we're not gonna get like a huge event because they talk about you know this month in a couple days we're getting the inside Xbox that is gonna be focused on third party in July we're gonna get more stuff that's focused on first party you imagine in June we're gonna get maybe like a centralized like this is what the Xbox Series X is and this is this is like the big the the blow up blow out party for it it might be smaller and more contained than what we might have traditionally gotten and what we've gotten in the past like I don't expect it to be like a two-hour long thing with Phil Spencer you know talking about all the",
            "start": 887.41
        },
        {
            "text": "more contained than what we might have traditionally gotten and what we've gotten in the past like I don't expect it to be like a two-hour long thing with Phil Spencer you know talking about all the different games all the different features and all the different things and then like ending it was like a huge like alright here's the price here is the controller here's all these different things right like they they very much been creep trip feeding it till now and it seems like they're going to continue to drip feed until the launch with at least like I guess a bigger trip happening next month I imagine I mean so right now we're at two shows that we know about and when we could speculate about which is what you said probably a more launch detail-oriented thing in June so it it seems like they're doing what you're talking about of splitting that show the presumable are presumably they had a June a three show ready to go with all these things in it with a third party stuff with the",
            "start": 932.11
        },
        {
            "text": "they're doing what you're talking about of splitting that show the presumable are presumably they had a June a three show ready to go with all these things in it with a third party stuff with the first party halo and all that jazz and they launched details as well this is them going okay what if we just control this conversation over three months and not overload anybody not make them sit through a three-hour video of all these things and also let our partners so Ubisoft and the like just start announcing games and we can start tough like saying hey this is going to be on Xbox series X let's talk about how this is going to be different in the future and this is a smart way to do it of starting with a third party and going okay this is what you can expect from them early on yeah and we're gonna show you what the actual system is and then we will tell you what we're doing with it I think that's a good way to every month get the get people's eyes on this and get it make it a household",
            "start": 971.62
        },
        {
            "text": "gonna show you what the actual system is and then we will tell you what we're doing with it I think that's a good way to every month get the get people's eyes on this and get it make it a household name before it actually ends up releasing yes in that same note I have a question from amplitude who wrote in to patreon.com/scishow a games and says good morning blessed name Ron today Xbox announced that they're going to do xbox a monthly they're going to do monthly Xbox 2020 events for the rest of the year they've mentioned that May will focus on third party games while July will focus on first party games my question to you is where does this leave June what do you think there June event is going to look like is it going to be there big price and release date reveal like III would have been or is it going to be more of the same of what we've what we already know and have seen thanks for reading amplitude and so yeah we've cut we we've kinda already talked about right like we it's going",
            "start": 1013.53
        },
        {
            "text": "or is it going to be more of the same of what we've what we already know and have seen thanks for reading amplitude and so yeah we've cut we we've kinda already talked about right like we it's going to be it's likely going to be launched details right you were probably gonna get the price and all that stuff what else going around now is I think Lockhart is going to be revealed in June yes the part especially if that is the other rumor is Sony is also gonna do their a big reveal in June so let's say Sony you guys come out and say $500 at the same time Mexico says yeah we have a 500 hour option but we also have a 300 option as well that's a good counter argument to whatever Sony's can put out yes and I imagine if Xbox Lockhart is coming out at launch alongside Xbox series X you imagine that that will have to be something that needs to be announced as soon as possible so that developers and publishers and companies can talk about this stuff as freely as possible right like you know right",
            "start": 1056.2
        },
        {
            "text": "that will have to be something that needs to be announced as soon as possible so that developers and publishers and companies can talk about this stuff as freely as possible right like you know right now everybody's talking about Xbox Xbox series X you're seeing Xbox use X logos at the end of like every trailer trailer you're watching right now and I don't see I don't know how that's gonna like evolve and change after we theoretically get a Lockhart reveal I don't know if you get like and if it's called Xbox guess when it actually gets revealed right I don't know if you then change it to like that uh that logo that I don't think it week but I think like there's a logo that came out in recent weeks that was like the Xbox Series action was like the vertical version of it I wonder if you then have like those two logos side by side at the end of trailers and what that looks like but being able to talk about that stuff really being able to kind of have that maneuver maneuverability in",
            "start": 1101.38
        },
        {
            "text": "then have like those two logos side by side at the end of trailers and what that looks like but being able to talk about that stuff really being able to kind of have that maneuver maneuverability in terms of what we're showing what hardware we're showing it on all that stuff is going to make the conversation a lot clearer for Xbox in their partners yeah and like we did talk about just it being three months but also they're doing this every month until November when there's smart it's it's like this is a good job of like hammering people with the brand and well we're talking about this right now - well that was they're never gonna do that with two logos it would be too confusing but honestly if you do a good job of explaining it and just like reiterating it over the next six months then it might not be that bad it might work out fairly well the big problem at lunch is is that with brand confusion it is so easy to be secretive up until the last second and then spring it on people and",
            "start": 1142.93
        },
        {
            "text": "it might not be that bad it might work out fairly well the big problem at lunch is is that with brand confusion it is so easy to be secretive up until the last second and then spring it on people and they don't know what to make of it like the Wii it was a very good example of people that long are not at launch people that reveal didn't really know what that thing was and it wasn't very clear a year later so by the time it actually came out no one was really like people were still very confused about that thing I think if you do do the thing where we have two different logos and you do have a la carte and Xbox news acts I don't my initial thought is they're not going to do that but if they do I think no it's on them to make it clear and I think they've given of themselves enough time and enough opportunity to actually do so yes and on the other side of the coin it could also just be an Xbox logo right they could just get rid of the series X thing and just be and just have the branding",
            "start": 1188.27
        },
        {
            "text": "opportunity to actually do so yes and on the other side of the coin it could also just be an Xbox logo right they could just get rid of the series X thing and just be and just have the branding really commit to hey this is just Xbox now Kevin I just lacked you a link to a youtube video that is essentially what it X Microsoft uploaded I guess Xbox uploaded like a teaser are you able to yeah cool but Xbox uploaded basically a teaser for the their event that's happening in two days right the inside Xbox and it starts off with what seems to be the Xbox start up animation / like sound yeah which is just about hearing it no you can just show the the visual there yeah can the audience hear it or nobody here they can hear it but it's bigger than out there let me try it again yeah go for it yeah this is the Xbox we've always had very good fun experience they have and of course like this isn't necessarily it's not necessarily confirmed to be the startup but if you saw somebody say somebody in",
            "start": 1232.85
        },
        {
            "text": "this is the Xbox we've always had very good fun experience they have and of course like this isn't necessarily it's not necessarily confirmed to be the startup but if you saw somebody say somebody in the comments was like turn on the closed captions and actually Kevin let's actually do this on unbid you can pull that video back up if you can turn on the closed captions for YouTube and then replay that video because this video is basically like bringing it as like tuned into our our stream and a couple of days but the closed caption skier say new Xbox I can't read it cuz it's racing sounds sound yeah and so and so like you know all that well all what what all this really comes down to is like they're going to be able to talk about things a lot here once that Gillette theorized June inside Xbox which you an event allows them really speak out about what they're working on and and what the launch is actually going to be like for Xbox what do they just skip June what if they said like yeah",
            "start": 1285.86
        },
        {
            "text": "which you an event allows them really speak out about what they're working on and and what the launch is actually going to be like for Xbox what do they just skip June what if they said like yeah we should get third-party stuff will be in July like I know that immediately counters there we're doing among having in 2020 but like if Sony is gonna dominate that monster that's a big if mmm-hmm does it make sense a counter program or just do your own thing and resume from July like I mean is it I leave in another programming each other whether purposely or not purposely over the last like a few months a lot right cuz you had that uh you had the I forget what happened after the marks or anything like there was like the mark Cerny event where he talked about the details the PlayStation I want to say after that Xbox revealed something from their side and then like I mean they they're supposed to be part of that IGN things so maybe that's my game what they consider their June event I can see",
            "start": 1345.45
        },
        {
            "text": "say after that Xbox revealed something from their side and then like I mean they they're supposed to be part of that IGN things so maybe that's my game what they consider their June event I can see that but I also imagine what that'll be is because like Xbox is also part of Keeley's summer game fest - if I recall correctly and so I think what that'll be is probably like here's that here's our inside Xbox in June that is like the blowout and then like well we'll take part in IG and summer gaming and like have interviews with them and have them do coverage with us and then like also we're gonna attach ourselves to summer game fests for that and then also attach ourselves to game spots play for all thing I don't know if I came over Microsoft logo as part of that thing too but I imagine at this point like that stuff is really just gonna come down to it's gonna be more so those brands attaching themselves to the events that are happening as opposed to the other way around there's no reason",
            "start": 1388.5
        },
        {
            "text": "point like that stuff is really just gonna come down to it's gonna be more so those brands attaching themselves to the events that are happening as opposed to the other way around there's no reason not to just attach your name to all this stuff just to be on everyone be on everyone's lips for the next three months exactly exactly exactly I'm I'm curious fruit for what the next few at least the next few months are gonna be I'm like I imagine that after July you were what you're gonna get are like probably like gameplay updates or like here's here's gameplay footage from a game that we showed off in May right and like I imagine that's gonna be like August or September when it comes to what these monthly streams are gonna be or might it might be something more substantial who knows but all this sounds cool again like Xbox is reading is being very communicative which is always appreciated and yeah at least it leaves me wondering what Playstations event is going to be and how how play how",
            "start": 1435.33
        },
        {
            "text": "sounds cool again like Xbox is reading is being very communicative which is always appreciated and yeah at least it leaves me wondering what Playstations event is going to be and how how play how Playstations going to you how they're going to approach what they're they're launched lead-up is because like Xbox has been very vocal and it seems like they're gonna continue to be very vocal with their launch lead-up Playstations been kind of they've also been vocal but in like very like unique instances like they came out in those wired articles you had marks or nice thing you had the PlayStation controller reveal it in a blog right like it's been a very controlled like hey we're drip-feeding but on our own terms yeah I wonder if that continues after what is a PlayStation launch event in like end of May early June I imagine even if not for the corona virus and all that stuff I think this would be a very non-traditional way of launching consoles I think both Sony and Microsoft were already",
            "start": 1483.81
        },
        {
            "text": "end of May early June I imagine even if not for the corona virus and all that stuff I think this would be a very non-traditional way of launching consoles I think both Sony and Microsoft were already prepping for it to be different in a like very transitional sort of way like less of a hard stop and more of a kind of easing in so I think that like obviously it did change some plans but I think Sony would have probably been as quiet if even if like I'm sure they would have had anything by now but I would bet they will have something probably June is the latest I could see them possibly seen having it but like we also think about from the moment there was a switch of video that didn't do anything like didn't really show much beyond what the switch is it showed some games especially but like no real concrete announcements don't wants to do something about that until like the thing released that was less time than between now in a hypothetical November ps5 release so they they still have",
            "start": 1531.96
        },
        {
            "text": "no real concrete announcements don't wants to do something about that until like the thing released that was less time than between now in a hypothetical November ps5 release so they they still have some time it's just a we're all home and we're not doing anything to really want to know these things and they're not telling us yet so we got to wait for them to actually tell us yeah people are going crazy about it we shall see what happens Imraan story number two and this is a crazy one or not a crazy one but this is interesting one a sword number two we now know what's up with doom Eternals soundtrack controversy I'm pulling this info from Matt Kim at IGN if you've been following along of course we've this has been an interesting one because it's been hard to like include in the Roper report because it's been happening as such weird ways cuz it started off as like a tweet that somebody made of like hey like the doom 2016 soundtrack versus the doom eternal soundtrack seem like they seem",
            "start": 1586.17
        },
        {
            "text": "because it's been happening as such weird ways cuz it started off as like a tweet that somebody made of like hey like the doom 2016 soundtrack versus the doom eternal soundtrack seem like they seem to have different levels of quality in terms of the mix and all this stuff right and then like it was a DM from Mick Gordon a seem to DM from Nick Gordon talking about how he's not gonna work in the future with it on soundtracks we it's been coming up quite a bit on the show but I think this article does a good job of contesting it all and then adding in new information that we got yesterday and so I'm reading from that came and IGN here it's software and doom eternal executive producer Mari Stratton has issued a public statement about his current relationship with doom eternal composer Mick Gordon after weeks of speculation that there was some kind of trouble between the two parties over at the recently released Jimmy Eternals soundtrack the controversy began in April when a viral Twitter",
            "start": 1630.33
        },
        {
            "text": "after weeks of speculation that there was some kind of trouble between the two parties over at the recently released Jimmy Eternals soundtrack the controversy began in April when a viral Twitter thread highlighted the sound mixing for the newly released doom eternal soundtrack a Twitter user at that ac/dc guy posted a side-by-side visual compare of the BFG division track from doom 2016 and to eternal and noted that the mixing for the doom eternal version was less dynamic Gordon responded in the tweet that he didn't mix those and if he did he would have done it differently a supposed social media DM from from Gordon also seemed to indicate that he would no longer be working with its software going forward in a lengthy post on the doom eternal subreddit Stratton attempted to clear the air as to why the soundtrack for the new shorter version was not fully mixed by a composer macgowran whose award-winning work on june 2016 has defined the rebooted doom series the reason for this was",
            "start": 1674.04
        },
        {
            "text": "air as to why the soundtrack for the new shorter version was not fully mixed by a composer macgowran whose award-winning work on june 2016 has defined the rebooted doom series the reason for this was because of some some complications on a production side of things and according to Stratton a shifting deadline after agreeing with Gordon on the contract for soundtrack by early March Gordon reached out to it'd requesting an extension quote On February 24th make reached out to communicate that he and his team were fine with the terms of the agreement but that there was a lot more work involved than anticipated a lot of the content to wait a lot of content to wade through he apologized and asked that he that ideally he'd be given an additional four weeks to get everything together he offered that the extra time would allow him to provide upwards of 30 tracks in a runtime of over two hours and quote strand says that that it agreed to to the extension with the new deadline set for mid-april",
            "start": 1714.18
        },
        {
            "text": "the extra time would allow him to provide upwards of 30 tracks in a runtime of over two hours and quote strand says that that it agreed to to the extension with the new deadline set for mid-april however once April arrived Stratton says quote we grew increasingly concerned about Mick delivering DST to us on time I personally I personally asked our lead designer on our lead audio designer at it Chad moles holder to begin work on it versions of the tracks as a back-up plan and quote mole toner would mix music Gordon previously submitted for use in game into soundtrack form which requires a different kind of sound mixing strata trend says that as the deadline approached Gordon was the one who suggested he and most holder would combine the work that they both completed into a full soundtrack leading to the final version of the doom eternal OST that includes tracks mixed by Gordon and tracks edited by most holder using Gordon's original music he previously submitted for use in-game quote",
            "start": 1757.17
        },
        {
            "text": "leading to the final version of the doom eternal OST that includes tracks mixed by Gordon and tracks edited by most holder using Gordon's original music he previously submitted for use in-game quote as for the immediate future we are at the point of moving on and won't be working with Mick on the doom eternal deal see we currently have in production at Stratton I'm as disappointed as anyone that we're at this point but as we have as we have many times before we will adapt to changing circumstances and pursue the most unique and talented artists in the industry with whom to collaborate and quote emraan have you been following this whole ordeal as the initial thing I saw was just a recent error thread saying macgowran is not happy with the mixing on the maternal soundtrack which is like okay yeah I cannot understand the composer would be unhappy with the way a corporation you know does his music yeah then I started looking into it and then I saw like when the statement came out",
            "start": 1806.22
        },
        {
            "text": "like okay yeah I cannot understand the composer would be unhappy with the way a corporation you know does his music yeah then I started looking into it and then I saw like when the statement came out yesterday I started reading through I was like oh [ __ ] this is actually a bit deeper than I initially assumed mm-hmm because it does I mean this this is kind of like it comes out to like a he-said she-said kind of thing yeah but the the case Stratton lays out and he lays it out fairly well of Mick Gordon not really following through one of the things he said he was going to do which I could understand some of that some creative work like mixing does take a lot of out of effort a lot of time and some time just doesn't work out the way you want it to so I could see him definitely going like yeah I promise this number of things but I can't deliver what can we do about that but from what going from there to kind of disowning all responsibility and saying like hey I wouldn't have done this",
            "start": 1849.96
        },
        {
            "text": "yeah I promise this number of things but I can't deliver what can we do about that but from what going from there to kind of disowning all responsibility and saying like hey I wouldn't have done this and then I think the most damning things Stratton says is that they were asking Mick to please step in because the Lee sound designer Mouse holder was getting death threats and Gordon just wasn't acknowledging that that I think it's a thing that even if all the other stuff even if he was kind of a prima donna to work with and like extremely extremely difficult to get things done on time that I think is forgivable on an for it but the fact that he just kind of like blithely stood by and almost a little encouraged by his statements no I don't want to say Kurt I don't want say it's direct but like yeah by indirectly encourage this sort of thing I think that's it going okay no we can't work with him anymore and yeah the implication of we're not working with the DLC and we're looking for",
            "start": 1897.12
        },
        {
            "text": "like yeah by indirectly encourage this sort of thing I think that's it going okay no we can't work with him anymore and yeah the implication of we're not working with the DLC and we're looking for composers from the future implies that macgowran is probably not on whatever the next doomed sequel is going to be no no and it's unfortunate because like the doom soundtracks are so good like some of the best soundtracks of the generation like I easily say and you know Mick Mick Gordon is in large responsible for like you know putting that together right like he's the he's the he's the genius behind those soundtracks and I for this relationship to kind of come down to like a like we just couldn't get along like we could we just couldn't like whether its production schedules whether it's like hey like you know Mick wasn't delivering on deadline and in like whatever that stuff kind of comes down to like overall it kind of just it sucks that they couldn't figure it out it happens like this the",
            "start": 1949.08
        },
        {
            "text": "like you know Mick wasn't delivering on deadline and in like whatever that stuff kind of comes down to like overall it kind of just it sucks that they couldn't figure it out it happens like this the kind of thing isn't like a this is like a unique case like this thing happens all the time yeah as far as like working relationships it's not working out but yeah it seems like the next doom game and DLC has said in this article right like isn't going to be composed by Mick Gordon and that's a bummer that truly is a bummer yeah I mean like honestly part of the identity of that series is macgowran as music so I've seen people across some other names around people who worked on like other doom projects that like I bet would be very good and there just be different though yeah and I think that's a problem I I want to pull in a question here from Boris's zero-zero who writes in and says good morning bless me Imran the doom OST drama might have actually concluded yesterday when Marty Stratton",
            "start": 1992.91
        },
        {
            "text": "a problem I I want to pull in a question here from Boris's zero-zero who writes in and says good morning bless me Imran the doom OST drama might have actually concluded yesterday when Marty Stratton made a reddit post doing his best to explain the situation in it he goes into great detail detail about the dealings with Mick Gordon and it doesn't paint a pretty picture and both parties have decided to not not have him create the soundtrack for the story DLC coming however it has also mentioned that there there was a plea to stop sending death threats to the studios audio engineer Chad moles holder now while it seems the relationship is strained to say the least is it actually trying to heal the relationship for future games or was this just a blanket PR statement and they're never going to use make ever again I also wonder is if there's anybody who can take over the reins and create a sound that does not sound like a cheap imitation thanks for everything you guys do and how in have",
            "start": 2036.26
        },
        {
            "text": "to use make ever again I also wonder is if there's anybody who can take over the reins and create a sound that does not sound like a cheap imitation thanks for everything you guys do and how in have been continuing to do poison zero zero yeah I don't I I'm with them right here where I don't think they're gonna continue they're gonna continue working with them like it seems like it seems like a line was kind of crossed uh and I don't like Oh unless like people come together and have a meeting and they're and they have a talk and they're like hey like let's put water under the bridge I don't think you're I don't think that's gonna happen yeah but as far as like somebody else coming through and doing future do you sound tracks like I think a solution could be like and I don't I don't know too much about like ogee doom like doing from back in the day I don't know who like who like the names that worked on the soundtrack for those games and whether or not they're still like active but",
            "start": 2077.09
        },
        {
            "text": "too much about like ogee doom like doing from back in the day I don't know who like who like the names that worked on the soundtrack for those games and whether or not they're still like active but maybe that could be a solution you know you don't come under this much scrutiny there's been new doom content over the years and there's been new soundtrack for those games so like you could bring somebody in who's made soundtracks for what is essentially oh gee do but like view content for those like new levels and stuff like that that makes sense to bring those people in i if they try to sound like mick gordon and it don't i don't think they don't work but if they do their own thing if they just say like hey this is the new start i think whatever they do with doom 3 or what if they end up calling it is going to be a different kind of thing because i i've been kind of baffled by the reactions that came a little bit cuz like i we really loved it yeah man by and large it seems like most",
            "start": 2120.65
        },
        {
            "text": "calling it is going to be a different kind of thing because i i've been kind of baffled by the reactions that came a little bit cuz like i we really loved it yeah man by and large it seems like most people are like oh yeah it was fine it wasn't exactly it wasn't what I wanted from a doom sequel so I think they're probably gonna go back to the drawing board on that game but I that seems like a good chance to actually like reset what that game's identity is and probably reset it alongside the soundtrack yeah honestly like I can see I'm like not necessarily I can reboot but yeah reimagining of what this new like this rebooted doom series is because when we talk about June 2016 and doom eternal right like my big thing with doom eternal is that you know I loved how they took elements of doom 2016 and kind of push them to the extreme but at certain points like dune 2016 was great because of how contained it was right like doom 2016 didn't have the platform and you didn't have these these",
            "start": 2162.47
        },
        {
            "text": "2016 and kind of push them to the extreme but at certain points like dune 2016 was great because of how contained it was right like doom 2016 didn't have the platform and you didn't have these these levels that felt like super huge right like dune 2016 felt just way more contained so do you eternal to come out and kind of take what work with you in 2016 and try to have his own ideas with it I think that is that then leads to what you're talking about as far as like people not necessarily having the best we are people not having the same reaction to it that they had with June 2016 I think for a new doom I think you do go back to the drawing board a bit and try to either like I guess you could do two things right you can either try and capture the magic of doing 2016 or you can just go in a dynamically different direction and be like all right like let's just not let's not try to have people compare this game or people come into this game with their with their biases up to 2016 let's",
            "start": 2207.86
        },
        {
            "text": "a dynamically different direction and be like all right like let's just not let's not try to have people compare this game or people come into this game with their with their biases up to 2016 let's try and create something that's brand new that still fits within the doom MOT the modern doom universe but something that feels dynamically dynamically newly and with that I think you then are able to have a dynamically new sound with the soundtrack and with the composer with it yeah I think I'm interested a smart play for them was to have Marty Stratton go to the subreddit and like I I've met Marty a couple of times he's a very genuine guy and he comes across very genuine in this reddit post and that I think if this were a simple thing we're just not going to work with Marty silver sorry we're not gonna work with Nick Gordon ever again yeah like then I I don't think it would like come off as nearly as well people go it's like oh well Mick Gorda is telling it like it is and but does it",
            "start": 2250.91
        },
        {
            "text": "not gonna work with Nick Gordon ever again yeah like then I I don't think it would like come off as nearly as well people go it's like oh well Mick Gorda is telling it like it is and but does it doesn't like it this lays off please have a very complex but Jenny Wynn case for yeah we wanted to but it didn't work out and that's why we're just not going to coming forward it was smart of them to do it this way story number three Imraan THQ Nordic and Koch media are trading ip's like pokemon cards I'm pulling this from redness and clear at games they [ __ ] up is and I'm gonna say before I'm arena it's my favorite news story I'm very excited about all this about what's happening here the new story reads two of the embrace your groups gaming subsidiaries have swapped an assortment of properties THQ Nordic today announced that is transferred rights to Red Faction and painkiller let me read that again Red Faction in painkiller to Koch media receiving risen sacred rush rush for Berlin second",
            "start": 2292.82
        },
        {
            "text": "THQ Nordic today announced that is transferred rights to Red Faction and painkiller let me read that again Red Faction in painkiller to Koch media receiving risen sacred rush rush for Berlin second site and singles Florida weight singles furred up your flirt up your life in return I'm not heard that game that sounds interesting the move paves the way for a pair of possible reunions between franchises and their original developers first it puts Red Faction you know it puts the Red Faction franchise a step closer to the original developer volition which is the big takeaway from this new from this news story everybody which is which is owned by Koch media's Deep Silver publishing division second in place is written under the same roof as its original developer piranha bytes which was acquired by PhD Nordic a year ago quote evaluations on remasters ports potential sequels and new content etc we'll start right away THQ Nordic said in its announcement of the trade we have something in mind",
            "start": 2336.86
        },
        {
            "text": "by PhD Nordic a year ago quote evaluations on remasters ports potential sequels and new content etc we'll start right away THQ Nordic said in its announcement of the trade we have something in mind already and run I'm very happy right now because I love Red Faction Red Faction is like we talked about this actually on PS love you during our we had we had a an episode called the under radius where we talked about the underrated games on PlayStation and I think my first pick was Red Faction for the ps2 the original Red Faction um you know Red Faction as a franchise I've I've always enjoyed reflection gorilla also on that that was on ps2 but then got remastered on ps4 also an excellent game Morse the remark sir yeah V the the idea that now volition has in theory been reunited like there's not really been word that like Deep Silver is pairing it with volition we don't know that yet but you assume that like they must have that on the docket in some sort of way you imagine right now volition",
            "start": 2381.94
        },
        {
            "text": "really been word that like Deep Silver is pairing it with volition we don't know that yet but you assume that like they must have that on the docket in some sort of way you imagine right now volition is working on Saints Row 5 a new Saints Row so they're actively working on that I'd assume yeah and you imagine that's imminent like I'd be backing has to come out and like the next I'm gonna say like by 2021 I imagine that games gonna be out um I think that then that that then leads to the next game likely possibly fingers crossed be in Red Faction that's all I would assume so yeah I've been distracted cuz I'm looking up singles four out of your life just curious what that was it is it's the Sims but with banging it's really singles flirt up your life yeah Kevin can we possibly get a trailer if that's possible for singles flirt up your life because I have adhere somewhat that IP is it was good enough to have a single stroke EULA art singles to Triple Trouble death isn't that strikes me",
            "start": 2433.33
        },
        {
            "text": "if that's possible for singles flirt up your life because I have adhere somewhat that IP is it was good enough to have a single stroke EULA art singles to Triple Trouble death isn't that strikes me as like it probably a um oh shoot what's that adventure game with like the very horny dude you know what I'm talking Leisure Suit Larry it strikes me as like something is probably similar to Leisure Suit Larry yeah which got it which got a game recently it did it wasn't great but I demoed that game at PAX and had a I had a great time demoing it I don't think I'd ever play the actual final game it's the kind of game or like the rut the writing is Larry's very out of touch could it's a modern world but it does that thing that I think is this the laziest writing in the world where you have a technology company and you give them like a face you like a derisive fake name so sort of like oh yeah Facebook it's possible and like no that's that's bad that's that's bad right Hank don't do that yeah",
            "start": 2479.41
        },
        {
            "text": "company and you give them like a face you like a derisive fake name so sort of like oh yeah Facebook it's possible and like no that's that's bad that's that's bad right Hank don't do that yeah this huge queue Nordic thing this is uh they're both owned by the same company so like training IPS is weird I don't understand exactly like what they think there it's I think it's just a cute way of showing that they hey we're probably working on this game is fairly soon oh you can't find out you're gonna so you can't show it because it's just straight out just I'm not seeing trailers I'm just seeing like clips and and yeah oh really all right I might take that out after the show it looks a lot long yeah but it was criticized for being a ripoff of The Sims and the way it offered a little challenge but there's like there's like hopper challenge I guess yeah yeah this this is interesting for what you're saying also is that like yeah they're both they're both subsidiaries of the same company you",
            "start": 2524.32
        },
        {
            "text": "but there's like there's like hopper challenge I guess yeah yeah this this is interesting for what you're saying also is that like yeah they're both they're both subsidiaries of the same company you imagine that like if they just if they wanted to work on each other's ip's that's probably like an easy thing to do but this announcement probably makes it clear of like oh like it's a pop right like it's a it's a moment that they can have on social media and be like hey like by the way remember that Red Faction is the thing and also you have volition and these over here that can work on rep action like I'm sure that's also very much a part of this announcement yeah I mean they're PR has done worse things so might as well do like a cute little Gameboy thing to announce that a Red Faction game might come out in the future from volition if they do I hope it's more like guerrilla than what was the last one Armageddon yeah Armageddon yeah people didn't like Armageddon it was I mean it was very",
            "start": 2582.52
        },
        {
            "text": "come out in the future from volition if they do I hope it's more like guerrilla than what was the last one Armageddon yeah Armageddon yeah people didn't like Armageddon it was I mean it was very very bog-standard third-person shooter like the shooting through walls thing was neat but the rest of it not important we probably we probably wouldn't get this but I personally would want them to go back to it being a first-person shooter like is like the first Red Faction had like half-life vibes of like hey yeah this is a narrative first-person shooter where you're going through like you're on on Mars obviously because it's Red Faction and like you are basically going on a on an adventure and having all these different story moments and a certain point aliens show up and all this stuff um I would like to the guy captain like kind of go back to that cuz like I don't see I don't know people are necessarily like asking for it people aside for meeting me or at necessarily like asking for that",
            "start": 2632.7
        },
        {
            "text": "like to the guy captain like kind of go back to that cuz like I don't see I don't know people are necessarily like asking for it people aside for meeting me or at necessarily like asking for that type of experience but I feel like uh I feel like it could be an interesting reveal right like a volition first-person shooter and I think it differentiates itself from from Saints Row enough to where it gets people interested if it goes that route I suppose like the third person game route honestly volition kind of need to prove themselves again anyway cuz like agents of mayhem was not great yeah agent mayhem was weird man I tried playing that game like last year cuz I think I must have bought it on sale cuz I don't think was on PS Plus I bought that game started playing it and I was like there are some ideas here I've no idea why this game isn't co-op because it very much seems like a game that should be multiplayer it's like the whole point of the game the whole point of the game is that",
            "start": 2671.49
        },
        {
            "text": "are some ideas here I've no idea why this game isn't co-op because it very much seems like a game that should be multiplayer it's like the whole point of the game the whole point of the game is that you're controlling a team of different like superhero kind of characters and you can switch between them why wouldn't that be a co-op experience especially when like Saints Row I well I don't know about strange before Saints Row 3 we sure had a co-op mode or a multiplayer mode yeah like it's not foreign to them and so who knows I have some quick hits here I have three more stories but all them are pretty sure and so we're gonna we're gonna blast through them Story number four here cyberpunk 2077 is having a new news broadcast coming in June and I'm pulling this from Joe scrabbles at IGN who writes diary from 2077 looks to be getting an e3 style news broadcast on June 11th title night city wire announced on Twitter with a simple caption get ready in a logo we don't know the contents or in a",
            "start": 2714.12
        },
        {
            "text": "diary from 2077 looks to be getting an e3 style news broadcast on June 11th title night city wire announced on Twitter with a simple caption get ready in a logo we don't know the contents or in a logo we don't know the contents of the broadcast at the time of writing and run did you see this this morning yeah that I mean they had a a demo with e3 every year so I imagine they had a demo prepared for easily this year so they probably have somewhere to put it this makes total sense this is part of Keeley's thing right like they're the Summer Fest games so like CD Projekt RED their logo is on the Keely like his graphic that he tweeted out at said phase 1 but they've not said I don't think they've said anything about summer game fest in cyberpunks tweet but yes that summer game fest lago when it was announced cuz what what is up with that thing the actual logo like the thing that's like it's the actual text but like it has like this elongated are down the thing oh yes you were talking",
            "start": 2752.97
        },
        {
            "text": "it was announced cuz what what is up with that thing the actual logo like the thing that's like it's the actual text but like it has like this elongated are down the thing oh yes you were talking about yes what why why did they design it that way graphic design man is somebody's fashion somebody had a passion and they really like chased after it I thought it looked fine until I start I started seeing memes it might have been you that meme did actually yeah yeah then I'll yeah The Simpsons thing yes all that I was like he's making points I can see why this text is weird but yeah you know I'm I'm curious for what night City wire is gonna be I'm looking forward to it it's it's one of those things where the game was really supposed to come out in spring and so like any sort of like big marketing push now I'm like cool yeah you guys are fill in time reminding people this game exists and and my thing is first I run 2077 I almost I almost don't want more information like I'll black to go on",
            "start": 2800.25
        },
        {
            "text": "push now I'm like cool yeah you guys are fill in time reminding people this game exists and and my thing is first I run 2077 I almost I almost don't want more information like I'll black to go on into that game is blind as possible because like that's the type of game that I think like you can really pull people that people in through through the mystery of it and like having people be curious I'm like what is this game actually similar to like and these are these might not be the best examples but like death stranding or fallout 4 like both those games and things leading up to release there was very modest 2k air of mystery of like what am i doing in this game like what does fallout 4 look like like there for especially like their marketing was very much like like they had their e3 reveal and then nothing else and then release I kind of want that from cyberpunk a bit you know cuz I I like the idea that you don't have to show all your cards mm-hmm I I assume based on the date this is",
            "start": 2854.91
        },
        {
            "text": "and then nothing else and then release I kind of want that from cyberpunk a bit you know cuz I I like the idea that you don't have to show all your cards mm-hmm I I assume based on the date this is going to be a lot of showing with the smart delivery version of these games looks like yeah so like here's what it looks like on current consoles his will look like in November yeah I think I press 120 frames per second loading screens here's all these things what would the rumor that like the game was delayed because it was just not working on old consoles so if they do show hey this may look kind of clunky here but look at what it looks like will look like just a couple of months after might be a good lesson a good marketing strategy but a good way of mitigation if it does end up looking not great on Xbox one and ps4 number five another quick hit for you there's a new last was two trailer that's coming tomorrow this morning Naughty Dog tweeted a small teaser with like voices Ellie and",
            "start": 2896.46
        },
        {
            "text": "great on Xbox one and ps4 number five another quick hit for you there's a new last was two trailer that's coming tomorrow this morning Naughty Dog tweeted a small teaser with like voices Ellie and Joel saying things I won't save what they said if you don't wanna hear but that's coming tomorrow 7:00 a.m. so be excited for that now coming man I'm gonna I think we were doing about fall out of just like I already know I'm gonna play this game like why at this point yeah I'm probably gonna watch it just go you have a PlayStation show you have to yeah that's the thing Till's like I want to be in foreign and also like I've already had it spoiled for me like what like what more can be relit at this point I feel like I'm tempting fate by saying this and also having you're wrong open but oh I have not been spoiled yet oh you should not have said that because they will come for you it's wrong yeah and then number six our last one Mortal Kombat is getting DLC revealed tomorrow I opened up Twitter",
            "start": 2940.05
        },
        {
            "text": "been spoiled yet oh you should not have said that because they will come for you it's wrong yeah and then number six our last one Mortal Kombat is getting DLC revealed tomorrow I opened up Twitter this morning and Imran I saw a trailer or a teaser from NetherRealm for and I don't wanna get into the specifics cuz it very much is spoilery for the Mortal Kombat 11 story but they basically showed the end of that that game story and then showed a twist with twist happening with it and I've never been so excited for like a Mortal Kombat thing in my life it looks great it's great are you did you play the Mortal Kombat 11 story and again I I'm excited for this because this is kind of what I wanted from them was not there's totally more characters like I don't really give a [ __ ] about spawn but I I want more story stuff yes I'm with you like I I'm with you in the sense that like Mortal Kombat historically has been a game that I would play for months on end and keep up with and like get the",
            "start": 2984.93
        },
        {
            "text": "I I want more story stuff yes I'm with you like I I'm with you in the sense that like Mortal Kombat historically has been a game that I would play for months on end and keep up with and like get the DLC characters and all this stuff this time around that didn't necessarily happen with me like I played it played the story played online for a good few weeks and then kind of fell off of it and like you know I didn't really have any interest in checking out the DLC characters even though they they were cool characters but I like Shang Tsung and um like you said spawn right like a lot of cool characters were included with that DLC I kinda wanted shaggy from Scooby to be included but they didn't the cowards but yeah new story DLC is the thing though for sure give you picked the game back up and actually have some time with it and so infertility to be this cool like I would like to him integrate the DLC characters into the story I don't know if that's like possible like if that's a there's a",
            "start": 3035.55
        },
        {
            "text": "actually have some time with it and so infertility to be this cool like I would like to him integrate the DLC characters into the story I don't know if that's like possible like if that's a there's a legal thing they might like but it wouldn't it be cool if like dude like screenshot like Liu Kang is at the end of the game a suddenly spawn shows up if you did you play the Tekken 7 story maan yes Tekken 7 Akuma from Street Fighter is like a main character I want that kind of integration but like do it post-launch like what it I like smash technically has the deal secret in the world of light but like I would take them redoing that CG they are inserting something sees in the middle of like Joker trying to dodge the visa light or whatever idea I think it's cool when fighting games do that yeah look I just thought I don't give a [ __ ] about spawn but I would I would like to say spawn in the story but the thing that's weird about Mortal Kombat and this is gonna sound like it's gonna be a",
            "start": 3080.91
        },
        {
            "text": "look I just thought I don't give a [ __ ] about spawn but I would I would like to say spawn in the story but the thing that's weird about Mortal Kombat and this is gonna sound like it's gonna be a really good statement but the Mortal Kombat story is like so like it's focused in terms of like it's not it's not as nonsensical no no in the in the sense that I feel like I feel like including DLC characters like spawn and all the horror characters that they like to include in the like horror let me pronounce that cuz it sound like I said [ __ ] but like or characters that they'd like to include as you'll see in the games I feel like including that in the story it then kind of like brings the curtain back in a way where it's like alright what can we really pick seriously here if like spawns here is standing next to scorpion whereas like Tekken Tekken is already goofy like Tekken I'm like none of this matters it's like we're just here to have a fun time Mortal Kombat story is in a sense",
            "start": 3130.29
        },
        {
            "text": "here is standing next to scorpion whereas like Tekken Tekken is already goofy like Tekken I'm like none of this matters it's like we're just here to have a fun time Mortal Kombat story is in a sense somewhat they take it away mocap who has like mocap balls yeah but we're in a new universe now you know all that stuff got retcons yeah that's right out of the universe we they they reset the universe every couple of games so like why not go crazy and then just go like okay reset button we can do whatever we want now what do you think they do for the next Mortal Kombat game because when I first watched when I first watched this trailer I thought it was going I in my head I was like is this Mortal Kombat 12 cuz usually like usually NetherRealm is on a two year cycle with their games right they were two years yeah yeah like 2015 I got Mortal Kombat X 2017 we got injustice last year we got Mortal Kombat which would mean next you were probably getting a new game from another realm in my mind I",
            "start": 3172.14
        },
        {
            "text": "two years yeah yeah like 2015 I got Mortal Kombat X 2017 we got injustice last year we got Mortal Kombat which would mean next you were probably getting a new game from another realm in my mind I was like could they be skipping injustice and just going straight to Mortal Kombat 12 and that's not the case because like on the PlayStation channel their YouTube channel when they when they released the trailer they said Mortal Kombat 11 and so like it like this looks like it is going to be DLC pretty pretty much for sure but what do they go before all come out to combat 12 given where Mortal Kombat 11 kind of finished off with without spoiling it yeah I don't want to spoil it but like suffice to say that Mortal Kombat 12 can kind of go anywhere now like they can completely reset that universe again and start it over in a different way without just being like about Shang Tsung as Shao Kahn or whatever or it maybe that's the way they wanted like they want to make anything that constantly",
            "start": 3218.31
        },
        {
            "text": "again and start it over in a different way without just being like about Shang Tsung as Shao Kahn or whatever or it maybe that's the way they wanted like they want to make anything that constantly just go that's the that's the battle is Shang Tsung will always do these things Shao Kahn will always try to invade the earth around but I'm very into the sea where they go next because more will come at 12 felt armored combat 11 felt like they wanted to go okay we're ending this cycle and we're gonna start new next time it just we have to wait I think three years probably find out exactly where that is I'm so excited there's I I [ __ ] love the Mortal Kombat's Tony as stupid and nonsensical and weird as it is like even like the ps2 games like where will combat deception that story I was like that was like the the the thing that introduced me to Mortal Kombat's like war and like from from then I feel like they found ways to make it both nonsense cool but then also like they found waste mckee",
            "start": 3261.84
        },
        {
            "text": "was like the the the thing that introduced me to Mortal Kombat's like war and like from from then I feel like they found ways to make it both nonsense cool but then also like they found waste mckee care about the characters yeah I mean wasted to kind of engage you to where I'm like man I'm really curious to see like where they go especially if they go like the reboot route again kids like at that point like what is the what is the what is the story but will combat about if not like destiny and time travel at that point I thought the entire story of Mortal Kombat 11 was dumb and I thought the plot twist was dumb and I loved every minute of it yes exactly Imran I'm very excited to see what the future of Mortal Kombat is but that future try so far away if I want to know what's coming out today on monogram shops where would I go the official list of upcoming software across each and every platform and listed by the kind of funny games TV show host each and every weekday do yeah yeah such",
            "start": 3308.12
        },
        {
            "text": "on monogram shops where would I go the official list of upcoming software across each and every platform and listed by the kind of funny games TV show host each and every weekday do yeah yeah such a weird transition right the mom crap shops thing if I want to know what's coming out today on mama crap shops where I I guess I guess it's not as weird out today there's a surprise launch happening or that has already happened I think the walking dead saints and sinners is out for psvr and so I'm very excited for that I'm probably gonna check that one out because I love Walking Dead and a little PS we are John wick hex is out today for ps4 Xbox one is which winter more tactics club is out for PC someday you'll return is out for PC pushy and pulley in block land is out for Xbox one PC and Mac tonight we riot is that risk which night Jackals out for PC shop Titans is out for PC escape the brothers saloon is not for PC battle baseball is out for PC expressed through is out for PC old world is",
            "start": 3352.52
        },
        {
            "text": "we riot is that risk which night Jackals out for PC shop Titans is out for PC escape the brothers saloon is not for PC battle baseball is out for PC expressed through is out for PC old world is out for pc and then rogue elements is live in dauntless this update includes a new hunt pass as well as contract side span the story leading up to our big game or till their big in-game event coming in June they're also introducing for new trials challenges starting May seven some new dates for you electro beat him up megabyte punch will be released on a tenth of switch in America Europe in Japan on May 8th crucible Amazon's free to play PC competitive team-based shooter developed by relentless studios will launch on May 20th 2020 easy day Studios announced today that skater Excel a game that delivers unparalleled access to skateboarding culture will be will be launching on July 7th for digital release on ps4 Xbox one Nintendo switch and PC and two brick-and-mortar retailers on ps4 and Xbox one",
            "start": 3395.27
        },
        {
            "text": "unparalleled access to skateboarding culture will be will be launching on July 7th for digital release on ps4 Xbox one Nintendo switch and PC and two brick-and-mortar retailers on ps4 and Xbox one and lastly pixel rip 1995 will launch on May 12th on psvr in the Americas and on May 19th on psvr in Europe let's see here now it's time courier mail you can write in to patreon conscience kind of funny games where you can get the show ad free and speaking of ads this episode kind of funny games daily is brought to you by manscaped flowers are blooming the grass is growing it is time to mow your lawn thanks to our sponsor manscaped you can trim the hedges below the belt safely and efficiently I'm talking about the ball trimmers manscaped is here to make sure your balls are smooth and smelling nice after all it's time for some spring cleaning as you all know I like to use manscaped and my favorite part of the manscape 3.0 which I which I own is the light that comes with it you turn it on and",
            "start": 3446.29
        },
        {
            "text": "after all it's time for some spring cleaning as you all know I like to use manscaped and my favorite part of the manscape 3.0 which I which I own is the light that comes with it you turn it on and there's like a flashlight so you can see everything that's going on very clearly and it keeps you very safe and very very visual visually aware you're in the dark I mean Kevin I'm gonna be honest man yo you have those days where you're like I don't look at myself you know mmm sometimes sometimes I have the light off for that Oh everything everyday I just have the light off that's what I'm saving myself does I answer your question Kevin nailed it thank you my escaped is the only men's brand dedicated to below the belt grooming they have forever changed the grooming game with their perfect package 3.0 precision precision engineered tools for your family jewels the perfect package Supino kit comes with the essential lawn mower through cleaner water proof cordless body trimmer and a ton of other",
            "start": 3492.58
        },
        {
            "text": "3.0 precision precision engineered tools for your family jewels the perfect package Supino kit comes with the essential lawn mower through cleaner water proof cordless body trimmer and a ton of other liquid formulations to round out your manscaping routine this third-generation trimmer features a cutting edge ceramic blade to prevent landscaping accidents millions of balls are about to be Nick thanks to man escapes advance skins save technology inside the perfect package you'll also find the manscape crop preserver and or any anti chafing a ball deodorant and moisturizer it start to get hot outside and this is crucial so your ball stops sticking to your leg and as our tree you'll find the cropper vibrant which will keep your ball smelling fresh just like spring flowers subscribe to the perfect package in get a new replacement blade refill for your lawn mower trimmer delivered to your door every three months making sure your trimmer always stays hygienic and clean for a limited time",
            "start": 3538.45
        },
        {
            "text": "perfect package in get a new replacement blade refill for your lawn mower trimmer delivered to your door every three months making sure your trimmer always stays hygienic and clean for a limited time subscribers get two free gifts the shed travel bag that's a $39 value add and the patented high-performance anti chafing manscape boxer briefs this is the perfect package for your perfect package get 20% off plus free shipping with the code games 20 at manscape comm do yourself a favor and always use the right tools for the job that's 20% off and free shipping with code games 20 at - Keep Calm again 20% off with Free Shipping manscaped comm code games 20 is spring cleaning baby and your balls well thank you Ron mmm I'm looking here to see what question I want to ask you let's talk about let's talk about Yakuza frankfurter writes in a patreon account just kind of fun and games just like you can and says good morning bless Keenan Ron Yakuza 7 is seemingly getting port to steam well it seems",
            "start": 3582.37
        },
        {
            "text": "talk about Yakuza frankfurter writes in a patreon account just kind of fun and games just like you can and says good morning bless Keenan Ron Yakuza 7 is seemingly getting port to steam well it seems like a no-brainer due to due to porting over about half the series last year it's another PlayStation exclusive series that is being moved to PC we've gone kusa being being another exclusive inline in the line of PlayStation ports coming do you think Sony will create a PlayStation app similar to Xboxes beta app on PC on top of that will they make the VR hardware they're working on as reported yesterday compatible with both PS 5 and PC so you can enjoy the VR games where ever you want thanks for all you do Frank Furter that doesn't sound like Sony like who knows no not like that seems like a fit like even the horizon asset was don't worry we're not going full PC we're just like kind of dipping our toes in I think they don't I think from a top executive level they don't like the idea of PC",
            "start": 3633.61
        },
        {
            "text": "like even the horizon asset was don't worry we're not going full PC we're just like kind of dipping our toes in I think they don't I think from a top executive level they don't like the idea of PC being an all a on the same level and also from a like from a fan base level the fan base doesn't necessarily like that either I think yeah because the thing is like I imagined that steam listing came early and I bet that thing is also coming to xbox stay in date but yeah like I bet that's probably like put one of the announcements this week but oh yeah that'd be smart yeah I don't think it's just that it's like it's a PC placement thing I think it's that it's like they're trying to widen out to other systems to begin with so yeah I don't think it's a like it's an interoperable interoperability between Sony and PC yeah as far as like y'all kusa like a lot of those games just came to xbox recently I want to say like I believe you can get yakuza on Xbox game pass I believe yeah and so I feel",
            "start": 3680.64
        },
        {
            "text": "between Sony and PC yeah as far as like y'all kusa like a lot of those games just came to xbox recently I want to say like I believe you can get yakuza on Xbox game pass I believe yeah and so I feel like when it comes to Playstation Yakuza it's less of an ownership thing or like a an agreement thing between PlayStation in in in in yaku's I think I think it's more so like yeah because I've been coming exclusively to PlayStation because that's where it makes sense for it to come like there's a longer history like the negotiate that game to Nintendo and Microsoft before and neither of them wanted it so he's very loyal to Sony for that reason yeah like since there's basically been it's a Japanese Japanese series and Sony did really well in Japan but now it's an international series and there's other options so there goes other options yeah in that that's basically my read my read with it right is that it's probably coming to other platforms because it makes more sense for it to come to at",
            "start": 3733.65
        },
        {
            "text": "other options so there goes other options yeah in that that's basically my read my read with it right is that it's probably coming to other platforms because it makes more sense for it to come to at other platforms now it is as far as like yeah we'll place you shouldn't put VR on PC so that you can eventually play ps3 our games on PC I don't am at like no I bet you can do that just bet it's not gonna be an official thing in life I think it's counterintuitive like what you said rights counterintuitive to what Sony and PlayStation kind of to how they go about things right like the idea of psvr is so that like you can play a Playstation like PlayStation games as a concept like PlayStation exclusives they're they exist holies to sell the hardware right like of course the software is gonna sell to you right placing a games do well but a big part of why Sony first-party games exists is to sell the hardware I imagine that then feeds into PlayStation hardware as well we're like yeah like psvr",
            "start": 3785.52
        },
        {
            "text": "to you right placing a games do well but a big part of why Sony first-party games exists is to sell the hardware I imagine that then feeds into PlayStation hardware as well we're like yeah like psvr strengthens the the PlayStation ecosystem is strengthens the hardware of the ps4 and you imagine the PS 5 I don't think you then once you give give up background to PC especially if especially when like there are there are VR units that are on PC like I'm sure if it places you really wanted to put a VR game on PC you can probably make that work with oculus or with with another headset yeah again I think that like I've whenever psvr to is I bet people making a bet about with the PC eventually just I don't think it'll be an official capacity sort of thing now it's time to squat up GaN doors Condor writes in with a squat up for destiny on ps4 and says calling all Guardians I'm making I'm making like I'm making like a prick I am making like a procrastinating student and cramming the remaining",
            "start": 3832.07
        },
        {
            "text": "writes in with a squat up for destiny on ps4 and says calling all Guardians I'm making I'm making like I'm making like a prick I am making like a procrastinating student and cramming the remaining 93 levels on the destiny season pass into the next month dear God do I need help if anybody wants to join my quest help me mercilessly slaughter the travelers attacked the travelers attackers and maybe even help me complete my first raid hit me up at Irish underscore bein Hatton on PSN PS warlocks for life again that's Irish underscore Manhattan on PSN if you want to play destiny on ps4 with GaN doors Connie where and blessing what up the traveler is bad listen Kevin I've only played 80 hours of Destin you gotta ask somebody who's played a thousand hours to really tell you he's in the traveler like God and I thought it was the big wave ball yeah I assumed it was a big award yeah I don't know what nothing but it's the first time I'm hearing that he's bad maybe it'll turn bad I bet there's a",
            "start": 3881.93
        },
        {
            "text": "like God and I thought it was the big wave ball yeah I assumed it was a big award yeah I don't know what nothing but it's the first time I'm hearing that he's bad maybe it'll turn bad I bet there's a lot of good sorry yes me that I just I'm never gonna be exposed to and that's fine but like I I've heard it's gotten good like an interesting overtime when I was playing destiny to it was very much like a I'm here for the ride kind of thing where like I was following the story but I wasn't like following the story you know I was like I'm playing that game just so I could like play with my friends and and do raids and stuff but meanwhile deep inner rage for exactly now it's time for kind of funny about comments last you wrong where you can write us right in let us know what we get wrong as we get it wrong nanobot is says season two blessing you mean earth two or you mean a book to earth talking about avatar last airbender their seasons I'm gonna call them seasons I always like the book",
            "start": 3931.43
        },
        {
            "text": "we get it wrong nanobot is says season two blessing you mean earth two or you mean a book to earth talking about avatar last airbender their seasons I'm gonna call them seasons I always like the book like it's a cool thing forget it it's a cool thing but also I'm never gonna refer to it as book two or book three its seasons you're right a few people are writing in here telling us that Microsoft is not skipping June in fact they've said that they're working on something huge yeah I would assume that like whatever they had planned for June originally and I assume the marketing plan still calls for a big June thing it would just be interesting if they did decide to skip it and then nanobot biologist writes in with breaking news bricky new date a halo 2 anniversary arrives on PC as part of the Master Chief collection on May 12 so look forward to that yeah for this week tomorrow's house go like this it's Greg and Gary Whitta happy Wednesday everybody they're back the dynamic duo remember",
            "start": 3975.49
        },
        {
            "text": "Master Chief collection on May 12 so look forward to that yeah for this week tomorrow's house go like this it's Greg and Gary Whitta happy Wednesday everybody they're back the dynamic duo remember we're reacting live to this week's inside Xbox as they show off games for next-gen that's happening this Thursday 8:00 a.m. Pacific time right here on twitch.tv slash kind of funny games games cast recording this afternoon the topic is game launches that had us height so stay tuned for that that's recording on patreon not conscious kind of funny games live and we up later on youtube.com slash kind of free games just in podcast services around the globe of course this has been kind of funny games daily issue dated 10 a.m. live right here on twitch.tv slash kind of funny games we run you through the nerdy news you need to know about we have a patreon post show for those that are subbed at the Silver level of patreon.com so it's kind of funny games so stick around for that otherwise until next",
            "start": 4030.81
        },
        {
            "text": "nerdy news you need to know about we have a patreon post show for those that are subbed at the Silver level of patreon.com so it's kind of funny games so stick around for that otherwise until next time gamedaily",
            "start": 4075.96
        }
    ]
}