{
    "id": 5026,
    "video_id": "mxkerk8uAo8",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Blessing Adeoye Jr.",
        "Gary Whitta"
    ],
    "title": "Cyberpunk 2077 Lets You Customize Your Genitals - Kinda Funny Games Daily 05.06.20",
    "description": "Get 20% Off and Free Shipping with the code GAMES20 at http://manscaped.com.\n\nBlessing and Gary Whitta talk about EA's big year and news that Cyberpunk 2077 will let you customize your genitals.\n\nTime Stamps - \n00:07:07 - Housekeeping\nTHE CORE STREAM IS HAPPENING! Core is the game where you whip up your own multiplayer video games, publish them, and play them with the world. THURSDAY at 3 p.m. PT join Greg, Andy, and the developers of Core as they make games and test them out with you. That’s right go download the Core Alpha right now at coregames.com and you can play whatever they create LIVE on twitch.tv/kindafunnygames. Follow @CoreGames on Twitter for updates!\nOur reaction to the new Last of Us 2 story trailer is now up on Youtube.com/KindaFunnygames\nRemember: We’re reacting live to this week’s Inside Xbox as they show off games for next gen. That’s happening TOMORROW at 8am Pacific right here on Twitch.tv/KindaFunnyGames.\nThank you to our Patreon Producers: Mohammed Mohammed, Black Jack\nThe Roper Report   -\n00:09:20 - EA is having a big year - Rebekah Valentine @ GIBiz\n00:21:35 - EA has announced that their upcoming games can be upgraded for free for next gen systems on the PS5 and Series X. Now we know that Xbox has their Smart Delivery system, and this is where I get into my two questions, but could this be the first sign that Sony has a similar idea up their sleeve? Finally, with the idea of upgrading games for free for new consoles, do you believe that the idea of new console generations having weak line-ups will be a thing of the past now that we will have our entire previous generation's library running better on the current system moving forward? - Best Friends Q:The Nano Biologist\n00:28:45 - Cyberpunk lets you customize your genitals - Joe Skrebels @ IGN\n00:36:48 - Mortal Kombat 11: Aftermath is the game’s year two expansion- Alessandro Fillari @ Gamespot\n00:42:52 - Today we got the reveal trailer for Mortal Kombat Aftermath. This came with more than just the new story content teased yesterday, but also characters, skins, stages, Friendships, and more. With Robocop being added to the roster, joining Joker, Spawn, and Terminator, as guest characters I'm curious if there is anyone you think would fit in the MK Universe. - Best Friends Q:The 5 Star Man\n00:46:40 - Gameplay footage for a cancelled Prince of Persia game has been on Youtube for years and nobody noticed until now\n00:49:35 - Out today\n00:53:20 -  MANSCAPED\n Reader mail   -\n00:55:32 - Should Naughty Dog not have released it final trailer at all? - Amiad Fredman\n01:01:50 - Squad Up: Chris Q(Charitable Causes!) - https://teespring.com/hyphen-american\n01:03:00 - You‘re Wrong\nTomorrow’s Hosts: Blessing and Tim\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nBlessing - http://www.twitter.com/BlessingJr\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Blessing Adeoye Jr., and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1588790003,
    "duration": 3936,
    "transcript_chunks": [
        {
            "text": "[Music] yo what's up welcome to kind of funny games daily for Wednesday May 6 2020 I'm one of your hosts blessing a Toa jr. and joining me is the force that is Gary Whitta I like that inch I gotta say I like that better than the rogue one I like it when you call me the force thank you thank you Gary I have two things actually when I address off the back cause of Star Wars yeah force a force to be reckoned with you know right you got I have two things I want to address first of all I want to say congratulations on animal talking thank all the updates on social media I've been seeing all all the big moves you've been making I didn't really able to see oh yeah it's it's completely surpassed any expectations we possibly could have had for it started out about a week ago just me and my wife and my friend Adam Nickerson just kind of screwing around in the in the basement of my virtual house thinking could we build a virtual talk show set and kind of you know play dress up and pretend at",
            "start": 1.12
        },
        {
            "text": "and my friend Adam Nickerson just kind of screwing around in the in the basement of my virtual house thinking could we build a virtual talk show set and kind of you know play dress up and pretend at being on a talk show and now somehow a week later we're actually making a talk show with real celebrity guests and production values and we're booked up through the month of May I'm not gonna say anything but when you hear some of the guests that we have booked to let for later on this month you're gonna freak out it's it's crazy I've been seeing some of the interactions on Twitter and seeing some of the people that have been responding and yeah I'm sure yeah I mean I'm in negotiations right now to get Reggie on the show we're in active negotiations dude thank you I'm very excited for any chance in getting on Sina you know look if John wants to I'm not I'm not gonna chase him around the place cuz like I booked up that you know but I don't need to reach out to guests at this point Hoffman",
            "start": 54.06
        },
        {
            "text": "in getting on Sina you know look if John wants to I'm not I'm not gonna chase him around the place cuz like I booked up that you know but I don't need to reach out to guests at this point Hoffman if John Cena wanted to do the show of course he would be very welcome he's always welcome on the animal talking couch alright well hopefully what catches this show see I don't see John see maybe it would be an interesting one because you can't see him right like if you have on an animal talking this empty chair you know oh that's right yeah that would actually make things much easier for us on this end actually yeah that is true what's up with this beef I'm seeing between you and Jeff Keely because I saw what you know that back look Jeff knows what he did I don't want to get into it I'm embarrassing publicly but someone asked me earlier today are you interested in the Xbox series X reveal yesterday and I said I was until I found out that had Jeff Keely had something to do with it as my",
            "start": 93.96
        },
        {
            "text": "publicly but someone asked me earlier today are you interested in the Xbox series X reveal yesterday and I said I was until I found out that had Jeff Keely had something to do with it as my excitement for the Xbox series X is is is is surpassed only by the utter contempt I have for Jeff Keely and everything he says and does so unfortunate maybe I can watch it with like the sound off or something so I don't have to listen to his voice I'm very excited about the series X but like Jeff and I've got a beef he knows what he did I just can't have anything to do with him and I've said it before he will never ever ever come on animal talking I wish I wish closed the show down before that happens he knows I got why didn't you ask Jeff this way there's not my problem ask Jeff what he did I'm sure Jeff listen to every episode of this show and Jeffy listening right now I invite you on to kind of funny games daily you can come through we can invite you on Twitter Wednesday yeah it's just not one",
            "start": 136.72
        },
        {
            "text": "Jeff listen to every episode of this show and Jeffy listening right now I invite you on to kind of funny games daily you can come through we can invite you on Twitter Wednesday yeah it's just not one no no no what I'm here I'm not know when you're in a room with the guy oh wow I mean technically you're in you are in the same room right technically we're via webcam you know you can't be not be in the same chat room is that is like no I can't be in the same virtual I can't be in the same kili Wow not how I'm just not having it blessing Jeff Keely if you want to give your side of the story on a day where we're Gary what it isn't here when I'm not here when I'm falling it will have you on the show I wonder I want to know Jeff Keely side of the story and we think swath all this I've got beef with blessed with with Jeff Keely blessing and it's gonna take a lot it's gonna take a lot for Jeff Keely to squash that beef it's not for me to squash the beef Jeff needs to squash it I understand",
            "start": 183.19
        },
        {
            "text": "with blessed with with Jeff Keely blessing and it's gonna take a lot it's gonna take a lot for Jeff Keely to squash that beef it's not for me to squash the beef Jeff needs to squash it I understand second thing I want to address I know Greg's night here Greg was supposed to be here on this episode but we we looked at the schedule and breakfast on too many things today I know you see we're supposed to do you like an animal crossing in game version of Cafferty where you guys both come come on show as your avatars and so I'm guessing that's gonna be delayed till next week but if something happens next week to where we guess we get shuffled around again Gary I'm gonna offer up I will I will do that ritual episode with you because I have animal crossing i haven't made what we don't have you booked yet but i want you i want all I want everyone from kind of funny on the show and bring them on in the order in which I like them so like for example tonight we have a very big show a live show",
            "start": 222.1
        },
        {
            "text": "booked yet but i want you i want all I want everyone from kind of funny on the show and bring them on in the order in which I like them so like for example tonight we have a very big show a live show 7:00 p.m. tonight twitch.tv slash Gary Whitta we've got iJustine is gonna be on the show one of the biggest youtubers in the business the guys from Penny Arcade Jerry and Mike the creators of packs are gonna be on the show tonight and our first guest from kind of funny Joey Noel I'm gonna be live on the show tonight I asked Twitter ixnay who do you want most from kind of funny on the show and Joey won it in a landslide so she's gonna be on the show next and then I think I'll bring people on in the order in which I like them so whoever comes on last you know you'll be able to figure something out from that Gary where can people catch animal talking twitch TV slash Gary Whitta the shows go out live 9 a.m. Mondays Pacific Fridays Pacific 9 a.m. and Wednesdays at 7 p.m. Pacific so we have a",
            "start": 262.11
        },
        {
            "text": "out from that Gary where can people catch animal talking twitch TV slash Gary Whitta the shows go out live 9 a.m. Mondays Pacific Fridays Pacific 9 a.m. and Wednesdays at 7 p.m. Pacific so we have a show at 7 p.m. tonight and then if you can't catch the show live you can go to youtube.com slash G Witter and we have all of you and we have all of the shows archived there and you can watch them basically on demand oh yeah like a whole ecosystem going on you have a host I'm telling you I'm learning or I'm learning about being a youtuber I'm learning about twitch streaming it's been one of the most interesting things about it all has been learning all these new skills like we Sweden in the last week I figured out how to you know do lights and cameras and transitions and animations and Adams been really really helpful at all of that and it's been amazing to get this this talk show up on its feet and I've just been loving it it's just it's a hobby that's really all I think of it as we've had",
            "start": 308.11
        },
        {
            "text": "really really helpful at all of that and it's been amazing to get this this talk show up on its feet and I've just been loving it it's just it's a hobby that's really all I think of it as we've had I've had been approached by corporate sponsors I've told them to go away I don't want their money I only I just want to have fun doing the show that's amazing Gary what I look forward to being on a more talking Sunday like you're coming are overall we need to listen I know you're a busy man busy man blessing but we'll work around your schedule we are gonna get you on the show thank you I appreciate it Gary today's stories include EA having a big year cyberpunk letting you play with your balls and more because this is kind of funny games daily each and every weekday at 10:00 a.m. live right here on twitch.tv slides kind of funny it'll make sense once we get there we run you through the news ease in about if you're watching live you can correct this when you get stuff wrong by going to Cana",
            "start": 353.74
        },
        {
            "text": "on twitch.tv slides kind of funny it'll make sense once we get there we run you through the news ease in about if you're watching live you can correct this when you get stuff wrong by going to Cana funny calm slash you're wrong if you don't want to watch live you can watch later on youtube.com slash kind of footed games or you can listen later on podcast services around the globe by searching for kind of funny games daily to be a proudly show ed to patreon.com/scishow any games or bronze members or above get to write in in silver members or above get the show ad free with the exclusive daily post show now stop some housekeeping of course the core stream is happening core of course is the game where you whip up your own multiplayer video games publish them and play them with the world Thursday that's tomorrow at 3 p.m. Pacific time join Andy Gregg and the developers of core as they make games and test them out with you that's right go download the core alpha right now at core games",
            "start": 394.48
        },
        {
            "text": "that's tomorrow at 3 p.m. Pacific time join Andy Gregg and the developers of core as they make games and test them out with you that's right go download the core alpha right now at core games calm and you can play whatever they create live on twitch.tv slash kind of funny games follow at core games on twitter for updates our reaction to the new last was to story trailer is now live youtube.com / kind of funny games gary did you get to catch that last last what's - trailer you know the last of us - is a game that I have on full media blackout I don't want to watch see anything until I play the game that's my air - fair enough I'm kind of of the same mind but of course we're kind of funny we love to react to things and so I mean I made the exception for this last I mean it's your job your job is to react to you know the trending exactly i-i-i-i've made a choice that I don't want to see anything until I actually play the game let me ask you this do you feel like the new trailer gives",
            "start": 434.53
        },
        {
            "text": "job is to react to you know the trending exactly i-i-i-i've made a choice that I don't want to see anything until I actually play the game let me ask you this do you feel like the new trailer gives much away cuz that's my problem often betrayal is they give too much away it doesn't give too much away but I would say like if you want to go on blind is going blind like the the trailer does grant a little bit of context to what's going on and it does probably like show the game's hands a little bit but overall like I'm not coming out of the trailer knowing exactly what's happening by any means like it doesn't do the thing where it's like oh I know I know the story now like the trailer decided a job of kind of keeping his cards close to the chest we're actually working on getting Neil druckmann and some of the other people from Last of Us to on the show when the game drops I'm gonna do a special last of aha episode oh yeah we're working on it right now man big moves being made here",
            "start": 478.42
        },
        {
            "text": "and some of the other people from Last of Us to on the show when the game drops I'm gonna do a special last of aha episode oh yeah we're working on it right now man big moves being made here remember we're reacting live to this week's inside Xboxes to show off games for next gen that's happening tomorrow morning at 8 a.m. Pacific time right here on twitch.tv slash kind of funny games before kind of funny games daily thank you to our patreon producers mommy Muhammad and blackjack today we're brought to you by manscaped but I'll talk about that later for now let's begin with what is and forever will be the Baker's starting with number one which is kind of a boring one but at the same time kind of a common kind of an interesting one ei is having a big year there was a big ol ei investor call where they kind of they kind of gave details about how they use year has gone and they kind of gave some some of the vision for their future at least for the fiscal year 2021 and so I'm pulling this",
            "start": 519.04
        },
        {
            "text": "where they kind of they kind of gave details about how they use year has gone and they kind of gave some some of the vision for their future at least for the fiscal year 2021 and so I'm pulling this from Rebecca Valentine at games industry dot biz who writes after disappointing 2019 ei forecasted a rebound in fiscal 2020 led by live service games like apex legends The Sims 4 and its annual sports titles let me stop there and give more context fiscal 2024 ei just ended and so we just entered fiscal 2021 and so EA Kai is kind of a head by a year when you look at their their fiscal year and so when we're talking about fiscal 2020 we're talking about the year that just ended for ei to continue the article though it appears to have forecasted accurately with the company reporting its q4 in four year earnings for 2020 showing year-on-year revenue and bookings increases increases the lion share of which were from digital and live services for the quarter EA reports digital net revenue of 1.2",
            "start": 569.52
        },
        {
            "text": "year earnings for 2020 showing year-on-year revenue and bookings increases increases the lion share of which were from digital and live services for the quarter EA reports digital net revenue of 1.2 billion dollars it's up 25 percent year-over-year and making up 88 percent of his total net revenue of 1.4 billion dollars operating income for q4 reached 401 million dollars up 105 percent year-over-year total net bookings in the quarter were 1.2 billion dollars made up of 211 million dollars in full game downloads that's up 25% year over year eight hundred and thirty-two million from live services which is up 17% and 176 million from mobile that's down 3% with the company's mobile revenues declining EA noted in its in its earnings that in fiscal 2021 it'll adjust is reporting on net bookings to focus on full games and live service bookings only grouping in mobile in an other category quote in line with a new direct or in line with the direction we continue to drive the business end quo",
            "start": 616.83
        },
        {
            "text": "to focus on full games and live service bookings only grouping in mobile in an other category quote in line with a new direct or in line with the direction we continue to drive the business end quo for the full year EA saw digital net revenue of 4.3 billion dollars up from 3.7 billion dollars last year and total net revenue of 5.5 billion dollars up from four point ninety four point ninety five billion dollars last year and a new record for the company net income for the year reached three billion dollars considerably up from last year's one billion with the aid of a one-time tax benefit operating income reached one point four billion dollars digital net bookings for fiscal 2020 were up four billion dollars up nine percent year-over-year and making up 78 percent of the company's total net bookings which were 5.2 billion dollars last year digital net bookings made up 75 percent of total net bookings and 68 percent the year before that additionally EA shared that fifa 2020 has reached",
            "start": 668.67
        },
        {
            "text": "bookings which were 5.2 billion dollars last year digital net bookings made up 75 percent of total net bookings and 68 percent the year before that additionally EA shared that fifa 2020 has reached over 25 million unique players and star wars should I fall in order has over 10 million unique players looking ahead ea anticipates q1 net revenues of 1.2 billion dollars that income of two hundred and seventy million dollars and net bookings of 1 billion dollars with burnout burnout paradise remastered and command & Conquer remastered currently set to release during that period for the full year the come in this we're talking about the upcoming year now for the full year the company projects net revenue of five point five billion dollars net income of nine hundred and seventy eight million dollars and net bookings of five point five billion dollars with Madden NFL 21 and FIFA 21 plan for q2 and NHL twenty one plan for q3 additionally EA plans to announce and release additional an",
            "start": 716.94
        },
        {
            "text": "dollars and net bookings of five point five billion dollars with Madden NFL 21 and FIFA 21 plan for q2 and NHL twenty one plan for q3 additionally EA plans to announce and release additional an additional EA sports title and EA HD title four titles from third-party partners to mobile soft launches Medal of Honor VR and expansions onto next-gen platforms for current EA titles quote this year the phase includes the effect of revenue recognition from the games we're launching for the current generation of consoles that can also be upgraded free for the next generation end quote said CEO Blake Jorgensen and so to boil all that down because I know I just said a lot and all that was a bunch of numbers and a bunch of boring [ __ ] to boil that down ea right has had a bigger year due to live service games right that's one - EA plans released 14 games over the next 11 months right which is big there's going to be an additional EA Sports title which I don't believe we've gotten word on yet and",
            "start": 761.28
        },
        {
            "text": "games right that's one - EA plans released 14 games over the next 11 months right which is big there's going to be an additional EA Sports title which I don't believe we've gotten word on yet and then EA is going to have free up upgrades for their current gen games on next-gen titles which is our next consoles I should say which is kind of the big hitter I'd say from this story Gary does any of that do anything for you no it was very boring yeah fair enough I about halfway through that by the way I don't know why my video is coming through mirrored on discord you're actually seeing a mirror image I didn't know so that you're angled the right way oh you'd want me to be facing the right way okay whatever whatever works for you you want me no I'm Mary I'm just you know I mean I'm here to serve you Kevin whatever you want I'm just saying you say the word I'll unmarry you no no no I mean it's fine it's fine I cannae difference no that was very boring about halfway through that blessing you",
            "start": 809.46
        },
        {
            "text": "you Kevin whatever you want I'm just saying you say the word I'll unmarry you no no no I mean it's fine it's fine I cannae difference no that was very boring about halfway through that blessing you started to sound like the teacher from the peanuts cartoons what wha EA EA has made a lot of money okay yep what's the next story see to me the thing that makes this interesting is when the life service thing right like how does that then affect how he operates going forward the idea that though over the last year right look at the sims you look at Apex you look at the sports games and this isn't it this isn't necessarily something entirely new for EA right them making a lot of money off of live games like that's kind of been the story of their generation um but I think with this this year being like one of the most more successful years right I think this then signals that they're gonna stick to this yeah even with the 14 games they have announced over the next 11 months right like I don't",
            "start": 854.22
        },
        {
            "text": "like one of the most more successful years right I think this then signals that they're gonna stick to this yeah even with the 14 games they have announced over the next 11 months right like I don't I don't necessarily see them making like like a new Mirror's Edge for example right it seems like they're it seems like they found a comfortable spot with the games they had they have been making oh you're right look I don't mean to I don't mean to be facetious which by the way is one of the only words in the English language it has all the vowels in the correct order I don't really I don't know why I thought to tell you that I mean I yeah that was cool it was really cool yeah I mean look you can actually divine some things from this you can avec leur EA is gonna go with the money isn't if they're making money in life service games they're going to continue to do that so ya expect to see more life service games for Italy expect to see them doubling down it's no surprise in this context",
            "start": 902.7
        },
        {
            "text": "they're making money in life service games they're going to continue to do that so ya expect to see more life service games for Italy expect to see them doubling down it's no surprise in this context that the EI is trying right now to reboot and reinvent anthem Rex is everything if they if anthem 2.0 can get it right then they can actually start making money at that they've screwed it up the first time but maybe they can get it right on that on the first bounce and I hope so because I'd love anthem to be a success I don't like to see people fail as someone engaged in the creative arts it's agonizing when something you put a lot of work in to crashes and bones and if they could anything take another there's nothing we like more than a good redemption story right so the anthem comes back and is actually great I no one would be more thrilled than I well I think AAA would probably more be more thrilled than me but I would be thrilled for them and I think you're definitely gonna see that",
            "start": 947.82
        },
        {
            "text": "is actually great I no one would be more thrilled than I well I think AAA would probably more be more thrilled than me but I would be thrilled for them and I think you're definitely gonna see that happening because again like Life Services is where the money is and the more EA realizes that as they obviously are because they're looking at the numbers they're more they're gonna double down it again the question is are they learning how to do life service in a better way there isn't it doesn't have aggressive monetization that doesn't have just an endless loop grind that makes people miserable they have to find way they never leave they haven't learned yet how to do life service right there what they've learned is there is gold in them thar hills there is money to be made in life service gaming and so they are gonna go hard into that and so then order to go hard into it successfully they are gonna have to learn how to do life service right everyone does no one really knows how to do a",
            "start": 991.41
        },
        {
            "text": "and so they are gonna go hard into that and so then order to go hard into it successfully they are gonna have to learn how to do life service right everyone does no one really knows how to do a life service right yeah we're getting better at it all the time because it's a new meat it's a new form of of gaming and we're still figuring out like where that whether what the parameters are and how to do it right and whenever you overstep the mark so they're working on it I hope I hope they get it right I like when life service games work and they and they're good I really like them yeah I think it's one when it comes down to live service games right and how do we like EAS process of figuring out that how to make those work right leg I think for them really comes down to going like looking at each game as unique as opposed to try and trying to treat all live live service games the same because if you look at battlefront 2 which came out a couple years ago and had that huge controversy with",
            "start": 1033.26
        },
        {
            "text": "game as unique as opposed to try and trying to treat all live live service games the same because if you look at battlefront 2 which came out a couple years ago and had that huge controversy with loot boxes and that was really the game that really like sparked like the the big uproar in terms of loot boxes and how we treat them and you know them being predatory especially the kids I think you look at you look at Battlefront see when you and you and you see that oh they took this from like FIFA Ultimate Team right they took this from right like their sports titles right and you know you look at something like anthem and it very much seems like EA just didn't just didn't and doesn't necessarily know how to grapple with this type of live service game right I like you kind of got a treat everything as individual and everything is unique I think because the way that people are gonna approach playing a game like FIFA is different from the way people are gonna approach playing a game like",
            "start": 1074.21
        },
        {
            "text": "as individual and everything is unique I think because the way that people are gonna approach playing a game like FIFA is different from the way people are gonna approach playing a game like anthem you can't like put out you can't put out an anthem and treat it like it's like it's FIFA and expect write the same results and so I think for EA like you look at you know in the in the talk of live service games and as in their evolution and kind of where we're at with with I guess video games as a whole right like I look at games like why look at Ubisoft as a publisher and I'm like yeah seems like they pretty much got things figured out in terms of what a live service game means to them like Rainbow six siege just got a ten from GameSpot earlier this week as like an updated review because they figured out their flow flow with that game that game was at a place where it's incredible because we kind of kind of figured out that formula for them yeah I think they just have to figure out like",
            "start": 1117.0
        },
        {
            "text": "figured out their flow flow with that game that game was at a place where it's incredible because we kind of kind of figured out that formula for them yeah I think they just have to figure out like all right what does what is our what are our core values for us as a business and how we operate in in making our games last a long time in a way that doesn't feel predatory and for EA I think they have kind of a long way to go before they reach the point where it feels like everything is balanced with them right now it does feel like they are they often throw things at a wall to see what sticks and Anthon was one of those things that didn't stick and that left a very bad taste in people's mouths yeah I'm by the way I think it's great that the the review sites are going back and revisiting games as they evolve you know because games games aren't a static thing anymore it's not like you know back in the Nintendo Super Nintendo days or whatever you get a cartridge and that game that you",
            "start": 1156.45
        },
        {
            "text": "games as they evolve you know because games games aren't a static thing anymore it's not like you know back in the Nintendo Super Nintendo days or whatever you get a cartridge and that game that you bought was gonna be the same game for the next for its lifetime like the cartridge game would never change now of course games have oven they're patched a DLC and there's all kinds of improvements that constantly made like Mike might guess it I don't play Rainbow six siege but my guess is that Rainbow six siege that you play today is in many ways unrecognizable from the version that came out at launch so I think it makes sense for the review sites to go back and revisit them and give them a score that represents what the game is today and just on the whole live service issue again you're right like what works in FIFA may not work in answer but I think there are general principles like if ei figures out for example a way to do loot box is that people actually like and does and doesn't turn",
            "start": 1197.73
        },
        {
            "text": "like what works in FIFA may not work in answer but I think there are general principles like if ei figures out for example a way to do loot box is that people actually like and does and doesn't turn off their audience and EA can make money doing it it could be that that principle is a universal principle that can be applied to other games but always yes certain so like Ultimate Team like how do you make that work in at them like that's not something they can cross over but I do think this is an emergent form of game design life service games are a new thing and there's all kinds of new game design principles and new best practices that game designers have to learn to make the live service games work well and they're looking you know to vote you know EA is looking at Ubisoft which is looking at Activision and they're all you know learning from one another and from their own you know from their games that they have inside their own stable and you know they're gonna get they're gonna get",
            "start": 1234.96
        },
        {
            "text": "at Activision and they're all you know learning from one another and from their own you know from their games that they have inside their own stable and you know they're gonna get they're gonna get better at it and I'm excited to see that this new genre of game evolve the ninel biologist writes in to patreon.com slash kind of fun and games just like you can and says happy widow Wednesday in a surprising turn of events EA has announced that their upcoming games can be upgraded for free for next-gen systems on the PS 5 in Xbox series X now we know that Xbox has their smart delivery system and this is where we get into my two questions one could this be the first sign that Sony has a similar idea up their sleeve finally with the idea of upgrading games for free for new consoles do you believe that the idea of a new console generation having having weak lineups will be a thing of the past now that we'll have our previous our entire previous generations library running better on our",
            "start": 1272.94
        },
        {
            "text": "believe that the idea of a new console generation having having weak lineups will be a thing of the past now that we'll have our previous our entire previous generations library running better on our current system moving forward particularly with particularly with Xbox but not or but TBD with Sony thanks the Neneh biologists so let's look at that first part of the question first right like could this be could this be the first sign that Sony has a similar idea up their sleeve talking about smart delivery I hope so because I think what Xbox has been talking about in terms of smart delivery has been great I love it I love the idea of smart delivery the idea that I can that I can pick up you know as Assassin's Creed Valhalla for Xbox one but when if and when I get my Series X I'm gonna have the suit it's gonna it's gonna automatically upgrade it so the beefier version or play on series X that's fantastic I love the fact that we're not going to have to buy games twice and I think that I",
            "start": 1315.21
        },
        {
            "text": "the suit it's gonna it's gonna automatically upgrade it so the beefier version or play on series X that's fantastic I love the fact that we're not going to have to buy games twice and I think that I said this on the show before that is such a gauntlet thrown down by Microsoft at Sony's feet there's so many kind of has to pick it up right you know it there's gonna be a battle not just this is not just gonna be a battle of tech specs and teraflops in the new generation it's gonna be about quality quality of life what's the act what's the experience actually like on this platform and if Xbox one is saying hey you can buy one copy of Valhalla and it will work on Xbox one and Series X but over on PlayStation you've got to buy it on ps4 and then rebuy on PS five that's a major major advantage that Xbox has over Sony so III think Sony had no they'll come up with their own you know a trademarked name for it but yeah I think they have to match that move don't you agree yeah I mean I think this",
            "start": 1363.9
        },
        {
            "text": "Xbox has over Sony so III think Sony had no they'll come up with their own you know a trademarked name for it but yeah I think they have to match that move don't you agree yeah I mean I think this is this is more evidence that Sony has some sort of answer to smart delivery like me and Greg have talked about this on the show previously in terms of smart delivery and like how does that look like versus backwards bad bility for example and the conversation kind of always get gets muddy the deeper and deeper we kind of dive into like the differences between the between the two but yeah like as a simple concept right being able to buy a game once and then having that game available on your next-gen system and also your current gen system and having being able to play the best version of that game anywhere right like that's a big perk on the Xbox side and EA coming out and saying that yeah like our games are gonna be available for free or not for free but you'll be able to upgrade for free",
            "start": 1406.65
        },
        {
            "text": "anywhere right like that's a big perk on the Xbox side and EA coming out and saying that yeah like our games are gonna be available for free or not for free but you'll be able to upgrade for free for next generation if you say by FIFA 21 on your current console that then tells me that there is some sort of solution for for PlayStation right like because you imagine that they're doing that they don't explicitly say smart delivery in the story but you imagine that EA's way of doing that on Xbox at least will probably be smart delivery unless they have their own solution and if that's the case then they must have there must be some sort of solution for PlayStation to make that happen speaking of speaking of you know the coming console wars and what and what is Sony gonna offer you know ahead what are gonna be the competing offers I saw this rumor the other day and I think it was on a very dodgy site like the kind of site that prints rumors without any verification I don't know if you",
            "start": 1448.2
        },
        {
            "text": "what are gonna be the competing offers I saw this rumor the other day and I think it was on a very dodgy site like the kind of site that prints rumors without any verification I don't know if you heard it but there was a rumor going around that the new PlayStation Store on PlayStation 5 is always gonna be like stadia where you can jump into any like any game that's on offer in the store you could jump in and like immediately play a demo of it like it's just immediately live in a google stadia kind of way so you can like instantly try a game before you buy and I don't know if I believe that again this the site that posted it wasn't really a site that had all I was like I don't know about this site this doesn't seem like there's a lot of credibility to the reporting here but I thought hey if that's true that would actually be really cool I really really missed the days playing Xbox 360 Microsoft had a rule every single game that went up you had to have a demo you had you couldn't put",
            "start": 1492.39
        },
        {
            "text": "if that's true that would actually be really cool I really really missed the days playing Xbox 360 Microsoft had a rule every single game that went up you had to have a demo you had you couldn't put you couldn't put a game up without a demo and I kind of missed those days and I wish I wish they would come back so I don't know if you've heard that rumor but house seems like it would be cool if it were true I've not heard that rumor but I bet you that's at the very least something that they've tried to figure out right because like that's the complaint that you hear from everybody I was listening to a podcast that I like called bodega boys which isn't a video game podcast it's literally just just a comedy podcast from thesis and Mero the TV personalities and you know they the topic of video games came up and like even that there they were complaining like oh yeah man like I miss like I miss when I could just like put on a video game and not have to like wait forever for this game to",
            "start": 1528.54
        },
        {
            "text": "games came up and like even that there they were complaining like oh yeah man like I miss like I miss when I could just like put on a video game and not have to like wait forever for this game to download right like that's a that's a common theme that has kind of grown over the last couple of generations right with that when a video game downloads and updates and all these things and I'm in stadia very much has it as a selling point and I don't know that selling points really hit home from them but they've had it in their advertising right that hey you can just you can be watching a trailer for a game on YouTube and click a button and always jump right into the game yeah immediately yeah and I don't know if studio works that way I don't because it doesn't yet like you know stadia is still offering like its functionality is still like the barest of bare bones all the features that they promised many of them are things that are still being promised down the road but in the idea and this",
            "start": 1569.64
        },
        {
            "text": "offering like its functionality is still like the barest of bare bones all the features that they promised many of them are things that are still being promised down the road but in the idea and this has been the big promise stadia stadia really launched you know long before it was ready to take out of the oven and you needed much longer before they launched it and now they're playing catch-up and fighting all this negative publicity if that if that's something that Google has seen and has taken notice of and has tried to apply to their marketing of stadia then it's something that I I imagine that both Xbox and Playstation have taken a look at and probably try to figure out ways to make yeah that experience they have ways general just in general I would love to see game demos make I think it's because it's a lot of extra hassle for the developer to build a demo or even carve out like a special piece of the game just to make available as a demo and depending on the kind of game not all",
            "start": 1607.47
        },
        {
            "text": "it's because it's a lot of extra hassle for the developer to build a demo or even carve out like a special piece of the game just to make available as a demo and depending on the kind of game not all games are really well-suited for demos but I would really like to get to a point where there are basically demo versions of games are back so you can you can play them before you try before you buy and if there is a stadia type way in which you could just instantly like click on and like that immediately the game is that the first 10 minutes of the game or whatever you can play and get a feel of it before you before you commit to buying that would be brilliant but honestly I'd be happy to have game demos come back just in the old-fashioned like download this demo would be good air for me we both I mean Sony has the same guy but they have PlayStation now right which is their streaming technology like Xbox has X cloud right so the back end is there the question is can there why are the",
            "start": 1647.07
        },
        {
            "text": "we both I mean Sony has the same guy but they have PlayStation now right which is their streaming technology like Xbox has X cloud right so the back end is there the question is can there why are the demos in the store that would be really cool yeah and part of me thinks at the very least we'll see one of them try it I bet you if we if like if if it's not the case that we see it see it soon then they probably tried it and they just couldn't fit like they couldn't make it worth it in order to make it work in their store I hear ya story number two cyberpunk lets you customize your genitals this comes from Joe scribbles at IGN and this is all dressing earlier when I said styrofoam is letting you play with your balls Joe scrabbles writes this the ESRB has published this rating report for cyberpunk 2077 which includes new bit a new bit of information about the game's character creator you can now customize your players your player characters genitals per the report quote players can select",
            "start": 1684.9
        },
        {
            "text": "2077 which includes new bit a new bit of information about the game's character creator you can now customize your players your player characters genitals per the report quote players can select a gender and customize their character customization can include depictions of breasts buttocks and genitalia as well as various sizes and combinations of genital of genitals and quote okay what appeared to be part of CD Projekt RED z-- decision to not include a traditional gender option in the game instead offering a quote really inclusive expanded character customization menu the report also makes mention of in-game purchases but CD Projekt RED has subsequently told IGN that these refer to the ability to buy future DLC expansions for the game not microtransactions quote as we've seen before cyberpunk 2077 is a single-player game with no microtransactions the ESRB info is based on the fact that the expansions require the the base game and are therefore treated as a purchase by the rating",
            "start": 1731.34
        },
        {
            "text": "cyberpunk 2077 is a single-player game with no microtransactions the ESRB info is based on the fact that the expansions require the the base game and are therefore treated as a purchase by the rating board and this is said by a spokesperson for asleep rush to read much of the report which Awards the game and m17 plus rating focuses on the adult content mentioned in the previous Australian ratings report including suggested suggested sexual actions extreme violence and gore and swearing quote players can encounter events where where they have to have the option to engage in sexual activities with other main characters or prostitutes says the report these brief sex scenes from a first-person perspective to pick partially nude characters moaning suggestively while moving through various positions some scenes contain brief depictions of thrusting motions other scenes depict a character's head moving towards partners crotch and quote Gary duh does this do anything for you do you have any",
            "start": 1775.47
        },
        {
            "text": "some scenes contain brief depictions of thrusting motions other scenes depict a character's head moving towards partners crotch and quote Gary duh does this do anything for you do you have any interest in customizing your character's genitals in styrofoam I kind of had a I kind of had a similar reaction as you were reading that piece to the reaction I have when like Tim or Greg talk about shaving their balls in one of those manscaping commercial oh the end wait for it get ready yeah yeah okay sure why not I don't have a problem with it I think that's kind of cool look body modification and that kind of said it's all part of like the cyber cut cyberpunk millyar right so why not why not give people those options this is a story that's gonna get a lot of a lot of press because the deep down were all ten-year-old school kids right he said but he's a dick he said poopy that's funny like your bodily functions and genitals and things like that or for some reason hilarious and we always like",
            "start": 1819.78
        },
        {
            "text": "were all ten-year-old school kids right he said but he's a dick he said poopy that's funny like your bodily functions and genitals and things like that or for some reason hilarious and we always like talking about them when you know the horse paws were swinging around in Red Dead Redemption we all thought that was great and hilarious they've got a lot of news coverage I'm sure the people at CD Projekt RED knew that this was going to get a lot of news coverage it does sound like the romance options and the Sanders and the kind of the intimate scenes in this game are gonna go be the next level beyond like you know Mass Effect or whatever which was very you know it was suggestive it would be really like yeah buzzing crap or anything I don't think this I don't think this would be hardcore either but I think it's I think it's gonna be like the next the next level up yeah I mean we're down depending on which way you look at it do you think it's gonna get new stories the way that mass",
            "start": 1864.03
        },
        {
            "text": "either but I think it's I think it's gonna be like the next the next level up yeah I mean we're down depending on which way you look at it do you think it's gonna get new stories the way that mass affected because when Mass Effect had those sex scenes right that was like a thing on like fox news and CNN of like oh yeah look like video games are allowing you to simulate sex that was like a big news point but do you feel like we're kind of past that at this point like it's been like what ten years says since we had since Mass Effect kind of made that splash I in the media no I I mean do I think we're past the point we're gonna we're we're we're we're having juvenile reactions every time we hear about boobies or dicks in a videogame now wouldn't it well the human race would never evolve beyond that point we will in the in the year 3000 we will be playing cyberpunk 3077 and it will be in some kind of PlayStation 9 holographic you know crystal sphere that building directly into your brain",
            "start": 1906.39
        },
        {
            "text": "that point we will in the in the year 3000 we will be playing cyberpunk 3077 and it will be in some kind of PlayStation 9 holographic you know crystal sphere that building directly into your brain and will still be going higher I saw the guy's dick like that's never gonna change I can't wait for the PlayStation now yeah let me I'm always mentioning this in this year yes sir be right up right I'm I'm down for as long as it's handled correctly right like the idea of being able to choose her genitals and like customize them all this stuff right like I mean I think that then allows for more inclusivity which could be cool right being able to yeah and I think that's true is true as well I think one of the things they got into a little bit of hot water about this I remember like last year when the first press news that they said like how they were handling gender and non you know non-binary gender issues and body modification and stuff like that and if you know this it's a you know it's",
            "start": 1946.86
        },
        {
            "text": "the first press news that they said like how they were handling gender and non you know non-binary gender issues and body modification and stuff like that and if you know this it's a you know it's it's it's a tightrope that they're walking is they need think they need to do it in in the right way where they don't you know piss anybody off yeah but they're playing in that sandbox and if they do it right it could be really cool so I'm gonna wait and see yeah and that's my thing right it could be really cool and it could be really progressive and really forward-looking and could include so many people which could make this a very beautiful thing on the other hand I hope they just don't [ __ ] it up and like make it insensitive in a way where like you know now where you're making fun of people for the genitals or something like that right like I hope they're able to kind of pull this off and where it's like these do you think that would have like gameplay ramifications like for example if",
            "start": 1992.31
        },
        {
            "text": "for the genitals or something like that right like I hope they're able to kind of pull this off and where it's like these do you think that would have like gameplay ramifications like for example if you give yourself like a massive massive dong would that change the romance of options are available to you for example or we're gonna be purely cosmetic that's a good question okay now don't I got you thinking like I fight I fight where you're gonna go is like you have you have a big dick so you can't go as fast but you're like yeah oh yeah I mean you know incumbrance like they have in role you can only carry so much you know yeah but the idea of the way you customize your genitals then like affects your romance options I really that's I feel like that's a very that's very much a deeper conversation that I'm sure like they have to wrestle with over there and I don't I don't know if they go that deep I think for them they just kind of play the safe route and just probably let you romance",
            "start": 2029.07
        },
        {
            "text": "that I'm sure like they have to wrestle with over there and I don't I don't know if they go that deep I think for them they just kind of play the safe route and just probably let you romance whoever you want and don't like because I feel like whenever you kind of apply restrictions to that that feel like they're restrictive just for the sake of being restrictive people kind of are rubbed the wrong way like persona 5 for example persona 5 you're playing as your own main character who you name and all this stuff and you are basically able to romance pretty much every female character in that game if you want to but you can't romance any of any of the male characters I know there's some people that that that weren't into that that didn't really like the idea of that and they and the original persona 5 was like aggressively anti-gay there there's really kind of stereotypical gay characters I believe in right in royal I believe they've taken their scary yeah change in royal enroll they",
            "start": 2069.57
        },
        {
            "text": "persona 5 was like aggressively anti-gay there there's really kind of stereotypical gay characters I believe in right in royal I believe they've taken their scary yeah change in royal enroll they they've changed it a bit so that the lagaye characters in persona 5 for the ones you're talking about like they basically were kind of predatory and there it was it was kinda it was kind of definitely like oh this is kind of a gross depiction of gay people and personal if I roll they changed that a bit so that is they don't come off as predatory they just come off as more so like like I haven't gotten there yet I don't know the exact way they do it but they fix things from what I'm what I understand right so yeah for a cyberpunk I imagine they they let you customize your genitals your genitals and do all that stuff but I don't imagine that they make relationship stuff restrictive based on that I didn't I don't usually look at the chat but I haven't just happens a glance I didn't crush lemons",
            "start": 2108.65
        },
        {
            "text": "do all that stuff but I don't imagine that they make relationship stuff restrictive based on that I didn't I don't usually look at the chat but I haven't just happens a glance I didn't crush lemons I hope I can put lasers on my dick that's an IP Internet yeah I mean you can you can you can you know one of the things you can I add you know custom technology like body modifications to your body like you know put like chips in your arm and stuff like that why not why not put a laser on your dick maybe you could use it as a weapon I mean I did you ever play Deus Ex the the modern yes of course yeah back in the jelly-like those those games the modern ones deal a lot with body augmentation and like replacing replacing parts your bodies and making them kind of like upgrades for your character I'd be down with a dick upgrade you know like I think we all would yeah I mean yeah yeah Story number three Gary Mortal Kombat 11 aftermath is the games year 2 expansion I'm pulling this from Alessandro",
            "start": 2149.82
        },
        {
            "text": "be down with a dick upgrade you know like I think we all would yeah I mean yeah yeah Story number three Gary Mortal Kombat 11 aftermath is the games year 2 expansion I'm pulling this from Alessandro filari at GameSpot who writes NetherRealm Studios mortal kombat 11 recently celebrated its first anniversary and the developers even teens that more content was on the way for the evolving fighting in now Mortal Kombat 11 aftermath has been revealed and it's the first expansion of his kind for the franchise in addition to adding three new characters including the next guest character Robocop it also includes new stages stage fatality fatalities and friendships and unexpectedly more story content releasing on May 26 for PC ps4 Xbox one switch and stadia Mortal Kombat 11 aftermath will mark the beginning of year 2 content for nether realms fighting game for the first time in the series mortal kombat we'll see an expansion to to the game's existing main story which will bring recurring",
            "start": 2190.53
        },
        {
            "text": "the beginning of year 2 content for nether realms fighting game for the first time in the series mortal kombat we'll see an expansion to to the game's existing main story which will bring recurring antagonist Shang Tsung to the forefront set immediately after MK Elevens conclusion the new epilogue storyline form MK 11 aftermath will introduce much of the new content coming to MK 11 which includes which which includes revisits two classic stages like MK 2's deadpool and MK 3 s soul chamber in addition aftermath will bring bring backstage fatalities and friendships which will end grotesque matches on a much lighter note aftermath will also bring back classic fighters like the wind-god Fujin and she and the show con warrior Sheila who's been absent who both been absent from the roster roster for quite some time that can't talk continuing with the tradition of introducing guest characters with previous MK 11 guest beings on the Joker and the Terminator mortal kombat eleven aftermath will",
            "start": 2239.16
        },
        {
            "text": "for quite some time that can't talk continuing with the tradition of introducing guest characters with previous MK 11 guest beings on the Joker and the Terminator mortal kombat eleven aftermath will see the arrival of the first guest character for year two Detroit's own cyborg police officer Robocop originally from the hyper-violent 1987 action film directed by paul verhoeven Robocop is a well armed an immensely powerful action hero which makes him an excellent fit for mk though details are scarce on how he'll fight the original film's actor Peter Weller will reprise the role for his appearance in MK 11 for complete authenticity I Gary are you are you a big fan of Robocop at all Oh huge fan of Robocop in fact I know Peter Weller a few years ago myself in a comic book writer by the name of Ron Mars did a little charity project to try and raise money for food banks in Detroit because they were really struggling in Detroit with their you know food security situation and we did a we",
            "start": 2287.58
        },
        {
            "text": "of Ron Mars did a little charity project to try and raise money for food banks in Detroit because they were really struggling in Detroit with their you know food security situation and we did a we created something called Robo charity and we actually got Peter Weller to come and record a little video for us to help promote the charity and I got together I went to LA and I met him spent the morning when he was super nice and he did a whole really cool video where he promoted the charity and then at the end because I specifically asked him to do it I'll find the video for you he points to the camera goes thank you for your cooperation no that's so cool and so peter weller is a great guy he there's really no other voice for Robocop it's cool that they brought him back into the game my question is how do they Robocop's a tough character because he's not in the get in the movies he's not very mobile he's slow he can't jump I wonder if there had been some game as a game design challenges in",
            "start": 2333.12
        },
        {
            "text": "is how do they Robocop's a tough character because he's not in the get in the movies he's not very mobile he's slow he can't jump I wonder if there had been some game as a game design challenges in converting him into a Mortal Kombat character that can do all the moves that he needs to do but still feel like Robocop Kevin are you able to find and pull up the trailer for MK 11 aftermath I should see if I can find work on it right now my man because I haven't seen the trailer I imagine that there there's probably gameplay in there for us to look at and see cuz yeah like for MK I think traditionally or at least for these modern games isn't the fastest of fighting games especially I'm K 11 I feel like I'm Kaila but it's kind of slower and so you're able to kind of have heavier characters like Shiva which was mentioned as a new character for this DLC Shiva historically is like a heavier character right she's kind of like she's kinda like Goro a bit where Goro is like this huge giant with",
            "start": 2380.01
        },
        {
            "text": "Shiva which was mentioned as a new character for this DLC Shiva historically is like a heavier character right she's kind of like she's kinda like Goro a bit where Goro is like this huge giant with four arms in mortal combat and they do a pretty good job of making characters that are like you know big have a lot of have a lot of like weight to them and are able to move slow but still be powerful I wonder if Robocop is gonna be in line with like you know you know I really want to you know I want to see more than anything I want to see Robocop's fatalities oh they're gonna be incredible yeah you're like amazing like that comes out of his arm you know the thing that you there's a spike that he uses to interface with computers but you also likes to stab people in the neck with it that'd be good guys really quick there won't be audio because I have to change the configuration a bit but okay okay probably music trailer they just dropped yes is it is it muted for the audience also yes",
            "start": 2422.7
        },
        {
            "text": "be good guys really quick there won't be audio because I have to change the configuration a bit but okay okay probably music trailer they just dropped yes is it is it muted for the audience also yes perfect in that case you might be we'll just like scroll through the game because this looks like story stuff which I'm also very excited for once again III haven't watched the the trailer yet just cuz you know I have Mortal Kombat 11 right here I'm not good at fighting games but maybe I should bust it out and at least play the story mode because maybe the story mode is really good the story mode is fantastic and I think it's they do a very good job of making it succinct and accessible in a way where like it's only like white like four or five hours long I believe if rope is in your I guarantee you it's only like a two-second thing at the end like Solid Snake there you go here we go yeah oh man God it looks good that reminds me of the smash brothers reveal when they when they first",
            "start": 2460.97
        },
        {
            "text": "you it's only like a two-second thing at the end like Solid Snake there you go here we go yeah oh man God it looks good that reminds me of the smash brothers reveal when they when they first revealed Solid Snake yeah no more to the end they've been doing a lot they've been doing a great job with how they reveal their guest characters in that singsong yeah and then we still having Shang Tsung back in the game yeah he was back in as a DLC character where now he's actually back in and it look any story it's like it's the actor from the Mortal Kombat movie I think it is yes it is it's the same yeah he's the he's voice acting but look how they modeled his face as well that's what I'm going on I can't hear the voice yeah yeah no like I'm patient I pretty sure that's how he did it I love it I have a sniper question here from the five-star man who writes in it says happy with a Wednesday today we got the reveal trailer for mortal combat aftermath this came with more than just the new story",
            "start": 2512.09
        },
        {
            "text": "have a sniper question here from the five-star man who writes in it says happy with a Wednesday today we got the reveal trailer for mortal combat aftermath this came with more than just the new story content teeth yesterday but also characters skins stages friendships and more with Robocop being added to the roster joining Joker spawn and terminator as guest characters I'm curious if there is anyone you think would fit in the MK universe and he says sorry Greg tiny water would be too Opie thanks for everything to stay safe the five star man Gary I know you you said you haven't dived into mortal kombat 11 yet is there characters that like that you would want for the game either way it's a really good question I'm thinking about it now and you know I think I will say this in advance like the ones that they have added I think have been great I'm not a particular fan of spawn as a character but you know terminator is cool Robocop is cool the Joker is cool I don't know like you know",
            "start": 2561.49
        },
        {
            "text": "the ones that they have added I think have been great I'm not a particular fan of spawn as a character but you know terminator is cool Robocop is cool the Joker is cool I don't know like you know because obviously there's all this licensing issues as well and there's a lot of stuff that has to get figured out before they can bring these characters into the game someone said Eli in the chat how about that he like with these machete that'd be pretty cool oh man yeah I make trouble of heads my eye I would like to do marine to be in mortal combat I feel like he would be a good fat people ask him for smash all the time but I feel ad boom that would be up the more than that alley ed boon if you are interested I can hook you up with the people who own the Eli character and I can get that I can make that react or give me a jingle give me a jingle jingle in yeah well yeah like for more combat right I'm thinking of I'm trying to think of people that are super violent right and if it and also",
            "start": 2605.14
        },
        {
            "text": "make that react or give me a jingle give me a jingle jingle in yeah well yeah like for more combat right I'm thinking of I'm trying to think of people that are super violent right and if it and also like more comments being published by WB right so you have access to those properties so like it'll you're in character and you know what you know you know what their blessing it's actually not as easy as you think you think these joint you think these mega companies right you say for example and by the way now that I've thought of this this is this is my answer this is the answer in terms of the character that I most want are in mortal combat 11 let's say for example they said okay we want to add Joey from friends as a playable in Mortal Kombat 11 how are you doing let that be part of you speak who say how are you doing and he like rip your spine out that would be awesome and right now you'd think that would be easy because Joey from friends is a character that is owned by Warner Brothers",
            "start": 2648.64
        },
        {
            "text": "who say how are you doing and he like rip your spine out that would be awesome and right now you'd think that would be easy because Joey from friends is a character that is owned by Warner Brothers and so is the game but these companies are so big and they're all separated into these separate silos and pods that like just because it's all the same company it doesn't necessarily mean that they play well together like the Warner Brothers television people might say to Warner Brothers games and you know how much you're gonna pay us we don't want to do it they are essentially separate companies with separate accounting and but they and they're all under the same corporate umbrella but just because they're under the same corporate umbrella doesn't necessarily mean that Ed Boon could just walk into the Warner Brothers Archive and put like Humphrey Bogart from Casablanca in Mortal Kombat 11 like this is still a whole thing that you have to go through to make that work but now yeah Joey Joey",
            "start": 2697.44
        },
        {
            "text": "into the Warner Brothers Archive and put like Humphrey Bogart from Casablanca in Mortal Kombat 11 like this is still a whole thing that you have to go through to make that work but now yeah Joey Joey my friend Joey from friends would be my answer oh he would say how are you doing and then he would rip your spine out and go not too good apparently like that would be great I would learn anything yeah uh yeah I I want it throughout Baltimore from Harry Potter like another WB one right and like yeah but like I feel like when you look at Mortal Kombat right like the the thing the more common has going for it is super violent but then also like magic and all like all this different supernatural stuff I feel like Voldemort even though Harry Potter isn't super violent I feel like I feel like you could you could let Voldemort get like a little bit violent you know if you're gonna bring any character in from Harry Potter it would have to be the villain right yeah exactly and so like leave",
            "start": 2735.33
        },
        {
            "text": "you could you could let Voldemort get like a little bit violent you know if you're gonna bring any character in from Harry Potter it would have to be the villain right yeah exactly and so like leave Baltimore get in there live a little more like tear people apart let Voldemort say [ __ ] you know let Volta more live that's what I would like to see Story number four I know this is our last news story for the day gameplay footage for a canceled Prince of Persia game has been on YouTube for years and nobody noticed until now Kevin I have the video for you here and we might be like risking risking it all if we boy if we want to play this video in the background but you know it might be worth it because this is very interesting on here castle Persia game yeah so there's a cancelled Prince of Persia game the had gameplay Tosk uploads to youtube eight years ago and nobody noticed okay I'm going I'm pulling this from Daniel Ahmad on Twitter because that's where I first saw this and I think he",
            "start": 2778.02
        },
        {
            "text": "game the had gameplay Tosk uploads to youtube eight years ago and nobody noticed okay I'm going I'm pulling this from Daniel Ahmad on Twitter because that's where I first saw this and I think he might be the one that serviced it but yeah he tweeted this morning so apparently there has been a video for from a canceled Prince of Persia game up on YouTube for eight years and nobody knows still today looks cool tbh and it's called Prince of Persia redemption and then Jonathan Cooper who's a game animator responded to Daniel's saying wow person is amazing work from animation director Kai nian for from the FIR honor from I guess he's from the fur on her team amazing work from him and team this target game footage pre-rendered game game pitch inspired our own pitch for Assassin's Creed 3 as they did such a great job making it look like real gameplay so what we're looking at here is pre-rendered gameplay footage for a canceled Prince of Persia game I know ages and just nobody noticed this is",
            "start": 2821.52
        },
        {
            "text": "did such a great job making it look like real gameplay so what we're looking at here is pre-rendered gameplay footage for a canceled Prince of Persia game I know ages and just nobody noticed this is up for eight years and I went to it and only had like a thousand in something views and that was like after it was posted so why is it suddenly popping off now like just like what happened I think somebody just found it it was like hey this looks like Prince of Persia and then realize what it was and I think it's posted on Twitter too it's like a fun a fun tidbit for for you all this is a canceled Prince of Persia game I just never never came out I mean I know now that now that we're thinking we actually had Jordan Mechner the creator of Prince of Persia on the show on Monday and I asked him like what he's up to and he's working you know obviously I'm not in a position to say anything but I wouldn't be at all surprised if more Prince of Persia games were in the works cuz it is a big",
            "start": 2863.88
        },
        {
            "text": "him like what he's up to and he's working you know obviously I'm not in a position to say anything but I wouldn't be at all surprised if more Prince of Persia games were in the works cuz it is a big franchise and I was a big fan I don't know if you if you played sands of time when Prince of Persia first made its big comeback but it was fantastic was a really great game and the whole thing were like the dagger being able to reverse time it was a really clever gameplay mechanic and it was one of the first games to kind of introduce wall-running but you know we see more running in every game now yeah it was it was very pioneering in the same way that the first Prince of Persia was and it's super cool and now that I'm thinking about it a Prince of Persia style a Prince of Persia game in an assassin's creed style like open-world that would be fantastic I would love that yeah and looking at this gameplay footage like I what they were going for right yeah Anna looks right like the style of",
            "start": 2909.27
        },
        {
            "text": "creed style like open-world that would be fantastic I would love that yeah and looking at this gameplay footage like I what they were going for right yeah Anna looks right like the style of it the the what it would look like today yeah and so there you go a cancel Prince of Persia game that just fit on YouTube just chilling there I am Gary I'm very excited to see what the erasure of Prince Persia might be but that future is so far away if I want to know what's coming to mama grab shops today weird I look the official list of upcoming software on each and every platform as listed by the kind of funny games Daily Show hosts each and every weekday yeah you pretty much nailed it you pretty much nailed it you said I mean I'm a hundred but I'm completely off I could I could easily cheat in this format in this at-home format and have it written down for me here but I don't I'm completely off book now I mean you only miss one word like you you change you what was the word I married across",
            "start": 2951.3
        },
        {
            "text": "format in this at-home format and have it written down for me here but I don't I'm completely off book now I mean you only miss one word like you you change you what was the word I married across like you said on so the official yeah I'm definitely definitely giving it to you but like that's like a 99% you know you still getting I appreciate that I used to I used to not be able to do it at all I'm getting there okay you're getting there out today we got zombies ruin my day for Xbox one Task Force campus for a ps4 Xbox one and switch ping redux for ps4 booze balloons for PC snack clearing for PC and new Yankee eight journey of Odysseus for PC four new dates we have Dragonball Fighters ultra instinct Goku is coming May 22nd ghost runner has a demo that's available from May 6 to May 13th on Steam Mortal Kombat 11 aftermath expansion is launching on May 26 Chu who juju tie it is coming to steam on May 22nd today 2k reveal the teaser trailer for PGA Tour 2k 21 yes Thomas to deliver a full",
            "start": 3003.05
        },
        {
            "text": "Steam Mortal Kombat 11 aftermath expansion is launching on May 26 Chu who juju tie it is coming to steam on May 22nd today 2k reveal the teaser trailer for PGA Tour 2k 21 yes Thomas to deliver a full announcement next Thursday May yes I tweeted about it earlier today I love love golf games like the proper PGA Tour simulator like the old Thai used to love the Tiger Woods games I'm so excited about this I am all-in on PGA 2k 21 is pg8 2k my PGA Tour 2k is that a new things that not actually heard that yeah because he's because yeah because EA had to license for the longest time I think they've ever was Tiger Woods his career nosedived because of all the trouble in his personal life EA switched the license over to rory mcelroy and it kind of went off the boiler a little bit and I think they just lost interest because it looks like they've they've not react the license now to K has it I'm actually really super excited to see what 2k does with the PGA Tour I loved all the games I'm",
            "start": 3051.11
        },
        {
            "text": "they just lost interest because it looks like they've they've not react the license now to K has it I'm actually really super excited to see what 2k does with the PGA Tour I loved all the games I'm definitely gonna be playing that online with friends 100% of all in on that game now are you are you awesome Mario Golf prison yes I would love you know if you asked me right now if I could wave a magic wand and put any any new game on switch either a fully blown out switched version of mario golf or Strykers I would probably go with strikers but it would be closer I would love to see Mario golf come back and I get I mean I personally prefer like you know hot shots go off and that kind of stuff those can be fun but I this is actually an area or I like like full simulation I want like the real PGA Tour characters I want to play Pebble Beach I want to play you know the Masters I want to play or Guster and that that's what I want and I love those I think it was Tiger Woods on for that I was so",
            "start": 3103.67
        },
        {
            "text": "Tour characters I want to play Pebble Beach I want to play you know the Masters I want to play or Guster and that that's what I want and I love those I think it was Tiger Woods on for that I was so hardcore into that like I played that game to death and I got really really good at it and I'm very excited about 2k bringing a fresh approach to PGA golf games it's gonna be in the next Indian next-gen it's gonna look for now it's gonna look like watching golf on TV I can't wait coming soon a game to Xbox game pass a daisy and Red Dead Redemption 2 are coming on May 7th Final Fantasy 9 is coming to game pass on May 14th and fractured Minds it's coming to game pass on May 19th now it's time for reader mail you can write into patreon.com slash kind of funny games where you can get the show ad free and speaking of ads this episode of kind of funny games daily is brought to you by manscaped flowers are blooming the grass is growing and it's time to mow your lawn thanks to our sponsor manscaped",
            "start": 3149.03
        },
        {
            "text": "and speaking of ads this episode of kind of funny games daily is brought to you by manscaped flowers are blooming the grass is growing and it's time to mow your lawn thanks to our sponsor manscaped you can trim the hedges below the belt safely and efficiently I am talking about ball trimmers may escape is here to make sure your balls are smooth and smelling nice after all it's time for spring cleaning and let me tell you I love to use manscaped I use it periodically and it keeps me fresh it keeps me keeps it visible because it has a light and so while I'm shaving I'm not making any mistakes because that man escaped 2.0 3.0 keeps things pristine man escaped is the only men's brand dedicated to below the belt grooming they have forever changed the grooming game with their perfect package 3.0 precision engineered tools for your family jewels the perfect package 3.0 kit comes with the essential lawn mower 3.0 water proof cordless body trimmer and a ton of other liquid formulations to",
            "start": 3199.22
        },
        {
            "text": "3.0 precision engineered tools for your family jewels the perfect package 3.0 kit comes with the essential lawn mower 3.0 water proof cordless body trimmer and a ton of other liquid formulations to round out your manscaping routine this third-generation trimmer features a cutting-edge ceramic blade to prevent manscaping accidents millions of balls are about to be Nick free thanks to man escapes advanced skin safe technology inside the perfect package you'll also find the manscaped crop preserver an anti chafing ball deodorant and moisturizer it's starting to get hot outside and this is crucial crucial so your balls stop sticking to your leg and as our treat you'll find the crop Reviver which which will keep your ball smelling fresh just like spring flowers subscribe to get the perfect package and get a new replacement blade refill for your lawn mower trimmer delivered to your door every three months making sure your trimmer always stays hygienic and clean for a limited time",
            "start": 3242.06
        },
        {
            "text": "package and get a new replacement blade refill for your lawn mower trimmer delivered to your door every three months making sure your trimmer always stays hygienic and clean for a limited time subscribers get two free gifts the shed travel bag that's a $39 value add and the patented high performance anti chafing manscaped boxer briefs this is the perfect package for your perfect package a 20% plus free shipping with the code games 20 at me escape calm a dear self a favor and always use the right tools for the job again 20% off and free shipping with the code games 20 at manscape calm 20% off with free shipping basically calm game swanee it's spring cleaning baby and your balls well thank you Omni odd Fredman writes in to patreon.com slash kind of funny games and says Naughty Dog released a Last of Us 2 story trailer today I'm trying to resist watching the trailer since at this point obviously I'm in and would rather go in blind but it got me wondering should Naughty Dog have released",
            "start": 3285.14
        },
        {
            "text": "a Last of Us 2 story trailer today I'm trying to resist watching the trailer since at this point obviously I'm in and would rather go in blind but it got me wondering should Naughty Dog have released the trailer at all I'm sure the comments will be a minefield of spoilers would it be best for them to go low profile until launch because of the spoiler threat to their consumers or is it business as usual and they have to market their game no matter no matter the risk of internet trolls would love your opinion thanks imean so for the last was - trailer Gary do you think do you think it's worth it for an eye doctor release it given the spoilers and all the trolls and stuff I mean I'm not I'm not a marketing expert so I I don't feel like I can speak to it or thorat a tively it's a it's a it's a tricky situation because on the one hand you know they want to get the word out about the game as much as possible of course they do you know you do advertising you do trailers you do publish for",
            "start": 3335.15
        },
        {
            "text": "a tricky situation because on the one hand you know they want to get the word out about the game as much as possible of course they do you know you do advertising you do trailers you do publish for publicity you do media but the last of us who's also a game that maybe doesn't need a ton of help right if you're gonna if you can't afford to scale back the traditional marketing efforts on any game it's probably this one like everyone and anyone who's into games knows that the Last of Us was a massive massive and brilliant game and it's gonna be a big sequel coming up so its current it's constantly in the news all the time they maybe don't need to do a trailer they probably feel like they need to check all the boxes anyway I'll simply say this in the context of the leak I'm sure you've covered that on the show already it's been big big news it made me really angry and it made me feel terrible for Neil and everyone at Naughty Dog the hundreds of people that have like put their blood sweat",
            "start": 3379.43
        },
        {
            "text": "that on the show already it's been big big news it made me really angry and it made me feel terrible for Neil and everyone at Naughty Dog the hundreds of people that have like put their blood sweat and tears into this game for years and crafting a story that people are gonna find interesting and compelling and surprising and some [ __ ] I don't know who it is tax into their server and leaks it what just to be a [ __ ] like I don't I don't get it I really don't get it it makes me very angry I would hate to have been in that position whoever whoever is responsible for that leak should be and they won't be because they clearly have no shame they should be ashamed of themselves it's disgusting I'm disgusted by it to ruin the fun of so many people who are going to accidentally see those spoilers and to and to break the hearts of Neil and the people that works so hard on that game to deliver something that will be amazing and and someone just goes out there and just shits all over it with",
            "start": 3420.14
        },
        {
            "text": "and to and to break the hearts of Neil and the people that works so hard on that game to deliver something that will be amazing and and someone just goes out there and just shits all over it with this you know it's like it's like walking past a movie like these are the same [ __ ] who like we're walking past the you know the people that were lining up to buy the latest Harry Potter book and just like literally shouting spoilers out the window as they drove by in their car go [ __ ] yourself I can't stand people like I'm sorry I'm really trying to get angry but like it really really makes me angry when people go out let the only that they who are these people who is so [ __ ] sad and a devoid of such an inner life of their own that the only way they could derive any pleasure any joy is by taking it away from other people [ __ ] off I'm done yeah I mean I agree with literally every single thing you just said Gary and in terms of do they change their their marketing push for last part to",
            "start": 3466.25
        },
        {
            "text": "it away from other people [ __ ] off I'm done yeah I mean I agree with literally every single thing you just said Gary and in terms of do they change their their marketing push for last part to you do they change putting on a trailer any of that stuff I don't I I think that kind of comes back to like you don't let the terrorists win like just go like just just go about the marketing push as you were going to either way because like when it comes down to people spoiling things in the comments if you really want to just turn the comments off right as Naughty Dog on YouTube channel like there's an option for uploaders to disable comments and I don't know if they did that or not for the trailer I didn't scroll down the comments for obvious reasons but yeah I imagine you just you just disable those so that that doesn't become a problem but yeah I think for last was also like when it comes to them putting on a trailer or not I'm of the mind that they like for the trailer that came out today",
            "start": 3508.39
        },
        {
            "text": "so that that doesn't become a problem but yeah I think for last was also like when it comes to them putting on a trailer or not I'm of the mind that they like for the trailer that came out today I don't really even think they needed to put it out I think it's it's a nice treat for people who want that right for people who are kind of thirsting for last list but so what you said Gary like people are aware of last list people are gonna buy this game either way people are excited for it I don't think you I don't think there really needs to be any more build-up in terms of our excitement for life I mean in terms of like the marketing effort they don't kneel in the last of us is gonna be a mega selling gay if you could live in two parallel universes where they don't release trailers and they do release trailers the sales of the game are gonna be roughly the same like it's not gonna make that much of a difference I think they're doing it because they know that the fans are craving things",
            "start": 3549.37
        },
        {
            "text": "do release trailers the sales of the game are gonna be roughly the same like it's not gonna make that much of a difference I think they're doing it because they know that the fans are craving things and they want to give them little little teasers you know they want it they want to get them excited about the game not from a point of view like we need to maximize our sales but just to give the audience the things that they're excited about nothing wrong with that yeah and I think you still you celebrate the game the same way you have that that same push the same way and you don't let the hackers and leakers win right like you right go about your business and you kind of just say [ __ ] them and hey let's we're still gonna go about living our life and having a fun time and in releasing our trailer because we want to release it I'm but yeah like I'll see this again you know stay to protect yourself when it comes to scrolling down the karmis I mean you can mute hashtags on Twitter and",
            "start": 3586.45
        },
        {
            "text": "trailer because we want to release it I'm but yeah like I'll see this again you know stay to protect yourself when it comes to scrolling down the karmis I mean you can mute hashtags on Twitter and things like that but like you get to a point with these with these [ __ ] like it's one thing that they turn off the comments off on the in The Last of Us you know preview page the YouTube page where the trailer is is is is or whatever but then you get people who were like we'll jump into threads and and comments are like nothing to do with it like you know you'll be in a youtube comment thread about something like you know it's sports or something and someone will be in there gonna win Last of Us - this thing happens I think just trying to get you yes it's awful and I hate these people I hate them there are no words in the English language to describe me utter contempt and frankly pity for people that do things like that because like because I pity them more than more than I love them I",
            "start": 3625.54
        },
        {
            "text": "them there are no words in the English language to describe me utter contempt and frankly pity for people that do things like that because like because I pity them more than more than I love them I really do you're only engaging that kind of behavior if you're deeply deeply unhappy in your in your life and you can't get up to the point that here's what you need to do people want to feel that everyone does it's only human you want to feel like you are as happy as everyone else right if you're down here and you don't know how to come up because you're because you're so sad the only way to occur to achieve equal equilibrium is to bring other people down to your level by making them sad and it's pathetic and pitiful and I just hate it and I wish there are a solution I don't know what else you can do [ __ ] em [ __ ] em that's it I've slightly [ __ ] him now it's time to squad up Chris Q writes in with an interesting squad up and says a bit of a different squad up may is Asian Pacific",
            "start": 3667.3
        },
        {
            "text": "you can do [ __ ] em [ __ ] em that's it I've slightly [ __ ] him now it's time to squad up Chris Q writes in with an interesting squad up and says a bit of a different squad up may is Asian Pacific Islander Heritage Month and inspired by the number one videogames journalist Andy Cortes I wanted to create a shirt and donate to charity at the same time the design is inspired and also Kevin if you could go down to the dock where the squad up is and open up the link and show it that'd be cool I should have said that before but to continue right I wanted to create a shirt and donate to charity at the same time the design is inspired by the idea that children of immigrants are Americans but also something else separated by a - the colors and letters should be familiar to fans of PlayStation all proceeds 100% go to feeding America I don't I don't suggest I don't see a penny from any sales I just want to try and rally the kind of funny community to help feed families in need the link if you",
            "start": 3710.32
        },
        {
            "text": "proceeds 100% go to feeding America I don't I don't suggest I don't see a penny from any sales I just want to try and rally the kind of funny community to help feed families in need the link if you want to buy Chris Hughes shirt is teespring comm / - - American and yeah that's like a cool PlayStation themed shirt right there all priest proceeds go defeating America thanks for that right in Chris Q and thanks Kevin for assists on that now it's time for Connor flank calm / you're wrong where you write us write in and let us know what we got wrong as we got it wrong uh what did we get wrong how'd we do this week blessing Nayla ball just says to clarify Gary means Adam Nickerson of dingdong Excel yes sorry I just he's just a dirty Adam Nickerson the creator of dingdong Excel and bit Blaster Excel and the new missile command recharged that he did for Atari is is my band leader in sidekick on animal talking and he's also been a tremendous tremendous tremendous help behind the scenes and I",
            "start": 3754.9
        },
        {
            "text": "Excel and the new missile command recharged that he did for Atari is is my band leader in sidekick on animal talking and he's also been a tremendous tremendous tremendous help behind the scenes and I give him a lot of [ __ ] on the show and to his face but from the bottom of my heart Adam thank you you've been an invaluable part of the success of the show and we wouldn't be able to do it without you and then groovy music Ely we'll be doing a surprise game reveal on May 12th as part of summer game fest and then cabal's writes in with some additional details on Prince of Persia from the video we watched earlier the target its target game footage pre-rendered game pitch that was created around 2010 to 2011 I was planned to be a ps3 slash 360 game I was canceled obviously and was also the inspiration for this asin's Creed 3 team so not much we didn't actually get much wrong it was we did okay this way it wasn't really just us bloviating you know with their opinions yeah for though for",
            "start": 3807.67
        },
        {
            "text": "inspiration for this asin's Creed 3 team so not much we didn't actually get much wrong it was we did okay this way it wasn't really just us bloviating you know with their opinions yeah for though for sure for sure and people loved it Gary oh they can't get enough of it tomorrow's hosts for the show are me and Tim so get ready for that remember we're reacting to we're acting live to this week's inside Xbox as they show off games for next gen that's happening tomorrow 8:00 a.m. Pacific right here on twitch.tv yeah how to fight obviously won't be watching it but like if Jeff keel like [ __ ] up or embarrasses himself let me know cuz I want to hear all about that oh for sure I don't think Jeff you is gonna be there honestly I think it's just to be the Xbox thing and I think they might like referee working fest but well yeah we will see and of course it's gonna be me Greg Tim and snow act Mike I believe and so get some snow back Mike hype going of course this has been kind of funny games",
            "start": 3861.94
        },
        {
            "text": "working fest but well yeah we will see and of course it's gonna be me Greg Tim and snow act Mike I believe and so get some snow back Mike hype going of course this has been kind of funny games daily each and weekly I live right here on twitch.tv slash cataphrenic games we run you through the nerdy news you need to know about we have a patreon post show for those that are sub dat the silver level of patreon.com such confident games so stick around for that otherwise until next time gamedaily",
            "start": 3907.3
        }
    ]
}