{
    "id": 5019,
    "video_id": "Yqp3qU80fLY",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Maxwell Boughton"
    ],
    "title": "Grandma Miller and the Sickly Raccoon - Best Kinda Funny Moments Animated",
    "description": "Animated by Maxwell Boughton. \nIntro by Cameron Kennedy. \n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1 \n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny \n\nCheck out our store! http://www.kindafunny.com/store \n\nFollow us on Twitter! \nGreg - http://www.twitter.com/GameOverGreggy \nTim - http://www.twitter.com/TimGettys \nNick - http://www.twitter.com/Nick_Scarpino \nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1588597221,
    "duration": 170,
    "transcript_chunks": [
        {
            "text": "grama Miller and thus a clear a [ __ ] now this is 1989 it is a hot and sticky summer in Chicago and they say I'm an unincorporated going on which is where I was raised and we're hanging out partying here on a corporate Glen Ellyn the kids now and I'll tell you what Tim yeah I'm safe I'm lying I'm dying I look over at this deep ditch and what do I see this so when you're a kid you say record I've been a dying raccoon crawl out of a ditch it's raccoons aren't supposed to be out in the daytime number one tip that something's wrong start a chart raccoon in the daytime bad news around drunk double bad news okay so we go rap on the door gram really this was your time to go to a very slowly to the door yeah Miller's house so why don't you just go in when you win knocked on your grandma's door yeah it's his walkie she was right there attention understand a relationship you had with your grandma so she does the normal thing calls DuPage County Animal Control there's a [ __ ] up raccoon in the",
            "start": 0.0
        },
        {
            "text": "it's his walkie she was right there attention understand a relationship you had with your grandma so she does the normal thing calls DuPage County Animal Control there's a [ __ ] up raccoon in the neighborhood there are children out here send help and I [ __ ] you not Tim if I'm lying I'm dying the [ __ ] DuPage County Animal Control circa 1989 says to gramma Miller an 88 year old woman we can't come put a box over it it's like I'm worried about an attack in the dumb kids but it's hacking grandma grandma can't you this thing comes at all right so she gets a box she gets a broom and she goes out there and Tim if I'm lyin I'm dyin walks up drops the Box on the raccoon get the rock and they like I don't even know they scoop it up but then they you know there's the problem my problem is why couldn't they accomplish this seemed like something where we needed an adult quicker with a broom and a box [Applause]",
            "start": 72.33
        }
    ]
}