{
    "id": 1951,
    "video_id": "ia2DI3WTTpo",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Zacq Wenzel"
    ],
    "title": "Colin Moriarty for President - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel\nFrom this video: Colin and Greg Live 02.12.2016",
    "published_at": 1469808003,
    "duration": 100,
    "transcript_chunks": [
        {
            "text": "I had to I had to turn the debate off though like after like an hour like I can't take this anymore I just I can't and really if I was constitutionally allowed to run which I'm not yet I would just run and I would win but it's just not it's not time yet maybe next time I'm I'm excited for that time when the time comes May next time you'll be my foreign policy advisor sure what do you think we should do uh what do you think we should do in Eastern Europe as a a NATO buffer you know against Russia what do you think what do you think about that you know what if Russia rolls into let's say Poland yeah um and Poland um activates Article Five sure what what do we do then here's the thing Colin are you aware there's people homeless in the United States people who can't feed themselves in the United States people who can't pay their rent in the United States I don't give a flying what's happening in Poland we got to fix the American economy thank you minorities are good no more 911s now let's",
            "start": 0.76
        },
        {
            "text": "States people who can't pay their rent in the United States I don't give a flying what's happening in Poland we got to fix the American economy thank you minorities are good no more 911s now let's be real I would win I think we all know that Mise is going to make America great again and so we're going to really establish that Greg's gonna be my foreign policy adviser Portillo is going to be the secretary of the Department of energy and that's the big thing if Poland wants my help where was Poland when Katrina hit thank you I'm going to do that then we're going to move people out of New Orleans you're dumb to live there sounds very expensive we'll make Mexico pay for it I assume we're annexing them pretty quick once we get in yeah but you know who knows what who knows what the future might hold sure why not me I mean every every have you ever asked yourself that why not Colin Moriarty for president",
            "start": 37.44
        }
    ]
}