{
    "id": 1946,
    "video_id": "lx-IuQqnSkw",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Games We Are Really Bad At - Kinda Funny Gamescast Ep. 78 (Pt. 3)",
    "description": "We are pretty bad at some games.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1469624404,
    "duration": 1193,
    "transcript_chunks": [
        {
            "text": "We are pretty bad at some games. \n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\n\nTim - http://www.twitter.com/TimGettys\n\nGreg - http://www.twitter.com/GameOverGreggy\n\nColin - http://www.twitter.com/NoTaxation\n\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\ntopic three Joe Andis asks hey guys I've always found that while I'm really good at some genres of games there's some that I just can't do what games are you bad at fighting games I hate fighting games I don't enjoy fighting games I don't enjoy the way they move play I don't enjoy combos and I tried for a long time Mortal Kombat we were all over that as a bunch of kids doing fatalities doing cool stuff Justice League Task Force why not yeah I shouldn't care about why not this should be something I'm good at and I even like when you talk about like the Acclaim wrestling games which aren't fighting games per se but they the combo based moves rather than just strong grapple weak grapple like you know the AKA folks were doing uh it just never ever clicks to the point I just even like when you know like oh I want to play in Justice and I want to see that story through because I already like the comics so much or when I yeah I think I might have reviewed DC vs Mortal Kombat",
            "start": 0.31
        },
        {
            "text": "when you know like oh I want to play Injustice and I want to see that story through because I already like the comics so much or when I yeah I think I **** I might have reviewed DC vs Mortal Kombat or Mortal Kombat vs DC uh just getting in there and how stiff Everything feels and how hard it is to get my character over there the way I want them to go over there because you're doing that thing where you're just doing like the the little hops like God **** no just move God damn it what the hell's going on and it's one of those that I now I mean yeah I don't try you know what I mean like when I play Injustice what I would do is go through and play and then when I'd get beat then I would just put the controller down and let it let it beat me twice more cuz then when you do it they just **** take it they just take it and the story mode so you can get through them cuz I just want to see the cut scenes I don't want to do any of this crap I don't want have anything to do with",
            "start": 50.64
        },
        {
            "text": "just take it they just take it and they story mode so you can get through them cuz I just want to see the cut scenes I don't want to do any of this crap I don't want have anything to do with this but dialing back to like when we did play Mortal Kombat and when we were playing you know games like that in Mike Bo's basement on Genesis or whatever it's like I was playing and I was trying and I was still just not having a good time and not and nothing clicks it doesn't click for me that that franchise doesn't work or that genre doesn't work for me in terms of how it should all come together to make an enjoyable experience yeah I'm not good at them either I do enjoy them a lot though and I like the I like playing to to my capabilities you know and watching Evo did did you guys watch Evo at all I didn't watch it this year but a guy from Long Island murdered so that's the only I was it was insane this year I mean it's always insane but just seen the spectacle of Evo itself it's just",
            "start": 87.76
        },
        {
            "text": "at all I didn't watch it this year but a guy from Long Island murdered so that's the only i was it was insane this year i mean it's always insane but just seen the spectacle of Evo itself it's just like good Lord their set was you see the set at all you see any pictures my God it's just like a giant cube of just destruction and awesomeness and I I I just enjoy it because it's like you know we've seen kind of like the League of Legends and all the mobas and stuff and like the the kind of sets and extravagance they have um but to see it for just fighting it and seeing them the crowd go crazy when they roll out CRT TVs to play melee on that's **** awesome U but yeah I've never been never been too good at them either like Street Fighter I I like to play but I'm not great at it I'm not even good at it I'd say uh Marvel versus Capcom um i think is is one that to me is a bit more fun I can't play it on the technical level of like Mark Whalberg or someone um those **** just dominate but uh yeah",
            "start": 120.6
        },
        {
            "text": "good at it I'd say uh Marvel vs Capcom um I think is is one that to me is a bit more fun I can't play it on the technical level of like Greg or someone um those pros just dominate but uh yeah I also can't just wrap my head around it cuz like it is the not so much stiff movement but it's like uh movement that is very designed where like every single thing you're doing has a purpose and uh the balance of everything is all completely thought out and it's just like I don't have the brain capacity to ride my head around it sure uh I'm I'm inherently talentless at adventure games and puzzle games and for like you know I I I was talking about this with someone recently that I have a knack for side scrollers like I I understand exactly how to play most of these games and like understand how they feel and can really like run over these games pretty easily once I play spend enough time with them and I'm the exact opposite with with puzzle games and adventure games like I just get lost",
            "start": 158.6
        },
        {
            "text": "how they feel and can really like run over these games pretty easily once I play spend enough time with them and I'm the exact opposite with puzzle games and adventure games like I just don't find that fun right like so we've experimented a few times with you know these games you know Grim Fandango and stuff and I'm like this game like I I don't want to say it sucks for me the game sucks like I'm just like I don't I know it's a beloved game I'm not trying to insult it but it's like why is this fun I have to like talk to these people find this obtuse thing to do this other obtuse thing and run around with mic this is awful I just so adventure games aren't necessarily hard they're just obnoxious you know in that sense and you mean old school ones too I feel like nowadays things are a little easier now well cuz Telltale Games are adventure games but they're they're not really adventure games in the",
            "start": 205.36
        },
        {
            "text": "and you mean old school ones too, I feel like nowadays things are little easier now well cuz Telltale Games are adventure games but they're they're not they're not really adventure games in the classic sense um I mean well that's what they are I mean what other genre are they you know like that's that's exactly what they are but it's just that there's no they just go they just continue to go I mean it's like Quantic Dream games or adventure games but they don't stop you don't die like so it's like I so that's like where I Can You Know Until Dawn for instance is an adventure game and it's like that's that's you can't lose you know so like those are fine or you can't get stuck really right the only old school one I ever enjoyed was Full Throttle and that was just going play that I know I'm looking forward to but even when they brought Broken Age out and were like it's more of a call back to the old adventure games I sat down and played episode one and I beat it I was just like no",
            "start": 244.36
        },
        {
            "text": "I'm looking forward to, but even when they brought Broken Age out and were like it's more of a call back to the old adventure games. I sat down and played episode one and I beat it; I was just like no, sorry, I'm not doing episode two - it's just I can't do this. I couldn't do this. The other side of this point for me is puzzle games, and that's where I'm actually really bad at them. So, like when when like I just don't don't see the fun in annoying the **** out of myself in these games. So I remember when Portal came out - um, in The Orange Box, that was like what fall 2007 - um, I was people playing; I'm like this is like like awful, like I I like and I'm like and I'm like and everyone's like this is this this game's so fun. I'm like no, I get it, like I I know you love it; I'm like I can't I can't like I'm like you know like I just I played it for like a half an hour before I got stuck and I'm like I don't and like it's not that hard like I just I don't this is so",
            "start": 275.96
        },
        {
            "text": "it I'm like I can't I can't like I'm like you know like I just I played it for like a half an hour before I got stuck and I'm like I don't and like it's not that hard like I just I don't this is so annoying you know like and that's um so that's why you don't like Limbo right well Limbo I think is fine but Limbo's not that hard either it's just like I don't I like games where it's like the the challenge is mechanical right like um not like you know like look around the environment and find the rock that you have to pick up to put on this switch to make this thing disappear and then it's like I'm like I don't like I don't know man like like I just like I don't want I don't like I if I want to like think like really think deeply I'll read a book you know like I don't want to like that's not why I play games so like I love games that like like Castlevania, Mega Man, and Ninja Gaiden like we were talking about earlier that are like those games are hard mechanically those are mechanically hard",
            "start": 316.28
        },
        {
            "text": "why I play games so like I love games that like like Castlevania, Mega Man, and ninja guy like we were talking about earlier that are like those games are hard mechanically, those are mechanically hard games and you feel good when you figure out the mechanics of them. And I understand completely people wanting to be like well it's the same kind of feeling the same kind of rush at the end of a level where you're you know you figure it out or whatever. That's why when The Witness came out, I was like no way in hell I was like there's no way in hell I'm playing this game not because I don't believe it's good but because my brain doesn't it doesn't work with the game. It reminds me of the Adventures of Lolo Trilogy on NES which is like a beloved um puzzle game on the NES and I remember playing being like this is It's So satisfying when you when you're when you finish a stage, but is it worth the obnoxiousness that I feel in my heart right now you know when I could be playing when I could",
            "start": 358.0
        },
        {
            "text": "being like this is It's So satisfying when you when you're when you finish a stage but is it worth the obnoxiousness that I feel in my heart right now you know when I could be playing when I could just be playing something else entirely that's the worst when you play one of these games and you run to that point and there's not an enemy to beat but you are an empty room and you're backtracking all around and you look at the clock you're like I've done it's been 30 to 45 minutes of this I could have been playing anything else and making progress and getting closer to finishing something and feeling I accomplish something right and I and I'm not saying that there aren't exceptions to the rule I think a great exception to the rule are the is Hitman Go which I think is really fun and that is a puzzle game but like it's turn-based and a little more easy for my mind to wrap around I just I just never vibed with those kinds of games I think a lot of it has to do with the fact that I grew up",
            "start": 395.28
        },
        {
            "text": "a puzzle game but like it's turn-based and a little more easy for my mind to wrap around I just I just never vibed with those kinds of games I think a lot of it has to do with the fact that I grew up with consoles I had PCS but I grew I we didn't play games on them really and I I grew up with consoles and we didn't we had you know Maniac Mansion and all these kinds of games but it it wasn't it wasn't the same like those are the kinds of games that I grew up with what about things like Tetris like that type of oh well that's different I mean Tetris isn't Tetris is puzzle is like how can you fit the lines over and over like that's easy to understand what I'm talking about like the game plays itself what I'm talking about is here's a world and like so like when everyone's like The Witness is great I'm like I just don't believe you you know and and and so and so that's crazy like Portal to me like **** guy I don't I don't people some people that's some people's favorite game",
            "start": 428.12
        },
        {
            "text": "witness is great I'm like I just don't believe you you know and and and so and so that's crazy like Portal to me like **** guy I don't I don't people some people that's some people's favorite game and and I and I respect that I remember when Portal 2 came out I'm like no like people like you want to play Portal 2 I'm like there's no prayer I'm playing Portal 2 I have I have like post-traumatic stress disorder from Portal 1 you know so it's just but the so the thing that gets me I was talking about about both of you about this earlier is what gets me is that I I take a lot of pride in being good at mechanically driven games as I said earlier like I I that's how I play games that's what I like and so Downwell which I've been playing on Vita is one of these anomalies where I'm like I I I don't know that I spent that much time with it the Downwell's over pretty quickly I probably spent fewer than five hours with it in total because it just moves quickly but it's one of those games",
            "start": 462.68
        },
        {
            "text": "I don't know that I spent that much time with it, the Downwell over pretty quickly. I probably spent fewer than five hours with it in total because it just moves quickly. But it's one of those games where I'm like, \"I just why am I not getting any better at this?\" Like, I play it, I play it, I play it - I'm like, \"I'm just not any good at it.\" Then I called up on YouTube a high-level speedrun of the game and I'm like, \"Oh, you know, like the boots aren't really a weapon. You know, like the boot... Last Resort, you have to land on everybody and kill right?\" The boots are used like, \"You're you're do you know anything about Downwell?\" So, Downwell people should check it out because it's really cool. It's a very mysterious Japanese indie game available on PC; it's on PS4, and I don't know if it's that it's available anywhere else. Um, where you're falling down a well - hence the name - and there are enemies, and you have these gun boots that have different powers or whatever, and the gun boots can damage enemies.",
            "start": 499.84
        },
        {
            "text": "anywhere else um where you're falling down a well hence the name and there are enemies and you have these gun boots that have different powers or whatever and the gun boots can damage enemies and get through blocks and you're bouncing off enemies heads trying to build Combos and get lower and lower into the into the um into the well and it's all about combos but it's it's and it's all about speed but I I was playing I'm like I do I play carefully do I play with some sort of precision I play it with speed and I just couldn't figure it out it's a mobile game yeah it's available on mobile too and uh I I couldn't imagine how you can possibly play on mobile but I believe people do um because it's so tactile in my mind it's only you only play it with the x button in the d-pad that's it and uh what I realized was that no you use the gun boots to like you're so the gun boots have a certain amount of ammo and then when you land the ammo refills and so what I didn't realize was that the ammo",
            "start": 538.44
        },
        {
            "text": "what I realized was that no, you use the gun boots to like, you're so the gun boots have a certain amount of ammo, and then when you land, the ammo refills. And so what I didn't realize was that the ammo was refilling when I was bouncing off enemies' heads. So you use the gun boots to stay off the ground and land another enemy, and then the boots, and then you build up these like ridiculous combos and build up scores and all that kind of stuff. But even after I understood it and started playing, I'm like, I'm only marginally better at it now. You know, it's one of those games where I'm like, \"I'm a hardcore gamer, but I'm actually almost terrible at this.\" It's almost like the anti-pride – like, I'm ashamed it was my last flight where it finally clicked: don't shoot everything; bounce off of them. Okay, this is... But even once I figured that out, I'm not any better – I'm getting further into levels, and there are enemies with",
            "start": 580.72
        },
        {
            "text": "everything bounces off of them oh okay this is but even once i figure that out im not any like im not m im getting further into levels and its one of those things where there are enemies like with a white sheen on them and then there are enemies that are hard colored and the hard colored enemies you cant bounce off of you only have to kill them with the boots and then it gets its totally heinous like i i but i like it like theres something about it where that keeps drawing me back because im bad at it mhm as opposed to the as opposed to the adventure games where im like **** this **** like i couldnt care less about any of these games um this downwell game because i should be good at it but im not good at it is hearkening me back every night i pick up my v and play every night for four hours like i i only for literally 10 or 15 minutes im like i play this and im like **** this game and then and then i put it back down you cant stop thinking about i cant like so",
            "start": 616.16
        },
        {
            "text": "night for four hours like I I only for literally 10 or 15 minutes I'm like I play this and I'm like **** this game and then and then I put it back down you can't stop thinking about I can't like so it's funny like so even the games that I probably should by Design be good at I'm not um at least in this particular case so but I find much more pleasure in the games that are like that don't use the brain in the in the thinking man's way but use the brain in the Brute Force like I'm going to figure I'm going to be right I'm going to finesse this Ninja Gaiden which we were talking about in the first segment is a great example of that where that game is so fast and so fluid it's it's Mega Man meets Castlevania and what I mean by that is it's fast it's faster than Mega Man um but it has the Castlevania sub item thing where you're like hitting candles and getting and I'm like it's so fast and so good and when you're good at if like when I watch someone play Ninja Gaiden I judge them",
            "start": 650.0
        },
        {
            "text": "the Castlevania sub-item thing where you're like hitting candles and getting and I'm like it's so fast and so good and when you're good at if like when I watch someone play Ninja Gaiden I judge them completely on how good of a gamer they are, you know, like because that's like one of the litmus tests for me. I understand why people are bad at Mega Man, you know, I understand why people are bad at Castlevania it's very stiff but Ninja Gaiden feels perfect and so you can you can really judge a man or a woman on their gaming acumen by putting him in Ninja Gaiden and seeing how they do, seeing what happens. For me, it's first-person shooters I am so bad at killing things with that my aim is just off for some reason, just does not click whether it's mouse and keyboard or controller I just can't do it now that's why games like Overwatch are so great to me because I don't need to kill people it's all you know random objective based stuff totally into that but for some reason like even back in",
            "start": 686.88
        },
        {
            "text": "do it now, that's why games like Overwatch are so great to me because I don't need to kill people, it's all you know random objective based stuff, totally into that, but for some reason, like even back in the Halo days, Alfred would be out there killing, I'm going go and capture the flag, and I'm all about that, but I just I'm not good at the at shooting things, and not for some reason it's the I can never be comfortable with the sensitivity, whether I boost it up bring it down, it never feels Goldilocks, nothing's perfect, it's never right, and uh yeah it drives me crazy so it's because it's like that is such a a basic thing that I feel like that is kind of the the modern day standard of are you good at games I'm not good at games I know that but uh this is proof of of why not first person shooters I've noticed over time because I think I don't I'm loath to say that I'm good at Shooters because I don't play them competitively I think I'm good when I play against a hard AI or something",
            "start": 726.24
        },
        {
            "text": "I've noticed over time, because I think I don't, I'm loath to say that I'm good at Shooters, because I don't play them competitively. I think I'm good when I play against a hard AI or something like that, but I've noticed that I like to put the sensitivity all the way down almost so like I really have to like move like really move to move the gun and I find that I have a lot more control that way. It's crazy with Alfredo, because he's definitely the best gamer I know overall, um, just regardless of genre, plays well, I mean she does things okay, um, but Alfredo is really good at Fortnite and specifically first-person shooters, but it's funny talking to him because over time he's gotten worse and he's like, \"Dude, like me getting old, my reflexes aren't the same\" and he's like, \"I've had to change my sensitivity over time just because I can't keep up with it.\" I'm like that's crazy that he plays on that level. That that's something that he noticed you know I was better at games when I was 10 than I am now.",
            "start": 768.08
        },
        {
            "text": "over time just because I can't keep up with it I'm like that's crazy that he plays on that level that that's something that he noticed you know I was better at games when I was 10 than I am now 100% like there's no doubt about like I used to murder some of these games like Kid Icarus you know like I used to be awesome at that game that's a hard game yeah and I play it now and I can beat it but I'm like Jesus Christ like I'm like I'm really struggling over here and 10-year-old Colin was running rough shot you think it was cuz you jumped in or because you focused on a game one at a time and took for granted cuz I I remember like you know I'd play a side scroller for Death Stranding or whatever and like I knew where the enemies were entering from what they're going to do where the optimal position go so yeah by the end when you're like wrecking house it was because I knew everywhere that something would be whereas like now getting thrown in",
            "start": 807.32
        },
        {
            "text": "going to do where the optimal position go so yeah by the end when you're like wrecking house it was because I knew everywhere that something would be whereas like now getting thrown in I just like I don't know what the going on I'm getting destroyed it could be yeah I think it's it's like those it reminds me of Mega Man 9 and Mega Man 10 that both had trophies for beating it without getting hit and young khong would have been like fine you know and old con was like I can't do that like like that's too hard like I like even for me that's crazy that's just too much those are some of the rarest trophies you can get and I and I was like I got the trophy for beating it without dying and all that kind I mean that's not a problem but like but I'm like you gotta be and I was watching people do these these like these run throughs of this where I'm like I don't even know how the going out like this is too I don't have time for this anymore but when",
            "start": 845.4
        },
        {
            "text": "people do these these like these run-throughs of this where I'm like I don't even know how the **** you figured some of this **** out like this is too I don't have time for this anymore but when Mega Man 2, Mega Man 3 came out I would've been that without getting hit I would've totally done that for for fun you know but I really do think my skills have atrophied a great deal since I was a kid and it could be because of the focus but I also think it has to do with reflexes and I also think it has to do with just the way we looked at games and The Way We Were obsessed with them and the way we thought about them I I thought about games when I was a kid all the time I played games constantly I just don't play like that anymore and so like I think that I haven't played like that even when I worked at I I didn't for years I didn't play like that I wonder if anyone does like I wonder if kids these days I mean there's the Minecrafts and stuff like that but uh I just when we're looking at",
            "start": 878.92
        },
        {
            "text": "I worked at I I didn't for years I didn't play like that I wonder if anyone does like I wonder if kids these days I mean there's the Minecrafts and stuff like that but uh I just when we're looking at console games I wonder if kids are are playing games uh how we used to or because things are so much more MP3 based where it's like nobody listens to albums anymore now they just listen to a bunch of songs our video G the same way where there's so many out there and when you have the virtual consoles and the PSN and all this stuff it is and uh ps+ which just free games being thrown at you and just like there's so much out there that is it just a lot of demos that they're playing and they're kind of moving on to the next thing probably and I I think you can also I think it's also games are just easier so I think that like you can move on quicker even if you're going to play the games all the way through you're not going to run into too many games that are as hard as those games on that",
            "start": 907.88
        },
        {
            "text": "just easier so I think that like you can move on quicker even if you're going to play the games all the way through you're not going to run into too many games that are as hard as those games on that list from the first segment um at all you know what game comes out today that's as hard as Ninja Gaiden you know like for every Super Meat Boy or something that prides itself on being hard there are a million games where I'm like this is laughably easy and uh so I think there's a con there's that too where people are like they just don't have to spend as much time with it if you could be ninja guy when you were a kid you were a **** G dude you know like yeah good Lord I mean like I definitely could not have done that I remember uh I I uh I used to play those games when I was a kid I was obsessed with that trilogy when I was a kid I love that with the exception of Mega Man Castlevania that was my **** and I remember when it came we were doing the top NES list at at IGN in 2007 or 2008 I",
            "start": 946.76
        },
        {
            "text": "with that trilogy when I was a kid I loved that with the exception of Mega Man and Castlevania, that was my favorite. And I remember when it came out we were doing the top NES list at IGN in 2007 or 2008, I had all the games on my PSP, my modded PSP, and I remember playing Ninja Gaiden and beating it, but I used save states at the end because I'm like \"I don't remember how to do this anymore, I'm not even going to bother.\" And so I think that people had that mentality too. Yeah, I mean looking at the list of NES games, there's very few of these that I actually beat when I was a kid, a lot of them I went back and beat later. But yeah, me beating Zelda when I was little... there's not even a chance in hell of that happening. Mega Man still probably couldn't be beaten by me, I'm sure if I dedicated myself to it I could beat Mega Man hard as you think Mega Man 2 is easy, um Mega Man 2 is legit easy compared to the other ones, yeah Zelda 2... yeah right, I've yet to this day never beat Zelda... love that",
            "start": 979.0
        },
        {
            "text": "myself to it I could be Mega Man hard as you think Mega Man 2 is easy um Mega Man 2 is legit easy compared to the other ones yeah Zelda 2 yeah right I've to this day never beat The Legend of Zelda II: Adventure of Link love that game I can't wait to do a let's play for that game I love it I'm gonna use my own walkthrough too did you beat it yeah when you were young yeah used Nintendo Power or something like that but yeah I be dude you have to understand that like I had a brother that was 11 years older than me I beat I legit beat a lot of these games by watching by watching my by watching my brother and sometimes getting his help but I mean I was legit beating games when I was with when I tell people like I was three four five six seven playing and beating like games it's true you know like I really was because I was just I had a a like a person that was way older than me playing these games and show me how to do it yeah know that's crazy I mean that that's a game changer you know just somebody to help you",
            "start": 1013.0
        },
        {
            "text": "I was just, I had a person that was way older than me playing these games and show me how to do it. Yeah, know that's crazy. I mean, that's a game changer, you know? Just somebody to help you through the random parts you're stuck at, the random parts you don't understand or can't read, dude. I remember playing when Mario 3 came out in '91. I would take my Legos and build airships like that; he was like my own airship or whatever, and you just watch and learn. And then when it's your turn, when he goes to school or he's gone, and you play, then like you have a way better time at it than you should. What's super funny about that is back when DDR came out, I was super into that, and my friend Curran - totally not uh, this is back when he was fat, he was super not into it; he was just like, \"I'm never going to play this,\" and he never played it, and he just watched me play it for about a year. And then randomly one time, first time.",
            "start": 1046.96
        },
        {
            "text": "when he was fat he was super not into it he was just like I'm never going to play this and he never played it and he just watched me play it for about a year and then randomly one time first time he played it and he just **** went straight to hard and was killing it and it's just like I've just watched for so long like I get it I'm like is that how he got skinny then he just played on hard the rest and he just kept going then he got super fit I'm like God damn he used to be so fat right yeah I miss Fatman (he was so much nicer then now he's all mean) he had blue hair like me yeah just like you uh yeah but Metroid get the **** out of here yeah metroids Metroid's legitimately hard yeah it's like just because there's no map and and yeah there's you have to that's those are the days of hand drawing your **** which what people were saying was people were doing The Witness too which I thought was cool with graph paper and stuff but I remember I remember Metroid being like even in the",
            "start": 1085.6
        },
        {
            "text": "drawing your **** which what people were saying was people were doing The Witness too, which I thought was cool with graph paper and stuff. But I remember I remember Metroid being like even in the time we were playing it, I remember being like this game was that game intimidated me when I was a kid. No, I played it, but it was did you beat that uh not till later um I never beat the OG Metroid. I beat Metroid Zero Mission, which was the remake, but it was much much easier yeah no the original Metroid is tough, that's a that's a **** tough game yeah and yeah Kid Icarus is hard yeah Kid Icarus gets heinous Punch-Out! I really don't believe is that hard like like we were talking about it on on Colin and Greg where I'm like I want to beat as many of these games as possible if not all of them on the let's play series that we do with them, and it's like and you ask me I play Punch-Out! I'm like yeah because like there's just there's rules like like if you know how to play it's the same thing with Mega Man",
            "start": 1122.84
        },
        {
            "text": "series that we do with them and it's like and you ask me I play Punch Out I'm like yeah because like there's just there's rules like like if you know how to play it's the same thing with Mega Man like if you just know what everyone's weaknesses is you should have no problem you know and I think that it's the same thing with Punch-Out! like there's some really hard people in Punch-Out! it's no joke some of that stuff but um you just got to like get back into that zone it's not so mechanical it's mechanically based but it's timing based and that's even easier to predict",
            "start": 1161.92
        }
    ]
}