{
    "id": 1887,
    "video_id": "NPtdEo_h-U4",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Crash Team Racing's Bear Successor, Bears Can't Drift!?  - Kinda Funny Plays",
    "description": "Greg and Tim love kart racers, but will they love Bears Can't Drift!? -- a game inspired by Crash Team Racing? Find out!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1467396001,
    "duration": 1815,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to Bear Down Friday on Kinda Funny. That's right. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. We put up the first ever kind of funny doodle under our new banner of us doing them, posting over on youtube.com/kindafunny. It's about 100 bears invading San Francisco. And we thought the best way to complement that was by doing a let's play of Bears Can't Drift. Amen. Now, I got a couple things here, Greg. First off, I already love this game. Why? Just the look, the sound, all of this. It's speaking to me. It's speaking to my childish heart. Second off, I appreciate the exclamation mark before the question mark. Me and you have thought about this many a time. And by that, I mean, there was one time you corrected me and maybe put the question before the exclamation mark. And I was like, no, cuz I'm exclaiming more than I'm questioning. The question is more of like the end part of it. So, every time I've ever written whatever",
            "start": 0.32
        },
        {
            "text": "Before the exclamation mark. And I was like, no, cuz I'm exclaiming more than I'm questioning. The question is more of like the end part of it. So, every time I've ever written whatever the **** a tweet since then, yeah, you do my way. I usually do your way just because I don't want you to be all upset at me. I don't want you to... I'm Greg Miller. Here we are playing Bears Can't Drift. Right now, what's exciting about this is that made primarily by one person, his name's Aaron. He just helped me through on the Skype getting everything set up the way it was. Uh what's interesting about it though and what speaks to you is that it's a game inspired by Crash Team Racing. They say that in their press stuff here. They specifically say Crash Team Racing, not Mario Kart 64, garbage, not Jack and Daxter's Marvelous Card Adventure, Combat X, whatever the **** that was called. Crash Team Racing, aka the best kart racing game of all time. Now, what's interesting about it, and that was",
            "start": 42.72
        },
        {
            "text": "Jack and Daxter's Marvelous Real Action Climax, Combat X, whatever the **** that was called. Crash Team Racing, aka the best kart racing game of all time. Now, what's interesting about it, and that was one of the things I was confused about cuz I was trying to jump into a let's play thinking it would be all menu based. There's no menus in the game. There are no menus. There are no there's no handholding. They say there's no text. The whole thing is you have you look at this and know which kind of course you want. Now I'm going to start you cuz you're a little wuss over on just the normal courses over here. Now just so you know this reminds me a lot of Crash Team Racing. That's how the gameplay is. Yeah. You drive around as you have the world map. Open hub world here. Yeah. I love this game. This is it. This is it. So this is on PlayStation. This is happening. It's coming to PC and it's on Steam Greenlight right now. Really looks like Crash Team right now. It's on Steam Greenlight right now.\n\nCorrected errors:\n- \"Marvelous Card Adventure\" → \"Marvelous Real Action Climax\"\n- \"cart racing game\" → \"kart racing game\"",
            "start": 79.76
        },
        {
            "text": "Is it. This is it. So this is on PlayStation. This is happening. It's coming to PC and it's on PC Greenlight right now. Really looks like Crash Team Racing right now. It's on Steam Greenlight right now. Is this the same way you added people? Cuz I'm going to add you now. Bam. Hold on. There you go. Bam. Now you're in there. You're I I'm going to put in a course. Uh, where do you want to go for? You want to go Arctic? Do you want to go tropical? You want to go fall? Let's go fall. It looks nice in here. Okay. So, first thing I noticed, yeah, we're going modern controls for games. So, the R2. Yeah, you're following me into the hole now. Gotcha. R2 for gas, L2 for reverse. Uh, circle is going to be drift. I don't know how I feel about that. It's how every game should play. Just calm down. Yeah. X to go, square to reverse, shoulder buttons to attack. No, this is a new day. So now what's interesting here, right, is that this is what was throwing me off. I guess since this is all inspired by Crash Team Racing.",
            "start": 118.08
        },
        {
            "text": "X to go, square to reverse, shoulder buttons to attack. No, this is a new day. So now what's interesting here, right, is that this is what was throwing me off. I guess since this is all inspired by Crash Team Racing, you would have known all this. You jump in, you hit square, and it switches out what mode you're going to play. So we're going to do races, which would be red there. Don't jump in yet. I'm sorry. You tried stopping, but you know, it was the square. This is Is this going to be why you're you're I mean, I beat you at Mario Kart every time we're going to play. Is that the same reason? No. I'm I'm going to go into the options like an adult and see what I can do here. The options are just like Crash Team Racing. These bears, they can't drift. They can't pause. Can you go for the pause? Can you pause? I can't do anything. Okay, circle. Just get the hell out of here. Okay. So, anyways, going to jump back into this one over here. This is my portal. You're not going to get us in that",
            "start": 157.92
        },
        {
            "text": "Can you pause? I can't do anything. Okay, circle. Just get the hell out of here. Okay. So, anyways, going to jump back into this one over here. This is my portal. You're not going to get us in that stuff over there. We're going in. We're going nice and autumnal here. Okay. Looks like a nice autumn. Autumn. I taught you all this. Autumn. Three modes for you have all these different tracks, right? 12 tracks totally. Total eight playable characters. Uh, and there's three game modes each time. So that's what you do here before you jump. Right now we're in another open hub world for this one, right? So that would be we're doing time trials, which nobody wants to do. That would be we have to do this thing where we fill the meter where we get all the food. And this is where we go to race. Let's race. When you get with that now, you can shoot that with X. It's one of your weapon abilities to shoot at. I do believe so. We're about to find out though because we're doing this race over. How do",
            "start": 205.76
        },
        {
            "text": "Race. When you get with that now, you can shoot that with X. It's one of your weapon abilities to shoot at. I do believe so. We're about to find out though because we're doing this race over. How do you jump? I do not know. I have not played that much yet. We'll figure it out. You figure maybe it's like Mario Kart where you tap and you do the hop. I don't know. We got to figure it out on the fly. Okay. Okay. Now, here's where I get serious. Yes. X for sure. Throw us back. Okay. That was me. I did that. I just beat I beat again. So you need to beat again. Well, that was a good weapon. I'm being all over the place. Okay. Some would say I'm European. I got I got beat again. European. Yeah. Oh my god. Right into the wall. Oh, so the penguin gives you a speed boost. All right, now I'm getting it. I think I might hit my own weapon. And now I'm just shooting off my rockets. Just being stupid with these rockets. Kev, orange fish does rockets. Kev, are you aware",
            "start": 244.68
        },
        {
            "text": "right, now I'm getting it. I think I might hit my own weapon. And now I'm just shooting off my rockets. Just being stupid with these rockets. GameOverGreggy, orange fish does rockets. GameOverGreggy, are you aware of this now? Shortcut for sure. What is the Hit X and find? I know. I don't. You don't. I'm I'm just trying to win the game now. Back in fourth place. You kidding me? Yeah. Trophy. Sweet Jesus. Away. Mhm. Fight away. This I'm tired. It's been a long one. Got some rockets. I'm moving on up though. Now, I can't shoot rockets backwards. I want to point that out. You can't hit yourself with the rockets, it turns out. So, that's happening. Aw. What does the owl do? Oh, he's a speed boost. Hoot hoot. Oh, you coming up on me, huh? Yeah. You think you got something special for me? Huh? It's the only way I know. Get the owl, Tim. You know what? Sometimes I'm not sure of the beehives. Oh, you got the gecko. You caught the gecko. I got the gecko. Yeah. No. Okay. Gives me a",
            "start": 305.84
        },
        {
            "text": "Me? Huh? It's the only way I know. Get the owl, Tim. You know what? Sometimes I'm not sure of the beehives. Oh, you got the gecko. You caught the gecko. I got the gecko. Yeah. No. Okay. Gives me a protective shield. Hey, that's useful when I'm up here at number one. Sitting pretty. If I was invisible, if I could just remember that song. I do remember hamsters in the butt. Okay. Now, is that something that really happened or are you just saying it's a substantiated rumor? What a substantial How's it What? I thought that was Richard Gear. You're doing every urban legend we know right now. Urban legends. Yeah. Talking about facts, bro. You just said it was a substant head. Mhm. Yeah. Oh. Oh. Oh. So, how does it feel? Not good. Not good. Oh. Oh. Sorry. I thought you were losing. No. No. I meant this game. I mean, I need to give you a little bit. I don't shoot. It's cool. That doesn't sound like a ring or something. It's not ringing. Yeah, that's the thing. I like the I like the mechanics\n\nI made no changes as there were no obvious phonetic mistakes or spelling errors in the provided chunk.",
            "start": 381.12
        },
        {
            "text": "this game. I mean, I need to give you a little bit. I don't shoot. It's cool. That doesn't sound like a ring or something. It's not ringing. Yeah, that's the thing. I like the I like the mechanics right now. I think from here we got to go we got to bail out and go to the extreme difficulty. Okay, maybe that's the problem. Right now we're at normal. There's the baby bear. There's just the teddy bear which we're playing. And then there's like the crazy bear. We got to get to that crazy bear. You know what I'm saying, Greg? Greg, you ever see a crazy bear? Really? Well, I know that that wasn't the part of the story I didn't believe. Or not even you. He wasn't that crazy. Oh my god. I'm my own worst enemy. Yeah, I suck. Should I worry? No. Again. No. Should I worry about your Crash Team Racing skills? Uh, no. Mhm. Yeah. Yeah. Screw win everything. Of course we fight screw attack Saturday RCX. Come on. If if this if uh our bear day has gone. No. All right. I'm dead clearly. Bring me",
            "start": 434.64
        },
        {
            "text": "Racing skills? Uh, no. Mhm. Yeah. Yeah. Screw winning everything. Of course we fight screw attack Saturday RCX. Come on. If if this if uh our bear day has gone. No. All right. I'm dead clearly. Bring me back. You know what? It needs a little track so I can see who's approaching. Now remember, one person made the game. So that's kind of impressive. I'm talking to him directly right now. His name is Aaron. I don't care. I thought maybe you wanted to address my name. I thought maybe just want a perfect setting with bars of quality. I don't know that, you know, anybody can live up to. I'm about to laugh at this guy. Me? No, not you. I'd love to laugh at you. Laugh at you. It sounds dirty when you say it. Damn it. Stay on the track. He's either really close or about that. Me. I think the level just looks similar. That was your own beehive. Ah, using the bee humor. See, you said that was your own bane. No. I never liked bees cafe. I liked them as an idea. I respect that. We had a",
            "start": 487.04
        },
        {
            "text": "Similar. That was your own beehive. Ah, using the bee humor. See, you said that was your own bumblebee hive. No. I never liked bees cafe. I liked them as an idea. I respect that. We had a topic about these bunch of bumblebees being like how did they get the show of the stink of the hornets looking sick? The wasps, the yellow jackets, and then you got the bumblebee. Bumblebees are beloved in a way though. You know what's happening? We got the chicken power-up. We use that. Well, he's going really slow. You know what? Just me. What's that? Crash Bandicoot. You know what I mean? I do. I remember that when I won the championship. You certainly did. You used to have a belt. Still raining. Never defeated. Kind of funny. Nintendo World Champion. Monopoly belt. Of lies. No one really remembers who has the Monopoly bell. Music. You hate it. No, I like it. It reminds me of... Oh no. Oh no. Oh no. All right, Tim. I",
            "start": 560.88
        },
        {
            "text": "World Champion. Monopoly belt. Of lies. No one really remembers who has the Monopoly belt. music. You hate it. No, I like it. It reminds me of Oh no. Oh no. Oh no. Oh no. All right, Tim. I don't know where I am. I'm bouncing around like Oh god, I don't know why. Jiggle a bit. I just put that there. **** I feel like I've already crossed the finish line a couple times. Yeah, these are long ass laps. But like, why is it showing me first? Oh, he was so close. No. See, there's just another finish line. That wasn't the real There it is. There it is. I was way closer than you would have ever thought I was, wasn't I? Nope. I know. I'm going to be real. Don't step to me in the car racing. Yeah, it's true. So, what do you think? Faster. Got to go faster. Let's go. You want to go to that? You want to go crazy? Yeah. Let's figure out crazy. Hold on. Start. This should just play the whole time. It should. It should. It really should. Oh, it was about to It was about to",
            "start": 652.72
        },
        {
            "text": "to go to that? You want to go crazy? Yeah. Let's figure out crazy. Hold on. Start. This should just play the whole time. It should. It should. It really should. Oh, it was about to ** we ruined it. Shout out to Rachel Simpson. She made these. She made the art in the SFX as they say, which means sound effects. All right. I thought this would work at Dylan. Nothing in this game that you think is going to do what it should do should do. Here we go. Back out the You think that they can't do They can't. I know. That's the thing. Bears Can't Drift. And I I totally can drift pretty clearly. I'm drifting all over the ** explanation, not a question. Then why even put the question there? Because it's more like the way that you're supposed to say. Bears Can't Drift. Yeah. Okay. Here we go. Other thing this game is lacking Polar. I miss Polar. Just polar. All right. This is ** up. I don't know where I am. Way to get back. Three cruising. Just drop me back",
            "start": 730.56
        },
        {
            "text": "Here we go. Other thing this game is lacking Polar. I miss Polar. Just polar. All right. This is **** up. I don't know where I am. Way to get back. Three cruising. Just drop me back to the main menu. You know what I mean? I don't think we heard that much of this. God **** damn it. All right. What if we Oh, Jesus. God. I'll follow you. There must be a way. We got out there and there's just more courses. I didn't know what to do. Kev, why don't you just click game and come back in? That cuz that's not that's not good game design. That's not where we're at. Game design. Here we go. Here we go, everybody. We figured it out. We're well on our way. Oh, you're going away. We're going to the angry bear. Oh, no. There you go. Oh, Jesus. God, why? God, why? Easy peasy. Nope. I'm going be real, Greg. I don't know how I feel about the cart racers with the modern racing controls. They're the way it's meant to be. I don't know about this is the best it's always ever been.\n\nI corrected \"Polar\" (a likely reference to a character or game element) and left other minor errors as they were, since they do not affect the overall meaning of the text.",
            "start": 791.88
        },
        {
            "text": "I'm going be real, Greg. I don't know how I feel about the kart racers with the modern racing controls. They're the way it's meant to be. I don't know if this is the best it's always ever been. What the **** Nope. Nope. Nope. All right. So, like he warned me that to get on the extreme courses it requires. We might not have the skill. Yeah. Boom. No. Oh, that must Okay. Okay. I can drift around. You see that? That's what bears can do. What the **** man? I think this is like some Batman **** I got to hit it at like perfect. You have to prove that you can drift to the bear gods. Now I'm just off-roading as a bear. God. Now it's my mission to get up here. You got to hit that at full speed and jump it. You got to jump it. Oh, there's a jump. That That is it. I don't see it. I know, but Oh my god. Look at me. I'm holding on. Kevin, look. Holding on for dear life. All right. All right. Just fall now. **** you and your mother, Kevin. Here we go. See",
            "start": 861.48
        },
        {
            "text": "It. I don't see it. I know, but Oh my god. Look at me. I'm holding on. Kevin, look. Holding on for dear life. All right. All right. Just fall now. **** you and your mother, Kevin. Here we go. See, we got to make it over there. See it? This is not a game. This is See, I guess this is the whole point. Yeah, you got to be able drifting perfectly. You know what, Kev? I don't see you doing better. I don't got any control in my hand. You think you can make this? Definitely not. But, you know, I don't see pretending to be some pro like Tim Gettys. Oh my god, Kevin. That was as close as you get, man. That's as close as you could get in Bears Can't Drift. Oh well, no, that's not how I wanted to drifted. Okay, you're drifting. Look at his little butt. Look at his little tail. Now just think that's a Care Bear. He wipes his butt with paper. Toilet paper. The bloody paper. You got to nail that, Tim. I almost did. And then Kevin put his hands up. I got to go. What? Don't get in Tim's head when",
            "start": 925.2
        },
        {
            "text": "a Charmless bear. He wipes his butt with paper. Toilet paper. The bloody paper. You got to nail that, Tim. I almost did. And then Kevin put his hands up. I've got to go. What? Don't get in Tim's head when he's almost. What do you mean? My hands are still Whoa. I don't know if you're happy yet. You think you can just go straight over there? Yeah. I mean, good for him. Schem it Okay. Well, let's see him do it. Do it. Sounds great. See, I was almost there. Oh my god. Is that a face you can shoot? No, that's the face signifying it's hard. This is going to be the hardest. My apologies. The camera. Did we ever figure out jumping? No, there's no jumping. Circle allows you to drift. Yeah, that's the equivalent to. If this doesn't get it, nothing will. **** me in the face. **** you. Bears can't drift. Oh, **** you. Bears can't drift. I'm pissed now, Kev. Look at his big butt. He has a little butt. **** Jesus Christ. Kimchi. Do you have a kimchi as you want? Yeah, I did. Okay. I like",
            "start": 978.96
        },
        {
            "text": "Oh, **** you. Bears can't drift. I'm pissed now, Greg. Look at his big butt. He has a little butt. **** Jesus Christ. Kimchi. Do you have kimchi as you want? Yeah, I did. Okay. I like kimchi. I'm a big fan of kimchi. Why don't I see you ever eat it with me? Yeah, you do. I get kimchi in my ramen every time. **** **** Let's get ramen. Oh **** Yeah. We're going to get ramen. How do you feel about ramen? I love ramen. Are you down for the ramen? Yes. Give me a good day. It's already night. I'm sweating. Is it possible this isn't what we're supposed to do? Could you get nitrous? You need like a speed boost perhaps? Can we just call Greg right now? That was sick though. I did a little Did you almost do it? I did a little SP. I mean, I was I got enough air. I just my trajectory was off. What happened? Started hitting X instead of the old R2 cuz you know uh cuz you don't understand how modern gaming works. Yeah. Hey, never claimed to be an expert. Just claim to be",
            "start": 1046.8
        },
        {
            "text": "trajectory was off. What happened? Started hitting X instead of the old R2 cuz you know uh cuz you don't understand how modern gaming works. Yeah. Hey, never claimed to be an expert. Just claim to be a fanboy. Whoa. What the **** is this? That's a sky bringing gun. Hello. Hey Aaron, it's Greg Miller. How are you? I'm good, thanks. How are you? Good. We're playing your game and I'm about to throw my controller out the goddamn window. So, we're trying to get on the hard track that you said would be too hard for us, but we're saying **** that. So, is it all we have to do, I'm assuming, is drift drift around the lighthouse and then just power boost over. No. So, what you've got to do is you got to hold the drift the whole way and actually drift over the jump. Oh, you got to be good. All right. Shut up, Kevin. Tim is trying Tim's trying to No, he's out of control. We're live, too. Oh, you're you're you're live on our let's play, too. It's not live, but you're being recorded.",
            "start": 1120.0
        },
        {
            "text": "All right. Shut up, Kevin. Tim is trying Tim's trying to No, he's out of control. We're live, too. Oh, you're you're you're live on our let's play, too. It's not live, but you're being recorded. You're in America, too. All right. All right. All right. I'm going to try this for a little bit then. All right. Thank you very much. Drift. The drift is off. So, I got to drift the entire way and drift over the jump. You think you can start the drift late, Kev? Yeah. So, I shouldn't be drifting yet. I'm a bear. Oh **** There it is. There it is. That's it. Aaron's right. Aaron Aaron made the game, guys. Well, I bumped the wall. Bumping the wall. **** What? That's not where you're going. You're not going the right place. What? What? When I drifted and almost made it, it's drift drift drift and you keep drifting and then you like You're going We're going there. Yeah. You need that. I'm going to be honest. Yeah, this is making me fall in love with this game. Really? Just this part because",
            "start": 1171.6
        },
        {
            "text": "you keep drifting and then you like We're going there. Yeah. You need that. I'm going to be honest. Yeah, this is making me fall in love with this game. Really? Just this part because this reminds me of Crash Team Racing of like, can we do this dumb thing? Let's do it. Okay. Okay, Bear. Okay, Bear, you suck. You little cute cutie patootie. Where's the bear tunnel? Where's the bear tunnel? I'm just trying to come up on it. **** I almost had it that first time, Greg. And now I'm not going to be able to leave again. Superman. God damn it, man. Thank you. Everyone go to my Twitter and watch me get Superman a cup of water. Here we go. I'm drifting. No, that's where we came from. What is he **** talking about? No. Damn it. We both just did the same thing. It's that hole. It is. It is the hole. It must be the hole. But like every other hole, I know it's hard to get things into it. Yeah, but once it in, it's really satisfying. Yeah. What? You're going off at a",
            "start": 1226.08
        },
        {
            "text": "It is. It is the hole. It must be the hole. But like every other hole, I know it's hard to get things into it. Yeah, but once it in, it's really satisfying. Yeah. What? You're going off at a weird angle. Oh, I had No, I had my sparks there. No. Why are you not No bear. No bear. Bad bear. Oh my god, Tim. Too close. I keep I keep putting into the wall there. That's not even close. I know, but sometimes like the drift gets all wadoodle. It almost felt like it was though. Definitely. Yes, guys. Welcome to the Bare Future. Bare future. I'm still stuck in bare past. I'm bringing you to Bare Future Iceland. Oh, Iceland. Okay. Oh, I can't believe we did it. Unbearable. There you go. Unbearable. That was good. That was really good. I'm proud of you. Proud of everybody involved. It's a big day for me. Superman and a couple of water. Twitter.GameOverGreggy. It's my pin post. You'll see. And then getting the bear to be Bare Future. Here we go. Now, you want to do you want to",
            "start": 1274.56
        },
        {
            "text": "It's a big day for me. Superman and a couple of waters. Twitter.GameOverGreggy. It's my pinned post. You'll see. And then getting the bear to be bare future. Here we go. Now, you want to do you want to keep racing or do you want to eat all the food? Let's race. Okay. I feel like you guys. You know what, Greg? Greg, stop. Don't be like that. We need your support right now. Or I could be honest. Like a bridge over troubled water. We need your help right now. Kevin can't drift. Kevin definitely can't drift. Whoa. Bridge Racer was my game. Also, I can literally drift with my pickup truck. You can also smash into cars and stuff. One time. I'm a bear and I'm going all the panda bears. Oh, that's what you are. Wow, that was the end. He really did just block me. That was a little thing of poop there. See, I like this. This This is chaotic. Yeah, this feels more like this is, you know, I mean, we're not doing well, so that's one part. All right. All right. Oh, there. Oh, I thought this",
            "start": 1346.24
        },
        {
            "text": "See, I like this. This is chaotic. Yeah, this feels more like this is, you know, I mean, we're not doing well, so that's one part. All right. All right. Oh, there. Oh, I thought this was shortcut. Oh, man. It's the slaloms. Say shalom. I don't know if you noticed. This is a lot more fun. Yeah. Do you think enough people stuck through the boring part of let's play the HF? Nope. Oh god. Oh no. Oh, not like this. Oh no. Oh, I just That was bad. I went from first to fifth and fourth. I have no idea. I keep jumping from all over the place. Yeah, I'm going to be real. This needs a map. Yeah, map. Damn it. I fell for the same fake shortcut again. That's just a wall. And now I'm in last place. I'm poop again. I'm poop emoji. Kevin, I'm poop emoji. You're very disappointed. You guys suck. I know. Crash Team Racing was really a phenomenal game though. Like I feel like people think I'm kidding when I say that. Yeah, obviously this guy understands. Sure. It's so",
            "start": 1398.18
        },
        {
            "text": "You guys suck. I know. Crash Team Racing was really a phenomenal game though. Like I I feel like people think I'm kidding when I say that. Yeah, obviously this guy understands. Sure. It's so much better than Mario. Mario's really good though. I know. But Crashing Racing is better. Oh, damn. Both games give Kevin anxiety. God damn it. I keep falling for this thing. Whatever this is. love. Um, I know. I know. You got hit by a door. Don't worry. Door. God, that looked like I jumped. Same door. Gets me all boss. I think it's 10. It's 10. Yeah, that's that's the highlight when you get to hear that song again. You can show me. Good job, Tim. I don't have to be crossing the finish line. Yeah, you were barely behind. All right, **** off with that. That's I want I want You want to do the food thing? You want to eat some food? I want to race. I want to race you for the final round. You won round one. Yeah, I see what you do. I like your headset. I want one",
            "start": 1497.32
        },
        {
            "text": "I want you to do the food thing? You want to eat some food? I want to race. I want to race you for the final round. You won round one. Yeah, I see what you do. I like your headset. I want one round to settle it all. You made the jump. I'll give you that. Thank you. But I'm not really going to give you it. I still won't. Do you want to go to that last environment we love? Sure. That's how the song goes. I don't remember the rest of it. I think it just repeats. I think we hear more here. We just haven't gone that far. Here we go. Run it. We're going to the Jungle Cruise. Where the hell is this? No, don't do it. Oh, did I just up? No, I don't think so. It was loading mine, so it shouldn't it shouldn't matter if you were gonna go anywhere. I'm confused without the big head of Neo Cortex talking to me, telling me lies. It's a good song. He's **** with y'all. There like endgame. It's like car. Oh no. I really thought for a second there was like a racial term",
            "start": 1584.08
        },
        {
            "text": "big head of Nintendo talking to me, telling me lies. It's a good song. He's  with y'all. There like engagement. It's like a car. Oh no. I really thought for a second there was like a racial term for Indian. You got nitrous oxide. Just go. Definitive race right here. Doesn't matter. Definitive edition. I would do anything sexually. Oh, I knew that was going for Crash Team Racing to be included in the remastered Crash Bandicoot. What if they just re They should make that one up from the ground up. You know what I mean? Get in there. Redo it. Oh my god. Yes. Yes. Here. Oh man. Yeah. I don't want to alarm you. Oh, thanks. The hell army. I'm used to being number one. I'm a number one. I'm going to win. You think if like his entire life this guy was told that he can't do it, he's doing this just to say **** his family? I hope so. Oh, baby. I got that old mushroom bounce. Give me that mushroom bounce. Give me that sweet, nasty mushroom bounce. What you going to do, little",
            "start": 1636.08
        },
        {
            "text": "this just to say **** his family? I hope so. Oh, baby. I got that old mushroom bounce. Give me that mushroom bounce. Give me that sweet, nasty mushroom bounce. What you going to do, little kid? Whoa. Don't bring the kids into it. I just wanted to play a video game with you. Okay. First prize. First prize. Pulling it all around like a goddamn bongo. Really? Really? That was really quick. That was too quick. And still cart racing champion in this house. The cart racing champion. Greg Miller. Pound that up. Big Kev. Ladies and gentlemen, that's Bears Can't Drift up right now on Steam Greenlight. It will be on PlayStation 4 and then fully released on Steam hopefully in July. You know how that goes. Look for it there. I had fun. Did you have fun? I got I had way more fun as it went on. I was like, I don't like this. But now I like this. I feel like that once we got to the hard level there and like you got to the car racing we expected, it was much better. Yeah. U local",
            "start": 1708.96
        },
        {
            "text": "it went on. I was like, I don't like this. But now I like this. I feel like that once we got to the hard level there and like you got to the car racing we expected, it was much better. Yeah. It's up to four player local split screen co-op. Great. I don't think there's any online business. Obviously, one man game. You don't need it. You don't need it. It doesn't matter. Yeah. Plus, Bears Can't Drift. It doesn't matter. Let us know what you think in the comments below. Then keep coming back here for all sorts of bear content on KindaFunny.com.",
            "start": 1784.32
        }
    ]
}