{
    "id": 1933,
    "video_id": "NvctGxycXoU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "What VR Game Are We Most Excited For? - Kinda Funny Gamescast Ep. 77 (Pt. 4)",
    "description": "We discuss the VR games we are most excited for.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1469106002,
    "duration": 766,
    "transcript_chunks": [
        {
            "text": "Kinda Funny is going to San Diego Comic-Con, we're doing a meet and greet at Petco Park. I'm hosting panels for DSX, Tomb Raider, Call of Duty, and more. And the best of all, Greg won't be there. Get all the details at KindaFunny.com/SDCC. So, topic for today on the Kinda Funny Gamescast as always brought to you by Patreon. Thank you very much to all of our beautiful Patreon supporters, the $20 above level was nice. Yeah, that's like thato whatever. No, is that what that 16 champ level? 16 not as bad, not as bad as me thinking that was a Venus thing. Steven Carell says, \"What games are you guys most excited to play on VR?\" You Valkyrie homie. I mean at launch of PlayStation VR it's Resogun for me like Resogun infinite. I when I played that at PSX last year man, that that was the first time put on the unit took it off and I was like that was a game that felt like a real game that didn't feel like an experience that felt like something I would sit down and play hours of yeah maybe not all once but for",
            "start": 0.08
        },
        {
            "text": "took it off and I was like that was a game that felt like a real game that didn't feel like an experience that felt like something I would sit down and play hours of yeah maybe not all once but for me it's Star Wars for sure even if it is an experience that's what I want I don't oh the fighter yeah like they're not ready to make the full game thing yet that's fine I just want that experience I mean it's there's nothing like that that's so cool and I I remember when uh I heard that they were going to make Space Mountain into hyperspace Mountain at Disneyland I was so excited because it's like I love that ride but adding Star Wars music to things makes things better you know what I mean and I think that uh there's something very very unique about uh the the the feel of what Star Wars is and when you add that to VR it's like all right cool there's going to be a whole bunch of VR experiences of me flying around in a cockpit but an X-Wing cockpit a TIE fighter cockpit that's different",
            "start": 59.32
        },
        {
            "text": "and when you add that to VR it's like all right cool there's going to be a whole bunch of VR experiences of me flying around in a cockpit but an X-Wing cockpit a TIE fighter cockpit that's different that's that's something where I'm like yep live in the dream I mean that's the equivalent uh earlier time about Pokémon go where it's like Niantic put out Ingress years ago no one gave a **** like the people liked it liked it but like overall that's not going to you know change the the mobile game or anything you add Pokemon to it all of a sudden it's like huh this makes sense and I totally understand and I think that with Star Wars it's the same thing where that is that that Touchstone where everybody that experienced that is going to be like holy **** and I can't wait to see what they do with it yeah I um I think e Valkyrie is the most exciting I mean for the games that are announced I think E. Valkyrie then I want to see res evil I'm want to play a Comic-Con I'm excited Yeah Tim do you",
            "start": 98.6
        },
        {
            "text": "with it yeah I um I think e Valkyrie is the most exciting I mean for the games that are announced I think E. Valkyrie then I want to see Resident Evil I'm want to play a Comic-Con I'm excited Yeah Tim do you want to play the Comicon with me no I already played it I'm good it's this is the I okay you make that happen no is that a thing it is really scary Andrew Street at street sweeper says good name good name Will VR bring about the return of the murder simulator argument in politics and news about games yes but the argument is did it ever go away I think Pol politics just got lazy they they maybe noticed that nobody was listening to that argument yeah when you put on VR and you are now holding the gun and somebody puts out a it won't be on Playstation VR but when somebody puts out a download where you are killing cops or whatever like yeah that's going to be an issue people are going to put that out and it'll be like hatred it'll be like that right of when you have your Hatred game that's in",
            "start": 136.48
        },
        {
            "text": "you are killing cops or whatever like yeah that's going to be an issue people are going to put that out and it'll be like hatred it'll be like that right of when you have your Hatred game that's in VR and the guns in your hand someone will make a big deal about it but hopefully there'll be level-headed people there to us always be like well we've always had light gun shooters is it really any different like granted this game's rewarding you for one thing but it's one one way that they're taking this art this direction this game whatever yeah I think when the VR first kind of goes really mainstream with PlayStation I think that we're going to get obviously a lot of news coverage from it from every angle because everyone's going to be talking about it and I think that that will be one of the the perspectives people take but I do think that overall there's going to be a lot more uh positive angles that will be covered really like focused on and I think that it's going to be a I don't",
            "start": 184.96
        },
        {
            "text": "the perspectives people take but I do think that overall there's going to be a lot more uh positive angles that will be covered really like focused on and I think that it's going to be a I don't think it's going to be any different than it has been because people are always going to have issues with violence in any form of media so I think that uh VRs just are going to be a new way for people to be mad yeah at first it'll all be about the tech but then yeah somebody will get their hands on it and make this game that's weird yeah um Matt Weny says why is Nintendo being so slow in revealing the NX like just get to it already fans are sick of waiting there's zero monetary gain to keep waiting in my opinion I respectfully disagree with you I think that they there's no reason to talk about it until it's absolutely ready to be talked about and if the plan is March I think wait as late as possible because you're just going to get drowned out in the entire holiday run of everything",
            "start": 218.04
        },
        {
            "text": "about it until it's absolutely ready to be talked about and if the plan is March I think wait as late as possible because you're just going to get drowned out in the entire holiday run of everything I think we're so close to E3 and there's still ComiCon like there's still conventions where announcements get made I think that they need to wait until later in the year maybe even a September um I think October you could push it to but October games start coming out so that might be uh not the best time because you need to think about it they they're competing for the the IGN placement you know what I mean like how long is IGN going to keep talking about Nintendo Switch when it comes out you look at right now IGN I guarantee you five stories about Pokémon Go and tomorrow there'll be five new stories and whatever they're owning that right now in October in November you need to think about those placements being taken up by Call of Duty reviews and Call of Duty strategy videos and Call of Duty this and",
            "start": 259.56
        },
        {
            "text": "They're owning that right now in October, November you need to think about those placements being taken up by Call of Duty reviews and Call of Duty strategy videos and Call of Duty this and that. Repeat that with Titanfall and Battlefield and this and that and blah blah blah. You go down the line it's like they're competing for space then when you get on a more mainstream level, it's you know they're they're it's obviously going to be talked about but there needs to be those follow-up conversations there needs to be more articles than just this thing happened and and when you start competing with the reviews and all the other stuff of all the big Blockbuster titles I think that's a bad idea so I think September is when they need to to strike early October at the latest um do their own event really Own It, own the message, own everything and go from there. Word word yeah they they need to own that moment. Franklin Seymour says Hey Franklin how did the quality of voice acting get to where it",
            "start": 302.88
        },
        {
            "text": "really Own It own the message own everything and go from there word word yeah they they need to own that moment. Franklin Seymour says \"Hey, Franklin, how did the quality of voice acting get to where it is today?\" You take it more seriously, more room to run the audio, more intent on storytelling. I people directing games like making directing cut scenes, directing it like a movie. Yeah, I mean you remember even like voice acting was compressed and there wasn't a lot of room to dedicate to it back in the day as well. So um I think I just came to that it just became important the more important storytelling became and the more the high fidelity of the audio became uh a touchstone of these storytelling games and these narrative driven experiences. I think that that was just a natural evolution of that. I think when people started calling it out too and talking about it, and that was a that was a pro or it was a con you know. I mean how many games did you play that were like these were great",
            "start": 338.68
        },
        {
            "text": "of that I think when people started calling it out too and talking about it, and that was a pro or it was a con, you know. I mean how many games did you play that were like these cutscenes are great, these cutscenes are awful, this voice acting is terrible? And people saw that, developers saw that, publishers saw that, and started putting a premium on that as they saw the fact that oh, people are talking nonstop about Metal Gear Solid because they love these characters and they love the way it played out. Whether you know what I mean, how can you look at Vulcan Raven and not love his voice acting? It's true, it's very true. Yeah, it's funny to look back at voice acting in games and you look at things like Resident Evil, obviously was uh one yeah but it it was such a joke but it was also such a big deal because it was novel and like as bad as it was it was still like oh man, like there's there's voices in this, this is this is crazy, this is oh man, it's like watching a movie but",
            "start": 380.8
        },
        {
            "text": "it was also such a big deal cuz it was novel and like as bad as it was it was still like oh man like there's there's voices in this this is this is crazy this is oh man it's like watching a movie but you're playing it you know what I mean like that started that conversation and that's I mean why I bring up the Metal Gear Solid of like that was for me like such a holy **** this is where we're going as an industry and that in that game got so much critical acclaim for it and now yeah you go back and watch it it's like blurry faces moving around they're all overacting and stuff but at the time you were like **** was a step a step in the right direction which is kind of where we're at now like I think other um success stories were like Star Fox 64 for which is different you know but like that did give that game so much character and the most memorable thing about that game is the the voice acting and the characters and and that stuff uh and then obviously Final Fantasy X",
            "start": 415.16
        },
        {
            "text": "like that did give that game so much character and the most memorable thing about that game is the voice acting and the characters and and that stuff uh and then obviously Final Fantasy X, the first Final Fantasy to have voice acting when people think back on it now like that is one of the The Laughing Man scene, the The Laughing Man scene is one it's one of the most most talked about things about that game you know because it was awkward and bad but that's just because but no one knew any better exactly like that's just in uh in relation to the other things and what we have now it's horrible you know but back then it was like huh it was novel um yeah now things are in a really good place so I'm happy about that Connor says quick first response to come to your head think is the most underrated game of this generation so far Donkey Kong Country Tropical Freeze, Max song of the deep I don't know I mean that's what cleared my head this that's just cuz it's on my mind we've talked",
            "start": 449.52
        },
        {
            "text": "underrated game of this generation so far Donkey Kong Country: Tropical Freeze. Max song of the deep I don't know I mean that's what cleared my head this that's just cuz it's on my mind we've talked about it this show there you go all right if I come sense Thomas I just walk around grinding you know with an axe to grind about you know this game was underrated I don't either but like I and I don't I use the term we use all use the term underrated overrated all that kind of stuff it doesn't like what does it really mean but there are certain games where I'm like I can't believe this like people don't understand this game and Mad Max is one of those games oh my God I just can't believe it you know that game's awesome Thomas Parker says why is the games industry so secretive compared to the movie industry I was having a fascinating conversation about this with someone recently A friend of mine in the the industry and he was asking the same question and he's a big deal in the industry and uh",
            "start": 491.44
        },
        {
            "text": "industry I was having a fascinating conversation about this with someone recently A friend of mine in the industry and he was asking the same question and he's a big deal in the industry and uh he and I were hanging out Ken Levine and uh he asked the same question he was just like \"I don't get it\" and he was telling me stories about you know the way they do in movies and and all this kind of stuff and how different it is there like how Mo'Nique there are no secrets in movies like the movie industry is there's no secrets things are gestating for years and people are just are just open about it and people are like \"this guy's writing this now\" and this guy everyone it's even if it's a secret outside like everyone in the industry knows and it's the same thing in the gaming industry there are there are but there are a lot of secrets we know as well um so I don't understand it either I think it's stupid but I think it allows um on the other hand people to really make a pop",
            "start": 533.68
        },
        {
            "text": "there are there are but there are a lot of Secrets we know as well um so I don't understand it either I think it's stupid but I think it allows um on the other hand people to really make a pop when the announcement is made because movies are different than games and there's um you know so it's just it's run a little bit differently the thing that the we Define what the the secrecy is that we're talking about you're talking about the announcement of games when like Spider-Man like when Nomadic was working on Spider-Man forever and quietly yeah well they I mean they had only been working on it for a little while actually at that point but like the a a greater example is like we're gonna get Red Dead right Red Dead 3 and and again I want to be clear because everyone's like it's Red Dead 2 no it's not it's Red Dead 3 if it's Red Dead Redemption it's Red Dead Redemption 2 right but it's not gonna be Red Dead Redemption 2 so it's I I still think it's be like Red Dead Revolution or something",
            "start": 568.16
        },
        {
            "text": "Red Dead 3 if it's Red Dead Redemption, it's Red Dead Redemption 2 right, but it's not gonna be Red Dead Redemption 2 so it's I still think it's be like Red Dead Revolution or something like that. Why would they do that? Why would they make Red Dead Redemption 2? I hope they don't do that; that would be stupid. The only reason would be name recognition, but everybody calls it Red Dead, so anything you put after Red Dead... Um, but God, I hope they don't do that. That would be so dumb. But what they can call it is \"Red Dead\" and I'll still play it. Um, Red Dead sandwich? No, they literally just call it \"sandwich\" and I'll still play it. Um, but like, so like that game is going to clearly be announced; that game has been in development for years. Why don't we know about it? Like what's the big deal? But on the other hand, it's like well you got a big pop out of it, but the example is like no one does that with movies.",
            "start": 603.08
        },
        {
            "text": "for years why don't we know about like what is the big deal but on the other hand it's like well you got a big pop out of it but the but the the the example is like no one does that with movies like no one does that with movies at all you know like not only is it not possible probably because it's like there's not a lot of secrecy like even with Star Wars like episode seven it's like well we didn't know much about episode 7 things were leaking what we knew episode 7 was in production forever they announced they were going to make it before they even made the game like all it is totally different and that's a really good point and I don't I don't quite know all the reasons why that is is it because I think the argument might be made that it's because it'll take longer and not all the time don't get me wrong but I think the fact this is this goes back to what you're talking about why you're not mad but why you're like why is Kojima out there talking about his game we're going to get",
            "start": 636.16
        },
        {
            "text": "don't get me wrong but I think the fact this goes back to what you're talking about why you're not mad but why you're like why is Kojima out there talking about his game we're going to get sick of hearing about it it's still 2019 2020 before you're going to play this game like that's I would think the reason right because it's for when a movie's been gestating forever like Ghostbusters 3 and now this Ghostbusters reboot it's like at some point people are like I'm sick of hearing about this **** thing make the movie or get it out or do whatever I think games suffer from that too but games inherently take longer to produce and that's why it I think when you're seeing the shorten schedule now like we're talking about like with Fallout or even when it is like we release this game and then nine months later it'll be out maybe a year later it'll be out that's more like a movie thing like you know what I mean when you see the first images of like Tom Holland is Spider-Man it's like",
            "start": 667.0
        },
        {
            "text": "then nine months later it'll be out maybe a year later it'll be out that's more like a movie thing like you know what I mean when you see the first images of like Tom Holland is Spider-Man it's like well cool I'm seeing this right now of him taking the selfie and doing all this different stuff and literally in one now less than one year I will see this movie so it's like it's not really burning like where the hell oh man it's not 3 years of seeing him do stuff with the suit and play I understand the argument and like or just like the the the comparison but at the same time I don't hate it like I like it I like I like if it was if it could be with the thing with movies I think it would be awesome but the movies are just made differently I don't understand the movie industry so but I do understand the game industry and I think that it's I think that it's uh you know I think it's cool I think it's good for games that that they're not announced early I think like I think it was great for",
            "start": 698.8
        },
        {
            "text": "the game industry and i think that it's i think that it's uh you know i think it's cool i think it's good for games that that they're not announced early i think like i think it was great for Fallout 4 that it was announced the way it was i think it's going to be great for Red Dead when that game is inevitably announced and comes out very quickly **** sandwich sandwich Rockstar Games presents **** sandwich ladies and gentlemen that's been the Kinda Funny Gamescast thank you very much for joining us thank you lovely gentlemen for joining me thank you Greg for being there looking forward to next time I love you",
            "start": 732.0
        }
    ]
}