{
    "id": 1907,
    "video_id": "QKKDrK9LS8k",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why Do Cops Keep Killing Black People? - The GameOverGreggy Show Ep. 136 (Pt. 1)",
    "description": "We discuss some of the horrible events that have been happening. \n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1468220400,
    "duration": 1922,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to The GameOverGreggy Show I'm one of your hosts Greg Miller alongside the producer Nick Scarpino hello the pride of Long Island Colin Moriarty it's good to be here with you today it's good to be here with you today oh it's not and the Pure One Tim Gettys, Tim host how are you guys good good mhm I don't want to do the rig roll uh I want to get right into this I have a serious topic to begin with um who's up to date on Alton Sterling? I am I'm not can't say that I am. Alton Sterling was murdered last night in Louisiana by police uh we continue to do this on this show where we have to keep bringing up the same topics sometimes we stumble into them and say something we did in the first episode of the first show and now we have new thoughts on it but this is now at least the third one about how if you are a black person you will be killed by the police and I'm getting **** sick it I'm very angry I was very angry last night I've been very angry all",
            "start": 2.85
        },
        {
            "text": "is now at least the third one about how if you are a black person, you will be killed by the police and I'm getting very sick of it. I'm very angry. I was very angry last night. I've been very angry all day. I went back through the episodes - the ones that I was able to jump back to - immediately jumping to \"Stop Being Racist\" episode 82, part one of thirty. Every time we do this, I have the same rant where I'm upset and there's nothing to do. May I real quick ask you a question? What they don't even know what this is so shouldn't you begin there? I was going to start with this setup to it and then get into it if you don't mind. No, it's fine. Thank you for helping host the show with me on \"Stop Being Racist\" part one of episode 82, thirty-four minutes and twenty-seven seconds in. We've been going around and around and as usual I'm sitting here being quiet about it. I have nothing really to say about this because I feel this at my heart. Of all the times Nick says after going through a whole thing, \"it needs to be figured\"",
            "start": 51.84
        },
        {
            "text": "I'm sitting here being quiet about it I have nothing really to say about this because I feel this at my heart of hearts all the times Nick says after going through a whole thing it needs to be figured out sooner rather than later to which I say which is exactly what we said on the Ferguson episode, Ferguson episode was of course episode 38 part one this was on August 25th 2014 then the Stop Being Racist episode publishes on July 29th 2015 uh what we said in the Ferguson episode we're back to where we were in the Ferguson episode this is great and it's great to have these conversations if South Carolina can just hold on two weeks though there will be something else everyone will want to talk about and no one will be paying attention to this it's the same thing that happened with the Ferguson thing it's like this really sucks everything's **** up how do we fix it fix it nobody will it's too hard there's no easy solutions and we won't fix it it'll keep going Nick came in back talked a",
            "start": 94.96
        },
        {
            "text": "thing it's like this really sucks everything's **** up how do we fix it fix it nobody will it's too hard there's no easy solutions and we won't fix it it'll keep going Nick came in back talked a little bit more then I cut him off again but then but then it went down to something and two other events happened and then it it was Baltimore and everybody's back on this quote oh nothing's changed hey everybody that thing we were super **** mad about a while ago didn't fix the problem now wait a minute and it went away and something else happened this speaks directly to what we've been talking about with gun control this is what we're talking about with police brutality and it keeps coming up on the show and I'm kind of at my end of my **** rope as a human about it and I don't know what to do with these emotions so rather than do the thing I did here I started actually looking into it I'm going to read to you uh the article from the AP about this to bring you all to speed then we'll",
            "start": 128.32
        },
        {
            "text": "to do with these emotions so rather than do the thing I did here I started actually looking into it I'm going to read to you uh the article from the AP about this to bring you all to speed then we'll watch two videos uh from the AP Feds Open Investigation Into Deadly Police Shooting This is from Mike Kelmel yeah Kelmel Baton Rouge Louisiana The US Justice Department opened a civil rights investigation Wednesday into the video recorded police killing of a black man who authorities say had a gun as he wrestled with two white officers on the pavement outside a convenience store Alton Sterling 37 was confronted by police and then shot on Tuesday after I'm sorry after an anonymous caller said he threatened someone with a gun outside the store where he was selling homemade CDs authorities said in a cell phone video taken by a community activist and posted online the two officers pin Sterling to the ground someone yelled he's got a gun gun gunfire erupted moments later at a news",
            "start": 162.88
        },
        {
            "text": "said in a Cell Phone video taken by a community activist and posted online the two officers pin Sterling to the ground someone yelled he's got a gun, gun in gunfire erupted moments later at a news conference Wednesday Baton Rouge Police Chief Carl Dabadie you want to say Dabadie Jr said that Sterling was armed that's a hell of a Louisiana name well I'm just calling Dabadie Jr said that Sterling was armed but that there are still questions about what happened real quick I should chime in we are recording this on Wednesday of this week I God only knows what's going to happen between the time you hear this on Friday as a Patreon supporter or when it posts on Monday I'm sure things will get worse I'm sure there will be riots quote like you there is a lot that we do not understand at this point like you I'm demanding answers Dabadie said calling the shooting quote a horrible tragedy the officers identified I'm going to read the whole article by the way the officer is identified by the",
            "start": 202.72
        },
        {
            "text": "point like you I'm demanding answers, De'Vante said, calling the shooting \"a horrible tragedy.\" The officers identified are Blaine Salamoni, a four-year member of the department in Houma, and Howie Lake II, who has been on the force for three years. They were placed on administrative leave, standard procedure. Authorities would not say whether one or both fired their weapons or how many times. Governor John Bel Edwards of the US Department of Justice announced the investigation by the department's civil rights division: \"I have very serious concerns... this video is disturbing to say the least.\" Edwards said the shooting sparked anger in Baton Rouge, with hundreds protesting Tuesday night and demonstrations continuing Wednesday. Community leaders and Sterling's family demanded a federal investigation: \"Mr. Sterling was not reaching for a weapon; he looks like a man that was\"",
            "start": 242.04
        },
        {
            "text": "night and demonstrations continuing Wednesday Community leaders and Sterling's family demanded a federal investigation quote Mr. Sterling was not reaching for a weapon he looks like a man that was actually fighting for his life said State Rep Edmund Jordan an attorney for the Sterling family uh Quinyetta McMillan sorry the mother of Sterling's teenage son trembled as she read a statement on City Hall where a few dozen protesters and Community leaders had gathered her son Cameron, 15, broke down in tears and was led away as his mother spoke; she described Sterling as quote a man who simply tried to earn a living taking care of his children quote the individuals involved in this murder took away a man with children who depended upon their daddy on a daily basis she said the police chief urged protesters remain peaceful and Mayor Kip Holden likewise sought to ease tension saying quote we have a wound right now and we'll be healing and making the city and Parish whole again",
            "start": 279.68
        },
        {
            "text": "chief urged protesters remain peaceful and mayor Kip Holden likewise sought to ease tension saying quote we have a wound right now and we'll be healing and making the city and Parish whole again police said they have dash cam video body cam video and store surveillance footage of the shooting that will be turned over to the justice department but Lieutenant Johnny Dunham yeah Dunham uh said the body cam footage may not be as good as investigators hope for because the cameras became dislodged during the scuffle Majorie Esman, executive director of the Louisiana ACLU, said if body cameras became dislodged there are quote serious questions unquote that need to be asked quote is that because there was something wrong with the equipment is that because the officers were not trained how to properly fasten them she said right when they're needed most and is when two of them malfunctioned the same way the justice department will look into whether the officers willfully violated",
            "start": 316.6
        },
        {
            "text": "how to properly fasten them she said right when they're needed most and is when two of them malfunction the same way the Justice Department will look into whether the officers willfully violated Sterling's civil rights through the use of unreasonable excessive force similar investigations which often take many months were open following the deaths of Michael Brown in Ferguson, Missouri, and Eric Garner in New York. Federal investigators must meet a high legal burden to bring a civil rights prosecution establishing that the officer knowingly used unreasonable force under the circumstances and not simply made a mistake or used poor judgment. Many federal probes conclude without criminal charges. In the video which appears to be shot from inside a nearby parked car, one of two officers outside the store can be seen tackling a man in a red shirt and wrestling him to the ground; then the other officer helps hold the man down at some point someone can be heard saying he's",
            "start": 357.6
        },
        {
            "text": "officers outside the store can be seen tackling a man in a red shirt and wrestling him to the ground. Then, another officer helps hold the man down. At some point, someone is heard saying \"he's got a gun\" or \"gun.\" One officer is on top of a man, pulling his weapon from his holster after shouting. What sounds like a gunshot can be heard, and the camera pulls away. More shots are heard at one point. A person in a vehicle asks, \"Did they shoot him?\" As a woman is heard crying. The store's owner, Abdul Mualia, told the Advocate newspaper that Sterling was not holding the gun during the shooting but saw officers remove one from his pocket afterwards. Mualia said an officer yelled \"gun\" during the scuffle and then fired four to six shots into Sterling's chest. On Wednesday, a pastor told the small crowd gathered at the protest that it should be peaceful. Uh, 45-year-old Sharon Alexander",
            "start": 395.96
        },
        {
            "text": "fired four to six shots into Sterling's chest and Wednesday when a pastor told the small crowd gathered at the protest that the protest should be peaceful uh 45-year-old Sharon Alexander, her voice cracking, countered we don't need peace, we need answers, we need justice. Alexander, who was there with her daughter and three other people, said later we sound like a broken record; it's time for a change. Protesters and friends created a memorial to Sterling on the white folding tables and folding chairs he used to sell homemade music compilations on CDs. He never bothered nobody; he was just trying to make an honest dollar, said Arthur Baines, who came by to pay his respects. One of the employees at the store said Sterling often gave away CDs or petty cash, bought food or drinks for some people; he was a very nice guy, he said. He helped a lot of people. The man who claimed to have shot the cell phone footage, Arthur Reed, says his company stopped The Killing",
            "start": 439.4
        },
        {
            "text": "bought food or drinks for some people he was a very nice guy he said he helped a lot of people the man who claimed to have shot the cell phone footage Arthur Reed says his company stopped The Killing Incorporated makes documentary style videos about killings in Baton Rouge quote we look at ourselves as being service to the community so now before moving on to that we will watch this video Kevin it's up to you if you want to put it in if if there video pops up here ladies and gentlemen it's graphic of a man being shot now this is the one that popped off last night now this is the extended version 42 seconds Nick can you see okay no it's okay is so here he is being tackled shoved to the ground slammed on the car officer 2 comes over holds him down so that's the that was the one that started breaking last night late that was the one that had the hashtag begin trending brought it to my attention that this is happening again today The Daily Beast has this video have you",
            "start": 480.56
        },
        {
            "text": "one that started breaking last night late that was the one that had the hashtag begin trending brought it to my attention that this is happening again today The Daily Beast has this video have you seen this one Colin no there is a dash cam footage as well I don't know if that's public though yeah not yet this is uh from I believe The Daily Beast says portrait mode hold on pause this is from the alternate perspective who was this from I believe it's the store owner is what they do somebody at the front door of the store so it's the before we were seeing it you know if you're looking North we're at the North side now we'll say it was on the west before gun pulled there it is now you're going to when they come back you're going to see them pull the gun from his pocket as he bleeds to death and clutches his chest there's the gun assumedly so obviously not shown right to the camera or something so this is leaving me again angry and confused at how this continues to happen the problem I find",
            "start": 571.64
        },
        {
            "text": "and clutches his chest there's the gun assumedly so obviously not shown right to the camera or something so this is leaving me again angry and confused at how this continues to happen the problem I find is that I I today when I woke up today I was like all right well this won't be the this won't be the one where it's met with indifference and how do we solve this problem and what can I do as a citizen of the United States and I don't have an answer for you uh I did what any other human being would do and Googled the direct questions I had finding no answers finding nowhere to go with it the best I could do to summarize I think what's happening from August 2014 because this problem is so new is the Slate article called \"Policing the Police\" by Laura J. Cronholm now uh if I'm jumping ahead here I believe uh Laura pops up in here and says something to the effect that yeah she is on a civilian oversight committee I believe in her community in California which might be oh in San Jose anyways",
            "start": 627.6
        },
        {
            "text": "I believe uh Lori Pops up in here and says something to the effect that yeah, she is on a civilian oversight committee I believe in her community in California which might be oh in San Jose anyways I'm going to read you excerpts from this article Slate article Policing the Police in just the last two months Michael Brown 18 was killed by a police officer in Ferguson Missouri A.E. Ford 25 was killed by a police officer in Los Angeles Frank Alvarado 39 was killed by Santa's Sal Serna's thank you police officer Eric Garner 43 was killed by a New York police officer and Marlene Pinn 51 was brutally beaten by a California highway patrol officer all these victims were of color and were all unarmed uh she goes into the fact that we have to figure out how to stop this right and basically training and federal investigations are ineffective responses to allegations of police misconduct we know how to solve this epidemic we just need to find the political will to do it uh she jumps",
            "start": 688.32
        },
        {
            "text": "training and federal investigations are ineffective responses to allegations of police misconduct we know how to solve this epidemic we just need to find the political will to do it uh she jumps through again still complain not complaining I shouldn't say sorry talking about training isn't the answer retraining is the answer retraining is useless when officers view people of color as quote unquote subhumans the word shouted by a police officer at a crowd in Ferguson protesting the killing of Michael Brown all the training and retraining in the world are of no moment if officers see the people they are charged to protect and serve as subhumans and dangerous so here she has three parts of what she thinks would help solve this problem excuse me first police departments must broaden their definition of reasonable use of force in 1989 the US Supreme Court and this speaks aside from Greg of why everything gets thrown out right I was going up for these",
            "start": 735.44
        },
        {
            "text": "broaden their definition of reasonable use of force in 1989 the US Supreme Court and this speaks aside from Greg of why everything gets thrown out right I was going up for these indictments right and they don't go through and that's when everything really gets crazy and there's riots and stuff like this this is speaking to why that's so tough in 1989 the US Supreme Court in Graham v. Connor defined the reasonable use of force as quote judge from the perspective of a reasonable officer on the scene and its calculus must embody an allowance for the fact that police officers are often forced to make Split Second decisions about the amount of force necessary in a particular situation end quote that definition has been interpreted narrowly by law enforcement agencies across the country to mean that the reasonableness of force is limited to an examination of only the amount of force used in the moment the conduct of officers right before",
            "start": 774.0
        },
        {
            "text": "across the country to mean that to mean that the reasonableness of force is a limited is limited to an examination of only the amount of force used in the moment, the conduct of officers right before this use of force is never examined under these definitions. Officers who provoke individuals and officers who escalate situations get a pass. The definition of what constitutes the reasonable use of force must be expanded to include the circumstances leading up to the use of force, so that misconduct sweeps in whatever the officer did prior to that decision to use force, along with the conduct of the victim. There's a precedent for this - 2014 both the Seattle Police Department and the Los Angeles Police Department extended their definitions of reasonable use of force. Now in Seattle, officers cannot use physical force against individuals who only verbally confront them unless the vocalization impedes a legitimate law enforcement",
            "start": 811.56
        },
        {
            "text": "of reasonable use of force now in Seattle officers cannot use physical force quote against individuals who only verbally confront them unless the vocalization impedes a legitimate law enforcement function or contains specific threats to harm the officers or others end quote and in Los Angeles the use of deadly force must include quote consideration of not only the use of deadly force itself but also an officer's tactical conduct and decisions leading up to the use of force when determining its reasonableness end quote second thing she comes with that are city and counties must establish independent civilian oversight agencies for their law enforcement departments she goes through the fact that this is in South America or South Africa Canada Belgium blah blah blah then it's already happening in the states Palo Alto has one, CCAZO Michigan has one Honolulu had one there's a complete listing over at NAACP.org uh she is on the one in San Jose uh the beauty of civilian oversight",
            "start": 852.12
        },
        {
            "text": "happening in the states Palo Alto has one C carjacking Michigan has one Honolulu had one there's a complete listing over at nacopa.org uh she is on the one in San Jose uh the beauty of civilian oversight is that it holds police officers accountable to the public by providing independent review of complaints of police misconduct instead of relying solely upon internal investigations in which the police investigate themselves then that she gives this example in 1988 murder of 20-year-old Carla not by Officer Craig Peyer a six-year veteran of the California Highway Patrol illustrates what happens when independent civilian oversight is not part of misconduct uh investigations after stopping her for a traffic violation and I'm saying Peyer you what you say peer probably made sexual advances on her when she refused he killed her by bludgeoning her with his flashlight strangling her and then tossing her body over a bridge it turned out that a number of young women",
            "start": 891.76
        },
        {
            "text": "payer made sexual advances on her when she refused he killed her by beating her with his flashlight strangling her and then tossing her body over a bridge it turned out that a number of young women had also been victims of P's advances and while they had filed complaints with the CHP's internal affairs unit, the department's internal investigations dismissed their complaints, finding in favor of Pierre. Pierre is now serving a life sentence in California for involuntary manslaughter, not murder. This third one she mentions is something that was argued on Slate today - that every single law enforcement officer should be wearing one of the body cameras we all saw how well that worked out in the case here of Alton. She wraps up all the outrage surrounding the violence against unarmed black people saying it will amount to nothing if we simply settle for more investigations and more training, there are steps we can take to reduce police violence and they have been proven to work now",
            "start": 938.2
        },
        {
            "text": "people is somewhere will amount to nothing if we simply settle for more investigations and more training there are steps we can take to reduce police violence and they have been proven to work now we're back though to where we always are of I don't know what the **** to do about any of this I want to act and I don't know how to act I don't I don't know how to challenge a Supreme Court thing I don't know if you talk to the individual police departments about expanding police force before the show I tweeted a criminal sociology Professor I know I've not got a response I was late on that and I I I'm sorry I texted sociology professor and then I I tweeted at the NAACP cuz I don't know what to do with this rage this anger this hurt these emotions and it's to the point now where it's I I it's not I can't sit there and just say because I mean spoiler alert again in two weeks gorilla is going to almost kill a baby or someone's going to shoot up a church or there's going to be like",
            "start": 973.28
        },
        {
            "text": "I it's not I can't sit there and just say because I mean spoiler alert again in two weeks Gorilla is going to almost kill a baby or someone's going to shoot up a church or there's going to be like there's going to be another thing that will make us forget about this except for the family you know what I mean except for the people who are immediately affected by this struck by this do we know what he did the AR the the initial call is that he's outside selling his CDs at these white tables which he apparently does all the time according to the store clerk but it was an anonymous call that somebody had seen him threaten someone with a gun so and and this is always such a sticky situation again we're we're shooting from the here on information that's from yesterday in our world hopefully there's more information more clarity more insight by the time we get to Friday for the posting on Patreon Monday for this I understand I'm a police officer I've been told someone has appointed",
            "start": 1010.04
        },
        {
            "text": "there's more information more clarity more insight by the time we get to Friday for the posting on Patreon Monday for this I understand I'm a police officer I've been told someone has pointed a gun at someone and I'm coming into that obviously hopped up on adrenaline and that's that I I understand that as a police officer you're putting your life on the line to investigate these kind of situations now what happens before that camera goes on what does Alton say to them what do they say back no idea but I do know that he gets thrown he gets tackled into a car when it looks like he's just walking around thrown on the ground and then it looks to me and I'm and I mean this is the whole problem of like it we're all outsiders bystanders we weren't there it looks to me like he's either trying to put his hand behind him or just get it out of their way it doesn't look like he's reaching for a gun to me it looks I mean my my thing there looking at that video not knowing any of this is just",
            "start": 1050.48
        },
        {
            "text": "to put his hand behind him or just get it out of their way it doesn't look like he's reaching for a gun to me it looks I mean my my thing there looking at that video not knowing any of this is just when they say stop moving he doesn't stop moving and he had a gun on him so like that that's the only thing there is like they he only pulled the gun when someone screamed he has a gun yeah you know um again I'm not at all trying to take sides or anything I don't know anything about this just based off that we're all just watching two videos and coming to conclusions don't get me wrong it's you know I've had many issues with the cops personally and understanding all this stuff so it's like this is not okay obviously um but you know the cops there they have a job and you're right like if if they say this guy has a gun he's waving a gun that's a scary situation there's adrenaline there it needs to be taken care of somehow this way no not necessarily tackling someone to the ground when",
            "start": 1091.16
        },
        {
            "text": "say this guy has a gun he's waving a gun that's a scary situation there's adrenaline there it needs to be taken care of somehow this way no not necessarily tackling someone to the ground when is that okay and what really bothers me is this thing about they get to decide the force and how much force is you know acceptable for each individual situation like I feel like that kind of needs to be the thing that's um redesigned a bit and I don't know like how that happens what what Supreme Court case needs to be voted on or whatever for that to go down but that is unacceptable I think that seems to be like the kind of the issue because the police do have power over us and I think this goes back to kind of the gun control thing of in this case he did have a gun on him and all the other ones it seems like they didn't have guns that is a great point that it's not apples to apples potentially I mean you never know there was that case I it was like three years ago where you literally saw the cop",
            "start": 1131.96
        },
        {
            "text": "it seems like they didn't have guns that is a great point that it's not apples to apples potentially i mean you never know there was that case i it was like three ago where you literally saw the cop walk up and throw the gun put the gun no for sure so we don't know what happened in that scuffle and it's conceivable that look like he pulled it out of his pocket yeah we see anyone put it into his pocket right we don't see that the camera dips in both instances we don't really know what's going on we don't really know what's going on with with two police officers that's disconcerting to me is there's two trained police officers who are not small human beings seemingly from the videos that can't subdue one single person without shooting him in the back four times um or shooting him in the chest rather that's that's that's a tough pill to swallow right whether or not this guy had a gun in his pocket when he was going for it um and again i don't want to put myself in that situation i",
            "start": 1175.72
        },
        {
            "text": "that's that's a tough pill to swallow right whether or not this guy had a gun in his pocket when he was going for it um and again I don't want to put myself in that situation I don't obviously wouldn't react well because I'm not a trained police officer but it's this reminds me a lot of the um um I forgot the gentleman's name the guy from uh BART station the one that was over in Oakland uh yeah Oscar Grant Oscar Grant thank you um this is just it's a hard job for any human being to do we're putting a lot of pressure on police we're putting a ton of pressure on them like I don't I would not react well in a situation where someone brandished a gun either we all like to think we would we'd all like to think because we're conditioned by movies",
            "start": 1210.08
        },
        {
            "text": "ton of pressure on them like I don't I would not react well in a situation where someone brandished a gun either we all like to think we would we'd all like to think because we're conditioned by movies that we'd go into action and have some sort of amazing Kung Fu prowess but in reality we get shot or killed or worse but I mean I think the thing here with the cop though it's like if the cop says don't move or I will shoot you and keep moving and I get that you're moving because you're scared and because because you're terrified because you got yeah you got two guys that are probably using excessive force on you when they should I mean that that's the problem I mean he's in a bad situation like would he have been **** regardless you know history says yeah like looking back at all these other things that's see that's the bigger issue right is it's not necessarily the gun control issue and it's not necessarily the police brutality issue where there is an inherent racism um",
            "start": 1249.48
        },
        {
            "text": "all these other things that's see that's the bigger issue right is it's not necessarily the gun control issue and it's not necessarily the police brutality issue where there is an inherent racism um there's an there is a racism that's that's the factor here right um and that I think is the root of of the issue that we're that we're trying to deal with as a society right now is that there's an institutionalized racism against minorities specifically black people in this in this occasion that we have to address like it's such a bigger issue than any one specific example these are the what you're seeing here is sort of the the effect of that bigger issue is the effect of these of of of our society trying to keep these impoverished areas down and and and impoverished we need to be going you know there's a lot more that can be done in that regard there's a great guy that we actually should try to get on the podcast he's been making the podcast rounds and I forget his name I'll look it up",
            "start": 1285.64
        },
        {
            "text": "know there's a lot more that can be done in that regard there's a great guy that we actually should try to get on the podcast he's been making the podcast rounds and I forget his name I'll look it up in a second but he's an ex Baltimore PD officer who talks a lot about this subject and I'll I'll shoot him over to you so you can listen to the podcast I'm talking to but it's fascinating to hear sort of the the mentality that police officers have when they approach PE minorities specifically black people in Baltimore uh and how they are looked at almost almost prayed upon um and it's it's **** terrifying and it's absurd right and they always to use to and I'm going to misquote him a little bit but the the general idea is right we always talk about statistics we talk about things in statistics right where specifically it's statistically higher that people there's higher crime rates in in in in uh areas of higher po poverty right with higher minority groups um and he talks a lot about",
            "start": 1326.72
        },
        {
            "text": "right where specifically it's statistically higher that people there's higher crime rates in in in areas of higher poverty right with higher minority groups um and he talks a lot about how that's a skewed statistic because because the officers are told that they're also told to go make more arrests with people in minorities right so they're harder on people that have uh weed on them they're harder on people that are doing smaller infractions than they would be uh in typical you know higher wealth areas um and so they're they're basically skewing the statistics so there's all sorts of factors that's good that goes into play here that's not just the one-to-one connection um however I do agree with that point of more civilian oversight because I don't think it's very possible uh for police to necessarily police themselves I it's it's hard like I can understand putting yourself in a DA's standpoint or a government official standpoint you don't want to be the guy that",
            "start": 1361.0
        },
        {
            "text": "uh for police to necessarily police police I it's it's it's hard like I can understand putting yourself in a DA standpoint or a government official standpoint you don't want to be the guy that cracks down on the police because that's a bad look too um which is what so **** up yeah you do that I was trying to find frantically i' seen in the things from tweets today there was somebody who put up an article of why black people don't when the why because like my I'm with you on to an extent probably the whole extent not whatever we're not there but like anytime an officer approach me it's no sir yes sir and I'm very rigid right where it's like I don't understand what's happening before that video to make him continue to move and not do this or that that's that's the thing is that you know I'm loathed to render a verdict on this as of yet because the video seems pretty cut and dry but there's a lot of important evidence missing right now sure a I hate this term of the I was reading",
            "start": 1400.84
        },
        {
            "text": "I'm loathed to render a verdict on this as of yet because the video seems pretty cut and dry but there's a lot of important evidence missing right now sure I hate this term of the I was reading about this the anonymous the anonymous there is no such thing as an anonymous 911 call it's nonsense they know exactly who made that call there's a number Trac you can't block your number from a 911 call like they know who made the call it's recorded they have all that so that's first of all number one nonsense so you need to go to that person and figure that out if was made in a pay phone you need to do some investigations you need to figure out who made that call and figure out what they actually saw that's number one that's important so I hate this thing about the anonymous 911 call never heard of that in my life number two uh there's a dash cam video that's going to give us great perspective on this as well um and we're going to need that as well we need information about what",
            "start": 1444.64
        },
        {
            "text": "never heard of that in my life number two uh there's a dash cam video that's going to give us great perspective on this as well um and we're going to need that as well we need information about what happened there my my gut instinct tells me that these guys messed up with this guy but he was armed but in Louisiana as long as you're 18 and not a felon you can have a gun on you and you can have it in your pocket or whatever you don't need to like tell anyone that you have it it's an open carry state so that's so you have to go into those situations Baton Rouge or in New Orleans or New Orleans or wherever knowing that whatever Parish you're in there parishes being counties in Louisiana that you that you um are going to be dealing with some pretty volatile people regardless of where you're at because and they could be armed so I so there's an extra tension there as well sure the thing the reason why I don't want to render a verdict because I need more information is this because",
            "start": 1479.4
        },
        {
            "text": "at because and they could be armed so I so there's an extra tension there as well sure the thing the reason why I don't want to render a verdict because I need more information is this because you brought up the Ferguson thing yeah what happened in Ferguson was a tragedy in the sense that in a specific sense that it renewed or renewed or reminded us there is a lot of racial tension in the United States still but people forget that Michael Brown's murder was done by a guy who was not even charged with the murder because both the local and state authorities and the federal government said that he protected himself and acted in self-defense and that's the thing that everyone seems to lose sight of but we acted so quickly and so hastily when we talked about Ferguson that we didn't let the facts play out and even the federal government said that that guy didn't do anything wrong you know and that's that's the thing that that's that's the thing that's like a lot of things with Ferguson cuz I",
            "start": 1517.76
        },
        {
            "text": "play out and even the federal government said that that guy didn't do anything wrong you know and that's that's the thing that that's that's the thing that's LW a lot of things with Ferguson cuz I was the one who I think did the Ferguson conversation or talked about about a lot about that and I stand by everything I said in the sense that there is racial discrepancies in this country that need to be rectified there is a deep seated racism in the United States against black people specifically that goes back hundreds of years long before any of our families were even here um and that there are brutal police killings you talk about Eric Garner Eric Garner in New York City for instance totally just murdered like there's no doubt about that but I think that there's a little bit of reluctance with the verdict on that by the way I believe I think no indictment yeah I think they got off um like so like with Eric Garner I think that that was a little more but here's the thing about it",
            "start": 1551.84
        },
        {
            "text": "with the verdict on that by the way I believe I think no indictment yeah I think they got off um like so like with Eric Garner I think that that was a little more but here's the thing about it and here's why I want I'm a little more reluctant is because with Ferguson everyone kind of jumped into The Fray and didn't let the F the facts play out and if you read about what happened with Michael Brown what happened with that police officer like the what happened was that both the local and state authorities and the federal government found his Witnesses corroborating his version of the story that he was being rushed and that he had shot him that guy in self-defense as totally credible and found that all the a lot of the witnesses that said that he wasn't acting in self-defense not credible and in fact some of those Witnesses said that they didn't even see it after all that all happened and so when you see that kind of stuff play out over months and months and months it",
            "start": 1586.0
        },
        {
            "text": "not credible and in fact some of those witnesses said that they didn't even see it after all that all happened and so when you see that kind of stuff play out over months and months and months it makes me a little more reluctant to say like okay we need facts here my gut instinct tells me what happened in Baton Rouge down in Louisiana is total nonsense and those guys are probably going to get in a lot of trouble for what they did but I think the general public might be a little more reluctant to jump into this and get a little more mad because they might feel burned by what happened in Ferguson when we all made assumptions about what happened there and it didn't happen the way that everyone thought it happened see I wish that was true I bet that so many people who jumped in were that was the thing to be mad about for the day don't don't even know that okay in the end it didn't turn out that it was fine you know not fine but you know what I mean that there W that it wasn't the same as",
            "start": 1621.8
        },
        {
            "text": "thing to be mad about for the day don't even know that okay in the end it didn't turn out that it was fine you know not fine but you know what I mean that there W that it wasn't the same as the guy being choked in your right to your point I want to play a thing for you from did you see this from Hot 97 today no just the gentleman's name I was talking about was Michael Wood Jr oh okay so you can hear him uh he's been on numerous episodes of Joe Rogan's podcast but he's made the podcast around so definitely look him up he's got some very interesting and unique perspectives so what you were talking about you know how tough it is to get an internal review from the police and have an honest thing from that uh today on Rosenberg radio on Hot 97 uh they were talking to a police expert about it or I think former police expert or what do you mean former officer maybe just radio expert now and I thought this was just telling in a good point of like why everything's so **** up right",
            "start": 1650.8
        },
        {
            "text": "about it or I think former police expert or what do you mean former officer maybe just radio expert now and I thought this was just telling in a good point of like why everything's so **** up right now as an officer yourself it looks bad no you know I I will tell you that it's um can you say the words it looks bad I have to say this this is the problem I have with police officers and no disrespect to you y'all don't ever want to point at someone else and say you can't do your job well I can tell you right now if I heard a radio personality get on the air and do something irresponsible i' go that's a bad radio personality he does a bad job police officers never want to say when y'all do a bad job so that's the reason the public thinks all of you are bad because you won't ever call someone out and say they murdered someone in Cold Blood it happened again and until you guys start taking responsibility for your own people in the street are going to be upset instead so how about y'all",
            "start": 1686.0
        },
        {
            "text": "out and say they murdered someone in cold blood it happened again and until you guys start taking responsibility for your own people in the street are going to be upset instead so how about y'all lead the movement instead how about instead of people rioting police officers get out in front of it themselves and you guys are the first ones on the front lines that's what should happen instead of you struggling to say well I don't know it could be they murdered that man we just saw it again jumping to conclusions yeah I mean I I honestly think I think that they're probably right but that's not the way our system works it's beyond a reasonable doubt they have to be indicted and they have to be tried by a jury of their peers so I don't agree with that particular approach either because there is there is significant information missing are they going into what did the police officers see before this happened was the guy brandishing a gun what do they like and again because this just this is",
            "start": 1729.08
        },
        {
            "text": "there is significant information missing are they going into what did the police officers see before this happened was the guy brandishing a gun what do they like and again because this just this is literally 24-36 hours old we just don't have all the information yet there's so much information missing I don't know my like my if someone was like if someone and I hate to use this terminology with this kind of situation someone put a gun in my head and said these guys would murder this guy or not I'd be like yeah they probably did you know but I just don't know how did they know like there's certain things in that video where I'm like okay how do they know where the gun was he that guy went right to the gun and just got it right out of his pocket did the guy reach for like there's there's a possibility they saw it right looked like he was reaching like as he was bleeding it looked like he was reaching for that pocket and and I knew from looking at that video I thought the gun was in that pocket because",
            "start": 1770.56
        },
        {
            "text": "it right looked like he was reaching like as he was bleeding it looked like he was reaching for that pocket and and like I knew from looking at that video I thought the gun was in that pocket because it looked like he was reaching for that my take my my take on it was I'm sorry I'm still I just want I want to just so I'm clear like that maybe not what happened maybe that's probably not what happened but there's all this information we don't have we this **** is a tragedy when people die it's a tragedy and serious but so too are the are are there other uh factors that have to be taken into consideration we cannot jump to conclusions mob Justice is not the solution to this you know and we saw how that played out in Ferguson that city was **** destroyed yeah and a state and local uh jurisdiction refused to indict the man and the the Department of Justice said he didn't do anything other than act in self-defense but we **** raised the Earth for months over this thing and I'm not",
            "start": 1804.36
        },
        {
            "text": "refused to indict the man and the Department of Justice said he didn't do anything other than act in self-defense but we **** raised the Earth for months over this thing and I'm not saying that that Michael Brown was a **** criminal you know I'm not saying Michael Brown deserve to die what I'm saying is that cop made a split-second decision in that time and as the son of a **** civil servant my dad is a New York City fireman I know that these people go out out every day and risk their lives and a lot of people don't appreciate that there's more than one side to this equation so while you know I think Darren Wilson or Darren Wilson who's the man mentioned here I think he was the one that was like clearly involved in the shooting of Michael Brown that's that's a **** terrible thing Eric Garner it's a terrible thing but not all these things are created equal either and so we have to we have to just take it on a Case by case basis I'm not I'm not exing police",
            "start": 1844.16
        },
        {
            "text": "\"Terrible thing Eric Garner, it's a terrible thing, but not all these things are created equal either. And so we have to take it on a case-by-case basis. I'm not ex-ing police officers like Tim; I've had bad experiences with cops in my time too, and I don't, and I understand where people don't trust them, and I certainly understand why minorities in Black America do not have a trust for cops. But we cannot jump to conclusions because we need all the information that's going to strengthen the argument later on, and that is going to strengthen the case. And not put all these things together just to make it numerically stronger when all of them aren't created equally. We need more information, and hopefully like Greg said by the time this publishes, and by the time everyone sees this on YouTube, there's more information. But I am not comfortable after what happened in Ferguson to just jump to conclusions and say like this is the way it went down.\"",
            "start": 1878.08
        }
    ]
}