{
    "id": 2192,
    "video_id": "k9g9R77nH_E",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Jamie Kennedy"
    ],
    "title": "Greg's Mom Tries PlayStation VR - Kinda Funny Plays",
    "description": "Greg's Mom has never tried a VR video game... so let's see what she thinks of Batman: Arkham VR, Until Dawn: Rush of Blood, and the Kitchen demo.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nGreg's Mom - http://www.twitter.com/jpk700\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1479920406,
    "duration": 2737,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/ kindafunny games I'm one of your hosts Greg Miller alongside my mom Jamie Kennedy hi everybody hey Mom how are you good Mom what is your experience in the world of video games slim to none you had a Wii that was it you had a DS you bought the DS but do you play little hand yeah every once in a while you bought it all by yourself I play the brain game in it you got a horse game too oh yeah and you couldn't figure out how to feed the horse right so and that was the end of that game well now I can get a new horse every once a while R but you still can't feed him right right yeah that's the problem with that never figured that out well have you heard about PlayStation VR um yeah I have what do you know about PlayStation V very little it's supposed to be virtual reality 3D reminds me of the um ride at Disney World soaring soaring California or whatever right Kevin you're a big Disneyland nerd yeah soaring I I rode that",
            "start": 0.08
        },
        {
            "text": "very little it's supposed to be virtual reality 3D reminds me of the um ride at Disney World soaring soaring California or whatever right Greg you're a big Disneyland nerd yeah soaring I I rode that I have a feeling this is going to feel like that okay okay and I saw one episode not episode one filming of some poor lady probably about my age where they slap these on her and put her on a roller coaster and she was freaking out in the chair okay I'll make sure you fall out your okay great uh we're going to play it we are big fans of PlayStation VR of course full disclosure PlayStation did send us this unit for review in Let's Plays like these and not that it mattered we would have bought them on our own anyway um so let's let's get going all right so what you want here is this part to rest on your forehead okay okay now I'm going to help you do it obviously I'm going to slide this over your head some of it you're going to have to we're have to you're going have to talk to me through",
            "start": 41.32
        },
        {
            "text": "on your forehead, okay, okay. Now I'm going to help you do it. Obviously, I'm going to slide this over your head. Some of it, you're going to have to... we're going to have to... you're going to have to talk to me through all right? Wait, okay. So like that, okay. Yep, is this... I'm going to bring it down like this, okay, okay. Good, that brings it out here though I can see the floor and stuff, sure, sure, sure. But then that's good, yeah. You can slide in like that right? Wait, too much, okay, okay, okay. Got my eyelashes, okay. Well, here, give me your hand right here. Is a button, hold on. Give me your finger... right, right down. Stop, stop. It's just squeezing. I didn't even tell you what the button does. There you go. See now I'm going to tighten this to the back of your head, okay. This is like putting on a helmet on the kids at horse riding and now you use that button to bring it in as close as you want it as far away as you want it. I like it closer but my eyelash... your okay, that's good enough. Is the image clear enough? Oh yeah, Okay cool so",
            "start": 87.24
        },
        {
            "text": "now you use that button to bring it in as close as you want it as far away as you want it I like it closer but my eyelash your okay that's good enough is the image clear enough oh yeah Okay cool so then now we got to Center you in the thing Kev this is going to be what's the B Bat symbol the Batman symbol you're you're going to be Batman you're about to become Batman oh boy what you are Batman I know I am Batman uh Kev I'm gonna need I'm glad I can't see anybody actually I guess I can well can you be able to see the TV we need it's going to get better than this even but if you stare straight ahead for two seconds all right so oh no not mom does she have to stare down o there's a it looks like she should go forward a little bit exactly but we can't do that unless we move the desk so I can I move the camera yeah exactly no that's what I'm saying all right mom so just for 2 seconds I need you to look straight ahead then you can look wherever you want and just have a ball with it",
            "start": 126.6
        },
        {
            "text": "I can move the camera, yeah exactly. No that's what I'm saying all right mom so just for 2 seconds I need you to look straight ahead then you can look wherever you want and just have a ball with it. You can stare down as long as you and I swear there's cooler things you're going to see than this room with the back why you want to take it all in, I know okay we don't want to move the camera while she has it on or she I mean exactly shut your eyes okay they're closed. Move the camera yeah don't we'll tell you when to open your eyes what camera are we moving the camera that's uh that puts me into this thing yeah cuz we got to get you c yeah exactly so go ahead you can open your eyes again it's way over there now okay uh hold on hold on I got to I can do it by hold on okay so look back and straight ahead Mom all right cool. And then I'm going to do this shut your I see two spots in the middle though I see the round glowing Bat symbol and then there's an offset of it with an X next to it yeah",
            "start": 171.8
        },
        {
            "text": "Greg's Mom all right cool and then I'm going to do this shut your eyes I see two spots in the middle though I see the round glowing Bat symbol and then there's an offset of it with an X next to it yeah it's because we're trying to get you into VR I hold no it's not you, options should do it right um I'm fogging up the visor please position yourself as close as possible you're fine it's not you to oh it's not centering right when I'm doing it's not any better it's still off-centered correct okay hold on shut don't shut your eyes all right hold on my eyes are shut there we go that should be is that centered now well no now I see Batman: Arkham VR but is that centered in terms of what you're seeing oh yeah I see everything fine there and then is that better no same and if fogging up the visor okay you uh at home I slide it off and wipe it down oh okay well I was well now they cleared up when I did that little is that hurt no but I know what you're doing well I'm trying oh God I got to head in the green screen well",
            "start": 218.6
        },
        {
            "text": "Greg's Mom Tries PlayStation VR - Kinda Funny Plays. It off and wipe it down, okay? Well, I was well now they cleared up when I did that little is that hurt no but I know what you're doing well I'm try oh God I got to head in the green screen well see when you push this down it makes this pop out so I can see the floor and stuff well see we're in a pickle I think no we're not okay my apologies do whatever you want you're in charge that's it okay now how do we tighten this a little bit there like that okay yeah exactly K what are you what's your now get me yeah exactly Target I know I said we stop the recording for a second well I want all this footage though oh okay this has been great well what I want to do is it looks like she's over it I am but yeah she's not I'm not in the center of it I feel like I need to move over here you go ahead and move over well no hold on no no because it's not even if I'm reading what she's saying turned white is that good symb yeah probably press mo button to continue go I'm seeing if it's like away from",
            "start": 276.68
        },
        {
            "text": "move over well no hold on no no because it's not even if I'm reading what she's saying turned white is that good symb yeah probably press mo button to continue go I'm seeing if it's like away from the edge actually that's worse now relatively all right cool I feel like I I'm sitting over the bed symbol am I supposed to be yeah you're over the bat you're supposed to be there okay all right all right so have you been recording the whole time oh yeah all right so so we'll just pick up right we'll cut out that last bit of like whatever is last like five minutes or so yeah exactly like if I lean like this I'm perfect cool can I lean like this for the game yeah okay okay you ready I guess all right we're coming back in I don't know what we're doing so you're you're Batman you already said you're Batman say it again I am Batman see there you go you know what you're doing so I'm going to put on headphones all right okay I'm going to leave one here like this I'm going to leave one up like this",
            "start": 326.8
        },
        {
            "text": "Batman says it again, \"I am Batman.\" See there you go. You know what you're doing, so I'm going to put on headphones all right. Okay, I'm going to leave one here like this. I'm going to leave one up like this, so you can still hear me. But you're getting it now. I'm going to give you your controllers. This is one controller. Oh, it's weird. I don't see your hands are mine. Oh yeah, yeah. But soon you'll see Batman's hands okay. Do these stay down here? Do I do them like this exactly? Yeah, yeah. But like, see how it says continue there and it's got a flashing red button right? Yeah, it's bring your thumb up. Yeah, bring your thumb up just a bit to that guy. You feel that? That's the button to hit so go and hit that to both of them no just the one please. Position yourself naturally. Your head is in it but this is where we can just angle the thing. Button to continue you don't have to try to stand sit up Mom. So close there we go. That's good. It says good, it's good yeah. It says so okay. Can I open my eyes? Yeah okay.",
            "start": 368.04
        },
        {
            "text": "we can just angle the thing button to continue you don't have to try to stand sit up Mom so close there we go that's good it says good it's good yeah it says so okay can I open my eyes yeah okay good good we're good good in both places all right so he continue again during C to play you can turn 180° at any time by using the motion controller what's the motion controller these things yeah 180° that's halfway right yeah 360 yeah cuz that's interesting I I I've never played it sitting before no we do am I supposed to put the strap on my if you wanted to be a **** thr away I'm not a **** whatever so then hit yeah the hit your confirm button again or I guess now try try that's back hit hit here I'm going to just hit buttons for you real quick see if that's what it's trying to get player position you how to spin around return to viewing forwards by using the motion controller all right now you can press the move button so which what's the move button this one up here or this one down",
            "start": 410.64
        },
        {
            "text": "Greg's Mom: position you how to spin around return to viewing forwards by using the motion controller all right now you can press the Move button, so which what's the Move button this one up here or this one down here no no the one you were on yeah yeah calibration complete recalibrate at any time by holding the Start for 2 seconds that Start button no but don't worry you won't have to recalibrate we're just running you through the first part of this I want to see your how you like it being Batman, I am Batman all right I'm glad you know the one Batman line like a pro Rockstar that means Rocksteady no I was saying like a pro clicking the thing you already figured this out pretty much what's happening what do you need I'm just seeing light ooh what was that it's raining yeah wow this is cool right yeah now if you were standing you could move free form oh God I got new hands you're Batman see I am Batman but I have no arms well yeah so if you were standing you could move 360 on your own like",
            "start": 464.44
        },
        {
            "text": "yeah now if you were standing you could move free form oh God I got new hands you're Batman see I am Batman but I have no arms well yeah so if you were standing you could move 360 on your own like what they were talking about earlier they said yeah oh is that what it was yeah now 360 but you can kind of still do it you don't have to worry about it okay good I was what town am I in you're in Gotham City that's where Batman lives oh yeah I know that okay you got the bat you're on Gotham City PD headquarters right now that's why the bat signal is behind you it is yeah turn yeah look over your there it is see oh okay cool yeah you can see that it says Gotham PD back there too yeah I know if you want if you want to stand we can stand we can move the chair around do stuff no no then I'll have celebrate won't I sure yeah forget it okay we went through that then hit your hit your uh move button there to keep going okay uh so what I I move my head and these things are bouncing back and forth",
            "start": 527.32
        },
        {
            "text": "celebrate won't I sure yeah forget it okay we went through that then hit your hit your uh move button there to keep going okay uh so what I I move my head and these things are bouncing back and forth why exactly you're CU you're selecting things okay don't worry calm down you're selecting oh my God she's gone crazy she's had too much fun with it already I need a drink you trust me you don't want to drink and play this game no if I did it would be really ugly so here so you just like staring down at the ground a lot I've no well it's I want to see what's under me okay no feet oh you know what it's gen one VR and like it would bring it okay so what am I trying to do here so go up to go up to yeah click right there on the manor so look at the Manor and hit that move button there you go we're going to drop you into the manor here and you're going to start now loading yeah exactly exactly do I get out of the rain then yeah good you're going to get to go to Wayne Manor ooh I liked Wayne",
            "start": 568.8
        },
        {
            "text": "going to drop you into the manor here and you're going to start now loading yeah exactly exactly do I get out of the rain then yeah good you're going to get to go to Wayne Manor ooh I liked Wayne Gretzky was rich I yes Bruce Wayne is Rich the way well that's how we got to Wayne Manor wasn't it I guess so yeah but I'm just saying like just saying just saying than of Gotham bye it's very dark what's it's a black screen do I know how to play the Piano when did you return talking to me yeah some awareness of your his name's Alfred you might have heard okay okay you do know that one's own bed would make for more comfortable I like how you look at him the entire time while he talks to you you're very respectful I appreciate that well I'm kind of checking him out sure well I mean that's the thing there's so much to check out in this this room in particular this world we have a situation but like bring up your hands I'll explain downstairs W yeah see they're all",
            "start": 613.96
        },
        {
            "text": "well I mean that's the thing there's so much to check out in this this room in particular this world we have a situation but like bring up your hands I'll explain downstairs W yeah see they're all bruised up cuz you're Batman but like now that you have these hands you can reach out and grab stuff if you want to grab the photo if you you can't grab Alfred you can grab the key from him right do I have to press up when I do that yeah oh she's going under the yeah you got to bring your hand up no it's fine no it's not we're learning together as we go and then you got to pull the trigger yeah this is going to be oh pull the trigger right right right yeah but it's you're disappearing from the camera's view interesting oh now I see the fingers oh look at that my hand moves yeah okay um Alfred could you help me out here and raise your arm up a little bit you dropped it on the ground oops just walked away no no it's GNA it's automatically in the yeah it's right there if you look on on the",
            "start": 665.12
        },
        {
            "text": "Could you help me out here and raise your arm up a little bit? You dropped it on the ground. Oops, just walked away. No, no, it's GNA... it's automatically in the yeah, it's right there if you look on the piano looking funny on the piano. Oh yeah, okay. So do I have to grab it? You do. I can't. I don't like doing VR sitting down at all. You want me to stand up? Uh, we have to recalibrate everything. Yeah, bust the table. Can't do it under the table. I can't reach it here. Give it to me for a second. Should you slide the table? Turn it sure. Right here. We can... that's exactly what I was saying. Well, anyways grab the photo. Screw off that for a second. I got to stand up. Hold on, Mom. They're going to do St. You want to let's just move. Let's just re-do it and have her stand well. I was just going to move it over. I know but even still like right now she's reaching for things and they're just out of reach. Yeah, um... Rush of Blood would this be a problem? No sitting no you don't move like that okay in the kitchen you're",
            "start": 702.36
        },
        {
            "text": "but even still like right now she's reaching for things and they're just Out Of Reach, yeah um Until Dawn: Rush of Blood would this be a problem no sitting no you don't move like that okay in the kitchen you're sitting anyway see I can't reach the phone see it's ringing well we're sorry Mom all right no Mom don't show yourself no all right so Batman: Arkham VR is a really cool demo but maybe we'll drop you into the other two instead cuz those are sitting and they shouldn't be a problem we don't have to worry about redoing everything does that make sense to you sure whatever all right so hold on let me look around before you shut me off okay I just want to check out the banner here cool yeah you got it oh cool why's the fire go out that's the Riddler oh look at that I can open something yeah see something's not in your way for a change yeah wait what was that no no no what is it did you think you found me I'm buried beneath so many layers of encryption that the result resembles a",
            "start": 774.68
        },
        {
            "text": "not in your way for a change yeah wait what was that no no no what is it did you think you found me I'm buried beneath so many layers of encryption that the result resembles a magnificent TIE Fighter of protection TIE Fighter who the hell are you to puncture my defenses by matching pictures on this board I'll just send you away with some junk data I found lying around the place can make you stutter H so what am I doing what did he tell you I don't know I wasn't paying attention okay I got a match there you go I got a match resume press that okay I got a hole in my thingy you put a globe hole Yeah why are you guys laughing at CU it's funny to see how you react and you decided to Pet the globe and stuff well yeah and it surprised me because you hear the noise where the P oh the piano's over you can go go over yeah Point your wand at it and then hit the move button again there you go you're back yeah here just rotate it with me Kev cuz I want her to play this as a cool",
            "start": 832.8
        },
        {
            "text": "\"Over you can go, go over yeah. Point your wand at it and then hit the move button again, there you go, you're back yeah. Here just rotate it with me, cuz I want her to play this as a cool demo, a damn table we shouldn't have done him sit and I knew better okay uh what do I need to do? Sit back, sit back yeah we're going to move the table we're going to move the table so it's out of the way ready yeah okay uh we're rotating it this way sure okay all right now now you have nothing in front of you. So should I stand up no no let's try sitting still should be fine okay I'm afraid I'm going to fall out of the table I know that's why I'm here that's why I'm here so now oh ow yeah that happens I still can't answer we didn't rotate the table enough wait there the edge of the table yeah yeah okay. I should be able to get the got the key all right what's it two the piano oh that's me now what do I do turn it oh is it unlocked there you go and then lift the thing like you would a real\"",
            "start": 914.36
        },
        {
            "text": "yeah okay I should be able to get the key all right what's it two the piano oh that's me now what do I do turn it oh is it unlocked there you go and then lift the thing like you would a real piano no see I still can't you told me to grab the picture with I was just screwing around you don't have to don't worry about it whatever I thought okay your mom probably stand right now if you want to do it yeah I just don't we have to recalibrate probably I mean I'm fine recalibrate I don't care this a good moment right here I can't answer you little **** hello I hit the bat symbol oh **** now what have I done this is cool welcome Su sequence initiated biometric signature required I got you fat suit version 7.13 ready for deployment do I have to go up there to do it yeah reach out to it here you want to stand up there you go you got it am man on the floor yeah I can't tell I got you yeah you're on the floor okay why is it not there now turn it and put on your chest",
            "start": 964.36
        },
        {
            "text": "Greg's Mom is trying out PlayStation VR for the first time, so let's see what she thinks of Batman: Arkham VR, Until Dawn: Rush of Blood, and the Kitchen demo. She's wearing the headset and can see her own reflection in it. The gauntlets are actually gloves that she needs to put on, and then she has to calibrate the system by looking into the mirror with her face. She's doing great, but apologizes for not understanding something - apparently, the headset moves with her head one-to-one. Upgrades include improved navigation of the environment and re-trial of distant objects.",
            "start": 1064.2
        },
        {
            "text": "Too sorry, no, no, you don't apologize, you're doing great. How's it feel? Upgrades include pens with the navigation of environment and retry of dist object. You do you do, but they're going to have you test quick what am I doing? Oh, targeting yep, just P there you go, gr gun targeting calibrated cool beans. So now I can do this, yep. How do I make it stay there though? I believe it's the move button when it's at the side. I would just shot myself in the foot again. Well, no, well don't hit the trigger okay. So look down at your side and then put it there and then hit the button that you were using to confirm stuff is that what does it see? How it's something glowing back here, that's where that's where it wants you to go. It wants you to put it there that way no still there it's cuz now we're out of the camera view again it might be there too low because expect to be sitting so might be lower let's try this let's try this let's try this here let's try this give me that for one second okay mhm Welcome to you.",
            "start": 1139.24
        },
        {
            "text": "View again, it might be there too low because expect to be sitting so might be lower. Let's try this. Let's try this. Let's try this here. Let's try this. Give me that for one second. Okay. Mhm. Welcome to Reality. So look at your head at the standing person. Standing person, there you go. Stand on Sy. You're doing it. Stand on the pleas. Stand naturally. You're fine in the celebration. Complete it's back to you. It should be easier to do now. Forensic scanner ready for deployment. Software update allows for Crime Scene visualization at multi-layer analysis. Calibrating Diagnostics, please scan Target. Going to hold it. I did, but continue to hold it. See it's like filling in. Yeah, it's like a progress bar on a computer. Okay. Diagnostics calibrated. Oh well then I got to change hands. Bangs ready for deployment aerodynamically designed for Rapid. I just felt it. No, it's okay. Just they're supposed to go behind you. We've been playing fast and loose with all us. Calibrating targeting, please use a batang to hit the",
            "start": 1209.64
        },
        {
            "text": "Designed for rapid I just felt it no, it's okay. Just they're supposed to go behind you. We've been playing fast and loose with all this calibrating targeting. Please use a baton to hit the target. Bangs equipped to utility belt. Hit three targets to continue calibration. I like, don't tell her I like to. I want to see if I want to see if the controls are intuitive enough for her just to know. Sorry you're a piece of **** Kevin. We hate you. B rang targeting calibrated. I'm a hell of a shot. I tell you what, you are the Batman. You enjoying it though? Yeah, what is this? This is Batman calibration complete. No, what's this? Oh, that you want? What does it look like? It looks like a handle; you should probably grab and pull. To go going down again. No, I wish this was cooler. I could actually feel me... the fan not turned at you. Kevin's on it. I know he always is. Look straight up, like yeah, like exactly. Stay why taking photos of us? Thank you, Keevin. I can really feel it now. Now you're really in the zone.",
            "start": 1301.88
        },
        {
            "text": "the fan wasn't turned on Kevin's on it I know he always is look straight up like yeah like exactly stay why taking photos of us thank you Keegan I can really feel it now now you're really in the Batcave what song is this Mom I don't know ooh there's BS I hate BS you were saying you are Batman I am Batman but I don't like that gotcha why are you laughing Kevin uh Greg cool Greg just came in here wearing a championship belt cool Greg wears cool things see now I feel like I'm in the Batcave because of the breeze yeah so now all the stuff on the table you can interact with you can grab you can do whatever you want why would I why do I have a scanner B you must have reached down there and pulled the trigger at some point you know how to put it away okay what is this thing around over there no okay oh target range I'm sorry I don't want you yeah watch out sry the table's in the way okay yeah no I'll just do this one I have to do all three of them yeah",
            "start": 1376.24
        },
        {
            "text": "Is this thing around over there no okay oh target range I'm sorry I don't want you yeah watch out sry the table's in the way okay yeah no I'll just do this one I have to do all three of them yeah I think it's like a it's like switches to turn them all on almost there no no no Batman just drooling bangs all over the place SL the table over can you get there now I'm reaching under the table so so then reach back try again the table's further out now there you hey what am I what do I use throw your bat right oh I am yeah remember 30 yeah ah sir you're here shut up already please let me know when I there's no time for your case give me more to your right yeah oh I got to keep going yeah oh yeah 30 seconds to get as much as you can that's a bad one no I didn't know that I know I am already thank you be careful with those Highs shut up Greg I got it I don't I'm more worried about you punching this the equipment above you and hurting your hands I'm sorry not everything I say is a joke mom",
            "start": 1466.0
        },
        {
            "text": "you be careful with those High shut up Greg I got it I don't I'm more worried about you punching this equipment above you and hurting your hands I'm sorry not everything I say is a joke mom well I don't know that donation ended now you want to keep me back man or try something else I'll try something else this is cool though okay cool I really like this so now I'm going to walk oh so if I open that that's probably where this goes in mhm let me do that first okay oh maybe I got to grab this I think you just have to tap it well I with your free hand now because you got to do like it's going to want fingers there oh pick it up I'm sorry grab it it's like a tablet maybe if I remember this correctly there you go and then now tap it with the other hand all right let me put that down good smart oh damn it I'm B Rings it's stand down there all right fine all right good I can't lay it down huh what do I do with it no no no no okay open that's what I want you to do why won't you open how",
            "start": 1570.88
        },
        {
            "text": "Greg's Mom: smart oh damn it I'm B Rings it's stand down there all right fine all right good I can't lay it down huh what do I do with it no no no no okay open that's what I want you to do why won't you open how do I open it Robin was investigating theen following a lead I lost contact with Robin you say hey I'm talking to you hit the red button I'll keep talking to you I'm afraid I have rather concerning news Robin failed to report in last night and now I'm unable to reach Nightwing as well who's not responding it could be sir but is unlikely not to respond you're right Al hopefully the Batcomputer can help you pinpoint their location okay this is the back computer no no the Batcomputer's over to your right it wants you to grab your gun Now look up this thing no that's something different but see how it's got the little target over there back computer oh up there that's Case Files look to your left a little bit and then there you go right there oh there okay you'd have to shoot your way over there if you",
            "start": 1619.96
        },
        {
            "text": "Greg's Mom has never tried a VR video game... so let's see what she thinks of Batman: Arkham VR, Until Dawn: Rush of Blood, and the Kitchen demo. little Target over there back computer oh up there that's Case Files look to your left a little bit and then there you go right there oh there okay you'd have to shoot your well way over there if you want what do I got to do go grab on the your right hip is that your grappling hook no that's a bat rang you grab your grappling hook off your right hook your hip then shoot it at that thing there go stuck Alfred oh you're out you're out of the camera again maybe screw it okay let's be something else let's do something else oh oh she got it now what is this you're over at the back computer look down initializing database ooh I thought I was wearing that you are look to your uh right there there's a little computer screen with like people you can touch and learn about that Robin Tim AKA Robin if you look back then he'd be back you's location tracker is that what I'm supposed to do looking for him you're looking for Nightwing thought it neither one of them showed up Nightwings tracker could",
            "start": 1684.32
        },
        {
            "text": "you look back then he'd be back you're location tracker is that what i'm supposed to do looking for him you're looking for Nightwing thought it neither one of them showed up Nightwing's tracker could still be online okay so i go back there is this Nightwing yeah it's Nightwing Richard Grayson AKA Nightwing no Dick Grayson was always Robin yes Mom but then he got older and he left in a huff and became Nightwing then Jason Todd became Robin then he died then they brought in Tim Drake Nightwing he left because Damian Wayne showed up somewhere in their Superboy Prime punched reality he brought back now i didn't bring in spoiler for a while Stephanie you know she was doing her own thing then she got pregnant but she wasn't pregnant then she came back she was realized i'm not listening to you i apologize Talking Heads all right you want to do something different yeah i feel like i'm going to fall off this platform i'm going to hit the button okay okay what' you do we're going to do Until Dawn: Rush of Blood",
            "start": 1755.0
        },
        {
            "text": "Talking Heads all right, you want to do something different, yeah. I feel like I'm going to fall off this platform; I'm going to hit the button. Okay, okay, what' you do? We're going to do Until Dawn: Rush of Blood now. Oh, yeah, this isn't scary; it's just a head. You've seen worse; it's a floating head doll head. I think this is better than sitting. Is it y okay? You want to take off the headset and sitma or do you want to just have me guide you back? Just guide me. Okay, backwards, backwards a little bit there. There you go, your Center y okay. I want to sit here; where are you? I'm right here. Hold those yep thanks. Supermassive Games okay, there's one, there's the other. Thank you. Uh-oh, I hit the button by that's fine. No, we're ready; we're jumping in here so you're fine. I'm going to turn you just a little bit more to Center. You a little bit more. The camera okay, there. So now you want to do? You're doing with the motion controller. So look, there you go hit your move button. There you go, calibration what is",
            "start": 1815.88
        },
        {
            "text": "\"Bit more to center you a little bit more, the camera okay, there so now you want to do with the motion controller, so look, there you go, hit your move button, there you go, calibration. What is this? Oh, extend your arms like the model, okay, then press the move button, add both of them or just one, one apparently, then do level select, so go all the way to your right, nailed it, and then keep checking we don't want that one, you want Hotel Hell, great. Oh, shush, let's go back to normal easy, that'll work, come on over here, okay, no shame in going I didn't was there an easy option there, damn it, it's okay. And also for this one, you don't have to reach all the way out like you are, you can keep them close, I'm moving like you can see it, but they weren't what they weren't going that's why I reached out to get them to move, but oh this is a ride, oh I see, I got feet out there shooting try shooting right now reach out.\"",
            "start": 1875.4
        },
        {
            "text": "can see it I think but they weren't what they weren't going that's why I reached out to get them to move but oh this is a ride oh I see I got feet out there shooting try shooting right now reach out and hit X or not X I'm sorry the Triggers on the back there shoot fire I hate this you know that right what shooting stuff you love shooting stuff you have a gun I know but I hate roller coasters okay so for reloading is it have to be like a jerk motion like that okay I only played this really briefly at stuff there you go Antonio Banderas style so when it Go glows red that means she's low on ammo okay good to know what am I supposed to be shooting at oh you'll see oh okay you can shoot Birds I don't want to shoot Birds they're not good Birds they're zombie Birds pretty clearly there you go so I'm looking for the ex's huh yeah of Hell of Hell there you go I'm getting jacked in the head you probably are you could have saved him Mom you let that happen **** you told me it wasn't scary",
            "start": 1937.04
        },
        {
            "text": "I'm looking for the exit, huh yeah of Hell of Hell there you go I'm getting jacked in the head you probably are you could have saved him Mom you let that happen **** you told me it wasn't scary you lied you saw that one coming a mile away hell was that you got a shotgun oh I do oh okay don't like these things I don't go to haunted houses I don't go to haunted house I don't ride **** get out of the way Bo I don't get very many shots do I well the shot shotgun only has two shells yeah that's it I forgot how do you switch weapons uh I don't think you can switch it you switch by gotcha okay I know something **** is going to jump out of me here how come I oh I do have two okay and I only had one weapon **** **** going want to dodge the you don't want to dodge the ran dare you don't fall out your chair okay well that's falling out of your chair pretty much oh **** I'm going to close my eyes you're doing great mom I'm right are you enjoying yourself no is it scary",
            "start": 1996.76
        },
        {
            "text": "don't fall out of your chair, okay? Well, that's falling out of your chair pretty much. Oh, **** I'm going to close my eyes. You're doing great, Mom. I'm right there with you. Are you enjoying yourself? No, is it scary? Yep. Does it feel like a real roller coaster? Yep. Tell me, it's like that stupid \"Ride\" at Disney World, and the \"Space Mountain\" of course - that was the scariest ride there. Oh God, no! No, I'm not even looking. You just **** kill me. I need to sit up, okay? Okay, please don't hit me in the face. I don't know where your face is so I can't make any... stop being psycho about reloading. Stop being crazy. Feel like you're going to let me die? Keep out! No, **** I'm shutting my eyes. Oh yeah, now you're going to stop making me go backwards, aren't you? I hope the people who are watching this are enjoying what scared the hell out of your mother. Yeah, they are good. Like, subscribe, share... I think you want to kill the birds. These guns need to be calibrated. Oh, they're not doing right. No, there - if I pulled them right, that's part of the problem. Okay, yeah.",
            "start": 2129.12
        },
        {
            "text": "they are good like subscribe share I think you want to kill the birds these guns need to be calibrated oh they're not doing right no there if I pulled them right that's part of the problem okay yeah that's yeah I don't like this ducking how am I supposed to duck and shoot close my eyes again I refuse to do this one o open the gates thank you made to the hotel is that a good thing well I mean it looks like a haunted horrible hotel but I mean you made it this is not funny and then you touching me that I'm trying to help I I don't you to fall the chair it's not ever added a scare effect to help you not die how'd your mom pass away PlayStation VR blow your **** head off doing great m you **** I'm an old lady get out of here how can your arms leave giving you head shots why aren't you dying there you go he survived are We Done Yet you can be you want to stop this one it goes on you're still killing stuff we got more demos for you one more is it not as nasty as this no",
            "start": 2238.96
        },
        {
            "text": "\"Aren't you dying? There you go, he survived. Are We Done Yet? You can be, you want to stop this one. It goes on. You're still killing stuff. We got more demos for you. One more - it's not as nasty as this. No, it's worse. Oh wait, there's a lad flying in. These all right, I died. Huh? Yeah, well, you did great. You made it really far. Kevin, how'd she do? Do fantastic, thank you, Kevin. All right, shut your eyes or don't - don't freak out. I'm just doing this again. Okay, you okay? Yeah, still with me. Yep. Now I'm watching Until Dawn: Rush of Blood. That was what you were playing before. Oh, Russ of blood... yeah, you like it? Yeah, actually I did. I don't like the roller coaster part though. This one's another scary one, but it's not roller coasting. Okay, I'm going to have some **** jumping at me again. Huh? Yeah, great. They're going to be some **** jumping at you. What do I have to beat him with? Uh, nothing. Pu's calling... tell you're you're you're shooting ****. You can't help right now. Okay, well, I can't even answer them because I can't read.\"",
            "start": 2353.64
        },
        {
            "text": "Jumping at you, what do I have to beat him with? Uh, nothing. PS calling tells you're you're you're shooting... You can't help right now. Okay, well, I can't even answer them because I can't read it. I know I should practice shooting the little brown dots. So are you enjoying PlayStation VR? Yeah, it's it's much more virtual reality than I thought. Yeah, yeah. What did you expect? Um, I don't know. I guess lower graphics, lower quality graphics. Got like when those women jump at me, it's like holy crap! What am I supposed to do? Should I select this? No, I got it. Okay, don't they have any... Oh, kitchen is what we're doing now. Yeah, you're doing kitchen. Oh, this is going to be bloody, isn't it? No, yeah, yep. That's what I thought. This reminds me of all the ghost things I watch on TV. Oh, you watch a lot of ghost things? Well, I did, right? Do I... Can't remember. Do you... Oh, there you go!",
            "start": 2415.04
        },
        {
            "text": "Isn't it no, yeah, yep, that's what I thought. This reminds me of all the ghost things I watch on TV. Oh, you watch a lot of ghost things? Well, I did right. Do I can't remember. Do you? Oh, there you go. This is coming back then coming back. I never even did good point. I guess you've never ever used it. I've never used a controller life controller. Okay, well this might be interesting then as well no, it be I forget. It's just movement right. I've never played it actually I played it a long time ago. I know the controller is part of it yeah yeah yeah yeah look at it you're natural oh God is it like that the whole time all right no I'm chained up good how how do I fight head X really is this the kitchen you expected no why is it telling me to point the thing? I think it's telling you to push forward with oh yeah yeah you don't I don't think you're have to hit any buttons there. I think you're just gonna have to move your hands and stuff oh okay so do I need to get up and move no you're chained down",
            "start": 2471.8
        },
        {
            "text": "yeah yeah you don't I don't think you're have to hit any buttons there I think you're just gonna have to move your hands and stuff oh okay so do I need to get up and move no you're chained down you can't move so how how do I he's going to hurt me is he or is he going to help you that's what I'd like to know oh he's chained up too so he's not going to hurt me **** what don't fall at me hey hey wake up your hands why is it shaking why is what controller controller it's Rumble so it's simulating what this would feel around we got to get the hell out of here yeah really come on hurry up behind you look out well that didn't help me you did it come on you little mother this is stupid I can't do anything I just have to sit here and wait a well that's not very nice this one I don't like you don't like this one cuz it's boring or scary well it's boring I'm sitting here and I can't fight okay I can move my hands that's all I can do but when I go to hit her it doesn't do any good sure",
            "start": 2548.08
        },
        {
            "text": "you don't like this one cuz it's boring or scary well it's boring I'm sitting here and I can't fight okay I can move my hands that's all I can do but when I go to hit her it doesn't do any good sure true you know so I have to sit here and wait to be a victim again all right well **** this demo ladies and gentlemen this has been PlayStation VR with my mom mom did you have a good time yes I did are you going to go out and buy a PlayStation 4 on Playstation VR no what if I told you it only it would only set you back depending on the model of PlayStation 4 you bloody **** hands get out of here I'm sorry what no don't worry about it back how much uh well you know if you're going to get the Pro 400 bucks there 300 come here and they got to get the camera too the other ladies and gentlemen until next time it's been our pleasure to serve",
            "start": 2686.52
        }
    ]
}