{
    "id": 2177,
    "video_id": "R5KmOiFZ28M",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Is China The New Hollywood? - The GameOverGreggy Show Ep. 154 (Pt. 2)",
    "description": "Get 'The Dumbest Kid in Gifted Class at kindafunny.com/dansbook\n\nThanks to Jack Threads for sponsoring this episode. Go to JackThreads.com and use code Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1479196801,
    "duration": 1227,
    "transcript_chunks": [
        {
            "text": "when was the last time you ordered clothes online and got to try them on before paying for them never right well that's exactly what JackThreads.com does you can try on anything at home for free ladies and gentlemen then then you only pay for what you keep whether it's a big name brand or the Jack Threads in-house line you can be sure you are 100% in love with the items you ordered before spending a cent real quick clear your head who's the most fashionable person on Kinda Funny that's right no not you Kevin it's clearly Tim Gettys Tim's using the service like don't say no Kevin Tim he Tim orders jackets and stuff all the time online and he looks really good Kevin you wear free clothes choose anything you want though from JackThreads.com and you can try it on at home for free you'll have seven days to decide if it's working for you JackThreads gives you everything you need to send the things back packing tape and prepaid shipping labels ladies and gentlemen so go to JackThreads.com",
            "start": 0.04
        },
        {
            "text": "you'll have seven days to decide if it's working for you Jack Threads gives you everything you need to send the things back, packing tape and prepaid shipping labels, ladies and gentlemen, so go to JackThreads.com and enter the code Greggy when submitting your try out for 20% off anything you keep that's JackThreads.com, code Greggy to save 20% on anything you keep never buy before you try ever again Kevin I've read a lot of AD that's a really good sign off line Nick what what's your topic uh I want to talk about the decline of Hollywood and the rise of Chinese cinema this is something that's been happening for a very very long time and there's a few articles that have come out in the last uh few months that have kind of peaked my curiosity and my interest in this whole uh uh topic largely because so much of you know my own personal upbringing in my childhood my identity is tied largely to Hollywood film and now it seems like a lot like we are quickly becoming second in that race",
            "start": 47.28
        },
        {
            "text": "because so much of your know my own personal upbringing in my childhood, my identity is tied largely to Hollywood film and now it seems like a lot like we are quickly becoming second in that race uh I'll I'll let me open up a few let me let me hit you with a couple facts first so we can talk about this um cuz I want to get your guys' perspective on some of these things I love a good Nick fact I'm trying to pull the Colin out, you want the glasses, you got to put the glasses on the bridge of your nose. Okay say six in one half dozen in the other multiple times during this six in one half dozen in the other do you have a pen can you draw a picture with your arm what else he said the uh oh God I'll think of it later it'll come out um so just kind of to catch everyone up to speed and I don't want to have a I'm not going to expect you guys to memorize these facts or be able to you know regurgitate them back to me but I do want to talk about the spirit of this um you know",
            "start": 109.32
        },
        {
            "text": "Speed and I don't want to have a I'm not going to expect you guys to memorize these facts or be able to you know regurgitate them back to me but I do want to talk about the spirit of this um you know obviously Hollywood movies have traditionally been a huge export for the United States both culturally and economically right we've up until this point been like our big our box offices here have been basically number one in the world um now that's quickly changing they're forecasting by 2018 that the Chinese box offices will be the number one making America basically number two second fiddle um China is currently offering subsidies there's a there's a uh a company called Wanda Group that's offering offering a huge subsidy of about $750 million sorry film fund of $750 million and 40% subsidy so they're actually giving you back 40% of the money essentially um that you would be spending to produce a movie in their country so that's a pretty big incentive to go over there and use their.",
            "start": 157.68
        },
        {
            "text": "So they're actually giving you back 40% of the money essentially, that you would be spending to produce a movie in their country, so that's a pretty big incentive to go over there and use their facilities and produce a movie there. Uh, now obviously when you're producing something in China or something that's going to go in, you know historically there's only been about 34 movies a year max uh foreign movies that have been allowed inside China because obviously it's still run by the Chinese Communist Party um and they're not you know they're pretty harsh with what they do allow as far as their people to say and do. And then of course if you want to bring something that's pretty controversial from the United States, good luck with that. Um but now they just released there was another article that came out and the reason that this kind of spurred my thought process was that there was another article that came out um that basically said China passes law to ensure films serve",
            "start": 196.68
        },
        {
            "text": "that came out and the reason that this kind of spurred my thought process was that there was another article that came out um that basically said China passes law to ensure films Serve the People and socialism and that goes on to say uh things like it forbids content that stirs up opposition to the law or Constitution harms National Unity's sovereignty or uh territorial Integrity exposes National Secrets harms Chinese security dignity honor or interests or spreads terrorism or extremism um now keeping that thought in mind a lot of the money for Hollywood films is currently coming from China so it begs the question if they're able to set the tone for it where is that going to leave Hollywood Blockbusters in say 5 to 10 to 20 years right yeah um like if they had creative or creative say Well they're having creative say right so so there's a lot of there's a lot of small stories uh but most notably one of the biggest stories is that um obviously Transformers: Age of Extinction was the biggest",
            "start": 236.6
        },
        {
            "text": "Well, they're having creative say, right? So, so there's a lot of there's a lot of small stories uh but most notably one of the biggest stories is that um obviously Transformers: Age of Extinction was the biggest the highest grossing film in China uh to date I think it beat Avatar um and the reason it was high grossing was because they were they they agreed to shoot a lot of it in China they agreed to use Chinese actors, Chinese locations uh Chinese businesses so even as going as far as like you know Bank ATMs they go to that are supposed to be in the middle of Texas is a Chinese bank um and in L or because of that they were given day and date release in China with the rest of the world so which which essentially is their technique of saying look if you do this we'll release your movie the same time as the rest of the world and we'll guarantee a certain level of um that it won't be basically pirated to a certain degree okay right cuz if it comes out in the United States people pirate and then boom",
            "start": 287.36
        },
        {
            "text": "the rest of the world and we'll guarantee a certain level of um that it won't be basically pirated to a certain degree okay right cuz if it comes out in the United States people pirate and then boom China, you lose a lot of money um well that helps it essentially be the highest grossing film of all time in in their country and one of the highest grossing films in our country as well um but what I thought was interesting was my is my first reaction to that is well that's kind of **up** right that we have to they're giving us the money but then we have to what you got there ooh I wanted beer so I ordered beer just now look at that I ordered it online yeah right they didn't have Bud Light so you get the I got your craft pser oh my goodness a fancy LAD tonight all right let Do It um so I mean all those whether that's right or wrong doesn't matter right my the question I have for you guys is if they're funding the movie do they have the right is it right or wrong rather well it's not",
            "start": 329.08
        },
        {
            "text": "I mean all those whether that's right or wrong doesn't matter right my question is if they're funding the movie do they have the right is it right or wrong rather well it's not right or wrong but what's your perspective on them saying look we're funding the movie we have the right to tell you kind of what goes into the movie or what doesn't go into the movie otherwise it doesn't get released right and is it fair to say that if you are going to shoot the movie here that we ask you to use Chinese actors I don't know if right or wrong is the word I think it's business you know I think it's them uh it's well I guess not necessarily business if politics are involved too you know well it's politics I mean the United States government is kind of looking into some of the acquisitions that The Wanda Group has made and seeing if it violates any sort of um security regulations but I don't think they found anything just yet but I mean if it's going to help the",
            "start": 369.12
        },
        {
            "text": "Acquisitions that the group The Walt Disney Company has made and seeing if it violates any sort of um security regulations but I don't think they found anything just yet but I mean if it's going to help the movie Studio by making a ton more money in China by hiring more Chinese actors you know which is good in its own right sure uh and showing these different locations are shooting there then I guess I'm failing to see the bad part unless they start trying to like put like government propaganda or something in these which is kind of what's happening right because you're not I mean that and that that's the question it's a gray area right if if I said to you yeah hey I want to give you money you can come make this movie in my country but it comes with these caveats it comes you can't really say anything bad about China you can't this was the thing I correct me if I'm wrong I thought when we left Independence Day: Resurgence we were talking about this right and the fact that they had the",
            "start": 410.64
        },
        {
            "text": "Is China The New Hollywood? - The GameOverGreggy Show Ep. 154 (Pt. 2)\n\nanything bad about China you can't this was the thing I correct me if I'm wrong I thought when we left Independence Day Resurgence we were talking about this right and the fact that they had the Chinese woman pilot there, correct that they made a big deal about being and like it was like America's awesome but so is this Chinese woman pilot you know what I mean they made a big deal about like that was the they were I forgot it's been so long there was something I remember we queued in out of like that was weird it was like oh well did you see the opening credits that said it was Alibaba, it was probably the Alibaba one of the Alibaba which is a huge it's like company of China but they they put out a lot of movies they make a lot of movies they co-finance a lot of movies too U which is by the way another political strategy they use given that there's only 34 foreign films allowed in China it's it's opening up a little bit now but one of the workarounds around that is that you",
            "start": 447.44
        },
        {
            "text": "Way another political strategy they use given that there's only 34 foreign films allowed in China. It's opening up a little bit now, but one of the workarounds around that is that you can co-produce with a Chinese company and then you can get your movie made, which is what I think TMNT, Mission: Impossible, or Star Trek Beyond did do - 30 or 40, no, 34. They have a specific number, what a weird arbitrary thing. What's that? No, I think it's 34 foreign movies total. I could be wrong about that. Why 34? Don't know. So this to me is interesting because when you look at it like for example, what's the difference between this or sponsorship and product placement of anything? Right. Uh, I feel like watching Transformers was distracting - it's like now we're going to China and there's all this weird like Chinese stuff stood out absolutely. Um, the ATMs and that type of stuff, it's like them going to China, sure fine like",
            "start": 484.84
        },
        {
            "text": "that it's like now we're going to China and there's all this weird like the Chinese stuff stood out absolutely um the ATMs and that that type of stuff it's like them going to China sure fine like they need to go somewhere uh but there was a lot of little things that was just kind of like it took you out of it and it made you kind of think about it um but I don't think that that that's that bad because I watched Doctor Strange last week and every time a Microsoft Surface Book was shown it was like it was it took me out of it in the same way where I'm like there's the product placement but it's like I kind of think those things are equivalent in that it doesn't really matter like they needed a computer they need to go somewhere as long as these things are just well they're going to China because China's paying for it doesn't matter they could have went to Africa Japan who cares they're going somewhere but this stuff uh kind of turns into this this worst case scenario where the finance",
            "start": 533.8
        },
        {
            "text": "China's paying for it doesn't matter, they could have gone to Africa or Japan - who cares? They're going somewhere. But this stuff kind of turns into the worst-case scenario where finance dictates what they're doing, and that's true on the product placement side as well. Though, like, they need a certain amount of computer scenes to get their worth out of it, so they're going to write more computer scenes in the movies right? Like, it does affect it in that way. But I think this is because there's an actual political agenda on top of it - that's when it starts getting scary. Because from a business standpoint, it makes sense for them to do these partnerships: why not get in front of way more people and an audience? It's not like no one's fighting us exactly; they're like, \"Well, fine, we'll make these concessions because they don't give a ****.\" Like, Independence Day is",
            "start": 574.88
        },
        {
            "text": "that's not like no one's fighting us exactly because there's no reason to they're like, \"Well, fine. We'll make these concessions cuz they don't give a ****.\" Like Independence Day is a perfect example - who cares? But that's the problem too, I feel. Is the fact that I remember hearing about this, I want to say three or four years ago when this was starting to happen, and they were saying it must have been like 16 or something to that effect talking about the fact that what's big in China is not necessarily the plot but the big effects - the big explosions. That's what, in that case, the concern is more movies would go that way, and that is the thing we're talking about right now with Transformers: Age of Extinction - I didn't see it, but I assumed it was like Transformers 4 with big explosions. Independence Day is nonsense in terms of big explosions, right? Like, I watched that, and it sucked. I don't know what I mean, what the hell was that, but if it plays well internationally and makes all that money, why does it matter?",
            "start": 616.8
        },
        {
            "text": "Day is nonsense in big explosions, right? Like I watch, like that sucked. I don't know what I mean. What the hell was that? But if it plays well and makes all that money internationally, why does it matter what the actual content of the movie is? Yeah, I mean, I'm not saying I'm not here trying to pass judgment. Like Hollywood has historically always gone where the money is, right? And the money always dictates the content. It's just the way it goes. Um, the only thing I'm trying to grapple with internally is the idea of such extreme censorship and what that's inevitably going to do to our product. Right, which is a product that you know film has been such a transformative medium for us. It's been such a great medium to getting really profound, really important cultural messages out that otherwise wouldn't have the same impact. You know? Uh, for instance, my wife's watching uh it's not a film, it's a TV show I was watching, \"Transparent\" right now.",
            "start": 653.56
        },
        {
            "text": "important cultural messages out that otherwise wouldn't have the same impact you know uh for instance my wife's watching uh it's not a film it's a TV show I was watching Caitlyn Jenner right now right that is such an amazing piece of art that I did not expect to affect me the way it did right obviously uh uh with like C uh you know things like that have brought transgender people um to sort of the public Forefront um but then sitting down and watching this and letting yourself be immersed in this narrative that is obviously fiction um but forms a personal bond to someone and what they're going through uh by doing so is a very very powerful thing and the fact that that's probably not going to be allowed ever in China um means ultimately as far as Blockbusters are concerned granted Blockbusters haven't really tackled transgenderism um but the block there in in Hollywood right now there's the Blockbuster and then there's the Indie there's no in between cuz no",
            "start": 691.36
        },
        {
            "text": "concerned granted Blockbusters haven't really tackled transgenderism, um, but the block there in in Hollywood right now, there's the Blockbuster and then there's the Indie, there's no in between, cuz no one's funny those indie rights and those in-between are the ones that like have the the real possibility of making that that big cultural impact right, um, so it's just it's very scary to look at that and then also start to see the Chinese films bleed into the American market and this is something I didn't realize how I looked this up, um, is that the same group that's offering these subsidies owns AMC Theaters and so you're now starting to see all the Chinese movies be marketed to the United States, um, which is not necessarily a bad thing because I don't I'm sure that there's plenty of great Chinese films out there, um, but the question then becomes what is that what is that going to do to our film industry in the coming years what does that say about us if for instance we Hollywood starts making",
            "start": 734.88
        },
        {
            "text": "films out there, but the question then becomes what is that? What is that going to do to our film industry in the coming years? What does that say about us if for instance we're making Hollywood films in China, using Chinese actors, and they're being shot in China - are they Hollywood films anymore? Yeah, I mean, what you're talking about here... okay, well, whatever it's just these big Blockbusters. Does it matter? Does it do this? Who cares if it's this thing? It's one of those like by the time it seeps in and Hollywood realizes how much money they can make on it, it changes the dynamic. And then eventually you're going to look around and be like, \"Wait, why are all the jobs - in terms of being a key grip or being a union guy - here in the United States?\" This is the same thing you've seen in every other industry, whether it's air conditioner manufacturers putting them out right, jobs leaving the state and going to Mexico. The fact that every CW",
            "start": 769.96
        },
        {
            "text": "and this is the same thing you've seen in every other industry whether it's air conditioner manufacturer Carrier putting them out right jobs leaving the state and going to Mexico, the fact that every CW superhero show - and this is a goofy example but true - is shot in Vancouver, right. And it's one of those things where they're not going there because the locations are awesome; Vancouver is great, I've been there, it's I love Vancouver, but they're going there because here's a giant tax incentive. And it's the normal thing with America bureaucracy and politics getting in the way of \"we're not making it easy for you to be a business here.\" And this is something we've talked about before, right - like when KH talks about it all the time once in a while when he gets really angry about how we should have incorporated in Delaware. You know what I mean? Like, yeah, we're a California company but everybody incorporates in Delaware; they just put on a dummy corporation there because it's better there to",
            "start": 809.64
        },
        {
            "text": "Incorporated in Delaware, you know what I mean, like yep, we're a California company but everybody incorporates in Delaware; they just put on a dumb thing there because it's better there to get your business there to get less taxed, but we didn't do that. So I mean I looked into it, I know well I know we looked into it, not as cut and dry as you, I'm aware, but I'm saying there are plenty; look at a whole bunch of businesses right, they have they file somewhere, do have a business in Texas where there's no exactly you know exactly that's the thing, where it's like we can you keep putting the squeeze on people you can't be mad when they leave and that's what I where I've always been; I think you could see a lot of big studios wanting to do this for the obvious money reasons but there have to be I would have to imagine that a lot of the big directors like imagine like the Coen Brothers or Paul Thomas Anderson, you know like they have Creative Vision and stuff and they they take a",
            "start": 845.32
        },
        {
            "text": "have to be I would have to imagine that a lot of the big directors like Imagine like the Coen Brothers or Paul Thomas Anderson you know like they have Creative Vision and stuff and they they take a lot of authorship in that I don't think they'd be willing to compromise that because of extra money coming in from China but the scary thing is the Blockbusters are what pay for the Indies right so when Warner Bros. is having a bad year they hope to God they can get Fantastic Beasts and Where to Find Them out as soon as possible because they know that Harry Potter franchise is going to basically fund that studio for the next couple years or next five years probably U and that gives them the the ability to take the risks with Coen Brothers not to say the Coen brothers movies don't make make money I have no idea if they do or not but there have been lots of independent films made for you know between the you know two and $20 million range that have made their money back and then some um",
            "start": 879.2
        },
        {
            "text": "Is China The New Hollywood? - The GameOverGreggy Show Ep. 154 (Pt. 2)\n\nmoney I have no idea if they do or not but there have been lots of independent films made for you know between the you know two and $20 million range that have made their money back and then some um but those are huge risks yeah that that that that movie studios are taking which sounds counterintuitive you would think a $300 million movie like Transformers is a huge risk but it's not because you've got that built-in audience lo and behold you know in China um I think these things a Transformer my God it's so I mean granted I didn't see Transformers for but I heard it's high art um yeah that's what I heard I mean I Transformers is a franchise at not the movies but as a franchise in general that's very near and dear to my heart probably more so than anything else like it's up there with Nintendo in terms of how much I love it and it the movies I mean you know they are what they are and I I can't really defend them but I at least found them enjoyable age of Extinction was bad is",
            "start": 914.24
        },
        {
            "text": "Nintendo in terms of how much I love it and it - the movies, I mean you know they are what they are and I I can't really defend them but I at least found them enjoyable. Age of Extinction was bad; is the second one? No, it's was the fourth one. Oh that's the fourth one, it was real, oh the dinosaurs were real bad. Yeah, and it's and a lot of that's I wanted to go back to you mentioned Doctor Strange right and how uh we love that movie, great movie, I think they did a great job with that but there was an article I found about Doctor Strange that was saying that the reason Tilda Swinton's character uh as sort of the Tibetan uh uh monk character was changed to a non-descript white person was because of China's relation with Tibet. Like it's not that's what people are theorizing, I don't think that's ever been proven but they instead of making that person specific ethnicity or nationality they were like let's just make the Ancient One a bland now that could also just be Hollywood whitewashing whole completely.",
            "start": 952.48
        },
        {
            "text": "but they instead of making that person specific ethnicity or nationality they were like let's just make the Ancient One a bland now that could also just be Hollywood whitewashing whole compl those two things need to be looked at separately because the the the politics and money are very different than the the whole actor side of it and the whole decisions made based on well no but those decisions are I mean those decisions are made Like Scarlett Johansson's in um Ghost in the Shell because she sells in China she sells overseas so well she sells period She sells right so um and toys apparently and it makes sense another famous another famous example of it obviously is um actually probably most famous example of it was when uh they did the remake of Red Dawn and it was supposed to be the Chinese and China said no we're not releasing this movie and they digitally made them all North Koreans really which is why that movie completely absurd wow to Colin Colin hated that cuz he was like",
            "start": 994.4
        },
        {
            "text": "and China said no, we're not releasing this movie and they digitally made them all North Koreans really, which is why that movie completely absurd wow. To Colin, Colin hated that because he was like there's no way North Korea could take over and hold the entire continental United States; he's like but China could of course, China could, but China doesn't want to be the bad guy anymore huh. And they funded that movie, uh no, they just said they wouldn't let him as the number two biggest theater on the planet you're not going to make your money back basically because you're not this movie is not coming out in our country I mean that that's it sucks but I mean the way I see it is it is what it is. They have the right to do that, but I feel like China has problems you know what I mean China definitely when it comes to the movie side of it it's just like that's on us quote unquote as Hollywood to figure out how to make sure that this doesn't affect us negatively in terms of",
            "start": 1035.32
        },
        {
            "text": "China definitely when it comes to the movie side of it, it's just like that's on us quote unquote as Hollywood to figure out how to make sure that this doesn't affect us negatively in terms of the authorship of everything. But I feel like the guys like Michael Bay they want the money, they want more explosions, they don't give a **** about who's in the movie why they're in the movie, they just want bigger explosions and it's like cool and that's the stuff that sells over there. But I think that you were talking about the divide and we've talked about this so many times but I think that the Indies, Netflix, and that type of stuff, that's the future of all that and that's where it's going to grow and like we're going to get the people with the defined visions and places like Patreon and all that are going to support people enough and Kickstarter and crowdsourcing are going to give people the money needed to make things and I think that right now we're still in the",
            "start": 1069.8
        },
        {
            "text": "like Patreon and all that are going to support people enough and Kickstarter and crowdsourcing are going to give people the money needed to make things and I think that right now we're still in the baby steps of that because when you know even to make a low-low tier movie it still costs millions of dollars at 2-3 million so it's like you're not making that off Patreon but uh when we're seeing with all these like actors that make their their Kickstarters and um but that's a perfect example right but like it all kind of breaks my heart in a way uh simply because the more and more audiences go well that's like I'm they gravitate more toward those experiences and I I say those you know with love because that's us right we're we're making content we're asking the audience to subsidize that content it's no different than what Netflix does it's just we're we're not putting out Stranger Things yet or are we or are we? Are we The Duffer Brothers um spoilers we're not uh but",
            "start": 1105.84
        },
        {
            "text": "subsidize that content it's no different than what Netflix does it's just we're we're not putting out Stranger Things yet or are we, or are we? The Duffer Brothers - um spoilers we're not uh but either way that's still taking attention away from the theaters right the theater experience, the the movie as we see the spectacle of seeing it on an 80-foot screen is dying and it is going overseas and it is just and it's coming to Virgin America plane headsets you know at least United hasn't beat because at least you can stream to a freaking iPad that's so much better it's way better than that little tiny screen oh yeah missing because you get to do this on the thing and look at it my favorite is when part of the screen is like blue and the other part's like pink that's super dope now you don't realize it but they didn't color the movie like that that's just cuz some kid saying is United got scooped and this is their fix all right when the internet's free then tell me",
            "start": 1146.8
        },
        {
            "text": "dope now you don't realize it but they didn't color the movie like that that's just cuz some kid saying is United got scooped and this is their fix all right when the internet's free then tell me something about United and your planes are on time fair enough well anyway I just wanted to uh put that topic in front of you guys let you mull it over a little bit because it's of concern to me okay we we'll we'll check back in a year see if unless trying to want to give me money for movie in which case what's up we'll come shoot Game Over Greggy Show in China **** yeah we will yeah for $750 million **** yeah kill Kevin Hart he you don't want to eat him then reconstitute him you know what I mean oh God damn hell",
            "start": 1187.56
        }
    ]
}