{
    "id": 3621,
    "video_id": "_1df7WSping",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Andy Cortez"
    ],
    "title": "Live Reaction Smash Bros. Ultimate - Kinda Funny E3 2018",
    "description": "Subscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1528832252,
    "duration": 360,
    "transcript_chunks": [
        {
            "text": "please take a look these people all live in Bal our houses it's just a set that's not their house [ __ ] love smash Rose I've always loved it oh man oh okay okay this is a sauna was in the last trailer I was right he keeps on mario confirmed how's it look horrifying the wild lake permanent blue tunic I like it thank you Janka dong young daughter the order in which they Julian said it's the leave speculation five Haller they're gonna bring back all right well we've seen all these characters before oh man yeah baby but they can't run in handheld one can't run in here no as a funny one Thanks holy [ __ ] hey process portal both motors back yeah trainer reowwww can be cloud boy come on yes holy [ __ ] full roster confirmed oh that's awesome I'm Ryan boss super happy - well we [ __ ] it's literally everybody and they weren't joking I think when they said everyone is here well oh my god dude this is a dream even watching that's so hard to fight their house boy there he is there's your winner",
            "start": 0.03
        },
        {
            "text": "everybody and they weren't joking I think when they said everyone is here well oh my god dude this is a dream even watching that's so hard to fight their house boy there he is there's your winner on hit and dark pit [Music] what the [ __ ] dude they're crazy they really have time to bounce ten of them seven yeah good luck [Music] we'll take that shirt off here's your boy let me see the math nice butt oh man [Music] whoa damn they went hard on this one why not tell ya I was north okay we've got something special for your playing pleasure and Super Smash Brothers ultimate all of this has been pretty cool something special give me that sea snake y'all Nintendo GameCube controllers can be used in Super Smash Brothers ultimate for many of you it just isn't the same without them we hope you're as excited as we are our staff will continue working hard until the game releases we really appreciate your support we've made including every single fighter ever our number one goal so I'm kind of",
            "start": 126.89
        },
        {
            "text": "as excited as we are our staff will continue working hard until the game releases we really appreciate your support we've made including every single fighter ever our number one goal so I'm kind of hoping you aren't expecting too many new challengers however we do have one more announcement please take a look nibs are getting hard man Seinfeld stabby amazing wow that's really it's [ __ ] Ridley oh wow look at these reason rivers in Kyllo she's so cool [Music] what the hell okay so what really was from Jesus I wouldn't walk by this famine alleyway okay I mean I cross the stress across this at a street it's on walking on my cell huh succumbing curb [Music] anybody Super Smash Brothers ultimate [Music]",
            "start": 226.22
        }
    ]
}