{
    "id": 5294,
    "video_id": "PkS3JPV2RN0",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Joey Noelle"
    ],
    "title": "Wonder Woman 1984 DC FanDome Trailer Kinda Funny Live Reactions",
    "description": "Greg, Tim, and Joey watch-a-long as DC reveals Wonder Woman 1984's brand new trailer.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\r\n\r\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\r\n\r\nCheck out our store! http://www.kindafunny.com/store\r\n\r\nFollow us on Twitter!\r\nGreg - http://www.twitter.com/GameOverGreggy\r\nTim - http://www.twitter.com/TimGettys\r\nNick - http://www.twitter.com/Nick_Scarpino\r\nKinda Funny - http://www.twitter.com/KindaFunnyVids\r\n\r\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.\r\n\r\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1598120702,
    "duration": 270,
    "transcript_chunks": [
        {
            "text": "we have ladies and gentlemen welcome to the first impression trailer reaction or whatever we call them i'm greg that's team that's joey we're about to watch the 1984 wonder woman trailer here [Applause] this world is not yet ready for all that you will do your time will come diana and everything will be different there it is tim dude you can feel it yeah citizens of the world i'm here to change your life anything you want anything you dream of you can have it feel like you saw a ghost diana lucky you it's like now one day has passed i don't want to be like anyone i want to be an apex predator go on you've always had everything but people like me have had nothing let me see her and cost him do something good get used to it [ __ ] she went through this thing not even doomsday could go through the thing oh [ __ ] that's never been one for rules the answer is always more this has to end on like some like silhouette they will never find us i forgot to tell you what radar will they will they",
            "start": 0.0
        },
        {
            "text": "the thing oh [ __ ] that's never been one for rules the answer is always more this has to end on like some like silhouette they will never find us i forgot to tell you what radar will they will they shoot at us there it is god she's [ __ ] cool you know i'm not so keen on this one i figure uh you are but you know what i'm ready to go i think we can do better parachute pants yeah um does everybody parachute now [Laughter] no it's good that was good yeah um i really liked it i like this pedro i want more of this peter pascal's christian wig dynamics strange but very much a wonder woman villain a classic wonder woman villain yeah outside of artemis right her legs is i think this movie has so much potential to be significantly better than what we've seen before i think that's that's great so far i'm loving it i do wish that we got the i thought they were leading into the wonder woman theme song i thought they were gonna hit us hard with some [ __ ] but they didn't and creative cosplay",
            "start": 88.0
        },
        {
            "text": "so far i'm loving it i do wish that we got the i thought they were leading into the wonder woman theme song i thought they were gonna hit us hard with some [ __ ] but they didn't and creative cosplay yeah so i thought that was great this art from some incredible i'm stoked for that movie i wish they would just figure out a way to put it on but i know we need to make sure these movies existed and yeah i think this is just like the way that the world is right now but i have watched the one the first trailer so many times that i'm like i don't need any i don't need a trailer at all like i'm so i'm sold on this movie already like seeing her in the gold suit i wish we didn't see until the movie you know even in that wasn't the first trailer as well but sure um anyways what did you think of wonder woman 1984 let us know in the comments below and of course if you're watching this as we put it up remember you can go over to twitch.tv slash kind of funny games and watch us react to the rest of",
            "start": 216.24
        },
        {
            "text": "woman 1984 let us know in the comments below and of course if you're watching this as we put it up remember you can go over to twitch.tv slash kind of funny games and watch us react to the rest of dc fandom",
            "start": 258.72
        }
    ]
}