{
    "id": 1969,
    "video_id": "2vs9cLiXKJU",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Is Abzu The Next Journey? - Kinda Funny Gamescast Ep. 80 (Pt. 1)",
    "description": "Greg gives his thoughts on Abzu.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1470661200,
    "duration": 1586,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the first ever episode 80 of number 80 of the Kinda Funny Gamescast as always I'm Tim Gettys joined by one half of the coolest dudes in video games Greg Miller hey this is the first time I've ever done a show with you I know the one no that's not true we did the Patreon exclusives but those are you didn't have to do the rimba roll in the beginning you just got to do whatever now you're here you got to be locked in for everybody you got to be very professional Prof yep that's definitely try to be Callin that's what I'm gonna do today no doesn't host shows he only hosts Colin live and that's just a whiteboard and a lecture every day the lecture oh my God he's a teacher is a teacher Colin's a teacher man he was training for it and he uses it oh man that would have been I'm excited for this can you imagine finding out that Colin's your professor now I know a lot of you at home are like oh my God that's the dream yeah I'm the kid that would have been",
            "start": 0.31
        },
        {
            "text": "have been I'm excited for this can you imagine finding out that Colin's your professor now I know a lot of you at home are like oh my God that's the dream yeah I'm the kid that would have been like oh Fu Mor Mr Moriarty you know yeah he comes in he just Rants and Raves and you're like is any of this going to be on the test do I really need to know about this third party Johnson right now yeah exactly about the third party Johnson we're talking about American history not American right now what are you doing ladies and gentlemen on this Kinda Funny Gamescast every week we talk about video games and all the things we love about them and I feel like this is a good Duo for that yeah me and you you and I we're the ones that love video games we do a lot right we uh can talk about them we can believe about them we can play them play them let them in I just watched you play one you I just finished Abzû in front of you which you're excited to play but I ruined for you now you",
            "start": 49.52
        },
        {
            "text": "them we can believe about them we can play them play them let them in I just watched you play one you I just finished ABZU in front of you which you're excited to play but I ruined for you now you know how it ends I saw the ending I knew it was getting there I'm like I'm just going to look away game's pretty abstract don't worry yeah yeah yeah yeah um but if you wanted to get the show early you can go to patreon.com/kindafunnygames got a bunch of goodies over there and all that stuff or you can get it for free at youtube.com/kindafunnygames where it's distributed every day Monday through Thursday topic by topic full episode Friday you can also get it on iTunes something I don't like about iTunes and I need this to be clear everybody sure I don't like how when you go to itunes.com/kindafunnygames it does this weird thing where it reroutes to a page that's like you can download iTunes I already know why does that yeah I hate that iTunes does that crap all the time you click on",
            "start": 90.44
        },
        {
            "text": "Kinda Funny Games MH it does this weird thing where it reroutes to a page that's like you can download iTunes I already know why does that yeah I hate that iTunes does that crap all the time you click on somebody's link and it's like oh forget us on iTunes you're like do you want to download iTunes like I have iTunes could you just open this in iTunes or could you just link the problem and what doesn't make sense if you go on iTunes and you search for Kinda Funny our podcasts come up you can click on PS I Love You Yeah available every Tuesday at 9:00 a.m. you can click on Game Over Greggy show available every Friday at midnight whenever Kevin gets to it no the free ones are good okay free ones are always set okay but that's the Kevin has a week to handle that **** yeah I mean that doesn't stop him from screwing things up you're right you're right you get Gamescast this beautiful this big beautiful show here you go to any of those you can go to more from this publisher click on",
            "start": 129.52
        },
        {
            "text": "doesn't stop him from screwing things up You're right, you're right. You get Gamescast - this beautiful, big, beautiful show here. You go to any of those, you can go to more from this publisher, click on Kinda Funny. There's this beautiful page that I helped set up with our homies over at Apple, yeah. And I'm like, \"Great, what's the link?\" You can right-click, copy link; it's iTunes.com/KindaFunny. Put that in - download iTunes, download it! Come on, come on! The big news is that when I was walking past Portillo a second ago, the Apple Maps car passed me taking pictures. Oh yeah, so I'm going to be an Apple map no, you are going to be internet famous, Greg Miller. Everybody's going to know me on that Apple map. I'm excited about this episode; we've had a good day. We have had a good day. We - we decided this is going to be our date day. I greeted you at the door in my underwear when you got here this morning. Did then we did Colin and Greg live all by ourselves, no Kevin, no Nick, no Colin. Then we went to",
            "start": 167.48
        },
        {
            "text": "is going to be our date day I greeted you at the door in my underwear when you got here this morning did then we did Colin and Greg live all by ourselves no Kevin no Nick no Colin then we went to a lovely lunch then we got some fro-yo we went to a burrito place different than our normal burrito places and that is when you know that you're getting adventurous yeah let's let's get out of the rut let's go to this new place I was feeling good it was good I liked it a lot I did too um I had a wet burrito one of the best wet burritos I've had in a while wow yeah the enchilada sauce was yeah I tried tacos they were very good  upsets me because it reminds me of Nick and he says Starbucks starbucks and it just smells like Nick and so like that kind of makes me gag a little bit Nick makes you gag that's how that all works um but anyway yeah today's episode's going to be fun on calling live I asked a lot of people for questions so we're going to do",
            "start": 205.08
        },
        {
            "text": "bit Kevin makes you Gavin makes me gag, that's how that all works. Um, but anyway, yeah, today's episode's going to be fun. On calling live, I asked a lot of people for questions, so we're going to do two topics of audience questions. We got some good ones, okay, good about time these kids brought something good. It's going to be fun. Start with Abzu. Abzu, cuz my God, yeah that game looks like a game it's taken it it's taken the world by storm this AB it's not hit the Pokémon go world threshold but okay our industry it's taken Marty S by no and Mitch Dyer and Katsuragi Blazinski everyone's out there tweeting and talking and reviewing Abzu talking about it. I just played it, I just beat it, yeah, okay that was something I did for two hours so let's give a little bit of a background on Abzû. Abzû not made by that game company despite the similarities had it's game made by Giant Squid this is their first game the the leader of Giant Squid left that game there you go you got some you got some of that",
            "start": 245.4
        },
        {
            "text": "by that game company, despite the similarities, had its game made by Giant Squid, this is their first game; the leader of Giant Squid left that game. There you go, you got some, you got some of that stuff there. The art director for Flower and Journey, right, AKA two of my favorite games of all time, yeah. Leaving here to do this correct also Austin Wintory, composer of Journey; yep, composer of this game. Look at you with your facts, and that took me two minutes of watching you play for me to be like, \"This is a game for me.\" This looks awesome, and that's the whole thing about it is what I want to as we get into this: what do I think? You should play Abzu, of course. I'm not going to make it spoiler-free; uh, should you play Abzu? Of course, you should play Abzu. It's another one of those games – our Gamescast are art – and here's this thing like my it's it's similar to my Inside thing when we did the review of Inside where it's just like it's a really abstract, you know what I mean",
            "start": 291.96
        },
        {
            "text": "going to be our games are art and here's this thing like my it's it's similar to my inside thing when we did the review of Inside where it's just like it's a really abstract you know what I mean and like I get that and you want me to talk about it and think about it but I kind of don't like that you know what I mean and so to go back flow and flower never hit the mark for me I played both those games finished both of them right yeah probably and even though is the it's the journey not the destination with those kind of games IMO Flower I like Flowers, Flower was great as a whole but like you and then you always just back in the window sill it's like all right I see what yeah but I feel like there there is an ending to flower Flo I never beat Flo FL Flo didn't click with me yeah so but Journey did click with me I love Journey, Journey I thought was okay cool I get what's happening here and with Abzu I never really got it and I just beat it like literally 20 minutes ago 30 minutes ago",
            "start": 335.24
        },
        {
            "text": "did click with me, I love Journey, Journey I thought was okay, cool. I get what's happening here, and with Abzu, I never really got it, and I just beat it, like literally 20 minutes ago, 30 minutes ago, and so I need to go; I want to go read about it; I want to go do the first thing I did though was jumping into Jose Otero's IGN review, and he was with me there gave it what 83 I think, and he was talking about like you know his cons are that's a little too loose narratively yeah, and that's I hate saying that's like one of the things because I love artsy games I love I love people creating art that's why I love video games is that it's an art form everybody gets to go Express themselves and do different things with it but it does at times feel like you're trying is this an a game for Art's Sake you know what I mean is it that kind of thing, and not there anything wrong with that, but and it also just does feel like a lot ways underwater Journey of like you're going it's like what's happening okay here",
            "start": 376.48
        },
        {
            "text": "what I mean is it that kind of thing and not there anything wrong with that but and it also just does feel like a lot of ways underwater journey of like you're going it's like what's happening okay here are some like cave paintings or like I'm trying to figure out what exactly piece it together how it's going but then by the end when I get it and I do the thing and this happens blah blah it's like okay yeah and like you know the way people keep talking about it and here's what I think might be the problem for me in particular me me personally I should say is the fact that everyone's talking about it as it's a game that's super relaxing it's this game that's meditative it's this kind thing that's what I've been applying to my expectations for No Man's Sky that no man's sky is going to be the game that I sit there and play and chill out for 30 minutes night and be done with and go to bed uh jumping into this one today I wasn't necessarily in the mood but I wanted to be able to talk about it",
            "start": 413.56
        },
        {
            "text": "that I sit there and play and chill out for 30 minutes, night, and be done with it, and go to bed. Uh, jumping into this one today, I wasn't necessarily in the mood but I wanted to be able to talk about it, I wanted to see what everybody was talking about. I get why people love it; it is beautiful, oh my God, is it a beautiful game every time. And like that's the one thing that's for me. The best part of the game is like at any point I felt like I could put the controller down and look back or go into meditate. Meditating because that's like one of the big things where you see these like uh shark statues that you go and you rest on their heads and you meditate, and then the camera just kind of spins around. Let's see it always looks like a moving painting, it's always beautiful, like the colors, whether they're using a very very dark palette, you know when you're underwater it's it's dank and it's gross or you're this bright beautiful it's tropical it's a coral reef, awesome stuff there, awesome, awesome color really.",
            "start": 448.56
        },
        {
            "text": "a very very dark palette you know when you're underwater it's it's dank and it's gross or you're this Bright Beautiful it's Tropic it's a coral reef awesome stuff there awesome awesome color really beautiful game animated incredibly well swimming very fluid it's funny I remember when we hit Uncharted 4 and before and you came back that after that first day and you're like they finally did it they made swimming in a game Fun swimming a game's fun here it took me a while being a non-inverted person to wrap my head around it cuz it was that you can go and change it to to be how you would but even once they changed it that didn't feel right and I was like back to inverted I'm flying like a plane whatever yeah that that's that's always hard that inverted thing we talked about this before I think with Ratchet & Clank I was having the issue with the the remake of it where the I play I used to play inverted now I play normal but then when uh it comes to the camera of the left and right",
            "start": 481.24
        },
        {
            "text": "think with Ratchet and Clank I was having the issue with the remake of it where I play I used to play inverted now I play normal but then when uh it comes to the camera of the left and right movements in like a third person thing sometimes it just doesn't click right where it's like I want one to be horizontal and one or one to be uh inverted and the horizontal to be uh not inverted and or stuff like whatever it is the opposites and it it just tricks you up but then one day it can change day to day it's like a weird brain thing and that was the thing of like yeah for me I think part of it too is that sometimes you get pulled back a bit so it's like I was trying to swim you know over there right so I'm I'm pulling up and I pulled up too far and did like the and I was like upside down and trying to come back yeah minor gripe I don't want to make this out to be a thing it just for me I had a little bit of trouble wrapp my head around it but I eventually got it and it's also not a",
            "start": 517.4
        },
        {
            "text": "and trying to come back, yeah, minor gripe I don't want to make this out to be a thing; it just for me I had a little bit of trouble wrapping my head around it but I eventually got it. And it's also not a game where it's like you need to be precise, you're going to get punished; none of that back to the relaxing thing of just like you're underwater and it's chill music as you brought up, amazing yeah, I mean that that's something that I think is uh really important to this is the the art aspect right where the is it art for Art's sake? I feel like that's even a totally even other topic where it's like sure uh and even Tom about Inside before there was that question of like all right so what and whatever but it's like if that's the point then that's the point. I'm not, but but with this though I think that uh beyond that like the the game whether it's too artsy in the sense of what does it mean and like let's discuss as art as uh when you take the the look and the tone and the feel and the sound and",
            "start": 555.4
        },
        {
            "text": "\"Uh, beyond that, like the game, whether it's too artsy in the sense of what does it mean and like let's discuss as art as uh when you take the the look and the tone and the feel and the sound and the all that stuff. You're talking about the the it looks like every frame looks like a painting, yeah. Like I think that uh they they did that to an extent with Flower but then Journey knocked it out of the park where it's just like every single shot of that looks amazing. It doesn't and it's PS3 doesn't matter, PS1 can be out and that's going to look amazing because of the art direction and I think that this is another one of those moments where the art direction of uh Matt Nava he gets it, you know, he gets how to design something to evoke emotion uh just just from the look of it right. Look just watching you play it's like I get the feelings of of Journey and of Flower but like this also had its own own thing to it. I remember back on the the GameCube the one of the really special things was...\"",
            "start": 591.4
        },
        {
            "text": "you play it's like i get the feelings of of Journey and of Flower but like this also it had its own own thing to it I remember back on the the GameCube the one of the really special things the GameCube had um in terms of Graphics because it wasn't the most powerful the Xbox by far was the most powerful that generation PS2 tended to look better than GameCube did GameCube was a little bit more rounded around the edges and stuff um Mario Sunshine the water yeah it was beautiful the way that it interacted with things and just it was it was NextGen at that time um Star Fox Adventures the fur like having all that stuff it was so like oh my God like this is and they kind of overcompensated in a lot of ways with that um but uh I feel like that those things are what push the limits of stuff and now these days water the video games have nailed it we've seen it anding you this I'm like man this is about in video games in a way that i haven't in a long time and it made me stop and think all right so",
            "start": 637.96
        },
        {
            "text": "and now these days water the video games have nailed it we've seen it and you're thinking this ising about in video GAMES in a way that I haven't in a long time and it made me stop and think all right so from flow to flower to Journey, flow is like on a really small scale, right, like a microscopic adventure, bacteria in your eye, yeah, flower is this like beautiful grassy fields and then eventually cityscapes and stuff like that but it's it's way more it's the idea of being a flower in the fields, Journey desert right and like kind of caves but mainly desert then the big question is where do they go from there and I think underwater is the uh obvious answer and I think the other obvious answer is space sure so that's why I think No Man Sky makes sense skin brought up in this conversation but what's also funny is because I thought about this I'm like what do I want from um that game Studio next that game company and that game company and not to say that that these are them but obviously when",
            "start": 686.8
        },
        {
            "text": "also funny is because I thought about this I'm like what do I want from um that game Studio next that game company and that game company and not to say that that these are them but obviously when you're it's the spirit not Shuhei Yoshida but obviously I mean like that's what my thing to Quick aside is like playing this game I and I'm enjoying this game but it does feel like okay it's kind of just it's Journey underwater in the sense of I'm in this area do do here's this epic moment to transition me into something else and here we're back into this thing and I'm trying to light up these different things to get that to go and okay that went and now another transition it's not none of that's bad none of that's like oh how unoriginal it's just like I'm not as like Blown Away by it cuz I feel like I I know this game already when I just sat down to play it yeah and that's and it's such a weird thing people will never be happy right it's like you can never be wow again like that because that was",
            "start": 733.36
        },
        {
            "text": "I know this game already when I just sat down to play it, yeah, and that's and it's such a weird thing people will never be happy right it's like you can never be wow again like that because that was so so amazing and such a unique thing having said that we haven't had anything like that since so I think that I I love seeing you play this because I'm just like man like this I've for years dreamt about what their next game would be and I I always thought it was going to be underwater or space and it's funny seeing you play this because taking no mans Sky out of it um it you could replace that with space because of the way you control it like seeing the way that you were navigating and stuff like it made me think think of Star Fox you know or stuff like that where it's like you're you're you're it's a linear game you're driving through it's a kind of like an on rails um space Sim but you're underwater right and uh it it was cool seeing the the hints of flower where like you're going",
            "start": 774.08
        },
        {
            "text": "you're it's a linear game you're driving through it's a kind of like an on-rails um space sim but you're underwater right and uh it it was cool seeing the the hints of Flower where like you're going through fish and the fish all join you and then you speed up each time um but with those epic moments of of Journey and Flower had them too but uh it felt a bit more um once you hit this thing the camera's going zoom out and it spins around and like colors change but Journey was a bit more of a million pieces of scarves with you that but also just like um the epic moments felt like you were building towards them and you know games get a lot of credit these days for being like Oh it's an interactive movie um and then we talk about the Uncharted of the world or or the Call of Duty single player campaigns or stuff like that when when we talk about that but I think that that this game and Journey do it in a way that I haven't seen anything else do in terms of the melding of visual art",
            "start": 811.64
        },
        {
            "text": "player campaigns or stuff like that when we talk about that, but I think this game and Journey do it in a way that I haven't seen anything else do in terms of the melding of visual art style, camera movement, and music. Yeah, I mean, so your point playing that there were points where it felt like those Pixar shorts before it, where there's no dialogue. I mean, and that's one thing we haven't done if you don't know what Abzu is - sorry, uh, underwater, third-person totally free to roam around, not open-world, it's linear, you got areas you go through, you can go to the floor, fish the ground floor, hidden spots, and you know, un-leash new fish by letting them go. You have but then there's some light puzzle-solving of like, all right, I got to get this chain to move and that chain to move and that'll open the door. It's all super simple, all the like gameplay hooks of it are really optional for the most part, meditating isn't mandatory, but if you do it on",
            "start": 859.36
        },
        {
            "text": "move and that chain to move and that'll open the door it's all super simple, all the like gameplay hooks of it are really optional for the most part meditating isn't mandatory but if you do it on everything you get the trophy uh unlocking all these fish isn't mandatory but if you do it you get the trophy kind of thing like that um but there was points yeah playing it where they do such a great job of what you're saying where the base I mean the action is so basic your action as a player in this game is so basic of swimming uh if you want to explore but as I was like trying to get this for the Gamescast right like I was you know not trying to get every fish unlocked and I and I don't even know if I would be motivated to go back for the you know silver trophy but I'm going through and I'm doing it and the music ramps with you the music builds with you until you're at that Crescendo moment and then yeah when you are shooting down you know this this Waterway with all these fish around",
            "start": 904.08
        },
        {
            "text": "doing it and the music ramps up with you, the music builds up with you until you're at that crescendo moment, and then yeah when you are shooting down through this waterway with all these fish around you, going through or collecting more and they're swirling around you - that is that epic moment and that's that payoff, yeah. And it, but that is uh that's the art to me, that is that is the thing that is hard com yeah it's hard to kind of like bring it's not so much the what does it stand for and what is the metaphor of this the art of it is the melding of that stuff in a in a very um emotional experience that is driven by you controlling it. Sure, and it's weird because it's not that far off from the Mario Maker uh levels that people make that are just you hit right once and then it or just hold right and run and it like plays through the whole level for you um or or you know people always talk about certain games like um I mean even Journey is like oh you just hold if you just hold",
            "start": 939.44
        },
        {
            "text": "hold right and run and it like plays through the whole level for you um or or you know people always talk about certain games like um I mean even Journey is like oh you just hold if you just hold straight you'll win and it's like that is an oversimplification of the entire thing like you do have a a control over it and it's a it's a physics based um experience where you're not going to actually finish this game just holding it and just going right but it is those moments where you're talking about like the camera kind of messing up or the controls messing up when you do the flip thing that was the same thing in Flower now Flower was different because you had to move the controller around six degrees access we love it so much but there was a um it you start to feel connected to it in a way that you don't with other games because the the way that you're controlling it becomes like a roller coaster in a lot of ways it becomes like a but you're controlling where it goes so seeing you go through",
            "start": 982.04
        },
        {
            "text": "don't compare it to other games because the way you control it becomes like a roller coaster in many ways, it becomes like a thrill ride but you're controlling where it goes. Seeing you go through the schools of fish reminded me of going through the fields of flowers where you pedal faster and faster and all that stuff, and there's an art to it. It's like Sonic the Hedgehog - that's probably a really good way to bring this up in terms of everyone being like \"oh, you can just go fast and hold right and jump\" - it's like no, that's not how that works. The first couple levels of Sonic are actually more about the physics of it and using ramps to get better at playing the same level over and over so you can understand how to just bounce through it super fast. And I think there's that same level of like, playing Flower reminded me of playing Sonic 2 in Chemical Plant Zone when you're going through... you know, I'm talking about Chemical Plant - it's the one with the purple",
            "start": 1021.6
        },
        {
            "text": "that same level of like playing Flower reminded me of playing Sonic 2 in the Chemical Plant Zone when you're going through, you know, I'm talking about chemical plants, it's the one with the purple water that raises. It's one of the most iconic Sonic levels. Um, being little, I remembering that and anding overwhelmed with a sense of ed and sensation of movement and I'm causing this to do things even though most of it was getting from point A to point B to trigger what's essentially a quick quick time event but I think these games make me feel that way even watching you play made me feel like there's a sense of momentum and when you add the music to that swelling, like that's where the emotion comes from. It's momentum mixed with um this this auditory visual feedback combination that it's just like moment momentum is a great way to describe I think Abzu and where I think people keep talking about how relaxing the game is I think that's true but it's also in the way of at no point in this game was I",
            "start": 1064.08
        },
        {
            "text": "momentum is a great way to describe I think Abzu, and where I think people keep talking about how relaxing the game is. I think that's true in part, but it's also because at no point in this game was I up against an impossible moment right off the bat. There was no inside moment like \"wait, what do I need to do?\" even like Journey, because there were times in Journey where I remember feeling uncertain about something, trying to figure out if this is what I'm supposed to do or not. It's very obvious what the next thing is. So if it is that you want to go explore, if you want to touch every fish and grab on and ride them and do these different things, unlock them all, meditate everywhere, if you want to go collect seashells, if you want to go do all that, you can, and you'll never feel like you've grounded the pace of the game too much. Nor will you ever hit a puzzle so hard that you're like \"what the hell do I do next?\" Yeah, that's cool, I think.",
            "start": 1114.08
        },
        {
            "text": "Feel like you've grounded the pace of the game to the whole noor. Nor will you ever hit a puzzle so hard that you're like, \"What the hell do I do next?\" Yeah, that's cool. You know, I think, and that's what there's a place for that. You know, I'm such a big fan of small experience games right, and I think that this is a perfect it look. It seems like yeah, without playing it, uh, just seeing you play it, it seems like that type of um, of experience. I, I'm excited for it. I, I hope that I get a chance to play it soon, like just timing wise how long is it? Two and a half perfect. You know, like that sounds like a really good time cuz, like you don't need more of that no. And that's, and I mean that's the one thing you know, I mean like where I am with it, I liked it. I think you should play it. I don't think it's on Journey's level at all. I don't think it's you know changing the game. It's got a 79 right now, Metacritic, 83 on IGN. Uh, that all sounds like... The 79 seems like where I would be somewhere in there. It's",
            "start": 1148.08
        },
        {
            "text": "Journey's level at all I don't think it's you know changing the game it's got like a 79 right now on Metacritic, 83 on IGN. Uh, that all sounds... I think the 79 seems like where I would be somewhere in there. It's good, I appreciate it, I like it. I don't think I love it. I don't think I'll ever go back to it. It's funny because like Mitch today on Twitter was talking about a day one removed and I'm still thinking of Abzu. I'm like, I don't think I'm ever going to think about this game again outside of this conversation. Not that that's a bad thing, not that I'm saying the game's bad. Just in the fact of... like, cool. I'm kind of interested to know what was going on there. But I think I kind of get it, in the same breath and just in the end. But like, what was I doing in the end really? But whatever. Inside, I thought about many times you continue to have conversations about it inside. And not only the fact that the gameplay is amazing, not only that it was such a step up from Limbo, but of like, what did it really mean.",
            "start": 1185.44
        },
        {
            "text": "many times you I continue to have conversations about it inside and not only the fact that the gameplay is amazing, not only that it was such a step up from Limbo but of like what did it really mean? You getting those debates and those conversations with people. Yeah, yeah, yeah. Now see that's interesting and I I guess again having not played it I'd be interested to see if anyone ever brings this up uh in the same conversation with Journey in the way that I've heard Limbo and Inside compared. Interesting where people have differing tastes and neither is right or wrong. It's like I can understand the arguments on both sides for this, like yeah Journey is such a masterpiece because it did nail all of these pieces where it sounds like this one at least in your it's not nailing all of those things and that's hard to do you know? I mean like don't you you know you brought up this interesting fact right of like uh you you have hypothesized what that game company's next game is going to be right and",
            "start": 1220.16
        },
        {
            "text": "That's hard to do, you know. I mean, like don't you, you know, you brought up this interesting fact right? Of like uh, you, you have hypothesized what that game company's next game is going to be right, and that here we go. The guy who worked on Journey left founded a studio made this game and released it before we've ever seen anything from that game. And the reason that's happening - and we've talked about, we talked to Jason Schreier at E3 2015 - we're like, is there a lot of pressure? He's like, \"There's so much pressure.\" You know what I mean, to follow Journey to do this right? Like we've started and stopped a bunch of different projects, and what we're working on now, we're still working on. That's why we're not talking about it. And I mean, I can't even imagine because I remember when Flower came out - it was a joke with me and my friends uh, in the sense that I was excited about seeing this game. I saw it and I was like, \"Oh, like this looks weirdly interesting to me.\" Like I'm I'm",
            "start": 1262.28
        },
        {
            "text": "flower came out it was a joke with me and my friends uh in the sense that I was excited about saw we play this game I saw it and I was like oh like this looks weirdly interesting to me like I'm I'm into it and everyone like Greg I'll never forget Greg was talking so much **** Greg only shoots things he just he couldn't wrap his head around but again it was a different time then like like flower pistols yeah this being a um or flower being a PSN game back then PSN wasn't really a thing it's pretty good for a PSN game pretty good for a downloadable exactly exactly that was the conversation and I remember playing it there was the demo and I played the demo and I'm like this is cool I want more so I bought it eventually and then playing through that game like it resonated with me I was just like why do I like this so much cuz there's not much there but I'm like I put in I wanted the art from it you know what I mean I think that that is the key a big part of it yeah with all of",
            "start": 1296.96
        },
        {
            "text": "was just like why do I like this so much cuz there's not much there but I'm like I put in I wanted the art from it you know what I mean I think that that is the key a big part of it yeah with all of these games and and that was my thing with Abzu is that and you know CU like I think the theme of me recently at least this year has been being in the mood right like Ratchet & Clank came out and I wasn't in the mood for Ratchet & Clank and then one day I was and I put it in and it was awesome and then uh you know overcooked recently we were in the mood for a co-op game we got it I'm forgetting one that it was another one that just clicked it was like when I oh A Song of the Deep I wanted somebody to tell me a story these people told me a story and I wasn't in the mood for Abzu right and I always in like in so my reference point for that is that when I put Journey in back in the day I remember putting it in I did a couple things and I texted Clement some joke about it cuz he loved it so much and",
            "start": 1337.72
        },
        {
            "text": "like in so my reference point for that is that when I put journey in back in the day I remember putting it in I did a couple things and I texted Clement some joke about it cuz he loved it so much and I knew he loved it so much and then he texted me back and I texted him and then like the game kept going and then I turned off my phone and I was like wait something's happening here I need like with abzu that didn't happen I was still multitasking doing a million things again not that that's you know whatever I'm it's a great great game it's a good game it's a great game you should play this game but it wasn't like I wasn't in raptured you know what I mean yeah and so I guess that's to me that's that's the interesting part is I remember playing flower and it went from the demo to me playing it and being like I don't know why I like this but I do and investing to towards the later latter half of that game like there once things get dark in that game and like you're there's the the part",
            "start": 1377.56
        },
        {
            "text": "it and being like I don't know why I like this but I do and investing towards the latter half of that game, like once things get dark in that game, and you're there's the part I think it's like midway through, a crumbling cityscape - no, that's the end, that's the end. But like once you're in the field and it's dark and there are electrical towers that **** things up, I was like oh **** this is not just six levels that are all the same thing with different colors, like they are trying to tell a story and I was like I am invested - that was the rest of my day. I had to beat that **** I tried platinuming it before I realized, before I was indoctrinated, just because I was like man, like their next game this must be awesome, and it was like that's the thing is they took all the things I loved about Flower and just condensed it and made it just more manageable, you know, more um less abstract and just more like it is, it's a bit more basic for me with",
            "start": 1414.96
        },
        {
            "text": "they they took all the things I loved about Flower and just condensed it and made it just more manageable, you know, more um less abstract and just more like it is. It's a bit more basic for me. With Flower one of the reasons I think I don't like it as much is momentum, and I feel like I lost my momentum a lot in that game where I'd be going and everything's going great and I'm nailing it, and then like with Six Axis I just missed something, and then try to circle back and it was hard to get back and I got back to it and then try to get back in that rhythm again of where everything was going so well. Yeah, and with with Journey it was a bit more um I think by the books in terms of progression in terms of just like it it was always obvious where you're going and it was one giant um journey and uh in the same way that Flower had the the story elements kind of go like I was saying where like it gets dark and then eventually gets even more dark, yeah, uh with Journey like there's you're I",
            "start": 1462.16
        },
        {
            "text": "and uh in the same way that Flower had the story elements kind of go like I was saying where like it gets dark and then eventually gets even more dark yeah uh with Journey like there's you're I feel like the entire game was telling a story whereas in Flower it was just the last half gotcha that makes sense um and that that's my my question about this game where just from seeing this and from hearing you talk it seems like that is the element that's missing is a kind of overarching narrative that you're interested in throughout 100% yeah when I started seeing the cave paintings and stuff or and they're not cave paintings but you know the art of the old world or whatever it was like oh okay cool I think is this where like what's going and then you get by the end of it yeah and then the end of it it's just like okay yeah I know but and it's but it's not even that like you know this is totally a game that's about the journey not the destination I feel personally but yeah it yeah I I",
            "start": 1503.96
        },
        {
            "text": "end of it it's just like okay yeah I know but and it's but it's not even that like you know this is totally a game that's about the journey not the destination I feel personally but yeah it yeah I I it didn't have that hook to it where I cared about what was really going on in the world yeah and that's one of the reasons I don't think I cared about like are am I are these fish trapped am I helping them I don't know what's going on why do I want to meditate here yeah it's pretty I'll give you that is pretty yeah all right cool I'm definitely stoked for it let us know what you think about Abzu in the comments below I'm excited to hear about that I want to see if there's anybody that likes it better than Journey that would be interesting too you're wrong if you do damn son just let you know delete your Twitter all right",
            "start": 1544.56
        }
    ]
}