{
    "id": 2016,
    "video_id": "KPzq6QFxv6w",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Final Fantasy XV's Delay - Kinda Funny Gamescast Ep. 83 (Pt. 2)",
    "description": "Thanks to Casper for sponsoring this episode!\nGo to http://www.casper.com/gamecast and use promo code gamecast\n\nWill FFXV ever actually come out?\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1472562000,
    "duration": 1240,
    "transcript_chunks": [
        {
            "text": "this episode of the Kinda Funny Gamescast is brought to you by Casper Casper is an online retailer of premium mattresses for a fraction of the cost directly to the consumer Casper combines two technologies we're talking about the springy latex foam and supportive memory foam to create an award-winning sleep surface with just the right sink and just the right bounce let me tell you what Kevin recently Curran my best friend he needed a mattress and I said you should go to casper.com and use the code kinda funny you can get one he did that it was easy to order next thing you know he's sleeping well he's having good night sleeps you could do that too get a Casper mattress for $500 for a twin or $950 for a KingSize mattress comparing this industry averages that's an outstanding price point and you can save $50 towards a mattress purchase when you go to casper.com Gamecast entering promo code Gamecast so there's no no s in there just Gamecast terms and conditions apply free shipping",
            "start": 0.04
        },
        {
            "text": "and you can save $50 towards a mattress purchase when you go to casper.com Gamecast and entering promo code Gamecast so there's no no s in there just Gamecast terms and conditions apply free shipping and returns to US and Canada I want to hear all about your the fun that you're having on your new Casper mattress anyways that's Casper / Gamecast using promo code Gamecast so second topic of the day Greg let me take you back oh my God time tra a little it's another Greg Miller topic all right it was March 30th me and you were down in LA at The Shrine theater they told us we stood on stage and we told the people that Final Fantasy XV was going to come out on September 30th and during it they're like \"201\" this is the date no more delays and we said I believe you Tata and then what did Colin say this game's not coming out on September 30th I want to find a clip of you saying that I don't remember CU I don't think you ever lied beforehand the power of lies so say it comes out in 2021 myal",
            "start": 38.8
        },
        {
            "text": "Colin says this game's not coming out on September 30th. I want to find a clip of you saying that. I don't remember CU, I don't think you ever said beforehand The Power of Lies so say it comes out in 2021. Myal try to find goe find it anyways. Tom Hawkins, find it. Tom, we're Liars. We didn't know it until I like how somebody who tweeted he's like, \"How does it feel that Square Enix made you a bunch of liars?\" Like fine, I don't know. I don't care. I mean, it sucks, you. I don't give a **** about the lying part, but it sucks because I want to play the damn game. Yeah, but I mean, it's like all right, **** happens. I can't believe it happened to be real. I can't either, like wow. Like the fact that they made that event and had they were so **** confident that that was going to be the date. They were so into it; they were so confident that it was the date. And I keep saying this, but said it on content the time when the when they announced it was like the roulette thing that kind of went through and it ended on",
            "start": 104.28
        },
        {
            "text": "so confident that it was the date and i keep saying this but said it on content the time when the when they announced they it was like the roulette thing that kind of went through and it ended on September 30th but before it did that it ended on November 30th and everyones like ah and then it went went down to September and everyones like ah now its November 29th Tata didnt expect that to happen he thought November 30th was going to be the he looked at he's like oh **** so I'm going to read some things and then we can talk about some facts right here speaking to Igic Gamescom Final Fantasy XV director Hajime Tabata explained that a hefty day one patch was originally in store for the game but ultimately he didn't want fans who play offline to be unable to experience the game at his best instead he wanted the game to be in its most polished State as soon as players put in the disc quote originally I was thinking we'd be okay and we could put all the extra updates into a day one",
            "start": 145.32
        },
        {
            "text": "best instead he wanted the game to be in its most polished state as soon as players put in the disc. Quote originally I was thinking we'd be okay and we could put all the extra updates into a day one patch, Tomoto told IGN but at that point I learned there are maybe a lot of people out there who play in an offline environment and don't have internet. When I found that out, thinking about it again, I'm glad I didn't make that decision. It would take about 1 month exactly to fit everything we wanted in the day one patch into the disc version, and with that pretty much all the technical issues would be sorted out. And then we thought that after we got that technical base down there were no problems there it's one more month to polish everything up and get it really great and that's why it was two months as I can't wait for that day one patch to come out whenever they release the game and watch him have to eat those words because of this three gigabyte day one patch all the same",
            "start": 187.04
        },
        {
            "text": "months as I can't wait for that day one patch to come out whenever they release the Final Fantasy XV and watch him have to eat those words because of this three gigabyte day one patch all the same as for What specifically the team is working on, according to Tabata said the game is basically complete but needs extra polish due to the sheer amount of content included. The main thing there is working on fixing the bugs which affect the visuals of the game, polishing that up and doing the final optimization push. The other thing I think we can get much closer to that perfect game balance in the final balancing period as well to make it a game that's really fun and easy and comfortable to play for any kind of player if you keep putting more volume and more content into the game with that comes a load of extra debugging and polishing and optimization periods so we're really concentrating on getting the volume and content we have at the moment getting that really solid and really perfect for the final game so",
            "start": 222.84
        },
        {
            "text": "and polishing and optimization periods, so we're really concentrating on getting the volume and content we have at the moment getting that really solid and really perfect for the final game. So that's where we're at all right? Wait a minute, the man says six or seven weeks before the game is supposed to come out. The game's basically complete, and they're still balancing it - seven weeks before the game comes out. That's what you're doing; you're the game's supposed to be finished at that point, pretty much just done. You might be able to tweak things and get a day one patch going. But the way they talk about this game has me so incredibly skeptical, and it's getting a little... it's it's getting ridiculous. It's actually getting like totally absurd now. You're you know Colin, you have this JRPG expertise; I have Final Fantasy disease, according to Toata. Go ahead and you know, so much about it. You always keep saying that when you look at you talk about this game, it'll be no less than good. I'm starting",
            "start": 257.68
        },
        {
            "text": "I have Final Fantasy disease, according to Tozro. Go ahead and you know so much about it, you always keep saying that when you look at you talk about this game, it'll be no less than good. I'm starting to think it's going to struggle to be good. It's possible I still I still stand by that it's going to be probably good. I just think that it's going to be super underwhelming. I don't even know like where to be like where to begin with everything I've seen with this game now. Now people have pointed out and it's true that it's previewing well at Gamescom. You better **** hope so considering the way it was shown at E3. You better **** hope they had their **** together to be able to get a demo going for Gamescom to get people excited about this. That was at Xbox right where they came out and God one of defin it was a really really bad that was one of the worst things I'd ever seen in any E3 conference, any confence absolutely not true Dem for a game I've never I I can't.",
            "start": 301.84
        },
        {
            "text": "they came out and God one of definitely it was a really really bad that was one of the worst things I'd ever seen in any E3 conference any conference absolutely not true Dem for a game I've never I I can't even I can't even think of a gameplay demo with the exception of anything that like maybe with the Wii when they uh yeah wi music up there Skyward Sword didn't work it's not a demo the the the giant enemy crab thing there's a lot Colin playable demos the yeah the giant enemy crab thing was we that was just weird the we the Wii music thing and the Skyward Sword thing were both bad and the the only other thing that I can think about is is stuff with PlayStation Move and PlayStation VR where things don't work like Wonderbook for instance but that's like in that Echelon that was an awful **** demo I've been I've been to 10 e3s and I've seen way more than that and that one I will I will always remember that demo because I was like what the **** is like how can you possibly think that this",
            "start": 341.36
        },
        {
            "text": "I've been to 10 E3s, and I've seen way more than that. And that one, I will always remember that demo because I was like, \"What the heck is this? How can you possibly think that this was an acceptable thing to show?\" What's wrong with you guys? Like it to me, like I would be so mad at that team at this point if I was in the execs. If I was in the executive ranks there, I'd be like, \"You guys are ****, you guys seem incompetent.\" To be perfectly honest with you, you know? Like how long is this saga gonna have to go on until people get their goddamn game? You know, it's not been a decade yet, but that's not long enough to deliver the game. I was ****, I was a junior in college when it was announced. I am 31 now, you know? Like release the goddamn game already; it's becoming like a joke. And and people will find it because I did joke around after I did joke around after that wasn't going to come out. Like I remember saying it, and that's why when I saw the delay date, I'm like, \"Well, I'm surprised.\"",
            "start": 382.96
        },
        {
            "text": "find it because I did joke around after I did I did joke around after that that wasn't going to come out like I remember saying it and that's why when I saw the date I'm like well I'm surprised you didn't just delay it six months because clearly it needs like all this but at the same time you have to get off the pot they don't want to lose holiday sales and all that kind of stuff that said like the sad thing is that a Final Fantasy game should be better than good it's a Final Fantasy game and yeah maybe I do have Final Fantasy DS because I expect something good and we haven't gotten a great Final Fantasy game in years years and years the last time we got a great Final Fantasy game I was a kid when we got a like a truly in my mind a truly great the last time in my opinion that and I know people disagree that we had a fantastic Final Fantasy game was Final Fantasy 9 you know and and that's a long time ago I was in high school and yeah some you know a lot of",
            "start": 423.44
        },
        {
            "text": "my opinion that and i know people disagree that we had a fantastic Final Fantasy game was Final Fantasy 9 you know and and that's a long time ago I was in high school and yeah some you know a lot of people like 10 some people like 12 for some reason and then 13 people like 12 a lot of people really like 12 for 12 tale of two games so to me it's a situation it's becoming this is becoming probably embarrassing for them and they better hope this game's **** awesome because if it's anything less than that people are going to be people are just going to eat this game alive and I'm going to play it I'm I'm curious about it I think the mechanics look interesting I think the world looks interesting that like those characters look awful I I have to I was watching like video and and reading about like just i'm like man i don't know what they're thinking about with like these characters but nonetheless the hunt system looks cool and all that like so i'm i'm going to get into it and try it out",
            "start": 460.64
        },
        {
            "text": "like just I'm like man I don't know what they're thinking about with like these characters but nonetheless the hunt system looks cool and all that like so I'm I'm going to get into it and try it out I just feel like that excuse seems to be a copout excuse it's total nonsense all like I can't IM imagine that many PS4s and Xbox Ones are not connected to the internet in some respect well I mean make any sense because day one patch is going to be huge for this game yeah and they're going to have a day one patch anyway that's going to be just iterative and different than the day one patch that they were going to have it's just like the game obviously isn't up to snuff and it and it plays out these rumors you've been hearing about this game are anecdotal and secondary and tertiary there are cuz I haven't heard them directly I'm just reading about them um that the game is kind of messed up and and I don't know if it's true or not but when you see things like this because to",
            "start": 503.04
        },
        {
            "text": "are cuz I haven't heard them directly I'm just reading about them um that the game is like kind of **f**ed up and and I I don't know if it's true or not but when you see things like this because to your point when you guys it's not even that you guys hosted it like it doesn't matter like when they went to the shrine and Auditorium and announced that date that was the drop dead date they probably obsessed over that date they probably got all their ducks in a row 8,000 different ways to make sure that they're going to hit that date and it's still they still missed it that tells you everything you need to know about this game is production and way this game is being run and the bigger thing is you better have major **f** concerns about Kingdom Hearts 3 and you better have major **f** concerns about Final Fantasy VII remake because the same producer and director and executive and and executive teams are overseeing all these games even though CyberConnect is making Final Fantasy VII like how",
            "start": 540.32
        },
        {
            "text": "about Final Fantasy VII remake because the same producer and director and executive and and executive teams are overseeing all these games even though CyberConnect is making Final Fantasy VII, like how you can have any faith in their Japanese output at this point at the Triple A level as I talked about I think on PS I Love You or on Col Greg at some point it's beyond me it's it's it's and like I said props Square Enix for investing wisely a decade or so ago in a lot of Western Studios because that's the stuff that actually matters to them now you know this this other stuff you know messing around with Dragon Quest X and doing all this kind of like you know and Final Fantasy XV and The Saga Final Fantasy XV as a final fantasy fan and as a Dragon Quest fan it makes me sad like Square Soft back in the day was like like they were hero status to me I loved them and I'm kind of disappointed in the way this is being being handled sure it's just like ridiculous it's just ridiculous it's",
            "start": 574.88
        },
        {
            "text": "back in the day was like, they were hero status to me, I loved them and I'm kind of disappointed in the way this is being handled, sure it's just ridiculous, it's the latest thing you're always talking about right now, not fall but like what's going on with Square Enix now, based on what they were before, especially the Japanese branch of it, I don't have that affinity but you do, in terms of what you thought they were, here without Square Enix, you know, like not even a prayer of me being here without Square Enix and the games and the influence that they had on me, the thing is that I know a lot of people care about this game and I wanted to be good, like I said before, like I don't really get off on **** on **** on games or hoping games are bad because I hope all games are good, I just have to call it like I see it, this game is tortured, whether or not it turns out good or bad, I don't know, I think it's going to turn out fine but I don't",
            "start": 612.8
        },
        {
            "text": "bad because I hope all games are good I just have to call it like I see it this game is tortured whether or not it turns out good or bad I don't know I think it's going to turn out fine but I don't think fine is going to be good enough I'm worried and I'm only worried because I want it to be so good it's like I I really it's not just like I want all games to be good I want this game to be good I want this game to be awesome I it's not just like that that I remember when this game was announced I remember being so excited when Final Fantasy XV was announced this game meant so much to me I bought a PS3 for this game you know and that's the thing it's like I'm okay with it like it's I was so excited about this game for so long that I'm like I don't care like it didn't happen and there was all this stuff as far as I'm concerned this game hasn't been in development for a decade it's been in development for the last couple years what this game is is not the game that we saw back then at all",
            "start": 651.0
        },
        {
            "text": "Final Fantasy XV's Delay - Kinda Funny Gamescast Ep. 83 (Pt. 2)\n\nstuff as far as I'm concerned this game hasn't been in development for a decade it's been in development for the last couple years what this game is is not the game that we saw back then at all the game we saw back then was in the Final Fantasy Versus XIII world and they totally gave up on that went a totally different direction and created a whole other Final Fantasy Versus XIII world and that's a whole other thing but with this the whole the boy band car road trip thing I'm super sold on that I'd love that type of **** so I'm like all right cool just give me an interesting battle system give me give me something that is fun and that's the thing that I'm a little bit worried about cuz the demos I've played so far the um I don't know how to say it but the dream sequence the no no the one before that before there was the Platinum demo Deke or whatever Duke whatever uh it it was good I enjoyed it I had a lot of fun with it it surprised me how much I liked it cuz I was way worried about that um but the battle system it felt like",
            "start": 688.6
        },
        {
            "text": "Deke or whatever Duke, it was good, I enjoyed it, I had a lot of fun with it, it surprised me how much I liked it, cuz I was way worried about that. But the battle system, it felt like it needed a little bit of work. We've seen them do a lot of work on it, then they put out the Platinum demo and honestly I didn't like that, like I thought it was way too slow, you'd just be doing things and there wasn't a lot of thought put into it, which is opposite of what I enjoy about Final Fantasy games. I love the battle systems to keep me on my toes and not just have me constantly doing the same thing over and over. I want to have to switch between things. I get early on in the game RPGs you're going to just keep hitting attack and that's all that matters but I want more from that. I feel like I remember playing a demo of Final Fantasy 7, I remember playing the demo of Final Fantasy X-2, I remember all that stuff and even then there was still challenge in the demo.",
            "start": 726.92
        },
        {
            "text": "more from that I feel like I remember playing a demo Final Fantasy VII I remember playing the demo of Final Fantasy X I remember all that stuff and even then there was still challenge in the demo playing the demo this there wasn't any challenge I remember the Final Fantasy X-2 demo being challenging yeah it put you pretty far not far into the game but maybe almost not a third somewhere around there yeah I remember that I remember that well because I remember dying which I thought was weird and that's cool though there's no way you could have died in the Platinum demo and here's the other thing about it and I don't want to pick on these guys I mean I'm sure that they're trying it's not a personal thing it's just stop like what's with the **** demos anyway just go away you know like I I don't I don't like just finish the goddamn game like I I don't I just don't understand you don't have the luxury of releasing these demos when people have been waiting for these games for that long",
            "start": 764.48
        },
        {
            "text": "I don't I don't like just finish the goddamn game like I I don't I just don't understand you don't have the luxury of releasing these demos when people have been waiting for these games for that long and tweaking things just you know what you got to go with your gut and finish the goddamn game already and and I like the the scary thing Tim the scary thing is is I don't even believe this next release date that's that's the scariest thing of all I'm like I don't I don't know I I I just don't I just don't even believe them I believe it when it's in my goddamn console I would have sworn on September 30th date you know it's just like was again they made such a big deal they were so confident I mean behind closed doors with us talking about it ha and that's the thing is it sucks like personally having met these people and knowing these people it's just like you know they they believe in this and I know that there's nobody that's more upset about this than them we understand this we make",
            "start": 805.28
        },
        {
            "text": "having met these people and knowing these people it's just like you know they they believe in this and I know that there's nobody that's more upset about this than them we understand this we make content we don't get things done by the time we say it's so upsetting to us and I understand that and we feel like I hate you I that but see that's a perfect example all these people say all these other things the person himself now here he's saying but there's the problem of translation and all this other stuff at least for me there's not translation issues you know hell a lot and I got to try to tell people what that means no people know what that means Greg and if they don't them whoa yeah so Final Fantasy XV my biggest concern with it right now is that it is being pulled in two completely different directions I am only seeing two opinions on it the people are like it's been tortured it's been delayed so many times it's been this this and this like there's no chance it'll",
            "start": 841.52
        },
        {
            "text": "completely different directions I am only seeing two opinions on it the people are like it's been tortured it's been delayed so many times it's been this this and this like there's no chance it'll be good whatever it's like all right cool you've already made your decision and then there's the people that like it looks awesome this game is awesome I'm going to love this game I've loved everything and I'm like did you play the Platinum demo are you really saying that right now cuz I don't trust you anymore if you say that and it's like so then there's somewhere in the middle where I'm like all right but what about me am I going to like this you know I do want to like it I am going to give it the benefit of the doubt and to be completely real there's so much potential for me they are nailing the soundtrack the visual look of it I do like the characters I do like the story that we've seen Beyond just the basic thing of oh it's guys in a car it's like hearing about the story of the Wheel",
            "start": 879.84
        },
        {
            "text": "Final Fantasy XV's Delay - Kinda Funny Gamescast Ep. 83 (Pt. 2) soundtrack the visual look of it I do like the characters I do like the story that we've seen Beyond just the basic thing of oh it's guys in a car it's like hearing about the story of the Kings and the stuff and a lot of the stuff that we got um as like prep for when we were presenting and stuff I'm like this is interesting this is cool this is Final Fantasy no that was the whole thing I mean I've talked about it right like I'm not a final fantasy guy and that's why they wanted me and you for that thing cuz we're the Spectrum and like when you sit there and talk about the story like yeah I mean they all look like a J-pop band but I like the idea of they were on this road trip and he's out for this girl and this is what's happening when I see the trailer and there's like Cloud Strife in it I'm like I don't know what the **** happening but like that part sounds cool and a road trip sounds cool and that's something I can connect with wrap my head around yeah I hope the game",
            "start": 915.0
        },
        {
            "text": "gods in a baby I'm like I don't know what the **** happening but like that part sounds cool and a road trip sounds cool and that's something I can connect with wrap my head around yeah I hope the battle system is fun I like the open world style of it but as this continues to go on you're just left going well what the **** happening and reading through thread upon thread upon thread on NeoGAF and game facts and all this stuff about the Gamescom demo that people got to play I it it confuses me because there was conflicting reports there's so many people that are like did you see that whole thing about the screenshots that were leaked that looked like a PS2 game and they were horrible and there was a whole thing of like Is that real is people are trying to make this game look bad meanwhile there's other threads that are like nothing but praise and being like surprisingly it's really good I've heard a lot of praise for the game coming out of Gamescom and I trust that",
            "start": 948.04
        },
        {
            "text": "look bad meanwhile there's other threads that are like nothing but praise and being like surprisingly it's really good I've heard a lot of praise for the game coming out of Gamescom and I trust that that's what I keep saying is like no matter how hard I'm I'm hard not necessarily on the game itself I'm hard on this cycle this inexcusable cycle for this game yeah the game is different but the Project's the same right like I don't even understand how this turned into Final Fantasy XV or what they were even thinking with this anyway like they should if they just canceled it and didn't say anything and then just like we're going to you know get off the pot with this game and the thing that bothered me the most is not necessarily the delay because listen a delay I can't think",
            "start": 985.28
        },
        {
            "text": "nearly as sad frankly you know like they got to **get off the pot** with this game and the and the thing that bothered me the most is not necessarily the delay because listen a delay I can't think of a single game that was bad because it was worse off from being delayed I I can't think of one like delaying a game is typically good um for the game maybe not for us as consumers or for us as enthusiasts and excited people but that excuse is **bad** and and like I've never heard of an excuse like that in 2016 of saying like the the console you all connect to the internet uh and download patches for every one of your games we're concerned that some of you what is it like a microscopic amount of people like a **handful** of people that don't connect the PS4 the Xbox One to to the internet you're worried about them really it's such a bad excuse just say you need more time like and you know just that was the thing that got me the most I'm like what are you talking about you're worried about",
            "start": 1025.36
        },
        {
            "text": "\"Worried about them really, it's such a bad excuse. Just say you need more time, like... And you know, just that was the thing that got me the most. I'm like, what are you talking about? You're worried about the patch not being able to be downloaded again? Like this sucks because, like, it really just sounds like I'm defending him just to defend him. But with this, it's like... The only reason this exists is because Andrew Goldfarb or whoever it says - I'm assuming it's Andrew Goldfarb - pressured him into it. It was just like, so why is it delayed then? He gave an answer now, and it's on record, you know. Whereas maybe it is all those things... You know, this is just what he said, and that's that's how that works. And that is his fault; he shouldn't have said this, you know. But and it's up to the PR to spin a better narrative, and I think that you know - not that that's what we want as... As on our side, that's their job. And first of all, I wouldn't have let him take any interviews at all after that delay announcement.\"",
            "start": 1066.36
        },
        {
            "text": "narrative and I think that you know not that that's what we want as a side, that's their job. And first of all, I wouldn't have let him take any interviews at all after that delay announcement. I think that was a huge mistake. Because people are obviously going to have aggressive questioning - a line of questioning for I would too, that your readers or your viewers or fans want answers and you're going to find them. Um, but this just raises questions about the entire project in terms of the way it's been managed the entire time. And um, yeah, I might have Final Fantasy disease uh as he put it because I have high expectations. And I really, I really for for the sake of you know Final Fantasy fans everywhere - fans like you that are really super excited about this game and for people like me that just want to play good games, I I I hope I am blown away, I hope this game is Game of the Year. I really do, you know. And everyone can tell me I was wrong and everyone else was wrong about the",
            "start": 1104.2
        },
        {
            "text": "me that just want to play good games I I I hope I am blown away I hope this game is Game of the Year I really do you know and everyone can tell me I was wrong and everyone else was wrong about the game I hope that I I hope it's great I hope it's phenomenal but I don't know how you can possibly think that that's going to be the case either but I do not but I do not think the game's going to be any worse than good see I think that's I think that's the more likely scenario is that people are going to tell you you're wrong because this is not going to be good that's that's going to be sad that's going to be that's going to be the an unfortunate culmination of a project that the sadest thing for me is that I'm never going to get to play Final Fantasy Versus XIII and like that sucks cuz that is what I want so badly like I I can even see in my head now not even just the first trailer the second trailer the third trailer the ones they showed at E3s like the that Stella character the girl that",
            "start": 1149.64
        },
        {
            "text": "what I want so badly like I I can even see in my head now not even just the first trailer the second trailer the third trailer the ones they showed at E3s like the that Stella character the girl that they had like like I wanted their story now she's not even in it now it's someone that kind of looks like her and it's like it is weird where they they had all of this stuff and then they're like all right we're going to take kind of bits and pieces and change things and I get it I haven't played it yet so what am I I'm judging all this based on trailers I am judging it based on trailers they showed me you know so it's like yeah it's been a long decade right it's just it's just an incredible it's just an incredible Saga that's about you know even if it's not in September obviously it's going to be in November or maybe maybe not uh it it's going to come to an end so we we'll see we'll see and I hope I put it in my PS4 for and it's it's it's fantastic and and more than worth the wait but you",
            "start": 1183.32
        },
        {
            "text": "to be in November or maybe maybe not uh it it's going to come to an end so we we'll see we'll see and I hope I put it in my PS4 for and it's it's Final Fantasy XV is fantastic and and more than worth the wait but you know I'm not that's all that I want I don't give a **** if it's perfect I just want to like it please",
            "start": 1220.64
        }
    ]
}