{
    "id": 1984,
    "video_id": "l5t0Ebqrj6U",
    "show_name": "PS I Love You XOXO",
    "hosts": [
        "Colin Moriarty",
        "Vince Ingenito"
    ],
    "title": "The Promise (and Deficits) of PlayStation 4 Neo - PS I Love You XOXO Ep. 48",
    "description": "IGN's Vince Ingenito joins Colin to talk about why PS4 Neo makes a lot of sense and no sense all at the same time, how Final Fantasy XV could possibly be delayed yet again, and why unhinged expectations may have gotten the best of No Man's Sky.\n\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1471363202,
    "duration": 6976,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations. Welcome to PS I Love You XOXO. I don't know what episode number this is, but we'll figure it out later. My name is Colin Moriarty. This is Vince Ingenito filling in for Greg Miller today who's off doing something. Vince from IGN.com. IGN.com. You want to give a high five? Just very softly like that. No, that's it. That's enough. No, that's enough. No more. I wanted I wanted the clasp, but he wouldn't give it to me. All right. I want I want the And then Oh, that's kind of hot. It is. My dick moved like just a little bit. Minor dick movement. Uh, welcome to the show. Uh, you guys were asking for different kinds of guests as we could rotate them in when Greg and I or I aren't here. Um, and so we have Vince here. Now, I do apologize to the fan bases. We said like a week or two ago, we did something like 40 something consecutive episodes with neither of us being gone. And then over the last 5 weeks, I think we've both been gone like multiple times. So,",
            "start": 0.5
        },
        {
            "text": "a week or two ago, we did something like 40 something consecutive episodes with neither of us being gone. And then over the last 5 weeks, I think we've both been gone like multiple times. So, the show is already falling apart. I thought I was going to be the first one. I'm like, \"Oh man, I'll hold it up for everybody.\" Uh, but Vince, thank you for taking the time to be with us here today. We have things to talk about, some big news. Uh before we get into that, uh a few things. First of all, Greg's looking sharp today in the corner on his white chair. I wanted to let everyone know that he's usually not here for the show, but because we're using uh our old janky kind of soundboard. Basically, we've moved everything over to the new studio. And by the way, the new studio is fantastic. So, so we announced that we are going to do a 12-hour live stream on Monday, August 22nd, uh from 10:00 a.m. to 10:00 p.m. Pacific time. We're going to show the new look of all the shows. And you do a 12 hour",
            "start": 63.28
        },
        {
            "text": "that we are going to do a 12-hour live stream on Monday, August 22nd, from 10:00 a.m. to 10:00 p.m. Pacific time. We're going to show the new look of all the shows. And you do a 12 hour No Man's Sky. Yeah. And we're gonna play No Man's Sky and put a gun down my throat. Uh so uh we are going to show the new studio, the new space. We're excited about it. Kevin and Nick have done an extraordinary job over there getting everything together. I said this on NeoGAF today when I was just dropping in because someone made a thread about it about our new space where I was like, you know, a threat or a threat. A threat. Well, remove the D and the T and mix them around. It's probably the same thing. Someone was saying uh well I was basically saying we have no business being in a space that cool. That is it's I think exceeded my own expectations. I think I can speak for Greg because he doesn't speak for himself. I speak for him. And so um so we uh we're impressed and and this is",
            "start": 99.12
        },
        {
            "text": "that cool. That is it's I think exceeded my own expectations. I think I can speak for Greg because he doesn't speak for himself. I speak for him. And so um so we uh we're impressed and and this is basically the very last episode of PS I Love You XOXO that we will ever do in this space. And as far as I know, Kevin, with the exception of the GamesCast exclusive that we record in two days with Danny O'Dwyer from GameSpot, this will be the last show we will ever record from this space. down. Yep. You're shutting it down. I'm closing the joint. Your bad your bad news and your bad luck. So, uh, so we're sad to say goodbye to the space, but we're excited to say hello to the new much bigger, much more, I would say, prolific space that will allow us to grow. Greg always uses the, uh, the analogy, uh, that the turtle can only grow as big as the aquarium that he's in. And I think it's actually a really good analogy. And we've grown as big as we can grow in this, in this very limited space, working",
            "start": 138.8
        },
        {
            "text": "that the PS4 Neo can only grow as big as the industry that it's in. And I think it's actually a really good analogy. And we've grown as big as we can grow in this, in this very limited space, working around a kitchen table and all this stuff. So, we so we're renting a very nice space above a comic book shop. Um, and uh, we're excited about it. We're here in San Francisco, so we didn't have to leave, which was one of my prerequisites or I would have just quit. And um, unless we went to New York, of course. Uh, so yeah, that's rolling out. You can go to youtube.com/confunn and check out the video. We kind of just did a little sizzle about it. It's also on the social media outlets, but basically come join us for the the Twitch uh stream, twitch.tv/confunnames. Monday, August 22nd, 10 a.m. to 10 p.m. uh, Pacific time. All the new shows, a bunch of shenanigans. We're excited to show it uh, show that off. Just silliness. But uh in the mean so this is this is it and and a little spoiler for",
            "start": 179.28
        },
        {
            "text": "10 p.m. uh, Pacific time. All the new shows, a bunch of shenanigans. We're excited to show it uh, showcase that off. Just silliness. But uh in the meantime, this is this is it and and a little spoiler for continuity's sake next week's PS I Love You XOXO we've already recorded what do you think of that? Next week's PS I Love You XOXO we've already the future has already happened and it's if you're looking for our thoughts on PlayStation 4 games in particular in terms of like what we think are the best ones you might like that particular episode now uh we also recorded uh let's see we have a GamesCast we did Game Over Greggy So, we've actually kind of been testing out the new stuff over there and it's very cool. That's all I'll say. Is that fair enough, Kevin? Is that good enough? You're nodding in agreement. That works for me. Uh, PS, I Love You. XOXO airs every Tuesday at youtube.com/kindafunnygames. Also on podcast services around the globe. It is the play. It is the internet's number one",
            "start": 213.6
        },
        {
            "text": "in agreement. That works for me. Uh, PS I Love You XOXO airs every Tuesday at youtube.com/kindafunnygames. Also on podcast services around the globe. It is the play. It is the internet's number one PlayStation podcast. And I was going to say it's PlayStation's number one PlayStation podcast, but that's not true. Uh Vince, we always start with the Ropers report, but since uh Greg's not here, we won't do the music or the sound or anything like that, but I will tell you that there are eight items on the list this week. Eight news items that I think we should talk about. I should turn my mouse on. Very helpful. There we go. For moving stuff. It's kind of a satisfying noise. Yeah, it's very nice. Very nice. Very nice. Um okay, let's get into it. The news. Are you ready? this. Oh, I'm born ready. I was born ready. You have a lot of good insight. So, I think this should be a good episode. Oh, god. What do you think, Greg? I hope you weren't I hope you weren't hanging this episode on my",
            "start": 256.8
        },
        {
            "text": "Ready. I was born ready. You have a lot of good insight. So, I think this should be a good episode. Oh, god. What do you think, Greg? I hope you weren't hanging this episode on my insight because No. Well, we'll see. I'm sick of putting my insight out there. Number one, it looks like Sony is ready to reveal the next iteration of the PlayStation 4, code-named PS4 Neo. Both Greg and I were sent invitations, and I'm sure Vince will do to the so-called PlayStation meeting in New York City at the PlayStation Theater on September 7th. Nothing else is known about the event, including on uh on what will be shown, revealed, and discussed, but we do know it will be streaming, and Greg and I will likely be foregoing being there in person, so we can do pre and post shows for the stream presumably on twitch.tv/confunnamemes, maybe put on VOD later on YouTube. Um, but we have we'll have finalization on that later. Are you going to the event? I'm not",
            "start": 299.84
        },
        {
            "text": "pre and post shows for the stream presumably on twitch.tv/confunnamemes, maybe put on VOD later on YouTube. Um, but we have we'll have finalization on that later. Are you going to the event? I'm not going to be the one going uh unfortunately, but we're going to have a capable individual uh there on site uh reporting from there and I'm sure we'll be breaking uh news from that event as it happens um on IGN period comm. But uh yeah, no, I I really wanted to go. It's uh it's interesting to me, you know, I think they needed to do this. I feel like they they I think they might have been caught a little bit off guard by how powerful Scorpio is purported to be when Microsoft talked about it at their press conference cuz um I said this before and like I guess to a lot of people it might not mean anything unless you're into PC gaming or you follow these things but like six teraflops which is supposedly the kind of computational power that uh the Scorpio is uh purporting to have is uh that's no",
            "start": 338.88
        },
        {
            "text": "unless you're into PC gaming or you follow these things but like six teraflops which is supposedly the kind of computational power that uh the Scorpio is uh purporting to have is uh that's no joke That's a much larger leap than I think anyone had predicted It's almost it's it's it's almost not um ridiculous to say that the Scorpio is almost like an Xbox Two Um it's almost as much of a jump just in terms of raw computing power It seems like it's almost as much of a jump from the one to the two as there was from the 360 to the one And I don't know that Sony was ready to hear a number that big Um but that's you know it makes some sense right Because Microsoft is really behind you know is really behind the eight ball on on in terms of penetr penetration and console sales Well in terms of optics I would always say too I mean Xbox One is out selling Xbox 360 um compared to like you know this far into its release cycle whatever Um so I always like to say that",
            "start": 380.48
        },
        {
            "text": "Well, in terms of optics, I would always say too, I mean, Xbox One is out selling Xbox 360 um compared to like, you know, this far into its release cycle, whatever. Um, so I always like to say that even though PS4 is clobbering Xbox One in most metrics, um, it is worth noting Xbox One outsold PS4 last month in North America for the first time in a long time, which I didn't put in the news report because we'll get full NPD probably next week. So, I'm going to wait on that. But, um, I just like to throw that out there that Xbox One isn't necessarily, you know, wallowing in nothingness. It's just by comparison to the PS4. Um, it's certainly not doing as well. But, but we did get a question about this that I wanted to bring up that kind of goes into this. Um, n Hollywood asks, uh, says, \"Congratulations on you guys being invited to the PlayStation meeting in New York City on September 7th. Do you have any expectations going into this event? And if so, do you think those expectations",
            "start": 420.64
        },
        {
            "text": "\"Congratulations on you guys being invited to the PlayStation meeting in New York City on September 7th. Do you have any expectations going into this event? And if so, do you think those expectations will be met?\" Uh, my own expectations are simple. I think that they need to just show the console and find a clever way to market this thing in a way that won't make old PS4 fans feel isolated or alienated away from a new fan base that's going to grow with a more powerful hardware. Because I do feel like, as I've said many times, there's going to be some sort of issue, I think, with saying like this is God of War and look how good it looks. Look how good Kratos and his son look and it's running on Neo and everyone's gonna be like, well, what about how does it look on the old PS4? Are they are they going to show side by side images at E3 next year being like this is the game on Neo and this is the game on PS4. They can't do that. And then but of course they can't. So then like there's just",
            "start": 464.08
        },
        {
            "text": "They're going to show side-by-side images at E3 next year being like this is the game on Neo and this is the game on PS4. They can't do that. And then but of course they can't. So then like there's just going to be a lot of questions. Are there going to be is it going to be like better than better on Neo or whatever it's going to be called on on the box. So I just I'm curious about how this goes. I I feel like there's there's not only the the computational problem that you were talking about about how this doesn't seem to be a quantum leap like Scorpio was and I've talked about that on the show. That's why I think Scorpio seems like a much more reasonable machine. Not only because of its power jump, but because it's coming out four years after the console came out as opposed to 3 years, right? Um, but they have this obvious marketing challenge, an optical challenge about how they're going to appease 45 million PS4 unit owner unit owners that are accustomed to what they already have.",
            "start": 503.36
        },
        {
            "text": "right? Um, but they have this obvious marketing challenge, an optical challenge about how they're going to appease 45 million PS4 unit owners that are accustomed to what they already have, right? And I think that comes from, you know, there were rumors about this, but nothing solid came through about it. Um, there were rumors about, you know, Sony cooking up some kind of an agreement that all people who wanted to all all companies, third party and obviously first that want to publish a game on their platform are going to need to commit to a regular standard version and a Neo version. Um, and that, you know, you can't tank the you can't make something that's designed to the Neo spec with the idea that it won't run well and operate well at the standard spec. They It sounds like they have a plan in mind of some kind to make sure that PS4 owners, vanilla PS4 owners, aren't going to be getting the shaft. They may not be getting the better experience. But they're I think they're",
            "start": 537.04
        },
        {
            "text": "have a plan in mind of some kind to make sure that PS4 owners, vanilla PS4 owners, aren't going to be getting the shaft. They may not be getting the better experience. But they're I think they're they're trying to put something solid in place to make sure that developers don't just shaft existing PS4 owners because that would obviously be terrible for everybody. But like that begs the question then how do they sell developers and publishers on the idea that it's worth their time and money to essentially develop and certify which isn't cheap um two versions of the game. But like I guess my my immediate counterpoint to myself though is that they're already doing that. You know the the PS4 was intentionally made in terms of its architecture to be very similar to a PC for a reason. That's why they can spec their games, developers can spec their games on a PC version and then easily translate, you know, the performance uh or scale it down whatever uh for the console version. So being as",
            "start": 579.76
        },
        {
            "text": "they can spec their games, developers can spec their games on a PC version and then easily translate, you know, the performance uh or scale it down whatever uh for the console version. So being as it may that PC games are already can be made to a whole variety of different specs, developers are kind of already in a situation where they're um where they're making several versions of the game uh if their game is going to be on PC that is. So, it's like if you can put your game on PC, then you can put your game on two different versions of the PS4, assuming that Sony supports it the right way, doesn't make totally uh oppressive rules about it, and then maybe they give people a break on the certification costs. I don't know. I I think the thing I'm expecting and hoping to see more than anything from the from the from the event isn't so much what the box looks like or how powerful it is, but what they're doing to make sure this isn't doom and gloom for developers. Because the reason the",
            "start": 624.24
        },
        {
            "text": "from the event isn't so much what the box looks like or how powerful it is, but what they're doing to make sure this isn't doom and gloom for developers. Because the reason the PS4 has succeeded so well um and the reason why I think I was so excited about it even right from the beginning was because it was very clear from the specs and from their posturing they were putting the developer first and I've always known and felt that that was the way to make a powerful uh successful uh gaming platform is to think about what the developers need. If suddenly you start putting in all kinds of crazy rules and requirements that cost developers time and money, suddenly the PlayStation platform isn't as strong. So, I really want to hear out of this meeting what they're doing to make sure that this is something that works for not just Sony and not just PS4 owners, but that works for developers because if it doesn't work for the developers, it's not going to work for any of us",
            "start": 666.32
        },
        {
            "text": "Sure that this is something that works for not just Sony and not just PS4 owners, but that works for developers because if it doesn't work for the developers, it's not going to work for any of us, right? I agree with you there and I Yeah, they they have a lot of challenges. I think these are unforced errors, but as we were talking about at lunch, um they might be smart to be ahead of the curve here depending on the the the direction that the gaming industry is going. I think it's just that the console space has to get used to this new reality and I think they're going to very quickly. We got another question. This one's from Ricky who asks um would Sony be crazy enough to stealth release a new PS at the PS meeting on September 7th in New York City. With the Nintendo NX being a handheld, is it possible that Sony heard rumblings about this a year ago and decided that it was time to dust off the PS2 plans? I think that this might be a smart move for Sony if the new\n\nI corrected the following:\n\n- \"VA\" → \"PS\" (assuming it's PlayStation)\n- \"VA 2\" → \"PS2\"\n- Added capitalization to \"Sony\", \"PS4\", and \"Nintendo NX\"",
            "start": 707.76
        },
        {
            "text": "being a handheld, is it possible that Sony heard rumblings about this a year ago and decided that it was time to dust off the PlayStation Vita 2 plans? I think that this might be a smart move for Sony if the new PS Vita dubbed PS Vita Trinity over a gaff. Get it neo-morphous and trinity to get some handheld market share before Nintendo comes out. If the if the drops if this drops the need for proprietary memory cards or supports SD cards, Sony may have a hit on their hands. Much love and adoration, Ricky. No, this rumor I don't know if you saw was percolating last week because there were some patents coming out of Sony that indicated that they were making a mobile device. Um, and it could be maybe a slim down PS Vita or a new PS Vita. Um, I don't know if you want to call it a new PS Vita, new handheld, who the hell knows what it would be called. I've often said that Sony is crazy enough to do it. I I and I've used that exact terms that Sony's absolutely crazy enough and I'm sure that there were R&D plans and",
            "start": 744.24
        },
        {
            "text": "knows what it would be called. I've often said that Sony is crazy enough to do it. I mean and I've used that exact term, that Sony's absolutely crazy enough, and I'm sure that there were R&D plans for a new Vita or new handheld um before they realized that that wasn't necessary. I think that this is a left-field kind of thing that would be make me so happy. But but I don't I just don't see why they would do that. Neither can I. Um, the one thing that I think is more likely, Vince, is that and and Greg and I discussed this I think on GamesCast last week, but I think it's I think it's possible is that in addition to revealing the Neo inevitably on September 7th, um, that they will reveal a slim PS4, um, thus being able to precipitously drop the price of the PlayStation 4 and keep maybe Neo at the same price point or just a notch above $350, let's say. How do you feel about that? Do you think that they're just going to focus on the Neo or do you think they're",
            "start": 778.88
        },
        {
            "text": "\"4 and keep maybe Neo at the same price point or just a notch above $350, let's say. How do you feel about that? Do you think that they're just going to focus on the Neo or do you think they're going to be like, \"Oh, for a cheaper PS4 Pro experience, for instance, or a two, you know, whatever $249 experience, we'll have this slim PS4 standard model or are they going to phase the PS4 out basically and is it possible that maybe the Neo becomes the new standard model going forward?\" Um, if the Neo becomes the new standard model going forward, they'll have a I think a whole lot of angry people on their hands. I don't think I don't think that anyone So, that what I just spoke about before, right? The idea that they're possibly trying to think of u mandates that will make it so that the PS4 Neo doesn't end up cannibalizing uh the PS4 market. Um I I think those two ideas would be kind of in direct contrast with one another, right? Like I don't see any reason why they would uh we'd be hearing rumors\"\n\nI corrected the following:\n\n* \"Neo\" is already capitalized as it's a proper noun (PS4 Neo), but I added quotes around \"$350\" to match the original text.\n* Changed \"199 experience\" to \"PS4 Pro experience\", assuming that was the intended reference.\n* Changed \"two, you know, whatever $249 experience\" to simply \"$249 experience\" for clarity and grammar.",
            "start": 820.88
        },
        {
            "text": "end up cannibalizing uh the PlayStation 4 market. Um I I think those two ideas would be kind of in direct contrast with one another, right? Like I don't see any reason why they would uh we'd be hearing rumors that that they're trying to make sure that developers develop for both systems if their plan is to eradicate one. Um, and I don't see any reason why it would be a good idea for them to take something that's selling so well for them and pull it off the shelves entirely. That doesn't make uh uh sense, I don't think, for anybody. So, I don't think that'll happen. What I what I do think for sure is what I know for sure is that you cannot talk about the PlayStation 4 Neo without talking about the PlayStation 4. You cannot talk about what this new um upgrade system is going to be and what it's going to mean for the future and not talk about what the PlayStation 4's place in that future is. So, do I think a Slim is coming? Not necessarily. Honestly, maybe this is just me being a fanboy or whatever, but I think the PlayStation 4 is",
            "start": 860.64
        },
        {
            "text": "future and not talk about what the PS4's place in that future is. So, do I think a Slim is coming? Not necessarily. Honestly, maybe this is just me being a fanboy or whatever, but I think the PS4 is designed already so impeccably that there's really no need for a slim. I don't think you need I can't I I've never once looked at my PS4 and go, \"Wow, wish that was half the size.\" Like, I've that's just never anything I've ever I've ever felt. So, you're referring, of course, to the fat PS3 to the 2009 slim model, which was kind of imperative, not only to drop the cost of it, but also from a like a sleekness perspective. Sure. Exactly. They can certainly drop the cost of and and improve the cooling and performance of the PS4 internally without making drastic changes to the footprint though. So I like with all hardware, they'll continue to do that and continue to drive their own cost down in that way. And of course, they'll continue to eventually pass the savings on to the consumer",
            "start": 900.8
        },
        {
            "text": "So I like with all hardware, they'll continue to do that and continue to drive their own cost down in that way. And of course, they'll continue to eventually pass the savings on to the consumer and lower the price. And I think that's the one thing I do totally agree with you about what you were saying is that I would be shocked if uh this PS4 Neo event didn't come with a new price point, you know, a first price point for the PS4 Neo, but also will come with a brand new lower price point for the PS4. Um which will just make the PS4, which is already selling like hotcakes, just fly off of shelves. And um but at the same time, you know, it's funny that now I'm second guessing myself. I was going to say that, but you know, can you think of a bigger way to undercut your trying to sell a new piece of hardware than to make the one that it's supposed to be the upgrade to cheaper? I mean, isn't that going to make more people go, \"Well, I would rather just buy the cheaper one.\" Yeah.",
            "start": 941.68
        },
        {
            "text": "a new piece of hardware than to make the one that it's supposed to be the upgrade to cheaper? I mean, isn't that going to make more people go, \"Well, I would rather just buy the cheaper one.\" Yeah. This is the conundrum though because this is what we were talking about a little bit at lunch and it's not something I considered actually until recently in its most basic form which is if the PS4's jump isn't as quantum as the Scorpio's jump right and if you're really only getting 20% more power whatever, whatever it is like 25% more power and it runs the PSVR better or whatever and you need a 4K TV and all this kind of stuff is the way to make it more valuable to make the other one look cheaper like is that like they have to there's got to be at some point they're going to have to make a it's going to be a gambit at some point to to be like we either there are pros and cons for all of them. I don't",
            "start": 986.64
        },
        {
            "text": "going to have to make a it's going to be a gamble at some point to to be like we either there's only a few ways you can do this either and I think there are pros and cons for all of them. I don't necessarily think that it's necessarily all downside for them to say like we're not manufacturing PS4 anymore because this new one is going to be the same price as what we're selling now and it's just more powerful and we just don't need the old one anymore but the old one's going to work fine for you. Well that at the end of the day we'll have 50 million of them in in the wild and we're not going to stop making games for them. It's just that like this is the console moving forward. This and it's just it's this way. And I think that this became a more possible kind of thing when the the new Xbox S, whatever it's called, Xbox One S is more powerful than the original Xbox One in some like minor way. Yeah. And so they could just be like, well, this is the way it's going to be now and we'll move on",
            "start": 1025.12
        },
        {
            "text": "S, whatever it's called, Xbox One S is more powerful than the original Xbox One in some like minor way. Yeah. And so they could just be like, well, this is the way it's going to be now and we'll fire these old ones. We have a few million like laying around or whatever. So, I don't necessarily think it's all downside, but I do agree that uh they will probably sell these concurrently to each other. I just think that the way to make the new one seem more valuable is to precipitously drop the price of the old one. And I'm talking like a significant price drop like $1.99, you know, and then makes it so it makes it more accessible. They sell a bunch of those units, but then they're like, but this other one is it we we're look how even though it might not be true, like look how much more valuable it is. It's it's $150 more expensive. Of course, it's better. Sure. I I I think I think that it's there's got to be some sort of smoke and mirrors here because I I don't think that the console even",
            "start": 1056.56
        },
        {
            "text": "It is. It's $150 more expensive. Of course, it's better. Sure. I think I think that it's there's got to be some sort of smoke and mirrors here because I don't think that the console even really needs to exist at I mean, that's my kind of case. That's what I'm going to buy at day one. But, right. And the interesting thing the tough thing about it too is that like no matter which way they go, they're going to have to do some spin doctoring to not piss somebody off. The only reason I think that they might not do what you're talking about is because I think if you drop the PS4's price that low to the point you might create the perception amongst people who already own it that it's the budget option now. And then you're going to then you're definitely going to invite the ire of people. They're going to feel like they invested early on something that Sony has already decided to give up on. And they haven't decided to give up on it. I'm sure",
            "start": 1092.56
        },
        {
            "text": "going to invite the eye of people. they're going to feel like they invested early on something that Sony has already decided to give up on. And they haven't decided to give up on it. I'm sure they're not going to just give up on it. Um, at least they said they haven't in any case. But, you know, it is going to create the perception in people's minds. I'm like, if my PS4 is now the $150 model, then well, A, what did I buy it for? And B, that just in my mind makes me feel like if I don't have the Neo, then I don't have a PlayStation 4. I don't have, you know, I have a pretend PS4. I have a knockoff PS4. And I don't think they want people to have that perception. So, I don't think they'll do it quite that way. I don't know. We'll see. Well, all right. So, exit questions then. Uh, twofold. What's the release date and what's the price of the new console? I say I've been vacillating a lot on this. There were parts of me that were like because of the rumors about the dev",
            "start": 1130.56
        },
        {
            "text": "What's the release date and what's the what's the price of the new console? I say I've been vacillating a lot on this. There were parts of me that were like because of the rumors about the dev kits going out late, I'm like, well, maybe they're not even going to release till next year now. Um, but they can spec and kind of port these things over quickly. So, I'm not necessarily sure that that's the case. I'm going to I'm going to finally settle on October 13th, the day PSVR comes out is going to be the day the console comes out. And, uh, I'm going to say $300, same price. You think it's going to be the same price? Yeah. Wow. Um, that would be incredible. I I just don't think that's the Let me just I'm sorry to interrupt. That's the best scenario for them because they can at least say like, \"Yeah, it's more powerful, but we're not charging more for it.\" And and I think this will plate some people. So, I think that like when you look at it that way and they'll be a PS4 new price shop",
            "start": 1173.16
        },
        {
            "text": "\"Yeah, it's more powerful, but we're not charging more for it.\" And I think this will put some people off. So, I think that like when you look at it that way and they'll be a PS4 Neo price point like the old PS4, right? So, I think that that alignment is probably the best alignment for them, but who the hell knows if they can actually meet that. They're not going to sell a console at a loss. I don't think so. Right. Right. Right. Um, so I think that the release date being the same or in the same month in October is pretty safe. Um, it's a pretty safe bet. I mean, like, why wouldn't you - you've got all this buzz that's going to be circling around about the PlayStation VR? That seems like an ideal time when someone is going to want to buy um a new piece of hardware that they don't own already, like a new console, like that's the time, right? Like people go, \"Oo, this PSVR thing sounds awesome. I should buy I should buy a PS4.\" And that",
            "start": 1214.32
        },
        {
            "text": "piece of hardware that they don't own already, like a new console, like that's the time, right? Like people go, \"Oo, this PSVR thing sounds awesome. I should buy a PS4.\" And that that's when the person is looking they're opening up their wallet already, right? So that's the good moment to hit them with the more expensive, more high-end system. Um, so yeah, that makes enough sense. As far as the price goes, I don't see any maybe I'm overestimating how much of a power jump the uh the PS4 or the PS Neo will be, but I think probably 350 or 400 is more likely. So I think it's going to I think I mean, yeah, would it be ideal if they could make it 300? Sure. But I don't know how they could get an appreciable jump in power at 300, you know, like I feel like they could, you know, in an ideal world, the idea for me is that the Neo makes PSVR better, you know, and I don't see how you could make a system that specs high enough to make PSVR significantly better without making it",
            "start": 1252.08
        },
        {
            "text": "in an ideal world, the idea for me is that the Neo makes PSVR better, you know, and I don't see how you could make a system that specs high enough to make PSVR significantly better without making it also significantly more expensive. So, I would say 350 or 400. Um, final question, final is a question that I I should have asked as well. What's the name going to be? This is something that Greg and I have been agonizing over. Tim thinks for instance and I think that depending on how they go that they might just call it PlayStation 4. Like I might or you know it might just be like it's just PlayStation 4. We might have a different little It's like the old codes on the back of the old PlayStations where it was like one and two and three like 1000 series. Yeah. Exactly. Exactly. And uh I think it's going to be called PS4 Plus. Uh, I think PS4.1 or PS4-2, like I don't I don't No, they won't get into numbers. They won't get into numbers. That's too much of a marketing mess for them that they",
            "start": 1294.24
        },
        {
            "text": "It's going to be called PS4 Plus. Uh, I think PS4.1 or PS4-2, like I don't I don't No, they won't get into numbers. They won't get into numbers. That's too much of a marketing mess for them that they would never get into the numbers. I I agree with you. It'll be uh they'll they'll go the like they're going to go the route of the hardware model that they're kind of following, which is the tablet and phone uh market. They're going to go with something like PlayStation 4S or PlayStation 4C or PlayStation 4 Plus, like you said. Um, yeah. I think it'll be uh I don't know why, but I feel like PlayStation 4 R sounds cool. What would the R stand for? Like re-imagined? What kind of marketing buzz term do you think that they would Well, R Well, do it stand for what it always stands for? Uh, what does it stand for us? I don't think I know. R. That's all you need to know, Colin. That's it. That's it. That's how you That's how you win at marketing. Okay, that's that's marketing 101, I guess.",
            "start": 1336.64
        },
        {
            "text": "It stands for PS4 Neo. I don't think I know. R. That's all you need to know, Colin. That's it. That's it. That's how you win at marketing. Okay, that's marketing 101, I guess. Make it sound cool and have no good reason for it. Um, I do think, you know, the funny thing about this, Vince, and I don't want to belabor the point too much. We'll move on to the next issue here. But I do want to say that this is a revolutionary kind of thing, like this particular console for console gaming for and for the history of the space because as we've talked about in the past, the NES '85 NES and the '93 NES, so the top loader NES, they were not different. Like they didn't play the games any different. They had some different innards and the top loading NES is fantastic. Fantastic. I absolutely love the unit. The Duo controller is not bad either. No, but they didn't do anything to the games. The SNES iterations didn't do anything to the games. All those Genesis didn't",
            "start": 1386.4
        },
        {
            "text": "I absolutely love the unit. The DualShock one controller is not bad either. No, but they didn't do anything to the games. The SNES iterations didn't do anything to the games. All those Genesis didn't do Genocide. It didn't do anything to the games, right? PS2 to the PS2 Slim didn't do anything to the games. PS3 to the PS3 Slim to the games. The 32X. Just saying. The 30 Yeah, but that's that's an add-on, right? Like the 32, right? Okay, fair enough. Fair enough. So 32X is a Genesis add-on. It's not a new console, right? like this seems to be now Xbox the thing they didn't underplay it but Xbox One S or whatever it's called did do something to the games it is it is like a small modular step in the direction of making games faster or what whatever it is 4K capable um like native HDR support so we're just what I'm saying is like we're getting into a PC-centric space now",
            "start": 1424.4
        },
        {
            "text": "in the direction of making games faster or what whatever it is 4K capable um like native HDR support so we're just what I'm saying is like we we're getting into a PC-centric space now that PC gamers and I've talked about this a lot that PC gamers are often the beta testers of everything we often do. Steam's a great example of that, right? Um, and I just I think that from a historical standpoint, this is kind of significant because we're now getting into the space not of literally modular consoles, which I think would be way smarter. And I don't know how they would do that. I'm not an engineer, but they should have figured out how to do that a long time ago. That makes me see that makes me sense that they did not anticipate this when the PS4 came out. Um, but uh or at least when the PS4 was designed, but we're getting into a space where we're going to iterate quicker for better or for worse, and we're going to see how that all works out. I think price and perceived value",
            "start": 1465.44
        },
        {
            "text": "the PlayStation 4 was designed, but we're getting into a space where we're going to iterate quicker for better or for worse, and we're going to see how that all works out. I think price and perceived value is going to be the those are the big hallmarks of this and if they can overcome those um they're going to be just fine. So, we'll see what happens. Number two, PS4's next big firmware for firmware of 4.0 named Shenzhen will soon be undergoing a public beta. And now, for the first time, we know what this firmware update is going to do to our PlayStation 4 consoles. Have you seen Have you seen this story? I've read the notes. Yep. Sony's John Knoll wrote the following on PlayStation blog about what we can expect. So, I thought I'd just read it straight out off the blog so we don't skip anything because there's like six things that it does. It seems like I think maybe five. UI refresh. We've made a lot of adjustments and improvements to PS4's main user interface that includes some changes you",
            "start": 1504.0
        },
        {
            "text": "There's like six things that it does. It seems like I think maybe five. UI refresh. We've made a lot of adjustments and improvements to PS4's main user interface, which includes some changes you may notice right away, like new system backgrounds and a revised \"What's New\" tab to smaller changes, like updated pop-up notifications and redesigned system icons. As a whole, it all adds up to a more refined and easy-to-use UI. The overall look and feel of the UI remains the same; it just has a fresh coat of paint. Quick menu. As you know, pressing and holding the PS button on your DualShock 4 brings up the quick menu. We've overhauled this menu to make it faster and easier to use. One big change is that the menu now only covers a portion of the screen, meaning you don't need to leave gameplay entirely. So, that's interesting. We've added several new items to the quick menu, letting you quickly get info without having to go back to the home screen. You can see the online status of your friends and other information right from the quick menu.",
            "start": 1539.52
        },
        {
            "text": "So, that's interesting. We've added several new items to the quick menu, letting you quickly get info without having to back to go back to the home screen. You can see the online status of your friends and shortcuts to quickly access your party, favorite groups, communities, and more. You can also customize the quick menu, removing or adding items as you see fit. Number three is share menu. We've given a similar overhaul to the share menu which appears once you press the share button on your DualShock 4. Like the quick menu, it only covers a portion of the screen. It will save the last social network you shared video clips or screenshots to and making the process of sharing a screenshot or video a bit faster and more streamlined. You can also upload longer video clips to Twitter was 10 seconds, now up to 140. Nice. Folders and library organization. One of the big requests we get is for more options to organize content on PS4. With this update, we're adding functionality to",
            "start": 1574.24
        },
        {
            "text": "Was 10 seconds, now up to 140. Nice. Folders and library organization. One of the big requests we get is for more options to organize content on PS4. With this update, we're adding functionality to create folders on PS4's Content Launcher and Library. This will help collect your favorite games and select apps in one place for quick and easy access. Just a sidebar here, what I like about this is that you can do it in the library, not only on the Cross Media Bar, which is pretty cool. Yeah, that is pretty big. Um, we because I have something like 200 games on PS4 and like scrolling through all those, it's like always a pain. We're also making some pretty big changes to the Library. We've added a new tab called Purchased which will show all the content you own, games, applications, demos, and betas you've participated in. As a result, the Games and Application tabs focus on content currently installed on your system. This should help declutter your library and make it faster to",
            "start": 1608.56
        },
        {
            "text": "demos, and betas you've participated in. As a result, the games and application tabs focus on content currently installed on your system. This should help declutter your library and make it faster to find the content you're looking for. There are some new sorting tools for your library as well. You'll be able to sort content by purchase date or install status and search for specific games or apps via text input. Nice. Number four is trophy inputs. I think this is four, right? No, maybe number five. I don't know. Who cares? Trophy improvements. This update brings the ability to view trophies offline. This is a big thing. You cannot view trophies offline on PS4, which is bizarre. There is one way around it apparently, which is to like log into a guest account or something. I don't know, some weird thing, but you'll see a new offline mode option if your system is unable to connect to the network, letting you view your entire trophy collection without an internet connection. We've also",
            "start": 1644.24
        },
        {
            "text": "weird thing, but you'll see a new offline mode option if your system is unable to connect to the network, letting you view your entire trophy collection without an internet connection. We've also added a button that will let you view the content of a hidden trophy. The trophy will still be hidden by default, but you can now choose to show the trophy name and info. That's pretty cool. It's kind of cool, but it's weird. It's like it's Well, that's not a hidden that's not hidden anymore. Well, the only reason the trophies were hidden mostly was either to be dickheaded like Quantum Dream would do what they hide all their trophies, which is obnoxious, or to avoid spoilers, but you could just go on PSN profiles and see them in two seconds. So, this is basically just letting you skip it. Yeah, I guess that's true. They're just taking out the land. Yep. Says, \"Lastly, we've changed the icons that show how rare a trophy is. Instead of four boxes that fill, the icon looks",
            "start": 1678.0
        },
        {
            "text": "Yeah, I guess that's true. They're just taking out the land. Yep. Says, \"Lastly, we've changing the icons that show how rare a trophy is. Instead of four boxes that fill, the icon looks like a pyramid with the ultra rare trophies at the top.\" So, that's pretty cool. And, uh, user profile is the final one. says, \"We've updated the look of the user profile, making it easier to see relevant info for a player at a glance. For instance, you can now see your trophy progress compared with another player right from their profile. You can also add a background image to your own profile, perhaps a screenshot you took in one of your favorite games, or for you, a picture of me.\" The update has even more features that won't be available in the beta, so stay tuned for additional info on what to expect. We'll be coming back with more info on 4.0, including its launch date in the coming weeks. So, Shinjzhen is almost ready for prime time. Nice. Any thoughts on any of that? Uh, not really. I",
            "start": 1707.84
        },
        {
            "text": "to expect. We'll be coming back with more info on PS4 Neo, including its launch date in the coming weeks. So, Shinjuku is almost ready for prime time. Nice. Any thoughts on any of that? Uh, not really. I mean, a little underwhelming. I was going to say it's it's the UI, which I think is already pretty clean and easily usable, will be a little bit cleaner, and that's cool. Um, yeah. I mean, like, it doesn't sound like a big experience changing thing. I think the honestly the biggest feature that they're probably underelling if I if I if I was the one writing that blog post, right? Like I think the thing I would have zeroed in on a lot is the change in the size of video clip you can upload to Twitter. That's probably the biggest thing to me because like it's gone from like 10 seconds is like you can't tell a story really with your gameplay clip in 10 seconds. It's like very hard to, right? But like, you know, if you have two minutes and 20 seconds to work with, you can show a substantial",
            "start": 1740.16
        },
        {
            "text": "you can't tell a story really with your gameplay clip in 10 seconds. It's like very hard to, right? But like, you know, if you have two minutes and 20 seconds to work with, you can show a substantial awesome clip that like will do well for you if you have a good, you know, Twitter platform. Uh, so I think that's kind of like a big deal. Yeah, it's cool. Yeah, little little tweaks. I feel like it's a little underwhelming for the like the point 0 um updates, which are the massive ones. I feel like Right. Right. Right. Like this is all supposed to be like the new generation like year four, right? Year four of the firmware. Yeah, you're right. Maybe it'll be coming quicker and we'll get a more substantial one in the future as well. Number three, this is big news. This would be the biggest news of the week if not for those other two pieces of news in my opinion. Final Fantasy XV has been delayed again. The word comes by way of publisher Square Enix, which revealed that the game will now",
            "start": 1778.4
        },
        {
            "text": "of the week if not for those other two pieces of news in my opinion. Final Fantasy XV has been delayed again. The word comes by way of publisher Square Enix, which revealed that the game will now come out two months later than it was originally supposed to come out this time around and will now launch on November 29th, 2016. In a statement, Square Enix says that quote, \"This release date will allow the development team time to further polish and conduct quality testing so that the reality of the game can match the expectations of both the fans and the creative teams.\" End quote. Hajime Tabata, the game's director, said, \"Quote, From the moment we joined this project, our vision was to create a level of freedom and realism previously unseen in the series. Regrettably, we need a little bit more time to deliver on this vision and are confident that this new release date will help us achieve this. As the director and lead of this project, I wish to personally apologize for the additional",
            "start": 1818.72
        },
        {
            "text": "More time to deliver on this vision and are confident that this new release date will help us achieve this. As the director and lead of this project, I wish to personally apologize for the additional weight. As a team, we want Final Fantasy XV to achieve a level of perfection that our fans deserve. We kindly ask for your understanding.\" End quote. In a video of Hajime Tabata distilled by NeoGAF, he further said that the game actually went gold the other day and that they are basically planning a major patch for day one that they were now going to fold into the disc itself. So basically, they were going to get about month and a half to two or maybe like a month because they have to certify it to patch the game. And now basically they're just going to fold the patch as well as additional tweaks into the disc and then probably print that disc in November. So um not a huge surprise. I think I predicted this, this is going to happen. I'm surprised that the delay is not more substantial.\n\nI corrected the following:\n\n* \"Final Fantasy 15\" → \"Final Fantasy XV\"\n* \"Tabata distilled by Negaffer Duck Roll\" → \"Hajime Tabata distilled by NeoGAF\" (correcting the name of the director and the website)\n* \"month to to or maybe like a month\" → \"month and a half to two or maybe like a month\" (clarifying the unclear phrase)",
            "start": 1852.88
        },
        {
            "text": "The Promise (and Deficits) of PlayStation 4 Neo - PS I Love You XOXO Ep. 48\ntweaks into the disc and then probably prints that disc in November. So um not a huge surprise. I think I predicted this this is going to happen. I'm surprised that the delay is not more substantial. The rumors about this game and I can't substantiate them in any primary source sort of way. So I'm not going to say anything about like that. But this the things I have been reading and hearing about this from various places on the internet is that the game was in terrible shape. It's not been demoing well. It's not been demoing well. But apparently also and who knows if you can take this stuff with a grain of salt or not. I don't know if you what you've been reading that the game is like not in just generally not in good shape like not ready and whether or not that's true or not I don't know but this seems to indicate that that is in fact the case because I don't buy for a second in the day of in the era of day one patches eg No Man's Sky in which they released a patch that fundamentally",
            "start": 1887.76
        },
        {
            "text": "but this seems to indicate that that is in fact the case because I don't buy for a second in the day of in the era of day one patches eg No Man's Sky in which they released a patch that fundamentally changed the entire game uh that they can't just patch the game they need more time and so the game might have gone gold but they're going to go gold again. So, um, do you have any thoughts on this? I have I have very little hope in Final Fantasy XV being anything better than good. Um, and I hope it'll be that, you know, I really I really do. Um, but so far, every demo that they've shown for that game is just it's beautiful and also underwhelming in terms of like the implications for, you know, as far as gameplay goes. Um, and you know, this kind of like indicates to me that, you know, my my biggest fear when I when I saw the first demos was like this is beautiful and it's expansive, but I don't know if this is like I don't know if you can inject a world this big or this detailed with \n\nNote: Corrected \"Final Fantasy 15\" to \"Final Fantasy XV\", which is the correct title of the game.",
            "start": 1921.52
        },
        {
            "text": "biggest fear when I when I saw the first demos was like this is beautiful and it's expansive, but I don't know if this is like I don't know if you can inject a world this big or this detailed with I don't know the kind of character and the kind of like gameplay depth that um that I expect out of a Final Fantasy Versus XIII game. And I feel like this delay kind of runs in line with that thinking. It sounds like they're struggling just to get this beast, you know, to stay on the rails, let alone, you know, flesh it out and make it something substantial from a gameplay end of things. So, I don't know. Uh I'm I was already concerned about the game and now I'm doubly concerned from a business standpoint. Also, they miss um you know, they miss Black Friday in America, which is, you know, a big deal. I I mean, not not to sound like, you know, America is the end all and be all obviously the game is, you know, the biggest market for video games. Yeah, it is. It is the biggest market for video games",
            "start": 1967.84
        },
        {
            "text": "mean, not to sound like America is the end all and be all obviously the game is, you know, the biggest market for video games. Yeah, it is. It is the biggest market for video games and increasingly like the Final Fantasy series is still I'm not going to say it's not a big deal in Japan but it's not as big of a deal as it used to be. You know especially now with what's coming out around it. Exact. Exactly. And that's that's where this question um comes in here uh in a way. Lavitz asks us greetings and salutations. Now that Final Fantasy XV has been officially delayed. Do you feel sales of the game will be impacted by releasing it in the packed month of November? And do you believe it might still be pushed back to early 2017? Excuse me. I don't think it's gonna get pushed again. I don't know that they could I don't know that they can do that. Like, if they push the game again after delaying it two months after having this whole ridiculously extravagant release",
            "start": 2013.28
        },
        {
            "text": "The Promise (and Deficits) of PlayStation 4 Neo - PS I Love You XOXO Ep. 48\npushed again. I don't know that they could I don't know that they can do that. Like, if they push the game again after delaying it two months after having this whole ridiculously extravagant release party thing that they did, you're really you're really up at this point. I think they're smart to get away from Persona in Japan. Yep. Um that's that's that's what a lot of this has to do with too. Like I was saying, they're not the biggest they're not necessarily the biggest thing in Japan anymore. That's cuz Persona is, you know, Persona is I I think Persona 5 I've said this like Persona 5 I think will will outsell Final Fantasy XV in Japan. I think so too. And I'm what I'm starting to wonder because of So Final Fantasy XV is going to sell millions of copies in the West. There's no doubt about it. People are excited about I'm sure they're going to have a marketing push. It does come out at an awkward time yet. Christmas is right around the corner. You can sit with it. It's it's it's not",
            "start": 2050.96
        },
        {
            "text": "It. People are excited about I'm sure they're going to have a marketing push. It does come out at an awkward time yet. Christmas is right around the corner. You can sit with it. It's it's it's not necessarily the most terrible release timing. I don't think because people that play Call of Duty aren't necessarily going to play this game. I'm not saying you don't play both of them but I mean like a lot of Yeah. Exactly. They don't necessarily or even intrinsically cannibalize each other, right? So there's no worry there. My concern is twofold. The game is actually getting comically long in the tooth just in it. It's it's it was announced when I was in college. I'm 31, right? Yeah. The game was announced. Everyone's like, \"Well, it wasn't really Final Fantasy XV.\" I'm like, \"Shut up. It was Final Fantasy XV this entire time and it had a different name. It's the same game. It's been in development for ages. It's embarrassing, right? That like the game's not out yet. They should have released",
            "start": 2090.8
        },
        {
            "text": "was Final Fantasy XV this entire time and it had a different name. It's the same game. It's been in development. It's embarrassing, right? That like the game's not out yet. They should have released it. They should just release it, right? But delays as conventional wisdom goes, right? Delays are never bad for a game. It can only make the game better. They're not going to delay the game and make it worse. Sure. So, whatever we get in November is going to be probably better than what it was. Now, if the game is a six or something like that in November, then you have to imagine they were working with like a five. Five. Right. Exactly. In September. I don't I mean this game doesn't appeal to me at all, but I want to play it out of morbid the most morbid sense of curiosity. Like I can't even describe to you how morbid that sense of curiosity is. Like I just need to see it. I need to see what's in this game's DNA. Just from just for my own",
            "start": 2126.24
        },
        {
            "text": "morbid sense of curiosity. Like I can't even describe to you how morbid that sense of curiosity is. Like I just need to see it. I need to see what's in this game's DNA. Uh just from just for my own edification. The bigger thing does have to do with Persona. And I do think the one thing that's going to hurt it is it was going to come out two weeks away from Persona, which is not which is not good for that game. And now it's going to have a little bit more space, but now people are going to be able to digest Persona in Japan. Yep. And this game is going to be directly compared to it. And I'd be absolutely shocked if this game was anywhere in the same league as Persona 5, which I think people already pretty much understand is going to be a great game. Now, I don't want to prejudge it. I'm not a Persona fan. I just know the way people feel about Persona 4, about how much time the Internal Atlas team took. Persona team took on this game. They haven't made a game in a long time. you know",
            "start": 2166.8
        },
        {
            "text": "a Persona fan. I just know the way people feel about Persona 4, about how much time the Atlus team took. Persona team took on this game. They haven't made a game in a long time. You know, Catherine was their first big AAA game and how big of a deal Persona 4 is in and Persona in general is in Japan. I mean, they have they have Persona musicals and they have Persona road shows and they have Persona floats. I mean, like this Persona Mania has gripped has gripped Japan and um in a very real way. I think by moving that far past, like you said, not only are people going to have a chance to digest Persona 5 a little bit, it's going to let it's going to give it that time for word of mouth to spread. Um, you know, it's like sometimes like, yeah, you you're afraid of a of a big competitor like that and you don't want to launch on the same day, but sometimes, you know, by by delaying, you're actually just giving them",
            "start": 2207.52
        },
        {
            "text": "like sometimes like, yeah, you you're afraid of a of a big competitor like that and you don't want to launch on the same day, but sometimes, you know, by by delaying, you're actually just giving them more of a head start to to sink their their claws into the market. You know what I mean? If there are people who weren't going to buy Persona 5 on that day because they wanted to buy Final Fantasy in Japan, right now there's not just that day where where where where Final Fantasy XV isn't there to capture their money, but there's a couple of weeks afterwards now where three of that person's friends go Persona 5 is the truth. This guy's like, I don't have Final Fantasy to play. I really wanted something to play this month. You know what? Let me give it a shot. and then bam, their money's gone. You're not getting it and you're not getting it now, you know, or if you do, you're getting it when Final Fantasy XV goes down in price at some",
            "start": 2252.56
        },
        {
            "text": "me give it a shot. and then bam, their money's gone. You're not getting it and you're not getting it now, you know, or if you do, you're getting it when Final Fantasy XV goes down in price at some point next year or whatever. Um, so I feel like it's, you know, and I totally agree like there's no there's never a time when when a delay is bad for a game's quality level, but it can indicate bad things for a game. Oh, yeah. And I agree with and I feel like this is one of those situations like if the game needs two more months and the reasons are things like we want to batten down the hatches on the quality then that's a team that's struggling with as much time as they've had and as much resources they have at their fingertips. This isn't some small developer folks, you know, this isn't a small company with meager means, you know, these are this is a big big company with a big big publisher behind them that has a lot of money. Um, if they're",
            "start": 2292.24
        },
        {
            "text": "Company with meager means, you know, these are this is a big company with a big publisher behind them that has a lot of money. Um, if they're having so much trouble that they can't, you know, get the seams to stay together and they need an extra two months to make that happen. Doesn't speak well for the state the game is in right now. Yeah. And I think the only reason that delay isn't longer is because I think November 29th seems to be a cut off point. Yeah. Like you can't release it after that. You're not releasing Just Cause 3 or something. Although Square Enix did release Just Cause 3 in December, you're at that point you have to hold it until February. And I think that that to them looks so bad. I think that if Tabata had his way, they'd probably hold the game actually and get way more time. Yeah. Based on the anecdotal completely take away with a grain of salt rumors that have been circulating about the game's quality",
            "start": 2334.4
        },
        {
            "text": "they'd probably hold the game actually and get way more time. Yeah. Based on the anecdotal completely take away with a grain of salt rumors that have been circulating about the game's quality and the games the the fact that the game is like just not in good shape. It just uh I agree with you that um it doesn't pretend for this like well for this game to have a delay this late and it's not cheap for them to do it either. Um remember that the the rumors originally came out because of stuff materials they were sending like stickers that they were sending to GameStop to put over posters and and cardboard cutouts of whatever the the corny characters are in the game. So uh so to me I feel like I again the most it's the same thing with The Last Guardian. the most morbid level of curiosity, right, possible, but even more for this than The Last Guardian, because I was never really that interested in The Last Guardian to begin with. There was a time where, you know, well, any Final Fantasy game",
            "start": 2372.72
        },
        {
            "text": "possible, but even more so for this than The Last Guardian, because I was never really that interested in The Last Guardian to begin with. There was a time where, you know, well, any Final Fantasy game is going to intrigue me just as an RPG fan, right? Um I would really love to see Persona beat it, though. Like, and and that's just and that's just me from a let's get something new and fresh kind of thing in here. It's the same way I feel about Tales all those years. I love Tales. I have a soft spot for Tales. Um and a lot of people are like, \"Well, Sega and Atlus must be thrilled that this delay.\" I'm like, I don't know that they give a Like, I think that they were ready to I think that they've picked that date and that they were ready, that they have the game, they have the goods. You know, Persona's been Persona's been the scrappy underdog for two iterations running now, for three and four. You know what I mean? They've been the scrappy underdog for for a few iterations running.",
            "start": 2414.8
        },
        {
            "text": "know, Persona's been the scrappy underdog for two iterations running now, for three and four. You know what I mean? They've been the scrappy underdog for a few iterations running. They're that competitor who you're like, \"This guy's got more talent. He's got more heart. He's got more tools, but he just hasn't had a strong training regimen around him or he hasn't been on as good a team. Like Persona 5 represents, you know, Atlus putting the full weight and resources that they have behind a game that they know, a franchise they know is waiting to explode into the upper tier of RPG franchises. And they're like, \"Well, this is it. They've proven it. Two games running now and we're going to put all our money and all our resources behind it. Give them the time and space they need to make something special. This is like Persona's moment where it grabs the gold. I agree. I think it's going to be I think that it's going to be",
            "start": 2447.04
        },
        {
            "text": "Give them the time and space they need to make something special. This is like Persona's moment where it grabs the gold. I agree. I think it's going to be at the very least sales-wise competitive and I think people are going to be very surprised by that. Um, those who have been paying very close attention. Um, closing comments on this. For me, this delay in Final Fantasy XV's drama, especially with the cross-pollination of top-tier talent, and certainly mid-tier and low-tier talent between teams at Square, you have to assume it's all hands on deck for this game right now. Kingdom Hearts III probably won't be seen for a long time. And as for Final Fantasy VII, I like I I can't even imagine when we're going to see that, right? Like, and I know they're splitting up in episodes and basically going to ruin the story probably, but uh like Kingdom Hearts III this this hope keeps circulating this game this year next like early maybe next year. I'm",
            "start": 2496.16
        },
        {
            "text": "they're splitting up in episodes and basically going to ruin the story probably, but uh like Kingdom Hearts 3 this this hope keeps circulating this game this year next like early maybe next year. I'm like you are dreaming 2018 is is when we are seeing Yeah, I think at the earliest at the earliest and I think remake the same thing like I I think I think remake I think I think they are in over their heads man. I I like on a on a on the Japanese side AAA level. So, not Tokyo RPG factory, not you know all this other like they make with uh the the what's those 3DS RPGs there? A Bravely Default. And I'm not talking about any of those with the triple a Japanese centric stuff. They seem to be in over their heads. And that's just my perception. And I'm not I'm not projecting that on Crystal or Square Montreal. Yeah. Like I like with Hitman. Hitman seems fine. Tomb Raider's fine. Deus Ex is fine. everything's good, but over there there seems to be something wrong. And that's why it's almost a",
            "start": 2538.72
        },
        {
            "text": "Square Montreal. Yeah. Like I like with Hitman. Hitman seems fine. Tomb Raider's fine. DSX is fine. everything's good, but over there there seems to be something wrong. And that's why it's almost a dynamic serendipitous sort of thing that they like they Square really started a decade or more ago to really start heavily investing in western studios and western publishing because if that is all they had like that's all they had when we were kids, they might be in a lot of trouble. Yeah. So, um anyway, I digress. Number four, Sony owned developer Polyphony Digital released updated sales figures for the entire Gran Turismo franchise. The newest entry, Gran Turismo 6, which came to PS3 in December of 2013, has sold just a hair over 5 million copies. Soft sales for a series that typically sold far more. Sure. Gran Turismo 5 on PS3, for instance, is just a shade under 12 million sold. And as far as I know, that is the bestselling exclusive on PS3. The overall franchise has sold a staggering",
            "start": 2583.52
        },
        {
            "text": "Gran Turismo 5 on PS3, for instance, is just a shade under 12 million sold. And as far as I know, that is the best-selling exclusive on PS3. The overall franchise has sold a staggering 76.8 million copies since the original Gran Turismo launch on PS1. Yeah. 5 million copies more than respectable. Yeah. If you look at their sales figures. Oh, right. Right. In terms of the past, sure, not so much. But I mean for it was a bad time to release. It was a horrible time December after the new console came out. Yeah. Yeah. I mean it was at that E3 where we were playing it. It was uh it was being shown this is what happened. I went straight from playing uh Forza 4 for Xbox One or was it F? Damn it. The Wow, I'm getting all my Forzas. That time the most recent Forza at that time the most recent the Forza that that Xbox One launched with which I think is four um I went from playing that right over to Polyphony's area and playing GT6 and I was like you know",
            "start": 2628.88
        },
        {
            "text": "Forza at that time the most recent the Forza that that Xbox One launched with which I think is four um I went from playing that right over to Polyphony's area and playing GT6 and I was like you know I'm a person who loves GT Gran Turismo uh was a fanatic especially for one two and three um so yeah but given that they came in so late into the game and who they were competing against and what kind of firepower they're competing against. I think that that's a pretty good number. Number five. Several years ago, Tequila Works, the studio behind 2012's Deadlight, teamed up with Sony to make a PS4 exclusive adventure game called Rime. The game was revealed in 2013, and little was heard about it until earlier this year when Sony and Tequila Works severed its relationship under questionable circumstances. In the process, Tequila Works retained the rights to the IP. Small publishers Greybox and Sixfoot will now be publishing the game, which may come out in 2017. More details will emerge later",
            "start": 2674.08
        },
        {
            "text": "In the process, Tequila Works retained the rights to the IP. Small publishers Greybox and Six Foot will now be publishing the game, which may come out in 2017. More details will emerge later about release timing and whether it's still a PS4 exclusive, although it almost certainly isn't. Um, now this is a surprise to me and Greg and I were talking about this a little bit. You remember all the stuff that was circulating about this, right? That like so, and again, this is all anecdotal. I don't have any primary information about this at all, but what we were reading was that Sony basically went in there and was like, \"We're taking the dev kit back.\" Like, wow. You know, like the game's not shaping up. And I think that this if those rumors are true and I think that I was on like Neil Druckmann or something. If those rumors are true then this plays that out because who the heck is Greybox and Six Foot like they could be become the biggest thing in the world. I don't know who",
            "start": 2721.12
        },
        {
            "text": "something. If those rumors are true then this plays out because who is Graybox and Sixfoot, like they could be the biggest thing in the world. I don't know who they are. Maybe I'm just ignorant. I'm ignorant about a lot of things but this says to me like they couldn't attract a Capcom or a Ubisoft or someone to publish this game. Um Tequila Works, it's wording about all of this was so weird. Like Tequila Works chose to take the IP back. Like that's not really the way it works. Like that wasn't your IP. Like Sony doesn't want it. It sounds like there was a lot of and and what I've said before is this happened. This isn't unprecedented and I've used Remember Me as an example before, so excuse me because it doesn't happen very often but remember me was supposed to be a PS3 exclusive and uh Sony was like nah we're done. And Capcom found don't and finished the game and all that kind of stuff and it ended up",
            "start": 2758.4
        },
        {
            "text": "me is a great example of that was supposed to be a PS3 exclusive and uh Sony was like nah we're done. And Capcom found don't and and finished the game and all that kind of stuff and it ended up coming out. It wasn't very good. Now, Don't Nod turned into a pretty fantastic studio. Life is Strange. Um, but nonetheless, I thought that was just an interesting piece of information for people out there. So, Ryse is coming. It will presumably at least be on PlayStation 4. I don't think it'll be an exclusive. It's being published by people who've probably never heard about. Tequila Works is still working on the game. I really need to know some finite details though on the souring of that relationship because there was a lot of interesting chatter out there and you know, not all chatter is true, right? But like when you're reading these like insider forums and like Reddit posts, you can sometimes tell there's at least a grain of truth in there. Yeah. Like someone's saying like Sony",
            "start": 2799.04
        },
        {
            "text": "right? But like when you're reading these like insider forums and like Reddit posts, you can sometimes tell there's at least a colonel in there. Yeah. Like someone's saying like someone like Sony wouldn't invest I was at Gamescom when that game was revealed. Like Sony wouldn't you wouldn't just um put a game on the stage and then invest money in it and give it first party resources and basically turn into an effective second party and then be like, \"No, no, never mind.\" Like something happened. Yeah. And whether or not we ever find out what that is, I don't know. Because when you think about the the amount of trust that Sony has generally put into their partners in that regard, you know, they've they've given money to lots of small studios and lots of small outfits and kind of brought them in and made them part of the family uh and let them take big risks with uh you know, on their dime. It would be difficult for me to it'd be difficult for me to think about the kind of",
            "start": 2838.24
        },
        {
            "text": "of brought them in and made them part of the family uh and let them take big risks with uh you know, on their dime. It would be difficult for me to it'd be difficult for me to think about the kind of state Ryse would have had to have been in for Sony to in earnest kind of be like we're pulling the plug on you. Uh so I'm kind of with you. I feel like something crazy must have happened there that we don't know about. Just like I mean and that's the crazy thing is that we don't we don't a lot of the times these stories go completely untold. Like you know it's a story that uh and maybe I'm transitioning here. Um, I don't know. But I think a story that I think I I really still want to know uh the details of is how No Man's Sky ended up being a console exclusive on, you know, for PS4 when it was Microsoft who came in and bailed Hello Games out when the flood destroyed their offices and Microsoft just came through and wrote a big check and was like, \"Here, get yourself on your feet.\" And",
            "start": 2879.76
        },
        {
            "text": "was Microsoft who came in and bailed Hello Games out when the flood destroyed their offices and Microsoft just came through and wrote a big check and was like, \"Here, get yourself on your feet.\" And then somehow the game ends up on I've heard some interesting. I I just don't There's got to be a story there. There has to be a story there. Like we'll never know it. And it's possible this Rime one will go down in history the same way. Like we'll never really know probably what what really happened that made Sony uh I mean who knows? Maybe maybe Sony did just get gunshy and say, you know what, we're cutting our losses. But it doesn't sound like the Sony we know. So no, I'm I'm uh I'm looking I'm I'm pouring over the Neo thread for Rime to try to find a link to the other stuff. Um, I can't find it, but there was like I I think it might have been on Reddit or something. I don't know. People can go look at it. Again, it's it's who the hell knows if it's true or not, right? But a lot of it",
            "start": 2927.12
        },
        {
            "text": "it, but there was like I I think it might have been on Reddit or something. I don't know. People can go look at it. Again, it's it's who the hell knows if it's true or not, right? But a lot of it was basically like the game was in really bad shape, like you know, and and they had to like pull the plug. But who knows? Who knows? Next story number six. Activision and Bungie has announced Destiny 2: The Collection, which will bundle pretty much all of Destiny's downloadable content into one $60 compilation. The collection contains the original game itself as well as The Dark Below, House of Wolves, The Taken King, and Rise of Iron, which isn't out until September 20th. The collection comes out the same day Rise of Iron launches, which means you can either buy the DLC itself or the collection as a whole at the same time or I guess piece meal if you haven't really tried it yet. You played Destiny, right? Yes. And are you excited about this? Because we don't I mean, we don't talk about it",
            "start": 2968.48
        },
        {
            "text": "as a whole at the same time or I guess piece meal if you haven't really tried it yet. You played Destiny, right? Yes. And are you excited about this? Because we don't I mean, we don't talk about it because we don't play it. So, it would be nice to get a little bit of something in here about it. The Rise of Iron, are you excited about this final thing before Destiny 2 presumably launches next fall? Right. Right. Um, no. No, I mean like I and I'm I'm not not excited, but I'm not excited either. Like I haven't really been paying too much attention. Like Destiny is something that I reviewed and then reviewed one expansion and then kind of totally fell off that wagon and handed that to someone else to cover. Um you know, Jose does uh Otto does the bulk of our uh Destiny coverage. and uh you know Destin Legarie also um over at IGN does a lot of the video features and gameplay stuff and and like let's plays and whatnot. So, you know, I've kind of walked away from that franchise for the most",
            "start": 3003.12
        },
        {
            "text": "Destin Legrand also um over at IGN does a lot of the video features and gameplay stuff and and like let's plays and whatnot. So, you know, I've kind of walked away from that franchise for the most part. Um not for any huge reason. I don't I think it's totally fun and solid and inoffensive, but like I don't have any strong uh feelings about the new content. For me, it's like um they're doing the Diablo II thing almost. I feel I feel like Destiny's in Diablo II mode where the base of what came out was so flawed in terms of its structure and and then they recognized that and with through release like DLC release and expansion release after release and patch and patch and patch they they patch it to be as good as it can be based on what the foundation that it was built on, but it's still never going to be as good as it could have been, right? And I feel like that's going to be like I'm more excited to see what with Destiny 2 and with a fresh slate, I'm interested to see what they throw out",
            "start": 3039.6
        },
        {
            "text": "going to be as good as it could have been, right? And I feel like that's going to be like I'm more excited to see what with Destiny 2 and with a fresh slate, I'm interested to see what they throw out the window and what they rebuild because this is their opportunity to take everything they learned from all this time of of original of OG like vanilla Destiny and build that in from the beginning so that it was it's there as a structure rather than something that gets kind of tossed on top as a band-aid. So um so that I'm excited to see. I'm excited to see what lessons they've learned and if they um make good on their promises uh or if it ends up just being kind of the same thing as uh Destiny is now with minor tweaks. But um yeah, I don't know. I'm I'm more interested to see what what comes next than uh than the last expansion. That's just me though. I have no valid input. Number seven, Nordic Games, the Austrian publisher that purchased a bunch of defunct THQ properties during the Dead",
            "start": 3088.64
        },
        {
            "text": "next than uh than the last expansion. That's just me though. I have no valid input. Number seven, Nordic Games, the Austrian publisher that purchased a bunch of defunct THQ properties during the Dead Publishers bankruptcy fire sale in 2013, has announced that they will now be called THQ Nordic. Nordic paid some $5 million in 2013 for Darksiders, Red Faction, MX Versus ATV, Destroy All Humans, Summoner, and more. The company has 23 games in development right now, of which 13 are still secret and unannounced. Quote, \"Needless to say, the majority of these projects are based on former THQ owned IPs and franchises.\" End quote. This is according to a company statement. Um, I tweeted out kind of a snarky kind of thing about this. This has really This doesn't seem like a very good idea. Not only No one knows what Nordic's capable of now. Nordic getting Darksiders is pretty significant. Everyone's like, \"Well THQ had some promising stuff.\" And I'm like, \"Yeah, you could probably make hay",
            "start": 3134.0
        },
        {
            "text": "No one knows what Nordic's capable of now. Nordic getting Darksiders is pretty significant. Everyone's like, \"Well THQ had some promising stuff.\" And I'm like, \"Yeah, you could probably make hay with Red Faction again if you wanted to or yeah, uh, maybe even Summoner, like something that's been dead for a while, like but the most valuable IPs seem to have gone elsewhere.\" Like South Park went to Ubisoft. Deep Silver got Homefront and Metro and all this other stuff. WWE went to 2K, right? WWE went to 2K. Um Homefront went to uh Gearbox. I'm like, guys, like they bought Destroy All Humans. Now, now they got it for $5 million like for all that IP. Not bad. Yeah. And a surprisingly fun couple of games. They were back in the day. But um you know, I don't think that they're going to be making, you know, billions of dollars with MX vs ATV. No. 23 games in development. And this is what I was joking about with Greg. That's probably more actually a pretty",
            "start": 3174.8
        },
        {
            "text": "that they're going to be making, you know, billions of dollars with MX vs. ATV. No. 23 games in development. And this is what I was joking about with Greg. That's probably more actually a pretty significant portion more than the first party games that Sony has. I was just going to say the same thing. I'm like that that's the like I guess I guess in some world they'd want to get on a microphone and be like, \"Guess what everyone? We're not developing one or two or three or even 20 games, but we've got 23 in development.\" And I guess they feel like that's a good thing. But all I can think to myself is a a new upstart publisher that's trying to shepherd 23 games to store shelves. I'm like, that sounds like a disaster. I'm like, I want to hear that they're focusing like the last thing I want to hear for, you know, to the last thing that makes me feel like a publisher is healthy is that they're putting their finger in a million different pies and spreading their resources thin across a",
            "start": 3218.96
        },
        {
            "text": "to hear for, you know, to the last thing that makes me feel like a publisher is healthy is that they're putting their finger in a million different pies and spreading their resources thin across a ton of games that I probably won't care about. Like what makes me feel confident is if they go, you know what, we know what our audience cares about. We know what sells. We know what's successful. We know what had potential. It's these three IPs. And right now, we're just going to focus on getting those three IPs to being like pillars of revenue for the company. And then we'll expand from there. That would be like a response. I mean, I'm no CEO. I'm no I'm no, you know, I don't work that gig. So maybe I'm wrong. Maybe I'm talking out my ass. But I I feel like from the outside looking in, telling me that as a new upstart publisher, you're trying to manage 23 projects makes me go, you're going to be gone in 2 years. Yeah. I I think I think it's got bad news written all over it. I mean, I think",
            "start": 3260.8
        },
        {
            "text": "me that as a new upstart publisher, you're trying to manage 23 projects makes me go, you're going to be gone in 2 years. Yeah. I I think I think it's got bad news written all over it. I mean, I think that's obvious. That said, I love Nordic Games and I love Darksiders and the fact that there's a chance for a Darksiders III to happen and that have and that it be in the hands of the team that made the first two makes me extraordinarily happy and I'm excited about that. The the two things that are interesting to note about THQ Nordic is number one they're Austrian so I don't know this is important simply because I don't know what the country of Austria has in terms of tax benefits or investment into game development or Poland which is why you know a lot of stuff's coming out of there too whether it's The Guild 3 project um and other Eastern European countries as well Ukraine is another um with 4A Games or whatever they're called um the bigger question I think comes from Joe who wrote",
            "start": 3300.64
        },
        {
            "text": "there too whether it's TD project um and other Eastern European countries as well Ukraine is another um with 4A Games or whatever they're called um the bigger question I think comes from Joe who wrote in and said now that THQ has written uh I'm sorry has risen from the ashes of bankruptcy and is ready to publish games under THQ Nordic. That's not exactly the case by the way. THQ is gone. Nordic is a different company who actually amongst those IP also acquired the THQ name and for some reason is now putting it in their name. What games are you most interested in? It is reported that there are 23 games in development of which 13 have been announced. I'm hoping for Destroy All Humans. You guys are the best and keep up the good work. Joe, I think you're going to get an a destroy all humans game. I'm um morbidly curious using that term a lot today about Summoner. Summoner did get a sequel. Um, Summoner was a PS2 launch game that was probably the most promising in an underwhelming launch",
            "start": 3339.84
        },
        {
            "text": "Summoner did get a sequel. Summoner was a PS2 launch game that was probably the most promising in an underwhelming launch catalog of games. I'm be interested to see what they can do with that. Red Faction was always interesting to me, too. Sure. That said, like Darksiders is really the only IP that they have that seems to have had any upside for them. And I'm not even really a Darksiders fan. I just think that's probably the one with the most upside for them. So, that's what I would say. I don't know if you have a different answer. No, I got the same answer. Dark Siders and Red Faction are the two franchises that I think have the most potential. Although I do, like I said, I did love some Destroy All Humans. This first one in particular. Um, just cuz it was very mechanically driven. It had some very unique and interesting powers that you can",
            "start": 3378.48
        },
        {
            "text": "I did love some Destroy All Humans!. This, the first one in particular. Um, just because it was like very mechanically driven. It uh had some very unique and interesting powers that you can use in fun and creative ways. Um, and of course, it had going for it that whole uh um oh god, what's the name of... I'm trying to think of it. Okay, so I was going to say it's great. So, people love playing games, especially sandboxy games, where you can be the bad guy and kill stuff. And it was funny to be this little alien dude going around just murdering and or abducting human beings, but there's a game like that that Colin Moriarty likes, ladies and gentlemen. And uh, and I don't know if he's ever admitted his love for Naughty Dog. Oh, yeah. Oh, yeah. Everyone knows that I love Naughty Dog. What a great game. What an underappreciated five frames a second sort of game it was. I reviewed the second one as So Broken. So broken. And I",
            "start": 3413.12
        },
        {
            "text": "that I love Naughty Dog. I love me some Naughty Dog. What a great game. What an underappreciated five frames a second sort of game it was. I reviewed the second one for So Lonely. So broken. And I I remember feeling like I was following in the footsteps of greatness. I really loved that. I loved the idea of that game. I loved it. I it was so funny. Some people love to play the the the evil sadist killing the innocent people. That's what definitely what Destroy All Humans was about. To be fair, Naughty Dog wasn't invited to any of the parties in the in the social gatherings that the other bears were invited to. And so he was upset about that. That's that at least he had motivation. It sounds like you're projecting, Colin. That's true. I'm going to stalk around in the bushes and murder all you guys. You come to my parties. Thank you. Appreciate that. Final uh thing on the report is number eight. Uh this is a wrap-up. Uh The Witcher 3's game of the year edition has an official",
            "start": 3458.48
        },
        {
            "text": "all you guys. You come to my parties. Thank you. Appreciate that. Final uh thing on the roper report is number eight. Uh this is a wrap-up. The Witcher 3's Game of the Year Edition has an official release date and will come to PS4 and elsewhere on August 30th. Co-op game Nine Parchments is coming to PS4 in 2017. Gory shooter Killing Floor 2 is coming to PS4 on November 18th. Yes. Agrarian game Farming Simulator 17 comes to PS4 on October 25th. No VA side-scrolling action game LARP Spear comes to PS4 and Vita in just a few weeks. Mysterious adventure game One Way Trip, which I think looks really cool, comes to PS4 on August 30th. The promised PS4 iteration won't make that release date. I'm going to speak on that in a second. Sidescroller comes to PS4 on September 13th. Quirky game Super Combo Man is coming to PS4 at an undetermined time. And this last one, Zelda-like game Oceanhorn is coming to PS4 on September 7th. People should I'm sorry, look into",
            "start": 3495.44
        },
        {
            "text": "Combo Man is coming to PS4 at an undetermined time. And this last one Zelda-like game Oceanhorn is coming to PS4 on September 17th. People should I'm sorry, September 7th. People should look into this. It looks pretty cool. Um, to All right, so One Way Trip I played on Vita for the first time. I want to say like three years ago, um, Sony used to come to the to the IGN offices with a VA loaded with a bunch of games for me to play and I would capture footage of them because no one wanted to write about VA, I guess, except for me. And, uh, One Way Trip looks really cool. This is following though in a trend of VA games just not being ready alongside their PS4 counterparts. And I'm going to say this, I'm going to proclaim this. I understand that Vita is not this like be all end all platform for a lot of publishers. Then don't say you're going to put your game on them. Like, how about that? This happened with Salt and Sanctuary. Axiom Verge is happening with One Way Trip. I think it's",
            "start": 3533.2
        },
        {
            "text": "for a lot of publishers. Then don't say you're going to put your game on them. Like, how about that? This happened with Salt and Sanctuary. Axiom Verge is happening with One Way Trip. I think it's happening with that game Hugh. It's happening. It's happening with Darkest Dungeon. Darkest Dungeon. Like it's like everything is late on Vita and we want to play it on Vita. So just don't tell us you're going to bring it to Vita. Make it immediately clear that it's not a priority for you. We're still waiting for all these goddamn games that were supposed to be that were supposed to be coming to Vita. There's a lot of them. It's not like it's not like there's a few of them. It's like where is where's Banner Saga? You know where like where is it? Yeah. Where is Salt and Sanctuary? Why did Axiom Verge take a year to come to Vita? You know, like we are here, we're buying games and I want to speak out for us because I feel like and one way Trip is just the most recent example. It's like just",
            "start": 3570.88
        },
        {
            "text": "Verge take a year to come to Vita? You know, like we are here, we're buying games and I want to speak out for us because I feel like and one way Trip is just the most recent example. It's like just stop stop it then. Just say you're not going to bring just say that PS4 is your your your money maker and you and you don't care about the VA or it's not as important for you and that's fine, but don't like get everyone's hopes up because this happened to me over and over again where I'm like, \"Oh, I'll just play Darkest Dungeon on Vita. Oh, I'll just play Axiom Verge on Vita. I'll just play um you know, blah blah blah blah blah blah blah blah blah blah blah blah blah on Vita.\" And it's like, well, it's not ready for VA yet. We have no idea when the it's going to be ready on VA, so sorry, you know, and I'm like, well, we were looking forward to this game. So, I think it's just kind of shitty, and I wanted to point that out. Yeah, I agree. And like to be just really quickly, like it kind of",
            "start": 3604.0
        },
        {
            "text": "and I'm like, well, we were looking forward to this game. So, I think it's just kind of shitty, and I wanted to point that out. Yeah, I agree. And like to be just really quickly, like it kind of falls in with the whole odious like silence that that we've been getting about the Vita in general, right? It's like it it's like it's really strange because it's like a big it's like a I expect this from kind of smaller companies, right? But from a larger company, it's weird that Sony just has literally they haven't said anything about it. They've just quietly stopped showing anything about it at at the shows they present at. Um and yeah, like the same thing individual developers and publishers were just kind of like, \"Yeah, I know we said a Vita version.\" Big big shrug unless you ask, you know, several pointed questions about it. Um yeah, it's unfortunate. Like I I don't I've never quite seen a piece of hardware die in this exact way. Like I've heard people I've heard I've seen it where",
            "start": 3638.6
        },
        {
            "text": "several pointed questions about it. Um yeah, it's unfortunate. Like I I don't I've never quite seen a piece of hardware die in this exact way. Like I've heard people I've heard I've seen it where they kind of try to spin it and make it sound like it's not dying. I've heard them say, \"Well, there'll be some limited support.\" I've heard them say, \"Yeah, unfortunately it hasn't worked out for us and we're going to stop, you know, supporting it starting now.\" Um, which I guess they've kind of said with the Vita. It's just in this weird state of the Vita is in this weird state of undeath. And I love the Vita. So, as I know Colin does, too. So, it breaks my heart. It deserves so much more than this. Like, yeah, it does. I I It's like It's like keeping a prisoner in a jail cell and starving it to death. And then every four days you walk in and give it like two slices of bread. You're like, \"You'll be all right.\" Yeah. And you're like, \"All right, I guess I have the calories. I can make it a few",
            "start": 3683.52
        },
        {
            "text": "And then every four days you walk in and give it like two slices of bread. You're like, \"You'll be all right.\" Yeah. And you're like, \"All right, I guess I have the calories. I can make it a few more days now.\" And then you just starve some more. And then it's like, \"Yeah, here's like a little bit of a half-eaten pork bone, you know? Go ahead and just kind of gnaw on that for a little while.\" It's like if you're just going to kill it, then just kill it already. Just kill it already. Exactly. Stop doing this to me, you know? Because what I'm really curious about is like there were games that were announced when I was still at IGN that like no one's heard of since. Um and the VA still has good support, but like there are VA games coming out every week still, but I I just feel like a lot of bigger games are like missing in action. It's like they're like, well, it still be cancelled or cross, you know, whatever happened to save. And I'm like, well, the game doesn't exist, so",
            "start": 3722.08
        },
        {
            "text": "I just feel like a lot of bigger games are like missing, it's like they're still being cross-checked or whatever. And I'm like, well, the game doesn't exist, so I don't really care that it's almost done, you know? I always appreciate when people do it right. Like Yacht Club Games for instance released Shovel Knight on the same day on PS4 and Vita; they did that and I was like, \"Well, that's big,\" and I think they did it pretty respectably on Vita. They did better on Vita than they did on PS3. Maybe not a huge surprise, but you know, I just wanted to speak out about that because I'm seeing this more and more, and it's bothering me now. It's like, yeah, you guys are just rushing your PS4 games out. That makes sense from a commercial point of view. But there are those of us that are excited about your games, and I hate to tell you, but your indie games are probably not going to sell very well on PS4 and",
            "start": 3756.16
        },
        {
            "text": "The Promise (and Deficits) of PlayStation 4 Neo - PS I Love You XOXO Ep. 48 \n\nsense from a commercial point of view. But there are those of us that are excited about your games and I hate to tell you like your indie games are probably not going to sell very well on PS4 and you might have more hope if you actually cater to us, you know. Um, so that's just where I'm going to leave it and we'll see what comes of it. Indeed. Uh, now we go into the drop. Uh, upcoming PlayStation games coming out. Here they are. I like to read if you if you never listen to the show, and I'm sure you haven't, Vince. I like to go to the I like to go to the What makes you think that? I like to go to the uh the drop on PlayStation blog and read verbatim what they say about the games. And sometimes they're sometimes they're well written and sometimes they're just terrible. So, we'll see what better be careful who you who whose writing you're talking about. It's not Clemences. These these come from these come from the these come from the publishers and developers. The Japanese ones are the",
            "start": 3791.04
        },
        {
            "text": "be careful who you're talking about, it's not Clements. These come from the publishers and developers. The Japanese ones are the best. Ryan's feelings. There's a game called Adventure Capitalist, which I think is a great name for a game. So, PS4 Digital says, \"Start with a humble lemonade stand and squeeze your way to total fiscal domination. Earn ridiculous sums of cash, diversify your investments, and attract swarmy angel investors to give your business a boost. And the best part is Adventure Capitalist can even play itself. Start your rags-to-riches adventure today.\" All right, Battleship. I'm excited about this one because uh Erin and I are huge Battleship fans and uh I'm excited to see how this is going to be playable. My assumption is this is going to be played on a phone similar to like some of those Jackbox party games or whatever like where you transmit it to your phones. I don't understand how",
            "start": 3829.44
        },
        {
            "text": "playable. My assumption is this is going to be played on a phone similar to like some of those Jackbox party games or whatever like where you like it transmits to your phones. I don't understand how else you'd play it, but I don't know that for sure. Battleship comes to PS4 digital with a modern dynamic and interactive 3D board. Battleship brings the classic franchise to a new level for a memorable experience. Deploy your fleet and shoot at your opponent's grid to find and destroy enemy ships before yours are sunk. Enjoy the game you know and love with the classic mode or get more tactical in a brand new way to play with Clash at Sea Mode. Bound, which is a PlayStation 4 exclusive, comes to PS4 Digital. Repair a broken world through the beauty of dance. Developed exclusively for PS4, Bound combines a unique visual style with a powerful story and gameplay mechanics infused with modern dance. As the game progresses, the introspective story unfolds through powerful metaphor and imagery",
            "start": 3868.72
        },
        {
            "text": "combines a unique visual style with a powerful story and gameplay mechanics infused with modern dance. As the game progresses, the introspective story unfolds through powerful metaphor and imagery, adding emotional depth to the protagonist journey. This game comes from Plastic, which is a Polish demo scene studio. They're the guys that did Lingering Shadows and then Dura on PS3. So, they don't really make games. I started playing this and this seems to be more gamy. I played it for about a half an hour and I was like, I just can't right now. I can't do this. Your guys are just dancing around like I'm sure it's I'm sure it's fine. I'll give it another shot, but I can't. I can't right now. Every once in a while, like I love this man to death, but it's so funny. He's one of the most intelligent people I know. Every once in a while, he might find a way to word something or talk about something in a way that makes him sound like he's the most dismissive",
            "start": 3904.0
        },
        {
            "text": "He's one of the most intelligent people I know. Every once in a while, he might find a way to word something or talk about something in a way that makes him sound like he's the most dismissive jerk, but he's totally not. He's really not. But like what you talked about that game just now - these dumb people with your dancing and moving around like a little cute little girl who wears meatballs? Where's where's the guns? I just can't, I just was like that's not a cop. I just can't. I've been playing a lot of Mega Man Legacy Collection again, like the challenges, like the deep challenges though. Um and uh just having a lot of fun with that instead. So bound it was just like it was just like a weird little It was a little jarring. It's no, it's a total no, but I want to go back to it uh because I think it's probably going to be good. I always found Plastic to be interesting. Like Dora was a letdown for me. Uhhuh. Um but Dora was also the",
            "start": 3941.2
        },
        {
            "text": "a total no, but I want to go back to it uh because I think it's probably going to be good. I always found PlayStation to be interesting. Like Doraemon was a letdown for me. Uhhuh. Um but Doraemon was also the PS3 game. I'll never forget this as long as I live. This was like a demo where Turok was a um a very early like pre-PSVR like they were experimenting with that game like at demos where they would like they basically had like PlayStation Move controllers duct taped to some like janky PS or some VR unit and like they were like doing weird things with it. So I remember at GDC a couple times. Yeah. Yeah. So I was like, so they're trying. Devil Doodle Devil comes to PS4 digitally. Says, \"Embrace your dark side.\" While Doodle God was creating the universe, Doodle Devil was also having some fun. The same addictive puzzle gameplay that made Doodle God a hit is back, but with an evil twist, so they're trying. Where's the meatballs? Dungeon Punks. Where are",
            "start": 3983.92
        },
        {
            "text": "was also having some fun. The same addictive puzzle gameplay that made Doodle God a hit is back, but with an evil twist, so they're trying. Where's the meatballs? Dungeon Punks. Where are the guns? Dungeon Punks comes to Vita Digital. Crossbuy with PS4 version, which I guess is already out or will be coming out. Dungeon Punks is a fast-paced action RPG with a unique tag team fighting system. Recruit six mutant heroes from werewolf spellcasters to lizard man warriors and battle in 12 stunning arenas with epic boss battles. F1 2016 comes to PS4 digital and retail. It's This is out the 19th, so this is a Friday release. It says, \"Create your own legend in F1 2016. Get ready to go deeper into the world of the most prestigious motorsport than ever before. The the I don't that's a weird sentence. Work your way work with your agent, engineer, and team to develop your car in the deepest ever career experience spanning up to 10 seasons. Grow Up comes to PS4 digital. Bud, an adorable yet",
            "start": 4027.52
        },
        {
            "text": "Work your way through with your agent, engineer, and team to develop your car in the deepest ever career experience spanning up to 10 seasons. Grow Up comes to PS4 digital. Bud, an adorable yet clumsy, stumbling, tumbling robot. Spaceship wreckage scattered across an entire planet of abundant alien flora and thrusting star plants. A distant moon with your spacecraft's beating heart yearning to be rescued. A fantastical acrobatic adventure in a world that's as challenging as it is beautiful. Welcome to Grow Up. Well, thank you. It's a bad write-up too. The Huntsman: Winter's Curse comes to PS4 digital. This I think this game will win this. Winter is fast approaching as Queen Freya's army marches relentlessly. Beneath the shadow of that deadly war, Elizabeth's life on her family's farm in V and Vardhelm comes to an abrupt end. Join her to find her missing brothers as you explore the Huntsman universe and encounter both familiar faces and new dangers all while discovering",
            "start": 4074.08
        },
        {
            "text": "farm in Final Fantasy XV: Versus XIII comes to an abrupt end. Join her to find her missing brothers as you explore the Huntsman universe and encounter both familiar faces and new dangers all while discovering the secret Elizabeth herself carries in this wintry adventure. Okay, the important the important question on everyone's mind is will there be Arvarcs in Arvarnham? Arvum inver comes to PS4 digital and Versus XIII is a minimalist action strategy shooter for one to four friends. Player movement is constrained to opposite colors of a black and white grid. My walls are your paths, and your walls are my paths. Each shot flips tile colors in an attempt to block, trap, and close in on the enemy. Firing a bullet opens up a path for you while also closing off a path for me. Both online and local co couch co-op are supported. Fight for a high score on an ever-changing board. Sounds pretty cool. Yeah. And finally, Soul Sacrifice: Fallen Knights comes to PS4 digital. The old gods have forgotten this land. No one",
            "start": 4112.16
        },
        {
            "text": "Supported. Fight for high scores on an ever-changing board. Sounds pretty cool. Yeah. And finally, Soul Sacrifice: Fallen Knights comes to PS4 digital. The old gods have forgotten this land. No one could save our people when darkness began to spread and collect the souls of men for his army. Soul Sacrifice: Fallen Knights is a 3D exploration game. Players control Gaia, a young warrior tired of struggle who must wield his sword to rescue his people from the darkness and avenge the death of his parents against the powerful Annabal and his army of monsters. It's a little Yeah. Pick of the week. What do you got? I don't know. Bound just because something happened. They're trying hard. You're the biggest jerk. I'm not even trying to be mean about it. It's a game that I really do want to go back to. I was looking forward to playing it, but I'm just like... I'm playing Mega Man Legacy Collection. I get the bound code. I download the game and there and there's a guy just dancing",
            "start": 4155.76
        },
        {
            "text": "to go back to. I was looking forward to playing it, but I'm just like I I I'm playing Mega Man Legacy Collection. I get the bound code. I download the game and there and there's a guy just dancing around dancing his life away. And I'm like, I can't I just can't I can't do this right this moment. Maybe I can do this again in the future, but I right this moment I can't dance. You know, I can't The dance is not your heart. There is not a song in your heart. And he's like he's like doing a little pirouettes and stuff as he's running around. Dude, it was so I was actually laughing because like I went to like grab a ladder in the game or whatever and I just like plummeted like down into a pit. I'm like I can't with this game right now. I just can't do it. A metaphor for your life perhaps. Colin Moriarty. Uh all right. Uh we usually go over trophies at this point. Any new trophies that were uploaded. There's nothing that interesting. Um, and truth be told, Vince isn't in the trophy, so",
            "start": 4205.04
        },
        {
            "text": "Colin Moriarty. Uh, alright. Uh, we usually go over trophies at this point. Any new trophies that were uploaded? There's nothing that interesting. Um, and truth be told, Vince isn't in the trophy, so I don't want to waste too much time, but you guys can go look at Bound's trophies. It does have a platinum trophy. Um, Grow Up's trophies are out. 14 bronzes and a silver, but no platinum. The one interesting thing I thought here was Metro. Uh, Metro was a VA game that came out in 2013 or '20, I think it was actually 2014. Metro Plus is a port to PS4 and it's kind of like a reworked version of the game. So, I mean, Metro was the game that relied on VA's random functionality more than any other game except for maybe Golden Abyss. So there were parts of the game where you had to point the camera at like something red or there was a thing where you had to, you know, use the back touchpad and the front touchpad and the gyro all that kind of stuff. So this is a totally",
            "start": 4250.48
        },
        {
            "text": "to point the camera at like something red or there was a thing where you had to like you know use the back touchpad and the front touchpad and the gyro all that kind of stuff. So this is a totally rewards game for Dual Shock. Uh unlike the Metro 2033 game on Vita, this does have a platinum trophy. Um so there's something interesting there. I've been talking to those guys and I should get a build soon. So, we'll have some updated information on that because Metro 2033 didn't quite pan out the way I hoped it would on Vita, but it was a very interesting idea. They tried to do some very interesting things with Metro 2033. I previewed it once. Well, you know, and yeah, I mean, like I'd like to see that's one of those things where on paper you're like, \"Yeah, this seems like a really good idea and these features are all going to be really innovative and really fun.\" And then in terms of practice, they kind of ended up being maybe a little bit clunky or hard to wrap your brain around. So, I'm wondering I'm",
            "start": 4291.2
        },
        {
            "text": "are all going to be really innovative and really fun.\" And then in terms of practice, they kind of ended up being maybe a little bit clunky or hard to wrap your brain around. So, I'm wondering I'm hoping it's not just a port, but a chance for the developers to kind of take a good look at what like what was essential about that vision and what wasn't and just stick with what worked and and double down on it and maybe just um less of what didn't. But we'll see what happens. Yep. I'll have more on that soon. They're trying. Um, by the way, a game that we'll have more information on soon, as I said earlier in the episode, we recorded next week's PS I Love You XOXO already on the new set. The reason we did that is because we're rolling all that out on Monday and so we need to have that new look ready for everything. So, it's kind of going to be an evergreen episode about PlayStation 4 as I had alluded to earlier, but we do have DSX um the new DSX. And so, in two weeks, we'll have more",
            "start": 4324.56
        },
        {
            "text": "Look ready for everything. So, it's kind of going to be an evergreen episode about PlayStation 4 as I had alluded to earlier, but we do have DS4 Pro - the new PS4 Pro. And so, in two weeks, we'll have more information on that. And my assumption is we'll actually talk about that on the GamesCast first. So, if you guys are curious about that, that's kind of the next big thing we'll be talking about. Uh let's get into some reader questions or some listener questions, I should say, since this is not a podcast. Um and then we'll wrap things up with the usual segments and mosey on out. Here's the first one. This is from Travis Smith. Says, \"My wife and I were camping in Redmond this past week, and being as it was only a few minutes away, I convinced her to swing by the Sony Bend Studio so I could see where they work out of. I drove by the address several times looking for a monument sign or any sort of building signage. Though, what I saw was somewhat anticlimactic. A small Sony logo on a",
            "start": 4360.4
        },
        {
            "text": "see where they work out of. I drove by the address several times looking for a monument sign or any sort of building signage. Though, what I saw was somewhat anticlimactic. A small Sony logo on a placard on the building of a two-story insurance agency building. Though I did not have the balls to go inside the building, I'm not sure if I would have been welcome. Or possibly I could have walked out with a wicked sweet insurance rate with a complimentary copy of Golden Abyss. My question, would I be in a similar situation if I were to visit Sony Santa Monica, Sony San Diego, or any other AAA devs out there? Or do you think these devs prefer a quiet, less public place to work, seeing as the gaming industry has a hush-hush nature? Thanks for doing what you guys do, Tim Gettys. Um, what you saw was intentional. They don't do signage because they don't want you to know they're there. Now, Bend isn't the biggest studio in the world, but yeah. Would you So, Naughty Dog is in a massive",
            "start": 4395.44
        },
        {
            "text": "Saw was intentional. They don't do signage because they don't want you to know they're there. Now, Bungie isn't the biggest studio in the world, but yeah. Would you So, Naughty Dog um is in a massive complex um in Santa Monica. Mhm. Uh they have a ton of space, but you would have no idea they were there. Um and that's intentional. Do you really want Do you really think that Naughty Dog wants people to go to their office, you know, like there's not signage anywhere that I don't know of a single developer actually with just a couple of exceptions that really proclaims that it's there. Publishers are different, but not the not the developers. So Sony's headquarters um down in the valley, right, um is ridiculously PlayStation-esque. You know it's there. Yep. But you wouldn't know Dog was there. Same with Santa Monica. Same with San Diego. Sony San Diego is very nondescript. It's silver. It's a in a bunch of different buildings actually. Um, so what you experienced, I think Vince can reiterate is",
            "start": 4427.68
        },
        {
            "text": "with Santa Monica. Same with San Diego. Sony San Diego is very nondescript. It's silver. It's a building in a bunch of different buildings actually. Um, so what you experienced, I think Vince can reiterate is status quo. Here's my thing. Um, it's not You say you didn't have the balls to go inside the building. I'm going to give you guys a tip. Don't even try. Yeah. Don't even attempt it. Don't do that. Don't be that guy. Uh, they don't want you there. And it's not it's not an insult. They like don't don't you don't belong there. You have no business there. If you don't have a meeting there or don't work at one of these devs, it's probably smart to just not go there. That's that that's just my my tip. They don't want you there. Like, and that's why there's no signage and that's why they don't draw attention to themselves. So, that's just me being honest with you. Totally. Like you said, with with some small exceptions, but like an interesting one is like Valiant in uh Champagne",
            "start": 4470.64
        },
        {
            "text": "don't draw attention to themselves. So, that's just me being honest with you. Totally. Like you said, with with some small exceptions, but like an interesting one is like Valiant in uh Champagne, Illinois. Uh, Champaign. I mean, they don't go out of their way to be like, you know, like, but like there's a big Valiant like big hanging sign. They're on the corner like one of the main intersections downtown in Champaign. And the city's kind of built itself up around them and they're kind of like they're almost rock stars. Like when I went to visit them for uh for Agents of Mayhem uh IGN first that we did. Uh when I checked into the hotel, the receptionist could see that I was with that I was there, you know, with Valiant to to see Valiant and she was like, \"Oh, do you work for Valiant?\" She was very very excited about the fact that I was going to see something that Valiant was working on. Um so it's like one of the few exceptions uh where like the the developers kind of like",
            "start": 4508.4
        },
        {
            "text": "She was very excited about the fact that I was going to see something that Valve was working on. Um so it's like one of the few exceptions uh where like the developers kind of like the hometown hero uh where they are. But yeah, for the most part, there could be a developer right in your backyard in your town and you never know. Yeah, just I would say respect the boundaries. Yeah, dude. That they're not a storefront. Nope. Woot Dah Heliot says, \"Hey, Colin and Greg. Well, Greg's not here, so you're going to have to deal with Vince.\" Says, \"I noticed that while looking at the trophy list for Uncharted 4, I saw that only 47% of players had beaten the game on explorer, which accounts for anyone who beat the game on a higher difficulty, too, since you get the explore trophy as well.\" So, for people that don't know, explore is like the easiest, like you don't even have to play the game on easy difficulty. I know that it's a common thing for people not to finish a game, but that",
            "start": 4552.08
        },
        {
            "text": "as well. So, for people that don't know, explore is like the easiest, like you don't even have to play the game difficulty. I know that it's a common thing for people not to finish a game, but that makes sense for games like Fallout 4, where it's so big, you'd imagine people just got bored. I can't understand, though, how more than half the players of Uncharted 4 lost interest in beating it. And it's not just Uncharted 4, it's almost the same for every game regardless of length or content. I'm curious to hear why you guys think this is. Uh, what do you think? Um, so what he's saying, 47% of people that played Uncharted 4 beat it. So, it's less than half. Yep. Um, as far as I'm cons, as far as I know, I don't have the metrics in front of me, that is not a terribly rare or uncommon uh thing. As far as like why people don't finish uh finish games, there's a wide variety of reasons. I mean, like I think one of them has to do with the fact that, and one of the reasons why I think for avid",
            "start": 4592.0
        },
        {
            "text": "As far as why people don't finish uh finish games, there's a wide variety of reasons. I mean, like I think one of them has to do with the fact that, and one of the reasons why I think for avid gamers, those uh statistics are so surprising is because there's a wider birth of different kinds of people playing games now. Um, the average age of the gamer is higher than it's ever been, right? So when you're talking about the average age of the game are starting to run up into the 30s, you're starting to talk about people who have kids and mortgages and you know wives are very serious girlfriends um and significant others you know so it's like um I think a lot of it has to do with that people get embroiled into a game they care about it they you know they want to play it more but you know the realities of of there are more gamers for whom the realities of and responsibilities of life are interfering with their game time than there ever have been. Like we're kind of like the first",
            "start": 4626.4
        },
        {
            "text": "know the realities of there are more gamers for whom the realities of and responsibilities of life are interfering with their game time than there ever have been. Like we're kind of like the first generation of gamers to carry video games into adulthood with us. So that clash of like, you know, wanting to ply our hobby and live our lives and be good fathers, be good boyfriends, be good, you know, is all um, you know, and good girlfriends and, you know, and and mothers and all that stuff, you know, like that. That's just a bigger call, I think, on all of us. So, I think everyone just we we also by comparison play a a lower percentage of the games that come out every year. Both because like a they come out there's more of them that come out and b because we don't have as much discretionary. You know, when you're when you're younger and you don't have to pay rent, you know, you'd be surprised how easy it is to come up with some cash together and buy a game. Like, you're you're",
            "start": 4664.88
        },
        {
            "text": "You know, when you're younger and you don't have to pay rent, you know, you'd be surprised how easy it is to come up with some cash together and buy a game. Like, you're poor. Sure, you're a poor student or you're a poor recent grad, but you know, if you're living at home with mom still or, you know, whatever, you can find that money. When you've got all kinds of bills to pay, all of a sudden you buy two games a year and, you know, so I think it's all part of the same trend of like having a broader audience and having an older audience means having an audience that just doesn't have as much time to stay at home and finish a game. I don't think it's any other factor because games haven't gotten longer, they've gotten shorter. Um, you know in the well they've gotten longer if you compare them to like the 8-bit and 16-bit era they've gotten longer right of course but if you look at say like the moment when video games started becoming more mainstream which I I",
            "start": 4709.52
        },
        {
            "text": "\"Longer if you compare them to like the 8-bit and 16-bit era they've gotten longer right of course but if you look at say like the moment when video games started becoming more mainstream which I always look at like '95, '96 like you know the PS1 era PS1 brought in a huge influx of new players in that era you know games were kind of I feel like a little bit longer than they are now now I think it's like not too uncommon for you to see a single player campaign that's only three or four hours long or a good indie game that has a lot of heat behind it that's only a a couple like maybe two hours or less uh long. So it's like even though we're seeing shorter and shorter games that doesn't change the fact that if you know if you don't have the time and you don't have the money then doesn't matter how short or accessible the games are. So I think it has more to do with uh with life factors and changes in the demographic than it has to do with any trends in game dev. I don't think Yeah, I\"",
            "start": 4750.08
        },
        {
            "text": "matter how short or accessible the games are. So I think it has more to do with uh with life factors and changes in the demographic than it has to do with any trends in gamedev. I don't think Yeah, I think I mean I'm I too am not too surprised by the 47% um factor on on the trophies for beating the game. What I'm always interested in and what I think is much more telling and some and for something I don't know like what what necessarily it's telling us is I always like to look at trophies that you can't avoid. Um specifically the first trophy in a game you would get. So like beating the first chapter of a game or like meeting the character. It's basically like moving the stick and like it's like 96.2% of people got this game. I'm like, so someone start So four out of every 100 people that started this game didn't even do that, right? Like didn't even actually play at all. They just started the game and then they just shut it off. Yeah, that's like way more interesting than me.",
            "start": 4788.96
        },
        {
            "text": "that started this game didn't even do that, right? Like didn't even actually play at all. They just started the game and then they just shut it off. Yeah, that's like way more interesting than me. Trophies are telling us a lot of interesting Um and I'm sure the heat mapping that we're getting that developers are getting from those as well as just the stuff they do internally since the games are always connected um is uh certainly quite interesting for them as well. Sure. And I think like honestly if you look at that that percentage of people would also be included in the people who never finished the game, right? And that just speaks to what I to I think more also to what I'm saying is that like if a person booted a game if a person spent $60 on a game, booted it up, and didn't play to that first guaranteed trophy, it's not because the game was horrible. They didn't play the game enough to have an opinion about it. It's because life took to me, it's because life took them away from",
            "start": 4832.24
        },
        {
            "text": "that first guaranteed trophy, it's not because the game was horrible. They didn't play the game enough to have an opinion about it. It's because life took to me, it's because life took them away from it, you know, they just never got and they just never got around to going back to it. Agreed. Yeah. Jack Francis asks the following. Says, \"Hi, Colin and Greg.\" Vince, I enjoyed your discussion last week about No Man's Sky and completely agree that expectations were ridiculously high. Too many people thought this game would be the end-all be-all of gaming and while I think it is a very good game, I don't think that it is life-altering. On the topic of expectations, I personally am hugely excited for the release of Horizon Zero Dawn. And I think like you Colin that if they get it right, it could be a huge IP for Sony and Guerrilla going forward. To to reiterate what he's basically saying, I said that this can be their next big thing for Sony if it's done right. Question. Do you think I",
            "start": 4866.16
        },
        {
            "text": "be a huge IP for Sony and Guerrilla going forward. To reiterate what he's basically saying, I said that this can be their next big thing for Sony if it's done right. Question. Do you think I should temper my reputation with my expectations so as to not be disappointed? Or do you think that uh my very high expectations are acceptable and that I should be confident that Horizon Zero Dawn is the game we all hope it will be? Thanks, Jack Francis. Well, I will say I played Horizon pretty deeply um and it's awesome. Now, whether or not that translates to everything, I also played vertical slices of The Order. Did you know Colin? Did you? Yes. In fact, I was the only one that walked out. You were there with me. Weren't you the one that was there with me when we first saw it? Okay. So guess Oh, you're the one who can vindicate me on all this cuz I was the one who All right, hold on. Let",
            "start": 4902.4
        },
        {
            "text": "There with me. Weren't you the one that was there with me when we first saw it? Okay. So, so guess Oh, you're the one who can vindicate me on all this cuz I was the one who All right, hold on. Let me let me tell the story. Let me tell the story of the order real quick. Okay. We went to the first presentation, the first theater presentation at uh at an event down in Santa Monica. Okay. And we saw what was essentially like a short demo and like I think it was mostly just a a cut scene and a very short demo, right? And we were both like, I don't know about this. Okay. Okay. So, I will vindicate you there. What I will say is that um at an event, was it was it was it PSX? No, it wasn't PSX. It was at a different event, another event that you and I went to together. Um where we got to play it further along along with a bunch of other games. Um I think it was PSX 2014. No, I think it was another showcase in Santa Monica. I think it might have been the follow might have been like the same",
            "start": 4938.64
        },
        {
            "text": "further along along with a bunch of other games. Um I think it was PSX 2014. No, I think it was another showcase in Santa Monica. I think it might have been the follow might have been like the same might have been the same event the year after. Um, and we went to that and we played it and I was like, and you were like, actually, Vince, I think they're on to something. And I was like, I don't know about about that. Do you remember that? The sad you were going to talk about cuz there was two times that we played it where I was like, the first time you were definitely like, nope. Well, the first few times I saw it, I was like, definitely not. The game was running like trash. And the one thing that made me that made me made me mad was everyone was attacking me about that and everyone was writing these golden pieces. I'm like, did you did we like the same game? Like what are you guys talking about? Yeah. When we saw it, it's true. We saw it at that showcase. Then we saw it at PSX. I",
            "start": 4982.64
        },
        {
            "text": "writing these golden pieces. I'm like, did you did we like the same game? Like what are you guys talking about? Yeah. When we saw it, it's true. We saw it at that showcase. Then we saw it at PSX. I remember playing the airship level at PSX, right? Yeah. Like right after we quit. It was PSX, right? And I was like, \"This is cool, you know.\" And then I had these flashbacks to Knack and how cleverly they actually kept previewing Knack over and over again. I was like, I had I remember when Knack came out and it was getting bad reviews. I'm like, \"Really?\" Like I I I had there was no indication for me that Naka was gonna be bad at all. And with the order I had different inclinations where I was like this game is going to be bad. And then at the end I was like yeah there's something here like what are you guys doing? Like and then I realized that that was the best part of the game. So um and it was I remember that airship level was actually really cool. So, uh, with that Horizon, that's why",
            "start": 5020.96
        },
        {
            "text": "are you guys doing? Like and then I realized that that was the best part of the game. So um and it was I remember that airship level was actually really cool. So, uh, with that Horizon Zero Dawn, that's why I'm guarded with Horizon Zero Dawn in that sense because the order kind of tricked me. Knack certainly to trick me. We've been tricked many times. That's why I hate preview games. It's like the worst thing in the world. I just don't want to do it. I played Horizon Zero Dawn. I think it's got clear promise. I I think it's going to be awesome. I I don't I don't necessarily know that that's going to be true, but should you temper your expectations? I think you should always temper your expectations with games. I was going to say No Man's Sky has absolutely been victimized by its expectations. And as I said on Twitter and I was talking to Vince about it earlier, everyone's culpable. Not so much me because I had never had expectations about it, but I'm saying everyone in terms of every group of",
            "start": 5065.8
        },
        {
            "text": "as I said on Twitter and I was talking to Vince about it earlier, everyone's culpable. Not so much me because I had never had expectations about it, but I'm saying everyone in terms of every group of people. So the publisher and the developer obviously overpromising, overhyping, showing it way too much, showing it for too long. Media eating, gobbling this game up for years for some reason. And then even enthusiasts and gamers uh have some culpability in it as well. So when you have a perfect storm a maelstrom of like like that there no one's no no one's expectations are going to be reached. I know you like No Man's Sky more than the average person does. I'd say I don't remember a game this divisive in a long time. At least aa game that's this polar. Yeah. Um in terms of the way people are are It doesn't seem like anyone's in the middle. Like I I don't I don't see like I'm seeing a lot of like this isn't for me. This game sucks or it's boring. And I'm seeing a lot of like wow this",
            "start": 5103.12
        },
        {
            "text": "are are It doesn't seem like anyone's in the middle. Like I I don't I don't see like I'm seeing a lot of like This game sucks or it's boring. And I'm seeing a lot of like wow this game's really got it hooks into me. I can play this game for a thousand hours. So for me, I played it for about three hours and I really did hit a point where I'm like I can't do this. Like I I I was like I would like to give this game more time. Maybe I will. But I'm like I don't really know. I'm doing this just to make a point now that I'm playing the just so I can say I played it for six hours and then maybe you'll believe me more. But really, you know, I'm having these this come to Jesus moment more and more in my life where if a game's not pulling me in, I gave No Man's Sky even more time than I probably should have. No cuz half an hour and I'm like, This is kind of boring. Like for me, like I don't want to do this. Hyperlight Drifter, which I was actually really excited about",
            "start": 5149.28
        },
        {
            "text": "than I probably should have. No, cuz half an hour and I'm like, this is kind of boring. Like for me, like I don't want to do this. Hyper Light Drifter, which I was actually really excited about. I started playing that the other day and I played for 15 minutes and I'm like, I'm out. Like I I just I don't have time for this. Like there's other games for me to play that I want to play that I want to spend time with. I'm playing this game to prove a point. you know, if I played this game to fruition, I'm doing it just so people would tell me don't don't bust my balls. Sure. And really, it's like I'm not going to live my life like that. So, so I've moved on from both of those games. What's funny is that I played I got codes for Brutal, um, No Man's Sky and, uh, Hyper Light Drifter are in similar times, and I played Brutal first because I was like, Brutal is going to be the game that's going to be the worst of the bunch, and I don't want to I'll get it out of the way. And actually, Brutal ended up",
            "start": 5186.08
        },
        {
            "text": "and I played Brutal first because I was like, Brutal is going to be the game that's going to be the worst of the bunch, and I don't want to get it out of the way. And actually, Brutal ended up being in my mind better than both of those other games. And so, I like Brutal. Me, too. It's very straightforward. It is what it is. You see it and it is what it is. But I like it. Like I I'm like, \"This game's fun. It's it I like I enjoyed this game very much.\" And then but I started at first because I was like, \"Well, I it looks cool, but I'm probably going to like it the least.\" And out of those three games, it drew me in the most. I played that game for twice, you know, for twice as long as both of those other games combined. So, um, just thought that was ironic. Yeah, it's a funny thing where I where I do feel like I feel mixed feelings a little bit about um you know what you're saying about No Man's Sky in terms of the expectations cuz like sometimes I think about",
            "start": 5221.28
        },
        {
            "text": "a funny thing where I where I do feel like I feel mixed feelings a little bit about um you know what you're saying about No Man's Sky in terms of the expectations cuz like sometimes I think about the expectations and and I go where do these expectations really come from? Like I look at so from the publisher side I mean I can't remember a time when anyone from Sony or when Shawn Layden himself stood up on stage and said anything about the game that was hyperbolic or untrue. Like they said it was going to be this huge procedurally generated you know universe filled with tons of planets to explore and they did they did deliver on that. They they never said like like I don't feel like like what I what I what I want to avoid is and maybe it's because like I've met the guy a few times and I and I I know at least that my read on him is that he's a good honest and passionate dude but like I don't think Shawn Layden is like you know the second coming of Peter Molyneux that people that a lot of",
            "start": 5258.48
        },
        {
            "text": "I know at least that my read on him is that he's a good honest and passionate dude but like I don't think Shawn Murray is like you know the second coming of Peter Molyneux that people that a lot of gamers are trying to like paint him as as this like liar charlatan or something as a charlatan who like who like who who promised big big big things and then his you know game didn't have one-third of the things that he promised. Like like Shawn Murray never got up on a microphone and said, \"I'm going to make the best spaceflight game that's ever been made and that and said it's going to have this feature and this feature and this feature and this feature and this feature and then the game had none of those.\" Like that didn't that did not happen, you know? So when people talk about the hype train being out of control, this is one of those things I'm like where So then what does a publisher do to control expectations? like how do they put forward what they think is cool about their game and",
            "start": 5308.72
        },
        {
            "text": "being out of control, this is one of those things I'm like where So then what does a publisher do to control expectations? like how do they put forward what they think is cool about their game and then also not be guilty of overhyping, right? And I think the answer is hidden in what you said though um is that you said showing it for so long. I think that's where you get into big problems because it's a combination of two things. It's you have this long amount of time from when the game is announced to when it comes out for people to speculate for the for the anticipation to percolate and reach a fevered pitch. But also, this is going to sound like the most random thing that I no one has probably said about No Man's Sky. But the problem was also that first unveiling of the game was one of the sickest trailers I have ever one of the sickest debut trailers I have ever seen. Like that that debut trailer I didn't know what I was watching. I didn't know what the game was about, but",
            "start": 5349.76
        },
        {
            "text": "one of the sickest trailers I have ever one of the sickest debut trailers I have ever seen. Like that that debut trailer I didn't know what I was watching. I didn't know what the game was about, but that it was so beautiful and well done that I was like overwhelmed by it. Right. So, it's like eventually that wears off and you know you go back to reality and go what is this game actually? But for a lot of fans, you get something like that spectacular and then you get years to think about what it's going to be and it it's almost invariably going to morph into something in their brain that it was never going to be, right? So, it's like even if you didn't say something dishonest, even if you didn't play the hype game, quote unquote, I still think that you have to be culpable in some way for how your audience is going to start riffing on taking the kernels of truth you've put out there about your game and then filling in the spaces in between with what they want if they",
            "start": 5390.8
        },
        {
            "text": "in some way for how your audience is going to start riffing on taking the kernels of truth you've put out there about your game and then filling in the spaces in between with what they want if they have too much time to think about it. Yeah, I think that the I mean, to your point, I don't think anything explicit was said. I could be wrong. Some people are circulating videos and articles about how they said this, this, this. I don't I don't know. The thing that I'm saying is it was implied and it was implied through attention. Not only time but attention. Games are in development sometimes for five, six, seven years, but they don't get attention. And No Man's Sky got its fair share of attention and then some. And I think that the implication by giving it that much attention was that it was going to be a game changer for them. And I think it was a huge mistake. I think Sony mistreated this game. I don't know that that the culpabilities on Hello Games as much as it's on Sony as the",
            "start": 5435.04
        },
        {
            "text": "Was going to be a game changer for them. And I think it was a huge mistake. I think Sony mistreated this game. I don't know that the culpability's on Hello Games as much as it's on Sony as the publisher. Um, to be like we shouldn't have done this for this long with this game. They did it a great disservice. This team is very small. Uh, the game's very algorithmic. Um, we are, you know, as I said before, someone described it somewhere as and it's a thing that you've heard before, but it's it's a mile long and an inch deep. And that's the way the entire game felt to me. I'm like this is just it's just it's math. It. There's no like to me I'm like and that's the thing that kept resonating with me. I'm like none of this means anything because it doesn't actually exist. It's a computer program that just made this. No one's going to find this planet, you know, when there are 18 quintillion planets or whatever. It's like well and someone said that in a review. I was talking to Greg",
            "start": 5474.4
        },
        {
            "text": "computer actually just made this. No one's going to find this planet, you know, when there's 18 quintillion planets or whatever. It's like well and someone said that in a review. I was talking to Greg about how I was very I'm very rarely curious what anyone else has to say about a game outside of my friends and outside of a few publications, right? And I was pouring over these reviews and reviews and progress on No Man's Sky because I wanted to see what people felt about it. I was like, what? I don't know how I feel about it. Like what how do these other people feel about it? And I just kept reading things where I'm like yes, yes. Like it almost helped me inform myself about like to make sense of my own feelings. That one thing about the mile wide and the inch deep, another one about like does this mean anything if no one else is there to see it? And another thing about like the game's lonely, right? And the game's made even lonelier by the fake ships flying in the atmosphere and all",
            "start": 5513.12
        },
        {
            "text": "does this mean anything if no one else is there to see it? And another thing about like the game's loneliness, right? And the game's made even lonelier by the fake ships flying in the atmosphere and all this kind of stuff. Like it has this false veneer of being a community in some way, but the universe is expansive and you're going to the center of the universe and so it's it's unwieldy. You shouldn't run into anyone. So does that make sense? And it became a very confusing hodgepodge for me like this popery of like where I'm like I don't quite get it, I just know I have a problem with this game and and that's and it has really nothing to do with the hype. I'm speaking more of the hype from the outside of watching people when I was at IGN in 2013 when that game was revealed. Everyone's like \"game of the show\" and all this stuff. I'm like why, you know, like why is this game of the show? There's a million other",
            "start": 5549.2
        },
        {
            "text": "people when I was at IGN in 2013 when that game was revealed. Everyone's like a Game of the Show and all this stuff. I'm like why, you know, like why is this game a Game of the Show? There's a million other things like that we actually think are actually predictable. Why? And just the hype it just for three years just like you said percolating. And to me it it marinated too much. It was it was in its own juices for way too long. And and um that's not their fault necessarily. Uh, but I think No Man's Sky is a cautionary tale about maybe it won't be a cautionary tale financially. Maybe Hello Games is certainly going to be fine. The game was probably going to come out on Xbox One at some point, but it's a cautionary tale about it's the antithesis of that Fallout 4 mantra of like show and release. Show and release. That's why I still and I've been saying this and I know that my window's running deep, but my my my left field kind of prediction for this year for a little while was like",
            "start": 5587.44
        },
        {
            "text": "release. Show and release. That's why I still and I've been saying this and I know that my window's running deep, but my my my left field kind of prediction for this year for a little while was like they're still going to show Red Dead and they're still going to release it this year. Like like that's what like because why why do they need a year? Yeah, they don't. Like they don't it doesn't do anything for them. Like it didn't do any like Fallout 4 would not have benefited one iota from being shown a year ahead of time instead of three months ahead of time. Not one not one iota to have you got have your preview cycles and your trailer leaks and your your bullshots have to come out all that. I'm like so I think it's a it's just a cautionary tale. If the game was really great I still think and and some people you think it is and some people think it is. But if it was ubiquitously great let's say it was like The Last of Us. No one thinks The Last of Us",
            "start": 5627.92
        },
        {
            "text": "and some people think it is great, but if it was ubiquitously great, let's say it was like The Last of Us. No one thinks The Last of Us is a bad game. If The Last of Us were as good as everyone expected, you'd have to be crazy not to understand why The Last of Us is a good game, right? Right. It's just one of those games. It's like Super Mario Brothers - it's obviously a great game. Even if it was that good, if it still existed in the ether for three or four years, it would have never met everyone's expectations. People would still be disappointed with it. And that's why I think it's going to happen with The Last Guardian, as everyone predicted - The Last Guardian is probably going to score two points lower than it would have if it wasn't The Last Guardian. I really do believe that. Like, people who put scores on games might not consciously do it, but The Last Guardian might have been an eight or a seven, and I bet you it's going to be",
            "start": 5662.32
        },
        {
            "text": "The Last Guardian. I really do believe that. Like, uh, people that put scores on the games maybe not consciously, but The Last Guardian might have been an eight or a seven and I bet you it's going to be a five or a six. Sure. And I I think I think something else that I want to add real quick before we move on from it um about No Man's Sky is that I want to tell you why I think the press got so excited about it because honestly in in this case I would say the press includes me. Like I before I was there at the time too so I'm I'm culpable as well. Yeah. I mean like I uh I I saw that those first trailers and I I lost my mind and then I was one of the you know for a long time I was I had there was a period of time on where I was the person on earth who had played No Man's Sky more than anyone else outside of Hello Games. I got this big two-hour chunk of time to play the game um for IGN First, which was more than anyone had been left alone with the game for. And uh and I came I wrote a what I",
            "start": 5695.04
        },
        {
            "text": "outside of Hello Games. I got this big two-hour chunk of time to play the game um for IGN First, which was more than anyone had been left alone with the game for. And uh and I came I wrote a what I would say is a pretty I mean I wasn't like a glowing like buy this game it's the best thing ever but it was a it was definitely a positive preview that I wrote coming out of that 2-hour uh hands-on. So I think to some degree I I you know I want to speak about why I think the press got excited about it. Something that you know you've seen this happen over and over again over the years is that when new hardware comes out um the first thing that everyone rushes to see is something that's visually spectacular. But the thing that like I feel like people especially who work in this industry are a little more jaded and they get tired of just seeing prettier graphics and prettier picture being the only thing that comes out of new hardware. Especially a lot of us in the press I feel say what does all",
            "start": 5735.68
        },
        {
            "text": "more jaded and they get tired of just seeing prettier graphics and prettier picture being the only thing that comes out of new hardware. Especially a lot of us in the press I feel say what does all that power do for design? What does that power do for gameplay? What kind of experiences can I have because of that power that I couldn't have before? Not how much prettier can the same experience look? How many what kind of new experience can I have? So when someone got up on stage and said, \"With this power of this system, we can build and run an algorithm that will build a theoretically infinite number of universes without us having to do a damn thing.\" Instantly, a bunch of people in the press went, \"That's what I've been waiting for. I've been waiting to hear those very specific particular grouping of words that technology was going to allow me to have a kind of experience that was new and that I had dreamed of and that was to explore an infinite seamless galaxy",
            "start": 5780.88
        },
        {
            "text": "\"Particular grouping of words that technology was going to allow me to have a kind of experience that was new and that I had dreamed of, and that was to explore an infinite seamless galaxy. And that the power of this system would make it possible. It never happens. Like we're always told about the power of new systems making something look cooler or look nicer, but those of us in the press are just tired of that. We want to hear that it's going to allow us to do something we've never done before and explore an infinite-sized universe that's all unified in one place that we all explore together even if we don't see each other. Was uh kind of a golden promise that was unlike anything else that any of us had ever heard. And I feel like there's a lot of us in the press who just thought that on that note alone it was worth covering the game and giving it some hope. You know what I mean? Because how many times do you, in a generation, hear those kinds of promises?\"",
            "start": 5829.12
        },
        {
            "text": "the press who just thought that on that note alone it was worth covering the game and giving it some hope. You know what I mean? Because how many times do you in a generation do you hear those that phrase or that idea that like that our technology is going to allow us to try something new, not just try something prettier? I mean it's like it's what everyone hopes for and we never get it. You know, for two generations now since the 360 and PS3 came out, like we've all been saying that, right? We've been saying, \"Yeah, games keep getting prettier, but I don't get to do anything any more interesting or unique from what I did last generation.\" I'm playing the same games with a nicer skin. You can say a lot of bad things about No Man's Sky. It certainly deserves a lot of the criticism that it's getting. Um, and I and I say that as a person who's enjoying playing it, but one thing you can't say about it is that it's like Final Fantasy XV with a shinier skin on it. That's it's one of the few games",
            "start": 5880.48
        },
        {
            "text": "It's getting. Um, and I and I say that as a person who's enjoying playing it, but one thing you can't say about it is that it's like Game X with a shinier skin on it. That's it's one of the few games that you can't say that about. And I think that's if nothing else where a lot of the fascination with it came from. I think you're right in the sense that um on the last GamesCast that people might have listened to if there's crossover between these podcasts and I think there is. One of the things I was basically saying was that No Man's Sky seems to deserve the benefit of the doubt if not a little bit of time to just let it let it kind of exist and let it just feel like because it is new. It's It almost reminds me of an MMO in the sense that you can't experience it all at once and you can't experience it all in a few days or in a week. You really got to like sit with it and it's about the long tale of the game. I don't think there's any shame in doing what I've done, which is basically",
            "start": 5922.48
        },
        {
            "text": "experience it all in a few days or in a week. You really got to sit with it and it's about the long tale of the game. I don't think there's any shame in doing what I've done, which is basically say this isn't going to get any different for me. Nope. But at the same time, I do understand why people are upset about the lack of skepticism about the game because I've and I'm not trying to beat my own drum or toot my own horn here, but it's like when you say things like that, not you, but when things are said about this game, we can make this infinite universe and it's all algorithmic and it's I'm like So there's something I'm like there's something up about it. Could the number counting capabilities of the PS4 compared to the PS3 and the PS2 do this? Yes. Did you do it? Yes. Are there like 18 types of planets, you know, apparently or like 25 types of planets and just weird looking animals and you clip through them and and you just get and sell",
            "start": 5962.72
        },
        {
            "text": "Yes. Did you do it? Yes. Are there like 18 types of planets, you know, apparently or like 25 types of planets and just weird looking animals and you clip through them and and you just get and sell it and and like like I'm like, \"Yeah, so you did it, but there's but where's the the the depth, you know, like sure is it?\" And that and that was one of the things that someone had um god it was Jim Sterling who said it which I I loved and he said something along the lines of we are mistaking scope for character like we're escaping we're we're basically saying the scope of the game somehow speaks to the character in a positive way of the game. And I'm like you're right and it's not true. That's why I always said about and I I know I've said this I know people are mad about The Witcher 3 where I'm like The Witcher 3 is too dense. It doesn't matter how much shit's in there. It's too much. It doesn't make the game better, you know, like it makes the game for me way worse than a game like",
            "start": 5997.36
        },
        {
            "text": "3 where I'm like The Witcher 3 is too dense. It doesn't matter how much shit's in there. It's too much. It doesn't make the game better, you know, like it makes the game for me way worse than a game like Fallout where it's like it there's there it's a big world with less to do in it because it just seems more manageable. And so we haven't found and that's just my opinion. I don't or maybe even more believable. Sure. Um now I'm not saying The Witcher 3 is a beautiful world, beautifully written, really a kind of a game that is, you know, really to beat in terms of Western role playing games. I'm not on it at all. What I'm saying is we are conflating different things as gamers and as enthusiasts and as press and even as publishers and developers where I'm like Journey's 90 minutes is still way more valuable than 50 hour role playing games that I loved. Sure. You know, and I'll never touch that game again as long as I live. I played it once and I will never touch it again because it was that",
            "start": 6041.12
        },
        {
            "text": "valuable than 50 hour role playing games that I loved. Sure. You know, and I'll never touch that game again as long as I live. I played it once and I will never touch it again because it was that 90-minute experience that was so resonant as one of the great games of all time. And if we just judged it based on check boxes on the back of a box on retail, it's 90 minutes long. That's it. Multiplayer, you don't even know who the players are with. There's no gameplay. That's it. The game has no character. But No Man's Sky has this 18 quintillion planets. Certainly, it has high replay value, you know. And I'm like, well, that's a good point, Jim, isn't it? You know, like this game shows, I think, in some ways what's wrong. In terms of like you're right, we have and I've said this before about people's obsession with power, right? With with processing power and computing power where I'm like name a game that a PS2 couldn't have done, you know, and people are like, well, this is an",
            "start": 6086.72
        },
        {
            "text": "about people's obsession with power, right? With processing power and computing power where I'm like name a game that a PS2 couldn't have done, you know, and people are like, well, this is an example, right? Sure. But people always point they're like, well, Resogun. And I'm like, The idea was like Resogun's Vox would've struggled to run anything else, but Resogun runs on VA, it's just toned down, right? Has trouble, but yeah. And on PS3 it runs, right? Like they just toned it down and people point at Shadow of the Colossus and are like \"the Nemesis system\" and I'm like come on guys, you're not showing me... and so to your point you're right No Man's Sky might really be the first example of something that cannot be done in my mind on PS2 just with a more graphically simple way you know or a less robust way and that I so I agree with you we are waiting for that next big thing and what I'm wondering is if similar to books or movies this is it you know like you have your",
            "start": 6133.04
        },
        {
            "text": "or a more in a less robust way and that I so I agree with you we are waiting for that next big thing and what I'm wondering is if similar to books or movies this is it you know like you have your shooter games and you have your action platformers and your adventure games and your role playing games and that's it. Just like you have your thrillers and just like you have your techno thrillers and your mystery novels and just like you have like forever and ever and ever and ever and it's how people like iterate in those things that matters most. Are there new movie genres? Like, no. But everyone's like, \"Well, comic book movies.\" And I'm like, \"But they're action movies, right?\" Right. Exactly. You know, or like are there new like House of Leaves is a great book and it's written in a very unique way, but it's it's a it's a thriller. It's a horror book, you know, like and so I'm wondering if we also almost expect too much as well. Well, sure. That's that's a great question to ask.",
            "start": 6175.76
        },
        {
            "text": "Way, but it's it's a it's a thriller. It's a horror book, you know, like and so I'm wondering if we also almost expect too much as well. Well, sure. That's that's a great question to ask. I guess my my answer to that would be um you know yeah I think we've run out of structures to explore in film you know different structures and and and uh and tones and whatnot but at the same time film is been around for quite a bit longer than games right so I I think um you're right we're going to have to ask that question eventually is this it do we have the structures and genres and and and base you know kind of Campbellian formulas that we're going to have and now it's just you know what uh what values we plug into those variables right and what it comes out with and and to what level of production and skill its creators can bring to it you know at some point we'll have to ask that question like I think we're at the end but I think it's too early in our medium's life to start saying that and if\n\nI corrected the following:\n\n* \"cambellian\" -> \"Campbellian\" (proper noun, referencing Joseph Campbell)\n* No other changes were necessary.",
            "start": 6215.2
        },
        {
            "text": "and skill its creators can bring to it you know at some point we'll have to ask that question like I think we're at the end but I think it's too early in our medium's life to start saying that and if the takeaway and I said something like this on Twitter that got me in a little bit of trouble with with a lot of Pokémon Go fans when I was saying that how I feel like Pokémon Go and No Man's Sky, while they're completely different games, they have similar sets of shortcomings. They're both maybe a little bit shallow. They're both kind of uh buggy and maybe not as polished as they could be. Um they both kind of rely on kind of collectathon loops that are kind of grindy and monotonous. Um you know, but yet one is like super successful because it's super accessible. You know, it's very accessible and it's got a powerful franchise behind it and it's less lonely of an experience because, you know, you can walk around a park and there's other people playing it and all that. So, it garners",
            "start": 6260.56
        },
        {
            "text": "and it's got a powerful franchise behind it and it's less lonely of an experience because, you know, you can walk around a park and there's other people playing it and all that. So, No Man's Sky gets all this love and adoration and it does well and it succeeds. And then, you know, No Man's Sky is more lonely um and ambitious and uh you know, doesn't have necessarily a lot of accessibility or recognizable fun things about it the way Pokémon might have. And so it gets kind of cast down and looked at kind of as like you said a cautionary tale or a tale of hubris or a poor risk. And I guess that makes me a little bit sad because I don't I don't want to live in a world where No Man's Sky is the haha told you so. You shouldn't even try example. Instead, I want it to be the okay. It's not a great game, but it's an interesting step in in in a new area we can explore. Let's keep going. And the sad thing is that it sounds like from the way people are receiving it and from if you",
            "start": 6304.48
        },
        {
            "text": "It's not a great game, but it's an interesting step in a new area we can explore. Let's keep going. And the sad thing is that it sounds like from the way people are receiving it and from if you know as a game developer, I said this on Twitter, too. If I'm a game developer and I look at what do I do? Do I try to go with the No Man's Sky approach of trying something that's a little bit too big for my britches, but it's interesting and it's new and maybe I fail a little bit at it, but I take another step forward in that direction for game development. Or do I go with something super safe and easy that I know will return something for me right now? If I look at the lesson that's being taught here, as a developer, let's do the safe thing that we know we can do. And if like if we get that mindset now, if we already start going, you know what, this is it. That makes me",
            "start": 6353.52
        },
        {
            "text": "we get that mindset now, if we start saying if we start asking that question already after just a few decades of developing games, if we already start going, you know what, this is it. That makes me really sad. I don't want to live in a world where we've decided that or we've settled on that and and and No Man's Sky, the reception of No Man's Sky makes me feel like we're closer to that world than I probably feel comfortable with. I think to your point and in kind of wrapping this up I guess is that I feel like a lot of it is a lot of this this the amalgamation of of uh aspects of a game uh seems to be subjective and and time based. In other words, um a game like The Banner Saga before. I never beat it, but I I spent a lot of time with it and I liked it. And it's a it's a strategy RPG. It's kind of light. Um, yeah, the the storytelling is good, snowy, kind of got like A Game of Thrones kind of vibe. I feel like if I got two more of those, I'd been like, \"No, no",
            "start": 6398.32
        },
        {
            "text": "it's a strategy RPG. It's kind of light. Um, yeah, the the storytelling is good, snowy, kind of got like A Game of Thrones kind of vibe. I feel like if I got two more of those, I'd been like, \"No, no more.\" Right. It's the way I felt about Abzû where I was like, \"This is such a tryhard journey, man.\" Like, I I I don't I don't know how else to describe it. We already have a Journey, you know, and like we already have that game. We don't need another one. And but if Abzû came out first, I might feel that way about Journey, you know. It's just that Abzû had no emotional resonance with me. The timing was off. It was not it it too late, you know. And so I feel like Yeah, you're right. People should experiment because I think a lot of the timing comes a lot of the a lot of rather the the reception comes with timing, comes with the zeitgeist. Uh and I don't know that it has been hit appropriately with No Man's Sky. mostly because of timing, you know, and uh not not the amount of time that it",
            "start": 6446.48
        },
        {
            "text": "comes with timing, comes with the zeitgeist. Uh and I don't know that it has been hit appropriately with No Man's Sky. Mostly because of timing, you know, and uh not not the amount of time that it was in development, but just we're in a jaded place as gamers. And I think that uh I'm not alone there at all. And I think we're kind of getting a lot of us are getting tired of playing the same old thing over and over again. I think you're starting to see franchise fatigue in a real way. I think you're starting to see um uh a moroseness about the way we kind of receive some games and and a sort of um stagnation in the way games are delivered. And I am in the place where I'm like, is this it? You know, when I get excited about Bloodstained: Ritual of the Night, it's because it's Castlevania. It's not because it's new. It's because it's old. You know, I saw that Monster Boy and the Cursed Kingdom, whatever the that game's called today. I was like, \"This game looks awesome.\" Because it looks like",
            "start": 6493.84
        },
        {
            "text": "It's not because it's new. It's because it's old. You know, I saw that Monster Boy or Wonder Boy, whatever the game's called today - I was like, \"This game looks awesome.\" Because it looks like something I played 20 years ago. You know, I play Call of Duty campaign almost every year and I saw the new Call of Duty and I'm like, \"Oh, space like I'd rather go back to World War II. Like, can we just go to World War II like every year, you know?\" Like, so maybe I'm the problem. I don't know if I was going to say what the problem is. I would say more than anything, and then we'll leave it at this, I guess. More than anything, the problem isn't an obsession with the past, although maybe that has something to do with it. But I think more than anything, it's the modern gamers' obsession with the idea that there's this sweet spot formula of amount of money paid to number of hours of enjoyment gleaned being the gold standard for whether they decide a game is worth their",
            "start": 6541.04
        },
        {
            "text": "obsession with the idea that there's this sweet spot formula of amount of money paid to number of hours of enjoyment gleaned being the gold standard for whether they decide a game is worth their time or if it isn't. And that's a huge problem. And that's what Jim was saying in his review, right, of No Man's Sky. For better or for worse, you'll look at a game, I mean, I'm just throwing this example and you look at a game like the Unfinished Swan, which is a remarkably good game. And again, if you were just to say like we always ask, we like in reviews, if you didn't mention it, we get we wouldn't get in trouble with our editors, but reviewers be like, \"How long is it?\" And I started asking myself like, I would be curious about that, too. But then again, why does it matter? Yeah. Is the game good? Sometimes games get worse because they're too long. Sure. Often actually get like that's why I just don't finish some games anymore. I'm like, I'm I'm I'm done, you know? Like, I don't need to",
            "start": 6579.12
        },
        {
            "text": "good? Sometimes games get worse because they're too long. Sure. Often actually get like that's why I just don't finish some games anymore. I'm like, I'm I'm I'm done, you know? Like, I don't need to play this anymore. I'm over it. Like, I've seen I've seen it. I'm good. I'm going to move on. Anyway, uh we're going to wrap up the show with three segments that we usually do. I'm going to let you guys know that we're not going to do singing the shoe. That's more of Greg's kind of uh thing. So, and I'll make it easier for Kevin to edit as well. So, um so let's go through a trio of segments and then we're going to go. They'll be very quick. Forgotten PlayStation game of the week. This one comes from Reverse Flash. Says, \"Hey guys, I have a suggestion for this week's forgotten PlayStation game. Jeanne d'Arc for the PSP.\" This was a strategy RPG developed by Level-5 for the PSP. Level 5 is a great developer when it comes to RPGs, and this one, I believe, was their first attempt at a",
            "start": 6616.72
        },
        {
            "text": "game. Jean D'Arc for the PSP.\" This was a strategy RPG developed by Level-5 for the PSP. Level 5 is a great developer when it comes to RPGs, and this one, I believe, was their first attempt at a traditional strategy RPG, and it did not disappoint. It plays very similar to a Final Fantasy Tactics or Fire Emblem. I remember really enjoying the characters and story in the game, providing a pretty decent challenge in its later battles. I still regard it as one of the best strategy RPGs I've ever played in one of PSP's best games, thanks for Versus XIII. There's a lot of adoration for that game, and so I thought I would uh And I've never actually played it. Yeah, I I used to see it on my on my store shelf a whole lot, but I I never got around to to grabbing it. Uh, Level-5 is a good developer. Great developer obviously did Dark Cloud, Rogue Galaxy, but they also did White Knight Chronicles, so beware. Um, worst PlayStation name of the week. Now, Greg typically likes to do",
            "start": 6650.96
        },
        {
            "text": "Great developer obviously did Motoko Cooney, Dark Cloud, Rogue Galaxy, but they also did White Knight Chronicles, so beware. Um, worst PlayStation name of the week. Now, Greg typically likes to do this if it's the person's ID. So, like the person's talking about his own ID, but Annie writes in with a a name that I had I had to put in there. It's not hers. She says, \"Hello, Colin and Greg.\" Vince, hope you guys are having a lovely afternoon or evening or whatever time of day it is when you guys are recording. I am unwinding with a few Overwatch matches on a Sunday afternoon. My team was kicking ass and I was doing a pretty good job clearing the path for my team as Tracer. It was the last 30 seconds of the match and we were inches away from capturing our objective when out of nowhere a sniper shot takes me out. Lucky Luckily, Lucky Luckily DVA, a tank was behind me and was we and we still captured the what is it? Div.Va. Div.A. I'm sorry. Div.A. D.Va. Div. D.Va is diva. Jesus. Lucky D.A. A",
            "start": 6685.12
        },
        {
            "text": "takes me out. Lucky Luckily, Lucky Luckily DVA, a tank was behind me and was we and we still captured the what is it? Div.Va. Div.A. I'm sorry. Div.A. D.Va. Div. D.Va is diva. Jesus. Lucky D.A. A tank was behind me and we still captured the objective. But what makes death inches away from victory more infuriating is being taken out by a widowmaker named anime titlover. Love from Toronto, Annie, who is playing the correct character. Anime Titlover. Jesus Christ. And uh PS, I love this best friend. Uh this week uh comes from a man named Colin but with two L's. He says, \"PS, I love you XOXO is one of my favorite podcasts.\" Incorrect. It's your favorite podcast. I loved going from Xbox 360 to PS4. It just felt right. My only issue with PlayStation is I never have any friends to play with. I want to jump into the Doom, Dying Light, and Uncharted 4 multiplayer because I haven't yet. Good trio of games there. But I also play games like Rocket League, Nithog, Black Ops 3, and GTA 5.",
            "start": 6719.76
        },
        {
            "text": "want to jump into the Doom, Dying Light, and Uncharted 4 multiplayer because I haven't yet. Good trio of games there. But I also play games like Rocket League, Nithog, Black Ops 3, and GTA 5. Another quadrilogy of games, I would say. Quadrilogy. Whatever. Think you could help a team fat kid out? His PSN is the Colin Hill. So, don't spell it like my name. Spell with two L's. T H E C O L L I N. H I L L. the Colin Hill ad Colin Hill. Be nice to him. He was an Xbox 360 fan over at PS3 fan, so be kind to him. He made a mistake. He says, \"Love the show, guys, and thank you so much.\" And that's it for us on PS. I love you, XOXO. I don't know what episode this is. We'll figure it out later. Vince, thank you for joining me. I hope you had fun today. I had a blast as always. Thank you for making time for us. You're welcome with us anytime. Uh, all your work can be found at ign.com. You're the reviews editor over there. Uh, I Okay. Well, I not on paper. I am not a review. I'm just a regular old",
            "start": 6769.12
        },
        {
            "text": "for us, you're welcome with us anytime. Uh, all your work can be found at ign.com. You're the reviews editor over there. Uh, I okay. Well, I'm not on paper. I am not a review. I'm just a regular old editor, but I do lots of reviews over there. I mean, what my experience is, it's like all you did. So, but I guess it sounds like you're previewing and doing some other things as well. So, it's good to get out of your cage every once in a while. Hey, man. Uh, they can follow you on Twitter at VinceIngenito. Before we go, I want to have one question for you if you can answer it just very briefly. Absolutely. What's the deal with Street Fighter V? Uh, are people coming around to it? Because I know that it seemed to be lukewarm. It missed sales expectations and I was curious to ask you that before we left. Is are people enjoying it? EVO just happened and all that kind of stuff. Like what's the deal? The real quick version is uh, the game has not hit",
            "start": 6811.92
        },
        {
            "text": "and I was curious to ask you that before we left. Is are people enjoying it? EVO just happened and all that kind of stuff. Like what's the deal? The real quick version is uh the game has not hit as well with the casual fighting game fan as Street Fighter 4 did. Um it certainly started out very strong with the competitive uh with competitive players and it's still very strong with competitive players. Although some things that have come to light about the game's engine, most uh most notably the uh like the native eight frames of input lag that are kind of just kind of coded into the way the game works have soured some people's uh ideas about it and they're looking to see that fixed. Um so overall I would say the game is still in a very strong place. It's still a great game and it's it had it put up record numbers at EVO. Um so it's not going anywhere. Um, and it's not going to be Street Fighter V where people just stop playing it, but uh, it it definitely has, uh",
            "start": 6846.4
        },
        {
            "text": "it put up record numbers at Evo. Um so it's not going anywhere. Um, and it's not going to be Street Fighter cross Tekken where people just stop playing it, but uh, it it definitely has, uh, some ground to gain still both with casual players and a little bit to make up now with competitive after some of the things that have come to light. Cool. Thanks for that. Yeah, I always like your insight on fighting games because it's I I enjoy them, but I don't understand them. Uh, Vince, thank you so much for your time. We'll have you back soon for either this or Gamescast or something else. Uh, be well. Thank you so much for supporting us. Uh, by the way, again, this is the very last episode of PS I Love You XOXO from this old set. Um, with the exception of a Games Cast exclusive for the Patreon supporters that I'm going to be recording with Dan Ryckert, this is the last show we'll ever record here. So, um, because of your support on Patreon, um, as well as other things, we're",
            "start": 6888.56
        },
        {
            "text": "the Patreon supporters that I'm going to be recording with Tim Gettys, this is the last show we'll ever record here. So, um, because of your support on Patreon, um, as well as other things, we're moving to a new studio and we're going to unveil that August 22nd at 10 a.m. Pacific time on twitch.tv/kindafunnygames with a bunch of uh, cool show unveilings and shenanigans, I'm sure, for 12 hours. So, Greg's nodding in agreement in a very vigorous kind of way. So, uh, so uh, we'll see you next week. Thank you so much for your support. We love you and we appreciate you. Goodbye. Heat. Heat.",
            "start": 6925.52
        }
    ]
}