{
    "id": 1977,
    "video_id": "o29HPiJ703k",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Tim and Greg's Gamescast Date - Kinda Funny Gamescast Ep. 80",
    "description": "Tim and Greg have a one-on-one talking about being excited for games, video game trilogies, and Abzu. (Released to Patreon Supporters 08.05.16)\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1471006803,
    "duration": 6407,
    "transcript_chunks": [
        {
            "text": "What's up, guys? Welcome to the first ever episode 80 of Kinda Funny Gamescast. As always, I'm Tim Gettys, joined by one half of the coolest dudes in video games, Greg Miller. Hey, this is the first time I've ever done a show with you. I know that's true. We did the Patreon exclusives, but those are different. You didn't have to do the intro roll in the beginning. You just got to do whatever. Now you're here. You gotta be locked in. You gotta be delivering the goods for everybody. You gotta be very professional. #profesh. Yep. That's definitely not trying to be Colin. That's what I'm going to do today. No, Colin doesn't host shows. He only hosts Colin & Greg Live. That's just a whiteboard and a lecture every day. The lecture. Oh my god. He's a teacher. He is a teacher. Colin's a teacher. Man, he was trained for it and he uses it. Oh man, that would have been I'm excited for this. Can you imagine finding out that Colin's your professor? Now, I know a lot of you",
            "start": 0.31
        },
        {
            "text": "Colin's a teacher. Man, he was trained for it and he uses it. Oh man, that would have been I'm excited for this. Can you imagine finding out that Colin's your professor? Now, I know a lot of you at home are like, \"Oh my god, that's the dream.\" Yeah, I'm the kid that would have been like, \"Oh no, Morarty. I got Mori.\" Mr. Morarty. **** You know, yeah. He comes in, he just rants and raves. And you're like, \"Is any of this going to be on the test? Do I really need to know about this third party Gary Johnson right now?\" Yeah, exactly. About the third party Gary Johnson. We're talking about American history, not American right now. What are you doing, ladies and gentlemen? Patches on him. This is Kinda Funny Gamescast. Every week we talk about video games and all the things we love about them. And I feel like this is a good duo for that. Yeah. Me and you. You and I. We're the ones that love video games. Yeah, we do a lot. We uh can talk about them. We can believe about them.",
            "start": 45.52
        },
        {
            "text": "them. And I feel like this is a good duo for that. Yeah. Me and you. You and I. We're the ones that love video games. Yeah, we do a lot. We uh can talk about them. We can believe about them. We can play them play them like I just watched you play one. You just I just finished Abzu in front of you, which you're excited to play, but I ruined it for you. Now you know how it ends. I the ending I knew it was getting there. I'm like, I'm just going to look pretty abstract. Don't worry. Yeah. Yeah. Yeah. Yeah. Um but if you wanted to get the show early, you can go to patreon.com/kindafunnygames. Got a bunch of goodies over there and all that stuff. or you can get it for free at youtube.com/kindafunny where it's distributed every day Monday through Thursday topic by topic full episode Friday you can also get it on iTunes something I don't like about iTunes and I need this to be clear to everybody I don't like how when you go to iTunes.com/kindafunny it does this weird thing where it reroutes",
            "start": 82.0
        },
        {
            "text": "can also get it on iTunes something I don't like about iTunes and I need this to be clear to everybody I don't like how when you go to iTunes.com/kindfunny it does this weird thing where it reroutes to a page that's like you can download iTunes I do that yeah I hate that iTunes does that crap all the time you click on somebody's link and it's like oh forget us on iTunes you're like do you want to download iTunes like I have iTunes. Could you just open this in iTunes or could you just link the problem and what doesn't make sense if you go in iTunes and you search for Kinda Funny our podcast come up. You can click on PS I love you. Yeah. Available every Tuesday 9 a.m. You can click on Game Over Show available every Friday at midnight whenever Greg gets to it. No, the free ones are good. Okay. Free ones are always set. Okay. But that's Greg has a week to handle that show. Yeah. I mean that doesn't stop him from screwing things up. You're right. You're right. You get Games",
            "start": 122.08
        },
        {
            "text": "Okay. Free ones are always set. Okay. But that's Kevin has a week to handle that show. Yeah. I mean that doesn't stop him from screwing things up. You're right. You're right. You get Gamescast, this beautiful big beautiful show here. You go to any of those. You can go to more from this publisher. Click on Kinda Funny. There's this beautiful page that I helped set up with our homies over at Apple. Yeah. And I'm like, great. Like, what's the link? You can right-click, copy link. It's iTunes.com/kindfunny. You put that in download iTunes. Download. Come on, guys. Come on. The big news is that when I was walking past Portillo a second ago, the Apple Maps car passed me taking pictures. Oh, yeah. So, I'm going to be an Apple map. No problem. You are going to be internet famous, Greg Miller. Everybody's going to know me on that Apple map. I'm excited about this episode. We've had a good day. We have had a good day. We We had We decided this was going to be our date day. I",
            "start": 162.24
        },
        {
            "text": "Greg Miller. Everybody's going to know me on that Apple map. I'm excited about this episode. We've had a good day. We have had a good day. We We had We decided this was going to be our date day. I greeted you at the door in my underwear when you got here this morning. Did your underwear. Then we did GameOverGreggy and TimGettys live all by ourselves. No Kevin, no Nick, no Colin Moriarty. Then we went to a lovely lunch. Then we got some fro-yo. We went to a burrito place different than our normal burrito place. And that is when you know that you're getting frisky and adventurous. Yeah. Let's get let's get out of the rut. Let's go to this new place. I was feeling good. It was good. I liked it a lot. I did too. Um I had a wet burrito. One of the best burritos I've had in a while. Wow. Yeah. The the enchilada sauce was Yeah. I had I had chorizo tacos. They were very good. To thereso upsets me because it reminds me of GameOverGreggy and he's that Starbucks sandwich made one and it just smells like him. That's weird.",
            "start": 199.36
        },
        {
            "text": "was Yeah. I had I had chorizo tacos. They were very good. To there's upsets me because it reminds me of Kevin and he's that Starbucks sandwich made one and it just smells like Kevin. That's weird. And so like the kind of makes me gag a little bit. Greg Miller makes you gag. Greg Miller makes me gag. That's how that works. Um but anyway, yeah, today's episode's going to be fun. On calling live, I asked a lot of people for for questions. So we're going to do two topics of of audience questions. We got some good ones. Okay, good. About time these kids brought something good. It's going to be fun. Let's start with Abzu. Abzu cuz my god. Yeah, that game looks like a game. It's taking us It's taking the world by storm. This Abzu. It's not hit the Pokémon Go the world threshold, but okay. Our industry, it's taking Marty O'Donnell by storm. Oh, and Mitch Dyer and Kotaku and Chris Blazinski. Everyone's out there tweeting and talking and reviewing Abzu talking about it. I just played it. I just beat it. Yeah.",
            "start": 231.52
        },
        {
            "text": "taking Marty Sart by storm. Oh, and Mitch Dyer and Kotaku and Chris Hinosian. Everyone's out there tweeting and talking and reviewing Abzû talking about it. I just played it. I just beat it. Yeah. Okay. That was something I did for two hours. So, let's give a little bit of background on Abzû. Absu not made by that game company despite the similarities. Giant Squid is the developer, and they're led by Matt Nava, who previously worked at that game company. This is their first game. The art director for Flower and Journey, right? Aka two of my favorite games of all time. Yeah. Leaving here to do this. Correct. Also, Austin Wintory, composer of Journey. Yep. Composer of this game. Look at you with your facts. And that took me two minutes of watching you play for me to be like, \"This is a game for me.\" Right. This looks awesome. And that's the whole thing about it is what I want to as we get into this. What do I think you should play",
            "start": 273.12
        },
        {
            "text": "of watching you play for me to be like, \"This is a game for me.\" Right. This looks awesome. And that's the whole thing about it is what I want to as we get into this. What do I think you should play Abzû? Of course. I know. And it's going to be spoiler-free. Uh, should you play Abzû? Of course you should play Abzû. It's It's another one of those games, of course, that's going to be our games are art. And here's this thing like my it's it's similar to my inside thing when we did the review of Inside where it's just like it's really abstract. You know what I mean? And like I get that and you want me to talk about it and think about it, but I kind of don't like that. You know what I mean? And so to go back flow and Flower never hit the mark for me. I played both those games, finished both of them, right? Yeah, probably. And even though the it's the journey, not the destination with those kind of games. IMO Flower I like Flowers. Flower was great as a whole, but like you end and you always",
            "start": 321.44
        },
        {
            "text": "Right? Yeah, probably. And even though it's the journey, not the destination with those kind of games. IMO Flower I like Flowers. Flower was great as a whole, but like you end and you always just back in the window still. It's like all right, I see what's yeah, but I feel like there is an ending to Flower. I never beat Flower. Flower didn't click with me. Yeah. So, but Journey did click with me. I love Journey. Journey I thought was okay, cool. I get what's happening here. And with Abzu, I never really got it and I just beat it like literally 20 minutes ago, 30 minutes ago. And so I need to go read about it. I want to go do the first thing I did though was jump into Jose Otero's IGN review and he was with me there. He gave it eight three I think. And he was talking about like, you know, his cons are that's a little too loose narratively. Yeah. Yeah. And that's one of the things because I love artsy games. I love",
            "start": 355.36
        },
        {
            "text": "he was talking about, you know, his cons are that's a little too loose narratively. Yeah. Yeah. And that's I hate saying that's like one of the things because I love artsy games. I love I love people creating art. That's why I love video games is that it's an art form and everybody gets to go express themselves and do different things with it, but it does at times feel like you're trying. Is this an a game for art's sake? You know what I mean? Is it that kind of thing? And not anything wrong with that. But it and it also just does feel like in a lot of ways underwater journey of like you're going it's like what's happening? Okay, here are some of the cave paintings or like I'm trying to figure out what exactly piece it together how it's going. But then by the end when I get it and I do the thing and this happens blah blah it's like okay. Yeah. And like you know the way people keep talking about it and here's what I think might be the problem for me in particular me personally I",
            "start": 393.84
        },
        {
            "text": "do the thing and this happens blah blah it's like okay. Yeah. And like you know the way people keep talking about it and here's what I think might be the problem for me in particular me personally I should say is the fact that everyone's talking about it as it's a game that's super relaxing. It's this game that's meditative. It's this kind of thing. That's what I've been applying to my expectations for No Man's Sky. That No Man's Sky is going to be the game that I sit there and play and chill out for 30 minutes a night and be done with and go to bed. Uh, jumping into this one today, I wasn't necessarily in the mood, but I wanted to be able to talk about it. I wanted to see what everybody's talking about. I get why people love it. It is beautiful. Oh my god, is it a beautiful game every and like that's the one that's for me the best part of the game is like at any point I felt like I could put the controller down and look back or go into the meditate meditating because that's like one",
            "start": 428.32
        },
        {
            "text": "like that's the one that's for me the best part of the game is like at any point I felt like I could put the controller down and look back or go into the meditate, meditating because that's like one of the big things where you see these like uh shark statues that you go and you rest on their heads and you meditate and then the camera just kind of spins around and see it always looks like a moving painting. It's always beautiful like the colors whether they're using a very very dark palette, you know, and you're underwater it's it's dank and it's gross or you're this bright beautiful it's tropic. It's a coral reef. Awesome stuff there. Awesome. Awesome color. Really beautiful game. Animated incredibly well. Swimming very fluid. It's funny. I remember when we hit Uncharted 4 and you came back after that first day and you're like, they finally did it. They made swimming in a game fun. Swimming in a game's fun here. It took me a while being a non-inverted person to wrap my head",
            "start": 463.12
        },
        {
            "text": "came back after that first day and you're like, they finally did it. They made swimming in a game fun. Swimming in a game's fun here. It took me a while being a non-inverted person to wrap my head around it cuz it was that you can go in and change it to be how you would. But even once they changed it, that didn't feel right. And I was like back to inverted. I'm flying like a plane. Whatever. Yeah. That that's that's always hard that inverted thing. We talked about this before. I think with Ratchet & Clank, I was having the issue with the the remake of it where the I play I used to play inverted, now I play normal, but then when uh it comes to the camera of the left and right movements in like a third person thing, sometimes it just doesn't click right where it's like I want one to be horizontal and or one to be uh inverted and the horizontal to be uh non-inverted and or stuff like whatever it is, the opposites and it it just tricks you up. But then one day it can change day",
            "start": 497.6
        },
        {
            "text": "be horizontal or one to be inverted and the horizontal to be non-inverted and or stuff like whatever it is, the opposites and it it just tricks you up. But then one day it can change day-to-day. It's like a weird brain thing. And that was the thing of like Yeah. For me, I think part of it too is that sometimes you get pulled back a bit. So, it's like I was trying to swim, you know, over there, right? So, I'm pulling up and I pulled up too far and did like the I was like upside down and trying to come back. Yeah. A minor gripe. I don't want to make this out to be a thing. It just for me, I had a little bit of trouble wrapping my head around it, but I eventually got it. And it's also not a game where it's like you need to be precise. You're going to get punished. None of that. Back to the relaxing thing of just like you're underwater and it's chill. Music, as you brought up, amazing. Yeah. I mean that that's something that I think is uh really important to this is the the",
            "start": 532.08
        },
        {
            "text": "Back to the relaxing thing of just like you're underwater and it's chill. Music, as you brought up, amazing. Yeah. I mean that that's something that I think is uh really important to this is the the art aspect right where the is it art for art's sake I feel like that's a totally even other topic where it's like uh and even Tom inside before there was that question of like all right so what and whatever but it's like if that's the point then that's the point I'm not but but with this though I think that uh beyond that like the the game whether it's too artsy in the sense of what does it mean and like let's discuss this as art as Uh when you take the the look and the tone and the feel and the sound and the all that stuff you're talking about the the it looks like every frame looks like a painting. Yeah. Like I think that uh they they did that to an extent with Flower, but then Journey knocked it out of the park where it's just like every single shot of that looks amazing. It doesn't",
            "start": 566.16
        },
        {
            "text": "Yeah. Like I think that uh they they did that to an extent with Flower, but then Journey knocked it out of the park where it's just like every single shot of that looks amazing. It doesn't and it's PS3. It doesn't matter. PS10 can be out and that's going to look amazing because of the art direction. And I think that this is another one of those moments where the art direction of uh Matt Nava, he gets it, you know, he gets how to design something to evoke emotion. Uh just just from the look of it, look just watching you play. It's like I get the feelings of of Journey and of Flower, but like this also it had its own own thing to it. I remember back on the the Gamecube, the one of the the really special things the Gamecube had um in terms of graphics because it wasn't the most powerful. The Xbox by far was the most powerful that generation. PS2 tend tended to look better than GameCube did. Gamecube was a little bit more round around the edges and stuff. Um Mario Sunshine, the water",
            "start": 609.44
        },
        {
            "text": "The Xbox by far was the most powerful that generation. PS2 tended to look better than GameCube did. Gamecube was a little bit more round around the edges and stuff. Um Mario Sunshine, the water, yeah, it was beautiful the way that it interacted with things and just it was next-gen at that time. um Star Fox Adventures, the fur, like having all that stuff. It was so like, oh my god, like this is and they kind of overcompensated in a lot of ways with that. Um but I feel like that those things are what push the limits of stuff. And now these days, water, video games have nailed it. Like we've seen it time and time again, but seeing you play this, I'm like, man, this is making me think about water in video games in a way that I haven't in a long time. And it made me stop and think, all right, so from flow to flower to journey, flow is like on a really small scale, right? Like a microscopic adventure, bacteria in your eye. Yeah. Flower is this like beautiful grassy fields",
            "start": 654.08
        },
        {
            "text": "think, all right, so from Flow to Flower to Journey, Flow is like on a really small scale, right? Like a microscopic adventure, bacteria in your eye. Yeah. Flower is this like beautiful grassy fields and then eventually cityscapes and stuff like that. But it's it's way more it's the idea of being a flower in the fields journey desert, right? And like kind of caves, but mainly desert. Then the big question is where do they go from there? And I think underwater is the uh obvious answer. And I think the other obvious answer is space. So that's why I think No Man's Sky makes sense getting brought up in this conversation. But what's also funny is because I've thought about this. I'm like, what do I want from um that game studio next? That game company and that game company. And not to say that that these are them, but obviously when you're it's the spirit. Not Hello Games, but obviously I mean like that's what my thing is to quickly aside is like playing this game I and I'm enjoying this game",
            "start": 697.04
        },
        {
            "text": "that these are them, but obviously when you're it's the spirit. Not Shaun O'Mac, but obviously I mean like that's what my thing to say is like playing this game I and I'm enjoying this game but it does feel like okay it's kind of just a journey underwater in the sense of I'm in this area here's this epic moment to transition me into something else and here we're back into this thing and I'm trying to light up these different things to get that to go and okay that went and now another transition. It's not none of that's bad. None of that's like oh how unoriginal. It's just like I'm not as blown away by it cuz I feel like I I know this game already when I just sat down to play it. Yeah. And that's and it's such a weird thing cuz people never be happy. It's like you can never be wowed again like that because that was so so amazing and such a unique thing. Having said that, we haven't had anything like that since. So, I think that I I loved seeing you play this cuz",
            "start": 739.84
        },
        {
            "text": "never be wowed again like that because that was so so amazing and such a unique thing. Having said that, we haven't had anything like that since. So, I think that I I loved seeing you play this cuz I'm just like, man, like this. I've for years dreamt about what their next game would be. And I I always thought it was going to be Underwater or Space. And it's funny seeing you play this because taking No Man's Sky out of it. Um it you could replace that with space because of the way you control it. Like seeing the way that you were navigating and stuff like it made me think of Star Fox, you know, or stuff like that where it's like you're you're you're it's a linear game. You're driving through. It's a kind of like an on-rails um space sim, but you're underwater, right? And uh it it was cool seeing the the hints of Flower where like you're going through fish and the fish all join you and then you speed up each time. Um, but with those epic moments of of journey and Flower had them too, but",
            "start": 781.04
        },
        {
            "text": "the hints of Flower were like you're going through fish and the fish all join you and then you speed up each time. Um, but with those epic moments of of journey and Flower had them too, but uh it was Flower's felt a bit more um once you hit this thing, the camera's going to zoom out and it spins around and like colors change, but Journey was a bit more of a millions of pieces of scarves with you. But that but also just like um the epic moments felt like you were building towards them. And you know, games get a lot of credit these days for being like, \"Oh, it's an interactive movie.\" Mhm. Um, and then we talk about the Uncharteds of the world or or the Call of Duty single player campaigns or stuff like that when when we talk about that. But I think that that this game and Journey do it in a way that I haven't seen anything else do in terms of the melding of visual art style, camera movement, and music. Yeah. I mean, to your point playing that, there were points where it felt like",
            "start": 821.04
        },
        {
            "text": "in a way that I haven't seen anything else do in terms of the melding of visual art style, camera movement, and music. Yeah. I mean, to your point playing that, there were points where it felt like those Pixar shorts before it where there are no dialogue. I mean, and that's one thing I guess we haven't done. If you don't know what Abzû is, sorry. Uh underwater, you're third person, totally free to roam around. Not open world. It's linear. You get areas you go through. You can go you can go to the floor fish the ground floor hidden spots and you know unleash new fish by letting them go. You have to but then there's some light puzzle solving of like all right, I got to get this chain to move and that chain to move and that'll open the door. It's all super simple. All all the like gameplay hooks of it are really optional for the most part. Meditating isn't mandatory, but if you do it on everything, you get the trophy. uh unlocking all these fish isn't mandatory, but if you",
            "start": 866.08
        },
        {
            "text": "gameplay hooks of it are really optional for the most part. Meditating isn't mandatory, but if you do it on everything, you get the trophy. Uh unlocking all these fish isn't mandatory, but if you do it, you get the trophy kind of thing like that. Um but there was points, yeah, playing it where they do such a great job of what you're saying where the basic I mean the action is so basic. Your action as a player in this game so basic of swimming if you want to explore, but as I was like trying to get this for the Gamescast, right? Like I was, you know, not trying to get every fish unlocked and I and I don't even know if I would be motivated to go back for the, you know, silver trophy. But I'm going through and I'm doing it and the music ramps with you. The music builds with you until you're at that crescendo moment and then yeah when you are shooting down you know this this waterway with all these fish around you are going through or collecting more and they're swirling around you that",
            "start": 906.88
        },
        {
            "text": "at that crescendo moment and then yeah when you are shooting down you know this this waterway with all these fish around you are going through or collecting more and they're swirling around you that is that epic moment and that's that payoff. Yeah. And it and but that is uh I that's the art to me that is that is the thing that uh is all Yeah. It's hard to kind of like bring it. It's not so much the what does it stand for and what is the metaphor of this. The art of it is the melding of that stuff in a in a very um emotional experience that is driven by you controlling it. Sure. And it's weird because it's not that far off from the Super Mario Maker uh levels that people make that are just you hit right once and then it or just hold right and run and it like plays through the whole level for you. Um or or you know people always talk about certain games like um I mean even even Journey is like oh you just hold if you just hold straight you'll win and it's like that is an oversimplification of",
            "start": 942.72
        },
        {
            "text": "\"Um, or, or, you know, people always talk about certain games like, um, I mean, even even Journey is like, oh, you just hold if you just hold straight you'll win and it's like that is an oversimplification of the entire thing like you do have a a control over it and it's a it's a physics-based um experience where you're not going to actually finish this game just holding it and just going right but it is those moments where you're talking about like the camera kind of messing up or the controls messing up when you do the flip thing. That was the same thing in Flower. Now, Flower was different because you had to move the controller. Six Axis. We love it so much. But there's a um it you start to feel connected to it in a way that you don't with other games because the the way that you're controlling it becomes like a roller coaster in a lot of ways. It it becomes like a but you're controlling where it goes. So seeing you go through the things of fish reminded me of going through the things of Abzu.\"",
            "start": 984.88
        },
        {
            "text": "it becomes like a roller coaster in a lot of ways. It, it becomes like a but you're controlling where it goes. So seeing you go through the things of fish reminded me of going through the things of flowers where you go faster and faster and all that stuff. And there's an art to it. It's like Sonic the Hedgehog. That's probably a really good way to bring this up in terms of everyone's like, \"Oh, you can just you just go fast and hold right and jump.\" It's like, no, that's not how that works. Maybe the first couple levels, Sonic is actually really more about the um the physics of it and using ramps and stuff to get better, play the same level over and over so you can understand how to just and like bounce through it super fast. And I think that uh there's that same level of like playing flower reminded me of playing Sonic 2 in the Chemical Plant Zone when you're going through you know what I'm talking about Chemical Plant Zone level. It's the one with the purple water that raises",
            "start": 1024.48
        },
        {
            "text": "reminded me of playing Sonic 2 in the Chemical Plant Zone when you're going through you know what I'm talking about, Chemical Plant Zone level. It's the one with the purple water that raises its one of the most iconic Sonic levels. Um being little I remember playing that and and feeling overwhelmed with a sense of speed and sensation of movement and I'm causing this to do things. Even though most of it was get from point A to point B to trigger what's essentially a quick time event, but I think these games make me feel that way. Even watching you play made me feel like there's a sense of momentum. And when you add the music to that swelling, like it that's where the emotion comes from. It's momentum mixed with um this this auditory visual feedback combination that it's just like momentum. Momentum is a great way to describe it, Abzu. And where I think people keep talking about how relaxing the game is. I think that's true in but it's also in the way of at no point in this game",
            "start": 1067.2
        },
        {
            "text": "Momentum is a great way to describe it, Abzu. And where I think people keep talking about how relaxing the game is. I think that's true in part, but it's also because at no point in this game was I up against a wall with an \"inside moment\" right off the bat like, \"Wait, what do I need to do?\" or even get frustrated on a journey because there were times in Journey I remember chirping up to something trying to figure out, \"Is this what I'm supposed to do? Or is this it?\" It's very obvious what the next thing is. So if you want to go explore, if you want to touch every fish – because you can grab on and ride them and do this different thing – uh, you know, unlock them all, do these different things, meditate everywhere if you want to go, collect seashells if you want to go, or just go do all that you can, and you'll be fine. And you'll never feel like you've ground the pace of the game to a halt. Nor will you ever hit a puzzle so hard that you're like, \"What the hell do I do next?\" Yeah, that's cool. You know, I think and that's what",
            "start": 1114.16
        },
        {
            "text": "like you've grounded the pace of the game to a halt. Nor will you ever hit a puzzle so hard that you're like, \"What the hell do I do next?\" Yeah, that's cool. You know, I think and that's what there's a place for that, you know? I'm such a big fan of small experience games, right? And I think that this is a perfect example of one. It looks like without playing it, just seeing you play it, it seems like that type of um experience. I I'm excited for it. I hope that uh I get a chance to play it soon. Like just timing wise. How long is it? Two and a half hours. Perfect. Yeah, you know, like that sounds like a really good time cuz like you don't need more than that. No. And that's and I mean that's the one thing, you know, I mean like where I am with it. I liked it. I think you should play it. I don't think it's on Journey's level at all. I don't think it's, you know, changing the game. It's got a 79 right now on Metacritic and 83 on IGN. Uh that all sounds like where I would be",
            "start": 1148.0
        },
        {
            "text": "don't think it's on Journey's level at all. I don't think it's, you know, changing the game. It's got like a 79 right now. Metacritic 83 on IGN. Uh that all sounds the 79 seems like where I would be somewhere in there. It's good. I appreciate it. I like it. I don't think I love it. I don't think I'll ever go back to it. It's funny because like Mitch today on Twitter was talking about like a day removed and I'm still thinking of Abzu. I'm like I don't think I'm ever gonna think about this game again outside of this conversation. Not that that's a bad thing. Not that I'm saying the game's bad, just in the fact of like cool I'm kind of interested to know what was going on there, but I think I kind of get it in the same breath and just in the end, but like what was I doing in the end really? And but whatever. See, inside I thought about many times and I continue to have conversations about it inside and not only the fact that the gameplay is amazing, not only that it was such a step up",
            "start": 1185.2
        },
        {
            "text": "And but whatever. See, inside I thought about many times and I continue to have conversations about it inside and not only the fact that the gameplay is amazing, not only that it was such a step up from Limbo, but of like what did it really mean? You get in those debates and those conversations with people. Yeah. Yeah. Yeah. No, see that's interesting. And I I guess again having not played it, I'd be interested to see if anyone ever brings this up uh in the same conversation with Journey in the way that I've heard Limbo and Inside compared. Interesting. Where people have differing tastes and neither is right or wrong. It's like I can understand the arguments on both sides for this. Like yeah, Journey is such a masterpiece because it did nail all of these pieces where it sounds like this one, at least in your in my opinion, it's not nailing all of those things and that's hard to do, you know? I mean, like don't you you know, you brought up this interesting fact, right, of like uh you",
            "start": 1217.84
        },
        {
            "text": "one, at least in your opinion, it's not nailing all of those things and that's hard to do, you know? I mean, like don't you think, you brought up this interesting fact, right, of like uh you've hypothesized what that game company's next game is going to be, right? And that here we go. The guy who worked on Journey left, founded a studio, made this game, and released it before we've ever seen anything from that game. And the reason that's happening, and we've talked about, we talked to ThatGameCompany's co-founder, Jenova Chen, not this E3 2015. We're like, is there a lot of pressure? He's like, there's so much pressure. You know what I mean? The follow-up Journey to do this, right? Like, we've started and stopped a bunch of different projects and what we're working on now. We're still working on that's why we're not talking about it. And I mean, I can't even imagine because I remember when Flower came out, it was a joke with me and my friends uh in the sense that I was excited",
            "start": 1257.12
        },
        {
            "text": "working on that's why we're not talking about it. And I mean, I can't even imagine because I remember when Flower came out, it was a joke with me and my friends uh in the sense that I was excited about this flower game. I saw it and I was like, \"Oh, like this looks weirdly interesting to me.\" Like I'm I'm into it and everyone like Alfred I'll never forget. Alfred Pennyworth was talking so much **** Alfred only shoots things. He just I He couldn't wrap his head around. But again, it was a different time then. Like like Flower Pistols. Yeah. This being a um or Flower being a PSN game back then PSN wasn't really a thing. It's pretty good for a PSN game. It's pretty good for a downloadable game. Exactly. Exactly. That was the conversation. And I remember playing it. There was the demo and I played the demo and I'm like, \"This is cool. I want more.\" So, I bought it eventually and then playing through that game like it resonated with me. I was just like, \"Why do I like this so much?\" Cuz there's",
            "start": 1294.32
        },
        {
            "text": "the demo and I'm like, \"This is cool. I want more.\" So, I bought it eventually and then playing through that game like it resonated with me. I was just like, \"Why do I like this so much?\" Cuz there's not much there. But, I'm like, I put in I wanted the art from it. You know what I mean? I think that that is the key. That's a big part of it. Yeah. With with all of these games. And that and that was my thing with Abzu is that and you know because like I think the theme of me recently at least this year has been being in the mood right like Ratchet Clank came out and I wasn't in the mood for Ratchet and Clank and then one day I was and I put it in and it was awesome and then uh you know Overcooked recently we were in the mood for a co-op game we got it. I'm forgetting one that was another one that just clicked. It was like when I oh A Song of the Deep I wanted somebody to tell me a story. These people told me a story and I wasn't in the mood for Abzu, right? And I always and like in so",
            "start": 1330.96
        },
        {
            "text": "that just clicked. It was like when I played Abzû, I wanted somebody to tell me a story. These people told me a story and I wasn't in the mood for Abzû, right? And I always and like in so my reference point for that is that when I put Journey in back in the day, I remember putting it in. I did a couple things and I texted Colin some joke about it because he loved it so much and I knew he loved it so much. And then he texted me back and I texted him and then like the game kept going and then I turned off my phone and I was like, \"Wait, something's happening here. I need to pay attention with Abzû that didn't happen.\" I was still multitasking, doing a million things. And again, not that that's I'm, you know, whatever. It's a great game. It's a good game. It's a great game. You should play this game. But it wasn't like I wasn't enraptured. You know what I mean? Yeah. And so I guess that's to me that's that's the interesting part is I remember playing Flower and it went from",
            "start": 1368.56
        },
        {
            "text": "should play this game. But it wasn't like I wasn't enraptured. You know what I mean? Yeah. And so I guess that's to me that's that's the interesting part is I remember playing Flower and it went from the demo to me playing it and being like I don't know why I like this but I do and investing towards the latter half of that game like there once things get dark in that game and like you're there's the the part I think it's like midway through a crumbling cityscape. No, that's the end. That's the end. But like once you're in the field and it's dark and there's the electrical towers that are like messing things up. I was like, \"Oh this is this is not just six levels that are all the same thing with different colors, like they are trying to tell a story.\" And I was like, \"I am invested.\" And that was the rest of my day. I had to beat that game I tried platinuming it before I realized before I was indoctrinated into this world of uh Greg Miller and Colin Moriarty, but um I never",
            "start": 1403.84
        },
        {
            "text": "And that was the rest of my day. I had to beat that **** I tried platinuming it before I realized before I was indoctrinated into this world of uh Greg Miller and Colin Moriarty, but um I never did that. Uh, but then when Journey came out, I was so excited just because I was like, man, like their next game, this must be awesome. And it was like that's the thing is they they took all the things I loved about Flower and just condensed it and made it just more manageable, you know, more um less abstract and just more like it is it's a bit more basic for me. For me with Flower, one of the reasons I think I don't like it as much is momentum. And I feel like I lost my momentum a lot in that game where I'd be going and everything's going great and I'm nailing it and then like with Sixaxis I just missed something and then try to circle back and it was hard to get back and I get back to it and then try to get back in that rhythm again of where everything was going so well. Yeah. And with",
            "start": 1442.8
        },
        {
            "text": "\"missed something and then try to circle back and it was hard to get back and I get back to it and then try to get back in that rhythm again of where everything was going so well. Yeah. And with Journey, it was a bit more um I think by the books in terms of progression, in terms of just like it it was always obvious where you're going and it was one giant um journey. And uh in the same way that Flower had the story elements kind of go like I was saying where like it gets dark and then eventually it gets even more dark. Yeah. Uh with Journey like there's you're I feel like the entire game was telling a story whereas in Flower it was just the last half. Gotcha. That makes Um, and that that's my my question about this game or just from seeing this and from hearing you talk, it seems like that is the element that's missing is a kind of overarching narrative that you're interested in throughout. 100%. Yeah. When I started seeing the cave paintings and stuff or and they're\"",
            "start": 1486.64
        },
        {
            "text": "it seems like that is the element that's missing is a kind of overarching narrative that you're interested in throughout. 100%. Yeah. When I started seeing the cave paintings and stuff or and they're not cave paintings, but you know, the art of the old world or whatever, it was like, oh, okay, cool. I think is this where like what's going on and then you get by the end of it. Yeah. And then the end of it, it's just like, okay. Yeah, I know. But it and it's but it's not even that like you know this is totally a game that's about the journey and not the destination I feel personally. But yeah I I it didn't have that hook to it where I cared about what was really going on in the world. Yeah. And that's one of the reasons I don't think I cared about like are am I are these fish trapped? Am I helping them? I don't know what's going on. Why do I want to meditate here? Yeah. It is pretty. I'll give you that. Yeah. All right. Cool. I'm definitely stoked for it. Let us know what you",
            "start": 1524.96
        },
        {
            "text": "them? I don't know what's going on. Why do I want to meditate here? Yeah. It's pretty. I'll give you that. It is pretty. Yeah. All right. Cool. I'm definitely stoked for it. Let us know what you think about Abzu in the comments below. I'm excited to hear about that. And I want to see if there's anybody that likes it better than Journey. That would be interesting, too. You're wrong if you do. Damn, son. Just letting you know, delete your Twitter. All right, topic two. Topic two of the day is being excited about video games. I like how you brought the smallest piece of paper in the house to take your notes on. That's all I needed. Okay, sure. All I need to do is Did you get a pen that works? Cuz that doesn't seem like that's going well for you either. It didn't. But you know what? We're fine. Here's my little paper. We don't have any ads today. You guys are welcome. You're welcome that we're not getting paid. So, so yeah, I just need to know some being excited about video games.",
            "start": 1562.16
        },
        {
            "text": "Fine. Here's my little paper. We don't have any ads today. You guys are welcome. You're welcome that we're not getting paid. So, so yeah, I just need to know some being excited about video games. What the hell does that mean, Tim? So, pretty much, you know, I realized that I love video games and I'm excited about video games, too. But recently, there's been something that's been happening that I haven't felt in a couple years, I would say. And that is the NX announcement looming. You know, so many rumors recently about the NX over the last year and a half, and we've talked about it on Gamescast 10 billion times. Always a different conversation that has the same talking points. Right. Right. But it's always a top point. It's about a different rumor and all those rumors sound really bad. Now we're hearing rumors that sound really good. We got a good rumor and so we're latching on to it and I'm really hoping it's good and I'm uh putting all my faith into that. But the most important",
            "start": 1598.4
        },
        {
            "text": "Now we're hearing rumors that sound really good. We got a good rumor and so we're latching on to it and I'm really hoping it's good and I'm uh putting all my faith into that. But the most important part is the fact that the the rumor that is most likely to be true is that we'll hear more information in September about the NX. We've known it's going to be this year, but that made sense. Um, and I think that this has to be then, right? So, I'm excited. I found myself in a bunch of random situations thinking about that. Just sitting around thinking about the Yeah. Like I'll be laying laying in bed thinking about it. I'll just be like eating dinner and like I just like random. Yeah. Slow jerking it. I mean, dude, it's like it's slow jerk worthy, you know? I'm just I'm so I'm so excited that cuz I was at the weekend. Time out. Can you please someone make a note out there? Uh, I'm going to say Trevor Strickland to remind us next year about 2 months",
            "start": 1637.76
        },
        {
            "text": "know? I'm just I'm so I'm so excited that cuz I was at the weekend. Time out. Can you please someone make a note out there? Uh, I'm going to say Trevor Strasburg to remind us next year about 2 months before E3. Remind us that our new award should be slow jerk-worthy. We put those up on the walls of E3. Oh my god. Yeah. Detroit: Become Human. Slow jerk-worthy. That game company's next new game, Shadow of the Colossus. Um, but the thing about the the NX reveal is that I was at the Wii U. uh not the reveal but the well I guess announcement I was at I was at the Nintendo press conference when they announced the Wii U and even being in that room where like being surrounded by the hype of it there it was confusion more than it was just a controller that adds on to the unit it felt really weird and it's like oh but the system looks a little bit more round like what's happening that was weird but then three four months later in November um five month I don't know whatever I'm not good at math uh in November",
            "start": 1677.04
        },
        {
            "text": "but the system looks a little bit more round like what's happening that was weird but then three four months later in November um five month I don't know whatever I'm not good at math uh in November remember there was an event in New York. Yeah. Where it was the real like here's the reveal of it. Here's a launch like all the games. You can play them for the first time and uh well I guess not for the f this is the first time you can play real games cuz at E3 they had all the demos as soon as you ended the the conference you can go back and play the demos but all those demos we chase me thing or chase me. It was pretty much what uh would end up being in Nintendo Land. Each of those games was its own game back then. So, and then there was New Super Mario Bros. U which was really especially then like all right, who the **** cares? Um, and there was a video of the Zelda that just was playing over and over. But then at the Nintendo event in November, you could actually play the launch",
            "start": 1728.8
        },
        {
            "text": "then like all right, who the **** cares? Um, and there was a video of The Legend of Zelda that just was playing over and over. But then at the Nintendo event in November, you could actually play the launch games that were coming out and that was where they announced Bayonetta 2 was coming to the Wii U. Um, so that event itself, like I want that for the NX and it's sounds like it's going to happen and I'm excited to see what that is. And I think that just that idea of thinking about, all right, I was at the one that was bad, if it was good, that could be so exciting. And even if it's not, like I'm just excited that it's happening, but there's a shot at it being good. That's great to me. But we've talked about that X a lot. It's not what I'm trying to talk about here. So, okay. I want to know just like this feeling that I'm feeling right now about this excitement for this announcement of this this system and the games that have come with it. Sure. What have you felt this excitement for? Oh, wow.",
            "start": 1770.08
        },
        {
            "text": "this feeling that I'm feeling right now about this excitement for this announcement of this this system and the games that have come with it. Sure. What have you felt this excitement for? Oh, wow. So many games. I think you I mean for me I think if anything took the legs out of that excitement and I don't think it did because I still get super excited about games. It would be working in the industry, right? I think because then it's just there's so many things to worry about. Even what is like I can't wait for No Man's Sky. Like I'm really excited to get my code for No Man's Sky whenever that happens. I'm still not obsessing over No Man's Sky because of Abzu now and I'm playing I need to I want to get Batman: Arkham Episode. There's so many things and there's so many jobs and there's so many podcasts to make. There's so many distractions right now that keep you away from it. Um I mean my initial knee-jerk reaction to that is I guess there's two which is weird and that doesn't make any sense.",
            "start": 1814.08
        },
        {
            "text": "to make. There's so many distractions right now that keep you away from it. Um I mean my initial knee-jerk reaction to that is I guess there's two which is weird and that doesn't make any sense. But the one I first thought of was the wrestling games back in the day when uh WrestleMania 2000 was coming out and when then No Mercy was coming out in the fact that like I was I lost my mind for that and I was in high school, right? And so what I had this is the old days, you know what I mean? So stick with me everybody. But I, you know, I had a note card I wrote out with all like Best Buy and GameStop and EB Games and KB Toys and Funco and Walmart cuz inevitably somebody would break the street date on this. Yep. And so like two weeks before that game would come WrestleMania or Wrestlemania 2000 would come out, right? I I I would leave school in in high school and get into I was driving a car then I was 16 and I would use the cell phone to call down that sheet and then I would get",
            "start": 1854.4
        },
        {
            "text": "2000 would come out, right? I'd leave school in high school and get into I was driving a car then I was 16 and I would use the cell phone to call down that sheet and then I would get home and give it a few hours and call back and it was two calls a night or whatever to try to figure this out. 9918139, the number to Toys R Us on Gary's card. Yeah. No, that was and that was the thing of like I did that for two solid weeks with this worn-ass card and I'll never forget like I was in high school I was the uh editor-in-chief of both the newspapers and there was a weekly one and a bimonthly one and the weekly one the way it would be is that I would come get all the notes like people would write these things out by hand and give you like crib sheet notes and then I would go back and write it into this newspaper that was the weekly thing and then send drop off a floppy disc that had it on for people to print it and then pick it up the next day after school",
            "start": 1894.16
        },
        {
            "text": "it into this newspaper that was the weekly thing and then send drop off a p drop off a a a floppy disc that had it on for people that to print it and then pick it up the next day after school and then bring it in on Friday and distribute it. And so it was the Thursday night that I picked them up on the way home, called the Walmart and I was like, \"Hey, hey, hey, hey, hey, hey, hey, hey, hey, hey, do you ever made 2064?\" And they're like, \"Yeah.\" And this is like, you know, it's Thursday, so it's I would have been the week before release, right? If that was still how I don't remember back then if it was Tuesdays cuz I remember that. It was such a weird things were weird. Video games made no sense. Before the internet came around, there was no like this is when games come in. It was just Yeah. **** came in and people put it out sometimes and they're like, \"Yeah.\" And I was like, \"What? Really? You you have WrestleMania 2000 on N64?\" And they're like, \"Yeah.\" And I was like, \"Okay\"",
            "start": 1936.24
        },
        {
            "text": "Yeah. Greg came in and people put it out sometimes and they're like, \"Yeah.\" And I was like, \"What? Really? You you have WrestleMania 2000 on N64?\" And they're like, \"Yeah.\" And I was like, \"Okay, cool.\" And so I I I guess I just got home to I took the newspapers out, put them in my car, got into the car. On the way to Walmart, I called Po, my best friend, and I was like, \"Hey, I'm not coming to school tomorrow, so can you give these papers out or whatever?\" He's like, \"Uh, yeah, why?\" I'm like, \"I'll resume 2000.\" And I hung up on him. I'm like driving. I'll never forget. I'm so happy. I'm so excited that this is happening. I'm driving and as I pull alongside Walmart, I'm for you. I'm coming. So thanks for everybody who's back in the suburbs of Chicago, this would have been the Walmart in Bloomingdale, right? Because it's across from Stratford Square Mall. Army, it's the one on Army Trail. And then I would have been driving up what? Oh man, I haven't driven this road in so",
            "start": 1973.12
        },
        {
            "text": "in Bloomingdale, right? Cuz it's across from Stratford Square Mall. Army, it's the one on Army Trail. And then I would have been driving up what? Oh man, I haven't driven this road in so long. Bloomingdale Road, I guess. Does that make sense? Uh, it doesn't matter. I'm driving up this road and as I'm driving up to and I hit the blinker to turn into the turn lane to go over, I look over and there are these kids sprinting towards Walmart. I'm like, \"That's funny.\" And I look and they're in Cactus Jack shirts and I'm like...like the jig is up. Maybe they're like swinging in there illegally parked probably ran back to the GameStop store in my...uniform. Ran back, run back there. My uniform being that I went to a private school and got there. No one else is there. They gave me the game and they sold me the game and I left and I dropped the papers with Po and I went home and you know I moved and I don't know why this was the thing and like but I like I you know it was like I",
            "start": 2009.92
        },
        {
            "text": "the game and they sell me the game and I leave and I drop the papers with Po and I go home and you know I move the and I don't know why this was the thing and like but I like I you know it was like I I go downstairs to the basement where I play all my games and I move like you know blankets and pillows down there cuz I'm going to sleep next to the store. God forbid I walk upstairs and go to bed. Jack **** ain't going to come in and steal your Exactly. Exactly. and just sat there and played that game like a maniac and then slept there and like I was I was you know credit my folks with it mainly my mom um just because she was I think dad I don't I could have whatever dad doesn't care but mom you know was like bargaining you know I could explain to her of like I'm doing fine in school clearly this is a big deal for me I need I it would just be these wrestling games like I need to take the day off for the wrestling games and I think I did it for PS2 launch as well or whatever where I",
            "start": 2046.24
        },
        {
            "text": "this is a big deal for me i need it would just be these wrestling games like i need to take the day off for the wrestling games and i think i did it for ps2 launch as well or whatever where i got my unit and didn't come in whatever friday of that week but uh yeah get just playing that thing and then doing the exact same thing for No Mercy when that came around. And like it was the same it was it was the same obsession with um as an as an adult, I'm putting quotes here, but as an you know, more grown-up kid, right, of the NCAA football ones when those were coming around. This is like for real. I know we've talked about it a few times in like all of our shows, but like the summer drought of games that we're in right now, you're like **** you have no idea cuz it was that there was there used to be not a goddamn thing and then it was that Yeah. in what was August NCA? Yeah. No, I think August was Madden, right? in July was the end of July was NCAA and it was like you're getting",
            "start": 2083.84
        },
        {
            "text": "there used to be not a goddamn thing and then it was that Yeah. In what was August NCA? Yeah. No, I think August was Madden, right? in July was the end of July was NCAA and it was like you're getting back to something and like yeah that would be the same thing where I would call around I would be on GameFAQs just like on their message board just talking to people may vary the people the people who are like talking about like they're going to build out roster so you can come get the PS2 file here and bring it over and all that stuff and then it was the same thing granted we had jobs so it wasn't like calling out of school at that point but like we got NCAA and like uh you know when we I got I'd get NCAA every year and I always talk about it you know my group of friends I was the video game guy, which was cool, but alienating, like lonely in the way that I didn't have like a friend who like loved it as much as me. And Po, I f I forget what it was. I think it was, embarrassingly",
            "start": 2119.44
        },
        {
            "text": "game guy, which was cool, but alienating, like lonely in the way that I didn't have like a friend who like loved it as much as me. And Po, I f I forget what it was. I think it was, embarrassingly enough, I might have worn him down and got him to buy a PS2 for SOCOM because we can play it online and we could do something like while we're like apart or whatever, you know, cuz like if he didn't want to come over. I think it was when we were going to college, too. Maybe. Well, yeah, PS2 when we're going to college. And so, like eventually when NCAA came that first year that he had it, we were like all in. and we went and bought our copies. We came back to my house and, you know, with the basement TV and then I got a card table and I went upstairs and out of my room and got the smaller TV, these, you know, CRTs you bring down, set it up there and we we just played there all night till sunrise and we would we would just we would play the entire season like we wouldn't miss a game. We would",
            "start": 2157.84
        },
        {
            "text": "you know, CRTs you bring down, set it up there and we we just played there all night till sunrise and we would we would just we would play the entire season like we wouldn't miss a game. We would do all these things and uh it would be that you know I'm playing as Missou was playing as St. Mary's or whatever. he started his own school or whatever. And so like when one of us would have the rivalry game or the bowl game or whatever, that would get the big TV. That would be like the big thing like, all right, dude, I'm about to I'm, you know, I'm ranked number two in the country right now and okay, fine, we'll switch out and do this kind of thing. And those are the moments that like sadly don't happen anymore. Like, and it is that thing of like, you know, I'm thinking back of games that I was like crazy about and I because I don't even it's weird. I don't even count Uncharted 4 this time around, right? like it's going to be on. It's going to be great. Whatever. Batman",
            "start": 2194.16
        },
        {
            "text": "that I was like crazy and I because I don't even know it's weird. I don't even count Uncharted. Like Uncharted 4 this time around, right? like it's going to be on. It's going to be great. Whatever. Batman: Arkham Knight was a treat. I remember last year because it was Oh, of course. Batman: Arkham Knight was a treat because I'm a Batman fan. I was excited to get it. But again, it was like get it and then played it for a weekend. And I remember when they released Arkham City when I was reviewing Arkham City, it was like cuz you know when you review video games at IGN or work in most places actually, you don't have time to play games at work. It's like I remember getting Arkham City shipped to my house so I could stay home and play it here. M but of course I'm totally the one that I last year that I was losing my mind for that I was so obsessed with that I was so ready for was Metal Gear Solid V: The Phantom Pain and like that was the thing where when I went back when I went down to play it and like I had that week off",
            "start": 2228.64
        },
        {
            "text": "was losing my mind for that I was so obsessed with that I was so ready for was Metal Gear Solid V: The Phantom Pain and like that was the thing where when I went back when I went down to play it and like I had that week of just playing it down at Konami. Yeah. I was happy as a pig and man that was so much fun and then it did the crazy thing of building my excitement for the final release which is so rare when we review or preview games where you go and do something and then you're sick of it. We got it just obsessively playing here playing at the review event obsessively when Kevin came over to film the review and I was I had to switch to Gunners cuz my eyes were bloodshot cuz I couldn't stop playing this game. Those are like the moments that remind you why you're into it. And especially like for me in terms like I said I had two knee-jerk reactions to the question, right? Wrestling number one, I guess, but number two was Death and Return of Superman. I can see it up there. Uh uh for me on",
            "start": 2267.36
        },
        {
            "text": "me in terms like I said I had two knee-jerk reactions to the question, right? Wrestling number one, I guess, but number two was Death and Return of Superman. I can see it up there. Uh uh for me on Genesis and that's the one that got me here because I had that issue of GamePro that had Death and Return of Superman on the cover and reading that cover to cover every night and calling down another old note card with all the stories on it asking if they had it cuz that was even worse where it was like it'll be out in summer. It's like I don't know what that means. I'm calling everything. It's delayed. I won't know until somebody one of these video game magazines decides to write it a month and a half later. Yeah. But like yeah, that was another one. And like I I I I always talk about it like, you know, I'm good at it now, I guess, but growing up that was the worst part of all the hobbies I picked is that everything I loved required so much patience cuz it was you're",
            "start": 2305.52
        },
        {
            "text": "about it like, you know, I'm good at it now, I guess, but growing up that was the worst part of all the hobbies I picked is that everything I loved required so much patience cuz it was you're going to hear about this game forever. Uh comic books, you're going to get it on a monthly basis and then even if this story is cool, you're going to get that Diamond Previews catalog where you can see four months from now what the cover is going to be. Like, that's even better. You know what I mean? I picked I kept picking these hobbies that were so like, \"All right, cool. You want that? Just sit around and wait for it.\" You know what I mean? God, man, that's so crazy cuz it it's funny that our the slight generational gap in terms of when we grew up playing games changes everything cuz there's definitely no Super Nintendo Genesis generation game that I was like excited for. Yeah. Um just because I was too young for that. But what's funny is there is I was just stupid and didn't",
            "start": 2338.24
        },
        {
            "text": "cuz there's definitely no Super Nintendo Genesis generation game that I was like excited for. Yeah. Um just because I was too young for that. But what's funny is there is I was just stupid and didn't realize it. So, I remember uh at our library eventually had magazines that you can uh look at and they had GamePro and I remember looking at one, but I didn't understand that it wasn't new cuz that was the only GamePro they had. So, I'm like, \"Oh, it must be the new GamePro.\" And I even I don't I was a dumb kid. Sure. Um and it was about Sonic 2. Now, little did I know that at that time Sonic 3, Knuckles, Sonic CD were all right. Oh my god. So, I'll never forget I went to Kevin's cousin's house and I had only played Sonic one randomly at my other c at my cousin's house. Yeah. Playing at u Kevin's cousin's house. He busts out his Genesis and he has Sonic. I'm like, \"Oh, dude, like Sonic 2 is coming.\" He's like, \"I have all the no like here's Sonic 3 and you can put Knuckles on top of",
            "start": 2378.88
        },
        {
            "text": "Kevin's cousin's house. He busts out his Genesis and he has Sonic. I'm like, \"Oh, dude, like Sonic 2 is coming.\" He's like, \"I have all the ones here, like Sonic 3, and you can put Knuckles on top of it.\" And I, it blew my mind. But like I was so excited that I got to play a game. I mean, it's like, you know, Colin always talks about Fallout, you know, it's like they announced that they came out. To me, that was like, man, that's like, yeah, that was just insane, you know, but like to then that kind of got me into games even more. Um, when I started actually learning how game magazines worked and all that stuff, but then it was just like it was off to the races with that where um during the later years I was so excited for Crash Bandicoot, Cortex Strikes Back on PlayStation 2. Yeah. because it's like, \"Oh my god, it's a next-gen Crash game. This is awesome. I didn't understand Naughty Dog wasn't making it.\" That that didn't mean to understand. Uh I remember",
            "start": 2422.24
        },
        {
            "text": "on PlayStation 2. Yeah. because it's like, \"Oh my god, it's a next-gen Crash game. This is awesome. I didn't understand Naughty Dog wasn't making it.\" That that didn't mean to understand. Uh I remember getting it being like, \"This isn't right.\" You know, something is off about this. But then and I was also so excited for Jack and Daxter. Um watching the like OPM used to come with those demos and they they would have demos, but they'd also have like videos and like weird documentaries - PlayStation Underground. Um and they did a thing about Jack and Daxter. like anything you see in the background you can go to. I was like what? How is that possible? That's crazy. And I was so stoked for that. And then um that's the next year there was a cover of VGM that had Samus, Link, and Mario on it. And it was right after E3 and pre-internet or at least I didn't have internet then. Yeah. Um, and it was just like Metroid Prime, Wind Waker, Mario Sunshine are all happening. And it's like, shut up.",
            "start": 2467.2
        },
        {
            "text": "it was right after E3 and pre- internet or at least i didn't have internet then. Yeah. Um, and it was just like Metroid Prime, The Wind Waker, Mario Sunshine are all happening. And it's like, shut up. There's nothing that could have possibly got me more excited than that. And I just remember like just just reading every single thing I could looking at screenshots. It's so funny thing now like we do these rewind theaters and trailer breakdowns and this and that. We're talking about I got six Mario Sunshine screenshots and each one of those screenshots I could have told you single thing. It's like, oh my god, Mario's climbing on the same things he did in Super Mario World. Like, that's crazy. Like, there's checkers on the floor. Does that mean it's the same castle from Super Mario Bros. 3? And it's just like, why do I give this much **** about it? But I do. And that's what made those games like when you get them, they were just so much better than they actually were. Even no matter how good celebration, they",
            "start": 2511.76
        },
        {
            "text": "I give this much **** about it? But I do. And that's what made those games like when you get them, they were just so much better than they actually were. Even no matter how good Celebration, they have this finally. You're just so **** excited about it. And then uh that whole generation, man, I got sucked into so many annualized games that back then that was a good thing to me. Oh, sure. Yeah. You're getting more what you want. Tony Hawk. Oh my god. Give me one every year, you know? Give me more than one every year. Like, I want that **** So, it's like ah, every single one of those games was a celebration to me. Tony Three, four, Thug, Thug 2, American Wasteland, all of those. I was just like, \"Yes, yes, yes, yes.\" Cuz that meant I was going to be introduced to a whole new set of songs that I'm going to fall in love with, like all these new um gameplay mechanics and this and that, levels, and like are they going to remix the old levels I love? And there's so many questions, you",
            "start": 2554.56
        },
        {
            "text": "that I'm going to fall in love with, like all these new um gameplay mechanics and this and that, levels, and like are they going to remix the old levels I love? And there's so many questions, you know. Um during that time, I was also obsessed with Dance Dance Revolution. That was annualized at that time and I was stoked about new DDRs coming out and it was like every September one would come out for PS2 and I'm like yes. Yeah. And like it's weird to think like I was on GameFAQs almost every night looking up did anything leak about the new DDR. Yeah. Does anyone know any about this? Imagine me doing that now is sounds crazy. Oh, I mean thinking about any of the stuff we used to do back then sounds crazy. The screenshot things ring so true cuz for me it's always in Wizard magazine they had the first screenshot of Superman 64 and I was like I'm going to buy an N64 like I had no interest before in buying an N64 and now I have to buy it for this game of one thing of Superman like this and",
            "start": 2594.08
        },
        {
            "text": "of Superman 64 and I was like I'm going to buy an I'm going to buy an N64 like I had no interest before in buying an N64 and now I have to buy it for this game of one thing of Superman like this and it wasn't even rings but he was just flying a little bit and they had like a heat vision meter and then it was uh I'll never forget opening EGM the first time and they had GTA 3 screens and this is you're looking at this and you're like and it was just like a paragraph of text I remember and like him in the coat running with a gun and then and like and I'm How are they taking because we we played the top down ones all the time on PS1 like how are they there's no way you'll be able to this is insane other than talking like I remember my friend coming to the door and me opening it and having my hand like have you seen this are you aware of what they're saying is about to happen and then like things we would I would never do today and I'm sure people still do but I wouldn't have the time",
            "start": 2634.0
        },
        {
            "text": "\"Hand like have you seen this? Are you aware of what they're saying is about to happen, and then like things we would I would never do today, and I'm sure people still do, but I wouldn't have the time, and I think most of our listeners viewers wouldn't either. But like when Zone of the Enders drops with the Sons of Liberty demo on it right, like I buy the demo off of eBay because I don't want to play Zone of the Enders. And then I had one friend in high school eventually, Adam Brown, who would camp out for his PS2 with me. It was like my I finally had someone to talk to about games on that level. Like I remember him and I going to a party, like somebody's birthday party or whatever, and just sitting there and talking about this game. And like it was that thing where I would come home and do homework maybe, I guess, I don't know, but do something and eat dinner and then just go disappear to the basement and just play that demo over and over and over and over and over and just mess with the AI\"",
            "start": 2667.68
        },
        {
            "text": "Maybe, I guess, I don't know, but do something and eat dinner and then just go disappear to the basement and just play that demo over and over and over and over and over and just **** with the AI like shoot people in the hands to see their hands go down and them sit there and wiggle, hide in different lockers, move around. Like I I I had to have put 50 to 60 hours into the Metal Gear Solid demo. Yeah. I mean, that that demo is such a culturally important moment for video games because I feel like everybody had an experience with that. You know, Greg was obsessed with that demo. Oh my god. But like going to school, everyone was talking about it. Like that that game was just like it was magical. And like the funny thing is like people really like Zone of the Enders, too. But not Yeah. Yeah. Yeah. Not as much as that demo. And that's the thing is just like that was one of those moments that is so rare now to see the leap like you know when we talk about like you know Uncharted 1",
            "start": 2707.12
        },
        {
            "text": "Yeah. Yeah. Not as much as that demo. And that's the thing is just like that was one of those moments that is so rare now to see the leap like you know when we talk about like you know Uncharted 1 to Uncharted 2 and there being a leap there and then Uncharted 2 to Uncharted 3 there isn't as much and that's why you know people don't like Uncharted 3 switch them around everything would have been fine but to go from much like where I'm talking about this GTA III leap to go from Metal Gear Solid to Metal Gear Solid 2 and see this thing and it looks so beautiful and you're dropping into first person mode and you're running around everything's free and you're hiding your flies and crap and You're just like, \"What is going on?\" You're shooting you're shooting bottles to break them and **** with the food and like orange box oranges falling out of boxes and watermelons exploding. You're just like that that time was so interesting because the you know every generational leap, well maybe not",
            "start": 2750.56
        },
        {
            "text": "the food and like Orange Box oranges falling out of boxes and watermelons exploding. You're just like that that time was so interesting because the you know every generational leap, well maybe not every I guess we're getting to a point now where it's not so true. Um, but back then, even the PS2, the PS2 looked just enough better than the PS1, um, and the GameCube to N64 that it was like a, oh **** like this is a real big deal. And then you see PS3 and stuff and then it's like obviously it's HD and like she starts looking really real and now PS4 is really really real. Um, but it's just like that that distinction between this is a video game and like at least back then this looks real. Yeah. Was so crazy because I remember around right around the time with Metal Gear Solid 2 demo uh Devil May Cry was coming out and that was the thing. If people are used to Resident Evil, this was going to be Resident Evil 4, but Resident Evil 4 is doing something different, right? So, here's that.",
            "start": 2787.36
        },
        {
            "text": "May Cry was coming out and that was the thing. If people are used to Resident Evil, this was going to be Resident Evil 4, but Resident Evil 4 is doing something different, right? So, here's that. They decided it's analog controls and whatever. And I remember being so excited for Devil May Cry because it's like, holy **** this is the Sonic compared or the Crash compared to the Mario where it's like you're a **** badass. It's cool to be cool. You got two guns, ivory, unlimited ammo, you're **** like the guns can keep you up in the air and you're comboing the giant hell spiders and this and that. It's like this sounds **** cool, you know? And it's just like that encapsulates an entire uh time period for me where I was excited about something that I didn't know. Like that was so foreign that wasn't done in video games before and it's like being excited for a franchise that is brand new and new brand new is like it's that that that's weird because like you see things like Horizon",
            "start": 2831.92
        },
        {
            "text": "that wasn't done in video games before and it's like being excited for a franchise that is brand new and new brand new is like it's that that that's weird because like you see things like Horizon Zero Dawn and stuff like that now and at least personally I'm very excited for it but it's not the same. Sure. And I mean I think that part of that comes with back then it seemed like anything could happen at any time and that it would happen fast. Games would happen quickly. They didn't take as much time as they do now. And now we get to this point where both publishers, developers, and I think in a way fans, right? Like if you're going to put four years, 3 years into a game, I'd rather it be something I know about, an expanded story on something I know rather than come out and yeah, okay, cool. Vanquish is cool, but it's not cool enough for me to get super crazy into. And like, you know what I mean? Like Metal Gear Solid's fine. And like that's where you see this balance that I always talk about with the",
            "start": 2875.2
        },
        {
            "text": "It's cool, but it's not cool enough for me to get super crazy into. And like, you know what I mean? Like Metal Gear Solid is fine. And like that's where you see this balance that I always talk about with the indies and AAA where indies are whatever. Here's Gone Home. Here's Tacoma. We're going to change this thing every step of the way. We're going to give you Abzu. We're going to, you know, go make The Lovers in a Dangerous Space Time. Here's all this crazy stuff And then AAA will be assassinated, another Metal Gear Solid, another Assassin's Creed, another thing here because we know you like that and we don't know how to make you take a chance anymore. When we're putting this much money in, where do you take the chance on it? And even when you look back at like the games I'm talking about, like I'm in for the wrestling game every year, WWE, the Superman game. Like I'm talking about licensed stuff that I already had a connection to. Yeah, exactly. And you know, it's funny you bringing",
            "start": 2913.44
        },
        {
            "text": "like I'm in for the wrestling game every year, WWE, the Superman game. Like I'm talking about licensed stuff that I already had a connection to. Yeah, exactly. And you know, it's funny you bringing up uh Grand Theft Auto cuz GTA 3 is going to go down in history as one of the most important video games of all time. And for me, and I think for a a lot of people, I would say the majority of people out there, they didn't play GTA 1 or 2. Three was their introduction to it. Like I didn't know what GTA 1 and 2 looked like until after I had played three. Sure. Um, but that game was unlike any other in the sense of the the um playground chatter of did you did you play this? Do you know what this go? There's prostitutes. You can you get a tank. There's cheat codes. You can get all these weapons. You can go anywhere you want. You can steal this car. You can steal that car. You can make that car spawn. Like you can set them all up. And it's just like what can't you do? Yeah. You know, and like",
            "start": 2947.6
        },
        {
            "text": "You can go anywhere you want. You can steal this car. You can steal that car. You can make that car spawn. Like you can set them all up. And it's just like what can't you do? Yeah. You know, and like that was such a weird magical experience. It's funny. It's like Pokémon Go, but if there's an actual game, do it, you know. Um, but in the sense that everyone is talking about it and it was it was the first sandbox game and it was the one that now we all take for granted in the fact that if I'm I tell you my favorite Red Dead Redemption story, my favorite Red Dead Redemption memory. It is not me on a mission. It's not me in the story. It's me out there **** around. Ran into this guy. Have you heard the story? No. My Red Dead Redemption story goes like, did you play all the way through Red Dead Redemption? I didn't beat it. I got close to the end. There's this guy and I I think it's early on. It's before I think it's before Mexico in that town, but that town's huge obviously or whatever. On the outskirts there's",
            "start": 2991.68
        },
        {
            "text": "it. I got close to the end. There's this guy and I, I think it's early on. It's before I think it's before Mexico in that town, but that town's huge obviously or whatever. On the outskirts there's this guy, right? And I'm pretty sure I'm going to **** this up. Yeah, there's this guy who asks you for flowers for his wife or whatever. You're passing by. He's old. You're like, \"Okay, cool.\" And eventually I got him and came back. He's like, \"Thanks. Come on in.\" And you come on in and the wife's dead in the chair. She's like mummified. She's been like there forever. He's alone. He's alone, but he's a sweet man. He's just wanted flowers for his wife and I. And I walked out of that house and I remember walking out on his porch and there's this beautiful sun out there and it's all, you know, this my horse is right there and I went and this is me. I, I go and then I pulled up the menu and I put on my bandana and I walked back in and I shot the guy and it wasn't cuz I was mad at him. It",
            "start": 3029.28
        },
        {
            "text": "this my horse is right there and I went and this is me. I I go and then I pulled up the menu and I put on my bandana and I walked back in and I shot the guy and it wasn't cuz I was mad at him. It wasn't this. It was just a mercy killing of like you're over. You're crazy. Like I'm just going to do this cuz you're this isn't how you want. And it was like this weird thing of like that's my story of Red Dead and why I loved Red Dead that I was just so lost in that world that I felt the need to make this decision and not only make this decision but feel bad about it, put on the bandana so I don't get bad karma or whatever it was. You know what I mean? And do and cuz it was just the right thing to do. I thought I decided as much as is my John Marston. That was like the thing to do. And that's we take that kind of **** for granted all the time now of like when when you play Phantom Pain and Kevin and I talk about how what the load out is and what we did here and how did you get this",
            "start": 3062.72
        },
        {
            "text": "we take that kind of **** for granted all the time now, like when you play Phantom Pain and Greg and I talk about how what the loadout is and what we did here and how did you get this and you just oh that's just games now. But GTA was the thing of like oh I did this. I didn't even know you could do that. If you I'm trying to get five stars and I'm posted up over here shooting through this building. You know what I mean? Like that was the thing of like all of a sudden it was you had all the toys in the toy box and now you got to play with them however you wanted to. Yeah. And I mean I just that was so cool because there's jumps everywhere and it's like huh that there's a ramp looking thing. If I go off that I might be able to jump over the river. If I land in the river I'm dead cuz you can't swim. It's one of the things you can't do. Um but if you if I make it over that's you hit it at just the right place. Exactly. So but then you do it and then all of a sudden you go in",
            "start": 3098.32
        },
        {
            "text": "cuz you can't swim. It's one of the things you can't do. Um but if you if I make it over that's you hit it at just the right place. Exactly. So but then you do it and then all of a sudden you go in there and it turns into slow-mo and the camera turns around and then all of a sudden it says like I forgot about stunt jump. You get points and stuff. I'm like that was part of this. Yeah. like they thought about that. They thought someone's going to want to do this. So, they put ramps everywhere and that's part of the game. That's not even really part of the game. It's an extra thing. I'm like, \"Oh my god.\" And that's when from GTA 3 to Vice City was like being excited for Vice City. Cuz at that point, it's like it's so funny cuz uh it wasn't even the question of like how are they going to mess this up that we have now where it's like so we're so jaded with all of it where it's just like h they can't capture the magic, whatever. Then it was just this is going to be",
            "start": 3139.2
        },
        {
            "text": "they're going to **** this up that we have now where it's like so we're so jaded with all of it where it's just like he they can't capture the magic, whatever. Then it was just this is going to be the best thing ever. Phil Collins of the 80s in Miami and they just made so many right calls with it too. The Rockstar is so good at marketing and all that stuff but the the production of that game, the soundtrack, the look, the colors, the actors, the oh my god, like they built hype like no one else can. Yeah. And that was the thing of I remember being in college and like you know my the PlayStation 2 era it it started it's my starts in my senior year with me and Adam Brown camping out at a GameStop for nine hours to buy a PS2s and then I took it to college with me and I was like the only person in our dorm to have it. And so like I remember when GTA III dropped getting GTA III and the deal is that I left my door open while I played and people would just come in and sit on the floor and watch like",
            "start": 3178.08
        },
        {
            "text": "our dorm to have it. And so like I remember when Grand Theft Auto III dropped getting Grand Theft Auto III and the deal is that I left my door open while I played and people would just come in and sit on the floor and watch like it was a movie just sitting there and like and I'd get I'll never forget one time I was on running around doing something listening to Chatterbox and I stopped the car and got out and I was like whoa can you get back in? I just want to finish can we finish the joke of whatever this interview is doing and then I remember when Grand Theft Auto: Vice City dropped the next year you know there was another thing where we're all going to some I don't know kick-off party or whatever and like or my friend's band was playing and they were like oh yeah you you going to come I'm like I don't know this game Grand Theft Auto: Vice City comes out and the other friends like he's not coming like there's no way that's a GTA game he's not coming so funny god man yeah those games were so special and then the hype for Grand Theft Auto: San Andreas too was like",
            "start": 3217.84
        },
        {
            "text": "Out and the other friends like he's not coming, like there's no way that's a GTA game, he's not coming, so funny, God man, yeah, those games were so special, and then the hype for San Andreas too was like, was so real, but I think at that point it had been a little too long and there had been a little bit too much happening in that generation of games, that I think the excitement died down a bit. Yeah. There were so many clones at this point, people already doing what it was. Yeah. Yeah. Yeah. So it was it was a little different. Um, the last game I want to talk about, um, in terms of being excited for was Prince of Persia: The Sands of Time.\n\nI corrected the following errors:\n\n* \"GTA game\" is likely referring to Grand Theft Auto, so I left it as is.\n* \"San Andreas too\" is a reference to the game Grand Theft Auto: San Andreas, which was released in 2004. I added the colon and title case for clarity.\n* \"Prince of Persia Sands of Time\" is a correct title, but I removed the extraneous \"original\" and added the subtitle for accuracy.",
            "start": 3249.92
        },
        {
            "text": "to it, it might have been the first game I ever played ever. Now you're talking about the original original. Yes. Yes. like the old I screwed this up by saying original Prince of Persia Sands of Time original Prince of Persia on the uh whatever it was on a computer. I don't even know what the hell computer it was. Um I I need to really spend some time thinking sometime like trying to like map out the the timeline. Sure. But I think it was the first video game I ever played and it was at Kevin's mom's house. She at a garage sale bought a bunch of computer stuff and like I'll never forget me and Kevin went back and played and there was Ski Free and there was like all these stuff but uh Prince of Persia was the first one. Ski free. **** you. Ski free. Oh, you're doing too good. Here comes an invincible snowman. There's no way to dodge him. N **** Um, but the first one we beat up was Prince of Persia cuz it it reminded me of Aladdin and I was obviously enthralled with with Aladdin at that",
            "start": 3285.2
        },
        {
            "text": "involincible snowman. There's no way to dodge him. N **** Um, but the first one we beat up was Prince of Persia cuz it it reminded me of Aladdin and I was obviously enthralled with Aladdin at that time and no. Um, so I we played it and it it was so hard. We didn't know what the **** we were doing. We never got past the first um whatever the wizard bad guy thing. Um I never played the original Prince of Persia. Oh, really? Sands of Time was my first. M so I remember playing that but being really really really involved in the world even for the first 5 minutes of the game because the first 5 minutes to us was hours because we just kept playing it over and over dying but there was just so much excitement in trying different things. It was like Grand Theft Auto like all right if I jump you can grab this ledge but what can you jump grab the other one and it's like who can jump farther and like we're making games out of the game. I think that's something very special about video games",
            "start": 3322.96
        },
        {
            "text": "can grab this ledge but what can you jump grab the other one and it's like who can jump farther and like we're making games out of the game. I think that's something very special about video games especially when you're younger. Um, but with with Prince of Persia, it was very special to me because I made so much more out of that, not just from a gameplay element, but from a story. Like to me, it was a sequel to Aladdin and it was awesome. And there was all these things and there was just backstory in my head. And flash forward, I want to say 20 years. It wasn't 20 years. It must have been like 15 years. Yeah. Um, and I was reading EGM and I saw, oh, Prince of Persia: The Sands of Time. And I'm like, no way. I can't believe we're getting a Prince of Persia now. And that was probably the most excited I've ever been for a game that wasn't a Nintendo game or something and whatever, but I was just like, \"This is going to be perfect.\" Yeah. And every single thing I read about it, I'm like",
            "start": 3363.76
        },
        {
            "text": "excited I've ever been for a game that wasn't a Nintendo game or something and whatever, but I was just like, \"This is going to be perfect.\" Yeah. And every single thing I read about it, I'm like, \"This sounds awesome. The rewinding time sounds fun. These characters look cool. I like the designs. I like the colors they're using. Everything was great.\" And then I played that game and I was like, they delivered. This is perfect. Like that was And you know, looking back on it, it has its flaws. and it doesn't age well and the controls kind of clunky and the combat is pretty bad. Um, but you didn't know that then because there wasn't as much to compare to. I mean, back then, you know, it it did hold its own in terms of um it was a critical darling. Exactly. But I don't think I've ever played a game where at that moment playing it, I thought it was as perfect as when I played The Legend of Zelda: The Wind Waker's Sand Time because it lived up to the hype exactly what I want to be ahead and it surprised me in so many",
            "start": 3406.24
        },
        {
            "text": "played a game where at that moment playing it, I thought it was as perfect as when I played Prince of Persia: The Sands of Time because it lived up to the hype exactly what I want to be ahead and it surprised me in so many different ways. like the story, that game, and the characters, it it made me feel kind of what Uncharted makes me feel now where I'm like, man, they really give a **** Yeah. Like they really care about this. Like I felt that back then, which I think is even more impressive cuz and a lot of games did it. And like that's the thing is everyone has their different game they felt this way about, but for me, Prince of Persia: The Sands of Time, I was like, dude, yeah, I always talk about Prince of Persia: The Sands of Time like that was one that I wasn't excited for leading up to it. And so and this is it came it dropped right at the end of or in the middle of another drought or whatever I remember where there wasn't stuff and I had been taking piano lessons and I'm in college again like I thought life is like ah this is cool I'm doing",
            "start": 3446.72
        },
        {
            "text": "or in the middle of another drought or whatever I remember where there wasn't stuff and I had been taking piano lessons and I'm in college again like I thought life is like ah this is cool I'm doing this like adult thing right I'm like taking piano lessons because I want to not because somebody's forcing me to I was doing it to honor a friend or whatever and I'm doing it and I like it all right but I don't love it you know what I mean I'm then Prince of Persia: The Sands of Time came out and I I'd been playing it for like six or seven months and then Prince of Persia: Warrior Within came out and I read the EGM review about it I was like And I went and got that and totally blew off my piano lessons and never went back cuz it was that thing of like this is my passion. I'm trying to supplement my passion with this thing. And so then for the excitement thing, right, for the next Prince of Persia one, I was so in love with that one. Yeah. I was like so on board for Warrior Within, so into it, like so ready for it. And I",
            "start": 3481.44
        },
        {
            "text": "so then for the excitement thing, right, for the next Prince of Persia one, I was so in love with that one. Yeah. I was like so on board for Warrior Within, so into it, like so ready for it. And I got there, I was like, this isn't the same. See what's so funny about that and this the prince could be a topic on its own but I think that the Warrior Within and again I was 14 when Warrior Within came in so it was a different mindset completely and like looking back on it now it's oh grim dark and this and that and everyone's hating on even at the time critically people had these issues with it and the what was it Breathe Electric, the music, yeah, music whoever alternative some there was some artists that like made music for or Breaking Benjamin maybe that that sounds more They did Halo 2. I don't know, whatever. Whatever. Um, they made the music and so yeah, there's a lot of issues with that. Um, and it was totally different tone than one. And one, to me, the tone is perfect. Two",
            "start": 3516.0
        },
        {
            "text": "2. I don't know, whatever. Whatever. Um, they made the music and so yeah, there's a lot of issues with that. Um, and it was totally different tone than one. And one, to me, the tone is perfect. Two, tone's very different. So, whatever. But the story of it, I remember being like mind blown at some of the time travel stuff that they did and like how you actually **** all this up and the death chasing you. Like, **** awesome. And the combat was a bit better. It wasn't Don't get me wrong, I don't I'm not saying the game was bad. Not at all. It was just like I thought there was something so a good a good analog to it is like when we're talking about Uncharted, right? And Colin was like somebody's going to die in Uncharted 4 3 and everything. I'm like they're not going to kill these people. Like that's not what this is. It's a pulp adventure. It's always going to end this way. Finishing The Sands of Time. I was like oh this is what this is. And then to get there and have it be the tone so\n\nI corrected the following:\n\n* \"Sands of Time\" (lowercase) to \"The Sands of Time\" (proper noun)\n* No other changes were made, as the text appears to be a coherent fragment with no obvious errors that would alter its meaning.",
            "start": 3557.2
        },
        {
            "text": "Like, that's not what this is. It's a pulp adventure. It's always going to end this way. Finishing The Legend of Zelda: The Wind Waker - Majora's Mask. I was like, \"Oh, this is what this is.\" And then to get there and have it be the tone so changed now. And the opposite example of that is like Jack 2, which I loved. I love I liked Precursors to Legacy a lot. And then when they put out The Legend of Zelda: Breath of the Wild was another game where I was like, \"Oh, awesome. Another Zelda game. Great.\" Jack 2 came out and I was like, \"Oh, I'm glad they changed this way and went open world and I have all these guns and I'm running around Link's talking and I know a lot of people are everyone's not no one's on board with that but Greg Miller.\" But yeah. No, but I mean that's one of those the the interesting things because I just love Prince of Persia. It was different but I I loved it despite its differences. Uh my biggest uh concern with that game was that Farah wasn't in it. Yep. That that was the whole thing too. Yeah. Very very much. I agree with you on",
            "start": 3594.24
        },
        {
            "text": "but I loved it despite its differences. Uh my biggest uh concern with that game was that Farah wasn't in it. Yep. That that was the whole thing too. Yeah. Very very much. I agree with you on that. Um, but then my main issue with the game, I never beat that game because there was a game-breaking glitch in the final boss really. So, the final boss couldn't be beaten by me because it just wouldn't let me. Like when you're about to do the final strike, the game would just freeze and do this like weird glitchy thing where you look like you're in a portal and it's like, well, that sucks. Um, but then I remember Two Thrones after that, all the promotional material that was coming out for it. Uh there was trailers and stuff and Pharaoh was back and they're like there was that the chick that was in Warrior Within and they're they're going to be together and the story looked so cool. I'm like man they're tying everything together to end the trilogy. It's going to be great",
            "start": 3627.04
        },
        {
            "text": "in Prince of Persia: The Warrior Within and they're they're going to be together and the story looked so cool. I'm like man they're tying in Assassin's Creed: Revelations time and Prince of Persia: The Warrior Within together to end the trilogy. It's going to be  awesome. And then somewhere along the line they it was kind of like the Halo 5 situation at E3 where they released a trailer in the poncho and that never happens in the game. The game we got was totally different than those trailers. Yeah. Like absolutely none of that stuff made the game. And the third gameplay-wise was better than two. Story-wise was better than two and it was a bit more like one and whatever, but overall wasn't better than two. So, it was kind of weird. But anyways, all those games. I want to replay those games now. They they did I when Prince of Persia: The Sands of Time got put out on PS3 as a PSN game, I remember playing it for a little bit, but it was another thing where it was just not the right time or I I got pulled off onto something else. I want to stream them one day. I don't know",
            "start": 3667.92
        },
        {
            "text": "PSN game, I remember playing it for a little bit, but it was another thing where it was just not the right time or I got pulled off onto something else. I want to stream them one day. I don't know when. One day. No promises. New studio. New studio. We say new studio as if that's going to be like it's the same thing when we quit IGN. We're like, we're going to have so much free time. I think we're going to have more. I do think it will be. Oh no. We'll see. I think I think it's just going to be that thing of it. It might not work out for everybody in the same way, but I think it'll be the thing of like, okay, cool. Like we have to do GamesCast, right? I packed lunch. I'm going to eat this. Greg, before you go, set this up so like when you guys are still at lunch, I can go over there and I can video or stream or whatever. I can make a let's play on my own of whatever the **** I want to play. We'll see. We'll see if we have all the stupid stations set up the way",
            "start": 3710.32
        },
        {
            "text": "go over there and I can video or stream or whatever. I can make a let's play on my own of whatever the **** I want to play. We'll see. We'll see if we have all the stupid stations set up the way they should be. Topic three, 3D and four are both brought to you by you. Go to kindafunny.com/gamescasttopic and leave a question just like my boy Pablo Lopez. Pablo Lopez did aka little Casper. Oh my goodness. Hey, shout out to Casper though. That movie. When did Casper come out in your life? I didn't see it. That's how much I had missed it. That's how much I mean I've seen plenty. It's been on TV since then. And I've seen I've seen the Ghostbusters bit and everything, don't get me wrong, but it's just like I was too old for Casper by the time Casper hit the Oh my god, Casper was **** up. Fatso and Stinky. Yeah, there was something. Oh my lord. Christina Ricci. Yeah, cuz you were a kid. Yeah, you were her age. No, I was not her age. I was way younger than her. Um, what is the best",
            "start": 3744.24
        },
        {
            "text": "Fatso and Stinky. Yeah, there was something. Oh my lord. Christina Ricci. Yeah, cuz you were a kid. Yeah, you were her age. No, I was not her age. I was way younger than her. Um, what is the best video game trilogy? I personally believe it's the Arkham trilogy. Yeah. Yeah. But I mean that's see that's like so what are the best three video games? It gets difficult because gut answer and I feel like there's not even a goddamn question. Super Mario Brothers. But that's the thing if they keep going. But that's the problem. It I mean Super Mario Brothers there was only three. Super Mario unless you're in Japan world is called Super Mario Brothers 4 whatever. But then the problem there though is Super Mario Bros. to USA versus Japan cuz I mean I'd still give it even if you're talking about the Japanese Mario one 2 and 3. That's a great that's a really good pick. Yeah. That's just the problem though is I feel like trilogy we're so bad at saying all right we're making a trilogy and stopping",
            "start": 3786.32
        },
        {
            "text": "Japanese Mario 1, 2, and 3. That's a great pick. Yeah. That's just the problem though is I feel like we're so bad at saying all right we're making a trilogy and stopping, like the Arkham trilogy, yeah, is great again we're just ignoring Origins which I hate doing. Origins is a great game, I think, and then it's like of course I love the Uncharted trilogy and then there's an amazing fourth game. Does that even mean? What does that play into it? I mean, just because we were just talking about it, I love the Prince of Persia trilogy, which is a trilogy. Yeah. But I wouldn't put that up there as best. I think it deserves consideration. Yeah. Um yeah. Yeah. I don't know. Yeah. I mean, it's just I feel like it's such a weird wishy-washy where do you cut it off, right? Like I would say the best series is... Resistance, but but again here I'm cheating. Resistance one, two, and three.",
            "start": 3839.6
        },
        {
            "text": "where do you cut it off, right? Like I would I that doesn't count either. I mean, say best series. Is there any vid video game trilogy? Resistance, but but again here I'm cheating. Resistance one, two, and three and Retribution and uh Bernie Skies, right? Yeah. I mean, there's Jack one, two, and three. Yeah. And there's Racing. And then there's New Frontier. Jack and Daxter New Frontier spin-off, is it? I mean, it's Jack and Daxter. It doesn't have a number. Is that I mean, is that what we're saying? They have to have a number straight on them. That's the problem. because there's a lot of great game series that you, you know what I mean? I've always been a big fan of Madden 01 through 03. There you go. There you go. Madden 03 soundtrack was so good. And 04 Michael Vick on the mic. I never forget when they put Lucky Boys Confusion in there. I was like, **** Lucky Lucky Boys Confusion has made it. They're they're in a Madden game. Yeah. I think you're stumping us here. It's not that",
            "start": 3884.52
        },
        {
            "text": "forget when they put Lucky Boys Confusion in there. I was like, **** Lucky Lucky Boys Confusion has made it. They're they're in a Madden game. Yeah. I think you're stumping us here. It's not that we're stumped. It's just like I don't I It's more about the trilogy. What what do we define as a trilogy and how do you cut that off and where does that move when you do have a million spin-offs and you do have a whole bunch of different things cheating looking at the wall for I think when games are are designed like God of War Gears of War then there's the other ones though. Exactly. But it's like it still doesn't make it not a trilogy though. Star Wars is still it's three trilogies. Okay. You know what I mean? Yeah. Sure. like it's part of a hole as well. Yeah. But like they're they're clear arcs. So I think that helps a lot. But video games are different. They don't really do it that way. Yeah. It's tough. And I mean like you want to know I'm going Google. I'm going see if what other",
            "start": 3930.72
        },
        {
            "text": "Arts. So I think that helps a lot. But video games are different. They don't really do it that way. Yeah. It's tough. And I mean like you want to know I'm going Google. I'm going see if what other people are talking about. You want I'll nominate one that isn't even a trilogy yet. But I think you can make in a case for The Walking Dead. The Walking Dead Season One, Two, and Three. If they stop there, that would be worthwhile because One to Two is what we're talking about, right? The fact that it's still the same narrative thread. I'm still, you know what I mean? Like in terms of Prince of Persia 1 to Two, where's Farah? You know what I mean? Like I want to know about her here. It's still very much like we've gone from Lee to Clem and now we're Clem into the but she's still dealing with everything we dealt with in the first game. And it's such a personal journey. That's where you lose like you know Jack One, Two, and Three. I like Jack 2. A lot of people don't. I didn't like Jack",
            "start": 3976.56
        },
        {
            "text": "we deal with in the first game. And it's such a personal journey. That's where you lose like you know Jack One, Two, and Three. I like Jack 2. A lot of people don't. I didn't like Jack 3, weirdly enough. You know, it's like that we like how do you do all that? The Arkham games, yeah, are great and do a lot of amazing things, but like the tank controls sucked in Arkham Knight. And again, we're ignoring Origins. Uncharted, I I would say it would be the best if we can count that since there's a fourth one. I don't know. Yeah. Yeah. No one will be able to touch the Mario gameplay. So, I guess Mario is the winner. Totally unrelated. My brother just text me this picture. Smackdown. Here comes the pain. The greatest hits version that he just found. What the **** Okay, I'm trying to load this. There is the 16 best video game trilogies from whatculture.com. Oh, I love what culture.com. Do you do you actually know them? I don't know much about them. They make lists. Quality quality.\n\nI corrected the following:\n- \"dealt\" to \"deal with\"\n- \"Jack one, two, and three\" to proper title case\n- \"Arkham Knight\" to proper noun capitalization\n- \"Origins\" to proper noun capitalization (assuming it refers to a game in the Arkham series)\n- \"cculture.com\" to \"whatculture.com\" based on the metadata reference to whatculture.com",
            "start": 4015.04
        },
        {
            "text": "this. There is the 16 best video game trilogies from whatculture.com. Oh, I love what culture.com. Do you do you actually know them? I don't know much about them. They make lists. Quality quality. Do they pageionate them or whatever though? You have to click. Yeah. Yeah. Yeah. But I mean, we'll see. Oh god. Airheads Bites ads. Come on. All right. All right. All right. Smackdown here Comes a P was a really good game. They do pageinate them. I do believe that was the that was the Smackdown that I I dropped out of wrestling and then maybe it was Smackdown versus Raw. The first one they did. I dropped out of wrestling uh in college, but then when I moved off campus and I was working at the Tribune, uh I my girlfriend at the time and I would be over all the time and I wanted to play games. So, what we would do is we had the big TV, she'd be watching something on TV and then I had a little CRT next to it that I put the PS2 and I would just simulate Smackdown cards and like build",
            "start": 4054.08
        },
        {
            "text": "Games. So, what we would do is we had the big TV, she'd be watching something on TV and then I had a little CRT next to it that I put the PS2 and I would just simulate Smackdown cards and like build the thing because that was like when they put in the not season mode, manager, general manager mode in whatever. Yeah. Yeah. Sorry. Did you get me some trilogies? Uh yeah, I also my brother then followed up with a text that is him trying to do Brock Lesnar's theme song in the wrong tone. That's good. Your brother's the man. All right. Splinter Cell trilogy. I don't I There's so many Splinter Cells. Sonic the Hedgehog. I mean, yes. So So Sonic, two. Here's the problem. Yeah, cuz CD is a clear adventure all their own thing. Yeah. Well, Adventure CD is a bit more it's the same gameplay, but the thing is it's different system, whatever. There is a clear Sonic the Hedgehog trilogy that there's a through line for narrative and story or whatever through one, two, and three.\n\nI corrected the following errors:\n\n* \"Smackdown cards\" (no change needed)\n* \"not season mode\" (corrected to remove unnecessary word)\n* \"general manager mode in whatever\" (kept as is, but could be rephrased for clarity)\n* \"get me some trilogies\" (kept as is, assuming it's a colloquialism or slang)\n* \"wrong tone\" (added missing word to complete the sentence)\n* \"CD CD\" (removed duplicate word)\n* \"adventure all their own thing\" (kept as is, but could be rephrased for clarity)\n* Added capitalization for proper nouns like \"Sonic the Hedgehog\", \"Splinter Cell\", and \"Brock Lesnar\".",
            "start": 4093.68
        },
        {
            "text": "but the thing is it's different system, whatever. There is a clear Sonic the Hedgehog trilogy that there's a through line for narrative and story or whatever through one, two, and three. The problem is you add Knuckles to that, but Knuckles only happened because they didn't have enough time to finish three. So, they turned it into two games and you can put them together. So, if you think of Sonic, the Sonic trilogy of Sonic 1, Sonic 2, and Sonic 3 and Knuckles, you're going to give it to that. You're you're going to cheat. I'm not going to give that cheat that one. That's the thing is I don't think I can give that best gaming trilogy. Like, it's good. Yeah. I'm not giving it best. The way you talk about Sonic makes me want to go back and replay them. I don't know. I love Sonic, though. I know. I I love Sonic back in the day. Um I replayed one recently, like last year on the 3DS. Um, and one I will never stand up for saying that it's it's great. Um, it definitely has faults, but two",
            "start": 4144.96
        },
        {
            "text": "I love Sonic back in the day. Um I replayed one recently, like last year on the 3DS. Um, and one I will never stand up for saying that it's it's great. Um, it definitely has faults, but two and three, man, they're they're good. God of War, I mean, Ascension was still part of it, not to mention Ghost of Sparta, Chains of Olympus. Yeah. And again, I I just I'm not saying I know they aren't numbered, but are we really gonna ignore those entries? You know what I mean? Like, what is a what is a solid three act video game trilogy? I mean, so here's the thing. You you think about Star Wars and then there's Star Wars Rogue One. We obviously don't count those as the same things, right? Yeah. But I with this though, it's still Kratos. It's still his story. Sure. But I still feel like when you talk about the Star Wars trilogy, you're talking about the original Star Wars films and you're when you say Star Wars prequels, you're talking about the prequels. The prequel trilogy. I know",
            "start": 4182.24
        },
        {
            "text": "you talk about the Star Wars trilogy, you're talking about the original Star Wars films and you're when you say Star Wars prequels, you're talking about the prequels. But the prequel trilogy. I know, but I don't think anybody says that. Oh, yeah. No, defin I mean if you if you're a **** nerd on the internet, OT and PT are how you Okay. Okay. You refer to them. So, Crash Bandicoot. That's a trilogy. Yeah, there was Crash Team Racing, but I don't I agree. I'm not going to count. I'm not going to count. I'm just saying. I'm saying that's that's a Crash B. No. Get the **** out of here. I don't know what Crash B is. I don't remember. Crash Bash. Oh, Bash. Okay. I said Bash. I was like, did he have a home run derby? Finished saying Bash. Uh, yeah. It's It's the Mario Party. Gotcha. Not made by Naughty Dog though. Naughty Dog only made one, two, three, and Crash Team Racing. But I mean, that is a trilogy. Yeah, but there's not much narrative thread. I don't know if you need that, though.",
            "start": 4233.04
        },
        {
            "text": "by Naughty Dog though. Naughty Dog only made one, two, three, and Crash Team Racing. But I mean, that is a trilogy. Yeah, but there's not much narrative thread. I don't know if you need that, though. Yeah, I'll give you it. Crash is a trilogy. The best of all time, apparently. Uh, by default, according to whatculture.com, Gears of War. Yeah, they have four now though. Devil May Cry. That's like Gears of War directly flies in its faces. There's a fourth one. Devil May Cry. There's a fourth and a reboot. We're weird. Reggie's reboot. Holy **** That's awesome. I'm sure that's an old man. Resident Evil as they release seven. Yeah. But I'll give it to them that Resident Evil has a trilogy to it. Resident Evil 1, two, and three. Yeah. What about Zero? What about Code Veronica? Code H. It's still a trilogy. It's still a trilogy to me, Dan. I I feel like I'll give them that. Okay. Resident Evil one, two, and three deserve it cuz four is so different. Code Veronica is is a spin-off, but",
            "start": 4271.52
        },
        {
            "text": "still a trilogy. It's still a trilogy to me, Dan. I I feel like I'll give them that. Okay. Resident Evil one, two, and three deserve it cuz four is so different. Code Veronica is is a spin-off, but yeah, that was my first Resident Evil game. Code Veronica was many people's. Yeah, I'll never forget when I my friend from the halls, Bibbs, was in there watching me play this before Justin Bieber. I don't I forget. I think it was last name. Somebody do that. I don't even remember. I couldn't even probably find I'd have this is one of those people you'd have no way of finding in the world right now. Yeah, I would How do you track this kid down based on his nickname? Um he walked he was sitting there eating popcorn. I think he was high while I was playing Code Veronica and right is like what Nemesis, right? Wasn't that the dude? As he like burst out for the first time and chased me. He just goes, \"This dude is about to **** your universe up.\" I was like, \"Damn.\" He just popcorn. Oh man. What",
            "start": 4332.0
        },
        {
            "text": "right? Wasn't that the dude? As he like burst out for the first time and chased me. He just goes, \"This dude is about to **** your universe up.\" I was like, \"Damn.\" He just says popcorn. Oh man. What culture? Stunning Asian babes are looking for older men. That's a trilogy. Yeah, that's the best trilogy of all time. Can I see it? Yeah, I can see it. Good. Good. Um, yeah, Resident Evil. All right, I'll give it to you. Resident Evil. All right, Resident Evil. Jack and Daxter, we I mean, I feel like Jack and Daxter does deserve. You know what? What? And I'mma stand by this one. Okay. Grand Theft Auto 3. What? Grand Theft Auto 3 is a trilogy. I I That's my vote. So, you're saying Grand Theft Auto 3, Vice City, San Andreas, best video game trilogy of all time. If you count that, then yes, I'd agree with you. I think that that should count. But they don't even like it wasn't GTA 3, Vice City. GTA 3 San Andreas. I know it was I'm well I'm well aware. I think and I think that's why that's why it",
            "start": 4367.6
        },
        {
            "text": "with you. I think that that should count. But they don't even like it wasn't GTA 3, Vice City, GTA: San Andreas. I know it was I'm well I'm well aware. I think and I think that's why that's why it counts cuz it doesn't need to be narrative gameplay and what that is. It's a it's a thing. It's a thing. Okay. And that thing is a trilogy. Silent Hill knocking on TV. Not giving you Silent Hill. Metal Gear Solid. Not even close. Ignoring four, five, Peace Walker literally. And that's totally a narrative that is messed up and continuing all the time. Arkham, which they say referring to the Arkham Game series as a trilogy is a strange one, as plenty of fans are willing to completely dismiss Origins despite it having some spectacular moments. All right, Uncharted. Halo. There's a Halo 4. There is and a five. No, that's not true. That'd be too many. They would have stopped by then. See, that's the problem is the Halo trilogy was a trilogy. Like, it definitely was. This topic, it's like just",
            "start": 4419.52
        },
        {
            "text": "Is and a five. No, that's not true. That'd be too many. They would have stopped by then. See, that's the problem is the Halo trilogy was a trilogy. Like, it definitely was. This topic, it's like just how stupid video games are. It's stupid. They're just different. Like such a movie thing and even then like it's broken. But with Halo, I would argue I like this is now the topic is what the **** is a video game trilogy? WTF is a video game trilogy is a great one. Yeah, but but I think that Halo 1, 2, and three get it because of the narrative um that it builds. Yeah. Because for it goes in a different direction. So you're saying a trilogy for video games can apply to either the narrative or the gameplay mechanics? Yes. I I feel like there there has to be a thread that holds between it, whatever that thread is. So gameplay is can be the thread. Yes. Yeah. Yeah. Yeah. So then, okay, what I'd like to know, and granted it's on my mind because it's a let's play today, is DSX Go, Laraft Go,\n\nCorrected changes:\n\n- \"five\" remains as is (no clear error)\n- \"Halo trilogy was a trilogy\" is already correct\n- \"stupid video games are. It's stupid.\" is already correct\n- \"like such a movie thing and even then like it's broken\" is already correct\n- \"with Halo, I would argue I like this is now the topic is what the **** is a video game trilogy?\" remains as is (no clear error)\n- \"WTF is a video game trilogy is a great one\" is already correct\n- \"Halo 1, 2, and three get it because of the narrative um that it builds\" is already correct\n- \"So you're saying a trilogy for video games can apply to either the narrative or the gameplay mechanics?\" remains as is (no clear error)\n- \"Yes. I I feel like there there has to be a thread that holds between it, whatever that thread is.\" is already correct\n- \"So gameplay is can be the thread\" is already correct\n- \"DSX Go, Laraft Go,\" corrected to \"DS:GO and LA Noire (likely intended)\"",
            "start": 4474.64
        },
        {
            "text": "that thread is. So gameplay is can be the thread. Yes. Yeah. Yeah. Yeah. So then, okay, what I'd like to know, and granted it's on my mind because it's a let's play today, is DSX Go, Lara Croft Go, the other Go game, I can't remember. Are they all or Hitman Go? Are is that a trilogy? Because that the gameplay narrative thread or the gameplay thread is there. Narrative isn't sure, but they're all building on the same idea of what's happening. I'm Here's the thing. I I argue my case. Here's the thing with that. I like where your head's at. And I would say now that it's what the **** is a video game trilogy? Trilogy might not be the right terminology for that series brand. Yes. Yes. I The Go brand is the brand there. The rest is just the IP on top of it. Yeah. I agree. I agree. So So there's that. But I I don't think that you can call them a trilogy because they're not uh I don't know. I don't get me wrong, I would not call them a trilogy in any world, but I'm just I'm just poking",
            "start": 4526.96
        },
        {
            "text": "that. But I I don't think that you can call them a trilogy because they're not uh I don't know. I don't get me wrong, I would not call them a trilogy in any world, but I'm just I'm just poking a hole in your argument here. Well, because I'm thinking the things that I'm I'm arguing for are Resident Evil, um uh GTA 3. If we if we can say GTA 3, then I would vote GTA 3. I Yeah. All right. There the the motion carries. That's what I'm saying. So GTA 3 and then and then Halo. I would say it's a Halo trilogy. Halo mainly for the I mean gameplay game gameplay as well. Gameplay and story elements. Oh, story elements. Sure. But because that's the thing is that one, two, and three built into each other. Like three is a it's a direct sequel to two. Four. Yeah, it is a sequel in the sense that it's Master Chief, but it happens in a different timeline. It's not continuing the same story. There's different threats. There's different Is it a different timeline? Well, same same timeline. Okay. Okay.",
            "start": 4577.8
        },
        {
            "text": "Chief, but it happens in a different timeline. It's not continuing the same story. There's different threats. There's different Is it a different timeline? Well, same same timeline. Okay. Okay. Just make sure you frame. Okay. Thank you. Thank you. Thank you. Um, but like you know, one, two, and three are a story. It's it's uh Cortana and Chief going through all this stuff. Four is more of like a a story about Cortana and Chief, but it's like it's a separate story. So that's my thing. Like God of War is one, two, and three. Is there a narrative thread between those that is different from Ascension? Well, I mean, Ascension, I would have had to play the single player to tell you, and nobody touched single player on Ascension, right? That was like Kratos's prequel, but then it's like Ghost of Sparta and all that stuff. That's the thing. Yeah, there's it's a prequel then. I would say God of War one, two, and three are the same narrative, right? Because it's him going against the Greek gods.\n\nI corrected the following:\n\n* \"Chief\" is already capitalized as a proper noun\n* Added capitalization to \"God of War\", \"Ascension\", and \"Kratos\"\n* Corrected \"Ghost of Sparta\" (which was likely auto-generated) to its correct spelling",
            "start": 4623.28
        },
        {
            "text": "of Sparta and all that stuff. That's the thing. Yeah, there's it's a prequel then. I would say God of War one, two, and three are the same narrative, right? Because it's him going against the Greek gods. Yeah. And you know, so give it to them. Okay. God of War is a trilogy. Okay. There's the God of War trilogy. The GoD of War games not a trilogy. Okay. Resident Evil 1, 2, and 3 trilogy. Okay. because there's gameplay elements, the gameplay idea of it and the story, although not necessarily the same characters, builds on the lore of the same thing intentionally. Okay. Whereas the Resident Evil 4 and all that stuff move things, change things. Oh, it moved a lot of things. What else am I arguing for? I don't know. I think we've covered it there. We're not done with this list. Are we still going with the rest of the trilogy? I want to know. Okay. Well, how many more do we have to go? The Etsio trilogy. Oh my god. I'll give it to him. Yeah. Okay, that makes sense. It qualifies in the same way the",
            "start": 4661.84
        },
        {
            "text": "The Etsio trilogy. Oh my god. I'll give it to him. Yeah. Okay, that makes sense. It qualifies in the same way the Grand Theft Auto 3 trilogy in. So, what that was? So, that's Assassin's Creed 2, Assassin's Creed Brotherhood, or was it Assassin's Creed 2 Brotherhood? No, Assassin's Creed 2 Revelations and Revelations, also known as the Ezio trilogy, is the best the series will ever be. No. Yeah, probably. You're right. Yeah, 2 was amazing, but that that Unity one wasn't bad. It just got a bad rap. Nobody played it cuz they were sick of it. The most recent one. Oh. Oh. Oh, Unity. No, Unity was the one I already hated. Then there was Assassin's Creed Syndicate. England. I'll look into it. What is it? Assassin's Creed. It's not Unity. What happened after? Yeah, Unity and Rogue came out at the same time. It was then it was Assassin's Creed Origins. You remember, you don't remember this, but there",
            "start": 4708.88
        },
        {
            "text": "Creed. It's not Unity. What happened after? Yeah, Unity and Rogue came out at the same time. It was then Assassin's Creed: Altaïr's Chronicles. You remember, you don't remember this, but there was a time, ladies and gentlemen, when you didn't have the knowledge of the world at your fingertips and you'd sit at a restaurant and this coaster would come up and like I'm pretty sure Joe Pesci was in Super Mario Brothers. He's like, \"Was he can't prove you wrong? I don't remember that.\" Mass Effect. Mass Effect's a trilogy. That's a great point, actually. Yeah. Yeah. Okay. Okay. We a lot of people have been screaming at their computers and phones at home right now. That's a great point. That might be the best true trilogy we've had. Number one, ladies and gentlemen. God damn it. Grand Theft Auto: 3D Universe. Is that what it says? Yeah. Okay. Wait. Assassins. Yeah. No, they're they're talking about what I'm talking about. GTA III by City. Oh, I No, I knew that. I just thought it was funny",
            "start": 4759.76
        },
        {
            "text": "Universe. Is that what it says? Yeah. Okay. Wait. Assassins. Yeah. No, they're they're talking about what I'm talking about. GTA 3 by City. Oh, I No, I knew that. I just thought it was funny they put 3D Universe in there. Assassin's Creed Syndicate is what we're looking for, ladies and gentlemen. Syndicate is Syndicate. That was a thing. Okay. I love this show, Greg. Earlier today, I was telling you I don't like this show. I was lying. I was lying. He didn't say that. I meant that, but now I take it back. You You just didn't You were just tired today. Now you're happy. I'm tired. I just It's It's You're worn out. We've been working you hard. We've been working you too hard. I've been working them hard on this table. Yeah. Um but I will tell you this much. I did not expect to do a whole topic about the first question. That's how we do it here. That's how we do it. Oh man, this is how we do it. It's Kinda Funny Games. Topic four of the day also brought to you by you. Go to kind",
            "start": 4799.6
        },
        {
            "text": "Topic about the first question. That's how we do it here. That's how we do it. Oh man, this is how we do it. It's Kinda Funny Games. Topic four of the day also brought to you by us. Go to kinda funny.com/gamescast. Topic. Have we said Stephen Ein-Boehm yet? We haven't. Patreon producer Steven Ein-Boehm. This comes from Thanks for supporting us at patreon.com/kinda-funny-games where you can go there and support us too soon and get your name on the show as well. Matthew Santa Maria. He says, \"If the NX was never coming out, what would a Nintendo console you designed look like? Form, games, power, whatever.\" I would I mean I would tell Nintendo stop. Really? Hey guys, let's put our stuff on other consoles. Like let's just make a lot of money. Let's just roll in money. Do we need another machine? No. Yeah. Can we make one that's successful? Cuz like now I'm juiced for the NX, what we think it is, the portable go everywhere system. Okay, cool. I'm in. Put a stop",
            "start": 4850.4
        },
        {
            "text": "Do we need another machine? No. Yeah. Can we make one that's successful? Cuz like now I'm juiced for the NX, what we think it is, the portable go everywhere system. Okay, cool. I'm in. Put a **** battery in it that matters, please. But other than that, I'm I'm thinking that sounds great. And so now that I think that sounds great, that's what I'd think about in terms of I've never ever uh since I shouldn't say never, but since everything's happened now and Nintendo's gone off on their own, Colin's always like, I hope they come back and they they fight the big guys and they make a big thing and they appeal at their parties. And I'm like, no, I don't want them to do that because Xbox and PlayStation have that covered. I'm not going to be excited to We've lived this universe before where it's like, \"All right, cool. Nintendo's coming in. They're making it on par with the other systems, but they have this weird controller. So now you can play uh what's a good third party game coming up that's",
            "start": 4902.16
        },
        {
            "text": "\"All right, cool. Nintendo's coming in. They're making it on par with the other systems, but they have this weird controller. So now you can play uh what's a good third party game coming up that's not I'm thinking Gears thinking Horizon. Give me a third party game that we care about kind of. The next Splinter Cell's coming, the next Mass Effect is coming, and it has this kind of thing that you can only do on I don't care.\" You know what I mean? Like that's not what's going to get me to go play it. So why does it matter? I know we make the argument Colin makes the argument that I think you know matters in the fact that you know the Wii U sales, the Wii U success proves that there's not just enough Nintendo fans, Nintendo's doing something different, fans I'm going to go support them, we don't need third parties but I for and it wouldn't be a a but for some of these third party games, there is an argument to be made that let's say I wanted to play Madden this next year right and they were like\"",
            "start": 4937.2
        },
        {
            "text": "parties but I for and it wouldn't be a a but for the some of these third party games there is an argument to be made that let's say I wanted to play Madden this next year right and they were like all right cool there's going to be the Wii or the NX version that yeah I can play on the go and I can take my season on the road and it's going to look worse than my PlayStation 4 copy. But would that really stop me? Like I'm not a competitive like, hey, let's go. And I am a competitive local guy and I I never get all the trophies in Madden. So it's all of a sudden like, huh, do I care about any of that? If I could be playing it on a plane, not with you cuz you wouldn't play it, but somebody else I'm playing on a plane or I'm just taking the Chicago Bears through season after season after season while I watch something on Virgin America. That sounds really appealing. That's what I always wanted out of the Vita version. I wanted there to be a Vita version that communicated with the PS3 version",
            "start": 4975.68
        },
        {
            "text": "while I watch something on Virgin America. That sounds really appealing. That's what I always wanted out of the Vita version. I wanted there to be a VA version that communicated with the PS3 version at the time for version now where my save comes with me and I go and I play and then the VA just sucked and nobody cared and nobody wanted to do that. Yeah, those are the little things. But yeah, you know, as the Nintendo guy of us, I I also agree that I wish that Nintendo would just make games for the other consoles because then they could just focus on making games and that's the stuff that I care about the most at the end of the day of all of and that's what they do best. Yeah. They have the characters, they have the games, they have the so they have so many genres covered. So many in unique different ways that the other guys don't do. No one else does. So it's like cool, just do that for them. Profit. That'll be great. Having said that, I do think that this direction they're taking",
            "start": 5013.6
        },
        {
            "text": "different ways that the other guys don't do. No one else does. So it's like cool, just do that for them. Profit. That'll be great. Having said that, I do think that this direction they're taking or potentially taking with the handheld thing is very interesting and smart. And again, I've said this a couple weeks ago, I didn't see this coming really. Like I I would I hope but yeah I wouldn't have guessed that it would have been uh the Nintendo Switch. I always thought of it as a console hybrid where it was backwards where I didn't want it to be it's a console that you can kind of take with you. The idea of it being a handheld that you can also play on the screen I think is the right way to think about it because then it's handheld first which is what Nintendo has always done right. Always since the Game Boy and I Virtual Boy doesn't count cuz Virtual Boy is not a portable system. Like you can carry it around, carry around the GameCube cuz it had a handle. Doesn't make it a portable portable",
            "start": 5048.0
        },
        {
            "text": "since um and I Virtual Boy doesn't count cuz Virtual Boy is not a portable system. Like you can carry it around, carry around the GameCube cuz it had a handle. Doesn't make it a portable portable system. Um, but yeah, Game Boy, Game Boy Color, Game Boy Advance, DS, 3DS, all of them have great libraries of games and vast some would say that there it's it's a vast library. And uh the idea of Nintendo being out of the handheld space is concerning to me because if they're not doing it, nobody's doing it right, you know? Yeah. No. And I think that that this keeps that going. So it's not all just mobile games. Not to hate on mobile games. I think that had Nintendo backed out completely of hardware and made mobile games like real mobile games and uh PS4 and Xbox One games, my god, that would be amazing. But I think that uh they're they're kind of potentially nailing what they I believe they should be doing in order to succeed because the doing something different I think is going to help",
            "start": 5089.44
        },
        {
            "text": "be amazing. But I think that uh they're they're kind of potentially nailing what they I believe they should be doing in order to succeed because the doing something different I think is going to help them. Um I think that the thing that they did differently was the wrong thing with the Wii U. Sure, I agree with that. and and uh the Wii as well, but that's only an argument from a critical standpoint, not from a success standpoint. Well, I think you can make the argument critically and then I think you'd also make it just looking at the fan base, too. You know what I mean? Like the numbers are all skewed into different things, but like I people always I mean like I I almost brought it up in excitement like I was wigging out for the Wii when the Wii came around. The Wii set everything right for me where it was like PS3 and 360 had come out, right? or were about to come out when the Wii gets announced. Um, PS3 and Wii came out, right? Same day and 360 was already out. I apologize. And",
            "start": 5140.64
        },
        {
            "text": "for me where it was like PS3 and 360 had come out, right? or were about to come out when the Wii gets announced. Um, PS3 and Wii came out, right? Same day and 360 was already out. I apologize. And both 360 and PS3 disqualified themselves from me because I didn't have Ethernet in the house and I didn't have an HD TV and they wanted so much money and I was poor and just out of college. I was like, \"No way.\" And then Nintendo came along. We're making this system. It's got this cool controller. We're going to let you play all the old games. Download them. I was like, \"Oh, like that's fascinating. That's really interesting. That speaks to me right now.\" And if they would have stuck with that and still been like, we are this machine for gamers and we're going to give you the toys you expect from Nintendo and all these classic things and da da da, it would have been a different story. But then it the market exploded, right? And it was suddenly casual quote-unquote gamers. And when I say",
            "start": 5182.08
        },
        {
            "text": "from Nintendo and all these classic things and da da da, it would have been a different story. But then it was the market that exploded, right? And it was suddenly casual quote-unquote gamers. And when I say casual, I mean my mom. I mean the grandmothers at the nursing home and stuff like that. I'm not I mean it changed what casual gamers make. Exactly. Exactly. And so when they got on board, that's when it was everybody's got the money symbols in their eyes. And Ubisoft was like there's a million rabid games. Yeah. And then that was the problem is we never got the promise of the Wii really um in terms of its the the mechanics of the what the Wii remote could have done. You never got that lightsaber game. You never got the lightsaber game. And then the Wii U is an even bigger culprit in that it it didn't have the success that the Wii did financially and with the the new form of casual gamers, but it also never proved the tablet even to its dying days is still not doing it. Yeah, the",
            "start": 5220.08
        },
        {
            "text": "that it didn't have the success that the Wii did financially and with the new form of casual gamers, but it also never proved the tablet even to its dying days is still not doing it. Yeah, the fact that we're getting Star Fox and it's trash and that was the game that was supposed to use the tablet. It's like it's just so infuriating. And I this is the big hope for me is that Nintendo doesn't do this again where you need to have a cool idea to use the different tech before you just make the different tech and be like, \"Oh, we'll figure it out later.\" Yeah. Cuz you're not going to have the time to figure it out later. And if you don't have it figured out, guess what? The other people aren't going to understand at all. Players won't understand it or want it and developers won't want to make for it. So the argument about the um the that there's not enough Nintendo fans to support it, whatever. It's like the the proof is in the pudding in terms of like that is obviously happening",
            "start": 5254.4
        },
        {
            "text": "to make for it. So the argument about the um the that there's not enough Nintendo fans to support it, whatever. It's like the the proof is in the pudding in terms of like that is obviously happening now with the Wii U. But the one thing about it is to the defense of the Nintendo and this argument that you know Nintendo fans weren't there to support it. There clearly aren't enough. I think even Nintendo, this is the this is the console where Nintendo fans even were like, \"I don't know, guys. This isn't doing what I want you to do.\" So, if it if the NX comes out and it's like, \"Hey, it's a Nintendo handheld TV thing, whatever, and it's mainly going to be supported by us and we're giving you Metroid, Zelda, Mario, Mario Kart, and then you go down that list and everybody's like, \"Okay, cool.\" Like, now we get it. And if you're making the if you're committed to gamers, we'll be committed to you. That's the big thing. Yeah. No, I mean, that's really it. And so in terms of what would I do, I",
            "start": 5299.04
        },
        {
            "text": "Like, now we get it. And if you're making the if you're committed to gamers, we'll be committed to you. That's the big thing. Yeah. No, I mean, that's really it. And so in terms of what would I do, I would make sure that it's a it's a handheld system that is powerful enough that it's not a joke. Yeah. Um and it's it's weird because it puts in in the place of like I can't believe that we're now talking about this as if it's a good idea cuz it's like that's like talking about the VA 2. Like, is that a good idea? No, it's not a good idea. Why is it a good idea for Nintendo? Cuz they're Nintendo. I don't know. But they're Nintendo. That's the whole thing is like if I I like when you talk about it being the VA 2 like don't get me wrong I see that and I I you know I wish the VA 2 would be this or whatever but really what the fact of the matter is it wouldn't be because it's not going to be bringing the PlayStation 4 and the VA together. This is Nintendo. Hopefully, if they market it right",
            "start": 5340.0
        },
        {
            "text": "or whatever but really what the fact of the matter is it wouldn't be because it's not going to be bringing the PlayStation 4 and the Vita together. This is Nintendo. Hopefully, if they market it right, being like, \"Cool guys, this is the unit. This is the machine. This is what we play. This is the Nintendo.\" Yeah. And I hope they That'd be awesome if they call it that. That would be so cool. This is the Nintendo and this is what you're making. I would cry. I would literally cry if I'm in that room and they're like, \"It's called the Nintendo.\" Yeah. Yeah. Let's introduce you to the all new Nintendo. Yeah. Yeah. It's like if they if they give me that lineup of games and like show me a future that I'm looking down the barrel at and I'm like, \"Oh my god.\" And I mean like and think about like I mean just it'd be so easy to be like this the this is the new all new Nintendo right and they're like all right cool everything on the eShop is available to play here. Every DS game everything",
            "start": 5378.64
        },
        {
            "text": "like I mean just it'd be so easy to be like this, the this is the new all-new Nintendo right and they're like all right cool everything on the eShop is available to play here. Every DS game everything you that you let's say you missed the DX game you can play it here. I don't know if it's possible to bring Wii games over but s you know similar things. We're and we're or we're re-releasing Mario Kart 8 and we're releasing Smash and we're doing all these things. Man, see that that to me is where we're going to get into some issues here because the the the overhyping like it's so funny because I gaff every night and especially recently there's been a lot of NX threads popping up of different different things and a lot of people are talking about how um a lot of people are positive about the NX or a lot of people are being negative about the NX or this and that. People have opinions. It's what the internet's for. Yeah. But I think the difference here is that we're getting dangerously like",
            "start": 5413.76
        },
        {
            "text": "or a lot of people are being negative about the NX or this and that. People have opinions. It's what the internet's for. Yeah. But I think the difference here is that we're getting dangerously close to no one. I mean, we're already there where no matter what the NX is, it's not going to be this magical **** thing that changes your life. But it's like I feel like with what's leaking now, it it's setting at a more realistic thing of like what we're talking about is not revolutionary like um it's not the Bible. Yeah. You know what I mean? This sounds possible. And I think that's the most important part is that it sounds possible for Nintendo to do this and succeed doing it. This can excite people. This can get people on board and it can be good in all those ways. But we are doing the thing where we're we're no man's sky-ing it to an extent, right? Where we're sitting here. I'm saying what and they say every year that's that's what the point that I'm",
            "start": 5455.52
        },
        {
            "text": "those ways. But we are doing the thing where we're we're no man's sky-ing it to an extent, right? Where we're sitting here. I'm saying what and they say every eop that's that's what the point that I'm building to here is it's like all this stuff about it being a portable thing and they're only using this the Nintendo and whatever all that's possible. A couple weeks ago talking about oh there might be a trophy system that there might be. Are you talking about all the the virtual console games being available? That's where we're going to get disappointed. To me, all that stuff is optional is not the right word because I don't think it's optional. I think it is a failure on their part to not have those things. Having said that, I do not think that they go without saying and I think that uh having them is just going to make me go yes. Not having them is just going to make me god damn it, Nintendo. Right. You know, but it's it's that is where the No Man's Sky hype comes into it. It's like",
            "start": 5497.84
        },
        {
            "text": "them is just going to make me go yes. Not having them is just going to make me god damn it, Nintendo. Right. You know, but it's it's that is where the No Man's Sky hype comes into it. It's like that's it scares me because Yeah. What would I do with the system? Come up with a Netflix style subscription where you pay. You can play all the **** Nintendo games. Yeah. Trophy systems. All the stuff's in there. Go for it. Here's a release schedule for the next year of the games you're playing. Here's some ideas of titles that are going to be coming next year. Thank you. Here's all the NX games that we're going to uh port over and the Wii U games. Yeah, sorry. That's what I meant. The Wii U games we're porting over to Nintendo Switch. Um, and like how they're going to work, what enhancements they're going to have, all this **** Yes. Thank you. Please just do that. It's all I need. Yeah. Moving on. And also, here's Mario Golf. And Mario Golf at some point. And we're going to finally release the Drybrough",
            "start": 5535.52
        },
        {
            "text": "to have, all this yes thank you please just do that it's all i need yeah moving on and also here's Mario Golf and Mario Golf at some point and we're going to finally release the Dry Bones amiibo it comes with every NX but dude see that's the thing Mario Golf would not not be an afterthought you know yeah like it's not like oh do we do it on Wii U or 3DS now it's we're just doing it for this one system we're also getting the Metroid game here Pokemon is no longer the Oh we're waiting for a console Pokemon guess what this is the console Pokemon this is what we've always wanted yep it could be it could be it could be revolutionary for Nintendo it could be amazing yeah um i hope it is me too if One Track Gamers wants to know \"if you were given a chance to make a video game documentary what would it be about\" that's a great question uh immediately i think of Hajime Kojima here with him his his rise and fall at Konami and then getting out on",
            "start": 5575.6
        },
        {
            "text": "to make a video game documentary, what would it be about?\" That's a great question. **** Uh immediately I think of Hideo Kojima here with him, his rise and fall at Konami and then getting out on his own. That'd be great. just the Kojima story, but if you could get Konami to talk about what happened, find out what's happening there. Then you go to I'm just, you know, the headlines we always talk about uh the Naughty Dog stuff with Amy Hennig and Neil Druckmann and Bruce Straley and all that stuff. What really happened? Everyone on the record, this is what happened. What was Amy's Uncharted going to be? You know, I mean, how much time did they what did they scrap? How did they keep it? Talk to the actors who have left like that Alan Witcher guy, right? You know, he talked about leaving and how they had to go and Todd Stashwick and all this stuff. Find out everything that's happened there. Um, what do you got? I don't know. I feel like like that's obviously, but I feel like you you need to tie it to",
            "start": 5621.92
        },
        {
            "text": "Go and Shigeru Miyamoto and all this stuff. Find out everything that's happened there. Um, what do you got? I don't know. I feel like like that's obviously, but I feel like you you need to tie it to to something that is relevant um on a broader scale and I can tell that that personal story. So that's why I think Hideo Kojima makes a lot of sense. I think that uh obviously Miyamoto in in a bunch of different regards makes a lot of sense. I think the Uncharted thing needs a different angle. That that's like a 30 for 30. That's like a very that's not like we need to make a documentary movie documentary like I mean console wars would make a sick ass documentary. Well, they're supposed to be doing that, right? Isn't that the thing they've been working on? Yeah. But I also think there's a lot of you can pick so many different um points in Mario games that I think would be really interesting. But I would love to see a documentary about the the console wars the next generation. So PlayStation 1 versus",
            "start": 5659.12
        },
        {
            "text": "pick so many different um points in Mario games that I think would be really interesting. But I would love to see a documentary about the console wars the next generation. So PlayStation 1 versus Sega Saturn versus N64. I think there's a really interesting story there. And I'd love to see footage of Mario 64 at E3. Oh yeah. Yeah. And stuff like that where it's like how did people react to seeing this for the first time? We always we all have all our memories, but like that's such a a weird forgotten time where people didn't have access to cameras on their phones everywhere they went. Um and E3 wasn't live streamed and like all that stuff. So I think that E3 in general if you I mean like it would be easier if the and this sounds horrible, but if E3 ended then do a documentary about it. Yeah. I mean, like Greg used to be in Atlanta and all this crazy weird **** and Vegas and all these things and like it was like, you know, the afterthought of CES and all these different It's",
            "start": 5694.4
        },
        {
            "text": "It. Yeah. I mean, like Tim Gettys used to be in Atlanta and all this crazy weird stuff and Vegas and all these things and like it was like, you know, the afterthought of CES and all these different It's like I'd love to talk to see how that progressed to where it is now. E3 that's my money's on that. That's a really good call because there's there's interesting stories there and there's so many moments that you can use as the kind of like touchstones to to build everything. Yeah. There you go. Open on the what was it? The uh **** was it Gamecock? What was the the stupid uh publisher? I think it was Gamecock, right? That did the funeral for E3 at the Santa Monica E3. Like a bunch of **** All right. Damn. Start there and then have it be like dial it back to that point and then show it come back and to where it is now. That's awesome. Jared 007 says, \"With Crash Bandicoot Remastered, can Sony do it to Spyro as well or no, because Activision already messed up Spyro?\" I I don't think that I mean",
            "start": 5742.8
        },
        {
            "text": "back and to where it is now. That's awesome. Game Informer Greg says, \"With Crash Remastered, can Sony do it to Spyro as well or no, because Activision already messed up Spyro?\" I I don't think that I mean I'm not going to get into did they or did they not mess up Spyro. I don't think that this affects the likelihood or quality of Spyro 1 through 3 a trilogy being uh remastered or not. I think that the if the Crash one does well, I think it's almost for sure we'll see a Spyro one. The thing about the thing about it like the Crash one is like man, people talk and ask for that Crash one. I never hear people asking for the Spyro one, but they will once they place Crash if they do. I don't think they will on that number. But I'm with I understand. All I'm saying is you're right. Everyone's talking about Crash, everyone's only talking about Crash because people are talking about Crash. And I think that now that Crash is announced, you will not see a single video about that, about Crash without some",
            "start": 5784.96
        },
        {
            "text": "Crash, everyone's only talking about Crash because people are talking about Crash. And I think that now that Crash is announced, you will not see a single video about that, about Crash without some comments being like, \"When's Spyro coming?\" So, it's like I think it's uh you give the mouse a cookie. They're going to want more. And so, it's going to go from there. I do think that there there's a chance. Uh I I love Spyro, the the games, the one through three. I'd never beat Year of the Dragon. Um that got a little the Crash Bandicoot game that no that kind of um Sonicked the like Sonic Adventure it for me where it's like you're giving Spyro a bunch of friends that I don't want to deal with right now. Let's stop. But Spyro one and two definitely have very fond memories playing those games. But I I wonder how they hold up cuz they were a bit more open. I'm an idiot. Uh oh. Because I was just about to say instead of if if the Crash Bandicoot remaster does well, please don't go into the comments and",
            "start": 5831.28
        },
        {
            "text": "wonder how they hold up cuz they were a bit more open. I'm a **** idiot. Uh oh. Because I was just about to say instead of if if the Crash Bandicoot remaster does well, please don't go into the comments and say, \"Can I please have a Spyro remaster collection?\" Ask for a Patapon remaster collection, which was a trilogy. A true trilogy with no spin-offs that got better and better as it went gameplay-wise. Yeah. I wouldn't say it's the greatest trilogy of all time. I'm not crazy, don't get me wrong. I'm just saying like I should I should have You're a trilogy. So, all the comments on that breakout video are going to be like, \"Oh, Greg didn't say Patapon.\" **** you, man. **** you, man. Don't know how to live my life. Curtis Zinger aka KG Zing on Twitter says, \"I'd love to hear you predict a future where PSVR commercially bombs.\" Okay. What's the impact on the PS4 NeoSony? Uh, Neo, who the hell knows? I mean, I think Neo will be fine regardless if it's going to be if it's if it's framed around 4K",
            "start": 5874.08
        },
        {
            "text": "PSVR commercially bombs. Okay. What's the impact on the PS4 NeoSony? Uh, Neo, who the hell knows? I mean, I think Neo will be fine regardless if it's going to be if it's if it's framed around 4K and better performance. I mean, Neo is such an easy sell. Such an easy sell. Your games will load 20% faster. They will download a little bit faster. They'd It's $50 more. Okay, great. I don't none of this. Colin's not here to be like, \"It's a middle finger to gamers.\" Everybody can stop being babies about everything. If if it if you just bought your PS4, that was a weird thing to do when you heard about the rumors of Neo. And also, do you care that it's 20% faster? Do you even know the difference? You waited this long to buy a PS4. Uh, PlayStation VR could be a huge, huge **** problem for PlayStation. Uh, will it? I don't know. I hope not. I do believe in VR in terms of this and what they're doing, the way they're talking about it. I think the people who have bought the pre-orders for",
            "start": 5919.52
        },
        {
            "text": "PlayStation. Uh, will it? I don't know. I hope not. I do believe in VR in terms of this and what they're doing, the way they're talking about it. I think the people who have bought the pre-orders for PlayStation VR, you guys out there, because I know you all talk about it to us all the time, I think you were all on the right page. This is a very No Man's Sky thing again of like our expectations are we're going to get a bunch of weirdass experiences and maybe in a year, year and a half we're getting closer to a game because the whole thing that's going to happen is you're going to get this, you're going to play around, you're going to tinker with a whole bunch of different experiences and you'll all be done with them in 15, 30 minutes, an hour or something like that and you'll put it down and then a friend will come over and they'll put it on, they'll get excited and this will happen. Da da da. But all these things we are, if you're buying PlayStation VR, you are the tip of the spear.",
            "start": 5962.68
        },
        {
            "text": "and then a friend will come over and they'll put it on, they'll get excited and this will happen. Da da da. But all these things we are, if you're buying PlayStation VR, you are the tip of the sword and you are you are wave one of the beta testers of VR where every developer has to start taking we we all have to learn how to play games again. We all have to figure out how not to get motion sick, what works, what doesn't, what a control scheme should feel like, what it shouldn't feel like. And that feedback is getting translated to developers who are then hopefully working on the next things. A a a prediction of how this looks. It's PlayStation Move. It comes out, the games are underwhelming, nobody, we all bought a bunch of them in the beginning, sure, and then nobody buys anymore and developers run from it and don't want to develop for it. And I think the fact that you have three incredibly viable options right now for VR mean that developers are going to do it, but it is going to be",
            "start": 6002.16
        },
        {
            "text": "Run from it and don't want to develop for it. And I think the fact that you have three incredibly viable options right now for VR means that developers are going to do it, but it is going to be that whole thing of like the game I'm most concerned about being a huge bomb is Resident Evil 7. I think the fact that everybody's gotten sick playing it, the fact that you can play it without the VR, these are red flags for me. And the fact that everyone you talk to about VR, it needs to be built from the ground up for VR. You can't tack it into another game. You can't do something with it. The fact that people are getting motion sick tells me that's probably a big problem for it. And the fact that I think everyone's going to get it and be like, \"Yeah, a real game for VR.\" And put it on and be like, \"Oh, this is not I can't do this. This isn't what I I think it might be cart before the horse and the fact that like, hey, let's put out a real game, but we don't know the rules yet. We have to go and",
            "start": 6038.08
        },
        {
            "text": "this is not I can't do this. This isn't what I I think it might be cart before the horse and the fact that like, hey, let's put out a real game, but we don't know the rules yet. We have to go and learn so much about PlayStation or VR in general. So, the prediction, yeah, would be is a PlayStation Move thing. It would bring profits down, but again, you know, PlayStation as a brand just accounted for 76% of the profits for this quarter or whatever for Sony overall. So, that number comes down, sure, but they're still making hand over fist money on the PlayStation 4. That's I'm in the same boat where I don't think that I think that it's going to to fail overall in terms of it not being a huge success. I think that is the the marker for um how this does. Uh I but I think that it's not going to affect them too much. I think they know that going and that's and I think the success would be a surprise to them, right? And that's the big thing with me where I I know I keep banging this drum",
            "start": 6073.92
        },
        {
            "text": "affect them too much. I think they know that going in and that's why and I think the success would be a surprise to them, right? And that's the big thing with me where I keep banging this drum and saying the same thing, but Shuhei talks about it being Gen One PlayStation. They know they have a lot to learn. I feel like the fact that it is sold out, you can't get pre-orders anymore. It isn't because millions came out to pre-order. It's because they put out a limited amount of these cuz they're setting their expectations where they need to be. And gamers just need to do the exact same thing. And that's I think that's smart. I mean, obviously, it's an investment. They are putting a lot of money into this and trying to see where it goes and what it can be. And I talk about this all the time with Nintendo, but Nintendo uh with the Wii U and the Wii and all that stuff. All that innovation is just a gimmick that succeeds. That's it. And if it doesn't succeed, it's a gimmick. The Wii U",
            "start": 6115.36
        },
        {
            "text": "time with Nintendo, but Nintendo uh with the Wii U and the Wii and all that stuff. All that innovation is a gimmick that succeeds. That's it. And if it doesn't succeed, it's a gimmick. The Wii U could have been one of the biggest innovations ever, but it wasn't. The Wii could have been, but it wasn't. I mean, yeah. It No, I mean, you know what I mean? At the end of the day, we're looking back at it and we call it a gimmick. We don't call it waggle. Yeah. So, it's that if they had figured it out, had they found that game that one year down the line, we're going to get a lightsaber game or whatever, then it would have been the greatest innovation of all time. I think VR is the same thing and specifically PSVR - it is a gimmick. You need to go into it thinking it's a gimmick and if it happens to succeed then it's an innovation and then it's going to be super awesome and great but until then whatever it's going to be very similar to the Oculus Connect where they pushed it and now",
            "start": 6148.48
        },
        {
            "text": "happens to succeed then it's an innovation and then it's going to be super awesome and great but until then whatever it's going to be very similar to ReCore where it was out they pushed it and now the Xbox One S is out and it doesn't have a thing for a big thing and a call back to our topic one right is I play Abzu am I saying right Abzû? Abzû, I keep feeling like I keep I'm so bad at pronunciation that I feel like that's not right uh I'm playing it I'm not enraptured with it I'm checking my phone. I'm talking to Portillo. I'm doing all these different things. I still feel that for me as a personal when I get my VR unit, PlayStation VR unit, I'm going to use theater mode a lot. And I really think that is going to change the way I play games in the way of oh, Abzû's two and a half hours. Sure. Boom. Headphones. And suddenly I'm playing on a movie theater this brilliant, beautiful game. And it's as you know, it's as big as as if I'm playing in a theater all by myself. And suddenly that",
            "start": 6187.68
        },
        {
            "text": "Boom. Headphones. And suddenly I'm playing on a movie theater this brilliant, beautiful game. And it's as you know, it's as big as if I'm playing in a theater all by myself. And suddenly that changes how I ingest games because that's, you know, we talk about all the time or I talk about all the time, right, of like I love The Walking Dead. Oh my god, I my Sundays I start getting excited. I'm going to make food, then I'll go over the DVR and I'll watch it. And so many episodes I'm watching and I notice myself uh checking Twitter and do I'm like, wait, why I've been looking forward to this all day. Stop, stop, stop. And you got to focus. You got to focus. You know what I mean? When suddenly I can use this to lock out everything and not have to worry about if somebody's texting me or if you know, whatever. You know, that's going to be different for me. And I really feel like I know Colin is the he's always like the theater mode doesn't matter. It's not blah blah. I think it's",
            "start": 6232.0
        },
        {
            "text": "if you know, whatever. You know, that's going to be different for me. And I really feel like I know Colin is the one he's always like theater mode doesn't matter. It's not blah blah. I think it's going to matter more than people think cuz I think what's going to happen is you're going to spend $300 on this headset and you're going to play these experiences and then it's going to sit there and you're going to be like, \"Fuck, did I waste my money on that?\" And if it didn't have theater mode, if it didn't have a way like, you know, I'm really I'm I'm really in like, you know, again, No Man's Sky would be a game I would love to boom boom and just play and be left in that world and not have to worry about what's going on around me. Like uh sensory deprivation chamber. And when you talk and when you're talking about games that are therapeutic and relaxing, I feel like that's a big part of it. Yeah, I I agree with I'm somewhere in the middle with the two things where it's like I I think",
            "start": 6266.56
        },
        {
            "text": "when you're talking about games that are therapeutic and relaxing, I feel like that's a big part of it. Yeah, I agree with me somewhere in the middle with the two things where it's like I think that the theater mode is very important, but that's not a selling point. I think that that I don't think it's a selling point. It's a thing for the people that have it that use that because um you know, you can it it's all just thing about making your life a little bit better. All the things you're describing, that's such a personal thing to you. Granted, a lot of people deal with that same that same thing, but it's like that's the equivalent to like I'm not going to play games unless I have this TV or these headphones I'm using. And I need a very specific way to play games. Like lights need to be a certain way, whatever, or else I feel distracted. I feel like it's taking away from the experience I'm having. So yeah, like anything if you care about games that much, it's",
            "start": 6301.6
        },
        {
            "text": "Like lights need to be a certain way, whatever, or else I feel distracted. I feel like it's taking away from the experience I'm having. So yeah, like anything if you care about games that much, it's going to be great for you because you're gonna have just more options to play games a way that you might prefer. Yeah. You know, and if you do prefer that way, then all of a sudden VR is going to be great. But that's the thing of will it succeed or will it not? We'll see. Yeah. I think that the the answer is no. They need to prove yes, you know, and uh I don't think that they will, but I think that they're okay with that. So I don't think it's going to affect Neo at all. And that's the whole thing with with wave 1 PlayStation VR. I do think yeah, they're totally okay with it not setting the world on fire. I think that they know that that's not going to happen and it is that they're hoping wave 2 is bundled with PlayStation 5 or does this and does that and there's some, you know, thing",
            "start": 6337.76
        },
        {
            "text": "world on fire. I think that they know that that's not going to happen and it is that they're hoping wave 2 is bundled with PlayStation 5 or does this and does that and there's some, you know, thing there. Yep. Yeah. Ladies and gentlemen, this has been the first ever episode 80 of the Kinda Funny Gamescast. Kinda Funny Datecast. Yeah, we had FroYo. What's your FroYo? Is that how the **** you like that? Oh, okay. Good. I thought you saying you're going to **** me like that. I was like, what? Oh, I'm going to **** him like that. No, this Datecast got way too see you later. Bye. I love you.",
            "start": 6374.48
        }
    ]
}