{
    "id": 358,
    "video_id": "oftjijhP-fs",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Superfight: How to Play Skybound's Card Game (w/ The GameOverGreggy Show)",
    "description": "Here's how to play the newest card game guaranteed to make you fight with your friends.\n\nDarin Ross created a new card game, and Robert Kirkman's Skybound Entertainment partnered with him to get it to the masses. \n\nGet Superfight here: http://www.superfightgame.com\n\nGet Skybound here: http://www.skybound.com/\n\nGet the GameOverGreggy Show...\n\nFull Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1406413800,
    "duration": 151,
    "transcript_chunks": [
        {
            "text": "What's up everybody? We're the cast of the Game Over Greg Show and we're going to show you how to play Skybound Super Fight. You pick a character, you become that character. Skybound like Robert Kirkman. Skybound, right? The comics guy. Okay. I want to play as Kirkman. I got D on that. No, no, you draw a white card and then that's the character you Oh, yeah. I'll do that, too, but I still want to play as Kirkman. All right, then. I'm going to be Daryl from The Walking Dead. That's way cooler. I call that too late. Anyway, one player draws three white cards and three black cards. The player to the left does the [Music] same. Each player chooses one white card and one black card to create a fighter. They put them face down on the table and then discard the rest in color-coded piles. The players flip their cards and each draw one more black card to create their fighter. Then they argue about who would [Music] win. Hermione is a master wizard. She'll cast a Mobulus and Bieber will be",
            "start": 0.88
        },
        {
            "text": "players flip their cards and each draw one more black card to create their fighter. Then they argue about who would [Music] win. Hermione is a master wizard. She'll cast a Mobulus and Bieber will be immobilized. That's not a wand. That's a nightstick. She won't be able to cast crap. Bieber is going to keep taking selfies while he's digging her grave. Her clothes are way too tight. Bieber's not going to be able to focus on anything else. That's a good point. After some arguing, the table votes. Hermione. Bro. Bieber. I vote Hermione. And there you have it. Hermione wins. Wait, Greg, you didn't vote. Dude, Bieber sucks. One point to Gryffindor. Anyway, Hermione stays on the table and then the next player to the left draws three and three. [Music] assembles a fighter and draws another black card to see if he can take down the girl wizard. I'm picking invincible. And I don't even care that he's pregnant cuz he's going to smush Hermione's head with that Viltromite strength. She's a wizard,",
            "start": 45.24
        },
        {
            "text": "to see if he can take down the girl wizard. I'm picking invincible. And I don't even care that he's pregnant cuz he's going to smush Hermione's head with that Viltromite strength. She's a wizard, dude. I've read Invincible. Mark's going to smash her head in like 2 seconds. Totally. And it goes on like this. If a fighter wins three times, he or she is retired and the player redraws a card. But what if there's a tie in terms of votes? Then we'd each draw one white card with no attributes and decide who wins. But how long do you play for? Until you hit the number of points you all decided on beforehand. Is it weird that I'm attracted to you in that vest? No. That's the power of Norman Reus. That's Robert Kirkman's Skybound Present Super Fight. But what do you think, ladies and gentlemen? Let us know in the comments below. Check out the game's website and make sure you keep coming back here every day for nerdy conversations on Game Over Greggy. Until next time, rest in peace, Tea Dog.",
            "start": 92.68
        },
        {
            "text": "Let us know in the comments below. Check out the game's website and make sure you keep coming back here every day for nerdy conversations on Game Over Greggy. Until next time, rest in peace, Tea Dog. [Music]",
            "start": 133.92
        }
    ]
}