{
    "id": 2277,
    "video_id": "8vB4qzuqD3k",
    "show_name": "Announcements",
    "hosts": [
        "Greg Miller",
        "Joey Noelle"
    ],
    "title": "Kinda Funny Day Announcements 2017",
    "description": "Kinda Funny just had its second birthday, so let's see what the boys have up their sleeves for 2017.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1483661874,
    "duration": 202,
    "transcript_chunks": [
        {
            "text": "What's up everybody, I'm Greg Miller, and Kinda Funny just turned 2 years old. So on January 5th, the annual Kinda Funny Day, we announced a whole bunch of stuff for the company, and I thought I'd give you this video to recap it all. 2017 is all about Community - the first two years were amazing as we built this thing, but now it's time to really focus on what makes us special, and that's you. As such, we're implementing a lot of the stuff you've been asking for. First and foremost, we've hired Kinda Funny's best friend Joey Noelle to be our community manager. We know that we weren't great at communicating with you in 2016, and we think Joey's the answer - she can keep you in the loop on what's going on with Kinda Funny when it comes to events, streams, and so on, and she can keep us up to date on what's happening on your side of the screen. She speaks for us, and she speaks for you. Next, we're making a lot of changes to Patreon - most excitingly, we're going to finally have private RSS feeds, so you can get",
            "start": 0.2
        },
        {
            "text": "on your side of the screen she speaks for us and she speaks for you next we're making a lot of changes to Patreon most excitingly we're going to finally have private RSS feeds so you can get early episodes in exclusive podcasts delivered to your phone with fewer hoops to jump through we're bringing our file sizes down the live Q&A is becoming an AMA video powered by your comments and we're adding a $2 tier that gives you a chance at winning a video game every day now we're also giving up on the old Patreon milestones we hit the ones about Let's Plays detailing the history of PlayStation and Mario why because we're listening to you those aren't the kind of videos you want from us when we put up that Battlefield one multiplayer video you all scream that that was the kind of fun let's play video you wanted from us and we listened as such our next announcement is Major we're hiring a full-time editor we have a person in mind we're finalizing the deal so we are still a ways out but for now",
            "start": 38.76
        },
        {
            "text": "You wanted from us and we listened, as such, our next announcement is Major. We're hiring a full-time editor; we have a person in mind, we're finalizing the deal, so we are still a ways out, but for now all I can tell you is we want to generate those fun let's plays as much as you do and we're well on our way. Speaking of being on our way, we finally have a rhythm with Kinda Funny: The Animated Series last year. We asked for your help to make 12 episodes; you over-delivered, and we thought the show would be monthly. Well, it turns out making a cartoon is really, really hard and time-consuming. We spent far more money on this show than we made fundraising for it, but that's okay because we believe in it. What's not okay is that we fell behind and didn't deliver monthly like we wanted to. We're back on track now, but to make up for the complications, we're going to do three bonus episodes this year as a way of saying thank you for all of your support. Next on the docket is Colin and Greg Live.",
            "start": 78.84
        },
        {
            "text": "on track now, but to make up for the complications, we're going to do three bonus episodes this year as a way of saying thank you for all of your support. Next on the docket is Colin and Greg Live, our Twitch show - it's dead; rest in peace. But Rising From the Ashes is The Kinda Funny Morning Show. It is the same nonsense, the same garbage truck on fire, but now it's named appropriately so that Nick and Tim can be even bigger influences on it. On top of that, we've listened to your feedback and are going to continue broadcasting the show live on Twitch, but also post it to YouTube and as an audio podcast each and every day in our continuing effort to communicate with you. Because we talked about that all right. This is going to be a gradual process with bumps along the way, but it's where we're headed. Just the podcast - it takes longer to get a podcast up than you think it would; I don't understand either. But also, we're getting rid of the prize box. We're giving you a video game every day.",
            "start": 119.6
        },
        {
            "text": "headed just the podcast it takes longer to get a podcast up than you think it would I don't understand either but also we're getting rid of the prize box we're giving you a video game every day we'll talk about that on the show though anyways we've shortened our ads Colin was right is now a weekly show and Sweet Baby G Kinda Funny Live too is available now on Patreon for anyone that supports us and will be up on YouTube in February that is just a TI tip of the iceberg for what Kinda Funny has in 2017 we have new show ideas we're planning Kinda Funny Live three and you can bet your ass they're going to be more surprises to come ladies and gentlemen thank you all for the most amazing and rewarding two years of my life I'm excited to see where the next 365 days take us but not until next time it's been my pleasure to serve you",
            "start": 156.84
        }
    ]
}