{
    "id": 2325,
    "video_id": "nG9iuf1O1lI",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "La La Land and Fast Food Mascots- The GameOverGreggy Show Ep. 163",
    "description": "We discuss the ethics of CG facial reconstruction, fast food mascots, the weather, and La La Land. (Released to Patreon Supporters 01.13.17)\n\nThanks to MVMT Watches for sponsoring this episode. Go to http://www.MVMTwatches.com/greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1484931299,
    "duration": 6637,
    "transcript_chunks": [
        {
            "text": "this episode of the GameOverGreggy Show is brought to you by MVMT Watches, MVMT Watches was founded on the belief that style shouldn't break the bank, the watchmaker's goal is to change the way consumers think about fashion by offering high-quality minimalist products at revolutionary prices with over 500,000 watches sold to customers in more than 160 countries around the world, MVMT Watches has solidified itself as the world's fastest growing watch company, MVMT Watches started just $95 now at a department store, ladies and gentlemen you're looking at 400 to 5 00 bucks, movement figured out that by selling online they were able to cut out the middleman and the retail markup providing the best possible price classic design quality construction and stylized minimis over 500,000 watches sold in more than 160 countries did I say that I did right now you can get 15% off with free shipping and free returns by going to MVMTwatches.com Greggy that's mvmtwatches.com Greggy this",
            "start": 0.04
        },
        {
            "text": "Sold in more than 160 countries. Did I say that right now? You can get 15% off with free shipping and free returns by going to MVMTWatches.com/Greggy, that's MVMTwatches.com/Greggy. This watch is cool; you've seen me talk about it before - a black face, red hands, black band. I look awesome. So, it's time to do it, ladies and gentlemen: step up your watch game. Go to MVMTWatches.com/Greggy, MVMT, join the movement. What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside our producer Nick Scarpino. Hi, hey! Now, what's this going on over here? You got some... you got some smudges. I don't know; God knows. Is this one of the Kevin Hart shirts? No, I don't know. This might be yours; you never know where you get that stuff from. You're like a cat - sometimes you know my old man's spatial awareness just kind of falters on me, and I just slam into things. I keep going; this might be the wall, could be.",
            "start": 43.12
        },
        {
            "text": "a lot of things do you're like a cat put your sometimes you know my old man spatial like awareness just kind of falters on me and I just slam into things I keep going this might be wall could be cobweb sure who hell knows what it is well you came in looking like a drowned rat today dude I got it got I got dumped on man it it is like storming outside seriously I think we might talk about that later over here the couscous magnet call Colin Moriarty what does that mean I don't like this whole new thing that you're doing 2017 name you ever heard of Couscous? I've heard of Couscous many times but I don't understand this new naming you had it many times yeah so you'd say you're drawn to you over there the pure one Tim Gettys Couscous is an inanimate food keeps coming to you though apparently lots of times you've been magnetized magnet it's not magnetized I need this weekend to come really bad cuz of football football is that going to help you you think I don't need help I'm",
            "start": 121.48
        },
        {
            "text": "apparently lots of times you've been magnetized, it's not magnetized. I need this weekend to come really bad because of football. Football is that going to help you? You think I don't need help, I'm fine. I just last year's or last week's football games was terrible so I need you know. Do you think these would be better? I hope so. You don't know. Saturday and Sunday yeah me couch underwear Tim you couscous mag where it where did it come from cuz yesterday you guys recorded PS I Love You in the other room I heard this yeah you gave him some other weird ass name I'm 2017 Converse Champion or some **** no tight socks tight sock m whatever about it yeah but I understand that you look down he has tight socks. You give him that couscous magnet yeah his hair kind of reminds me of couscous I could see that short grain I can't see it I looked up to look at my hair but it's but the hair moved back cuz it's on your hair looks good your hair looks good your hair looks good my hair looks great today",
            "start": 166.24
        },
        {
            "text": "that short grain I can't see it I looked up to look at my hair but it's but the hair moved back cuz it's on my your hair looks good your hair looks good your hair looks good my hair looks great today we're having quite a good show right now ter no I like it I like it when it's like this I I got to get a cut how how short you going to go this time the regular amount of shortness you've been going you going to get the the beard trimmed up too yeah I just feel like I'm getting La can we go together this time I want to go to this haircut place I'm probably going go tomorrow before I come here for the gamescast full bunch of men there I hear there are a lot of men yeah just a lot of men my dude left though oh no Jesus he's no longer there so I had to go I had another guy named  Lis now have you asked them to do like a traditional Barber cut on you so instead of instead of just cutting it down short have them do like a little bit of fade on the sides just little more di that requires",
            "start": 208.76
        },
        {
            "text": "you asked them to do like a traditional barber cut on you so instead of just cutting it down short have them do like a little bit of fade on the sides, just a little more than that requires maintenance. But I don't, I don't have people ask that question, I'm like, \"do you not understand what's going on here?\" It doesn't fall or fold or sit on it, it's just there, it's like sheep's wool, it's ridiculous, it's a ridiculous head of hair, it's so thick. But I like it when you do what you just did to where you get a little bit and just got all these different edges now, you know what I mean? It's like a broke down anime character. I really think you could style that, I think you just gotta go to the right guy and he has to help you, got to believe they have to help you like get it to a specific level. I think it's more what Tim saying is that the belief factor, it's also the interest factor and the caring factor, understand both are precipitously low on this",
            "start": 247.92
        },
        {
            "text": "help you like get it to a specific level I think it's more what Tim Gettys is saying is that the belief factor it's also the interest factor and the caring Factor understand both are precipitously low on this you don't need to care much though you let the bar all you need is the side yeah the bar the barber doesn't even need to care much trust me I know you got such a good hairline what I like about it is it's just got all these dips and curves to it like a planet it's just this **** like a beat up captured asteroid roaming around Saturn right now Miller's if you didn't know ladies and gentlemen this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic discussion for your amusement if you like that head over to patreon.com kind of funny where you can get every show early along with a bunch of exclusive perks goodies and right now if you're giving us a dollar or more exclusive access to Kinda Funny Live 2 if you have no",
            "start": 287.52
        },
        {
            "text": "of funny where you can get every show early along with a bunch of exclusive perks and goodies, and right now if you're giving us a dollar or more, you'll get exclusive access to Kinda Funny Live 2. If you have no bucks to toss our way, no big deal - head over to youtube.com/kindafunny where we put the entire show up topic by topic day by day until it goes up as one big video and MP3 the following Friday. Nick, yes, what's your topic? Uh, my topic comes from Star Wars this time, it's uh, you know, no sand... um, unfortunately Carrie Fisher passed, so it begs the question, what do they do with Star Wars episode 8 and IX? Well, eight is done, nine should be considering doing something with her CGI like Tarkin in Rogue One. Yes, Rogue Legacy - definitely, you know, Rogue One I mean, spoilers... You Had Your Shot, it's like, what I mean people have seen it, anyone's watching the show it's been in other people's thumbnails by now, it's fine, you've seen it somewhere, um, so you know everyone thought it was cool.",
            "start": 331.72
        },
        {
            "text": "It's like what I mean, people have seen it. Anyone's watching the show, it's been in other people's thumbnails by now, it's fine. You've seen it somewhere. Um, so you know everyone thought it was cool. I thought it was a little uh, a little alarming. I don't necessarily like when they did this. I didn't care for it in Tron. Um, I didn't think it well, obviously the effect didn't work that well in Tron. I didn't see in I didn't see Tron so who was who in Tron: Legacy? They made Jeff Bridges younger, so his the villain was the younger version of him. It was it was a program but it looked like him. Um, and so when Jeff Bridges came in he had to fight himself which I was like that's cool but it didn't really work they couldn't I guess they didn't get the right team on it or there there was a lot of criticism it it was 2008 well it was but I guess they wanted the people that I the way I heard the story and I could be completely wrong was that the the Benjamin Button team that that did The Curious Case of Benjamin Button which was",
            "start": 380.8
        },
        {
            "text": "was 2008 well it was but I guess they wanted the people that I the way I heard the story and I could be completely wrong was that the The Benjamin Button team that did The Curious Case of Benjamin Button which was amazing was supposed to come on here but by that point there had been so many production delays that they lost the majority of the good guys so they had to kind of I guess they got the B team on it anyway it didn't work and it didn't unfortunately it didn't even need to be that they could have just had someone that looks like Jeff Bridges be that character or a completely different actor be that character and I think it probably would have been okay see I go a different direction I I disagree I don't think they could have just had a different actor I think that they could have just changed the plot so it didn't that's what I meant right I mean obviously that he was supposed to be like a fact assembly of I think that that's important now the one thing that I'll give Tron Legacy in",
            "start": 416.88
        },
        {
            "text": "the plot so it didn't that's what I meant right I mean obviously that he was supposed to be like a fact assembly of I think that that's important now the one thing that I'll give Tron Legacy in that regard is that since it is a they're inside a computer literally so I'm like I'll give it that it's not perfectly accurate and whatever what was a little more offputting to me was the Jeff Bridges stuff and like the flashback scenes and all that because then when you see what's supposed to be Jeff Bridges' character in real life and he looks exactly the same as the computer villain version that's when it was like a little bit weird to me and I feel like they could have cut that stuff out see I just feel like you I feel like we're just in uncanny valley right I feel like no matter what happens we are going we as human beings will never recognize that as real it just like not in our lifetime at least or not in the next 20 years so what do you do with the people who did think that Grand Moff Tarkin was",
            "start": 449.12
        },
        {
            "text": "We are going we as human beings will never recognize that as real, it just like not in our lifetime at least or not in the next 20 years. So what do you do with the people who did think that Grand Moff Tarkin was real? You line them all up outside... no, I'm just joking. No, like you can't do that on television. When that guy, remember the character on Star Wars, you can't do that. Intelligent, used to shoot everyone; it was like the Executioner, and then some guy would run on and say, \"Stop the execution.\" You guys don't... I for the record, you can't you can't do that on television. No, you can't do that on television. I loved it as a kid, but all I can remember is the slime in the lockers 'cause I was so young. I could tell that you were older than me; I know. I watch... I mean, watched it in syndication though. Um, sorry to interrupt with Tarkin. I can understand; I mean, a lot of people thought he was real, and that was great. It was done very well. Um, I still kind of feel the same.",
            "start": 487.68
        },
        {
            "text": "It in syndication though um sorry to interrupt with Darth Vader, I can understand. I mean a lot of people thought he was real and that was great, it was done very well. Um I still kind of feel the same way right? I mean I guess that Peter Cushing died a long time ago and hasn't been really in the public eye since. I mean I I can't remember him in other movies after you know A New Hope for the most part so you look at that and you're like, I guess that's sort of okay but I mean Carrie Fisher everyone knows Carrie Fisher. I just saw her in a film, you know, that documentary just came out with her and her mother. I just don't know if people are going to be able to see that as real and if it's not going to uh hinder the process or hinder the actual final so to bring everybody up to speed episode 8 is done they said her scenes are done her scenes are shot, done and she's she from what the report I heard read was or heard on the Colin Moriarty live show was the fact that uh it's her stuff's",
            "start": 530.76
        },
        {
            "text": "Is done, they said her scenes are done, her scenes are shot. Done and she's from what the report I heard read was or heard on the Colin Moriarty live or morning show was the fact that uh it's her stuff's done. She's not that big of a character but she was supposed to be a big character in episode 9 yeah so and you want I mean obviously they're talking about you know some of the things that people are speculating about is obviously she has to have some sort of scene with Kylo Ren, some sort of scene with Luke, some sort of scene with Rey. You know she's the leader of the Rebel Alliance or whatever they're calling it now, the 40-year-old team of people who really haven't been able to beat the Empire in 30 years. Um so I love you so much Nick well you know I mean like I know what you mean I'm talking about people have been around doing the exact same thing maybe it's time to change your tactics a little bit okay they're both pretty good job considering I got",
            "start": 570.08
        },
        {
            "text": "I know what you mean, I'm talking about people who've been around doing the exact same thing. Maybe it's time to change your tactics a little bit, okay? They're both pretty good jobs considering I got them all they let this smoke guy get in cut by you know \"Death By A Thousand Cuts\" exactly. Um, no, but I mean that, but it's disconcerting. What do you do? Obviously, that they're up against a conundrum - this is what I lovingly refer to as the Fast and Furious 6 conundrum, right or seven, excuse me, conundrum. Um, is that you don't know what to do? You can't not make the movie; you do that. I think there's a tasteful way to do it. You don't agree; you thought the end of Fast and Furious 7 wasn't... I think we're talking about apples and oranges here. I think if this was episode 8, and she was a main character there, and okay, we have to fill in a few holes like they did with Fast Seven right? I know we just said this, but anyway, because Paul Walker stuff - a lot of it was",
            "start": 611.56
        },
        {
            "text": "8 and she was a main character there and okay **we have to fill in a few holes like they did with Fast & Furious 7 right I know we just said this but anyways cuz Paul Walker stuff A lot of it was shot not all of it so then these body doubles and computers and stuff okay I'm talking about the end of Furious 7 specifically where they did the actual you think you go away without saying goodbye did you I think it's a case-by-case situation where it comes down to is it about the actor or is it about the character and I think that in the case of Fast and Furious that was a sendoff of the character but the reason they did the facial reconstruction stuff was to honor him to honor Paul Walker and his you so where does that leave us with Carrie though because she this is this is not to honor her this is because **we have all movie to make and I think that that's a totally different totally different scenario when it comes to Grand Moff Tarkin we've seen him in Rebels we've seen him in a whole bunch**",
            "start": 649.48
        },
        {
            "text": "because **** we have all movie to make and I think that that's a totally different totally different scenario when it comes to Grand Moff Tarkin we've seen him in Rebels we've seen him in a whole bunch of other um forms of media of Star Wars and I think Star Wars is something where these characters are the characters and be him seeing him as much as we did in Rogue one I like I said in the review thought unnecessary they could have like kept it a little bit more subtle but they obviously doubled down on it because they knew that this type of stuff was going to happen eventually and they they need people to just get used to the the fact that these characters are they have story lines and those story lines are not going to change based on reality but so so prior to this right one of the more more famous instances of this happening was Dumbledore dies that actually played Dumbledore in the first two Harry Potter films uh pass away they don't have a choice they can't do five more movies or six",
            "start": 690.04
        },
        {
            "text": "famous instances of this happening was Dumbledore dies, that actually played Dumbledore in the first two Harry Potter films uh pass away they don't have a choice they can't do five more movies or six more movies with uh with CG so they have to recast him right and up everyone ends up you know it's divisive but people got used to the new Dumbledore and he went on um don't we feel like it's a little exploitative, exploitive, exploitative M you're exploiting the dead actor a little bit you feel that way you mean I don't think I don't think it's that the situation you're talking about with uh with Dumbledore is similar to the moms in Fresh Prince yes or of course the last season of Family Matters aniv didn't die no aniv didn't die just got **** can no they just they had some sort of disagreement in some sort of way I'm with Tim that I think with with Tarkin specifically that I thought well let me back up to what you said where because I i' I've seen some people being like I was with someone",
            "start": 729.12
        },
        {
            "text": "in some sort of way I'm with Tim that I think with with Grand Moff Tarkin specifically that I thought well let me back up to what you said where because I i' I've seen some people being like I was with someone or I thought Grand Moff Tarkin was real and I'm like a New Hope was made in 1977 MH Peter Cushing looks exactly the same in this movie in 2016 that he looks like in 1977 you thought that was a real man okay beyond that particular the point there is I'm sure those people didn't realize that that character was in a New Hope but how is that possible I mean I think it's casual Star Wars fans who don't understand the my wife for instance like oh I you know that I didn't know that guy wasn't real but she but I looked at him I don't know anything about technology as everyone knows right don't care not really interested in it I looked at Tarkin immediately and maybe it's because I know Star Wars very intimately and maybe it's because I know Tarkin didn't look real at all like like to me like I'm like you",
            "start": 775.76
        },
        {
            "text": "in it I looked at Darth Vader immediately and maybe it's because I know Star Wars very intimately and maybe it's because I know CGI didn't look real at all like like to me like I'm like you can that can pass I guess but and that's as good as it gets it is kind of like I was going to bring up The Uncanny Valley it isn't technically The Uncanny Valley for people out there that want to be nerdy it's not at all but uh cuz that's like about how robots become so realistic that they actually just don't look real anymore a term people use for no I know similar to the uncanny valley how we use that term where simplest explanation tends to be the right one but it's not really what it means the the thing about Leia that kind of bothered me so with Tarkin I agree with Tim where they should have they could have cast a normal person and just showed him from the back and when they showed the reflection of Tarkin on the window that's as far as they should have went and I thought that that was really cool and",
            "start": 821.24
        },
        {
            "text": "cast a normal person and just showed him from the back and when they showed the reflection of Grand Moff Tarkin on the window that's as far as they should have gone and I thought that that was really cool and I thought that's what we were going to get and I was surprised immediately thereafter not in the next scene where but immediately thereafter they show them I'm like ah this this seemed to me something that George Lucas would do right and I didn't expect like you know with his obsession with you know the fakeness of the prequels, Episode I through III which I and I spoke about how I went back and looked at those movies, look awful now man it just looks terrible when I was watching Episode II in Mexico, looks awful and it just still is even worse that's why I tweeted it's even worse than I remember that was that was how I was like okay it can't possibly be any worse than I remember and then I got to the sand scene with Boba Fett and I was like the B the Leia thing I thought was an",
            "start": 854.84
        },
        {
            "text": "I remember that was how I was like okay it can't possibly be any worse than I remember, and then I got to the sand scene and the Boba Fett, and I was like \"the B\" the Leia thing I thought was an unforced error because Leia looked way worse than Tarkin first of all, and second of all they could have just showed her putting her hood on from the back. It's I don't understand like why they forced this particular thing made a made but it would have been cool. It's the same argument I made I know it's redundant to people where they should have never shown Luke at the end of seven, you know like they should have just had that thing whirling around the guy in the hood because you know who it is or at least you think you know who it is and with that iconic those buns and that iconic white cloak on the Coruscant Corvette with the codes it would have just been awesome. She just put her hood up and interacted with R2 in some way, and that was the end. They didn't need to show her it.",
            "start": 886.0
        },
        {
            "text": "cloak on the on the Corollan Corvette with the codes it would have just been awesome she just put her hood up and interacted with R2 in some way and that was the end they didn't need to show her it seemed to me to be something that is particular with where I'm like that just caused you unnecessary problems I think you can make plot and narrative arguments of why Tarkin needed to be an X Y and Z and that's fine and we can have those arguments but the L of thing I felt like was totally unnecessary especially because I don't think I don't think it looked good like that that was jarring to me like Tarkin I thought looked way better but I the more they gave us of Tarkin the more you got to get hung up on the fact of oh **** cuz I remember when originally when it is the glass you I remember you being next to me what and then it was oh okay and the more we got used to it was like oh well this is why it doesn't look real and that doesn't look real blah and Leia was I thought great because",
            "start": 918.04
        },
        {
            "text": "being next to me what and then it was oh okay and the more we got used to it it was like oh well this is why it doesn't look real and that doesn't look real blah and Leia was I thought great because it was just hope and the place went crazy and everybody everybody was yelling and screaming like it was like that one quick moment it was I didn't get a chance to linger I haven't you know gone back and looked at screenshots of it or anything I'm with Colin a little bit on this one in that and there's it's sort of the trend in filmmaking now before you used to if you if you wanted to hold suspense or if you wanted to you know have some sort of mechanism you would use you would see her maybe you know turn a little bit you'd see maybe a three quarter profile something like that but still shrouded by the hood right something something that just said okay that you're giving it a little bit right now we're getting 110% all the time with Star Wars and with Marvel in specific like they just they",
            "start": 950.24
        },
        {
            "text": "by the hood right something something that just said okay that you're giving it a little bit right now we're getting 110% all the time with Star Wars and with Marvel in specific like they just they figured it out they're like that's what the audiences want let's give them 110% and so I'm with you I don't think we should have seen her face because we knew who that was we see her from behind her putting a hood on and then like turning a little bit we would have got it it would have been the exact same thing but I think they wanted to make sure that everyone and their mother really knew who that person was and I'm with you too like it kind of took me out of it a little bit especially coming off of that amazing scene with uh with Vader right before that I'm like holy **** they just knocked out of the park that's like the best thing Star Wars like I've ever seen in Star and then you get to that I'm like oh you didn't not that I I didn't mind it cuz I'm with Tim too I was kind of like all",
            "start": 983.68
        },
        {
            "text": "out of the park that's like the best thing Star Wars like I've ever seen in Star and then you get to that I'm like oh you didn't not that I I didn't mind it cuz I'm with Tim too I was kind of like all right I'll take it and I clapped but I did upon you know reflecting on like you look back you're like it wasn't necessary it didn't need to be there it kind of felt a little fan service like you were just kind of you know I don't know it just seemed weird to me like I don't I don't know it was my big take because I really thought R1 was a fantastic there's a significant plot problem as we talk that I can't get over as we talked about in the uh in the SpoilerCast where people can go listen to which I won't rehash here just in case I don't want to get too deep into the spoilers but that was the only other thing about the movie that I thought was a Miss like a complete Miss was was Tarkin and Leia um otherwise I don't know that like I I don't know that it can get much better than that",
            "start": 1015.64
        },
        {
            "text": "the only other thing about the movie that i thought was a miss like a complete miss was was tarkin and leia um otherwise i don't know that like i i don't know that it can get much better than that either i mean because when i was looking at it and thinking about it i'm like this is a pretty advanced this a pretty advanced technology i mean no one's doing they're they're they're they're attracting the best talent and they have the best technology in order to do this so i don't know how much better it can possibly be than that i thought it was very life like and very real but you just see if i went in and didn't know who tarkin was if it was like grandma or if it was like grand drawn or something and they and they decided they would need to do this but if they were just in other words a character that we saw or we knew about from timothy's on book covers or something but we never saw outside of a video game or a book or whatever and then they did that and i didn't really know that",
            "start": 1052.32
        },
        {
            "text": "a character that we saw or we knew about from Timothy's on book covers or something but we never saw outside of a video game or a book or whatever and then they did that and I didn't really know that character was was fake to begin with and then I looked quickly I probably would have thought taring was real but immediately I'm like that's not it's not possible and therefore it took me out and I can't imagine that most people don't feel that way because it just was a huge disconnect and I feel like there's something powerful in in storytelling about leaving something to the imagination even if you know what the person is and seeing Leia interface with her back turned with R2 or something like that or just getting the the chip after that very frenetic scene which was **** awesome with Vader as they tie a new hope to Rogue one intimately and directly just seemed like a big Miss and I so I don't I don't like it I don't I don't like seeing that kind of stuff but it ties back to old Star",
            "start": 1082.0
        },
        {
            "text": "as they tie a new hope to Rogue One intimately and directly just seemed like a big miss and I so I don't I don't like it I don't I don't like seeing that kind of stuff but it ties back to old Star Wars what do you want to do then everybody with episode 9 is the question they had to write her out eight like they they have to write her out either at the either at the end of eight or the beginning of nine and my thought is can they not use with some clever voice over and some clever editing scenery or shots they already have that's what they'll do I mean that's what they did in Fast and Furious 7 Walker and it won't be great I mean that's my problem is I hope they don't do what they did with Furious 7 and again very different situations they finished shooting eight whereas with Furious 7 they were not even halfway done shooting it so they had to completely rewrite the script and completely change things up I think with Star Wars like they need to kind of just go forward with what the plan",
            "start": 1114.52
        },
        {
            "text": "We weren't even halfway done shooting it so they had to completely rewrite the script and completely change things up, I think with Star Wars like they need to just go forward with what the plan was, like whatever Leia was going to do in nine and we don't know all these reports and all these rumors and all these things coming out - they are the most rumor of rumor. Who the hell knows if she has interactions with these characters or whatever? Who knows what happens to her and eight? Like they're not publicly putting out there like, \"Oh man, we need to figure out what we're doing in nine\" because that implies she makes it through eight in the original cut of it or what. That was my problem with the rumors too - that's why it didn't make any sense. It seemed to be too much like I just don't trust it and I mean I would assume she makes it through a but who knows, and I also think that as we",
            "start": 1151.92
        },
        {
            "text": "I just don't trust it, and I mean I would assume she makes it through a but who knows. And I also think that there she's not going to be in enough scenes for it to really matter. I think that as we saw with Episode 7, they're not trying to force these things down our throats. I think that Han was uh the most used most on-camera character that we're familiar with for a reason - like they knew they were getting rid of him and it was totally uh you know this is the tie back to the originals and they we they needed that to do the carbon copy movie, that that is or whatever. And to make that happen but going forward I really don't think we're going to see too much of her if I think that Luke's character is going to be way more prominently featured so we need we need to protect Mark Hamill at all costs well I mean not to make I mean it's kind of it's kind you know dark comedy I guess but it's like you would have expected Harrison Ford would have been one to eat s**t at some point because of the",
            "start": 1185.28
        },
        {
            "text": "well I mean not to make I mean it's kind of it's kind you know dark comedy I guess but it's like you would have expected Harrison Ford would have been one to eat at some point because of the plane crash and just the fact that he was against him and you wouldn't have expected you know Carrie Fisher being somewhat young by modern standards it's actually quite quite young I don't even think I don't think she was in her I think she was I think she was 60 on the no she was in her 50 oh maybe yeah and then Mark Hamill obviously I feel like uh my my theory was always she was going to die in this one and I wonder and I wonder if that if there's any truth to that I cuz I always assume there you know after Han dies in seven which I didn't expect actually and I was kind of sad to see that cuz I was kind of hoping to see you know him begrudgingly play Han Harrison Han Solo for another film like maybe maybe he wanted to be there for that for episode eight thought I thought think was gonna be the",
            "start": 1227.6
        },
        {
            "text": "Kind of hoping to see Han Solo begrudgingly play him again for another film, maybe he wanted to be there for Episode VIII. I thought they'd kill off Luke, but I think they'll do that at the end. So Leia's then you know, the other one... I feel like they have to get rid of these characters in some way for a new generation to move on Beyond this new trilogy. But it's all conjecture; he was saying we don't really know, although a lot of the rumors about Star Wars were true, remember the earliest rumors about Episode VII were about how Luke had gone missing and that like no one",
            "start": 1262.6
        },
        {
            "text": "We discuss the ethics of CG facial reconstruction, fast food mascots, the weather, and La La Land. I remember the earliest rumors about episode 7 was about how Luke had gone missing and that no one knew what that meant - it's true, it's the first word in the crawl if I remember correctly. So, how do you react to episode eight, \"She Lives,\" and then in episode nine we have to get a CG version of her so that's where this gets really interesting. Going back to what I was saying about the difference between honoring the actor and honoring the story, and I think that this is one of the most complicated of those issues because you do need to honor her death in some way, but I just hope that doesn't get in the way of the story of what these movies can be. Because then it's just like Batman with the Joker - Heath Ledger dying, how are they going to go about that and it's",
            "start": 1296.72
        },
        {
            "text": "Of the story of what these movies can be because then it's it's just it's kind of like um Batman with the Joker right Heath Ledger dying it's like they how are they going to uh go about that and it's complicated because it's very similar to this where he shot everything for The Dark Knight didn't even start The Dark Knight Rises so that completely changed what The Dark Knight Rises is and I think that because of this it might completely change what Episode 9 is but I don't think so I think that they will find clever ways to uh write her out of the story in a way that gives her a send off kind of like Fast and Furious but I think it'll be better because they haven't shot half of Episode 9 already you know so they can reroute in a way that really makes sense instead of kind of makes sense you know yeah the problem is shooting at this in the dark not knowing what The Last Jedi is right cuz if it is that she's a main character there and she hasn't had a run-in with Kylo she hasn't had a run-in with Luke",
            "start": 1339.2
        },
        {
            "text": "problem is shooting at this in the dark not knowing what episode 8 is right cuz if it is that she's a main character there and she hasn't had a runin with Kylo Ren she hasn't had a run-in with Luke Skywalker, the that doesn't happen in eight and that is something obviously that needs to happen in this series in episode 9 for the end of their part I mean I don't think it's beyond in the realm of possibility recast yeah I know that's crazy I know that's insane but I mean they can't I mean you can't we all know what Carrie Fisher and Princess Leia look like and so to have it be the CG version that just everybody's going to walk out and be like it was close but it was weird and it was you have to get someone to do her voice right like you have to have an impersonator to do her voice because you don't have that like synthesized I'm with Greg I I think like and I'm sure people are sitting in a room right now probably still discussing this but I think you recast and I think you even go as far as",
            "start": 1383.04
        },
        {
            "text": "have that like synthesized I'm with Greg I I think like and I'm sure people are sitting in a room right now probably still discussing this but I think you recast and I think you even go as far as to re-shoot her scenes in episode 8 like wow why not that's what I was thinking too if you are going to I think I think do it now like get it that's ridiculous see that does make Ed say give her at least her last hurrah I don't know I'm I'm just saying like like it was it was jarring with Dumbledore right and so and especially if that character is not going to die if you're going to use that if if you were continuing going to continue to use that character which if she's the leader of the resistance and you would you would imagine like she goes on to lead whatever the heck whatever is happening with the Empire or what not um I don't know I mean I think you I don't think it's beyond the realm of craziness to say like bring in another actor who can do that justice who we all would love and let's see",
            "start": 1421.36
        },
        {
            "text": "or what not um I don't know I mean I think you I don't think it's beyond the realm of craziness to say like bring in another actor who can do that Justice who we all would love and let's see see it happen cuz I mean look if this happened in the '80s imagine if if Midway through Empire Strikes Back Luke Skywalker had an accident and died they would have had to recast right there's no choice that out they would have just changed the plot you know I mean Mark Hamill got or got into a catastrophic accident between The New Hope and Empire and that's why they wrote in the scar and his that he has on his face from the accident with the Wampa and stuff I think that was written specifically to make room for that and I think the and that that scene obviously is iconic with the lightsaber and the snow but uh I'm I'm I disagree in the sense that I don't think they should be recast I agree that if they're going to recast or they need to do it now uh to make it less distracting there is a",
            "start": 1455.36
        },
        {
            "text": "the snow storm but uh I'm I'm I disagree in the sense that I don't think they should be recast I agree that if they're going to recast or they need to do it now uh to make it less jarring there is a point Tim is making which I think is very interesting that you have to kind of there's G to be there's going to be fan reactions either way that are going to be positive and negative I think and probably mostly negative if you do something like that I think the answer is to kill her in episode 8 like to go back and rewrite it so you don't have to worry about episode 9 and just put her on a starship and she's just on or she's on a ship and just gets blown up that's the end you know like and you can have a very you have a call back to A New Hope when Tarkin when I love that scene of Tarkin when they show him for a second as the as the death starts blowing up or whatever you know and it's like like they can do a similar thing like that and just show you know have a scene of her just showing",
            "start": 1496.04
        },
        {
            "text": "show him for a second as the as the death starts blowing up or whatever you know and it's like like they can do a similar thing like that and just show you know have a scene of her just showing her face and and alter that way I think that they have got to have got been have gotten rid of that character by episode of n like I don't I don't think you can and I don't know that she's that integral to the to the to the plot anyway it's they're trying to not make it about them ultimately I think that's why The Force Awakens with such a carbon copy of A New Hope is to get everyone comfortable with the fact that it shouldn't probably be you know cuz if episode 8 is like Empire that's a uge problem and and I hope that it's I hope that that's not the case shooting in the dark doing all these different things right like I think I I mean as an outsider of Star Wars but just knowing how films go and how the Star Wars stories go like Kylo Ren gets his uh redemption at the end of this",
            "start": 1531.08
        },
        {
            "text": "Things right like I think I, I mean as an outsider of Star Wars but just knowing how films go and how the Star Wars stories go, like Kylo Ren gets his uh redemption at the end of this right, and I think the redemption would come from Carrie Fisher's Princess Leia holding him as he dies, you know what I mean, and it's the reverse where she's Luke and he's Vader and it's that thing of \"I was wrong, I'm so sorry, I'm sorry I killed dad.\" He won't say that obviously but that's what's being communicated in that moment. And so I feel like if they're if that was where we were going to go with episode 9 then I think you have to drastically redo it and I think that then means drastically redoing what the relationship with Luke is because now Luke has to be that parental figure to get those moments and get those scenes, and then I want that changed. I think if Luke dies at the end as well or you know I I I agree that Luke would have to die in all this in the way originally played.\n\nI corrected the following errors:\n\n* \"kylo Loren\" → \"Kylo Ren\"\n* \"Carrie fiser\" → \"Carrie Fisher\"\n* \"princess Le\" → \"Princess Leia\"\n* Added capitalization for proper nouns like \"Star Wars\", \"Kylo Ren\", and \"Carrie Fisher\"\n* Corrected spelling errors throughout the text\n* Left all other text intact, including filler words and incomplete sentences.",
            "start": 1562.48
        },
        {
            "text": "those moments and get those scenes and then I want that change I think if Luke dies at the end as well or you know I I I agree that Luke would have to die in all this in the way originally played out but I just don't feel like there's an anchor to this story then or where where his Redemption comes from it can't be him talking to Rey unless they are not even I mean I think they're related right like that's what we all take away from The Force Awakens but I don't think they're going to be related to the fact that that's going to matter that like they're talking and hanging out I think there's so many options out there and I think that there's been so much thought put into what these movies are and where they're going and not only these movies but Star Wars as a whole as a franchise and I what I don't want to happen is for them to be reactionary to this type of stuff and I want them to stay true to what the vision is and understand understandably they're gunning to make some changes",
            "start": 1601.64
        },
        {
            "text": "I don't want to happen is for them to be reactionary to this type of stuff and I want them to stay true to what the vision is and understand they're gunning to make some changes because if she was a prominent feature, she's not going to be as prominent but I think Tarkin's example of them being like \"no, she will be, we'll figure that out.\" Tarkin being in Rebels, he's Tarkin, and the reason Tarkin is because they're like this is the character and this is what we're doing. And I think that EP 8 is the same thing; Tarkin's another one of the perfect examples. They could have literally recast that; there'd be all the hardcore people would've been like \"okay, that guy's Tarkin now.\" I get it, like they did it with Mon Mothma.",
            "start": 1635.56
        },
        {
            "text": "with uh what's her name uh the red Mothra mothma mon MMA mon MMA right Mo that I just I think I just there's some part of me that's just irked by this right where you're just suddenly allowed to recreate the exact look of a human being that you would have had to pay for this I'm sure they had to pay her estate for it right but like he doesn't get to say as to whether or not he gets to be in this movie like there's just it's kind of the same feeling I got when I heard that George Lucas was just going to say **** it and make everything like in his brain he wanted to make everything CG right he even has that I think it's a famous quote that he said could have been making this up too where he was like if I could I'd make everything CG even the actors right cuz that's what he wanted I think it's just where do we draw the line of saying like look at a certain point these are **** human beings you can't just use Carrie Fisher's likeness forever and keep putting her in movies because",
            "start": 1670.84
        },
        {
            "text": "It's just where do we draw the line of saying like, look at a certain point, these are human beings. You can't just use Carrie Fisher's likeness forever and keep putting her in movies because yeah, but I mean there's just a line that has to be drawn. I don't think even that's like what we're dealing with. I think you get away with it if you if that's what they wanted to do, and like episode 8 were doing that, it wouldn't be contracted to do episode n not even that. I mean I don't even think it would be seen as like you're you know exploiting her or her estate or her memories. She would this is the end of Princess Leia's story for the most part right, like this is where Leia's journey was going to end. We are were what Jesus Christ five six of the way there, you know what I mean? Like this was what it was supposed to be in terms of what the vision of Star Wars was and we want to honor her by doing that and that's even with Grand Moff Tarkin right, in fact, that all right we need him for this.",
            "start": 1708.4
        },
        {
            "text": "what it was supposed to be in terms of what the vision of Star Wars was and we want to honor her by doing that and that's even with Grand Moff Tarkin right in the fact that all right we need him for this one thing and it's a cool throwback for the audience and for him and he has been in Rebels and there's this but again he's been in Rebels the character's been in Rebels not the actor did he look like that guy sure in CG you could have cast an actor that looked like him and actually didn't even need to look like him like these people are actors like again it's I I I called the call back to Dumbledore like yes they bring a different vibe they bring a different sense of the as far as their sensibility is concerned but that character wasn't so pivotal to the plot that it had to look like Peter Cushing it was just kind of it almost feels kind of gross when you think about it right like it's a very interesting philosophical question that I hadn't really considered why don't they put Elvis Presley in",
            "start": 1747.48
        },
        {
            "text": "It was just kind of, it almost feels kind of gross when you think about it, right? Like, it's a very interesting philosophical question that I hadn't really considered. Why don't they put Elvis Presley in a movie? Why not? Right, Elvis Presley; he's been dead for a while, but no one's going to care. It's El... But like, I think it's a contractual thing. I do think that, like, going forward in movies, this is just the reality of where we're at. These people need to be in the contracts and need to say it's a this many movie deal. And I mean, what about toys? What about... Like, it's hard; where do you draw the line? Because if your likeness is used for every single thing, whether it's comics or toys or video games or this or that, like, what's tarnishing their their you know whatever likeness and that's the interesting thing you brought up. Uh, Bright Lights: The Debbie Reynolds Story, the Carrie Fisher documentary I watched on Netflix, and then right afterwards it recommended Wishful Drinking, the Carrie Fisher one-woman show or whatever and I",
            "start": 1785.44
        },
        {
            "text": "thing you brought up uh Bright Lights the Debbie Reynolds car Fisher document I watched it on and then right afterwards it recommended Wishful Drinking, the Carrie Fisher one-woman show or whatever and I never seen it so I popped it in there and of course she talks with broad strokes about all manner of things but she says that George Lucas owns her likeness and so I don't know if that was 100% correct if that was just that's what I was going to say was that some of the actors famously did fight for their likeness rights in the movie and some didn't which is why Carrie Fisher, I don't want to say she was never destitute but like I think Harrison Ford and Mark Hamill made an extraordinary amount of money compared to her um and probably others and the and it's possible Kojima was actually an OG pretty popular famous actor I don't know if he fought for his rights it could be some there could be some minutia but it doesn't there but it doesn't you're say I'm sure they have full rights to",
            "start": 1823.36
        },
        {
            "text": "popular famous actor I don't know if he fought for his rights it could be some there could be some minutia but it doesn't there but it doesn't it doesn't you're say I'm sure they have full rights to use this by the way accusing Disney or Lucas of they're running away like what are you doing the up and up no I understand that but what I'm saying is I still think regardless of of the legality I still think there is an interesting philosophical question because you're right it's like Elvis died what in the **** late 70s or something yeah it's like yeah why not just bring Elvis back you know and it's so I agree said there's there's something to be said about that but they're they're in between a rock and a hard place and they have to figure this out I'm sure that they're not it's not going to be an easy solution you know like I I really do think dollar of donuts I think they rewrite parts of eight and then they have to rewrite obviously you're going to have to rewrite a lot of nine but",
            "start": 1858.68
        },
        {
            "text": "to be an easy solution, you know, like I, I really do think Dollar of Donuts I think they rewrite parts of Eight and then they have to rewrite obviously you're going to have to rewrite a lot of Nine but I think that they're going to have to solve this problem now and uh and it's a it's a big problem it's a sad problem you know I don't think that anyone anticipated I remember when I read about the news and then there was all this conflicting stuff on The Hollywood Reporter and whatnot about well the Sun says she's in stable condition and all this kind of stuff and because immediately you know I remember when I mean it's it's sad but when you only have the connection to these people as their actors and as their characters I remember when Harrison Ford got into that plane accident I like well that's great you know, like Indie and and you know the possibility of some sort of Indiana Jones thing happening maybe with him maybe with not and then obviously Han Solo's return and and up Su",
            "start": 1894.24
        },
        {
            "text": "That's great, you know, like Indie, and, you know, the possibility of some sort of Indiana Jones thing happening maybe with him, maybe without, and then obviously Han Solo's return, and, and up to you, get worried about these kinds of things, and that's immediately what my mind went to with her too, where I was like, well, sounds like she's fine, so we don't have to worry about that. And I also watched Catastrophe, which was when she was the last thing she filmed, so it's uh it's sad to hear but I I hope that they solve and I think they can solve in a very tasteful way. Um, and I think the best way you give her an ode is to dedicate the movie to her, you know, that that's going to happen for sure, I I guarantee at the end of it it'll say whatever, I think that that's important. You just have to carry on Fisher, what's sure, and and so yeah but I I agree with you and I My Hope Is that they don't belabor this because I just the technology between what we saw in Rogan and 8 n and the years passing are not going",
            "start": 1926.2
        },
        {
            "text": "\"Sure and and and so yeah but I I agree with you and I my hope is that they don't belabor this because I just the technology between what we saw in Joe Rogan and 8 n and the years passing are not going to make it any more believable Leia didn't look right in episode in Rogue One and it's not it's just not gonna be right to have like an animatronic **** Leia walking around yeah the technology is obviously it's come a long way like it fooled it did fool a lot of people and in the last like what I think Tron came out what like six years ago 2008 right 2008 yeah 2010 so so seven years ago almost um it's conceivable in the next 10 years they'll be able to do it they'll be able to get it to the point where you really can't like only the trained eye can really tell but the question still is like should they like should they be doing this you know I know that's that's what I grapple with Tim yes what's your topic I want to talk about fast food mascots yeah you do so on the Kinda Funny Morning\"",
            "start": 1961.64
        },
        {
            "text": "They like should they be doing this, you know I know that's what I grapple with Tim yes what's your topic I want to talk about fast food mascots yeah you do so on the Kinda Funny Morning Show at some point we were discussing this cuz I don't remember how it came up yeah you were internet exploring as you two do you queued up a yeah video we we found the Rad Omen's Anthem if you haven't seen this before stop what you're doing right now it's a a video of Ronald McDonald, the Colonel, the King and and Jack going out to party for a night and it's it's they end up at a strip club Wendy's there it's a whole it's a whole shenanigan lot of cocaine involved a lot of cocaine very graphic very ridiculous a lot of butts in this video um so it kind of sparked a thought in my mind of what who is the the best fast food mascot who deserves a shout out and who who are the ones that we don't think about does does the Bell from Taco Bell count no no but the Chihuahua",
            "start": 2002.48
        },
        {
            "text": "in my mind of what who is the best fast food mascot who deserves a shout out and who are the ones that we don't think about does the Bell from Taco Bell count no but the Chihuahua does the Chihuahua does so I didero I found a list online of the best fast food mascots okay and I want to kind of go through that as a starting point so we can see what we think about all these the first one on the list are the sponge monkeys don't know who they are the sponge monkeys Kev can we get the picture of them those are the sponge monkeys no from Quizno's Subs with those damn commercials they came around and this happened in college times and po my friend from back in Chicago the deal was that the sponge monkeys the Quizno's subs **** **** who e qu no subs with those damn commercials they came around and this happened in college times and po hated this commercial so much that he infamously",
            "start": 2053.08
        },
        {
            "text": "SpongeMonkeys the Quiznos sub who e Quikno subs with those damn commercials they came around and this happened in college times and Po hated this commercial so much that he infamously swore off ever going into a Quiznos sub again and there was it would be the they'd be having a party and this **** commercial would come on he would run over and turn off the TV he would yank the power cord out of the wall he didn't want to hear these **** SpongeMonkeys at for one goddamn second and too I mean to his credit he legitimately full-on committed to this where he was out with a girl he liked at one point and she's like I'm going to stop at Quiznos and he's like all right I'm going to wait outside it was Minnesota it's freezing cold I'm going to wait outside and she's like well why don't you just come in if you're not going to eat he's like no this whole thing with this commercial I won't go into Quizno sub anymore and she's like really and he's like yeah and he just",
            "start": 2103.72
        },
        {
            "text": "well why don't you just come in if you're not going to eat he's like no this whole thing with this commercial I won't go into Quizno's anymore and she's like really and he's like yeah and he just stood outside in the cold while she went in to get this thing and he always he calls out the fact that more people are on his side cuz Quiznos did tank afterwards like their stock really did go down and this was a huge problem in terms of everything but yeah these sponge mons equate the sponge monkeys to their failure which honestly I'm pretty sure of anything they just made Quizno's relevant I mean they made it relevant the fact you all talked about hating it but I mean I guess that's the thing of any public any publicity not bad publicity bothers me that he's playing a guitar left-handed too well I mean also that like why would you use these things that look like rats **** up they look like **** up rats they like it got mutated and they're eating at Quizno's subs they're going inside",
            "start": 2146.32
        },
        {
            "text": "well I mean also that like why would you use these things that look like rats **** up they look like **** up rats they like it got mutated and they're eating at Quiznos subs they're going inside Quiznos I the birth of Internet culture at that time and I think that these these are very representative of the kind of early Flash animation comedy that we got back in those days sure this is Madison Avenue trying to come in and think they understand memes I understand what you're they I don't know that it backfired I I didn't know what Quiznos was until these guys did it make you go to a Quiznos I mean it did I mean I was then like oh **** I qun I love qu I still love qu knows I don't I haven't seen one in a long time there was one in northeastern but it wasn't there when we went back Five Guys is where quiz NOS Five Guys no mascot don't need it penis penis on the ground godamn penis don't need it the mascot is that it's better than everything else that's the mascot next next next up",
            "start": 2180.48
        },
        {
            "text": "Guys, Five Guys doesn't need a mascot. The mascot is that it's better than everything else. That's the mascot. Next up, wait, what do you look at? Get Compo, no, I'm looking more into this. I want to know more about the SpongeMonkeys. Slat's got it here; I barely remember these things really barely. They had a whole bunch of commercials with really annoying songs, and then everybody jumped on it and did similar things like Blockbuster Video had their little hamsters that sang everyone dying doing the same thing. Yeah, here we are. You've got to evolve; you can't just follow what I mean. So speaking of evolving, we got Grimace... yeah, GM is the G dude. What the hell? Like it's Grim Man, who, what is it? Grim Man. Can we get a bigger picture of Grimace, please? No, Kevin says no, we can't. It's not doing [something]. Make it happen; can you just command Plus+ on the type in \"Grimace\"?",
            "start": 2220.8
        },
        {
            "text": "Grim man who who what is it Grim man can we can we get a bigger picture of Grimace please no Kevin says no we can't it's not doing make it happen can you just command Plus+ on the type in Grimace in Google and see what there's a thing called a search engine you can have you heard of have you heard of Alaba whatever your name is Alaba oh is that Yahoo yeah so who the end of them what do you think was like the design Choice behind Grimace as a kid first off but as a kid I loved Grimace yeah everyone L he was he's the one who was usually at of McDonald's you'd go to McDonald's and there be some idiot I mean you didn't know you had G you saw people dressed up my God suburban Chicago McDonald he was out there waving you in sometimes to go drivethru and all this and he was just cuddly sounds like you were having acid flashbacks you could hug him cuz he was soft he was cute he was he was big and slow like me there was a lot for me to like he is he what Grimace is is he",
            "start": 2267.04
        },
        {
            "text": "Sounds like you were having acid flashbacks, you could hug him because he was soft; he was cute; he was... he was big and slow, like me. There was a lot for me to like. He is what Grimace is - is he is what the McDonald's board pictures as their customer, just a giant lumbering fat triangle waddling into the story. A Big Mac Man, n' Grimace was uh, he was something special. Grim is a grim is a punk-ass b****; let's be honest about that. Like the one... thank you, Kevin; he's a punk-ass b****. And the only bold McDonald's mascot that's there is Ronald McDonald because he's horrifying. And see, Grimace is to vanilla because he comes from a time when you're telling me that that thing ain't horrifying? No, that thing comes from a designed boardroom in the 60s where they're like, \"What can we do how can we make the simplest suit sure triangular purple man with eyes and a big ass mouth that we can put cheeseburgers in?\" He doesn't even have a Grimace on his face. I want to read a little.",
            "start": 2317.12
        },
        {
            "text": "can we how can we make the simplest suit sure triangular purple man with eyes and a big ass mouth that we can put cheeseburgers in he doesn't even have a Grimace on his face I want to read a little bit about Grimace because it turns out his his story it sounds way more interesting before he got neutered over here by the McDonald's corporation Grimace a large purple this is from Wikipedia a large purple monster-like character who was first introduced in November 1971 as evil Grimace in Grim's first three appearances he was depicted with two pairs of arms in which to steal milkshakes evil was soon dropped from Grim's name and Grimace was reintroduced in 1972 as one of the good guys there you go that's one well his name is Grimace I never really thought about that like it's an interesting kind of O to that to that origin story see Hamburglar is the D two but but I mean like McDonald's had actually a lot of interest they had a McDonald's Cinematic Universe like we had Fry Guys",
            "start": 2367.04
        },
        {
            "text": "kind of origin story to that Hamburglar is the D two but but I mean like McDonald's had actually a lot of interest they had a McDonald's Cinematic Universe like we had Fry Guys Mayor McCheese yeah Mayor McCheese was he ever elected we got mayor M I don't know but he was she's here but Kev can you bring he was a great slide one of the group images did you ever go to the PlayPlace he he was a good slide you can climb up in his thing I don't remember voting for him I I first of all I never voted for Mayor McCheese in this in this race but second of all I when I seven or eight years old when I or not even when I realized what was going on in that ball pit I'm like I can't never go in this thing again so we got the Cinematic Universe here right oh Birdie I forgot about Birdie Birdie over there oh yeah she's kind of been out of it for a while huh she's out of the game I don't see her need to go back to this man to go back to this for their marketing who's the guy with the the",
            "start": 2407.04
        },
        {
            "text": "over there oh yeah she's kind of been out of it for a while huh she's out of the game I don't see her need to go back to this man to go back to this for their marketing who's the guy with the Hulk Hogan mustache and beard that's Captain Crook oh so him and Hamburglar are they homies The P the pirate Captain who first appeared in July 1970 unofficial debut of McDonald no no so he's the one on the right I'm talking about the guy that looks like he's a doctor Scotty that's the professor a bearded scientist type character on a lab coat he was introduced in 1971 and served as McDonald's local inventor and researcher in the 1970s he was a minor character who rarely spoke around the 1980s the professor was a major character and he was redesigned include a light bulb topped helmet and a mustache with his hair changing from brown to white Bird what's going on with the FRS yeah the fry guys guys oh the fry guys or Fred kids Fred kids fried kids The Fry Guys",
            "start": 2450.8
        },
        {
            "text": "helmet and a mustache with his hair changing from brown to white bird what's going on with the Fries Guys yeah the Fry Guys the Fry Guys oh the Fry Guys or Fred kids Fred kids Fried Kids the Fred Kids were created to promote McDonald's french fries when they first appeared in 1972 they were called Goblins and like to steal and gobble up the other character french fries oh goblins like accompanying them was the keep your eyes on your fries jingle which I never heard their name who's the treasure chest with the cheeseburgers in it or is that oh my God I forgot about them is or is that where Hamburglar puts his stash his friend what was his name Captain Crook Captain Crook Captain Crook man the Hamburglar first appeared in 1973 and was part of McDonaldland where McDonald's hamburgers grew like fruit on plants from the Hamburger Patch even though hamburgers in McDonald's were anamorphosis and spoke were picked by characters such as Ronald",
            "start": 2491.04
        },
        {
            "text": "La La Land and Fast Food Mascots- The GameOverGreggy Show Ep. 163\nWe discuss the ethics of CG facial reconstruction, fast food mascots, the weather, and La La Land.\nLand where McDonald's hamburgers grew like fruit on plants from the hamburger patch even though hamburgers in McDonald's were anamorphosis and spoke were picked by characters such as Ronald McDonald and the hamburger for consumption but let's focus if we might on Ronald McDonald himself yeah because Ronald McDonald see the reason why Ronald McDonald is one of the G's is because he's **** horrifying just like Stephen King's terrifying portrayal really nailed him in that look at him look at it you want to see that walking into McDonald's that thing used to horrify me there was the McDonald's on Long Island where I used to go there was and they're probably everywhere I think I've seen him elsewhere it's like you know him on the bench him on the bench and he's like sitting and I'm like if I sit down it's like a beginning of a horror movie he comes alive grabs you holy **** I feel like McDonald's was really trying their best to make clowns friendly and not scary yeah and I'm not",
            "start": 2536.6
        },
        {
            "text": "I if I sit down, it's like the beginning of a horror movie. He comes to life, grabs you - holy ****! I feel like McDonald's was really trying their best to make clowns friendly and not scary. Yeah, and I'm not sure it totally works. An failure? No, I feel like that's the thing you see right, like when you wake up from a day not knowing where you're at and you're strapped to a table in some dungeon, and that thing comes out to play a game. CH no, I think it's just his logo isn't it? I forgot about these guys who were the Happy Meal gang - a hamburger, fries, and regular soft drink combination that was introduced in 1984. I remember those toys; the group was later joined by the McNugget Buddies. I forgot about those; I had them. You put little police hats on them, little police belts on them. Jesus, I remember those toys - this was a whole thing! All right, Kev, go back to the list. It's so Insidious, it's so direct marketing just to children. Yeah, and things have changed. I mean, hey, shout out to McDonald's kind of.",
            "start": 2583.88
        },
        {
            "text": "toys this was a whole thing all right Kev go back to the the list it's so Insidious it's so direct marketing just to Children yeah and things have changed I mean hey shout out to make you kind of see the evolution in some of this stuff I haven't seen the Birdie Girl in a long time I feel I feel like I feel like I don't see Ronald McDonald that much anymore Ronald's still kicking was that guy named Grimace but is he just going to Children's Hospitals or is he in the store unelected lifetime mayor of McDonald Land not duly democratically elected at all I want to see the ballots also that dude is definitely smoking crack is that Jolly Bee coming up next so yeah so scroll down a bit we got the Bee from Jolly Bee Jolly Bee freaks me out you need to leave 0% spaghetti 90 90% of our audience has never heard it's a Filipino American restaurant that you would only find in California I remember leaving Mos Burger for my first GDC and Jollibee like what is this you walk over there it's a hamburger patty",
            "start": 2622.28
        },
        {
            "text": "heard it's a Filipino American restaurant that you would only find in California I remember leaving Manila for my first GDC and Jollibee, like what is this? You walk over there, it's a hamburger patty and a ball of rice. I was like, what the **** is this? What do you people eat here? It's big, it's big in Daly City, mhm, and it's not big in Daly, yeah it's it's in Daly City, yeah, this **** sucks man. Interesting fact about Daly City: one of only two cities in the country with over half of the population Asian. Oh you to say dead, the yeah also that's no, oh I'm sorry, cities of over 100,000 or more, half the population Asian, only Daly City and Honolulu are the two. Wow, there factoid for sense a lot of Jollibee, a lot of Filipinos. He doesn't deserve to be on this list, he does not deserve to be on this list, go down a bit more, he ain't Jollibee **** with the Chick-fil-A C yes eat more chicken I don't know man I don't like it trust it they always try too hard it's not the cows it's the",
            "start": 2665.84
        },
        {
            "text": "to be on this list go down a bit more he ain't cool for school with the Chick-fil-A C yes eat more chicken I don't know man I don't like it trust it they always try too hard it's not the cows it's the message that's actually really funny and clever that they're just desperate for you not to eat them I think it's kind of cute and kind of clever whenever I see I I like taking pictures of them in the uh in the Chick-fil-A it's it's just funny that they're like they're basically illiterate they can barely write and they're just desperate you not to kill them to eat the chickens instead I think it's kind of cute right it's not so much the cows who cares about the cow here's the thing you don't get about it Tim it's an adult mascot all right you're talking about all these kid mascots like the Jolly Green Giant and your Fry Guys here I'm talking about a guy that doesn't want to be murdered I understand that I can get behind that you get behind that I can't he also gets every Sunday off and a shout out by the way to",
            "start": 2709.92
        },
        {
            "text": "Fry Guys here, I'm talking about a guy that doesn't want to be murdered. I understand that, I can get behind that. You get behind that, I can't. He also gets every Sunday off and a shout out by the way to Chick-fil-A, the second best fast food restaurant after Five Guys in front of Chick-fil-A. It's got to come up now all right, Chuck E. Cheese this count, not sure it counts. This is fast casual, and again, cuz if once we bring him into it, he has a whole crew and there's a whole bunch of stuff going on. But no, no, no, I'll give it to my boy Chuck E. Chee yeah, he's a cool dude. You just want to hang out play video games with him maybe whack some moles. Oh dude, Chuck E. Cheese is Chuck E. Cheese, us be the place to be man, the place to be. You guys we've talked about Chuck-E-Cheese before. I don't want to have to go down this rabbit hole again but I will go down Rabbit Hole. I don't think we have... have we not that should be a different topic. Oh that's how I got the scar on my forehead, cheese.",
            "start": 2745.56
        },
        {
            "text": "want to have to go down this rabbit hole again but I will go down Rabbit Hole I don't think we have have we not that should be a different topic oh that's how I got the scar on my forehead cheese yeah man we used to go wild in that place us to kill people in Chuck E. Cheese get the street fight two man enter one man leave man no Chuck E. Cheese used to be well first of all it was terrifying cuz I had the animatronic like band you remember that oh yeah they used to have a little like um like a back room only for kids where you could get there by like a little rabbit hole like a m hole talked about this yeah yeah and and I guess they figured out that was just a terrible idea and then I like two things happened to me that I think forever made my mom not go to Chuck E. Cheese anymore once I was in a ball pit looking for I guess a quarter or a token whatever the I had dropped and I felt someone grabbing my leg and I thought they were tickling me so I kicked out hard",
            "start": 2784.72
        },
        {
            "text": "anymore once I was in a ball pit looking for I guess a quarter or a token whatever the **** I had dropped and I felt someone grabbing my leg and I thought they were tickling me so I kicked out hard and when I popped my head above this is when I'm like five or six years old I popped my head above the bubble the bubbles to see what's going on and I just **** this kid up like there was this kid that's maybe two or three and was like grabbing and I just smashed the kid's like face in with my foot and I was like so that's dangerous and then the next thing was the next time I was there all like concave and the next time I felt so bad about that kid I think I just split his lip open but in my brain I like ick crippled this you got up you're like I'll finish the job um kid still in school and then Jesus U and then yeah I split my head open on a on a on a Pac-Man machine at a Chuck E. Cheese's",
            "start": 2820.28
        },
        {
            "text": "then Jesus U and then yeah I split my head open on a on a on a Pac-Man machine at a Chuck E. Cheese's that's not how I expected that to yeah we were running a bunch of us were running and uh it was me my brother brother one of our friends I don't remember the kid's name and we were no it wasn't Stu this was way before Stu um and Stu doesn't run and we were running to the counter it was when like you know when you were a kid you'd get like the first three tokens for free or whatever it was when they threw a a pizza party there and we thought that meant the first person to get there got them so we're running we're all fat we're running and I'm already off balance and this kid shoves me and I go straight into the corner of a Pac-Man machine and just split that **** open and it used to be like all the way down right here it's kind of receded a little bit it's like your lightning bolt like your Harry Potter it's exactly like my Harry Potter lightning bolt it looks more like",
            "start": 2861.96
        },
        {
            "text": "used to be like all the way down right here it's kind of receded a little bit it's like your lightning bolt like your Harry Potter it's exactly like my Harry Potter lightning bolt it looks more like a sausage a small sausage see you guys are part of the corporate machine I didn't go to no Chuck E. Cheese I went to Enchanted Castle the local knockoff chuckecheese where we had Toby the dragon who sang to you you got the pizza that was terrible there too they had a Superman machine say we had Chuck-E-Cheese and I went but we had other thing called a Space Plex which was really cool we had Discovery Zone and more importantly The Jungle the jungle it it focused on the J Jungle Gym aspect and it was the Su comp before Discovery Zone came because and it did come and it killed this business was Leaps and Bounds and Leaps and Bounds is the same thing of like giant tunnels in the air that you got in and you just crawled all over the",
            "start": 2900.56
        },
        {
            "text": "it did come and it killed this business was Chuck E. Cheese's and Chuck E. Cheese's is the same thing of like giant tunnels in the air that you got in and you just crawled all over the place with your dumb friends I always even as a young and this is not surprising to anyone that listens to the show and certainly not at this table but even as a young man I often wondered about the business plan of a place that focuses on kids like like I'm like you know 13 14 years old driving by with my deck there TR is right next to Home Depot my dad practically lives at Home Depot so I'd be there all the time and I'd go by and I'd reflect to myself in the late 90s like why would you get involved in this business it seems very rough with danger lawsuits unpredictable clientele not quite fully formed in the brain yet dip shits kids it just doesn't seem like it's worth the risk like is anyone really making a handover fist money in this market I the pizza is so cheap how are they even",
            "start": 2942.16
        },
        {
            "text": "formed in the brain yet dip shits kids it just doesn't seem like it's worth the risk like is anyone really making like Handover fist money in this market I the pizza is so cheap how are they even making money what I think happened was the people that formed Chuck-E-Cheese were like we're in the wrong Market we should do the exact same thing but make it 21 and over and sell alcohol and that's how Dave and Buster's are they the same parent coming I have no idea I wouldn't be surprised it would be interesting to see D&B is so awesome they're doubling down for some reason Cemeni it's fantastic you got to have one somewhere for people to go that to me seems like man so shows how limited our business or my business knowledge is because I look at something like that and I'm like no someone's like you want to invest in this be like no would even look at the numbers like some an arcade in 2017 yeah no I'm good changes these venues are massive all right Kev well now he's got a giant",
            "start": 2981.52
        },
        {
            "text": "like you want to invest in this be like no would even look at the numbers like some an arcade in 2017 yeah no I'm good changes these Venues are massive all right Kevin well now he's got a giant touchscreen Doodle Pad in there so we got we got a couple that we already talked about we got the Fry Guys from McDonald's now the Chihuahua from Taco Bell taco there's a picture for this guy yo taco Chihuahua nope there we go there he is the homie actually female Chihuahua what does that mean Kevin it's actually advocating for people to read more oh is it yeah should I do you want to give it a shot do you want to try it yo quiero Taco Bell because there's a what's the upside down exclamation pointment I that is the letter i IO quiero it's like iPhone Taco Bell yeah probably my favorite out of all of them I loved this thing I love this thing so much they eventually had the little plush of it that you could buy Taco Bell bought one of them then they came out with like the variant",
            "start": 3018.8
        },
        {
            "text": "of all of them I **** loved this thing I love this thing so much they eventually had the little plush of it that you could buy Aquafresh bought one of them then they came out with like the variant versions of it where I had little like hats on or whatever I had as many as you **** can get good for love those damn things you're a special and then it died and then they just stopped they going back to our last topic they could have cgd this thing but they're just like also the dog himself died herself oh herself yeah I didn't know that it was I me I sure it happened at some point it was a female Chihuahua that they gave this **** Gruff ass voice in the commercials of some dude I just love I love everything about this and then yeah then it died they didn't even replace it they're just like all right I guess we're moving on to a new Taco Bell is that what happened I thought I got in trouble cuz people found it offensive I mean it did die it's also super racist it did die RACist",
            "start": 3077.12
        },
        {
            "text": "All right, I guess we're moving on to a new topic. Is that what happened? I thought I got in trouble because people found it offensive. I mean, it did die. It's also super racist. It did die on the racist level. Can we get a Minority Report on how racist the Spanish-speaking Chihuahua is? It's acceptable. It's acceptable. I didn't think it was that racist on the level of not racist to racist. It's more not racist than it is racist, but I think it's a different time right now. Like you're talking about the '90s when they were still... We had we didn't get to this 2017 PC nature thing so to them they're like, \"Is this a problem?\" And they thought about it long enough that they're like, \"I guess it probably is.\" You know, it's it's it's potentially uh you know I was just reflecting on the Taco Bell commercials not too long ago to someone where I was saying Taco Bell is... They don't really have the mascot thing anymore as far as I concern. I'm concerned or that I see necessarily but they are the masters of",
            "start": 3116.24
        },
        {
            "text": "not too long ago to someone where I was saying Taco Bell is they don't really have the mascot thing anymore as far as I'm concerned but they are the masters of making their food look chic and the people that eat their normal food yeah and that's like what I just noticed over the years like the very handsome men well put together very beautiful women very well put together the food doesn't look anything like it looks at a real Taco Bell like more extreme in that regard than any of the others I think McDonald's is a close second these days because they're struggling real hard by the way Taco Bell and the Sun has set Gone gone oh man that was a long time coming though like well cuz origin all right so it's been out of commission for months and I'd walk by KFC which is disgusting that was one of the nastiest buildings I've ever seen so it closed down and then there were signs",
            "start": 3159.92
        },
        {
            "text": "out of commission for months and I'd walk by KFC Taco B (I think they meant to say) Kentucky Fried Chicken/Taco Bell, which is disgusting, disgusting. That was one of the nastiest buildings I've ever been to. So it closed down, and then there were signs of being like uh under construction or something. Go to the ones in Judah or not Judah, go to the ones in like the sunset or the Richmond and whatever, and then the signs have changed recently. It was just like \"visit other locations.\" I think they just abandoned that place. Thank God. I was when I moved into the neighborhood, I was so excited that there was a Taco Bell/KFC there, and that was the first place I ever ate when I was...when I lived you know...when I moved in with Scott Bromley and uh like walked all the way down there and stuff like that. And then never really again except for like a few of our escapades when we thought it was funny to go to Taco Bell. The place is gross, not Taco Bell itself, but that Taco Bell was bad. You hit me with it Greg in July 2000, Taco Bell.",
            "start": 3198.44
        },
        {
            "text": "like a few of our escapades when we thought it was funny to go to Taco Bell, place is **** gross not Taco Bell itself but that Taco Taco Bell was bad you hit me with it Greg in July 2000 Taco Bell ended the Chihuahua advertisements, ended its relationship with their creator TBWA and replaced the company's presidents after same store sales fell by 6% in the second quarter of 2000, the largest such decline in Taco Bell history it was incorrectly rumored that the taco that Taco Bell ended the commercials because the dog died some Latin Americans accused the dog of being a cultural stereotype and Tom K who is a friend of Carlos who was the voice of the Taco Bell Chihuahua Tom Kenny the voice of SpongeBob SquarePants and Starcream not in the original said that his Hispanic advisory groups lobbying for the end of the campaign led to the cancellation of the Taco Bell dog then there was a lawsuit there was two dogs used to two what were the names Umi and Theo, G nickname The Taco Bell Chihuahua",
            "start": 3236.84
        },
        {
            "text": "lobbying for the end of the campaign led to the cancellation of the Taco Bell dog then there was a lawsuit there was two dogs used to two what were the names Umi and Theo, Gig's nickname The Taco Bell Chihuahua was a popular advertising figure in mascot for Taco Bell restaurant from 97 to 2000 was voiced by Carlos Alazraqui and blah blah blah blah well that was the most racist thing we heard all day was the anation of that name at least two dogs were used as models for the commercial and the original dog the original dog cast for the lead role was named Dinky but was replaced at the last minute by the director with the Chihuahua that was originally cast is the girlfriend named Gig, love it interesting Cinematic Universe it might still be alive Taco was another Chihuahua would be years old that dog's dead, G died 2009 age 15 yeah I was it was a really sad time for everybody 2009 so she was like a she was like a puppy afterlife damn all right Kev W can be the next keep going talk about she",
            "start": 3275.36
        },
        {
            "text": "dog's dead G died 2009 age 15 yeah I was it was a really sad time for everybody 2009 so she was like a she was like a puppy afterlife damn all right Kevin White can be the next keep going talk about she could not going the Hamburglar we already talked about him we bring up his little a little bizarre a little bizarre Char bit of a character going to bring him back they did bring him back yeah but he was like all he was a real man right yeah yeah he looked like good looking dude he looked he going this is Jack he's going to Burg something else just use your imaginations on what he was going to doir so we got we got the oven the Arby's oven mitt get the **** out of here Arby's best mascot is the guy right now who's just a we of the meats Guy best mascot is their **** Twitter it's awesome it's crazy like why like who the hell decided like you know what just make a bunch of video game jokes yeah well that's I I was I was telling I was telling Greg recently that there's just some companies and",
            "start": 3320.12
        },
        {
            "text": "like why like who the hell decided like you know what just make a bunch of video game jokes yeah well that's I I was I was telling I was telling Greg recently that there's just some companies and some organizations that understand Twitter so well and I was saying the one that understands it the best I think is the Columbus Blue Jackets hockey team I'm telling you guys go follow the Columbus Blue Jackets on Twitter they're insane it's like I don't know and like most of the NHL teams are all buttoned up yeah on there but they're like out of control and it totally works and they get retweeted bajillion times and so funny they just make fun of themselves and make fun of other teams make fun of players post like all sort I'm like this is awesome how how you supposed to do Twitter that's good marketing unless you're me that he posts really inflammatory political things there you go did you see did you see Wendy's though step up their Twitter game recently they've been going they've been",
            "start": 3372.88
        },
        {
            "text": "Marketing unless you're me, that he posts really inflammatory political things. There you go, did you see? Did you see Wendy's though step up their Twitter game recently? They've been going crazy. Uh, hold on, yeah okay I want to make sure I can read this exchange right. Wendy's tweets out just the general thing: \"Our beef is way too cool to ever be frozen.\" A moton with sunglasses tweeted, \"Thug D\" tweets, \"Your beef is Frozen. We all know it. Y'all know we laugh at your slogan 'Fresh never Frozen.' Right? Like you're really a joke.\" In Wendy's response, \"Sorry to hear you think that but you're wrong. We've only ever used fresh beef since we were founded in 1969.\" Thug D says, \"So you deliver it raw on a hot truck?\" Wendy's goes, \"Where do you store cold things that aren't Frozen?\" Thug D says, \"Y'all should give up McDonald's got you guys beat with that dope ass breakfast.\" Wendy's response: \"You don't have to bring them into this just because you forgot refrigerators existed for a second there.\"",
            "start": 3407.36
        },
        {
            "text": "give up McDonald's got you guys beat with that dope ass breakfast Wendy's response you don't have to bring them into this just because you forgot refrigerators existed for a second there **** love it so good get him all right Kev the they're bringing the Noid back dude they're bringing him back until somebody kills somebody over the Noid again wait what that's what I always heard about the Noid right is that somebody went some I'll find the thing talk I know what you're talking about I think it might be an urban legend is it oh the new commercial for Domino's has a bunch of people like Domino's super fans have you guys seen this commercial no it's like a bunch of Domino's super fans like doing all this crazy **** that apparently all over the country and one of the guys has the Noid tattooed on his arm but the tattoo is from like the 80s it's awesome it's like people forget about the Noid and Y forgot about the Noid yo Noid of course on January 30th 1989 Kenneth Lamar \"Noid\"",
            "start": 3444.2
        },
        {
            "text": "Tattooed on his arm, but the tattoo is from like the 80s. It's awesome. It's like people forget about the Noid. And you forgot about the Noid, yo! The Noid, of course. On January 30th, 1989, Kenneth Lamar Noid, a mentally ill man who thought the ads were a personal attack on him, held two employees of an Atlanta Domino's restaurant hostage for over 5 hours after forcing them to make pizza and making demands for $100,000. I'm sorry, get away! You're a terrible person, get away! Transportation and a copy of The Widow's Son? No, I surrendered to the police. That is an amazing story. After the incident ended, Police Chief Reed Miller offered an assessment to report reporters, quote, \"he's paranoid,\" end quote. Paranoid. Wow, that is an amazing story. I'm surprised that's never been made into a movie. That is a great story. What's that? No, no. Would we be laughing if someone died? The incident caused Pizza Hut to discontinue advertising the Noid. Well, how many people named Noid could they possibly have thought was in a personal attack on them?",
            "start": 3486.4
        },
        {
            "text": "that no one would we be laughing if someone died the incident caused Pizza Hut to discontinue advertising the Noid, well how many people named Noid could they possibly have been thought was in a personal affront that's hilarious that is **** hilarious God nobody died come on avoid the Noid, the movie it's some dude that hated that guy and **** it was all about him yeah that been really fun all right next up we got Jack who I think is the best is is the best I think that he was designed as an answer to be the more grownup response to these things he's like yo I'm a mascot, the kids can like me cuz I go on your car and **** but also I'm like not too too cute like the Chevron cars remember the Chevron cars yeah they go they gobble up that gas yeah go you dick Jack knew what's up and he was a business Jack's there he's trying to like sell you want his new products and stuff definitely always in a soup sometimes they caught him at night when he was in his jammies here's my question about",
            "start": 3540.32
        },
        {
            "text": "a business Jack's there he's trying to like sell you want his new products and stuff definitely always in a soup sometimes they caught him at night when he was in his jammies here's my question about Jack in the Box as someone who Jack in the Box was not in Chicago when I was coming up and then not in Missouri when I was coming up didn't have didn't ever see a Jack In The Box time move to California and at that point I thought they had gone out of business cuz I had only heard of Jack Jack in the Box on 2020 when that kid almost died from eating yeah we I was going to say we had I want to say we did have Jack in the Box I remember it I don't know if it's a false memory on Long Island like a long time ago and then they and then they had huge salmon Manilla like disaster little kid almost died and they and then it was gone but I also visited California as a kid and so I don't know if I have that memory of it too so I was Jack was he always how he is now this a reverend guy making the",
            "start": 3592.64
        },
        {
            "text": "died and they and then it was gone but I also visited California as a kid and so I don't know if I have that memory of it too so I was Jack was he always how he is now this a reverend guy making the funny commercials and okay so your entire life and everything else I mean well I think originally he was just the the ball just a face just the ball with the when did these commercials that are really cute the commercials are awesome I want to say los early 2000s I was going to say in the last 10 years May yeah no I mean I would I would have thought early 2000s and shout out to you do some follow here the wife in the Jack in the Box commercial she there was one time where she was in three separate commercials that ran during football where she was the wife to different people all over the place it was Jack and then it was like two other guys yeah Jack in the Box is uh is one of the ones that to me is really near and dear to me because it was closest to my house growing up Kevin",
            "start": 3628.8
        },
        {
            "text": "\"Place it was Jack and then it was like two other guys, yeah, Jack in the Box is uh one of the ones that to me is really near and dear to me because it was closest to my house growing up. Kevin, that's like eight-point font, no, no one knows what that some died, some little kid died, six-year-old died from Jack in the Box E. coli that I know happened. I know that happened, but what I'm curious is if they expanded to the East Coast and then truncated again after that because they really it's similar to what happened happening to Chipotle now where Chipotle is like eating **** **** right now because of all the food-borne issues that they're having. I wonder if it was a similar kind of thing back then Jack in the Box gave the people what they wanted, and I appreciated that they were like we're not going to play these games if you can only get breakfast at this time; you want breakfast at 3:00 a.m., you got breakfast at 3; you want breakfast at 94... The restaurant rebounded in popularity in 1994 after a\"",
            "start": 3663.68
        },
        {
            "text": "play these games if you can only get breakfast at this time you want breakfast at 3:00 a.m. you got breakfast at 3 you want breakfast at 94 the the restaurant rebounded in popularity in 1994 after a successful marketing campaign that featured the fictitious Jack and the Box chairman Jack character Voice by bunch of kids died a bunch of kids died yeah I remember I remember I remember that but the but I think it's Jack in the Box I don't think it's Hardies or something like that uh they also have the commercials with no without Jack I think it's them that are clearly aimed at late night Stoners do you guys know what I'm talking about Munch meal yeah like that's them right is that Jack or is that hard huh that's T four fourth meal is Taco Bell the lady munchy meal from jacknob box is like I said give the people what they want best deal in Fast Food Bar None $7 you get a box you get to choose whatever Burger you want and the burgers are like the crazy Burgers it's like you want ****\n\nCorrected chunk:\n\nplay these games if you can only get breakfast at this time you want breakfast at 3:00 a.m. you got breakfast at 3 you want breakfast at 94 the the restaurant rebounded in popularity in 1994 after a successful marketing campaign that featured the fictitious Jack and the Box chairman Jack character Voice by bunch of kids died a bunch of kids died yeah I remember I remember I remember that but the but I think it's Jack in the Box I don't think it's Hardee's or something like that uh they also have the commercials with no without Jack I think it's them that are clearly aimed at late night Stoners do you guys know what I'm talking about Munch meal yeah like that's them right is that Jack or is that Hardee's huh that's T for fourth meal is Taco Bell the lady munchy meal from Jack in the Box is like I said give the people what they want best deal in Fast Food Bar None $7 you get a box you get to choose whatever Burger you want and the burgers are like the crazy Burgers it's like you want ****",
            "start": 3696.32
        },
        {
            "text": "I said give the people what they want, best deal in Fast Food Bar None $7 you get a box, you get to choose whatever Burger you want and the burgers are like the crazy Burgers it's like you want Cheetos on your burger, you want some hot Cheetos on your burger, it's like yeah you want to do that then you get uh they give you the tacos, shout out to Jack in the Box tacos but then they give you fries and curly fries why make decisions seven bucks gets you at all you don't you need them both cuz you can't make it you know why they did that someone did a cost benefit analysis and they're like people cannot choose between the fries when they're stoned at 2:00 in the morning you just got to give them both burning commercials are so weird though that that advertise them that are like clearly aimed at people that are stoned and I was saying to someone when they seem to be aimed at people that are stoned at the time they're watching them which to me is a little dangerous game",
            "start": 3735.0
        },
        {
            "text": "aimed at people that are stoned and I was saying to someone when they seem to be aimed at people that are stoned at the time they're watching them which to me is a little \"Dangerous Game\" you're playing cuz now you're getting people who know only ever been to Jack in The Box post drinking like I I've never in my life been like I'm gonna go to I'm hungry I'm Gonna go to Jack in the box yeah no I've never done that either I I had a bad experience at Jack in the Box once actually kind of turned me off as soon as I got there I I drove to the one I think over at uh Colorado that BART station right there's one over there by the Home Depot area no anyways doesn't really matter at all it was the first Jack in the Box I'd ever seen so I drove over there to get a beer or not to get a burger cuz I never had it before like sure we don't serve beers I am Beer Jack would want so Kevin Went Away so we're going to be a little behind but to get ahead of this little C I asked him for a beer and that's why Cesar",
            "start": 3772.84
        },
        {
            "text": "it before like sure we don't serve beers I'm a beer fan Jack would want so Kevin went away so we're going to be a little behind but to get ahead of this little C I asked him for a beer and that's why Little Caesar's Pizza is because Little Caesar's Pizza Pizza meant something when it happened and then it didn't mean anything for a long time then it meant something again like little pizza pizza was like you get two pizzas for the price of one that was the idea of him saying it so when they stopped doing that then the whole pizza pizza thing became well then they went crazy and now they like doubled down on the $5 deal I know for a large pizza and it's just like yeah but it tastes like cardboard Little Caesar's Pizza used to be awesome when it was fresh it was awesome it was good when I was poor though when I first moved here I used to eat at the corner of Geneva and Mission there's a a Little Caesars that I used to go to all the time you just get walk out there were $5 for a hot pizza",
            "start": 3806.4
        },
        {
            "text": "when I first moved here I used to eat at the corner of Geneva and Mission there's a Little Caesars that I used to go to all the time you just get walk out there were $5 for a Hot-N-Ready pizza and just dip it in Wishbone Italian dressing all night yeah there was when I live when I live with Mike over in South San Francisco there was one yeah where I could you there was a $5 and I'm making good money at IGN I was able to go over there when we first started and I was doing it all the time but what breaks my heart is that you know back in the Miller household Friday night was always pizza night it's you reward yourself for not blowing your brains out this week let's eat a Hot-N-Ready Pizza you know what I'm saying and so for a long time it was the local establishment Bonanza downtown Glen Park delicious amazing some point I don't know if they had a fight well I don't know what my parents had against Bonanzas we stopped going there and we I think we got that's you should look into that",
            "start": 3849.64
        },
        {
            "text": "delicious amazing some point I don't know if they had a fight well I don't know what my parents had against Burger King we stopped going there and we I think we got that's you should look into that should we moved to Little Caesars and this is right at the point where Little Caesars is like we need to change the game Pizza Hut's putting cheese in their crust we're going to put cheese in our crust but put pepperoni in it as well and then like people love Crazy Bread let's put cheese in that and pepperoni in that and I will never forget being so excited and eating that stuff and being old enough to know this is bad I probably shouldn't eat this each week or at least my parents should make me exercise but I didn't stop and I just kept going here we are today yep it all makes sense it turned out okay keep going Kev so next up we got Ronald McDonald can you please get him off the screen there we go King The King The King was great the king made a comeback man he used to be this little",
            "start": 3883.24
        },
        {
            "text": "okay keep going Greg so next up we got Ronald McDonald we can remove him please get him off the screen there we go, The King was great, The King made a comeback man he used to be this little punk ass b**** and then he came out and he's like I'm creepy as hell they doubled down on the McDonald's thing they're like we get it he's creepy let's make a joke out of this and turn it into a beef my thing was beef no pun intended my thing was what was he a thing before I don't remember there being a Burger King that I saw until this there was cuz remember they had the crowns The I remember I'm not saying the crowns didn't exist I'm just saying I don't remember there being a visual representation of Burger King there was a king a little cartoon King but like no one gave a **** about him I don't feel like Burger King gets its its uh it's proper no it's proper kind of fast food Burger King is really actually very good this what we're talking about last you came in Burgers",
            "start": 3920.64
        },
        {
            "text": "him I don't feel like Burger King gets its proper due as one of the better fast foods. Burger King is actually very good, this what we're talking about last time you came in? Burgers they're way better at burgering than McDonald's. You guys are there's no doubt about that. The fries, the fries are no one can McDonald it's not possible **** sucks. Who's ordering the Whopper gets a cheeseburger? The Whopper doesn't suck, all those fancy burgers are fancy but the Whopper is really fantastic if it's made properly and that's a really important thing because there's so many toppings on it they can be very made very frivolously and very poorly and then it falls apart. Here's a suggestion just get the double or triple get a lot of cheese on there keeps it all together makes it nice construction keep the paper around it eat it like that I us you can't take it out of the paper you got to eat the paper I mean",
            "start": 3959.52
        },
        {
            "text": "Triple A gets a lot of cheese on there keeps it all together makes it nice construction keep the paper around it eat it like that I us you can't take it out of the paper you got to eat the paper I mean I've told you many times when I was at Northeastern I used to go to Burger King all the time and then it just disappeared what happened to Burger King nobody knows nobody knows what happened to Burger King one day it was just gone but God I spent thousands of dollars in that place probably when you know cuz at probably every college they put money on this card yep you know and so at the beginning of every semester you just had what we used to call free money yeah especially remote used to call free money we just used to go go spend a Burger King and I you know you get a lot of bang for your buck that was before I realized I could just start stealing from the dining hall instead so I started doing that instead I mean at Northeastern that was my I mean that's",
            "start": 4000.8
        },
        {
            "text": "of bang for your buck that was before I realized I could just start stealing from the dining hall instead, so I started doing that. That was my first Chick-fil-A experience at Missoula's little food court had a Chick-fil-A in there and you go over there and eat those sandwiches, be like \"Jesus, it's going to be better here\" and it's awesome. I feel like in the world, there are McDonald's people and then there are Burger King people. I like all the rest of them are kind of just extra. It's like, oh, I like McDonald's but I also like Jack in the Box. Part of this comes down to my aversion to onions and the fact that McDonald's are around by default and Burger Kings aren't. Yeah, they only put pickle, ketchup, mustard exactly what I want on my burger so it's just perfect flame",
            "start": 4031.76
        },
        {
            "text": "Are around by default and Burger King's aren't, yep, I get them added, but they don't. Yeah, they only put pickle, ketchup, mustard exactly what I want on my burger, so it's just perfect, flame broiled, delicious, let me tell you a quick story, quick anecdote when to Jake Stakes yesterday in the marina, which is a cheese steak place, okay, pretty good. Saw in the back display case uh Smurf Board of drinks soft drinks they Coke and they had Pepsi, you know, the Pepsi one, one with the Pepsi logo on it, the last time. Let me go through that list real quick. Long John Silver's I don't even know who the guy is, John Sil is a seafood restaurant, no, I know that, but who's the mascot? Probably a pirate, the no, he's like he's got a hat that goes this way. You think the Gordon fish never went there, number three on this list, I hate Seafood, big old Greg Miller loved himself some Long John Silver's loved",
            "start": 4063.68
        },
        {
            "text": "the no he's like he's got that hat that goes this you think the Gordon Ramsay never went there desert number three on this list I hate Seafood big old Greg Miller loved himself some Long John Silver's loved whatever fried breaded stuff was being put in front of your face oh I'm talking about my dad my dad Big's skinny so yeah yeah yeah he's doing something wrong we call him the camel Wendy's yeah whatever well I like briefly when they they brought out the real Wendy and started after Dave Thomas hat yeah Dave Thomas was the homie dude yeah but yeah they brought his daughter out everyone hated her then they brought out the hot yeah all right cool I'm just some I'm who I I always meant to do when I was still doing Greg's ways back in the day so this is a deep cut I wanted I started trying to gather footage cuz I wanted to do a Greg thing about her fall from grace cuz she went from being a magical creature who popped into your car when you thinking about Wendy's and took you to Wendy's and then",
            "start": 4109.4
        },
        {
            "text": "footage cuz I wanted to do a Greg away about her fall from grace cuz she went from being a magical creature who popped into your car when you thinking about Wendy's and took you to Wendy's and then she just started working boring office jobs where she's just like guys you want to go to Wendy's today guys I'm eat a salad like weren you like a **** angel or a pixie or something now you got no magic I don't remember any of this that's crazy so so last on the list is the Colonel they're **** the Colonel what is up with the shout out to the Colonel generally but not what they're doing now this rotating cast of Colonels it's it's a different it was um Nor McDonald for a minute yeah well that's the whole thing is it was that it's always it's been on the schedule where it was him it was uh Darrell Hammond it it's now Ron White whatever his name is uh there's somebody else in there too I'm forgetting but yeah it's been weird like we just pick somebody yeah make it just or don't even do this",
            "start": 4151.16
        },
        {
            "text": "Hammond it's now Ron Wiggles, whatever his name is, uh, there's somebody else in there too I'm forgetting but yeah it's been weird like we just pick somebody yeah make it just or don't even do this at all. Darl Hammond needs the work just let him be the C for God he's waiting for Bill Clinton to do something. God you know he's like **** why couldn't Hillary have won. God I would have so many guest interferences. So to close out this topic we've been talking a lot about most of these mascots were created in the 70s right, the SpongeBob SquarePants or whatever the **** that was obviously an abomination of the you know early 2000s or whatever sure but they were a really special time that brought us the Burger King kids club kids club yeah there they are. Can you expand that a bit Kev this is the most 90s group of **** you could Poss want to hang out with him man all right we got JW, Jaws the cool tall black guy right yeah then we got The Ambiguously Gay duo",
            "start": 4193.2
        },
        {
            "text": "Most 90s group of **** you could want to hang out with him man, all right we got Joe (JW) Jaws, the cool tall black guy, right? Yeah, then we got The Ambiguously Gay duo, like what race is he? He's ethnic; he looks like Alfredo. Yeah, lingo there, he is. Then what, what's the girl's name? Can you see Boomer? We got Boomer, Boomer Sports Girl. Then we got Wheels, the kid in the wheelchair. They're trying to be inclusive but also offensive, so that's the thing - when you try so hard then you get it wrong. Of course, there's the cool dog with the helmet, I.Q., the nerdy kid with the glasses, Kid Vid, who was like the mascot. I remember, I remember, and ****, and you can get his toys. And then what's the other girl's name? Snap, Snap, Snatcher, call her a vagina anyway. These guys, I remember; they were the homies. Did you join the Burger King crew? Yeah, yeah. Did you have a pen pal? I never did all that. I had a pen pal through which is so weird to think about - that I mailed to Burger King and they're...",
            "start": 4232.8
        },
        {
            "text": "the homies did you join the Burger King course yeah yeah did you have a pen pal I never did all that I had a pen pal through which is so weird to think about that I mailed to Burger King and they're like all right here's some other random kid's address enjoy talking to him I mean this kid did we corresponded over our joint love of Burger King I guess how long you you have the letters oh no no I doubt it I doubt that's too bad I know that would be great that would be great I think his name was David So if you're out there David I vaguely remember you we had we sent photos of each other oh your weird fan fiction little on did he really yeah you should have known then Davy Crockett Benjamin Franklin wannabe  Davy Crockett everybody knows Davy Crockett had the when Benjamin Franklin was in France as our ambassador during revolution he used to wear a  deerskin cap on purpose to make the Americans look like they were very quaint because it made them",
            "start": 4288.48
        },
        {
            "text": "Had the when Benjamin Franklin was in France as our ambassador during revolution, he used to wear a deerskin cap on purpose to make the Americans look like they were very quaint because it made the French want to work with us more and they thought that they were we they thought we were very strange so he would like always wear the deerskin cap like even at dinner like state dinners when they came over, they were expecting deerskin everywhere; they didn't find any when Alexis de Tocqueville came over decades later, the hats he's like to wear, he brought a whole bunch of ones. We did that's a true story yeah he always used to wear the deerskin cap to play off his Americanism because they always thought that was really cool and C yeah we give you money is this before after he discovered electricity fools uh it was after he discovered electricity; he didn't discover electricity but he it was after he got zapped by the lightning bolt in his kite well he figured out that",
            "start": 4326.88
        },
        {
            "text": "fools uh it was after he discovered electricity he didn't discover electricity but he it was after he discovered it he got zapped by the lightning bolt in his kite well he figured out that lightning was electricity fried off the top of his hair and to start wearing the wigskin cap right back went back in time it's very fat got to go back how fat was he I don't know how fat he was I want to say he was pretty fat especially for the time if you guys watch John Adams on HBO was fantastic series by the way Paul Giamatti is John Adams really great uh based on uhle literally just open based on the David McCullough book it's really really great there's a great scene of him uh wearing a wigskin cap in a bathtub naked with like a some French chick playing chess he apparently was like a total womanizer and totally like out of control over there who who played him in the in the HBO series Benjamin Franklin I don't I I don't remember there's a lot",
            "start": 4360.76
        },
        {
            "text": "chess he apparently was like a total womanizer and totally out of control over there who played him in the HBO series Benjamin Franklin, I don't remember, there's a lot of famous people The Rock, I gotta look that up now, ah great show, great show, love it Colin, what's your topic, the weather, it's raining right now, not specifically the weather now Kevin throw open that window, I want to see how because it's not even just raining, it's like storming, it's windy, shit's blown around, it's not that bad, it was really bad by California standards, it's pretty bad, it's really annoying is what it is, I love it, I hate it so much, I don't know, see you're one of those people, obviously, how can you like the rain, how about it cool when you're inside it's all nice, it's like oh I guess I can sit here and ride and I can sit here and play games, I can see I get all that stuff but then then when you go outside it's like this is the worst thing of all time why going",
            "start": 4399.56
        },
        {
            "text": "it's like, oh, I guess I can sit here and ride, and I can sit here and play games; I can see I get all that stuff. But then, then when you go outside, it's like this is the worst thing of all time. Going outside in the rain just causes problems, even when you're inside. Like, you don't have a chance of flooding when it's not raining, but you do have a chance of flooding when it is raining. Everything gets all messed up. It's dumb. Might die so dumb. To be fair, though, I don't like the heat either. I like San Francisco being San Francisco; give me 65 degrees, call it a damn day. There's no competition. I understand New York has it worse. I understand LA is hotter. Texas is really hot on the sun. Texas just needs to stop. Texas has these heat storms that are just so hot where I'm like, why can anyone live in this world? And then they have their thunderstorms and lightning storms, and it's just like, oh, this is just natural. We're flooding right now, but it's just cool. No guys figure your",
            "start": 4440.2
        },
        {
            "text": "this in this in this world and then they have their thunderstorms and lightning storms and it's just like oh this is just natural we're we're flooding right now but it's just cool no guys figure your **** out well the major thing about that the South and Southwest specifically like that I always think about about is uh people lived there like the oldest city in North America uh well founded City by European colonists is Santa Fe and that was found in the 1500s could you **** imagine being down there well there's probably like a few hundred people of your kind even anywhere on the continent and you're walking around like in that **** heat with 500 years away from Air Conditioning that terrible kind of thing I don't know how anyone ended up down there no wonder we didn't want to go further south the uh the thing I want to ask about weather was what is the perfect weather and Tim Gettys asked that or answered that question because I I I can car I miss seasons and I think there's",
            "start": 4479.84
        },
        {
            "text": "go further south the uh the thing I want to ask about weather was what is the perfect weather and Tim Gettys asked that or answered that question because I I I can care I miss seasons and I think there's something to be said about that I think it changes the way you think and the way you feel and watching the leaves fall watching the snow come down for the first time watching flowers pop out of the out of the uh watching flowers pop you do that every Friday night watching flowers pop out of the soil and and you know March April I remember you used to get really you know excited about that when I was a kid like that we had these um like these all these different plants in front of our house and you kind of predict like when they would come up and and start to bud and stuffff like that so I missed that but at the same time I think about the horrors of winter and uh especially in Boston but New York Winters are no joke either and uh and all that and then I came to realize that I think the",
            "start": 4521.12
        },
        {
            "text": "that but at the same time I think about the horrors of winter and uh especially in Boston but New York Winters are no joke either and uh and all that and then I came to realize that I think the best part of San Francisco not so much rainy season which happens and it seems to be quite bad this year uh is the nine months or so of uninterrupted mild weather uh that requires no more than a sweatshirt um I can always use one you know yeah I fashion over function you can look you can wear whatever the hell you want it's really it's really kind of an interesting and unique and special place in that regard like San Francisco has some things going for it and some things not going for it but I think one of the things that is somewhat understated by people that visit is the the great weather because I think when people come to California they expect Los Angeles type weather and you get that if you go to Sacramento or you get that if you go to the San Jose but there's just something about",
            "start": 4557.88
        },
        {
            "text": "I think when people come to California they expect Los Angeles type weather and you get that if you go to Sacramento or you get that if you go to San Jose but there's just something about this specific microclimate on the peninsula that's just all messed up and you saw it again, you just see it actually even in times like this the rain where we've been getting in the city is not even remotely like the rain everyone else is getting for some reason like people are getting destroyed by the storm north of us south of us inland but for some reason San Francisco is just getting normal rain and then you watch the local news and they're like down in you know San Jose it's apocalyptic you know and I'm like it's only 45 minutes away what is protecting us from this, this is a weird microclimate kind of thing so I have to give a shout out to San Francisco's weather and say that all things being equal it has the finest weather and if I ever left here and I'm I assume one day I will",
            "start": 4592.36
        },
        {
            "text": "Kind of thing, so I have to give a shout out to San Francisco's weather and say that all things being equal, it has the finest weather. And if I ever left here, and I'm I assume one day I will, that's the thing I will miss the most - is that you know, you can't take that for granted. We don't have to bundle up here; you don't have to sweat it out here. There might be a day or two of both every year, but otherwise, like I like the idea of just going to put... I've actually gotten into the habit of even checking the weather, you know? And which makes times like this very unique as opposed to New York or Boston, where it's like, you know, it's a show. So yeah, yeah, I mean I grew up here, so I'm very familiar with how the weather patterns work. And for me, especially in school, it was a bigger deal because I would have to take the bus and I didn't have a car, and all that. So the first week or so when you come back to school...",
            "start": 4625.8
        },
        {
            "text": "work and for me especially in school it was a bigger deal cuz I like would have to take the bus and I didn't have a car and all that so the first week or so when you come back to school so you're talking like early September maybe late August there would just be two weeks of heat and it was always like way hotter than it will ever be the rest of the year then all of a sudden it just goes right back to what it was and then somewhere it's always it always changes but either December January or February there will be this like 30 days of just rain and wetness and freezing cold but I will say it's colder now than I think it's ever been it's never been this cold here it's weird and I every so many people I know are are bringing that up as well where they're just like what the hell like why is it so cold now yeah it's it's it has been excessively cold over the last like I say last week was probably the coldest I've ever been in San Francisco with the point where I was",
            "start": 4657.68
        },
        {
            "text": "like why is it so cold now yeah it's it's been excessively cold over the last like i say last week was probably the coldest i've ever been in San Francisco with the point where i was like i cant wear i cant go barefoot in my apartment cuz the hardwood floors are freezing my foot um i'm kind of like i i'm torn because i love the weather up here i love that we have seasons i love my favorite season i love when fall happens and you start you start feeling that briskness in the air and youre like oh i might need a coat um but i i still got to go with Southern California's weather i got to go with LA's weather or San Diego where it's just kind of warm all the time sometimes its excessively hot its not kind of warm youre melting well i mean it depends on when you go down there but for the most part its just its just warm outside and nice you can wear shorts and flip flops and t shirts everywhere and its awesome and i miss i do miss those days of like there was no question",
            "start": 4703.72
        },
        {
            "text": "for the most part it's just it's just warm outside and nice you can wear shorts and flip-flops and t-shirts everywhere and it's awesome and I miss I do miss those days of like there was no question I was going to wear from like for like six months out of the year it was just I'm going to wear shorts and flipflops unless I'm at work that's just what's going to happen and like no matter what you just you were just kind of like yeah kind of breezy was fun to not just be a hater I will give a shout out to to LA and Texas nights oh yeah like when it's when it's a warm night not the horrible stormy nights in Texas but what thunderstorm is fun no they're the worst they're even worse than this cuz then it's like great all there's a 50% chance of a blackout like there's nothing fun about the rain there's nothing fun the no the rain's fun no what's what's fun give me give me the rundown the sound like earlier today when I mentioned today in the morning show I wanted Nick to kill the light and",
            "start": 4741.84
        },
        {
            "text": "there's nothing fun about the rain, no what's fun is give me give me the rundown, the sound like earlier today when I mentioned today in the morning show I wanted Nick to kill the light and just sit here and listen to the rain hitting the rooftop, YouTube it's coming down, look it up, find I I don't want to YouTube search for **** I am an idiot, wow that's the file that'll come up, wow okay no see no you're wrong about all that, see the problem is that right now so it's the winter storm of rain here so it's cold out as well, I love a good summer thunderstorm especially when it is that oppressive **** heat all the time, you're suburbs of Chicago team it's humid it's hot and those dark clouds start rolling in and that shade gets cast down and there's that chill in the air all of a sudden you're like oh it's going to happen you go there you still have your windows open it's like middle of the day you're off school you lay on the couch and you play a game and you just hear it coming",
            "start": 4779.24
        },
        {
            "text": "you're like oh it's going to happen you go there you still have your windows open it's like middle of the day you're off school you lay on the couch and you play a game and you just hear it coming down out there and like lightning bolts and then all of a sudden you can't play games anymore cuz there's a power outage yeah you know maybe you do maybe you know you blow the fuse then you have to go outside and it's like great you don't have to go outside I understand what you're doing so outside you have to go do something there's a task that requires you to go to school or do some stuff like that so you get in the car you drive where you're going you get you go from your upstairs to your garage into the car you're out this is the thing when people are always like oh it's so cold on stuff you get from the car to the restaurant from the restaurant to the car from the car to Walmart to the you're not it's not you're getting everyone's out when it's raining so it's like",
            "start": 4815.52
        },
        {
            "text": "Staff you get from the car to the restaurant, from the restaurant to the car, from the car to Walmart. You're not it's not you're stuck. You got everyone out when it's raining, so it's like it's a nightmare in terms of car transportation. The worst part about the rain and transportation is everyone's driving, so you can't go to like a mall or a restaurant because every motherfucker's there because they're trying to get away from this stuff or you're a kid that has to take the bus and then everyone's on the bus. Then you get on the bus and it feels like a New York subway station where it's the hottest thing ever, it's terrible, terrible. I will say that the one thing that is missing from your experience, and your experience that you guys will never experience, you're too late now, is the joy of the snow day. And um, because winter, I love winter, I think blizzards are like these disaster storms, the best man. I have great memories of like especially living when I was younger and",
            "start": 4845.92
        },
        {
            "text": "day and um cuz winter I love winter I **** love winter I think blizzards are and like these disaster STS the **** best man I I have great memories of like especially living when I was younger and those times I spent in New England but also long I remember building a huge snowman with Mike Pope in the middle of the street uh and then watching a school bus just plow it which was like no I don't mean literally plow just **** run it over it was it was really awesome I remember being in sixth grade and walking out in Maine when I lived there for a little while the snow was up to like my chest and I was like this is insane like I've never seen anything like this before in my life um and you guys can't understand Greg knows but the trepidation of the night before you hear the snow's coming you know it's snowing you have to have the timing just right you're on you're watching the local news and and on the bottom is all the school closing scrolling have a geometry test or some ****",
            "start": 4888.56
        },
        {
            "text": "you know it's snowing you have to have the timing just right you're on you're watching the local news and and on the bottom is all the school closing scrolling have a geometry test or some **** that next day that you're terrified like you're like I don't want to study for this they're predicting it's a real storm I probably going to get the snow day but I got to kind of stud but I don't want it but I got to kind of and it's it's just amazing news 12 on land was the local kind of thing and you'd watch it and they'd have it just scrolling and then you'd always every once in a while everyone got **** once in a while where everyone was closed except for you you had a 2 hour delay no you know or you had to just go it's like why why you know all these other places around us are close but then you'd have the one where it was like I remember there was like a week or two continuous just closed schools um was it snow or cold it was snow see for us I think I had way more cold days than I did",
            "start": 4929.76
        },
        {
            "text": "you'd have the one where it was like I remember there was like a week or two continuous just closed schools um was it snow or cold it was snow see for us I think I had way more cold days than I did snow days cold days where it is too cold to go outside the we're afraid the a pipe has burst uh the the similar you're saying something froze and took out a power line uh it is just too cold don't come I remember being at a fifth grade basketball practice and there was like the it started like that Scuttle butt if somebody over the you know parents the coaches and some parents said it and it kind of like spread through the crowd that this might happen at the end like Anthony DiMaggio's mom came down I was like no school tomorrow it's too cold the phone chain yeah yeah oh yeah the phone trees yeah yeah the phone trees that's what it was yeah the uh so that's like a special kind of joke cuz my sisters are teachers in Virginia and it's it gets snow down there not as bad as we did but any snow it's",
            "start": 4964.36
        },
        {
            "text": "the phone trees that's what it was yeah the uh so that's like a special kind of joke cuz my sisters are teachers in Virginia and it's it gets snow down there not as bad as we did but any snow it's like kind of like rain here like no one understands rain in San Francisco I've never seen anyone people the way people drive here even when it's raining I'm like what's going like it's not like the end of the world you know well to be fair driving in the rain is very scary and it's like a little but you're just more used to what I'm saying is that they're just not used to it here as opposed to as opposed to out out in other parts look at me is your microphone on cuz I'm not going to engage you unless you put your microphone was that a look at me because of what happened Saturday yeah when you lost control of the car three times that wasn't my fault it's the rain's fault cuz the rain is stupid maybe you just drive a little bit slower were big puddles and I told you",
            "start": 5003.4
        },
        {
            "text": "you lost control of the car three times that wasn't my fault it's the rain's fault cuz the rain is stupid maybe you just drive a little bit slower were big puddles and I told you and that's why you should avoid him on hydro plane just drive a little slower come on it was fun we made it it was fun it was also fun when we were driving your car just turned off never seen that before the truck but we're in the road and it turned off okay so I'll say this I'll leave it here shout out to weather but but also shout out to just being able to observe but not necessarily live in it yeah and uh winter every day it's snowy those are the times I remember playing video games I have I have I have specific memories of specific games and specific weather systems or or these storms or things that would come through I get so excited man when like cuz it's it's October November December J like not January but like back in the day games would come out during this time so I remember just hoping",
            "start": 5037.04
        },
        {
            "text": "come through I get so excited man when like cuz it's it's October November December J like not January but like back in the day games would come out during this time so I remember just hoping and praying I can play more Tales of Destiny if it would just snow and then it would snow and you get a snow day mercifully on a Friday or a Monday get a long week my God are you kidding me it was the absolute best but then it was so bad when you just the snow would come too early too late you're on the precipice and nothing I always hate when I remember games I'll never forget that the weathermen predict it's going to be terrible don't expect to go to school tomorrow and then you go to school tomorrow **** I'll never I'll never forget weather sucks for the most part I like I I I'm with you like I miss fall I love but I I get now it's kind of like when uh your friends have kids you get to visit and be like the cool uncle and then just bounce it's like oh man I miss fall I go back to Columbia hang",
            "start": 5074.56
        },
        {
            "text": "Fall, I love it, but I get now it's kind of like when uh your friends have kids you get to visit and be like the cool uncle and then just bounce. It's like, oh man, I miss fall. I go back to Columbia, hang out for a football game. It's nice, it's cool. I'm putting on sweatshirts and like it's colder than is in San Francisco, and the trees are doing their thing. I'm like, yeah, then I come back to San Francisco where it's always the same and same thing. This past trip was cool; I'm going to go to Montreal for winter and it's like... snow, but Jesus out there, it's all fun, it's beautiful, it's all the stuff. But I can already see the other cars covered in that gray salt film of garbage and I'm like, oh no, this is around. I remember in Chicago, this is like from as soon as that first snowfall hits in late November, usually December, and then until like April or May, that film is on every car. I'm like, I don't want to, I can't be a fan of that but",
            "start": 5107.44
        },
        {
            "text": "as soon as that first snowfall hits in like maybe late November usually December and then until like April May that film is on every car radio I'm like I don't want to I can't not a fan of that but it was fun to visit and see and put on snow shoes and walk around and slide a bit and see the Pyrenees in the snow again but then I got to come back here to where it's pretty normal except for right now and it's raining but even this is normal I expect the rain like this but it's not the fun rain cuz even when I go back to when I went to St Louis for a friend's uh birthday and it was tornado season and we're out there and the sky goes dark we're like oh **** everybody go inside and like oh the sirens are going it's pitch black it's hailing I'm filming we're out there drinking beers I'm filming the hail I'm like this is so cool then the tornado siren goes off like all right let's go downstairs to the basement we go downstairs to the basement I'm filming out the window it's like yes I I I remember this and I",
            "start": 5141.84
        },
        {
            "text": "Hail, I'm like this is so cool then the tornado siren goes off like all right let's go downstairs to the basement. We go downstairs to the basement. I'm filming out the window and it's like yes, I I I remember this and I miss it but I don't know you said that this isn't the fun one. You then went on to describe what is supposed to be the fun one involving going to a basement during a tornado warning with sirens going off. The amount of times as a Midwest child I have been in a tornado or not even in a tornado, I've been in a few tornado warnings if sirens are going off it's really happening you're like it's not happening here it doesn't happen here the houses are too packed together. I was outside this is when my friend lives in St Louis but in South City right is a section of the city right outside the Anheuser-Busch brewery no tornado's going to come through there but the guy looks menacing yeah let's go down you know what I mean it's not going to get you but you just in case you go down there.",
            "start": 5177.72
        },
        {
            "text": "the Budweiser brewery no tornado's going to come through there but the guy looks menacing yeah let's go down you know what I mean it's not going to get you but you just in case you go down there no I get that but you describe that as fun yeah well yeah I mean I missed it I haven't had it happen in so long again that chill in the air all of a sudden the hail the Hail and the rain stops suddenly but it's still pitch black out you're like oh man this is cool we could all die real soon but we're not going to it's a thrill I get it there was one time in Colombia where yeah it was me and my ex and we she was like I need to go get a dress for a wedding or whatever and like I'm like all right cool there's a storm system now let's just go and we drove down I-70 which is a terrible idea and you got like we got like an hour into the ride but only made it like 45 minutes outside of where we should have been an hour and then we got to where all the semis were blown over on the road like all the",
            "start": 5215.4
        },
        {
            "text": "like we got like an hour into the ride but only made it like 45 minutes outside of where we should have been an hour and then we got to where all the semis were blown over on the road like all the semi-trucks and I'm like alright let's turn around this is a bad idea probably a bad idea we tried Colin, my topic is La La Land I have seen La La Land you boys have seen La La Land Kevin has it seen La La Land in the dark there right we're going to talk about La La Land now if you haven't seen La La Land turn off the podcast or come back later uh Nicholas yes you were very adamant that we need to do this topic yeah why is that because I think this is a special movie I **** awesome yeah I think this was a movie that um that really took me by surprise um I saw the preview for it and from the very you mean like the trailer yeah the trailer for it rather um and from the second that Emma Stone walks into the the bar yeah and he just immediately walks up and kisses her",
            "start": 5249.4
        },
        {
            "text": "for it and from the very beginning you mean like the trailer yeah the La La Land trailer for it rather um and from the second that Emma Stone walks into the the bar yeah and he just immediately walks up and kisses her yeah I'm like all right this is going to be something different and something unusual and something cool and I was hoping I was hoping very much that I would like it and sure as **** when I went and saw it it it got me I'm like I this is a modern-day musical musicals for the most part don't really exist anymore unless there's something huge happening on Broadway or someone decides to revive an older already established musical but this is an original Musical that has been made into a movie this by all accounts shouldn't have happened right like there's just not really a system that we have in in our modern day Society where it's acceptable just like musical yeah oh let's go see a musical right no can you name the last musical you saw that wasn't a Disney film I mean I mean I I think",
            "start": 5293.8
        },
        {
            "text": "in our modern day society where it's acceptable just like musical yeah oh let's go see a musical right no can you name the last musical you saw that wasn't a Disney film I mean I mean I I think that this movie came out at the perfect time I think that we've been primed for this for so many years my generation with things like High School Musical and with all the Disney uh animated musicals not to mention Hamilton doing well uh Book of Mormon there was stuff like that and South Park: Bigger, Longer & Uncut (a 1998 musical episode) though I know I'm just I'm just I'm laying the groundwork for why yeah and you know I feel with the the rise like we recently had a talk about musicals of hair spray and um Captain or Peter Pan and oh the musical lives yeah that I think that we're at a perfect place for for this movie to come out and it it was magical it was such a good movie experience and like I I don't even judge it as oh it was a good musical I think it was a fantastic movie I don't think it even needs",
            "start": 5331.36
        },
        {
            "text": "movie to come out and it it was magical it was such a good movie experience and like I I don't even judge it as oh it was a good musical I think it was a fantastic movie I don't think it even needs the um the genre attached to it well I for me the most surprising thing is when I remember seeing the trailer as well and being like that looks **** awesome not realizing it was a musical but it was the when they started like uh floating into the air and like the uh planetarium I guess or whatever and just W like what you're talking about that running up kissing not to mention that like I was like I've talked in previous things about like I like Dwayne \"The Rock\" Johnson and I like Kevin Hart, and there's a picture of them sure sure I'll go see it I like Emma Stone and I like Ryan Gosling a lot so like to have them back together in a movie like oh yeah **** that looks great but the fact that the trailer was so good and then the movie was even better is what I think is most amazing about this and the fact that",
            "start": 5375.32
        },
        {
            "text": "back together in a movie like oh yeah **** that looks great but the fact that the trailer was so good and then the movie was even better is what I think is most amazing about this and the fact that usually it's the opposite oh man great trailer mov like all right well that's Suicide Squad oh God no I mean you're right though when I first saw the trailer I was like I'm seeing this movie like you guys won me over you did your job with this this looks epic this looks amazing and it was it paid off in every single way and what I enjoyed the most about it was once it ended I had experienced so many different emotions throughout it and I feel like all of them were earned and I liked that even at the end of it there was things that I'm like oh man why didn't they do this or this could have happened differently or whatever but it's like felt good it didn't feel like oh man they **** that up it felt like they they told a story and they made good choices and I I really like and I'm assuming",
            "start": 5411.28
        },
        {
            "text": "Differently or whatever, but it's like felt good. It didn't feel like oh man they **** that up. It felt like they told a story and they made good choices, and I really liked it. And I'm assuming we're spoiling this for non-spoilers - no, we should go all in. I think people have seen it right? Like, non-spoilers: the movie's great, go see it, come back and watch the rest of this video now. My Movie 2016 was my favorite movie by far of 2016; it was so good. Um, and I could not recommend it more. I've been listening to the soundtrack every day - that's the yeah, me too. When I'm working on the computer or if I'm you know like in the morning when I put stuff on my Bluetooth speaker in the bathroom, I've been listening to it too. La La Land is so good; it's just so damn good. But I love what I was saying is the end of it - I think they did a really interesting thing that's open to interpretation. When you see what happens...",
            "start": 5451.52
        },
        {
            "text": "just so so damn good but I love what I was saying is the end of it I think they did a really really interesting thing that is open to interpretation uh when they kind of you see what happens and it's the more like this is what could have been I like that they did it on a more on the actual Sound Stage that we saw earlier in the movie and it was they recreated the movie as if it was an Old School Musical and I like that that's open to interpretation not only of is this supposed to represent uh what could have happened or is this supposed to represent what did happen in a just alternate timeline or is this supposed to represent uh what would have happened if this was a musical that was made in the '50s because I like the whole style that they did of like recreating all the different things practically even though earlier we saw like the planetarium scene or whatever or the traffic um thing was all you know huge when they redid it as what an actual stage musical would be I liked that it",
            "start": 5489.6
        },
        {
            "text": "practically even though earlier we saw like the planetarium scene or whatever, or the traffic um thing was all you know huge when they redid it as what an actual stage musical would be. I liked that it felt more like that would that would have been the typical story that was told and it was cool. What did you take away from the ending because Nick and Nick we haven't talked about it, you talked about it, you took away something completely different than what I did go ahead well for me I I took away that the that the extra thing was just more of like a a step back meta thing of this is what the musical version would have been of this but what they showed is that's what happened split up exactly yeah the movie they split up. I for me when I watched it all happen in in I for me it was happening in her head, this was her vision of like \"what if\" what if he had gone with me to Paris what if you know we had been together and it was this perfect love story and we",
            "start": 5531.68
        },
        {
            "text": "I for me it was happening in her head this was her vision of like \"what if\" what if he had gone with me to Paris what if you know we had been together and it was this perfect love story and we walked down here and then you know the timelines meet but then you were saying it was him right you you told me that you took it from Gosling's perspective um I think originally I did yeah because I think that they kind of the way the cinematography lends itself in that scene if I remember correctly kind of pushes your you toward that but I I don't think I necessarily defined it when I was watching I just thought this is this was their sort of they saw each other they walked in and this was sort of what their shared experience was when they were thinking about what their lives could have been and I think that they both kind of came to that conclusion at the end um that like that although it would have been good it still would have been missing something I think that no matter what like he",
            "start": 5571.56
        },
        {
            "text": "and I think that they both kind of came to that conclusion at the end um that like that although it would have been good it still would have been missing something I think that no matter what like he would like he wouldn't have gotten his club and so he would have been not whole right and I think you see that in that look when she walks out and she looks back at him he looks at her and he smiles and she smiles back at him like there's that that that um just acknowledgement that hey everything kind of turned out the way it was supposed to I think Kevin what did you turn on your mic what did you say cuz you were you it was another one where I was talking to you about it and you think he's unhappy at the end of the movie yeah um so I I kind of saw it more towards Nick like the way Nick originally saw it where that that was him playing out what would have happened if he hadn't gone and like had gone with her essentially yeah uh he wouldn't have gotten his dream but like before that",
            "start": 5607.16
        },
        {
            "text": "originally saw it where that was him playing out what would have happened if he hadn't gone and had gone with her essentially yeah uh he wouldn't have gotten his dream but like before that happens and we see him like running around the club the club but even before that his house he just seems so I don't know there seemed to be like a sadness in who his character was it seemed like how he was in the beginning of the movie where he was all by himself and he just didn't seem happy wait in the epilog scene where it's The Flash you know the alternate universe or whatever the **** it is didn't he also get the club in that as well no in that Universe he goes to a club and he realizes that someone else has his dream got it okay so he looks up and sees someone playing playing a piano in an amazing jazz club that's like everything that he's wanted and there's a moment on his face where you kind of get the feeling that like and I don't",
            "start": 5643.48
        },
        {
            "text": "up and sees someone else playing a piano in an amazing jazz club that's like everything he's wanted, and there's a moment on his face where you kind of get the feeling that...like, and I don't remember her face 'cause I was staring at him, but there's a moment where he just kind of looks and there's like a day's look on his face where he's like \"that's what I wanted\" and I sacrificed something to get that. And I think that's just...I someone in the comments remind me what was the name of the club Seb? In his dream, though - oh, I don't remember, like that because that's the thing I could have sworn it was his as well, but whatever. That totally changes things. That's the thing I want to go see again with Jen so I want to...it's one of those movies, it's similar to I talked about last year at the end of it, like all the movies I had seen",
            "start": 5691.0
        },
        {
            "text": "I want to go see it again with Jen, so I want to like it's one of those like it's one of those movies it's similar I talked about last year at the end of it like all the movies I had seen and how La La Land is the one that I stuck with and I thought about I felt like every day for a while afterwards and I the same thing here when granted I'm listening to it but I am still thinking about it in the same way yeah no man it's so so good and I I think that the what did I take from it from the end like epilogue aside I really appreciate the fact that it didn't to me feel like this is the only way it could have happened and I think that the epilogue kind of shows that the moral of the story isn't you either Choose Love or your dreams and it's not that you have to uh do this or that and you can't do both it's that there's a lot of different options that can happen and this is just one of the ways that this went CU I feel like they were so perfect together and everything made so much sense so",
            "start": 5731.92
        },
        {
            "text": "do both it's that there's a lot of different options that can happen and this is just one of the ways that this went CU I feel like they were so perfect together and everything made so much sense so the moment when it's she's like I got to go to Paris and he's like I can't can't go to Paris I was like really yeah why can't you like why can't you but it was just like I I really took that as that was just a decision made because he like he really felt at that moment after everything that happened in that movie after he did totally change the course of his dream to get her like I think that the the use of City of Stars throughout the movie how it keeps coming back in different ways uh is really the Thematic through line of the entire movie and like when it turns to the scene of them in the apartment and they're singing together um and it's not perfect because they're both not trained singers and they kind of **** up and just kind of laugh it off and that was the take that they used I",
            "start": 5770.56
        },
        {
            "text": "apartment and they're singing together um and it's not perfect because they're both not trained singers and they kind of **** up and just kind of laugh it off and that was the take that they used I love that cuz it was so representative of this isn't a perfect story nothing about this is perfect it is what it is and that's the point where Ryan Gosling's character, Seb, stops being about the dream and says all we ever need is love like La La Land is about love and then later it turns back to being about dreams and it's not about love anymore and it's I just think it's cool because it is an evolving thing where people grow with each other and they help each other become different people yeah I think that was perfect that's well said I think that was kind of what hit me what struck me too was I think this is one of the best romance movies I've ever seen uh in that it does what all really good romance movies do in that it it doesn't necessarily need a happy ending to be a good and enjoyable experience right",
            "start": 5809.68
        },
        {
            "text": "of the best romance movies I've ever seen uh in that it does what all really good romance movies do in that it it doesn't necessarily need a happy ending to be a good and enjoyable experience right it reminds me of all those relationships I've had in the past before I found my wife, that like you thought there was not it was never going to change right you were in that moment and everything was perfect and then for some reason it just kind of took a different turn and dissolved and that's just what happens to people that's what happens it's life it's not even a matter of Youth I was going to say it's what happens to you when you're young but it just it happens no matter what like sometimes you hold on to something really tightly and sometimes it just you got to let it go and and I think that that was that was so beautifully done in La La Land, and I don't I don't see it as an unhappy ending by the way because I think they both looked to me like he loved her and he was",
            "start": 5846.44
        },
        {
            "text": "that that was that was so beautifully done in La La Land, and I don't I don't see it as an unhappy ending by the way because I think they both look to me like he looked like he loved that club and he was enjoying being that person and like they were always going to think about each other they're always going to think about each other in a with a fondness of like what could have been but at the same time when they see each other and there is that look at the end when they smile they both realize that they were in that moment what they needed for each other yeah to to to pass into that next part of their life and then that's it another thing that I really really enjoyed about the movie is that it kept throwing curve balls but not in a predictable way and not in a way where you expect them to constantly be switching things up and uh you know so you're you're trying to get ahead of the movie because that that's something that movies do a lot where I as a a creative type like to watch these",
            "start": 5881.48
        },
        {
            "text": "constantly be switching things up and uh you know so you're you're trying to get ahead of the movie because that that's something that movies do a lot where I as a a creative type like to watch these things and think where what where's this going you know what are they going to do this movie I kind of it it beat me like I didn't even I stopped thinking about that cuz I'm like I trust them like they've won me over enough like when they introduced John Legend's character um it was intriguing was like all right this guy's obviously like the bad guy you know but but why because they set him up like oh he's a bad guy they almost immediately switch that on you and you're just like no he's a good guy it just represents this dream that uh Ryan Gosling doesn't have and it adds this whole new element to it that it's no longer is it just love and dreams the idea of success is also thrown in there and success not being your dream and it's like all right if you succeed at being successful what's",
            "start": 5915.48
        },
        {
            "text": "to it that it's no longer is it just love and dreams, the idea of success is also thrown in there, and success not being your dream, and it's like all right if you succeed at being successful what's that worth compared to love and um your dream right and it's like nothing because he gets that he gets all this fame, he gets all the YouTube views and all the money and all the tours and stuff but it's not what he wanted to do and it's just like I love the dichotomy of all that and like to me the movie is such an emotional roller coaster and it got so real and like I I love that every person I've talked to about it gleans something differently from it whether it's from the relationship standpoint or the dream standpoint of the success standpoint and watching it with Gia was really difficult because when they started having the fight about the um there's the one line in particular at the apartment when he goes to visit her yeah when he makes dinner yeah when he makes dinner and he's just like",
            "start": 5956.08
        },
        {
            "text": "when they started having the fight about the um there's the one line in particular at the apartment when he goes to visit her yeah when he makes dinner yeah when he makes dinner and he's just like I'm only here for the night I got to bounce out tomorrow morning it's like him doing something so nice and the whole fight that they had of I'm doing this all for you and she's like why this isn't what I want him being like well **** this isn't what I want either why are we doing this but the line of um so when does this stop and he's like well I don't know we're doing the album to make the tour and then we're doing the tour to make the next album or whatever I was just like like Colin looked at me and I'm like oh God this is literally like things that we've had it's like well I'm doing Kinda Funny Live and then I'm editing it so that other people can see it so we can go bigger next year so you know I'm like oh **** but it's like I love that though I love how that builds and that's what",
            "start": 5995.92
        },
        {
            "text": "We discuss the ethics of CG facial reconstruction, fast food mascots, the weather, and La La Land. I love that scene too, I like it, I love the fact that he's doing something that he is conflicted about right, he's doing something that he realizes it is giving him success and can ultimately build toward that ultimate goal of his but he but the reason why there's that animosity and the reason why there's that anger and he has that line later that he says he doesn't really even mean but he just says it where he's like are you mad at me because you can't stand to see me succeeding in your while while you're not while you're just standing one place",
            "start": 6030.4
        },
        {
            "text": "where he's like \"are you mad at me because you can't stand to see me succeeding while you're standing still?\" like an actor for Christ's sake, alluding to the fact that she hasn't made it yet, and he's starting to make it but doesn't really mean that what he really means is \"I don't know why I'm doing this, I can't explain it\" but it's taking its toll and tearing us apart basically um and a lot of people are like \"he could have just gone to Paris with her\" and I'm like he could have gone to Paris with her but I think that scene was pivotal because he talks specifically about how he's already done this other thing for her and that's led him to a place he doesn't want to be either so I think stay the course and get your club or go to the Beyond with this woman and probably not do what you want to do in life",
            "start": 6067.28
        },
        {
            "text": "that he didn't, he doesn't want to be either so I think like stay the course and get your club or go to the to La La Land with this woman and probably not do what you want to do in life that was his that was his Crossroads I think it was perfectly set up um and I think all the more better man it just it's it's one of those that that sticks with you it makes you feel like you're it really makes me feel like that first time I got my heartbroken you know what I mean we're like **** that's what that feels like and I'll never get that back like you'll never be able to go back and redo that you just have to live with it and and use it to be a different or better person yeah yeah it's interesting I mean taken away taking my take away from it in terms of the relationship standpoint right and I think early on in that but I mean definitely in that fight when they're having it is the fact of oh they're not meant to be together you know what I mean like watching them arguing like cuz it's it's",
            "start": 6098.32
        },
        {
            "text": "early on in that but I mean definitely in that fight when they're having it is the fact of oh they're not meant to be together you know what I mean like watching them arguing like cuz it's it's sex stuff episode right of communication why are you we we never had this conversation of why he was joining up with this oh Jesus **** Christ you kidding me and that they are young and they are this but it is the fact of just like I mean it speaks to me and my ex-wife right of like we loved each other and we got together and we got married thinking that all right cool we can last through anything never thinking about the fact that I still had my dream of being a video game person and she had her dream of whatever that was going to end up being you know what I mean the fact that when we both started pulling towards it pulled away from each other act oh right we love each other and that's great but this isn't meant forever if we have to go chase our own thing and the fact that the next person",
            "start": 6135.12
        },
        {
            "text": "pulling towards it pulled away from each other act oh right we love each other and that's great but this isn't meant forever if we have to go chase our own thing and the fact that the next person I'm going to marry right has to be above all of that and so for me it was very much like oh I've I've been into this relationship no big deal it sucks that they're going to break up but it's like totally they'll be fine on the other side and that's why I when for me when they we see it all play out I thought it was from her perspective and we got there and then the look back was for me the all right cool we both did okay everything's fine you know what I mean see you later this is a weird thing to see you here and coming to your club that you stole my **** I you owe me for that goddamn logo FYI waiting for my RO to check on that one yeah another scene that I really loved was when they went to go watch the movie and then the the film broke and then they went to the location the plant",
            "start": 6170.16
        },
        {
            "text": "waiting for my RO to check on that one yeah another scene that I really loved was when they went to go watch the movie and then the the film broke and then they went to the location the plant there's so many just cool little nuances to it that they're like man you guys really thought about this the the direction of it was fantastic and I love the so many varied musical styles that all kind of felt right they all felt like they meshed together but they were like just different enough that it it never felt like it was the same thing over and over and over even though like the main theme another day of sun uh the like Melody of that comes back like five different times and different songs and it's it's cool it's a great great story yeah um they just won a lot of Golden Globes I'm sure they'll they'll do well at the Oscars as well for this but I think one of the things that the the uh composer said that really struck with me was he was like this is a very unique project where everyone had",
            "start": 6203.48
        },
        {
            "text": "they'll do well at the Oscars as well for this but I think one of the things that the composer Damien Chazelle said that really struck with me was he was like this is a very unique project where everyone had to really work together to make this happen and it you know obviously evolved over the span of six years I think from when Damien Chazelle wrote it but I mean this is what you get when you have a lot of people really invested in something special and like that movie should not have been that good had no business being that good but it just came together and it's really well done um surprisingly Matt and his wife who both do musical theater did not like it yeah and I I suspect a lot of people yeah I suspect a lot of people who actually have seen are in theater might have a thing or two to say to that but I agree with what you just said because their biggest complaint was there was no through line I'm like I don't know I thought there was I think it was just a really",
            "start": 6248.96
        },
        {
            "text": "\"thing or two to say to that but I agree with what you just said because their biggest complaint was there was no through line I'm like I don't know I thought there was I think it was just a really honest not not to I'm not trying to put down musicals or anything but I think that and plays in general the through Line's really obvious and and it's very in in your face whereas this was a movie and it was I think an honest depiction of a relationship you know what I mean of the fact of like well this isn't necessarily going to be cut and dry it isn't going to be this thing I you know I mean the fact of like when he gets the phone call and they're broken up and he's like she's not here she's not here not anymore and then she's like audition like he's like what and he drives all that way cuz he's like I you know it wasn't the Hamer Gere and a limo like I'm here to Whiskey away and make all your dreams come true it's like I know how much this means to you and even if we're not\"",
            "start": 6284.36
        },
        {
            "text": "cuz he's like \"I\" you know it wasn't the hamf Richard Gere and a limo like I'm here to Whiskey away and make all your dreams come true it's like I know how much this means to you and even if we're not together and we're not going to be together after this clearly like I still love this is still \"I\" love you and this is important to you and I want to make you need to know and you need to do this and I need to make you successful God that see where they're sitting back up at the observatory and they're just like what now and he's like \"I\" don't know I'm like no just **** tell her you love her you schmuck but again that would be like so antithetical to who they actually were right cuz like for me it was like like I not that I I think I **** it up in any of my past relationships this hard but in terms of a well no I'm more important than what I need to do right now for this other person right was when he doesn't go to the one woman show right whereas in my head I'm like if that's Jen",
            "start": 6318.56
        },
        {
            "text": "in terms of a well no I'm more important than what I need to do right now for this other person right was when he doesn't go to the one woman show right whereas in my head I'm like if that's Jen and Jen's doing whatever the **** Jen needs to do and that's her dream and guy's like hey I need to take photos of you I'd be like no sorry sorry John Legend, I gotta go what are you talking about that that is the one part of the movie that I just really couldn't buy is even even like taking the the photos of things and all that out out of the way it's just like there was certain moments where I'm like you schedule around these things and it's like I don't care how busy you are it's like there's a few moments that are like I got to do this you know and it's like anything should be able to understand that so I like I don't know but minor complaints absolutely the audition scene though was so good at the end when she sang the the song \"La Vie en Rose\" or whatever",
            "start": 6355.28
        },
        {
            "text": "to understand that so I like I don't know but minor complaints absolutely the audition scene though was so good at the end when she sang the song \"La Vie en Rose\" or whatever it was just like that was just yet another shift in the movie where I'm like damn they took this up another notch like this is so fantastic and it it made one of the plot points of the movie that I didn't really like that much make sense which was uh the one woman show the one person that needed to be there saw it and all that a little too convenient but that audition made it all up for me where I'm like this is really going in a cool direction that I do think is believable and uh when I was saying earlier about the end of the movie how it's it doesn't really end perfectly and whatever to me what I thought was going to happen from the whole um epilogue scene was that that was the movie she ended up making was like the whole thing because when when she was singing the whole audition and",
            "start": 6389.8
        },
        {
            "text": "me what I thought was going to happen from the whole um epilogue scene was that that was the movie she ended up making was like the whole thing because when when she WASN'T the whole audition and um they were pretty much like yo we liked your your one woman show we want you to go to Paris and make a movie you know like make make a story I was like oh my God this whole thing of her with a different family and all whatever that is the movie and I thought they were going to cut to them watching it but that's my mind always goes meta always yeah know I I I knew the second that they showed the kid the second that she had a kid I was like she's not getting back together I KNEW as soon as she they showed her hot ass husband that guy that guy from Dead Man on Campus like yeah love that guy I was like he's not going anywhere um yeah I don't know it was another one I tell Kevin though too this is one of those things that I feel like happens all the time in these movies where like every everything",
            "start": 6431.64
        },
        {
            "text": "he's not going anywhere um yeah I don't know it was another one I tell Kevin though too this is one of those things that I feel like happens all the time in these movies where like every everything with Christian Bale or yeah Bale I was I don't want to say John Cusack Christian Bale and uh like from Superman Returns or The Notebook or whatever where it's like oh you're not that bad of a guy but like oh she's not really in love with you and he might have been a bad guy in The Notebook I forget but I for sure Superman wasn't a Superman super he's totally a nice guy and it's like wow Lois doesn't love you as much she loves thought think was a doctor try to like save her a bunch of times even though he almost died like every **** time he did anything I I see this dope who's got a kid with her I'm like oh sorry she just doesn't love you like she loved **** him that's true sucks he plays music you just drive a nice car my wife put it best my wife's like I was like yeah",
            "start": 6473.64
        },
        {
            "text": "got a kid with her I'm like oh sorry she just doesn't love you like she loved Ryan Gosling that's true sucks he plays music you just drive a nice car my wife put it best my wife's like I was like yeah you know it's just it's too bad like you really want them to get together the end she's like well if this were real life yeah I mean he would just wait until she got the BSE and then scoop back up in there now now she knows to I was like I was like oh man she knows La La Land very very well that's so funny so funny and before we leave I want to give a couple more shout outs shout out to the scene where they cut to all the Prius keys CU that that was really funny the Prius yeah so so damn good and shout out to the entire pool scene where he's in the van with Flock of Seagulls oh man funny so good yeah and and a huge shout out to how that that movie was filmed too I I would not be surprised if that got it nominated for best cinematography at the Oscars I mean I have an article",
            "start": 6510.92
        },
        {
            "text": "\"funny so good yeah and and a huge shout out to how that that movie was filmed too I I would not be surprised if it got nominated for best cinematography at the Oscars I mean I have an article right now on American Cinematographer I haven't read yet I've been kind of saving it for a any day but I want to read how they did all that stuff cuz I think they use a lot of technic cranes and like I mean if you notice like the best cinematography in the movie was when you didn't notice what was happening and all a sudden there's two people in front we crane through them through the desk and then all the way around her and then all the way back in that and I'm like how did they do that that was really amazing and very and very flawless um so I'm actually fascinated to read how they did that um see what kind of mechanized crane they use for that super cool if you didn't know this has been The GameOverGreggy Show\"",
            "start": 6554.88
        },
        {
            "text": "and very Flawless um so I'm actually fascinated to read how they did that um see what kind of mechanized crane they use for that super cool if you didn't know this has been The GameOverGreggy Show each and every week three sometimes four best friends gather on this table each bring a random topic of discussion for your amusement if you like that head over to patreon.com/kindafunny where you can get every episode early along with a bunch of exclusive perks goodies and if you give us $1 or more for the month of January you get exclusive access to Kinda Funny Live to a three-hour video that Tim cut and it's really awesome there's a million camera angles and it probably killed him if you have no bucks to toss our way though no big deal head over to youtube.com/kindafunny where you get the show broken up topic by topic day by day until it goes up is one big MP3 in video until next time no it's been our pleasure to serve you damn right",
            "start": 6588.72
        }
    ]
}