{
    "id": 2336,
    "video_id": "TcMxuaul3AY",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "We Played Nintendo Switch - Kinda Funny Gamescast Ep. 104 (Pt. 2)",
    "description": "Tim went to New York and had a ton of hands on time with the Nintendo Switch.\n\nThanks to Blue Apron for sponsoring this episode. Go to http://www.BlueApron.com/gamecast\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1485262823,
    "duration": 2391,
    "transcript_chunks": [
        {
            "text": "this episode of Kinda Funny Gamescast is brought to you by Blue Apron. Blue Apron is the number one fresh ingredient and recipe delivery service in the country, their mission is to make incredible home cooking accessible to everyone, they achieve this by supporting a more sustainable food system, setting the highest standards for ingredients, and building a community of home chefs. Not all ingredients are created equal, fresh high-quality ingredients make a real difference so it's important to know where your food comes from. Greg Miller is all about it as you might have seen from his hashtag cooking with GameOverGreggy series, to this day he's swears by that buffalo chicken sandwich here's a little taste see what I did there of upcoming meals spicy shrimp pork chops and garlic picata mushroom and chipotle pepper enchiladas with lime sour cream. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com Gamecast you will love how good it feels and tastes to",
            "start": 0.12
        },
        {
            "text": "enchiladas with lime sour cream check out this week's menu and get your first three meals free with free shipping by going to blueapron.com Gamecast you will love how good it feels and tastes to create incredible homecooked meals with Blue Apron so don't wait that's blueapron.com Gamecast Blue Apron a better way to cook next topic I got to play Nintendo Switch you did I did one week ago today you were in New York playing I was me Big C dog taking on the big city yeah so this is the first time officially we're going really deep into my whole experience we talked a little bit about it on the Kinda Funny Morning Show uh but I wanted to give my Impressions on everything they had at the event itself how was the food the food at the event was not good yeah yeah no no no not good they did have Nintendo Switch water oh yes did you see somebody selling it on eBay for 100 bucks which is ridiculous they had Nintendo Switch cookies that they gave Kevin ate it I didn't eat it cuz it had",
            "start": 39.12
        },
        {
            "text": "did have Nintendo Switch water oh yes did you see somebody selling it on eBay for 100 bucks which is ridiculous they had Nintendo Switch cookies that they gave Kevin ate it I didn't eat it cuz it had all the like fondant on it you're like this is why would I want to eat this this is who likes fond it nobody nobody that's what you make the cake you make the cookie with the fondant then it's a work of art and I'm never going to eat it yeah I'm not down not down at all but overall the Nintendo Switch event in New York was a total 180 from the disaster that was the presentation the press conference oh man that presentation was so so so bad but the next day it was so weird because like you go in and granted the difference being very Japanese event this event in New York Reggie's there uh and that's something that's interesting about the presentation is that so many of the faces we saw are we've never really seen before and they kind of shied away from the Reggies and the you know Anon like",
            "start": 100.24
        },
        {
            "text": "Something that's interesting about the presentation is that so many of the faces we saw are we've never really seen before and they kind of shied away from the Reggies and you know Anon like they sure they had their moments but um it was interesting to see Reggie speak, that they kicked off the New York event with Reggie coming out and giving this like 20-minute conversation. He was just like \"Yo, we're going to be here real quick, I want to wrap up things, we announced, I want to tell you some new stuff, I want to get you guys playing the games CU, I want to get hands on ASAP\" and it was just such a different uh take cuz I'm like where was this like why didn't you just directly tell people the information boom boom boom boom boom bam cuz all of a sudden it sounds more impressive when you do that uh but I was most excited when they let us go play whatever games we want, I walk in I was like there's a fair amount of games here playable uh I thought it was going to",
            "start": 144.68
        },
        {
            "text": "when you do that uh but i i was most excited when they they they let us go play whatever games you want i walk in i was like there's a fair amount of games here playable uh i thought it was going to be like closer to like five but they ended up being like 15 or so uh so playable games they had ARMS Zelda Splatoon 2 Snipperclips Mario Kart 8 Deluxe Fast RMX Super Bomberman R Tetris Sonic Mania Ultra Street Fighter II onew switch has a Hyrule Warriors Definitive Edition Just Dance 2017 and Skylanders Imaginators mhm now of those i played about 10 of them lots of Let's Plays up on youtube.com/ kindafunnygames yes there is uh the ones i did not play were Hyrule Warriors Definitive Edition, Super Mario Odyssey, and Just Dance 2017 and Skylanders Imaginators in addition to that they had a Mario Odyssey like giant trailer Loop playing where it just said Super Mario Odyssey fall or holiday 2017 and there's just the trailer over and over and over um and like a weird thing where you could put Mario's hat on I saw that take",
            "start": 186.44
        },
        {
            "text": "playing where it just said Super Mario Odyssey fall or holiday 2017 and there's just the trailer over and over and over um and like a weird thing where you could put Mario's hat on I saw that take photos with it yeah yeah so it was like whatever at least it was there his hat has eyes um but starting off with the games I didn't play some Nintendo Switch wanted to play it it actually had one of the biggest lines of anything and I think it's because they they had like specific booths just for it and like they had a bunch of dumbass gimmicky costumes that yeah I saw Dan Ryckert and Geoff Keighley having the cowboy hats on as they were doing the you know the Drawful game yeah so it's you know that was definitely like the kind of the dumb PR uh area of the event whereas like there's all the people like come on have fun let's put on costumes how many ice cubes are in this class exactly so we we didn't get to play that but looking back on it I actually regret that because that is the one game that really",
            "start": 243.72
        },
        {
            "text": "on have fun let's put on costumes how many ice cubes are in this class exactly so we we didn't get to play that but looking back on it I actually regret that because that is the one game that really showed off the HD Rumble uh so I wish that I had the the chance to do that cuz from speaking to everybody after they're like oh man like no you should have definitely tried that for the different mini games and stuff they have um people seem to be to think that that game is pretty good based on people that have actually played it yeah I kind of wrote it off just like I'm sure many people did is GH it's just more Nintendo party Game & Watch and I feel like that's what it's going to be yeah cool we got it we played Zelda for a while now let's screw around with this real quick all right cool we did the quick draw on the morning show bye that's you know mean exactly I think that the uh the thing going for",
            "start": 284.12
        },
        {
            "text": "played Zelda for a while now let's screw around with this real quick all right cool we did the Quick Draw on the Morning Show bye that's you know mean exactly I think that the uh the what they're going for and I appreciate it is they are going for more of a Jackbox Party Pack feel where or like a Cards Against Humanity like it's less we play and we Sport and like that stuff where it's more like your whole family can play this this is more this is not about family as much as it's about a party like this is like you're drunk with your friends we're milking cows because it was really funny to to see people play how long does that humor last probably not too long but depending on how many mini games there are again didn't play it not standing up for it but everybody that played it seemed to be really into it it does seem like yeah like we talk about when you get VR what are you going to what game are you going to show exactly hey cool you're here for a few beers and oh yeah I have a Switch yeah",
            "start": 320.84
        },
        {
            "text": "into it, it does seem like yeah, like we talk about when you get VR, what are you going to play exactly? Hey cool, you're here for a few beers and oh yeah, I have a Switch. Yeah, we'll play Mario Kart in a second. Well, look at this, we're milking the cart plug in back. The cart has been Heroes looks like a call-in game if I've ever seen one. I didn't have time to play it, but it looks like an indie V game. Uh, it's coming to PS4, Xbox One, and Switch at the same time sometime later this year. Dis Sky of 5 - not my type of game. Didn't play it. Just Dance 2017 - it's the same setup we've seen for six years where there's like six girls just standing there, come on dance with me, and it's like no one's doing the choreo. Kev's like I'll see you guys later walked in 40 minutes later came sweating but it's always but then they always get the one guy to go play and it's just like one random ass game style is play with like these six super hot girls, they're all dads",
            "start": 365.48
        },
        {
            "text": "40 minutes later came sweating, but it's always. But then they always get the one guy to go play, and it's just like one random ass game style is play with like these six super hot girls; they're all dads, and he's just like, \"I'm like, oh, so bad for you.\" Cuz it's like he doesn't even look like he's having fun. He doesn't want to be there for the people that are playing having fun. Good for you, but oh man, you just got roped into it. No, no one's happy about that. The Siren Song; oh so bad, and Skylanders Imaginators. I didn't need to play Skylanders already out, yeah, I was just there, whatever. Um, I did not, so I didn't play it, but I did use Skylanders as an excuse to be able to hold the controller more nice. You know? You walk by, you're like, \"What what demo has nobody?\" Oh, Skylanders, yeah, great. I'm a big fan; I got the Crash uh Amiibo to thanks all right, but no, you didn't even start it, sir. That's pretty much exactly what it is, and it's always hard to these events because the people give so much.",
            "start": 406.0
        },
        {
            "text": "fan I got the crash uh Amiibo to thanks all right but no you didn't even start it sir that's pretty much exactly what it is and it's always hard to these events because the the people give so much pressure on you know it's like they want you to play the game how they want you to do the demo and it's just like oh my God so annoying that's why I hate these events I hate them that's why I like going up to them and hitting the PlayStation button going to check no you can't do I'm already here just let me see it's fine just let it happen and uh we experienced that a lot like where there was a lot of times like all right I just want to use the joycons or I just want to play on thing and they're like no you for this demo you're doing it like this and it's just like yo **** off let me play and I think that's another thing with the switch because there's so many different control options so many of the demos had different controllers and like that's what that's what we were doing today you",
            "start": 449.64
        },
        {
            "text": "I think that's another thing with the Switch because there's so many different control options, so many of the demos had different controllers and like that's what that's what we were doing today. You can go somewhere else and I was just like all right cool I guess I'll play by your rules but Imaginators was one of the only um systems to have the I don't even know what they're calling it, but I guess this is the Switch standard where it's like the screen The Joy-Con attached. I don't know does have a proper name or is that just the Nintendo Switch like when configuration, cuz I keep calling it Gamepad but it's not Gamepad but whatever. So I did that to be able to for um anyway, so those are games I did not play; games I did play Arms super super good compared to super good to where yeah it it's not going to be great it's not going to be a system seller it's not going to be a game that you know people are playing for years on end but I do think that it has a Splatoon like quality to.",
            "start": 483.16
        },
        {
            "text": "it's not going to be great it's not going to be a system seller it's not going to be a game that you know people are playing for years on end but I do think that it has a Splatoon like quality to it where all of the industry is going to look at it and be like all right here's this new IP but like classic Nintendo this looks like nothing and then it actually has a cult following afterwards and it's a great game that people really bite into uh the there's something about the characters in this game playing it that there they're there's a personality where I'm like all right this kind of reminds me of a combination of them nailing the motion control so it's like we boxing but there's depth behind it so it's kind of like the Punch-Out!! game but with more um precise controls with the being able to turn your hands and all that combined with the like characters of Overwatch and like really focusing on them as the the main focal point of the game sure with something like Super Smash Bros. that",
            "start": 530.44
        },
        {
            "text": "turn your hands on and all that combined with the like characters of Overwatch and like really focusing on them as the main focal point of the game sure with something like Smash Brothers that it's like all right cool well let's just all get together and play it so adding those things together I'm like there's definitely something there way more than just oh we're going to punch each other it's not We Boxing cuz that you when they debuted we're all like it's just We Boxing again yeah and I think in the same way when Splatoon was debuted it was just like this is their answer to Call of Duty like it's it's real easy to be snarky about it and again I don't think it's going to set the world on fire but I do think it's going to be way more impressive than people give it credit for playing it I'm amazed at how intuitive it was I did the let's play with Jimmy Wong and you can even see in the video like we wrap our heads around the controls and understand how to do things that at least feel",
            "start": 577.52
        },
        {
            "text": "I'm amazed at how intuitive it was. I did the let's play with Jimmy Wong, and you can even see in the video like we wrap our heads around the controls and understand how to do things that at least feel Advanced uh way faster than I'd imagine in in other like fighting games or in other most controlled based things cuz like for so long with even with Wii Motion Plus it was fighting against the controls to get it to do what you wanted to do but you can see in the let's play when I want to throw which is quite often uh as you as a lot of people in the comments have pointed out uh I was meaning to do that you know I saw he wasn't blocking against throws so I kept going with that there wasn't any single time that it didn't throw when I wanted to throw there wasn't any time where I didn't move or punch when I wanted to so I was like oh **** like is it sad that I'm giving a game credit for working a little bit yeah when it comes to motion controls n but but yeah so I'm very happy that the",
            "start": 612.6
        },
        {
            "text": "when I wanted to so I was like oh **** like is it sad that I'm giving a game credit for working a little bit yeah when it comes to motion controls n but but yeah so I'm very happy that that the game works and also it was uh said that you can play the game without motion controls I think that is really where the game's going to take off interesting interesting it's going to be a lot better that way uh I think for in terms of competitive play but it's fun with the motion controls and I do think that it's a perfect example of a game um that when your friends come over to show off the switch and just like it was a fun thing a Pokémon was the other game I wanted to compare to earlier uh in terms of the the view perspective of playing yeah real quick it seems like Nintendo officially calling what you were talking about handheld mode handheld mode yeah okay fair enough that makes sense um arms going back to the characters these characters are going to be in Smash Bros and I think that's a",
            "start": 652.72
        },
        {
            "text": "You were talking about handheld mode, handheld mode, yeah okay fair enough that makes sense. Um, arms going back to the characters. These characters are going to be in Smash Bros and I think that that's a good sign of how much Nintendo is banking on this. Like I really believe that these are characters that could last for a while and it's cool that they're making new IP with new Nintendo characters. Uh, because you know everybody gets so upset at them relying on the same cast over and over and over. At least at least they're trying. Uh, Zelda obviously it's fantastic I can't believe they're going to play in less than 6 weeks be able to just get lost in that world and it's a damn big world. So much so that playing it on the the handheld mode I'm like I don't know if I need this handheld it's freaking crazy like the graphics, 720 on the screen no one should be complaining about this things look great on on the screen there's no game I saw playing that I'm like I wish the resolution was",
            "start": 691.88
        },
        {
            "text": "freaking crazy, like the graphics 720 on the screen - no one should be complaining about this; things look great on the screen. There's no game I saw playing that I'm like, \"I wish the resolution was higher.\" Uh, but with it, it's pretty cramped on such a small screen. Can you read stuff? Is that the problem? Reading is fine, but it's like having Link and just seeing the world - it's just like it's a little overbearing. Um, I definitely preferred playing it on the TV. Um, I got to play Zelda in most configurations out of any other game where I played in handheld mode; I got to play with the Joy-Con controller on the thing, and um, I played with the two Joy-Cons on the screen, and all the control options felt great - none of them felt any noticeably better or worse than the others for Zelda. Um, this game it really does look special; it looks like it's going to be remembered very much like a return to Zelda form, yeah. Um, having said that though, it is Zelda through and through. Uh, I appreciate that.",
            "start": 735.28
        },
        {
            "text": "it really does look special it looks like it's going to be remembered very much. It looks like a return to Zelda form, yeah. Um, having said that though, it is Zelda through and through. Uh, I appreciate that the game starts off there's no tutorial that you just jump in and it's just like holy **** like this is a very un-Nintendo move, you know. It's like this is beating over the head this what we want from from Zelda and this is the same demo from E3 so it's not like you you start with your sword right you know got a wooden sword and a wooden shield, same demo from E3 um but now playing on Nintendo Switch so I played it before on Wii U this so now it's I didn't notice the difference just playing uh there's a whole bunch of graphics comparisons on the internet where you can see like oh **** it does look substantially better on on switch but I didn't notice playing got at all um I got to play the same demo but I also got to do a let's play with a Nintendo Dev um of the section right after the dev mode",
            "start": 781.28
        },
        {
            "text": "better on on Switch but I didn't notice playing got at all um I got to play the same demo but I also got to do a let's play with a Nintendo Dev um of the section right after the dev mode but they wouldn't let me play that part sure sure um so I saw a little bit more of that the the I feel like people aren't talking about the cons of Breath of the Wild as much as they they should be um the controls are pretty bad like you were talking you you were worried about this being you when you started talking to me about it I think over lunch we were talking about being Antiquated like The Last Guardian right yeah I mean it it it definitely gives me The Last Guardian vibes jump is with triangle or whatever the top button is yeah I'm just used to dual shock um and the the analog control never felt quite as fluid as I wanted it to uh like when you play a Mario game you just believe that the game is doing exactly what you want to it just it's so buttery smooth and just like every single turn is just right",
            "start": 824.08
        },
        {
            "text": "as I wanted it to uh like when you play a Mario game you just believe that the game is doing exactly what you want to it just it's so buttery smooth and just like every single turn is just right yeah Zelda's always been great but not exactly perfect but it never needed to be there's something about this game that that playing it I was just like man like it feels kind of clunky um there's a staircase I was trying to go down and I kept getting stuck in the corner and I'm just like oh man like this this is that's not good Link what are you doing I'll just say my takeaway from my time with it at E3 was you know was brief but I felt like it was complicated that was that was my major thing I was like like well this does this and you can do this with your shield and you can do this you can slide down and then you can grab a bomb and then do this oh you hit and I'm like Simplicity has always been the key with Zelda like I I played literally every Zelda game except for Skyward Sword",
            "start": 872.52
        },
        {
            "text": "down and then you can grab a bomb and then do this oh you hit and I'm like simplicity has always been the key with Zelda like I I don't I played literally every Zelda game except for Skyward Sword at some point you have to have like a more simple approach and I'll be interested to see if that translates I'll be interested to see if that was just me or there me being new to the game yeah that would right I would hope so but it seems it seems like there's a lot to do and so but I mean that'll all be introduced slowly you'd assume right granted even though you're dropped in without a tutorial you're not going to have all your bombs you're not going to have all your like swords or uh bow and arrow stuff I mean even now having played through the same demo a couple times like I do feel like I do have a better grasp of how to do all the different systems so it is less you know crazy uh to come at but that was my big I was shocked when I played I was like this is complicated dude like",
            "start": 912.88
        },
        {
            "text": "I do have a better grasp of how to do all the different systems so it is less you know crazy uh to come at, but that was my big I was shocked when I played I was like this is complicated dude, like well the big thing is that you couldn't invert that was a big one and then you were saying you looked but you couldn't find it there, there wasn't an invert option for the demo, but there was a menu that I couldn't get to so I'm assuming that it's in there um, but anyway I mean it, the game is fantastic like just from the very little I've played, this seems like the Zelda game that I want to play you know and Skyward Sword I I liked I don't hate it as much as everybody else and Twilight Princess I like a lot more than I think a lot of other people do um when and all the other ones obviously amazing but I'm I'm ready for this game and I think that uh it's it's about time for it to come out and I all the cons aside like I'm those are all minor things but I do think that they're I'm interested that no",
            "start": 946.8
        },
        {
            "text": "I'm ready for this game and I think that uh it's it's about time for it to come out and I all the cons aside like I'm those are all minor things but I do think that they're I'm interested that no one else has been bringing them up because I don't think it's just me like the controls are pretty damn weird especially having just beat Last Guardian I'm like oh this feels like that you know so we'll see how that goes uh Splatoon 2 me and GameOverGreggy did a little bit of playing of it um I'm not a huge Splatoon guy not that I don't like the game it's just I I just never really got into it so I'm not good at it or anything but they had a huge setup where you could play with a bunch of people at once um that was another game had various control options to be able to do but it was also another one that I picked up just to kind of play with the uh portable or handheld mode handheld mode hand who the **** calls them handhelds these days Nintendo yeah but Splatoon looks",
            "start": 990.24
        },
        {
            "text": "that I picked up just to kind of play with the um portable or portable mode handheld mode handheld mode who calls them handhelds these days Nintendo yeah but Splatoon looks great people seem to be having a lot of fun with it so that's good uh Snipperclips my favorite game that I played at the Switch event it's a little eShop game it's a co-op physics-based puzzle game super fun cannot wait to play through it we should do a whole let's play series or just a long let's play of us playing through it's super awesome there's let's play up on Kinda Funny Games with me and Danielle Bloodworth from Easy Allies we had a great time with it uh it's a complicated like gameplay element to that you have to wrap your head around but once you do you're like oh I get how this works and you kind of go through it but it's like so frustrating cuz like you need to not only figure out the puzzle in your head but the other person needs to and you need to communicate that",
            "start": 1031.56
        },
        {
            "text": "works and you kind of go through it but it's like so frustrating cuz like you need to not only figure out the puzzle in your head but the other person needs to and you need to communicate that and that's where it gets really complicated because it's uh it's kind of like Photoshop, where there are layers on top of each other um but whatever the top layer is can snip through the bottom layer reshaping the other person and you have to be able to fit into holes like there's a like you're two rectangles and you need to figure out how to fit into a heart shape so you need to rotate, snip, rotate, snip, rotate all the way around and just keep going until you fit that heart shape gotcha and it's like all right cool that's the simple version then the next step is like a pencil, a giant pencil will fall from the sky and there's a pencil sharpener that's horizontal and you need to catch the pencil and bring it over and get it into the the sharpener so to do that you have to you have to you know have",
            "start": 1078.68
        },
        {
            "text": "from the sky and there's a pencil sharpener that's horizontal and you need to catch the pencil and bring it over and get it into the the sharpener so to do that you have to you have to you know have some skill there and make one of the dudes look like a U to kind of like baseball M catch the pencil and then run over and balance it with the other guy and bridge it into the pencil sharpener and it's definitely one of those Aha moment games and I super love it I haven't had that much fun doing a co-op puzzle game since like Portal 2 oh wow so highly recommend that uh Mario Kart 8 Deluxe it's Mario Kart 8 Mario Kart 8 was already with dry bones and battle mode which is even more important a proper battle mode yes it's been way too long since we've had that and it looks great plays great the there's a whole bunch of new characters too Splatoon characters and all that Splatoon stages um we don't know official numbers of courses and all that there's it's rumored to have 64 total",
            "start": 1115.24
        },
        {
            "text": "the there's a whole bunch of new characters too Splatoon characters and all that. Splatoon stages um we don't know official numbers of courses and all that there's it's rumored to have 64 total courses which is insane um that's like eight Grand Prix so or 16 Grand Prix so that's a lot of content yeah um it's all the DLC and all the stages and characters from the original Mario Kart 8 plus more but yeah it's a Mario Kart so duh you either like it or you don't if you don't you're an idiot uh we were forced to play it with uh the single joycon oh how was that huh and it was horrible yeah yeah in the let's play there's a moment where I'm like I turned like after the first um map we did I'm like hey hey can we turn off the motion controls he's like not for this demo I just like look at the camera I'm just like oh Nintendo it's just like why man why are they pushing this even for the people that are here they obviously don't want to do that yeah well they want you to have your",
            "start": 1163.56
        },
        {
            "text": "camera I'm just like oh Nintendo it's just like why man why are they pushing this even for the people that are here they obviously don't want to **** do that yeah well they want you to have your experience though and you have your Hands-On Impressions that it sucks I guess oh my God well there was that couldn't take away from Mario Kart but they damn tried fast remix it's a semi-port of an eShop game on the Wii U called Fast RMX, it's kind of like an F-Zero homage yeah super awesome game I'm happy it's getting a second life it deserves it uh Super Bomberman Man - another game that I really loved the Nintendo Switch seems to be a kind of Renaissance for nostalgic uh 90s games coming back in like slightly modernized ways and I'm all about that like between Superman or Super Bomberman are Street Fighter and um Sonic I'm like all right cool this seems like a machine for me sure um yeah a lot of people were talking about Super Bomberman that they really enjoyed it yeah it's definitely",
            "start": 1214.4
        },
        {
            "text": "Street Fighter and um Sonic I'm like all right cool this seems like a machine for me sure um yeah a lot of people were talking about Super Bomberman that they really enjoyed it yeah it's definitely it was one of the better experiences I had uh playing a game it's it's Bomberman it's nothing new um but that's fun I think it's been long enough that I haven't played a Bomberman like I think the last one I really played was on Game Boy Advance so it's you know it's been a while um and like this game is fun especially in a modern age of Let's Plays and you know playing games as content I think there's a definite new home for it um and playing online sounds super awesome uh there's a story mode too that I got to play a little bit of and it sounds like there's going to be a fair amount of content there um from the little I played there was enough gimmicks and switch ups that I'm like oh cool like switch-ups so we replacing the yeah okay oh you got it okay there you go",
            "start": 1264.12
        },
        {
            "text": "We played a ton of Nintendo Switch games, and there's enough gimmicks and switch-ups that I'm like, \"Oh cool, switch-ups.\" We're replacing the yeah okay, oh you got it, okay. There you go by time we switch uh real quick before we go in - this is me being just stupid, which happens more often than not. Have they talked about ad hoc mode? Like if you and I are sitting on the plane with our Switches and we want to play Mario Kart when it's out, is there ad hoc or do we need to be on a Wi-Fi network? Okay, I don't know about that. I guess you could always play locally for these games too, where I could shut mine down. They have nothing to announce at this time. Yeah, nothing. Please be excited for E3. Did you see that story that Jason Priddy put on Kinda Funny was the funniest thing I've ever seen? He asked them like 10 different questions, I think they answered two of them, and then like the rest of them were \"we have nothing to announce.\"",
            "start": 1302.68
        },
        {
            "text": "TR put on K was the **** funniest thing I've ever seen. They he asked them like 10 different questions. I think they answered two of them, and then like the rest of them were \"we have nothing to announce at this time.\" I was like, \"Do you have a trophy Achievement System?\" We have nothing to announce at this time. Do you have blah blah blah... we have nothing to announce at this time. Like, when will you announce that these consoles are out in six weeks? Will you announce it soon? Will you have something to say about your Trophy System soon or anything else? Will you have anything to say at all? Say something! No, the console is seven months probably premature, so that's probably... they have nothing to say on it. PuyoPuyo Tetris mhm uh super fun game I got to play it for a bit. It was the first let's play that we did. Uh, it's PuyoPuyo and Tetris at the same time, and they switch back and forth between each other so as you're playing like a multiplayer match... it's and for those that don't know PuyoPuyo, it's the same game as",
            "start": 1342.64
        },
        {
            "text": "PUO Puyo and Tetris at the same time, and they switch back and forth between each other. So as you're playing like a multiplayer match, it's... for those who don't know, Puyo is the same game as Dr. Robotnik's Mean Bean Machine or Kirby's Avalanche, or there's a whole bunch of other games that go under it - it's kind of similar to Tetris Attack or Pokémon Puzzle League, but you have to match three instead of two... um, you play through that and then after a set amount of time, like 20 seconds or whatever, it'll switch to Tetris. And then after 20 seconds, it'll switch back to Puyo... uh, but the kind of extra layer there is as it switches, the blobs or blocks that were falling are still falling. So you need to think ahead and look at the timer and be like, \"Oh no, I need to get this where it needs to go\" so when it switches over, it keeps up the combo and all that... uh, it was a lot of fun. Um, I can definitely see you guys.",
            "start": 1376.6
        },
        {
            "text": "oh **** I need to get this where it needs to go so it drops in the right place so when Switches over it keeps up the combo and all that and uh it was a lot of fun um I can definitely see you guys getting into it you know Tetris yeah it's coming I was a little I I was this is a a game people are really excited about this game came out in 2014 in Japan and um you know we we've all seen things on it but uh I was a little disappointed in the sense that it's coming to PS4 and Xbox one as well and and uh this would have this announcement would have had more resonance if the trophies didn't leak for the game like the week before the Switch came out because then I was I was expecting that it was going to you know we we had already known it was coming in some respects so I think this would have been a bigger hit for a lot of people because this is a very this is a great game for a handheld mhm so uh I was a little saddened by that because I think it took a little bit of wind out of their",
            "start": 1426.2
        },
        {
            "text": "been a bigger hit for a lot of people because this is a very great game for a handheld mhm so uh I was a little saddened by that because I think it took a little bit of wind out of their sales with that particular announcement I mean for me I didn't know much about it and even when they announced it like during the presentation like just the name came up I was like I don't know what but playing it I was like oh this is good it's a lot of fun that's the thing I remember when it came out for the trophies leak and we were talking about it there and I was like oh man I'm excited for it based on what I know and then having it there is great but I'm like is it going to be when is it going to PlayStation 4 and how what's the trade-off and where are we getting them yeah I think a big thing for me that I don't want to go understated is that I had fun playing all the games that I played at the event none of them blew my mind except Zelda but it I'm happy with",
            "start": 1460.08
        },
        {
            "text": "I think a big thing for me that I don't want to go understated is that I had fun playing all the games that I played at the event, none of them blew my mind except Zelda, but it I'm happy with what we're getting so far and like I don't know, there's no Mario, I wanted Mario, I'm very upset I didn't get to play Mario there, but the games I did play all were small titles that I'm like cool now. I think the majority of the ones that I'm really standing by are eShop titles. So it's like, speaking of the smaller titles, Sonic Mania - love that game since the first time I played it or even saw it. Uh, I've got to play the same demo I've played a million times on switch; it was another one where they forced me to play with a goddamn Joy-Con. Uh, me and Greggy played two-player Co-op, which is a thing in this - you can play as Sonic and Tails at the same time. If Sonic goes too fast, it Tails just doesn't get to play anymore and gets warped back, and uh, it's dumb; it's super tacked on and that mode.",
            "start": 1492.6
        },
        {
            "text": "in this you can play as Sonic and Tails at the same time if Sonic goes too fast it Tails just doesn't get to play anymore and gets warped back and uh it's dumb it's super tacked on and that mode shouldn't exist because it doesn't work um and for it was like the one of the there was the first demo I got to play at the event and because there was no line for it so I just ran straight to it and just I asked L him oh can I just take the controllers and put it in the thing and she was like oh yeah sure so I got to play one level like that and then re exploded through the wall someone came over like excuse me he can't play that way like God damn it so why are they so weird why does it matter how people are playing it they're always like that man it's **** **** they know if they let you you play like a normal events are so annoying like I wish they would just like we even had it with um when we played a bunch of PS4 games at E3 last year when I was playing Horizon Zero Dawn and the guy",
            "start": 1534.0
        },
        {
            "text": "\"Play like a normal events are so annoying, like I wish they would just... we even had it with um when we played a bunch of PS4 games at E3 last year when I was playing Horizon and the guy, you know, really nice guy, I was sitting with me or whatever. And eventually I was like, 'I'm just going to play now.' Like this is, I don't play games where people are chattering in my ear and telling me what to do. I'm going to play through your menu wheel now. You can use this actually, cuz what's interesting about taking these guys down is you can use your weapon right now, but you can also tell the person at home to shut up. The ****. They're not going to have this and I don't need it either. Like that's the whole thing. It's like just let me play. Like it's a self-conscious experience and it's also like... uh... it was one of the reasons why I was super turned off about playing, not only because I couldn't invert Zelda at E3, but just in the sense that of like having someone just in your face the entire time, like dude.\"",
            "start": 1576.68
        },
        {
            "text": "of the reasons why I was super turned off about playing not only because I couldn't invert in The Legend of Zelda at E3, but just in the sense that of like having someone just in your face the entire time, like \"dude, just walk away, you know? I'll let you know if I need you to explain anything for me.\" But otherwise it detracts from the experience and I'm so it's disappointing that they did that to you because it's like, if you want to play like that, you should be able to play like that. Who's hurt at getting hurt by that? Bizarre, yeah, and that's something interesting too is uh again the best experience I had playing was Snipperclips just because it that that was definitely like the sleeper hit of the event where everybody that played it loved it and there was nobody at that demo station telling people what to do, there was just controllers that you go and pick up and play and it's just like \"huh, maybe there's a note there\" uh but yeah so after that we played Ultra Street Fighter II it's crazy there's a",
            "start": 1610.32
        },
        {
            "text": "to do there was just controllers that you go and pick up and play and it's just like huh maybe there's a note there uh but yeah so after that we played Ultra Street Fighter II. It's crazy there's a new Street Fighter II coming out, like good Lord, the Final Challengers. Uh, it's a little upsetting that the two new characters are Evil Ryu and Violent Ken. Yeah, just just palette swaps. Do they have do they have new skills? Yeah, they do. There's different different abilities and stuff. I don't know what they are cuz I'm not that deep into that **** but I asked them and they said there there were differences. It would have been cool if they took some of the more modern characters from the 32-bit or or Beyond era and pixel pixel him if if you if you threw in like I don't know like Birdie and and you know whatever Cody or something like that would be cool yeah uh it's Street Fighter II which is super awesome there's two modes there's uh retro and HD. HD makes it look like the HD Remix that came out",
            "start": 1643.92
        },
        {
            "text": "whatever Cody or something like that would've been cool yeah uh it's Street Fighter 2 which is super awesome there's two modes there's uh retro and HD HD makes it look like the HD Remix that came out on PS3 and Xbox 360 last gen uh which I'm pretty sure got taken off the stores sounds right but I I don't know whatever but I love those games when they came came out and it also has retro mode where you can play how it used to look and there's a bunch of single player stuff they added to um like there's where it's Ryu and Ken versus Bison so it's like story element stuff kind of like the Rival Mode in Street Fighter 4 um so that's cool I got to play against this dude and uh he was talking a lot of **** and I beat him nice I'm real happy about that because I'm not good at these games but it felt good beating out the dude who's the dude who this **** no idea who this dude is gave me attitude though appreciate that **** no it's random Nintendo guy it was Dan Hibiki it was not Dan Hibiki",
            "start": 1685.56
        },
        {
            "text": "Felt good to meet the dude who's the face of Nintendo, this Reggie Fils-Aimé guy gave me attitude though. No, it was actually Dan O'Dowd, I think. It was not Dan O'Dowd, it was the event rep though. Reggie Fils-Aimé was also at the event. Bill Trinen was at the event too, but I didn't see him. So this guy was talking trash though - maybe it could have been Bill with a mustache, definitely could have been. Hardware is an important thing to talk about, yeah. What you said, you've glossed over it when we did the morning show, but give me the rundown of the controllers again. The controller F has the joy-cons, they're really tiny, yeah, just as tiny as they look. That's not to say they're not comfortable, they're good, they're solid controllers, especially when in the joy-con grip. Now you were saying the joy-con grip is as good as the Pro Controller - joy-con grip, Pro Controller equal, totally. When in a grip, it's a legit controller, it doesn't feel like super shitty.",
            "start": 1732.56
        },
        {
            "text": "\"Grip now, you were saying the Joy-Con grip is as good as the Pro Controller. The Joy-Con grip, Pro Controller equal - totally, when in a grip, it's a legit controller. It doesn't feel like super shitty; it's not like a weird third-party knockoff. It's like, 'Oh, this is a solid controller.' I've done the Zelda demo on it, and I'm like, 'I could play a whole Zelda game this way and be totally cool with it.' I prefer the Pro Controller because it has bigger buttons. I've always been somebody that likes big buttons; I always talk **** about the Vita and 3DS because they have such little baby buttons. Uh, the Joy-Con controllers are baby buttons - like they are. I think the exact same size as the 3DS, which to me is a problem. I don't like that ****. The d-pad on the Joy-Con feels wrong 'cause it's not the Nintendo d-pad; it's the... cuz you're used to the Nintendo d-pad being the cross right this is four separate buttons and the reason they did that is because they want the two controllers to be completely\"",
            "start": 1776.96
        },
        {
            "text": "Nintendo D-pad, it's the cuz you're used to the Nintendo D-pad being the cross right this is four separate buttons and the reason they did that is because they want the two controllers to be completely symmetrical to each other so people can play with left or right handed like alone and I I think that's kind of my biggest problem with a lot of the the decisions Nintendo made from a hardware perspective is they made so many concessions and so many decisions based off um things that I don't think consumers care about or want um and I think that like their big push with all the motion control stuff is an example of that and I don't think that the motion control stuff is bad and I think that games like Arms are examples of it being good um but you don't need to focus on that especially to the detriment of um the people that are actually playing these games and I think the focus on playing with just a Joy-Con controller is another example of no one's actually going to do that and if they are",
            "start": 1821.16
        },
        {
            "text": "of the people that are actually playing these games, and I think the focus on playing with just a Joy-Con controller is another example of no one's actually going to do that. And if they are, they shouldn't be the people you're marketing towards because that's family stuff where it's like the two dumb kids who don't know what they're doing, that just want to play yeah in that case they're totally fine; they don't need them to be symmetrical controllers, they'll figure it out. They figured it out for years with the Wii when the Wii made no damn sense - when you turn it on its side and it's like all of a sudden the buttons are in weird ass places, like with the one and the two and all that ****. Sure. Um, but I do think there's some major problems there. Um, but overall, they feel good. And what I'm extremely happy about is when they're separated and you just have them in your two hands, kind of like a nunchuck and a controller - that's when it's its best. I can totally see",
            "start": 1866.76
        },
        {
            "text": "I they feel good and what I'm extremely happy about is when they're separated and you just have them in your two hands kind of like a nunchuck and a Wiiote that's when it's it's best. I can totally see myself playing games that way. Um, Mario Galaxy is what really kind of pushed me over the edge of not hating the the Wiiote nunchuk situation where I was like I actually like this minus the waggle. Just having your hands separated feels pretty natural uh to play a game especially when you're used to to doing this it's like it's shocking that it it's as fun as it is and I don't know if you agree with me on that but yeah I had no problem with that setup Galaxy control like a dream yeah exactly and so I like it. I think that this is an even better step forward because whereas on the Wii you just had the analog stick and the nunchuck and Wii Moote were two very different devices having it be essentially two halves of a controller I'm like all right cool being able to play any game this way is going",
            "start": 1908.92
        },
        {
            "text": "analog stick and the nunchuck and Wii Mote were two very different devices having it be essentially two halves of a controller I'm like all right cool being able to play any game this way is going to be awesome you can wrap your head around it real quick yeah and whether it's tabletop mode or on the TV like it that it makes sense and I'm I'm looking forward to it just being able to sit like I mean nowadays wireless controllers are standard so it's not like that crazy of a thing but being able to sit wrapped in a blanket with your hands however the **** you want like just just be comfortable that's how that's that's how you play sometimes you're sitting here okay do I'm excited about that but um overall I'm let I wish that the Nintendo Switch from a hardware perspective from handheld mode is everything I could ever want it to be except for this this this this and this so it's not yeah you know if when you go back to years ago even um talking on Gamescast talking about what we want",
            "start": 1949.36
        },
        {
            "text": "is everything I could ever want it to be except for this, this, this, and this, so it's not yeah, you know if when you go back to years ago even um talking on Gamescast talking about what we want from the Vita 2 um I the Switch is essentially all of those things, you know it's like I just want a big screen that I can just play games on use a real controller for whatever it's like all that I want except the tiny ass baby buttons and all these weird ass things so I'm upset about that but uh it doesn't matter because there are so many different control options um the Joy-Con to to wrap that **** up the motion is the most precise motion I've ever seen in games it felt better than PlayStation Move it felt better than Wii Motion Plus and I already thought they were at a point with even uh with PlayStation Move that I'm like this is pretty damn good you know I can't imagine needing wanting better um but Arms was the best motion control experience I've ever had um so there's that uh the HD",
            "start": 1989.24
        },
        {
            "text": "PlayStation Move that I'm like this is pretty damn good, you know. I can't imagine needing wanting better, um, but Arms was the best motion control experience I've ever had, um, so there's that. Uh, the HD Rumble - there's no sensor bar or camera; it's all just done by the stuff inside the controllers. Yeah, okay, yeah. I mean, there was no sensor bar, so just making sure I didn't know if there was something on that on handheld mode or the dock that was doing something. No, just double-checking. Um, the HD Rumble stuff, uh, as I said on The Morning Show, so far feels more different than better, um, it's definitely different. The vibration is noticeable in a way that I haven't felt in video games since it started back in like Star Fox 64, like, um, but I don't know if that's a good thing; like, I don't want to notice the vibration in my controller, but if gameplay you know is based on that then that could be cool. That's the whole thing, right? I remember Rumble was distracting when it first got introduced.",
            "start": 2033.2
        },
        {
            "text": "the vibration in my controller but if gameplay you know is based on that then that could be cool that's the whole thing right I remember Rumble was distracting when it first got introduced right when you'd feel things rolling around hell constantly doing **** so so I don't know and I also didn't play one two switch which is the game showing that stuff off the most so there is that um I've been corrected many times based on the morning show that the Pro Controller also includes HD Rumble and maybe the games that I was playing on that controller Bas versus others I didn't feel it as much but I didn't feel it as much so it's either more intense in the joy con or Rumble just wasn't featured as prominently in the game as I played on that controller um the Pro Controller fantastic it's it's a real controller with you know a real setup of buttons and sticks that makes sense uh I do think that in the pantheon of current gen console controllers it's dead last uh I think both",
            "start": 2080.44
        },
        {
            "text": "It's a real controller with you know a real setup of buttons and sticks that makes sense. Uh, I do think that in the pantheon of current gen console controllers, it's dead last. Uh, I think that both the DualShock and Xbox One controllers are superior, not necessarily vastly superior. Um, I think it's closer than it could be, but I wish that they tried a little harder to nail this. Um, the big ass buttons are super choice, the d-pad is the d-pad that I love. Um, so it answers a lot of the the issues that I had with the the joycons. Don't love the trick triggers, um, but that's also cuz I'm used to DualShock 4 triggers and I do prefer those over the Xbox One. This is more similar to Xbox One, obviously there's many many many many millions of people out there that prefer the Xbox One controller over PS4 so it's all a matter of taste at that point. But I think that overall very solid controller. Is it worth $80? No, no, it's not. But it's got the HD Rumble, yeah, it does. So we'll see where that goes but I",
            "start": 2120.16
        },
        {
            "text": "so it's all a matter of taste at that point but I think that overall very solid controller is it worth $80 no no it's not but it's got the HD Rumble yeah it does so we'll see where that goes but I don't think that that makes it worth it uh but it is cool that uh it has all the the gyro stuff and the IR stuff that the joycons do or even the GamePad so you could play Splatoon and move just like you can with the the game pad and it feels just as right so that's good um the user interface very very very limited for how we got to see it um but it's very sleek and clean compared to the Wii U no focus of Miis none of that stuff uh in reports in the last couple days we saw that Mii will be on the switch but they're in a deep in the options system to go make one it's not like a prominent feature me versus dead um but the the whole focus of the UI is games it's like just four big blocks that are just different games you can play and then there's just like five settings underneath that that are like you",
            "start": 2170.6
        },
        {
            "text": "\"Dead, but the whole focus of the UI is games. It's like just four big blocks that are just different games you can play, and then there's just like five settings underneath that that are like you know settings and you know internet and eShop and whatever. I'm like all right cool, that's good that they're taking a more adult uh design interface so excited about that. And a thing that I'm I'm super impressed by is the speed at which it docks and undocks, which sounds like a stupid thing but it blew my mind at how responsive uh and snappy the Switch was. And it does lead to the name Switch, and like I think that a lot of why they called it that is because of how ridiculously crazy it is switching from TV to portable mode is when we saw in the Jimmy Fallon thing, everyone thought that was like a fake ass video playing and like there's no way it'll switch that fast. It really is like me and Kevin were like mind blown every time we saw someone take it out and how quickly would turn on and\"",
            "start": 2218.84
        },
        {
            "text": "a fake ass video playing and like there's no way it'll switch that fast it really is like me and Greg were like mind blown every time we saw someone take it out and how quickly would turn on and switch from uh the modes it is instant like it's as instant as unplugging and plugging in an HDMI cable so it's like there's like that one second of lag and all of a sudden it's on and I'm like man awesome good for you guys and detaching and reattaching the controllers super easy it's never like you never have to fumble and figure it out and overall this is the most adult Hardware Nintendo has ever made um all of it from Joy-Con the handheld mode thing the Pro Controllers all of it feels like adult products and not kids toys which is awesome uh cuz it still has the kid games which is why I love them so well yeah that was the big thing to take away right off that it looks sexy right for all these problems that we have with launch lineups or whatever the hell it's going to be like what",
            "start": 2266.52
        },
        {
            "text": "so well yeah that was the big thing to take away right off that it looks sexy right for all these problems that we have with launch lineups or whatever the hell it's going to be like what it looked like is it looks great so it's got I'm glad you played it and feel that way as well yeah how thick is it how thick is a joy so thin yeah so ridiculously thin like that's the the craziest thing is how sleek the entire device is where it is just like a big V um which is a great thing you know I I'm a little sad about how much Bezel there is on the screen itself and I get it it has to be there so that it could be docked in tabletop mode and for all the different functionality that it has so it's it's a little sad to see so much of the screen real estate be taken up by like the black bars around it especially when you play something like Zelda and I'm like man I could really appreciate that extra inch of Real Estate um but I'm sure I'll get over it and again it's just disheartening because like",
            "start": 2315.6
        },
        {
            "text": "especially when you play something like The Legend of Zelda and I'm like man I could really appreciate that extra inch of real estate um but I'm sure I'll get over it and again it's just disheartening because like I was like looking at my I was on a flight back from New York and I had my iPad Pro up and I'm like why can't this just be the Switch, yes you know like why can't I just attach a controller to this and download an app and play Nintendo games because that's all I freaking want to do yeah but whatever dreams are dreams you know dreams 2019 yeah",
            "start": 2360.8
        }
    ]
}