{
    "id": 2356,
    "video_id": "y9WNdPmpOxI",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Tim Gettys",
        "Alexis Pence",
        "Hunter Pence"
    ],
    "title": "SF Giant Hunter Pence and LetsGetLexi! - Kinda Funny Morning Show 01.31.2017",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1485899714,
    "duration": 4736,
    "transcript_chunks": [
        {
            "text": "What's up guys? Welcome to the Kinda Funny Morning Show. I'm Tim Gettys joined by Let's Get Lexi and Hunter Pence. It's been a long time in the making my friend. It's been too long. I know, I know. He is out there gallivanting across the world leaving poor Timmy back at home. Hardly, hardly. It's kind of the other way around where you've been gallivanting and growing and the studio is amazing. We do our thing. This is the first time you've been here. This is my first time to be at the studio. Yeah. But I've been following you guys from the ground up. The ground up. Start at the bottom. Yeah. Now you're here. Yeah, that's how that works. How have you been? What's the haps? What's the haps? Well, off season is coming to an end for Hunter so he's going to head to spring training soon. What's the haps for me? Just making videos and... Yeah, going, being a... Doing stupid stuff. Making fun of me for a living. Good, good. Yeah. You know, pretty much just training for baseball and being an idiot",
            "start": 0.0
        },
        {
            "text": "Haps for me? Just making videos and... Yeah, going, being a... Doing stupid stuff. Making fun of me for a living. Good, good. Yeah. You know, pretty much just training for baseball and being an idiot and loving it. So spring training, that means you go down to Arizona for a long time. Six weeks. Six weeks in Arizona. And you do all the... It's a great time actually. Really? Yeah. It's pretty fun. You would have a lot of fun in Arizona actually. Really? I always invite the guys to come. I invite Tim and Nick and you guys are like, I'm not really going to go to Arizona. Arizona, it sounds hot, sounds nasty, I'm sweating. But it's a weird world there. It's actually just a big party. Yeah, and people drive around in golf carts as cars. It's a big party. Okay. I can get behind that I guess. They day drink and they just like... Players, we're working, but everyone that goes there, it's like a vacation and it's like this huge like... So you're just chilling. I'm just chilling. He's out",
            "start": 57.0
        },
        {
            "text": "They day drink and they just like... Players, we're working, but everyone that goes there, it's like a vacation and it's like this huge like... So you're just chilling. I'm just chilling. He's out there working and you're just like, I got my golf cart. I got my golf cart today in my vlog. It's like massive college parties for people that are not in college anymore. Yeah. That's fun. That's cool. And that's what spring training is. And baseball, you know. It's relaxing. You got a lot of healthy food around. They have good coffee in Arizona. Like the good juicing, right? Like the juice cleanse juicing. Well you start off the day juicing and then you don't finish it that way. Yeah, you got to be careful with saying the word juicing around baseball. Oh yeah, you're different kinds of juicing. Yeah, she's not familiar with the baseball times back then. Yeah, so for people in the chat that don't know, 100pence, one of the San Francisco Giants. It's a baseball team if you don't know.",
            "start": 101.0
        },
        {
            "text": "Yeah, she's not familiar with the baseball times back then. Yeah, so for people in the chat that don't know, 100pence, one of the San Francisco Giants. It's a baseball team if you don't know. Baseball is a sport if you don't know. This is Alexis Pence now. Yeah. That's weird. That's a weird thing to get used to. Alexis Kazanbelides has been the, you know, that's a fun thing to say. It is fun. But Alexis Pence has a nice like... But man, I was happy to get rid of that bad boy one time. You got it. She didn't get rid of it. I boomed into my middle name because I didn't have a middle name. She still has Kazanbelides if you want to like throw her, you know, throw that out there. Yeah, yeah, yeah. That's messed up. She got lazy when she got to me. Speaking of the Giants though, we brought you guys a gift. Oh, I love gifts. Are you ready for this? Hell yeah, I'm ready for this. You guys ready for this? We got him an amazing backpack. Oh my God. I've been needing a new backpack. You've got",
            "start": 143.0
        },
        {
            "text": "guys a gift. Oh, I love gifts. Are you ready for this? Hell yeah, I'm ready for this. You guys ready for this? We got him an amazing backpack. Oh my God. I've been needing a new backpack. You've got to wear that for a while. Especially a bright orange one. It fits everything you wear. Especially a bright orange one. But there's something in the backpack. All right. So we got bobbleheads. It's not a bobblehead. It's a bobblehead of you. It's not just any bobblehead. I'm so jealous because first off, there's a lot of things I'm jealous about. You have to read it. One, your arms are really nice. Two... I've seen this painting of you. Yeah, it's a painting of me. That's what your arms look like. The Pandemus painting from Game of Thrones Gregor Show. You guys are familiar with it. All right, all right. But I'm jealous you have a bobblehead. I've always wanted a bobblehead of me. That's not a bobblehead. I'm sure there's going to be a bobblehead of you. I was just sponsored by Coca-Cola and",
            "start": 183.0
        },
        {
            "text": "Right. But I'm jealous you have a bobblehead. I've always wanted a bobblehead of me. That's not a bobblehead. I'm sure there's going to be a bobblehead of you. I was just sponsored by Coca-Cola and California's Great America. Those are two of my favorite things. Really? Have you ever been to California's Great America? What is it? Man, back in my day it was Paramount's Great America. It was a whole thing. It was pretty much Nickelodeon land. Like there's Disneyland. You'd go there and the Rugrats are there and then you get slimed. Yes. It was awesome. It was awesome. All right. Holy cow. Going in here. Bonus. So this isn't a bobblehead. Granted, someone out there has to know how to get a Tim Gettys' bobblehead. Yeah, come on, man. That can't be too hard. It's 2017. It is 2017. Y'all have like crazy paintings of you doing every cool cartoon or video or comic I've ever seen. There's got to be someone out there. Let Tim bobble. Let Tim bobble. I'm there, man. Can we get a hashtag? All",
            "start": 218.0
        },
        {
            "text": "like crazy paintings of you doing every cool cartoon or video game or comic I've ever seen. There's got to be someone out there. Let Tim Gettys bobble. Let Tim Gettys bobble. I'm there, man. Can we get a hashtag? All right, here we go. Here we go. Yeah. All right. Look at this guy. Here we go. Kevin, how do you feel about that? About what? The bobblehead? Tim Gettys bobblehead. Oh my god. We're fucking up, man. We should have bobbleheads, man. What would be the swag on Tim's bobblehead? It's a bobble body. It's a bobble body. It's not a bobblehead. It's a solar powered bobble body. Wait, what? Where's the solar power coming in? Does it have Wi-Fi? I think it has Wi-Fi, lasers, shootout. It doesn't stop dancing, though. It just keeps going? So it's like one of those hula dancers. Yeah. How do you feel about that slow down focused zoom? So there's my gift to you guys. So did they have to put you in the ball suit for the motion capture for this? No. I honestly don't remember how this came about. All of a sudden",
            "start": 254.0
        },
        {
            "text": "down focused zoom? So there's my gift to you guys. So did they have to put you in the ball suit for the motion capture for this? No. I honestly don't remember how this came about. All of a sudden they were handing them out and I was like, oh, there's a bobble body of me. So how does that work when you're legitimately famous? Do you just like, do they own your likeness? Can they just do whatever they want with you? What if you were really against bobble bodies? Would you be like, nah. I think there's a way to put a stop to it. There is rumors of Brian Wilson. He used to be a closer with the Giants. I think he bought the rights to his bobblehead. So smart. And the team wanted to make a bobblehead and he said, no, you have to pay me. So he would buy the bobbleheads at $40 and sell them to the team at $60. That's some Tim Gettys shit. Nobody make a Tim Gettys' bobblehead. I own this shit. He bought the rights to like his, all of everything that was him, like he was, he's really crazy",
            "start": 298.0
        },
        {
            "text": "to the team at $60. That's some Tim Gettys shit. Nobody makes a Tim Gettys bobblehead. I own this shit. He bought the rights to like his, all of everything that was him, like he was, he's really crazy cerebral like really smart guy. But it also, you know, you can get like, you can get under people's skin. You know, these are, these are some of those. Well, that's the thing with the trademark. You can't spell Tim without TM. So I already got that shit. I'm about that. I'm about that life. Oh, so you have some things already. No, I don't have them. You bought the rights to Tim Gettys stock. If you did have a bobblehead, what kind of swag would you put on your bobblehead? Definitely a bomber jacket. He's got to have a sweet watch. Bomber jacket. It just goes to kindofunny.com. Yeah. Bomber jacket, perfect comber. Bomber jacket, perfect comber. The jacket needs to be like the, like rolled up or not even rolled up. I'm just kind of scrunched up. Scrunched up jacket. Because I don't have",
            "start": 342.4
        },
        {
            "text": "Jacket, perfect comber. Bomber jacket, perfect comber. The jacket needs to be like the, like rolled up or not even rolled up. I'm just kind of scrunched up. Scrunched up jacket. Because I don't have time to roll. I'm not like too clean about this stuff. Like you're always like preppy about it. Not preppy. I don't even know what the right word is, but like you're, it's on point. Everything's put together with Alexis. I'm a little bit more. I'm the opposite. I'm with you. You got the hair though. I'm going to try to keep it clean this year. It's good. I'm married man now. Oh yeah. It's a good game. Jordan. There will be some Jordans on the bobblehead for sure. Jordans? You're going to wear J's on your feet? That's pretty much all I do. That's really all that I need, you know, to like really nail that. I feel like you always have a watch on. What would be the watch? How many watches do you own? My Mickey Apple Watch. That would be your watch that you would have on there? I'm pretty sure",
            "start": 387.96
        },
        {
            "text": "Nail that. I feel like you always have a watch on. What would be the watch? How many watches do you own? My Mickey Apple Watch. That would be your watch that you would have on there? I'm pretty sure I would have to pay a lot of rights for it, but you know what? We don't do that here at Techmo DinoMite. We just kind of see what happens. Just make stuff and wait for the law? Just go for it. You know, I was semi-insulted slash, like I took it as a compliment from my brother recently. He was just like, you always wear those Let's Get Lexi jackets. And I was like, first off, these are Tim Gettys' jackets. Second off, I'll take it. I'll take it. Those Let's Get the bomber jackets. He says that the bomber jackets are Lexi jackets? Yeah, he credits it to her. Hell yeah. So it's like, I'll give her that, you know? But like, we can share it. We can share it. Let's get the chicken or the egg. Yeah, exactly. I don't know. Did you always use to wear bomber jackets? No, you used to wear the leather. I",
            "start": 422.52
        },
        {
            "text": "you know? But like, we can share it. We can share it. Let's get the chicken or the egg. Yeah, exactly. I don't know. Did you always use to wear bomber jackets? No, you used to wear the leather. I will say this. When I didn't meet you, we would come to work and look identical and look identical with jackets. We have that same jacket. You have the male version of it. And I have the feel. The old Bay Rapture jacket. Yes. And we came into work and we were like, this is twinsies. This is twinsies. So on the show, we kind of just chat, do whatever we want for a little bit. Then we get in the news. If you didn't know, it's Kinda Funny Morning Show every Monday through Friday. You can find it right here on Twitch.tv slash kinda funny games. Or later, you don't even watch it live. You can watch on YouTube.com slash kinda funny. Or you can go to podcast services across the globe. So you can even listen to this stuff. You're traveling, you're playing your baseball, you're going to Arizona",
            "start": 466.96
        },
        {
            "text": "on YouTube.com slash Kinda Funny. Or you can go to podcast services across the globe. So you can even listen to this stuff. You're traveling, you're playing your baseball, you're going to Arizona, you're going to, I don't know where else they play baseball, which I guess is most places. You go there and you can listen to your podcast. You can listen to this show. We listen to a lot of your shows. I appreciate that. Let'sGetLexi is always trying to catch up on what y'all are doing. So we sometimes watch it live. We sometimes watch it in the elevator or on the phone. It's really funny because I'll be in like reception areas and then you guys will say something so funny. And you know when you have that laugh and like, she'll have like headphones on and it's like really quiet. She's watching you guys. Like what you're laughing about. So you're sitting there and like, I just have to like put my hand over my face. I act like I'm not with her because she'll just be like, I don't know where, like",
            "start": 507.48
        },
        {
            "text": "Like what you're laughing about. So you're sitting there and like, I just have to like put my hand over my face. I act like I'm not with her because she'll just be like, I don't know where, like this really awkward laugh and it's like complete silence, man. But the worst thing is if they were to ask you like, what, what are you laughing at? Cause they need to explain it. It's like, well there's these guys and I at home, you can see there's a wiener dog and one word bongos. Bongos? The bongos are coming. How many days since the bongos? I gotta hear this. The snake's coming in. Bongos. Bongos. Only for charity. Only for charity. You gotta let a hundred pence bongo you. No only for charity. Oh with the hair on his head. Look at these hands man. It's on his tummy. They bongo his tummy. Show me, just show me your tummy a little bit. You bongo the tummy? Yeah you bongo the tummy. No Nick, no. I know that Greg really hates to be tickled. How often do y'all tickle him on screen? Oh my God.",
            "start": 544.6
        },
        {
            "text": "me, just show me your tummy a little bit. You bongo the tummy? Yeah you bongo the tummy. No Nick, no. I know that Greg really hates to be tickled. How often do y'all tickle him on screen? Oh my God. You never know about tickling Greg? Every day from now on. Nick, are you kidding? He hates it so bad. He like broke a table or something at our house when we tickled him. Nick, he's a professional athlete. Okay? I can't fight him. If you tickle me, I can fight you Nicholas. When you tickle Greg, he giggles so high pitched. It's like tickle me Elmo but it's tickle me Greg and it's just like this happy, jolly tickle. See, forget the bobbleheads. We need to make a like a tickle me combo of Greg that you can bongo on. Bongo the belly. A tickle me elbow of Greg bongo belly. Oh man, that's genius. That is genius. You're amazing, Greg. You're just amazing. Isn't he just like this like... He's the best. Oh stop. And now he's got this Rico Sualda hair out of nowhere. I'm like... Like I don't",
            "start": 591.4
        },
        {
            "text": "That is genius. You're amazing, Greg. You're just amazing. Isn't he just like this like... He's the best. Oh stop. And now he's got this Rico Suave hair out of nowhere. I'm like... Like I don't even notice Greg's face anymore. I just notice his hair. Yeah, I immediately feel bad about myself because you're so good looking. Oh stop. I love it. Oh stop. So anyway. I love you wearing the hat by the way. I'll catch you in all your little celebrity appearances and you're just like rocking the hat. I'll rock the hell out of this hat. That's the old school one too. You're OG. I'll be... Yeah, this is the... You say it's old school and I begged you to like make more of these. You like the blue belt. I like the blue. I'm a bit anxious though. It's what I do. No, I was saying I can't wear the hat because my hair is more iconic. You got the iconic hair. I got the iconic hair. It's all I got really. So I got to run with something, you know? Yeah, I rock this hat almost everywhere and it's",
            "start": 649.28
        },
        {
            "text": "That because my hair is more iconic. You got the iconic hair. I got the iconic hair. It's all I got really. So I got to run with something, you know? Yeah, I rock this hat almost everywhere and it's like a big deal to me like this morning because I wasn't sure if I was gonna have time like we were trying to be here on time. I got up and I knew I didn't... We actually didn't... I didn't know I was coming to Kinda Funny. I was just wearing my hat on an airplane or whatever when we flew in yesterday or two days ago and obviously I shower in the morning. I'll never put it on after I shower because my hair is wet and I don't want the hat to get wet. You got Mufasa hair. Yeah, he does. Yeah, I got to keep the hat, you know, not getting all messed up by the wet hair but I had to put it on this morning. It was a big risk. Yeah. But I was like I can't not have my... Gotta roll those dice sometimes, you know? So I love this hat. It's like a part of me. Yeah, that's awesome. It's a part of me.\n\nI corrected the following:\n\n- \"kind of funny\" to \"Kinda Funny\" (proper noun)\n- No other changes were made as the text was already clean and accurate in terms of spelling and grammar.",
            "start": 689.44
        },
        {
            "text": "morning. It was a big risk. Yeah. But I was like I can't not have my... Gotta roll those dice sometimes, you know? So I love this hat. It's like a part of me. Yeah, that's awesome. It's a part of me. I like that. So talking about your hair, your hair is fantastic. I feel like it's always an invention of its own. I don't think anyone's ever made and called my hair fantastic. Thank you. The thing is you rival Let'sGetLexi in terms of who has bigger hair. Bigger, curlier, fro-ier hair. This girl... Do you have a picture of last year my horrible fro-y hair or anything that you can pull up, Greg? I'll get into it. There's some really bad shots of my hair. It was like... So I had come up... I had made like this commitment to one of my teammates, Strickland. He was like, I'm not cutting my hair the rest of the year. Let's do this. It was like a thing. So I was like, all right, I'm in. I won't cut my hair. And then I had to try to sell this to Alexis because she's like, you know, the wedding was",
            "start": 724.36
        },
        {
            "text": "Rest of the year. Let's do this. It was like a thing. So I was like, all right, I'm in. I won't cut my hair. And then I had to try to sell this to Alexis because she's like, you know, the wedding was coming up. I was like, look, I won't cut my hair and then I'll be able to look like Napoleon Dynamite. What is this? Hold on. That... I'm not doing that anymore. That was in the freaking playoffs. I look back on those photos and I'm like, what was I thinking? There's pictures of homeless people that look better than me. Much healthier and better. Oh my God. I love it. Wait, Kev, go to my Twitter real quick. That is me. And then there's that. Marv from Home Alone. We did that. We did the Sticky Banners. That was actually a cool idea. You guys are really... Keeping it clean cut this year. Keeping it clean cut. Where's it going? Where's it going? So scroll down to the GIF that I just posted. I love such a cool banner photo. I know, right? Thank you. It's so cool. So what do you think about",
            "start": 763.28
        },
        {
            "text": "it's clean cut. Where's it going? Where's it going? So scroll down to the GIF that I just posted. I love such a cool banner photo. I know, right? Thank you. It's so cool. So what do you think about this? I just love it. Like, look at your eyes. There's so much intensity. Look, wait. If you pause it on where... When I hit the ball, I think my eyes are closed. I had a black eye and like probably maybe... Yeah, they are. I think my eyes are closed. I was completely fooled by the pitch. It was like a slider and I was like, oh, it's going out there and I hit it. And I was like, I hit it. There's so many shots of you. I'm very professional. You're crazy running into the fences and stuff. It's just like you're going at the thing at like 100 miles an hour and you're just like jumping into it and you catch it. I'm like, man, that looked like you knew what you were doing. And I'm like, how did you do that? I don't, man. I don't really. You just feel it? You know, you just got to go do it, you",
            "start": 814.4
        },
        {
            "text": "you catch it. I'm like, man, that looked like you knew what you were doing. And I'm like, how did you do that? I don't, man. I don't really. You just feel it? You know, you just got to go do it, you know? Yes. You just see the ball and you go try to catch it. Like it's kind of a weird concept, man. Like... Skate better. I get it. Yeah, skate better. Greg taught me about skate better. And so now I say that to him. I'm like skate better. What is skate better? I don't know enough about this. There's a Disney Channel original movie. Some would call it a masterpiece. I would. It's called Brink. And it's a story about some inline skaters. It obviously took place in the 90s. And they decided that they were going to... I'm thinking about getting Rollerblades. Good, you should. You're very turny. You're all out of top. You might as well. Yeah, let's get on it. There was the Rollerblades were featured in The Bachelor last week. Not that I am obsessed with that show or anything now. But...",
            "start": 856.48
        },
        {
            "text": "You're all out of top. You might as well. Yeah, let's get on it. There was the Rollerblades were featured in The Bachelor last week. Not that I am obsessed with that show or anything now. But... You're becoming domesticated really fast, Tim. I love The Bachelor. Do you watch it? No. You would love it. You would fucking love it. You would love it. It's so good. Anyways, back to the important stuff. Brink. A masterpiece. It's pretty much like the artists. The people that are passionate versus the sellouts. So it's Team Pup and Suds. They're sponsored by a local pet cleaning service. And then there's versus Team X-Blades. They're the sellouts, right? They're like the bad boys and whatever. And at the very end, the good guys are losing. And then Little Sister walks up to him during the halftime and is just like, Hey, I got some advice for you. And he's like, What do I need to do? And she's like, Just skate better. And he's like, You're right. All I gotta do is skate better.",
            "start": 896.32
        },
        {
            "text": "and is just like, Hey, I got some advice for you. And he's like, What do I need to do? And she's like, Just skate better. And he's like, You're right. All I gotta do is skate better. And I thought that was really wise advice. Because it's just like, How do you do things better? Just do them better. So Greg's story to me was much different. I would love what Cool Greg's interpretation of the storyline of Brink was. He didn't give me that whole, like the whole... Now I know what to do this year. Yeah, just skate better. 2017 is going to be so much better. Skate better, man. That's all you got to do. Why does Hunter Pence have rollerblades on the field? Skating better. Yeah. So going back to the gift, though, I'm really impressed. Not that I should be. Like, this should not be a surprise. But on the Twitter gifting, I typed in Hunter Pence and there was a whole bunch of them. That's what you know. You've made it. Or you're old and you've been around a while. Just go, compose a new tweet.\n\nNote: No changes were necessary as the text appears to be accurate given the metadata context.",
            "start": 938.8
        },
        {
            "text": "on the Twitter gifting, I typed in Hunter Pence and there was a whole bunch of them. That's what you know. You've made it. Or you're old and you've been around a while. Just go, compose a new tweet. Compose a new tweet? Go to Add a Gift, type in GameOverGreggy. We're having quite the study here. Hold on. Oh, hey! Hey! GameOverGreggy, someone got his shirt off in Wrecking Ball. Did he do that? Why'd you add a heart, Kev? Why'd you add a heart? I'm sorry, when I switched screens. Is it auto? Kevin's auto, correct? GameOverGreggy, how are you? Yeah, so that was when we were on the RT podcast and GameOverGreggy decided to cut holes around his nipples in his shirt. Oh, I saw that. Yeah, so that was a thing. That's cool. Type in Colin Moriarty. By the way, my bobble body's still dancing. Yeah, he ain't gonna stop. We got solo power in here. All right, cool. Okay, so that's where it ends. We don't even need to look for Nick. Don't worry about it. Seducer producer. I love that. That'd be awesome if he was just",
            "start": 986.72
        },
        {
            "text": "We got solo power in here. All right, cool. Okay, so that's where it ends. We don't even need to look for Nick. Don't worry about it. Seducer producer. I love that. That'd be awesome if he was just the only one on there. Oh my god, there's so many of them. There's so many of them. I love it. And there's guys doing impressions of you, too. What? Wait, can we show the one of me and Greg dancing? Which one's that? Oh. Third one down on the left. Oh, is that it? There was one where we did a salsa dance. That's it. Hold on, but that was it? No. Oh, here we go, here we go. I learned a salsa, man. Dance better. Whatever it takes. Dance better. I just want to dance. You know, maybe that's why I have a mom and buddy. There you go, they knew. They knew the branding. Daitel in the chat wants to know where you got your dope Zelda Switch. That is a great question. And I feel like as I walk around with this on, it's like the sound, kshh, kshh, kshh, is going with me. It was Super Smash Bros.",
            "start": 1044.56
        },
        {
            "text": "know where you got your dope Zelda smart. That is a great question. And I feel like as I walk around with this on, it's like the sound, kshh, kshh, kshh, is going with me. It was Super Seven. Super Seven. Alexis knows the spot. Actually, I found the store with Kevin. We were walking around. Dolores. It's got some amazing amazing stuff. Almost every shirt I wear is from there now. I love it. Yeah, they've got a lot of really cool video game themed shirts and sweatshirts and SF themed shirts. It's kind of right up most of the Kinda Funny crew's swag. San Francisco and video games. There's one in San Diego and there's one here. And there's online stuff, right? Yeah, so Super Seven, check them out. Super Seven store. For sure. Cloverleafbane says, Hunter Pence brought chips to his salsa class. That sounds like a pro maneuver. I like that. That's a funny joke. That's pretty good. That's like a throwback to the three years ago when there were Hunter Pence signs. I don't",
            "start": 1091.4
        },
        {
            "text": "to his salsa class. That sounds like a pro maneuver. I like that. That's a funny joke. That's pretty good. That's like a throwback to the three years ago when there was Hunter Pence signs. I don't know if you remember that. Yeah, that was a thing. That was definitely a thing. And actually you made a rap about it. We did make a rap. I was wondering when that was going to come up. That's a little funny. I thought you were joking. Me too. Yeah, that was awesome. Man, I need to shut up about myself. The first Kinda Funny video when we were branded Kinda Funny, technically. That was fun though. About the 307th video that we've done. It's so funny. We just have so many arbitrary dates now that at any moment we can be like, it's our anniversary. It's the anniversary of the first conversation with Colin. The first Game of Regret show. The first Kinda Funny when we launched our second Patreon. It's just like, whatever we want. You guys like to celebrate. That's good. You have a lot to",
            "start": 1135.32
        },
        {
            "text": "with Colin. The first Game of Thrones show. The first Kinda Funny when we launched our second Patreon. It's just like, whatever we want. You guys like to celebrate. That's good. You have a lot to celebrate about. Anything you can make a reason to celebrate, why not? We tried to condense it down to January 5th. That's when we celebrate our independence from IGN. Whoa. Independence day. Kind of Funny. Independence day. Kind of Funny live is kind of the mid-year. We get two big things from the year. The Kinda Exit? No. No. That's what I think is the name of Brexit. We don't get too political. Colin's not here. When is Kinda Funny Live this year? We're working on it. We're still trying to lock the venue. For everybody asking, ASAP. As soon as we know, you will know. As soon as the contract is locked. It is what it is because we told people they'll know soon. They still will know soon. Soon, by definition, is a pretty wide, ambiguous thing to say. It's going to be a good time. It's",
            "start": 1179.16
        },
        {
            "text": "It's locked. It is what it is because we told people they'll know soon. They still will know soon. Soon, by definition, is a pretty wide, ambiguous thing to say. It's going to be a good time. It's close, guys. It is close. The announcement is close. Let's get into the news. We're ready for the news. It's only been 21 minutes. Oh, actually, before we do that, Big Kev Dog, can you come over here? I need you. I'm having a couple issues. Uh oh, we have issues. What? With Moxie. Oh, what's wrong? We've got to chat here. I'm going to read the chat while you have... Can you give us a month, please? Someone said soon. It's January 5th. Please have bongos on Kinda Funny Live 3. Are we going to have a charity event? Well, Kevin will be there. So there will be a bongo. No. There will be a bongo. Hold on, hold on. That makes a lot of sense now. They're",
            "start": 1229.0
        },
        {
            "text": "Live 3. Oh. Are we going to have a charity event? Well, Greg will be there. So there will be a bongo. No. There will be a bongo. Hold on, hold on. That makes a lot of sense now. Hold on. They're still trying to book the bongos. How do they know each other? Wait. Hunter Pence just drove by. Hunter Pence turns his own copyright. G-Frost. Who's the face with hearts? That's Alexis. This is Alexis. You can follow her at Let's Get Lexi. She has a YouTube channel. All the socials are your Let's Get Lexi. Yeah. All the socials. Give her a follow. She's pretty funny. 742-80-3. It's pretty funny. Okay. Hunter, what is your favorite Zelda game? It's probably... Um, probably the original. How do I do this? The only two that I've beaten was the first one on Nintendo. Can you do that? And the Link. The one right after it. I believe Link was after the first. Zelda? Yeah. The first one. The first Link was the two. Yeah. Yeah. I'm not sure if you beat Adventures of Link. That game is hard. I had it",
            "start": 1276.92
        },
        {
            "text": "one right after it. I believe Link was after the first. Zelda? Yeah. The first one. The first Link was the two. Yeah. Yeah. I'm not sure if you beat Adventures of Link. That game is hard. I had it on one of those... Harder than Bionic Commando. Mobile devices. On the Game Boy Advance? Yeah. I think it was. Probably. They re-released it on Game Boy Advance. Yeah. I had it on that and it was when I was like maybe in the minor leagues and I was on like 12 hour bus rides. So I had plenty of time. I beat some crazy games on that thing. Metroid. You all Metroid fans here? Oh, hell yeah. Man, you beat the original Metroid? Yeah. You crazy, man. You crazy. That's a lot of times. Those games are hard. I like the two of the two OG's. I like the... There's so many secrets in those. Oh yeah. Super Metroid. I bet you I could never beat it again if I went back and tried. Yeah, no, man. That's what happens. Those games are hard. They are. Are we really? Are we getting everything fixed up?",
            "start": 1334.76
        },
        {
            "text": "I bet you I could never beat it again if I went back and tried. Yeah, no, man. That's what happens. Those games are hard. They are. Are we really? Are we really? Are we getting everything fixed up? No, we're still working on some stuff. But Greg, can you just pull up the first news story? Yep. Cool. So this is a big one. Ben Affleck will not direct the Batman. This is from Variety. Ben Affleck has decided to step down as director of the Batman and remain on as producer and star of the project. Affleck is still on board to play the superhero, but sources close to the town said Affleck and Warner Bros., after discussing how to best make the film possible, came to the decision together. Affleck says, there are certain characters who hold a special place in the hearts of millions. Performing this role demands focus, passion, and the very best performance I can give. It's become clear that I cannot do both jobs to the level they require. Together with the studio, I've decided to find a",
            "start": 1379.36
        },
        {
            "text": "this role demands focus, passion, and the very best performance I can give. It's become clear that I cannot do both jobs to the level they require. Together with the studio, I've decided to find a partner and a director who will collaborate with me on this massive film. I'm still in this. We're still making it, and we're currently looking for a director. I remain extremely committed to the project and look forward to bringing this to life for fans around the world. So it's to say this decision was solely made based on what's best for the project and had nothing to do with the recent disappointment of Affleck's recent directing job, Live by Night. That was a big thing. I've already heard about that. Ben, skate better. Yeah, skate better, Ben. So what's dressing me about this is the fact that earlier Ben was like, I won't direct this movie unless it has a good script. When you add up that statement and this statement, things aren't looking good for the Batman. So I'm a little bit",
            "start": 1412.36
        },
        {
            "text": "that earlier Ben Affleck was like, I won't direct this movie unless it has a good script. When you add up that statement and this statement, things aren't looking good for Batman. So I'm a little bit worried about that. Having said that, the Disney movies... So wait, did Affleck back out, or did he... What did they just say? I must have missed, like, what... They're saying that he... So he's... Is this too much work for him? He's backing out for the betterment of the project, because he thinks that he needs to be able to not direct and act, which is a very valid thing to say, because directing and being in a movie is like, you need to focus on one thing or the other. When you're Ben Affleck, though, you can kind of do whatever you want. So why did you boo him not directing it, Kevin? I need your insight. Because, I mean, he's a good director. He's won, I think, two Oscars for directing. Well, no, I think one Oscar was for screenwriting. What were the movies? Good Will Hunting was for...",
            "start": 1445.08
        },
        {
            "text": "\"Your insight. Because, I mean, he's a good director. He's won, I think, two Oscars for directing. Well, no, I think one Oscar was for screenwriting. What were the movies? Good Will Hunting was for... Argo and Good Will Hunting. Yeah. Oh, he directed Good Will Hunting? Yeah. He wrote it. He wrote it. I'm not sure he directed it. Yeah. He's a talented man that has made good movies. So hearing that he was taking up a DC property, which as of right now, none of the movies really. There's a couple okay ones, but... They need some help. They need a lot of help. Yeah. And so this movie is like Affleck directing Batman. It's like, I mean, it's Batman. So far, the Batman is the best thing about the DC Universe movies. Right. What was everyone's thoughts on Ben Affleck as Batman? I know there was a lot of debate going on. I don't know if there was much debate. He was awesome. Yeah, we love him. You do. I think he was great. The Batman himself was a very different Batman. I did not care for him\"\n\nCorrected changes:\n\n- \"Greg\" is not mentioned in the metadata, but it's likely referring to Greg Miller, so no change.\n- No phonetic or spelling errors were found that needed correction.\n- Proper nouns like movie titles (\"Good Will Hunting\", \"Argo\") and names (\"Ben Affleck\") are already capitalized correctly.",
            "start": 1493.0
        },
        {
            "text": "Lot of debate going on. I don't know if there was much debate. He was awesome. Yeah, we love him. You do. I think he was great. The Batman himself was a very different Batman. I did not care for him as Batman. Boo. I'm sorry, I don't... But see, I feel like this is not the universe that we need to be diving into because they read the comics and know like... No, it's just a different Batman. I just like the other Batmen better, the faster, quicker... He's fast and quick. He's just like, he's a brawler though. He's a little mean. He was a tank, man. He was like this huge, Jack slow, dark Batman. And then the hit. Power. But I don't know. I didn't really enjoy him and I didn't really find much charisma to his Bruce Wayne either. Oh, I thought he was sexy. I don't want to throw, you know, shade on out there, but I agree with you. I just shot through shade, but here's the shade. Batman v Superman didn't... I wore like a Batman v Superman shirt for like... Yeah. Oh, like every... At",
            "start": 1542.44
        },
        {
            "text": "on out there, but I agree with you. I just shot through shade, but here's the shade. Batman vs Superman didn't... I wore like a Batman v Superman shirt for like... Yeah. Oh, like every... At least once a week for months. Yeah. So maybe it's good that he's just concentrating on acting. I guess. Let's try it again, Ben Affleck. I mean, the director's the most important part here. Good Will Hunting and Batman are like two totally different... But to be fair in Good Will Hunting though, he was like such a small part in it. Yeah. He was like the best friend. That's the fun thing. But I mean, he wrote it. Yeah, he wrote it. But it's different than like acting. If they get Snyder for this, I'm done. I mean, I'm already done. So wait. So I'm so unversed in this whole world, but like the Batmans that I liked were like the Dark Knight, that whole trilogy. Oh, yeah. Undeniably, those are the best. Yes. For sure. No one's disagreeing with that. So that's why I was a little bit sad about Batman v Superman",
            "start": 1587.52
        },
        {
            "text": "I liked where like the Dark Knight, that whole trilogy. Oh, yeah. Undeniably, those are the best. Yes. For sure. No one's disagreeing with that. So that's why I was a little bit sad about Batman v Superman because... It was a total departure from that, yeah. Yeah. I liked that. And that's done, right? Like the director and that Batman... Yeah, he's done with that. Yeah. And this is a total new thing. And it's... It's riveting. Yeah. It's riveting. It's happening. Yeah. All right. So our thoughts are sad that Ben Affleck's not producing it. Yeah. He is producing it. He's not directing it. Yeah. Oh, he's producing it. He's not producing it. I mean, these days, what does producing even mean? It pretty much means you're a big enough star that you get your two credits instead of one. Oh, whoa, whoa. Some stars... And you get paid more. Like didn't Ryan Reynolds have a lot to do with Deadpool actually getting made? Yeah. I mean, some producers still mean... Like Vin Diesel. You damn well know",
            "start": 1633.84
        },
        {
            "text": "Some stars... And you get paid more. Like didn't Ryan Reynolds have a lot to do with Deadpool actually getting paid? Yeah. I mean, some producers still means... Like Vin Diesel. You damn well know that he has a lot to do with making The Fast and the Furious. God bless Vin Diesel. Yeah. He's a cool dude. Shout out to Vin Diesel. Vin Diesel. Vin Diesel. Yes. All right. Next story, Kev. Okay. Is this what it's supposed to be? Yep. That's all that it is. So this is a thing very near and dear to my heart. They're making a documentary about Tony Hawk's Pro Skater, the history of the series. This franchise is very, very important to me. Sure. I'm going to have to go through that today if it wasn't for it. I have a signed copy of Tony Hawk's Pro Skater somewhere. Which console was that on? I remember that game. That game was... PS1, N64, Dreamcast. Yeah. Were you all at points skating around and stuff? I don't know what I'm saying. Oh, is it behind No Mercy? I never played that game.",
            "start": 1679.92
        },
        {
            "text": "That game. That game was... PS1, N64, Dreamcast. Yeah. Were you all at points skating around and stuff? I don't know what I'm saying. Oh, is it behind No Mercy? I never played that game. No, it's not. Oh, yeah. It's at the house. Whatever. It's at the house. You're just going to have to believe me. So that's the thing. The documentary is called Pretending I'm a Superman, which is an awesome name. Obviously a reference to the song Superman in Tony Hawk's Pro Skater 1. It features Tony Hawk, Rodney Mullen, many more people. You can follow them on Twitter and Facebook for updates on the project. You better damn well believe that I'm trying to get involved in this. And I will be interviewed. It has to happen. What did you like so much about it? About the whole... I don't know. Honestly, Tony Hawk's Pro Skater is so important to me because it wasn't even so much about the game as much as it was about the culture that it introduced me to. Like the soundtracks in the game. The culture? Yeah.",
            "start": 1724.68
        },
        {
            "text": "Pro Skater is so important to me because it wasn't even so much about the game as much as it was about the culture that it introduced me to. Like the soundtracks in the game. The culture? Yeah. It was like the... It's considered a masterpiece, right? The music that I... Oh, yeah. Tony Hawk's Pro Skater 2 specifically is one of the... That came out of no... That was considered a masterpiece. It was. It was. I mean... No, it's one of the best games considered to have ever made. Tony Hawk 2 was one of the... Some games are just made that are brilliant. I think Tony Hawk's Pro Skater 2 was the seventh ever 10 out of 10 IGN ever game. And EGM gave it a 10. It was getting 10s left and right. And the series has had bad moments recently. But back then it was classic. But what I liked so much about it was the soundtrack and the kind of just like culture that it portrayed. The music I listen to now is entirely influenced by the music that they introduced me to in those games. Oh, wow. The",
            "start": 1764.08
        },
        {
            "text": "about it was the soundtrack and the kind of just like culture that it portrayed. The music I listen to now is entirely influenced by the music that they introduced me to in those games. Oh, wow. The reason I like Underground Hip Hop is because that game introduced me to... Underground Hip Hop. Yeah. And it's like there was so much care and attention to the level layouts and the cities they introduced you to and how the characters dressed and all that stuff. Like, if you look at pictures of me back then, I dressed like these guys because I was like, they're cool. That's what I want to look like. Yeah. I did too, for what it's worth. But not because of the game. Just because you just like dressing cool? Yeah. There was one store called Valsurf that I thought was just super cool. You know, if you want to be cool... Listen, I'm a girl from the valley. Dress cooler. It was either my uniform or like, I don't know, sweats. Surfer clothes. Yeah. There you go. There you go. So, I'm going to",
            "start": 1803.8
        },
        {
            "text": "you want to be cool... Listen, I'm a girl from the valley. Dress cooler. It was either my uniform or like, I don't know, sweats. Surfer clothes. Yeah. There you go. There you go. So, I'm going to go ahead and get the news. Over on NeoGAF, there was a thread where they were talking about this documentary and there was a couple choice quotes from Tony Hawk's Twitter, including someone asking, are there more plans for new games in the Tony Hawk's Pro Skater series? And it replies, not from Activision. So that's good. That's real good. But they're like the... Alright. I'm potentially working on something, but it's so early I couldn't talk about it. I don't have any contracts signed, but it's exciting. I feel like it's with the right people, so I should know more in the next couple months. This is interesting because a couple days ago, one of the EA community managers tweeted out simply, #Skate4. So the idea of Tony Hawk's Skate 4 could be, that's like just two worlds coming",
            "start": 1844.84
        },
        {
            "text": "It's interesting because a couple days ago, one of the EA community managers tweeted out simply, #Skate4. So the idea of Tony Hawk's Skate 4 could be, that's like just two worlds coming together. It's going to be a good old time. E3, get hyped. Year of Dreams 3, let's make this happen. So let's read some tips. I'm going to do this. I don't know why this reminds me of BlizzCon last year. All the rumors about Diablo 4. Oh yeah? Diablo 4, man. That's... It's a game I'm really... I feel like that's a while away. That's probably not even ever going to happen. I don't know. It has to. Why? I don't know. You gotta wait for... I mean, 3 is still popular, so you gotta wait for it to kind of like die down. Is it? I mean, it's like people are still playing it. It's not like... Diablo 2. No, no, no. Diablo 2 had like the longest tail of all time. It's still fun. But I mean, I think that's because there was other games that kind of took its place. Like World of Warcraft came",
            "start": 1886.44
        },
        {
            "text": "Diablo 2. No, no, no. Diablo 2 had like the longest tail of all time. It's still fun. But I mean, I think that's because there was other games that kind of took its place. Like World of Warcraft came and I changed the game in terms of people's... You can only play 24 hour games once, you know what I mean? Like per day. He doesn't. You can't split your time. He figures it out. Yeah. Makes more hours on the day. Diablo 2 had so much like playability because you had to go all the way to level 99. Yeah, you had to fight those cows. You never got that. You had mad cow level. The Mad Cow? That's all I know. You had to fight each other. I get to a certain level and I'm like, all right. Done. I'm good. So the tips. Go in here. Let's see. Where do we start? Now we're here. You know, people do speed races of Zelda. I'm sure you've seen that. Oh yeah. Awesome games done quick. It's like a 30 minute game. So we got... No, that's a subscriber. Do you need help, Tim? Here we go. Nick tips. Hey",
            "start": 1939.76
        },
        {
            "text": "Speed runs of Zelda. I'm sure you've seen that. Oh yeah. Awesome games done quick. It's like a 30 minute game. So we got... No, that's a subscriber. Do you need help, Tim? Here we go. Nick tips. Hey Hunter, I love you as a player and a person, but I got to say it. Go Cubs go. There's going to be a lot of people here. We got a varied audience. You know what I mean? Hey, mad respect. We love all baseball fans and you know what? I applaud the Cubs. They had an amazing season. You know what? We fought hard. We were up three runs in the ninth and they came back and scored four to beat us. I was on my mind on the plane headed to Chicago, Jon Lester versus Kyle Hendricks wasn't meant to be. They won it last year. I'm happy for them. It was a great story. It's 2017. I was packed, ready to go to Chicago. It's like a weird energy when your mind goes somewhere and then it stops and you're like... It's like when you think you're going to get pizza but",
            "start": 1981.52
        },
        {
            "text": "to Chicago. It's like a weird energy when your mind goes somewhere and then it stops and you're like... It's like when you think you're going to Chicago and you think you're going to get pizza, but then you don't. Shut up. It's not funny. Because your friends go without you and your friends get the pizza. Is that a Kevin Burkhardt and I sense? You guys are fucked up. That was so rude. So yeah, hey, I'm happy for all the Cubs fans. That was a pretty remarkable year. Yes, it was exactly like that. Yeah, it was like that. But then 2017, you're bringing it. We're coming. I'm excited. We're about to get odd. Odd years. We're getting odd. Let's get odd, baby. I like getting odd. Fully Wolf says, today's my birthday, so I want to say thanks for all the amazing content over the years. Janssen's Day 1. Here's a clip. We're not going to do it. We have too many clips today. Happy Bur- just kidding. If we did, somehow it would never end. Happy birthday. Jericho says, God damn, 25 months. Shout out",
            "start": 2033.48
        },
        {
            "text": "Here's a clip. We're not going to do it. We have too many clips today. Happy Birthday. Jericho says, God damn, 25 months. Shout out to all the Kinda Funny best friends that are always doing such great work. Thank you, Kinda Funny guys, too. Shout out. Bongo's, Bauble Buddies, best combo. DJ Kento says, Hunter, black on black, Kinda Funny cap, I'm a hat addict. Here's the proof. There's a picture black on black Kinda Funny. Oh, yeah! There we go! We got a lot of Tim doesn't know This is the most legit hat and that's um, that's how I say legit for some. Sorry. I'm looking at your computer strings I can't see over there. It's tough. Oh, yeah, so I can't really where is the You're so busy. This is happy No, that's a lot of the chat I don't know. Look at you. Where is oh, I thought I thought he sent this picture of his hats It's like Kinda Funny black on black really political though. He doesn't have one. He wants one.",
            "start": 2081.24
        },
        {
            "text": "chat I don't know. Look at you. Where is oh, I thought I thought he sent this picture of his hats It's like Kinda Funny black on black really political though. He doesn't have one. He wants one. Oh, yeah, this was No, these are still sold. You can still get it KindaFunny.com slash store. Oh, yeah Yeah, this one. It's still there. It's just buried something you have to get this hack because it's the coolest one I mean, it's pretty cool. You know, we should make a black on black though, like oh, that would be super black Black where this is black. Yeah, like thicker in black though. No, no, no a little bit of blue pop is perfect I mean you just don't want the blue bill. Yeah, you do though You really do and you want the blue little snapback thingy and I mean, I'm sorry I'm okay with a blue snapback thingy with a black bill in the blue right there. I like that blue pop Yeah, if you put the black that's weird. I Don't know. Maybe I just don't What a cute face that smile that",
            "start": 2129.84
        },
        {
            "text": "a blue snapback thingy with a black brim in the blue right there. I like that blue pop Yeah, if you put the black that's weird. I Don't know. Maybe I just don't What a cute face that smile that I can see You could be that guy Just like I need some glasses. Oh man. Yeah. Why is he wearing glasses? Oh, he wears glasses. Yeah Man all right, ah even better shot right there. I mean I make that face a lot Man I don't understand what any of this stuff means. Oh, wait, it's me. Wait, wait, come back. No, no, that was my What were we just on Okay, and then give panda back so Mickey Moose Club says a bunch of gibberish. She says hunter. You're my favorite player not named Mookie Betts Mookie Blaylock That's what it is Okay, please convince evidence to trade you to Boston in exchange. You guys can have panda back. Keep running funny broseph Thank you what I don't get that I just run funny oh Everything I do is a little awkward. Oh weird golden cavities Tim",
            "start": 2170.72
        },
        {
            "text": "Boston in exchange. You guys can have Panda back. Keep running funny broseph Thank you what I don't get that I just run funny oh Everything I do is a little awkward. Oh weird golden cavities Tim your bobblehead should twerk it for a third I like it. Imagine Kevin Tickle me Kevin Bongo Twerker. I think you should let I only do it for charity only for charity, you know, what kind of funny life? Oh, maybe I'll just tickle charity. No Like Broke the table on her house. I didn't bring it down and it's like it's such a happy laugh and jollies Like over the top you like no way that's real and it's real it's really real. Yeah. Yeah. All right Maybe Jesus for Hunter. Have you ever done a nerdy celebration? The only time I remember a professional athlete nerding out was Travis Kelce doing the Donkey Kong punch after scoring a touchdown. What? Is there no there's a link. Can we see that? Or is that what does what do you consider a nerdy celebration? I do all sorts of nerdy celebrations Oh, it's",
            "start": 2237.04
        },
        {
            "text": "Donkey Kong punch after scoring a touchdown. What? Is there no there's a link. Can we see that? Or is that what does what do you consider a nerdy celebration? I do all sorts of nerdy celebrations Oh, it's five definitely did not know that This is a Donkey Kong punch in the Donkey Kong punch just a punch in general if he does the like That's gonna be awesome That was a fully charged any claim not to be Donkey Kong's punch I'm a huge Smash Bros fan that looked like vicious There you go. There you go. You're damn good at smash Yes in here, but the music was playing in the background. Oh, yeah That's good. That's good Yeah, I love Smash Bros. I Don't know we did the yes movement We do all sorts of different Mortal Kombat themed stuff, you know One home run that you did it you kind of like Mega Man sliding home I don't know that wasn't a home run That was just that was just like I was on second someone hit a single and it was like I like God I got someone in slid and it looked like the Mega Man",
            "start": 2303.08
        },
        {
            "text": "sliding home I don't know that wasn't a home run That was just that was just like I was on second someone hit a single and it was like I like God I got someone in slid and it looked like the Mega Man slide kick, you know, that's awesome That was pretty cool Axis 0 1 3 1 9 8 says hey everyone. I turned 19 today as you can tell by my username Here's my birthday tax fun fact. Today's also the day that Greg got that fateful email from Jeremy Dunham So well, Greg's been covering video games for 10 years as of today a decade a break a Ten years of Greg covering told me that we celebrate Tim if we had set up the balloons drop that I originally pitched Right now We should do that for something I don't know Kinda Funny Honestly, we should do that every day for no reason Have so many balloons still no, it's true. We do have a lot of balloons with the logo on it No, Nick is yeah, Nick did not like the balloon job How can he not like that? I don't believe a lot of work requires two people",
            "start": 2357.48
        },
        {
            "text": "no, it's true. We do have a lot of balloons with the logo on it No, Nick is yeah, Nick did not like the balloon job How can he not like that? I don't believe a lot of work. It requires two people to fill up balloons all day Oh, well, then I got two people mean cool Greg why can't there be worthless balloons? Yes. That's a good point They're expensive And he just comes in and takes that no walks out All right Mr. Yas man 300 said here's a video for the fun clip section Kevin if you can screen it and see if it's worth it Okay, cool Lance. Oh you want to watch it now? Okay, cool Lance taken heart says start of this video. Hey Hunter and Lexi I grew up in the same town as Madison Bumgarner Hickory North Carolina any good stories about Madison Thanks for coming on the show Tim and Kevin see all kind of funny live three. We'll see you Lance God I have so many good Madison stories. He's I don't I Don't know where I want to begin. You know, yeah, he does one. What's give a hundred and forty",
            "start": 2423.64
        },
        {
            "text": "Kinda Funny live three. We'll see you Lance. I have so many good Madison Bumgarner stories. He's I don't I Don't know where I want to begin. You know, yeah, he does one. What's give a hundred and forty characters or less What's your Twitter story? I don't know. I I feel like a lot of his I can't really share in public, you know He's a good guy's Actually, here's a good story Madison Bumgarner one year after spring training like you have all your boxes get shipped in and he was our opening day starter because he's our ace and I had like a whole bunch of boxes and I was like putting them on to whatever my car and Madison just like runs over picks up like starts just carrying all my boxes loading them for me Like out of nowhere and I'm just like what the heck hey, you're pitching tomorrow Like you don't need to pick up my boxes and he's like, oh, it's no problem. It's no, you know, just just a good guy It's just like he's a country Hard working like the commercials you see is really what he",
            "start": 2477.36
        },
        {
            "text": "don't need to pick up my boxes and he's like, oh, it's no problem. It's no, you know, just just a good guy It's just like he's a country Hard working like the commercials you see is really what he is. He doesn't watch TV. He's like a real-life cowboy Yeah, he fixed a broken-down bus He actually fixes everything like if there's a problem with anything he's coming He there's a problem with anything like there was one time the refrigerator door wouldn't shut he'll get like down and like he'll like Investigate everything and like figure out what it is one time they This is kind of this is a good story that I can share They tried to lock us out of the batting cage because I thought we were hitting too much and they wanted us to not hit And some of the guys wanted to hit so bum. He's like the strongest most flexible guy We have by far and bums like I'll fix it for you and he comes down and he's just Shoulders and breaks the door down I Just he'll fix anything man, but I'm on the plane",
            "start": 2524.18
        },
        {
            "text": "\"Strongest most flexible guy we have by far, and then guys like I'll fix it for you, and he comes down and he's just shoulders and breaks the door down. I just he'll fix anything man, but I'm on the plane, he just went to push the chair up and it like broke. Like he just went to like just push it up like you can just push him up and it just broke. Well, he was not just doing that what to have that next tip from Snead. Oh, I like that name a lot. So cool to see Hunter here, I used to watch him in Single-A baseball. He played with the Lexington Legends with Ben Zobrist, yeah, now they both have rings so awesome. Yeah, yes, we both have two rings. From Zob got a second one. He went back-to-back to Chicago there we go. And he was MVP. He's got a World Series MVP. We were both on the same team in Low-A pretty cool. Beat officer says great to have Lexi and Hunter on the show, Hunter with more invited spring training this year? Are you going to be best friends again? Of course. I enjoyed the SCS gifts\"",
            "start": 2563.0
        },
        {
            "text": "cool Beat officer says great to have LetsGetLexi and Hunter on the show Hunter with more invited spring training this year Are you going to be best friends again? Of course. I enjoyed the SFGiants gifts and shtick go Giants World Series 17. Yes. I mean we've been best friends evenly left. I've just I've been like Half of myself, you know because when you miss someone you love so much it's like He's my bromance we need we need a couple LetsGetLexi questions here. Is there any like any guys throw some LetsGetLexi questions out here? I'm just reading going through because we Gonna watch you play my Marlins in July, even though I'm cheering for my home team Cheering yell kinda when you're up to bat kinda. All right. Why 1 5 4 7 says day 1 subscribing on twitch So excited her LetsGetLexi. What's the best sandwich? Turkey bacon ranch. I Like crispy chicken Spleen stopper says hey Hunter massive Giants fan from Columbus, Ohio headed out there for fan fest next week I know you're a classic games fan. But what games are you",
            "start": 2620.0
        },
        {
            "text": "Ranch. I Like crispy chicken Spleen stopper says hey Hunter massive Giants fan from Columbus, Ohio headed out there for FanFest next week. I know you're a classic games fan, but what games are you playing lately? #HunterBongos Kevin at Kinda Funny Life! Oh, if you see Kevin and you know him through Kinda Funny and he doesn't know you, just tickle him – yeah, drive-by tickling's so bad. It comes up like \"no school\" that's just like Kevin. I think you would secretly kind of love that though. All right, even a little bit. What games have you been playing? Oh man, I've been playing Magic: The Gathering, like the new way through the whole set. I've been loving it – it's so much fun! It's bad because once a new set comes out, I get so excited that I can't sleep. I have like adrenaline going. So we're calling tips no more, no more tips for the day. Kevin, can you pull up the new story about Magic: The Gathering? Yeah, this is for",
            "start": 2668.84
        },
        {
            "text": "I like can't sleep. I have like adrenaline going So we're calling tips no more no more tips for the day Kevin, can you Can you pull up the the new story about Magic: The Gathering yeah This is for you. I know it's bad Alexis. I'm sorry. I like it so much. It's hard to not play So this is from over a Kotaku Fans organized a Magic: The Gathering tournament that only allows cards from 1996 So it's like the good old days Cards so it's like oh we're organizing a party that you would love but you don't have the equipment to come So that's available Arabian Nights and Legends sets and there's a ban list with all the stuff So how into the weeds are you with all this stuff? Well, I have a really funny story about this. Sorry Don't not to go for it. I mean so when he was younger his parents made him throw out all his Magic: The Gathering cards they thought it was evil and Hunter has Kept that in his heart all these years. He still reminds his mom to this day. Remember when you made me throw out",
            "start": 2736.56
        },
        {
            "text": "\"Throw out all his Magic: The Gathering cards. They thought it was evil, and Hunter has kept that in his heart all these years. He still reminds his mom to this day. Remember when you made me throw out all my? She also they also made me throw away my Nintendo games and my Magic cards. Yeah, my games are evil; no magic was evil. Yeah, I couldn't listen to any like Sorry, yeah. She's cool about it now. It was just a guilty no, I just told her one time Good. I told her one time I was like, 'And those were so cool.' I wish I could just see him again. You know what? Maybe there was a reason I needed to get rid of them; it was supposed to happen. Yeah, but yeah, well, so what was the question in there? So I'm more into the new stuff like what I'd play is draft and sealed, I guess it's called limited, but anyway. Because I don't know the old cards; I don't have access to him because I didn't...I just started up like last year about in spring training, I got started, so from then on.\"",
            "start": 2789.98
        },
        {
            "text": "called like limited but anyway Because I don't know the old cards I don't have access to him because I didn't I just started up like last year about in spring training I got started so from it's like Basically Shadows over Innistrad on I know really well I played a little bit of Return to Ravnica and Gatecrash or Gatewatch Our tables were the Magic: The Gathering sets. Oh really? Yeah, that was the name of the time. I don't know Yes People that came up to me and was like are you guys referred to as magicians? So it's the Ministry of Magic it's like an underground lingo and like It's like Harry Potter It's like there's like a world of magic going on that you don't know about I mean they immediately Run into each other like if you know magic so like everyone that was in the know came up to me was like Your table names so awesome. I was like, what are you doing later? Let's play What do they when you bring your cards, what do you say? Oh, are you strapped? Are",
            "start": 2847.12
        },
        {
            "text": "was in the know came up to me was like \"Your table names so awesome.\" I was like, what are you doing later? Let's play What do they when you bring your cards, what do you say? Oh, are you strapped? Are you not strapped that always strap when I hit the club? So that's like code for like a magician is like hey, I'm strapped right now means you got your stuff So you're ready to like me something different in other locations Exactly. It could mean something really bad. What's funny is like one of my buddy David who's like he's like OG Like he's the one who got me into magic and he had a friend coming in town I thought maybe he was a magic player. He was an ex football player So when he came I was thinking that we were gonna play magic and asked if he was strapped and it was he thought the other thing Yeah, I really happened Phil that's awesome And anyway, the other one is like we're always going to play poker cuz like you can't let people know how big a geek you are But I've kind of messed",
            "start": 2899.68
        },
        {
            "text": "thing Yeah, I really happened Phil that's awesome And anyway, the other one is like we're always going to play poker cuz like you can't let people know how big a geek you are But I've kind of messed that up because I just tell people And I embarrass all my friends who care about what other people think cuz I really don't care what anyone thinks I'm like Magic, let's do this like bull and they're like they all get kind of quiet and they're like, hey We don't really talk about that around I was I was too young for magic. So I never got into it like Pokémon was kind of my Introduction to the cards back. I mean I didn't play I'm gonna just collected But then when Yu-Gi-Oh became a thing I did play you feel for a lot. Did you like you know, I loved you Yeah, you all my god. There's a new app right now Because he loves cards but it's I don't know if I want to send y'all down that rabbit. Yeah No, that's I think it's too dark That's that's a lot a lot to handle it's all know so the next news",
            "start": 2945.54
        },
        {
            "text": "now Because he loves cards but it's I don't know if I want to send y'all down that rabbit hole. Yeah No, that's I think it's too dark That's that's a lot a lot to handle it's all known so the next news story I want to kind of just go through it quickly last night was the 30th anniversary of Final Fantasy So Square held an event and it was the most Square Enix event of all time If you thought the Nintendo conference was bad a couple weeks ago. Wow. Wow. This was Night so there was no balloon drop. No. Oh in San Francisco. There was a real live Zelda thing, which is super cool. Yeah We had to prep for Australia. So yeah. Yeah But Final Fantasy 7 all they showed was some new key art. This game's not coming out anytime soon We're looking at probably 2020 if even the art looks nice. We just have a Final Fantasy come out though. I'm gonna see 15 Yeah, but the Final Fantasy 7 remake Oh, it's a real thing that game took its time It's a whole thing. It's a whole thing. But next next part of this You might be excited",
            "start": 2991.74
        },
        {
            "text": "Fantasy come out though. I'm gonna see 15 Yeah, but the Final Fantasy VII remake Oh, it's a real that game took its a whole thing. It's a whole thing. But next next part of this You might be excited for Final Fantasy XII remaster finally got a release date. It is July 11th on the PlayStation 4 Fall Fantasy not my favorite Final Fantasy, but I know a lot of you out there. Love it It's IGN's number one Fall Fantasy of all time. What are they smoking? They're crazy, but cool. That's great Then moving on a little something for me being a nerd there's some weird Power Ranger crossover thing It's not official but it's a DLC for Final Fantasy XV where you get to wear exosuits that make them look like the new Power Rangers All right I'm so excited for it. It's gonna be atrocious. But I mean, you know what? What I'm ready bring you back to the Power Rangers I mean, I never left. I don't need the power is to be brought back. You know, I've always been there I've always known but they're awesome this movie",
            "start": 3042.52
        },
        {
            "text": "I'm ready to bring you back to the Power Rangers. I mean, I never left. I don't need the power is to be brought back. You know, I've always been there; I've always known but they're awesome this movie Got some issues Whatever I'm excited about I was for it. I didn't watch the Power Rangers. Unfortunately, I'm a little bit older than you guys So like when it was coming into coolness, I was like the kid that was like I'm too old. Yeah Good so was I Wish I wouldn't have been too cool. No, I missed out. It's never never never too late. It's probably too late now, but So I get the Power Rangers this is a little something for Lexi They don't give us a new trailer for fun as you said and they don't talk about any other stuff But they did announce a Final Fantasy wine set for only nine hundred and fifty dollars. That's it Why I lose these layers so fancy like they have the weird with the crystals and out here some Final Fantasy crystal cups I guess so, I don't know and then some really expensive",
            "start": 3097.68
        },
        {
            "text": "dollars. That's it Why I lose these layers so fancy like they have the weird with the crystals and out here some Final Fantasy Crystal Cups, I guess so, I don't know and then some really expensive wine Something weird on the bottom of your $950 for the nice one and then there's a cheaper one that I didn't see what the price was but it looks it's like alright cool So They're trying to target the the Giants out there trying to get them into Final Fantasy. So so there's that Next up this is about you you get your own news story You guys I'm gonna give both of you credit. Yeah, this is a lot of Lexi's creativity So Hunter was nominated for a Shorty Award, which is kind of the awards of the Internet For social media and stuff which you do a lot of you guys are kind of a little team teamwork make the dream work She's a social media superstar So we team up with you thank you, but if somebody probably put a link in the chat. That'd be great. Everybody should go vote for this",
            "start": 3144.32
        },
        {
            "text": "teamwork makes the dream work She's a social media superstar So we team up with you thank you, but if somebody probably Zger Put a link in the chat. That'd be great. Everybody should go vote for this would be super cool if they won I mean look at that picture. It would be super cool It would it would so if we let's make that let's make that happen It's been the Kinda Funny crew is I mean a part of it because I'll take credit I'll tell y'all teach Lexi a lot of stuff Like when y'all win awards I win awards Yeah, we're kind yeah, I feel the award there you go, there you go you guys there you go You can go vote for him And if you needed a reason to vote for him and to see why they're so good on social media check out their Halloween costume from last year Which is utterly fantastic Look at you My god Magazine articles that were like, you know, she looks she's a convincing Pedro and also I'm not sure how I feel about that. But also this picture got more likes than our wedding photo",
            "start": 3199.26
        },
        {
            "text": "at you My god Magazine articles that were like, you know, she looks she's a convincing Pedro and also I'm not sure how I feel about that. But also this picture got more likes than our wedding photo Nobody cares about real love. I love it. No, that's so funny I got to tell you a story about Let'sGetLexi! and her torturing of me when they put the mustache on her and it was like this real looking mustache She was like, yeah, she was like a kisser. She's like you gotta come give me a kiss We all see at first I had to walk away I was like I gotta go get something bathroom and But I had to like build up the courage. I had to go in and kiss this mustache Now you know how I felt because of your beard during this season Yeah, but it's different because it's just different because guys have beards You know solid point. There's a solid point, you know and people there's people out there that love guys I mean you matter what you are and there's people out there that love girls and yeah, I Don't really",
            "start": 3256.62
        },
        {
            "text": "solid point. There's a solid point, you know and people there's people out there that love guys I mean you matter what you are and there's people out there that love girls and yeah, I Don't really anyway. I kissed her and it was cool All right You're familiar with the Kinda Funny Morning Show, you know that every day we give away a video game to one lucky winner All you gotta do is be in the chat or be a subscriber on Twitch or Support on Patreon of Kinda Funny or Kinda Funny Games. You have four chances to win or tickle Kevin in the streets No Five ways to win badly for you The game we're giving away today is Shin Megami Tensei IV on the Nintendo 3DS and the winner is Where are they from? Twitch Why are you cold-facing the clap? That was awesome. Oh, that's all you do. I loved it. It's what you do. It's what you do so Let me let's see what's going on. I don't even remember what I put in here We can skip what video games they win by the way, shouldn't the Shin Megami Tensei IV be on",
            "start": 3315.34
        },
        {
            "text": "It's what you do. It's what you do so Let me let's see what's going on. I don't even remember what I put in here We can skip what video games they win by the way, shouldn't the 3DS eShop say 4 on the 3DS It's an RPG. Hell yeah, very Japanese Cool What are you talking about? Yeah, like I don't win like when I do like raffles. Oh, yeah, I won one but I mean like raffles No, I don't enter enough for you, so we're gonna start entering them Yeah, didn't you win a pair of rollerblades when you were younger rollerblader - the theme of the show So I'm getting a rollerblade. This was a I guess my mom had this whole idea It was like one summer and she's like we're gonna sign up for every contest you can it's free You know, we didn't have that much when I was younger and so for like two days or three days straight We just filled out all these like raffles or gift certificates or I don't know where we got them but it was like 48 hours of work and It was like to win all these like prizes and",
            "start": 3387.98
        },
        {
            "text": "three days straight We just filled out all these like raffles or gift certificates or I don't know where we got them but it was like 48 hours of work and It was like to win all these like prizes and cruises and money, you know, you get all those things in the mail in the 90s I guess we thought these were like really cool. We won one thing. There you go. 48 hours of work We won a pair of inline skates Harder better faster skate harder Man I mean I used to you did I used to have time to win stuff. Yeah now I don't have time to win I've never won anything my friend Jessica J. Baby. She wins all the time. She went to the Beyoncé concert We went together and then she won Beyoncé tickets for the next weekend. Wow. It's too much Beyoncé to handle what don't say that I don't know. I don't know if I could there's so much Tim. You sound dumb Such like I would need like a resting period, you know, no to like take it all in. Oh",
            "start": 3440.22
        },
        {
            "text": "Beyoncé to handle what don't say that I don't know. I don't know if I could there's so much Tim. You sound dumb Such like I would need like a resting period, you know, no to like take it all in. Oh, man I don't know much of her that you need to take you need to go twice to like it experience at all of her Yeah, no, I get it. I get it. Let's go to the chat Let's see. What's up? You know the new stories, yeah, we'll save the fun clips for for another day this one counts as a fun clip What is this one being the Beast? Yeah, I don't want to risk it right now. There's no reason No, it's not what have you never heard of Dr. Pimple Popper? Let's not Don't tell them about All these people going to watch it and it's horrible for all no, it's amazing. No, it's not it is fun Alright the chat. Alright, you know better Mark says I want to Wii U from IGN on the on the free shit program They used to do. Oh my god. He said that was the best show Shout out to Chris Carle that was funny as hell That show it",
            "start": 3490.92
        },
        {
            "text": "you know better mark says i want to wii u from ign on the on the free shit program They used to do. Oh my god. He shit was the best show Shout to Chris Carle that was funny as hell That show it sounds fun free. It was just free shit. That's all it is. Just give things away Yeah, we should do that. We clean out I should have a free shit day It's just such a hassle. Yeah, we do give away streams every once in a while. But yeah, well, no i'm doing these so we're gonna be giving one of these away at some point It'll be fun and it hadn't stopped dancing. That's for sure Don't stop see what questions you got cue up your questions comments and concerns Chris Chan 97 says Tim hosted Nintendo show with Kevin and Nick. I don't know how Insightful that would be but maybe maybe one day The kiddo too says dude, what's up with girls and pimples y'all gross girls love popping pimples. It's so good Do you not like popping pimples? No, nobody like no, i don't think not yet. I don't want to know about",
            "start": 3549.2
        },
        {
            "text": "Says dude, what's up with girls and pimples? Y'all are gross. Girls love popping pimples. It's so good. Do you not like popping pimples? No, nobody likes it. I don't think not yet. I don't want to know about that. Yeah, I don't know Paula doesn't like to pop zits. No. My best friend really enjoys doing it though. Oh, I love it. Yeah, there's some people who just freak out over Dr. Pimple Popper. That's what she covers. Hey, people are like the chat is real divided about Dr. Pimple Popper. People are either really into popping pimples or they're really grossed out. Yeah, that's not a topic we need to bring up right now. Maybe it is. Smile on her face. She just watched people popping pimples for hours. Yeah, she doesn't like that. It makes it sound like a thing. Way too clear it is a thing because she'll watch videos of Dr. Pimple Popper for hours.",
            "start": 3610.64
        },
        {
            "text": "like a thing Way too clear it is a thing because she'll watch My god over like He like a YouTube guy like woman who yes, she's she's like, I don't know these videotape yeah like You can look at it yourself if you need to see it like that sort of thing, it's so good Dark Angel 10 10 has a really pandering question here Hunter. What was the better feeling winning your first ring or getting married? Your face while you were getting married I've never seen someone so happy Yeah, you guys his wedding was like it was utterly ridiculous it was baller as fuck as the kids would say And it was also like a triathlon. It just never ended It was like 13 hours long. Yeah, but I need to know is there video footage of this wedding? Yeah, will it ever be released? Yeah, well, I ever get to see your sister's rap again Maybe her sister that was crazy. She wrote a rap that lasted. I don't know 20 minutes I think solid 10 minutes Like you would have to put it if you were to record it on a cassette",
            "start": 3670.5
        },
        {
            "text": "rap again Maybe her sister that was crazy. She wrote a rap that lasted 20 minutes, I think solid 10 minutes Like you would have to put it if you were to record it on a cassette, you'd have to take it out, turn it back in Never been so in love with living a moment as I was Acoustics weren't so good. So I really didn't know what she was saying a lot of the time So you just awkwardly said a lot of it is a burn like there's some burn. We heard it perfectly Yeah Like look at me when it was like a good punch line so I'd be like That is you in a nutshell, just like I don't know what's happening I'm gonna make it happen Ever make her feel bad because she's really putting herself out there with that rap That was like gusto. I'm not mad at her for that. I really need to go though You have to make this happen for me. Also, am I ever gonna get my slow-mo videos? Yeah, I'm sending them down already. They were not Oh, you know, really funny and slow-mo videos, Alex. Oh, yeah Do",
            "start": 3737.7
        },
        {
            "text": "though you have to make this happen for me. Also. Am I ever gonna get my slow-mo videos? Yeah, I'm sent down already. They were not. Oh, you know really funny and slow-mo videos you Alexis. Oh, yeah Do you look at that we got nasty Should have gotten them by now. There was one that I did that I was so proud of I might not see it What'd you do wait was it just I just stood there was coming around was really boring Greg came I Mean funny that was really funny. It was super clever. You are you are really funny. All of you guys were super fun Yeah, and all those really funny. Yeah hers are really funny See, yeah, they did slow-mo of like killing each other and like, I don't know it was good. Yeah Yeah, but I'm glad to hear that guys had a good time. Yeah, let's see. What do we got going here? Um, I John I'll sack 38 says my wife's obsessed with popping pimples. I think it might be a girl thing. You're right Well, it's like there's some people like this guy's on our team that will sit in the",
            "start": 3805.5
        },
        {
            "text": "I John I'll say 38 says my wife's obsessed with popping pimples. I think it might be a girl thing. You're right, well, it's like there's some people like this guy on our team that will sit in the training room and watch it the whole time really DJ Kendo says Hunter. What's your favorite beer from the Russian River Brewery? I don't know if I know it. Yeah, that's really specific. I don't usually drink beer but when I do typically a Mexican beer Oh Corona does ekkies Pacifico Corona is actually pretty I'm not a beer person but Corona with a lime your brother got me on that And that's pretty refreshing Mexican beer with lime is a little lime in the coconut Yes, you just you just dropped the same same line, you know most interesting man in the world. Oh yeah You join let's see So yeah now a lot of people so they're brought up they're asking about the wedding video stuff Like what? What do you think you're gonna put on your channel youtube.com slash letsgetlexi Thank you plug",
            "start": 3861.26
        },
        {
            "text": "now a lot of people so they're brought up they're asking about the wedding video stuff Like what? What do you think you're gonna put on your channel youtube.com slash Let's Get Lexi. Thank you plug Yeah, well, I'm not so we haven't we've gotten invited to be featured in a magazine So naturally is Nintendo Power. They're bringing it back just for us. Yeah, maybe um Naturally as a girl like you're super excited about that Right all this hard work that you put into planning and kind of visualizing So I we have a really big spread in one of the magazines that I'm really excited about So we have to wait till that goes out So and then I'll probably put up our our video highlight cuz I don't think anyone wants to sit through our whole thing Yeah, 13 hours. Yeah We live that ten hours you just want to see the rap So bad I saw I saw the written lyrics of the rap So then I was like, okay. This is what she was saying. Yeah. Oh man I just I need I need to say again. Also you did your little",
            "start": 3914.74
        },
        {
            "text": "want to see the rap So bad I saw I saw the written lyrics of the rap So then I was like, okay. This is what she was saying. Yeah. Oh man I just I need I need to say again. Also you did your little dance at the end to Justin Bieber Yeah, that was fun. I like that a lot No in my head we can just get a clip of that in my head It was like epic and awesome and then I watched it and I was like, I'm not sure how I feel about it It was still pretty cool. It was still pretty cool. It was it was late. It was like 11 o'clock after like Yeah, you you I mean that was that was probably the last moment like just when you think that there isn't any one more thing That was like the seventh more thing and you come out with your boys. You just start fucking breaking it down I'm like, yeah Wait, there was one more thing after that. Did you stay till the very very not the very very I'm not a Taylor Dane concert Yeah, can we please play her music video of that song we know what Taylor Dane is she was at",
            "start": 3960.18
        },
        {
            "text": "one more thing after that. Did you stay till the very very not the very very I'm not a Taylor Dane concert Yeah, can we please play her music video of that song we know what Taylor Dayne is she was at the way She's dating my only one. No, please she ended it with a concert she sang and it went it got like like it was kind of like everyone's tired and I was like drained and she started like the Who was Donahue the really drunk guy that fell did push-ups? He Finally got the DJ to play it at the end and she grabbed the mic and started singing So this was how we ended our wedding was with a concert from her and it was like everyone was like jumping and like going Bananas, there we go fun. Yeah. Sorry you missed it. Oh, I can't hear it Taylor Dayne, this is such a Nick thing Oh This is awesome, yes, she and she killed it Mike killed it. Wait, is this contemporary? Okay, I thought I thought they were doing it like style like that was like that's awesome Yeah, are you Tony you mr. Konsair I Was",
            "start": 4009.48
        },
        {
            "text": "She and she killed it Mike killed it. Wait, is this contemporary? Okay, I thought I thought they were doing it like style like that was like that's awesome Yeah, are you Tony you Mr. Konsair I Was like why did we stop it? I mean I didn't get to the course. I gotta hear the course cuz we can't put it on YouTube then There we go, let's give you some only chat So we have like a small video and it was as you switch to sub only And rolling when she's goes on and we're like in the corner Oh, that's awesome, that's super cool the whole place was jumping Yeah, we need a wrap up Wait, you put more fun clips of what? There's some good ones All right, I saw we're gonna have to save that for when we make our valley return one day Here's the issue full disclosure for everybody and you'll hear about this later A travesty happened here Kinda Funny yesterday something that's never happened to us before we lost footage of a show. We recorded No, it's the first time. It's not Kinda Funny. How did",
            "start": 4065.12
        },
        {
            "text": "later A travesty happened here kind of funny yesterday something that's never happened to us before we lost footage of a show. We recorded No, it's the first time. It's not Kinda Funny. How did y'all in history Kinda Funny? We've never lost a show It was so Pete Hines from Bethesda VP of Marketing and PR at Bethesda. We recorded one of the best casts we've ever done and We lost the footage entirely. So we have totally we have the footage There's no yes, so he's coming back. Yes. We're gonna do it again Great, you do a one-on-one but because of that we have to do a GoG today and a GameCast So our schedule is kind of tight. Yeah, so that's why we're Like voiceover it So good, but yeah, I was like such a demoralizing moment last night when we realized it was there It was like this is the first time this has happened like after hundreds of episodes of our podcast There's a single popping sound. Yes, and then nothing else So from now on we're recording is not for everybody saying damn it",
            "start": 4137.44
        },
        {
            "text": "Time this has happened like after hundreds of episodes of our podcast There's a single popping sound. Yes, and then nothing else So from now on we're recording isn't for everybody saying damn it Kevin Mann mauve and Mark says it's more tickles Is Lexi gonna be on GOG not not today. I'm sure you'll return at some point No We've never been on together. No, you replaced me for an episode at some point I'm looking when I'm back for the season. I'm looking to just set up shop in the back They don't know it yet, but they're just gonna come to work studio be Frankie 24 by says hi, honey. Oh god moving things are moving. I'm a huge fan I Was at your first game as a Philly miss having you on the team but happy for all your success Thank you. There you go. That is super cool. Danny Jr 97 says you guys ever want to go to Sundance Film Festival I went to my party with the cast of Swiss Army Man so much fun. You guys should go. Yeah, we'll be there one day One day just go make a movie And we're gonna",
            "start": 4195.6
        },
        {
            "text": "ever want to go to Sundance Film Festival? I went to my party with the cast of Sydney Hall - so much fun. You guys should go. Yeah, we'll be there one day. One day just go make a movie. And we're gonna force someone to give us an award. Give us an award. That's not nice. And it's so nice to tickle people. Liquid Shake 23 says Hunter. Will we see you in Season 3 of Fuller House? If you didn't know, he made a special guest star appearance in the first season of Fuller House. I think I... I think I don't... I think I ruined my chances with Fuller house. Because I was... they asked me to come back for the finale. But we had a vacation plan that we didn't... we had so I don't think I made it back. I Think they've already filmed it right? Oh, I'm none of season 2 oh About soon too. So we met like season 1 they were gonna try to write me into the finale which was a complete honor. I just... I have other like a full-time job You got to do and we had a vacation which is our only time we can vacation Mm-hmm, so I",
            "start": 4265.02
        },
        {
            "text": "gonna try to write me into the finale which was a complete honor I just I'm I have other like a full-time job You got to do and we had a vacation which is our only time we can vacation Mm-hmm, so I missed the boat and it was super quiet. It was so fun being in it and for House I was like Jeff Franklin hit us up. You never know. Yeah, we'll come back. We'll make it work We're never I mean, I was thinking like your storyline wasn't really wrapped up, you know There's a lot of questions people have been asking like what what what happened afterwards? Yeah, they could there could have been We should get a spin-off series. Yeah, why don't we? I'm down. Let's see Empty House, it'll be about how like after she dumps you you leave and you're sad Yeah, yeah and then you find it starts sad then it becomes it becomes my life with the Kinda Funny guys after being dumped by Stephanie Tanner, I'm definitely down Broke up with me. No, yeah with you guys Caboco wants to know what do you think",
            "start": 4320.5
        },
        {
            "text": "it becomes my life with the Kinda Funny guys after being dumped by Stephanie Tanner, I'm definitely down. Broke up with me. No, yeah, with you guys. Coco wants to know what do you think about Ken Griffey Jr.? I love him. What do you mean? He's awesome. He was like... He's in the cover of MLB The Show this year. Yes. He is on MLB The Show. Oh, Drew Baca wants to know Hunter. Do you dabble in any MLB The Show or is it too much baseball during the season? I'm gonna play, I'm gonna most dabble. I'm gonna dabble. I'm gonna dabble. I'm gonna most likely stream a little bit of it. Yeah, There we go. Eddie 2 to 8 eight says if I yell \"Kinda\" at Hunter at a game will he reply with funny? That would be pretty amazing. Kinda Funny, I don't know if you can hear me, you have to get really loud when you're down there. But I'll try also be awesome because the whole crew... everyone else that doesn't know a symbol like a hand symbol like You're Kind of Funny we need to make one if",
            "start": 4365.78
        },
        {
            "text": "really loud when you're down there But I'll try also be awesome because the whole the job everyone else that doesn't know a symbol like a hand symbol like You're Kinda Funny we need to make one if we don't have one we don't have any that are appropriate There's a hail call and thing This is Kinda Funny no, no, no, it's a bad thing. Can we make a good one? Can we make? Definitely Yeah That's smiley, you know the face Yeah, all right. Well, we're gonna wrap up ladies and gentlemen, this has been the Kinda Funny Morning Show. Thank you Oh my god, of course before we leave We're gonna read all the subs and resubs and their little messages and all that stuff because that's what we do here I Kinda Funny. Yeah, thank you We do a lot of reading of really weird names that are spelled weird but Danger Crusader spelled his name, right? And I appreciate that but then we get to J Boar 8 and that's kind of weird registry error just subscribed sign scratch Silent but deadly 123 Dave Barnett",
            "start": 4411.26
        },
        {
            "text": "but Danger Zone spelled his name, right? And I appreciate that but then we get to J Boeheim and that's kind of weird registry error just subscribed sign Scratch Silent but Deadly 123 Dave Barnett 22. I am stranded Bourbon Werewolf Ambitious Cadet. Oh the Tin Man. Oh, that's just right. That's just right It's one of my son's a legendary fap says go Royals Shit, what happens it's respect baseball fans are all yeah, we respect all baseball fans. I'm not a baseball fan I don't like you The Darkness moments of my life these past couple of years you've brought joy and entertainment back into my life Thank You Drake one one two three three. Yes TRL why you won five four seven I Jericho says oh my god 25 months. Nope already read that before Eddie Luk 46 Mr. Bolton Carl Cardigan Carl Cardigan, that's good name. That is a good cabbie kins cabbie. I've been bitten I've been bitten Steven 2005 says Lexi and pets on the show now. It keeps getting better. Thanks for everything Kinda Funny",
            "start": 4465.82
        },
        {
            "text": "\"That's good name. That is a good cabbie Kinzie Cabs. I've been bitten, I've been bitten Steven 2005 says Lexi and pets on the show now. It keeps getting better. Thanks for everything Kinda Funny Gamers with Gains says love the show today looking forward to seeing the KF panel at PAX East Keep up the great work stay epic Jake James Lugo shout out to you. Jake James Lugo Axis zero one three one nine eight says hey everyone, I turn 19 today and this is a tip not a subscription, I already read it Scott Tremper says you guys really hit a home run with today's episode I liked it, I like Hashtag Tim like you I don't yeah, yeah one sees one just subscribed Ryan Senti says my dude the homie says hashtag let Tim host Read Rising 95 Tyler p8 13 says Hunter you're welcome Philly set you free so you could thrive. Yes true My NSF I appreciate that, Yeah, you're rocking with the right team, I'm enjoying I wouldn't know I wouldn't know the Kinda Funny people if I was still in Philly, It's true.\"",
            "start": 4534.74
        },
        {
            "text": "Thrive. Yes, true. My NSF, I appreciate that. Yeah, you're rocking with the right team. I'm enjoying it wouldn't hurt to know I wouldn't know the Kinda Funny people if I was still in Philly. It's true. It's really true. The nine Fox says one whole year, baby! Sam Huds, Kyle Ren, Jagerty, Carol Kuma says Lexi, Hunter hype - what a bunch of nerds! A little harsh, Lexi and other show being from Chicago... I couldn't help but notice the girl in the Goat wristband you had on your arm last year against the Cubs. Do you have any pregame rituals? Much love to y'all? So actually, the Goat wristbands - it's a long story, but long story short, my spirit animal is a goat. We found a coffee shop called The Little Goat, and there's like a history... It's a little girl on the goat, no, it's just a little goat. There's a little goat coffee shop, and like this is the history of coffee. Is that like monks all goats eating the seed, the cherry seed of which is a coffee? They call it a coffee bean, but it's a seed, and they were getting...",
            "start": 4584.66
        },
        {
            "text": "coffee shop and like this is the history of coffee Is that like monks all goats eating the seed the cherry seed of which is a coffee? They call it a coffee bean, but it's a seed and they were getting real but you know active and that's how they found coffee so We liked it because it was my spirit at origin story Okay, and there's also the curse of the goat thing which guys broken with the Cubs have a curse of the Billy Goat And it's my you know Apparently they wouldn't let a guy in with the goat that he had and they wouldn't let him in and then the Cubs never Won since then until now so they broke the curse, but did they let the goat in this year? They let me in so that's why Got the gun the greatest of all time over here son. All right liquid shake 23. I just read that Sigma blade X says bongo me Kevin will sell like hotcakes. Love you guys. Keep up the good work hashtag. Let him bobble Paul I'm in your eyes. So 21 months think we should move in together yet. No, it's a little too",
            "start": 4638.26
        },
        {
            "text": "Bongo me Kevin will sell like hotcakes. Love you guys. Keep up the good work hashtag. Let him bobble Paul I'm in your eyes. So 21 months think we should move in together yet. No, it's a little too early I'm I'm afraid of commitment there W2 f o 2014 says let Hunter Pence host and a route just subscribed So yeah, there you go Kinda Funny Morning Show another one in the books. Can we do a high five? One two three That worked Cut the feed immediately regretted it when I went for it, but we got it we did get there we don't lady wave You",
            "start": 4683.34
        }
    ]
}