{
    "id": 347,
    "video_id": "h8GtdvzeRh0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Drugs and the Apocalypse - The GameOverGreggy Show Ep. 32",
    "description": "Full Episode Friday! Get it EARLY here! http://gameovergreggy.bandcamp.com\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1405666801,
    "duration": 5867,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to The GameOverGreggy Show I am one of your hosts Greg Miller alongside the producer Nick Scarpino what's up everybody what's up everybody good to see you good to see you seducing me already we got one hair out of place I want to push it in don't pull it though cuz I'm not I don't have a lot of it left you don't have a lot to lose out here I'm not like this guy over here you mean the pure one Tim a lot of hair and then of course the pride of Long Island Colin where you already both you a lot of hair too yeah I do got the Italian you should grow it out again when you used to do that yeah I do remember you're great hair when you grow out yeah I have a beautiful afro uh but I don't think Cher would like that very much whatever you're not married to her yet that's true ladies and gentlemen this is The GameOverGreggy Show every week four sometimes five best friends gather around this table each bringing a random topic of conversation for your",
            "start": 1.1
        },
        {
            "text": "to her yet that's true ladies and gentlemen this is the GameOverGreggy Show every week four sometimes five best friends gather around this table each bringing a random topic of conversation for your amusement if you like that you can get the MP3 uncut unedited over well sometimes is edited over at gameovergreggy.bandcamp.com for $1 each and every Friday if we're not worth that you can go to youtube.com/gameovergreggy Monday through Thursday every Topic's broken out one by one for you until the whole show posts on Friday uh of course buy T-shirts this is the new Team Fat shirt you can get it over at DistrictLines.com that's a sexy shirt great that it's a really good one that's the best one we have I agree you're going to buy this is going to be the first shirt you buy yep I haven't bought King back to this business don't even buy the one with your name on it it doesn't make any sense like I you know I own a piece of this yeah and then we pay The Shirt Company yeah then they give",
            "start": 38.64
        },
        {
            "text": "bought King back to this business don't even buy the one with your name on it it doesn't make any sense like I you know I own a piece of this yeah and then we pay The Shirt Company yeah then they give us the money back it seems like like I should just get the shirt for free I agree with that that'd be nice um yeah we just have a bad negotiator we do he's just not good at what he does over here you looking at the producer Scott Rudi he was doing the funny not SL negotiator no not Slater producer Scott Rudi not producer Scott contact negotiator lawyer liar next thing we need to cover of course this is Portillo everybody knows him everybody look at this bow tie Christine bought pill come your water he is okay can some he is adorable he now has a bow tie you can catch him use sporting in his new BarkBox unboxing Colin grab the toy out of my crotch and hide it from him cuz he's stupid n put it by the goat the goat okay minut I see what you're doing I see what we're doing this",
            "start": 78.72
        },
        {
            "text": "in his new BarkBox unboxing Colin grab the toy out of my crotch and hide it from him cuz he's stupid n put it by the goat The goat okay minut I see what you're doing I see what we're doing this is how we get him to stop squeaking now he will be sad the entire show but **** him he's a dog he'll see it but he won't be able to get it he's stupid you dumb **** we have a lot of housekeeping there's a lot of housekeeping I'm back first yeah that was the first piece of housekeeping you're back you were gone last episode we had to get that Jeff Gerstmann fellow to fill in for you he was good thanks je that yeah Jeff was great yeah uh where were you I was at RTX right we were there to Rooster Teeth but you were like pre RTX right you went there just to like scope stuff out for us yeah I was scoping it out for you guys see how we could infiltrate yeah we did a thing or two yeah we infiltrated great we went to RTX Fourth of July weekend pour me some of that Slim Jim fantastic show thank you",
            "start": 118.36
        },
        {
            "text": "Scoping it out for you guys, see how we could infiltrate... yeah, we did it, thing or two, yeah, we infiltrated. Great, we went to RTX Fourth of July weekend. Pour me some of that Slim Jim fantastic show. Thank you to everyone for coming out is at RTX. I was coming home the first thing I talked about to Colin about it because he was the one gentleman who had to miss it. I was blown away that at the Game Over Greggy panel, everyone talked to us about Game Over Greggy things. It wasn't about IGN; it wasn't really about video games; it wasn't about The Gauntlet that much. There was some of it obviously, but the majority of it was just like everything we do on the show, which was awesome to see how much crossover. Only seven people in that room didn't know we were... like, didn't watch the Game Over Greggy show; randomly stumbled in and were like, \"Who are these people?\" That fat guy? Awesome! I thought I was going to see Colin here. You ever think your head's a cheeseburger man? His eyes rolled out of his head.",
            "start": 156.52
        },
        {
            "text": "show randomly stumbled in and were like who are these people that fat guy awesome I thought I was going to see Colin here you ever think your head a cheeseburger man his eyes rolled out of his head Greg Greg uh enjoy the Henry McKenna Single Barrel bottled in bond uh from our friend Eric Castro Provisions in San Diego this is hand selected for us Barrel 3 421 uh good stuff we have eight more bottles of that and by the way uh so you guys can take them if you want two of the bottles or each you guys going I'll take one home with me tonight but I'll keep one here because I feel like you guys are going to go through it yeah we're destroying these things yeah we're going through this one like Greg and I drink a lot I know and you would too what I know this about you uh you should be you drink quite a bit I do see this yeah for get too far off the topic that's all right though RTX we recorded our entire podcast if you missed it it went up on Sunday link is in the description so go",
            "start": 190.4
        },
        {
            "text": "a lot I do drink quite I see this yeah for get too far off the topic that's all right though RTX we recorded our entire podcast if you missed it it went up on Sunday link is in the description so go click on it it was featuring our good friend Barbara Dunan, Barbara was awesome by the way Bar was amazing the link is in the description thank you we're trying to get better at putting the links in because I I'm not used didn't actually do anything we're slowly adding on tasks for you to do with this show now that was the past Barbara was fantastic yes so thank you so much Barbara and unclean for doing that that being there uh of course she's no stranger to GameOverGreggy.com she was over there on she did a Gregway with us our most successful Gregway of all time she us a couple things she what now she taught us a couple things oh how to draw dicks yeah links in the description you don't need to time code them either just tell me what segment they're in because I'm not I'm not annotating",
            "start": 236.4
        },
        {
            "text": "now she taught us a couple things oh how to draw dicks yeah links in the description you don't need to time code them either just tell me what segment they're in because I'm not I'm not annotating because nobody clicks on annotations I'm just putting the links in the description so is this dick thing a different thing yeah that was there's the Barbara was in the the panel from RTX and then she Drew dicks with me for GameOverGreggy oh yeah I remember that dick video parenthesis intro intro good job good job thank you look you're nailing it you're doing it look at you I'm good um I went to college so that was the past now it's time to talk a little bit about the future ladies and gentlemen if you are listening to this on the Friday of its release the or the Monday of its release or anytime really I guess I my appearance on Geek and Sundry is about to go live I was lucky enough to go over there and play magic with them I played Magic: The Gathering for a show called Spell Slingers it",
            "start": 277.36
        },
        {
            "text": "really, I guess I'm about to go live on Geek and Sundry. I was lucky enough to go over there and play Magic: The Gathering for a show called Spell Slingers. It was fantastic - it's a great time. Thursday, July 17th, I didn't throw cards like that, spell like \"SP\" that Harry Potter sort of... you know? Yeah, just like that. Anyways, July 17th, I pop up there on Geek and Sundry, the new season of Spell Slingers looks like this. Then we're going to put down this guy. I hope you're ready for some clerical work because here comes my human cleric. I'm excited to play him - it seems like he's going to go out and do what I need him to do, which is beat the snot out of Shawn and heal me because clearly I'm going to need it. I like the cleric; he's got a cool outfit going on when he looks so happy right? He's got his arms outstretched with just this chain... handcuffed himself in chain - no, it's for long-distance hugging. Oh okay, perfect - just like my uncle used to do. I'm",
            "start": 318.88
        },
        {
            "text": "when he looks so happy right he's got his arms outstretched with just this chain he handcuffed himself in chain no it it's for longdistance hugging oh okay perfect just like my uncle used to do I'm done with my turn beautiful wow that looks like a fun time that was that looks awesome I'm not going to lie to you jealous that you were a part of that and I was not you should have learned how to play Magic: The Gathering cuz I didn't know how to play what did you do I went there and I played Magic the Gathering with the new cards from have you heard about this I've heard about the game small game from the 90s I used to play well here's the thing before we get any further they have brand new cards for this new the new round of magic you know they release new cards Tim yes you might be aware of Magic: The Gathering cards are a big deal we're giving those away everybody a booster pack yes if you want your chance to win signed booster packs that's exciting you need to comment below on this video okay what what should",
            "start": 364.92
        },
        {
            "text": "are a big deal we're giving those away everybody a booster pack yes if you want your chance to win signed booster packs that's exciting you need to comment below on this video okay what what should they comment Nick if you could sling one thing yeah would you would you sling we'll pick someone we'll pick Greg I'll pick I'll pick a few of you at random I'll respond in the comments you'll need to check back to see if I've responded to your comment I'll do it all on the first day that is Monday that this video goes live if you're listening to the MP3 you have the Inside Edge now to go back there do it it's coming away also and this is another big thing too since you're a GameOverGreggy Show fan you're a fan of all of us on July 17th you need to go to Geek.com watch the show thumbs up it and say something cool about me so they understand I'm a big deal yeah or a deal you're a big deal think they're you sent me and stuff like there you go THS that up a lot we'll say GameOverGreggy sent me",
            "start": 402.2
        },
        {
            "text": "cool about me so they understand I'm a big deal yeah or a deal you're a big deal think they're you sent me and stuff like there you go THS that up a lot we'll say add GameOverGreggy sent me that's a good one keep it simple all right yeah keep it simple talk about goats go over there and say game over you sent me that's all you got to do you make an and go like this you can make a SL comment to goats if you want I wouldn't suggest goat sound like sheep what's a goat goats yell there's that Goat Screaming that's that's that's not remember that first time remember the first time you and I bonded and we watched that cool Taylor Swift video and there was a goat in the middle of it that was not when that was the time you guys bonded guys it's a show you got to go with it like improv people that's improv you want to start again sure another time you and I wear shirtless and we were like pantsless and we were watching that Taylor Swift video yeah those were the days those were awesome",
            "start": 441.92
        },
        {
            "text": "that's improv you want to start again sure another time you and I wear shirtless and we were like pantsless and we were watching that Taylor Swift video yeah those were the days those were awesome that was a good improv that's really good stuff guys we continued the story the way it's supposed to go Mocky not Morti Ry yeah K Mockery yeah Nick yeah why don't you start this week's topic do we want to talk do we want to talk about our awesome yes so as you've noticed on this YouTube channel ladies and gentlemen we have the best intentions but we are super organized we are very much learning as we go so last week man we thought we were moving to the next generation of the GameOverGreggy show Nick engagement Nick always picks a listener topic so now we'll have the listeners vote on which listener topic they want it'll be Dynamite we totally neglected the fact that we put him last in the order which means his topic posts on Thursday and of course the GameOverGreggy show records on",
            "start": 489.56
        },
        {
            "text": "listener topic they want it'll be Dynamite we totally neglected the fact that we put him last in the order which means his topic posts on Thursday and of course The GameOverGreggy Show records on Wednesday so we have no idea what you guys are going to pick yeah there's no way to tell who voted on what so we screwed it up we're going to wait a week on that so please go check out the video on Thursday make sure you watch both of uh you know the annotated videos and you know like the one that you want to be the topic for the next week uh it's all self-explanatory and one of them's 30 seconds one of them is like 900 minutes you'll see that one um meanwhile this week though I'm going to go with another title that was submitted by Twitter so if you again remember guys if you have topics please follow me at Nick Scarpino on Twitter and tweet me your topics for The GameOverGreggy Show uh like Nickol no I can't even say this guy's name but he says hi I have a topic for the show we W know we W know",
            "start": 533.16
        },
        {
            "text": "follow me at Nick Scarpino on Twitter and tweet me your topics for The GameOverGreggy Show uh like Nickol no I can't even say this guy's name but he says hi I have a topic for the show you we W know we W know who you are I'm sorry you know what I read wrong it's Nicholas it's actually Nicholas Baron you can't read your own name it's spelled N-B-A-R-O-N you can spell that one Nick, if you're the only person left alive on the planet describe your first week okay I know the first thing I'm doing remember in the 90s there was the Nickelodeon shopping cart you get to go toys you have five minutes I would do that I would tie myself for 5 minutes I'd do the exact plan I always had in my head go straight to the Legos, get the big Legos in go straight to the video games after that when you sayin' Legos you mean the big block Legos or the big sets of Legos the big sets of Legos he figured out where the toy let him",
            "start": 572.4
        },
        {
            "text": "Legos get the big Legos in go straight to the video games after that when you say \"Legos\" you mean the big block Legos or the big sets of Legos, the big sets of Legos. He figured out where the toy let him try get the $100 pack, yeah, get all those guys in there, go straight over to the video games, grab all the pieces of paper, put it in, do all that stuff, it'd be genius. Why would you need the paper because this is a dream I had. Oh okay and you got to you got to you got to get Pap by the end it buzzes and then they give you all five minutes and then I'd go and you know do it the right way even though I'd have to do a little bit of role playing cuz there's no one to help me trade, yeah like how would you get into the back room to get the video game like unlock the little cabinet there's no one there, yeah I know there's no monsters either right. This is this is just it's over I think it's just it reminds me of that Twilight episode with \"Bures Meredith\" where he's the last man alive.",
            "start": 622.96
        },
        {
            "text": "one there yeah I know there's no monsters either right this is this is just it's over I think it's just it's it reminds me of that Twilight episode with Burgess Meredith where he's the last man alive finally this time finally one of the great I like you said the Twilight Episode I know you meant The Twilight Zone but I instantly thought of Twilight oh that's a foreign left I've been thinking a lot about Twilight lately oh a lot about Twilight uh so you'd go your first instinct would be run to Toys R Us raid Toys R Us yes in five minutes Play why you got all the time got a whole week authenticity all right you're the last person on Earth for one week no you're last person on Earth what was your first week what would you do in the first week okay so what am I do in my first moments yeah like I mean you've got five days of realizing get more noisy you're never going to have human contact again Tim's first instinct is to completely disregard that fact and go straight to a Toys R Us well to get",
            "start": 660.68
        },
        {
            "text": "you've got five days of realizing you're never going to have human contact again Tim's first instinct is to completely disregard that fact and go straight to a Toys \"R\" Us, well, to get some Legos - that's not disregarding much. Sure, get to build Legos for the next week, that's pretty awesome. I mean it's a good pastime, it's one of the best pastimes that would be a good past time in apocalyptic America. I have a question, yeah, a few questions. So we're the last human - is there other threats? Goats, I mean I'm assuming it's like after where there's like giant lions that would eventually well they're in the zoo, yeah but they're going to get try to get out cuz they're hungry, yeah they're going to die, yeah. I don't know, try to get hell no no you're going to let the lions die we saw that in The Last of Us, yeah but that there was something going on there. In this scenario I'm imagining everyone disappears like Rapture pretty much and like I have to imagine The Last of Us infected",
            "start": 702.04
        },
        {
            "text": "of Us yeah but that there was something going on there I in in in this scenario I'm imagining everyone disappears like Rapture pretty much and like I have to Imagine The Last of Us infected people were going back there zookeepers got infected and they were like oh I'm going to save these animals and let them loose that was stupid I how the hell do you get out of a zoo I don't know Zoo it's like there's some timed gate where like a human has to come by every day and turn a key or press a button for Penguins just come out yeah exactly everything just gets out that's not how it works it's a good point okay uh so I mean my assumption is that there's no real imminent threat yeah I think I think you literally just wake up like said and there's not another human being inside it's just it's just yeah life that's it I would just you were just the only person left I would love to just go into people's houses just see what was going on like just we'll just if it was really at the",
            "start": 742.92
        },
        {
            "text": "just yeah life that's it I would just you were just the only person left I would love to just go into people's houses just see what what was going like just we'll just like if it was really at the Rapture and people just disappeared out of nowhere what would you what would be the first thing you do in a person's house would you go through like their bed to table drawers or something or I I would love to just like it one of the most fascinating things to me about Chernobyl which is the place in Russia where the nuclear um also a really good beef jerky Chernobyl really no way there is not a Chernobyl beef jerky there a lot of people when they when they make like the super hot beef jerky they call it Chernobyl that actually awesome I was going to say right they be like 911 beef jerk um not Chernobyl was a long time we don't care about chern not that long ago though in like the '80s but but anyway anyway one of the great things about Chernobyl is that they had to evacuate that place after",
            "start": 780.6
        },
        {
            "text": "was a long time ago, we don't care about Chernobyl not that long ago though, in like the '80s. But anyway, one of the great things about Chernobyl is that they had to evacuate that place after the reactors melted down, and so like people left, like out of nowhere, and people sneak in there all the time and they do guided tours now, whatever. But like people's lives were just left in stasis in their apartments, so like they're set tables, like people were going to sit down for dinner, and they bounced. And you go there 20-30 years later, and that stuff is still yeah, like that stuff's still just there, you know. And like, so if it was really like the Rapture, it would be cool to just see like what people were doing or how things were, yeah. Um, as everything went to **** here's my question for you then, even expanding on this more Colin, we're now we're into The Walking Dead territory, would you start trying to figure out what happened? Would you be like going to the CDC and you're like, I mean, I I",
            "start": 817.2
        },
        {
            "text": "even expanding on this more Colin we're now we're into The Walking Dead territory would you start trying to figure out what happened would you be like going to CDC and you're like yeah I mean I I absolutely would because what the hell else am I going to do if there's no one to talk to you can't play with Legos well there if there's no threat in no one to talk to it's like you got to figure out something so I would definitely travel the country see I see Colin just going into these houses seeing things all set like placed and stuff and you just sit there and just look at it and then get visions of like what do you think col would sit in role play in the exactly just like how was your day de can you pass me the peas get gets up walks the other on the table Yes dear gets up like I mean have all the time in the world what the hell am I going to do gonna do real quick CU one of the characters in their Bane Yes dear Yes dear yes I expect would just turn into B let's be honest he just",
            "start": 855.52
        },
        {
            "text": "have all the time in the world what the hell am I going to do gonna do real quick CU one of the characters in their Bane Yes dear Yes dear yes I expect would just turn into B let's be honest he just started talking to himself like do you want to go to Kmart yeah I'd like to go to Kmart with my S I got to get up with the table though and say that yes Bane I'd like to go to Kmart with you okay are is he putting the mask on and off as he does this yeah he's got I think he's just doing whatever The Dark Knight does you just put on The Mask I'd like to do that with you no one cared about me until I went to Kmart it's the Red Light Special see I would gather supplies I think and not Legos I'd want to go load up on canned goods and whatnot cuz I'd always be afraid there were going to be more people I would never be let my guard down if like you're good there's a lot of canned food in this world yeah I know saying I'm going to gather if you're not sure you're the only one I can see",
            "start": 893.52
        },
        {
            "text": "more people I would never let my guard down if like you're good there's a lot of canned food in this world yeah I know saying I'm going to gather if you're not sure you're the only one I can see that you'd never have to worry about transportation right because you just well I guess you would have always have to worry about transportation well no cuz you just go find another car yeah if you were the only person left you would never run out of anything for at least two to three years and then the cars would probably their batteries would die and then you'd be you'd be sure but there's new there's going to be new like dude like if you were literally the only like like you know sentient self-aware thing in the world like you would not need anything but gas doesn't really go bad like I could if I was the only person I would be fine no you'd have unlimited canned goods can goods don't go bad for long trying to figure out how to open the canned goods",
            "start": 936.72
        },
        {
            "text": "I could if I was the only person I would be **.** I think you'd be fine no you'd have unlimited canned goods can goods don't go bad for long trying to figure out how to open the canned goods and cook them without with a can opener what you what the **** are you talking about see I don't know in my in my head eventually whoever's running power is going to stop running power I'm not going to turn yeah well eventually the power plants will shut down cuz there'll be some sort of malfunction and they they'll just stop so then I'm **** screwed then you can just you could spend that time it would take years for that to happen you could spend time because a lot of them are hydroelectric and stuff you shut them down these conceivably should go for decades and that's when the the me and my stockpiling comes in handy you could just like get a series of generators like a bunch of gas like just all like you'd be fine you have own little compound I think the biggest thing you'd have to",
            "start": 975.12
        },
        {
            "text": "my stockpiling comes in handy, you could just like get a series of generators, like a bunch of gas, like just all like you'd be fine, you have your own little compound. I think the biggest thing you'd have to overcome is loneliness. Yeah, oh yeah, yeah. You might have to think about offing yourself at some point cuz it's like what's the point really? You know, but you could have the Burgess Meredith style, you know, kind of thing, of being like that - there's time at last to do what I want, I can read, I can do it. You know, I can... the internet's probably fine, how would all that work without an EMP going off? The electricity would still work but the internet, I guess, would eventually shut down slowly, eventually servers. But if you were on Twitter, you'd tweet and no one would get back to you so you know you were the only person on the planet. It sounds like posting on Facebook, no one would get back to you, but this",
            "start": 1013.28
        },
        {
            "text": "that's the thing if you were on Twitter you'd tweet and no one would get back to you so you know you were the only person on the planet it sounds post on Facebook no one would get back to you but this sounds like a great short story or like a great plot like you do so like you're the only you think you're the only person left you're doing a little social network things over years at a time and then suddenly like person starts there's one if someone likes a Facebook post what that was actually a plot in Versus XIII was it yeah they start a face a social media thing and like they're in the future and no one does **** and it pretty much just what you said but then the question would be if they were in another country you know and like the phones weren't working potentially you can only communicate by the internet I guess you could still Skype them but that would still work but how would you get to them because how would you span an entire ocean you wouldn't yeah was like I mean I",
            "start": 1050.0
        },
        {
            "text": "communicate by the internet I guess you could still Skype them but that would still work but how would you get to them because how would you span an entire ocean you wouldn't yeah was like I mean I guess you could read how to use a boat you could I mean you could do it I mean this is the thing like you could do it you can get like at some sort of yacht with a big engine take a bunch of gas with you hope for the best see that's my thing would you be able to be like I know how to drive this yacht I think you have the the the the ability to figure it out you could pull it out and if you banged into something and it sank you just get out and go to the next yacht I guess you're right like you have 40 yachts there's like a 30 yacht sitting over there in the in the marina where near where I live I just I would Jack you play too easy though s like all the keys are right there those keys are in people's pockets that are on the ground they've been raptured there's no way I'm jacking a yacht and",
            "start": 1086.92
        },
        {
            "text": "I just would Jack you play too easy though. The keys are right there, those keys are in people's pockets that are on the ground. They've been raptured. There's no way I'm jacking a yacht and driving this yacht. Driving is driving, right? You pilot boats, yeah. You pilot boats. Guess that's why they call them captains. Interesting Captain. There's no way I'm piloting this boat to my friend in whatever other country. What if it were a sweet, and I'm talking like jacked-up sweet Miami Vice, like a cigar, like a cigarette boat? A cigar boat, cigarette. I don't think the boat is the problem here. The go-fast boats they call them because they go fast. Is that what they call that? Yeah, sick. I wouldn't even worry about it if there's another person on the whatever. I'm not going to save everything, but if it's a hot chick and you're like this is the only person I have, I'm gonna repopulate the Earth be like why don't you get a boat? Huh, you come no that's what she said.",
            "start": 1119.08
        },
        {
            "text": "everything but if it's a hot chick and you're like this is the only person I have I'm ad in your Eve to like repopulate the Earth be like why don't you get a boat huh you come no that's what she C situation what if she goes she calls you and she's like or she Skypes you and she's like hey you know we should meet we should be together in person cuz we'll last longer if we're together like we won't go psycho and like we'll be able to like do stuff together like touch each other's fun parts and stuff and she's like all right and then but you have to she's in like Prague and you have to figure out a common country to get to together you this is the way you do it she goes east through Russia through Russia yeah all the way to you know the Eastern edge of Russia you go west really far though towards the United States up into Alaska then you can cross the Bering Strait which is not that big of a deal it's from the Uliuian Islands to Russia it's like it's like you can see them from each",
            "start": 1159.28
        },
        {
            "text": "towards the United States up into Alaska, then you can cross the Bering Strait, which is not a big deal. It's from the Uliana Islands to Russia; it's like you can see them from each other, so you could just get into a boat using science and a map. Yeah, more GEE would look at maps, I guess you could be literally by car - you could Google it and see if you could get there by car. Yeah, that or even walking; they have a little walkie-talkie, the little dude yeah would take you 78 years if you Skyped and she was in Prague and you were in New Orleans. Uh, you could if you both just left at that point and got into a car and figured it out, you'd see each other in a couple of weeks. Yeah, but how would you cross the ocean? She would have to get a boat yeah, in one of the ports in Eastern Russia. See if I can get a video; I think I'm good with that. I don't know, of course you are - the Cyberx, of course you are. Like what's your hand doing? Um, I don't know, that I'd be balls",
            "start": 1198.12
        },
        {
            "text": "in Eastern Russia see if I can get a video I think I'm good with that I don't know of course you are the host of course you are like what's your hand doing um I don't know that I'd be crazy enough to take a boat to sail a boat or pilot a boat across the Atlantic Ocean I mean it would be a last resort for me I really wouldn't I it basically if I'm to the point of thinking about offing myself then yeah then I'd be like what would I have to lose you know what I mean a gun One in the Chamber I have a lot of guns a flare gun I would have so many guns cuz it's cool and then when you wanted to you could just shoot guns at something no one's going to care yeah but also for protection they're still animals we decided right yeah but like wolves maybe yeah they're not those things are going screw with you yeah they are I mean it's not like Game of Thrones well sure but it's they're still going to come for you the other like the stupid thing bringing you down right like you",
            "start": 1242.44
        },
        {
            "text": "are going screw with you yeah they are I mean it's not like Game of Thrones well sure but it's they're still going to come for you the other like the stupid thing bringing you down right like you get pneumonia you get something you get something it's something innocuous right you break your leg you're like well **** all the more reason to have someone else there that can help you out and take care of you but of course I guess we totally even blew past this topic because there is not a second person left on the planet it's just you and you only have one week before you probably start going psych I don't know I just think you got to keep yourself entertained like I would love to go to a military base and just **** around with all their **** yeah you know get to a tank we talk about boats get to a battleship an aircraft carrier see if you can that would be the that would be the business right there what do you really have to lose I would I would play I'd probably get into a jet",
            "start": 1281.04
        },
        {
            "text": "boats get to a battleship an aircraft carrier see if you can that would be the that would be the business right there what do you really have to lose I would I would play I'd probably get into a jet airplane just like and do Top Gun the whole movie play out the whole movie wait you didn't mean get in the air did you no I would get so it's like when you go to the arcade when you were a little kid and you didn't have the quarters to put in the driving games swerve around with it anyway yeah I would cool like I'd want to cap canabal and try to launch it in space yeah really yeah why not no you probably wouldn't it probably there's no way like unless unless they all got raptured right as they were like hit about to hit the button it's literally just fuming and you're like I guess I can get up there but then how are you going to get back n who cares at that point that's yeah that's not a bad way to go going into space that's one way to die the most terrifying way to die ever Then Greg would go to Mars suffocate in Space but yeah",
            "start": 1313.4
        },
        {
            "text": "you're going to get back n who cares at that point that's yeah that's not a bad way to go going into space there's a terrible way to go ever Then Greg would go to Mars suff in Space but yeah you just open the door and you're done it's over you die instantly right yeah yeah it's over that sucks I would rather just live as long as I possibly can go a little stir crazy lot stir crazy and probably just die of some sort of flu have some sort of volleyball friend yeah I would have Portillo you could have dog yeah you could have you could have companionship you could have a monkey if you wanted Greg I want a monkey you want a monkey want monkey you can train a monkey you can steal a monkey from the the zoo a brand new monkey just born you can train it to be your your only friend call it Clive Clive mon monkey yeah easy peasy see I'd want to go to you know like Pier 39 I don't know the equivalent in other places but they have the like the trampoline with the the harness you go in and",
            "start": 1354.72
        },
        {
            "text": "Clive Clive mon monkey yeah easy peasy see I'd want to go to you know like Pier 39 I don't know the equivalent in other places but they have the like the trampoline with the the harness you go in and then they charge you $1 for like 5 minutes yeah you just get to do that forever that'd be really cool and you you wouldn't have a technician there to do it you'd immediately break something your rib punctures your lung yeah but if you go out on that slow and painfully I mean the great part is you're like wow I had so much life to live but realistically you're like it was going to suck anyways who cares like I would not want to live if I was the only person on the planet I would not want to live for longer than like two weeks I got myself two weeks two weeks I would get I I think the first week I would spend would just be like letting myself go cuz at that point who gives a **** what you look like how fat you are what you're eating it doesn't matter I mean you've got to move fast",
            "start": 1395.4
        },
        {
            "text": "I would spend would just be like letting myself go cuz at that point who gives a **** what you look like how fat you are what you're eating it doesn't matter I mean you've got to move fast I've thought about it you know what I mean like from what the bear why do you swear there's Bears coming out every single I'm actually going with you here on the team fat method of like I would it' be cool to be able to eat pizza or whatever I thought you meant you literally have to move FAST exercise I'm saying that like all that stuff's going to go bad soon you're never going to have another piece of pizza Taco Bell right I would go there every night until I started to smell a little funky like until the ingredients started to get bad but Taco Bell everything's frozen right and if there's still electricity realistically I could just go from Taco to Taco Bell for like a good year just like I mean how hard is it to thaw out the meat there's got to be some sort of like manual some printed on the wall",
            "start": 1437.68
        },
        {
            "text": "realistically I could just go from Taco to Taco Bell for like a good year just like I mean how hard is it to thaw out the meat there's got to be some sort of like manual some printed on the wall yeah I've seen it it's not that hard I would do that we do that up everything's frozen anyway then Carl's Jr I'd get supplies yeah canned goods guns then I'd start barricading walls and stuff you you would be that like you would barricade yourself in no I would just I I mean I your I'm your entire life would be did something just move did I leave that door open blah blah I'd be like doing like spray painting I'd be taking doors off hinges on other people's house I'd be making like compounds I'd be walking with a shotgun and a flashlight on it the entire time that's crazy nothing's going to jump I'm not like I mean there's there's no guarantee that you're the only person there like we know right now cuz we're playing God in this scenario but like in that scenario no idea if someone's",
            "start": 1471.56
        },
        {
            "text": "to jump I'm not like I mean there's there's no guarantee that you're the only person there like we know right now cuz we're playing God in this scenario but like in that scenario no idea if someone's about to come around if aliens are about to come over you know blah zombie that's when the aliens come I mean like everyone to leave I mean I I'm I will be I will be very red in the face if it turns out the Rapture happens and I'm the only person not taken you know what I mean like I'm I'm imagining somebody is up to something here and it ain't Jesus see I think I I would do the same thing I might want to fortify but I think I'd also be a little bit more like I would be paranoid for the first week or two or maybe even the first month or maybe even the first year but then after that I would put like I would go on what is that Telegraph Hill what's the one with the big like Arc de Triomphe, that's not Quake Tower that's Sutro Tower, big uh sky hook thing that's going like a boat on top of it it's like",
            "start": 1512.6
        },
        {
            "text": "like I would go on what is that Telegraph Hill, what's the one with the big like Arc re that's not Quake Tower, that's Sutro Tower, big uh sky hook thing that's going like a boat on top of it, it's like the Sutro Tower is that what it is, yeah no it's like a it's like a big telecommunications thing up there, yeah Tower cool I'd go there and then like I'd hang a giant sign that's at like people here just to see if anyone in like the 40m watch with your sniper rifle hell yeah I would and if they came near and they looked even remotely fishy or not maybe if they look cool blow them away anyway why not it's like guy looks nice, look at him he's bouncing up and down on a trampoline with all his Nickelodeon games take his off all his Nickelodeon games he just that's where he went from Toys R Us to the trampoline place and he's holding all his games and you just blow him away just take his leg right off and watch him bleed out God damn you shoot me in the leg yeah dude I wouldn't",
            "start": 1551.68
        },
        {
            "text": "to the trampoline place and he's holding all his games and you just blow him away just take his leg right off and watch him bleed out God damn you shoot me in the leg yeah dude I wouldn't I wouldn't kill you I wouldn't put you in the head I got this the only entertainment I've had for an entire year you show up I got to put one in your leg and then I'm using a high caliber rifle here let's be like maybe two three people in the world can make this shot but I'm one of them and I take your leg clean off and you hobble around is that because you've been practicing yeah okay he's one of the only people in the world yeah what else am I going to do and uh you know I watched the movie Sniper a lot with Tom Berenger yeah uh let the weapon he was a sniper on that as well play scope in your day 100% And then I just watched you get out for my entertainment Portillo would probably be alive so I'd come to get like if I knew that he was still alive in the city I would get in my car and come over here",
            "start": 1596.68
        },
        {
            "text": "And then I just watched you beat Portillo out for my entertainment. Portillo would probably be alive, so I'd come to get him like if I knew that he was still alive in the city, I would get in my car and come over here and get him. Portillo would be the first one to go; it's a Rapture. They're not going to take the dog; we don't have any. He said he'd kill him. Oh, you'd kill him? Would you really? Oh, Vendetta, he's just dead. How would you kill him? Colin would take him. My bad, I would probably let him go. I don't know if I'd take him, but I'd let him out; just let him wild. Yeah, he would go five feet, run down the street, and then twenty seconds later come back and give you that vacant stare like he's hungry. That's about it; he'd follow you; he'd follow you the whole way. Cool, cool. Well, thanks, Nicholas Burton. Well, maybe we think that's your name; we're not 100% sure. Name yourself, the man. Thank you so much for watching the show, and remember if you have questions for me, tweet them at me. Nick Scarpino, Colin, yeah, what do you got? Uh, I want to talk.",
            "start": 1631.28
        },
        {
            "text": "name we're not 100% sure name you the man thank you so much for watching the show and remember if you have questions for me tweet them at me Nick Scarpino Colin yeah what do you got uh I want to talk about drug legalization yeah smoke the W and kick the C smoke the W that's what all kids say y man you smoke that W today first though I want to uh I want to just give a quick shout out to uh drugs to drugs shout out to drugs uh all the drugs and all the drug dealers and all the drug users uh no I want to uh I want to uh give a shout out to um my uh girlfriend Cheryl's sister Courtney what up Courtney what up Courtney big drug user here she she watches the show for some reason and her boyfriend does too Philip and it's his birthday so I want to give you a happy birthday Phil you son of a **** he's a Jets fan like me I do I like the Jets son of a **** he's unrelated it's in term of endearment just like scumbag scumbag is not a ter of ende not a you guys are all my scumbags you're all",
            "start": 1673.72
        },
        {
            "text": "he's a Jets fan like Jets I do I like the Jets son of a **** he's unrelated it's in term of endearment just like scumbag scumbag is not a ter of ende not a you guys are all my scumbags you're all my scum your one of our fan one of our fans came up to us at the Rotten Tomatoes thing and he pulled me aside and he was like it's causing me mental anguish that people think of me as a scumbag is he going to sue us he's not going to sue us I'd like to see you try you **** douche but he did say that Greg Miller is has a lot he's better than that is what he said he was like Greg's better than that he can come up with something better than scumbags and I was like well this is a guy that wears shirts that say Team Fat so chances are he's not coming up with something better but I think we can none of that story true story none of that actually that actually happened uh so anyway uh yeah so happy birthday Phil big Phil and uh yeah so drug legalization now this is inspired by um uh in Washington State",
            "start": 1722.68
        },
        {
            "text": "\"Story true story none of that actually that actually happened uh so anyway uh yeah so happy birthday Phil Big Phil and uh yeah so drug legalization now this is inspired by um uh in Washington State uh this past week they started selling marijuana legally and this was voted last year um the same thing in Colorado they've been selling it since January 1 there legally over age of 21 okay um and I just kind of wanted to gauge you guys thoughts on legalization of marijuana and also the legalization of other drugs um if you think drug use should be criminalized um and kind of where you stand if you think it should be kind of by drug or natural versus you know synthetic or something like that M see it's hard for me because I was never like weed was never my thing right I always liked alcohol so it's I feel like saying hey alcohol should be legal come second to me because that is sort of my vice of choice you know I do like to go out and drink I do like to hang out with\"",
            "start": 1768.8
        },
        {
            "text": "liked alcohol so it's I feel like saying hey alcohol should be legal come second to me because that is sort of my vice of choice you know I do like to go out and drink I do like to hang out with the guys and like have a good time like that drugs have never been my thing so I don't really like it's not that I don't have an opinion about it I don't think that we should limit people's access to certain narcotics but for some reason weed to me uh doesn't seem on the same level as some of the harder drugs I don't know why I still think that they can be equally as destructive um but I also just I don't know everyone has that like especially in California in San Francisco it's like weed is already sort of legal cuz they don't really penalize you here you know if if you're caught with it I've heard people say like cops don't even care they just let you go um so that doesn't seem even real to me I don't know",
            "start": 1816.84
        },
        {
            "text": "really penalize you here you know if if you're caught with it I've heard people say like cops don't even care they just let you go um so that doesn't seem even real to me I don't know is that weird to say no not necessarily so it's not even like an illegal substance because people don't care about it why are drugs illegal um because they hurt you or they have the possibility of hurting you I guess and also they're just contentious you know like they finally got over marijuana prohibition of those two states other states will follow suit the Domino effect is cast with that now that's over um and uh you know I think it's that you know they can't make money off of it you know now they're figuring out how to do that and just the the whole moral conundrum of like should you let something that is potentially harmful cuz marijuana I agree mushrooms things like that are like one level but like you get into heroin and cocaine and all that kind of stuff and that is next level drug",
            "start": 1856.12
        },
        {
            "text": "that is potentially harmful cuz marijuana I agree mushrooms things like that are like one level but like you get into heroin and cocaine and all that kind of stuff and that is next level drug um and I've you know I've never used any of these drugs like never want to or whatever but my my you know um my stance is still that like fundamentally I'm not sure the government should be telling you what you can do well I mean that's my thing right is because in in inevitably or at the heart of it it is hypocritical because you cannot say you know we can't sell cocaine or or meth or heroin because it's super bad and destructive for you but in the same breath let big tobacco push cigarettes out to the street and let kids you know 18 and most most of the time younger because it's very easy for kids to get cigarettes how is that still legal how are cigarettes still legal and weed isn't right yeah it's it doesn't make any sense it doesn't make any sense so it's almost one of those things like",
            "start": 1895.52
        },
        {
            "text": "Kids to get cigarettes, how is that still legal? How are cigarettes still legal and weed not right? Yeah, it doesn't make any sense. It doesn't make any sense. So it's almost one of those things like a \"n\" that I'm advocating for one with the other, but I could see an argument for just legalizing everything because at that point, like, that's who we are as a society. Why do we pick and choose? Cigarettes obviously because they're the most powerful - like the tobacco lobby is one of the most powerful lobbies in the world, and they just have more money than everyone so they can keep this drug on the streets that's killing people and killing teens and causing all sorts of horrible cancers. But at the same time, people aren't allowed to smoke weed, that just sounds silly, it sounds dumb. I think it's one of those things where I honestly believe 50 years from now we're going to tell our kids or our grandkids and they're going to be like \"no way, no way, that's not the way it was.\"",
            "start": 1937.04
        },
        {
            "text": "one of those things where I honestly believe 50 years from now we're going to tell our kids that or our grandkids and they're going to be like no way, Wayne Gretzky had a lot of money wasted on him because his wife was part of the sufferagette movement about their husbands being drunk and kind of drinking the Dole as the saying was and spending all their money wasting all their money and it was like it was their hearts were in the right place to ban alcohol but it just backfired because you just can't do something like that expect to get away with it um I don't think tobacco should be illegal obviously um I I think that you kind of have to draw the line I think that the use of any drug should not be illegal um so if you do coke or heroin or crack or whatever I don't think the act of",
            "start": 1972.12
        },
        {
            "text": "obviously um I think you kind of have to draw the line I think that the use of any drug should not be illegal um so if you do cocaine or heroin or crack or whatever I don't think the act of doing it should be illegal I do think that the government can say we can't in good faith let you sell cocaine you know what I mean like the act of doing shouldn't be illegal maybe even the act of buying it shouldn't be illegal but the act of selling it should probably be illegal and um that is like but isn't that like a half measure like how are you getting it otherwise you're not making cocaine in your backyard sure but it's the same thing with like you know you're talking about marijuana in San Francisco and and in a lot of places where it's decriminalized like you shouldn't you're not technically allowed to sell it but they just don't arrest you for having it well at these these places like Washington and uh Colorado you go to a store and buy it yep so I mean wouldn't that just be the same way",
            "start": 2016.92
        },
        {
            "text": "to sell it but they just don't arrest you for having it well at these these places like Washington and uh Colorado you go to a store and buy it yep so I mean wouldn't that just be the same way with other stuff too yeah yeah but the the difference is that marijuana has never killed anyone you know so like see that's my thing we've talked about this in a conversation with Colin before links in the description and uh what gets me about it is I'm with you that marijuana should be legal obviously I've thought that forever you know what I mean like big deal marijuana it's the same thing as anything right like with D your senses maybe get a car accident or whatever but like then buy should be you know totally out loud as well right so let's get marijuana out the door everybody's smoking marijuana great government should sell it get us out of debt stuff like that but when you get down to cocaine and heroin and stuff I've never for a second thought that any of that should be legal now granted",
            "start": 2056.16
        },
        {
            "text": "great government should sell it get us out of debt stuff like that but when you get down to cocaine and heroin and stuff I've never for a second thought that any of that should be legal now granted I'm not a drug user and never have been so I don't know like I mean like I I don't party people who are doing that so I'm not around to see it but it it seems like whenever they do a bad decisions follow you know what I mean like do something stupid well also that it's that you know not all the time those heavier drugs are they have the stigma of being the heavy drugs for a reason right like people die sometimes the first time they do meth or Coke because it messes with their brain chemistry and fries their brain right or like you hear those stories of people doing e and the e was cut improperly and it messes people out forever that happens very seldomly does that happen unless weed is laced with something right I don't think people are going to smoke weed for the first time in fact most of",
            "start": 2097.24
        },
        {
            "text": "and it messes people out forever that happens very seldomly does that happen unless weed is laced with something right I don't think people are going to smoke weed for the first time in fact most of the time people smoke me the first time nothing happens they're just like I don't get this right um yeah I think it would be I I just obviously I'm my brain immediately goes to like the worst case scenario and like all of a sudden cocaine's free to sell everyone starts using it and and a lot of people start dying I think and I think that that's not far off from what might actually start happening but I mean so smoking right like cigarettes right this whole oh weed's never killed anybody has smoking killed people like does that battle that yeah they can't so as far as I understand there was like a few landmark studies about marijuana's effects on the body especially the lungs and stuff like that and as far as I can tell it's hard for the scientists to differentiate the effects of smoking",
            "start": 2133.32
        },
        {
            "text": "a few landmark studies about marijuana's effects on the body, especially the lungs and stuff like that. And as far as I can tell, it's hard for the scientists to differentiate the effects of smoking tobacco from smoking marijuana. I think it was the UCLA study in 2004, which was like one of the huge ones, where they basically said, \"It doesn't have any effect on you.\" Where they were basically saying, \"It's hard for us to tell\" because some people lace their marijuana with tobacco; they smoke them at the same time. Some people smoke cigarettes and marijuana; some people only smoke marijuana; some people used to smoke cigarettes now they only smoke marijuana. It's like, so how do we tell you know, what the long-term ramifications of smoking a substance is if you're mixing them all up? I think it's fair to say that if you smoke marijuana, you have a chance... like, the tar-related stuff, like EMP, like that. I think that's probably exactly",
            "start": 2174.36
        },
        {
            "text": "up I think it's fair to say that if you smoke marijuana you have a chance like the tar you're going to get the same stuff as cigarettes, like EMP, and I think that's probably exactly what hot smoke does into your lungs. As far as I understand, marijuana tar is much heavier and there's a lot more of it per whatever weight you want to use, but you smoke much less of it. So when you smoke, you're smoking a pack of cigarettes a day, half a pack of cigarettes a day, you know, a joint or whatever a day, a bong or a bowl or whatever - that's still you know, and a lot of people, a lot of potheads do it every day I guess, and there are a lot of people who do it casually. Like all these things that you know, I think a lot of the pro-marijuana people are thinking wishfully that there's no ramifications, but I also think that like the whole scare tactic thing of like marijuana is going to kill you, I think that's silly",
            "start": 2211.56
        },
        {
            "text": "of the pro-marijuana people are thinking wishfully that there's no ramifications, but I also think that like the whole scare tactic thing of like marijuana is going to kill you, I think that's silly too. Because someone made a really good point: um, I was having this debate with someone, there like if marijuana was going to make you sterile and marijuana was going to **** your brain up and marijuana was going to do all these things, what do you think your parents' generation would look like right now? First of all, you probably wouldn't exist. There was like a huge boom with the Baby Boomers, right, like the Baby Boomers having kids; they were all a lot of them were hippies, potheads, all those kind of things. You think they'd have rampant non-age-related dementia and all those kinds of things, which we don't see. You know, so like there's all sorts of things that say when you compare marijuana to something like alcohol, marijuana is actually not nearly as destructive, you know? So you know my my",
            "start": 2249.88
        },
        {
            "text": "we don't see you know so like there's all sorts of things that say that when you compare marijuana to something like alcohol, marijuana is actually not nearly as destructive, you know. So, my whole stance is this on personal liberty - this is where my libertarianism kind of comes out. I think you should be able to do whatever you want to your own body, so that means if you really want to use meth, you're dumb, but okay, like, don't do what you want, I guess is the worst. Don't do it. I'm just saying, like, it's your body, you know? You hurt someone when you're on it, you rob someone to get money for it - that's a different story, and that's another one of the reasons people don't want to encourage drug use because, and rightfully so, I think, because you commit crimes. But at the same time, you know, it's the same way I feel about prostitution - like prostitution should totally be legal; that's not even a question to me, because it's about doing",
            "start": 2286.44
        },
        {
            "text": "to paper but at the same time you know it's the same way I feel about prostitution, like prostitution should totally be legal, that's not even a question to me because it's about doing what you want to do with your own body and kind of drawing your own lines and having your own self-respect or lack thereof or whatever you define your self-respect as. But at the same time I think the government should step in and say, you know, we're cool with marijuana, we're cool with mushrooms, we're cool with these other natural things, but we really can't be cool with you doing meth or cocaine. We can't allow that to happen. So even though you can do it if we find you buying it or if it's on you, that's a different story. And I think that's kind of a reasonable stance to take. The same way I feel like even though I'm a Libertarian and like a small government guy, I think things like the FDA are awesome, and like, you could tie the FDA is cheap as **** and they do",
            "start": 2324.8
        },
        {
            "text": "the same way I feel like even though I'm a Libertarian and like a small government guy I think things like the FDA are awesome and like you could tie like the FDA is cheap as **** and they do like really important stuff you know they keep you safe um and that's a good function of government because that's that's not in your business that's just saying like hey like this meat's tainted and you probably don't want to eat it yeah you know like there's nothing wrong with that and so it's the same thing with me or like these vegetables have pesticides on them you might want to stay away from like that's totally F so someone's like so someone's like hey this Coke you can't do it you know because we just can't sanction that yeah but like at the same time it's like how do you trust anything that allows cigarettes to be sold like they are bad they don't make you feel good the lobby they're full of toxins and they are readily and plentifully available to any single person wasn't the",
            "start": 2362.92
        },
        {
            "text": "that allows cigarettes to be sold like they are bad, they don't make you feel good. The lobby is full of toxins and they are readily and plentifully available to any single person. Wasn't the big thing about putting a prohibition on marijuana the tobacco Lobby to begin with? Yeah, a lot of that had to do with them. And also, yeah, I mean that's a big thing with we have huge companies, especially in the South, I think there were like a lot of them in Charlotte or Richmond, like Philip Morris and all these companies. We used to grow a **** ton of tobacco; there are all these landed interests that make cigarette money. Doing cigarette smoking is a is it's funny to put it this way because we know it's all messed up. I mean you watch Mad Men even and they like the evolution of cigarettes and like the stigma about them, like when they do the cancer ads and stuff like that, and uh the evolution if you just read about",
            "start": 2395.96
        },
        {
            "text": "you watch Mad Men even and they like the evolution of cigarettes and like the stigma about them like when they do the cancer ads and stuff like that and uh the evolution if you just read about the cigarette Lobby and like how they just had to slowly succumb to the science and except that the like cigarettes were killing people but maybe much the same way with cocaine or heroin or meth they're not necessarily going to kill you you know and that could always be the argument you know people that smoked a pack a day for 10 years and got one cancer you know people that smoked 50 you know or a pack a day for 50 years they're fine you know and it's like and it's one I think it's one of those arguments where it's like well I think methamphetamine is a lot more destructive like they literally start burning every they they burn what are they uh Connections in your brain the synapses in your brain they just start burning those out and literally there are like have you ever seen what that drug",
            "start": 2434.52
        },
        {
            "text": "burning every time they burn what are they uh Connections in your brain, the synapses in your brain, they just start burning those out. And literally, there are like have you ever seen what that drug does to a human being? Like what, like the study, the actual science behind it probably going to slaughter right now, but literally, it burns away your ability... like it burns the connections in your brain that allow you to feel happiness. It's crazy; it just starts eating away at the inside of your brain and your teeth for that matter. And every time it... it actually I think now, now that I'm remembering this a little better, it affects your brain's ability to release dopamine, which is the happiness drug basically. And so as... and please tweet at me if I'm wrong about this and correct me, but um they are... but they did someone tweeted at me that Kevin Smith has never used Kickstarter before, and I was like \"oops\" how did I not know that? Um, but and that's awesome, thank you for that. He did he did not.",
            "start": 2470.76
        },
        {
            "text": "um but they did someone tweeted at me that Kevin Smith's never used the kickstarter before and I was like oops how did I not know that um but and that's awesome thank you for that he did he did not he talked about it and then decided not to do it um and so you end up having to do more and more meth to chase that high so to speak and it just eats away at you from the inside out and I've seen it I used the data girl whose sister started doing it and she started off as a very very lovely person and then by the end of it they had to lock her out of the house cuz she was constantly coming in to try to steal stuff to go get that next fix that is not a world I want to live in so God for any if that ever happens that actually might be one thing that energizes me politically to go out there and be like hard drugs are a no it's just not going to be that's that's no no fly zone yeah I I I mean I don't disagree like I I'm I'm caught in a rock between a rock and a hard place where it's like I just",
            "start": 2508.92
        },
        {
            "text": "like hard drugs are a no it's just not going to be that's that's no no fly zone yeah I I I mean I don't disagree like I I'm I'm caught in a rock between a rock and a hard place where it's like I just feel like personal Liberty trumps a lot of the other things but well pretty much everything else but but at the same time you're going to inherently infringe on other people's rights when you're doing these kinds of drugs you're driving a car yeah cuz you're not allow you're never going to be allowed to build bombs right and just randomly put like ignite bombs because it could kill and hurt other people so that's always going to be something that's illegal um or should be illegal I think the same goes to these hard people make really poor choices when they're doing hard drugs but prisons are also full of nonviolent drug offenders you know and that's like another issue I really have too where there's just we have like a crazy prison state in this country predicated largely on the drug",
            "start": 2544.24
        },
        {
            "text": "are also full of nonviolent drug offenders, you know, and that's like another issue I really have too, where there's just we have like a crazy prison state in this country, predicated largely on the drug trade, predicated and fueled largely by the War on Drugs. Um, I do feel like the prohibition of drugs and the mystique around drugs makes them more interesting for people to do. I do think that if you, for instance, legalize cocaine, which I don't think is necessarily a good idea, but if you legalized it, yeah, there would be a huge spike in it, and then people wouldn't do it; like, it would go back down to like normal, especially if the state was selling it and they taxed the **** out of it and made it really expensive. But I mean, literally, if we were all at a party together and someone was like, \"Hey, I have cocaine, and it's totally legal,\" would that not make you want, like, a little bit more likely to do it? No, I would never; I would never do it. I don't iade cocaine because there's no",
            "start": 2579.4
        },
        {
            "text": "was like Hey I have cocaine and it's totally legal would that not make you want like a little bit more likely to do it no I would never I would never do it I don't I'd use cocaine because there's no cocaine high from Mar well that's what I'm saying and they would do that right they would come in and they would say no no no there would be varying degrees on like what was cut with and like how much it affected you and you get just a little bump and you kind of you're feeling a little drunk right now it takes you right out of it and like you're going to tell me there's not people we know that would be like yeah I'll do it cuz it's it's totally legal and totally 10 years from now acceptable in society to be able to do that right like in the 20s it was unacceptable it's legal does definitely makes me feel like oh this is an okay thing to do it's an okay thing to do like it's okay for us to have one more one too many drinks at night largely because we live in San Francisco and we",
            "start": 2618.6
        },
        {
            "text": "makes me feel like oh this is an okay thing to do it's an okay thing to do like it's okay for us to have one more one too many drinks at night largely because we live in San Francisco and we were able to get home without having to drive but it's still okay for us now if you think about it to have that second or third drink that puts you completely Bonkers and either you're going to wind up passed out someplace or you're going to that hot dog place in the marina which is amazing and only open from 11:00 at night till 3:00 in the morning I think a similar thing here is if they lowered the drinking age to like 18 or just didn't have a drinking age it's just legal mhm like I wonder if there would be as many you know underage drinking problems well they've proven that I mean a lot of people talk about that in Europe cuz the drinking age is like nothing I mean you can drink and people teenagers grow up experimenting with it and and getting guidance from their parents on it because it's",
            "start": 2654.84
        },
        {
            "text": "talk about that in Europe cuz the drinking age is like nothing I mean you can drink and people teenagers grow up experimenting with it and and getting guidance from their parents on it because it's something that they're offered by the parents like hey don't do that just have one drink or whatever and and there have been a lot of studies that come out although I have never read any of them I've just had people tell me that there's been a lot of studies come out that say people in Europe and in European nations don't treat alcohol with the same level of taboo nature that we do because they don't get to 21 and just rage cuz they've been drinking since they were exactly I feel like a lot of kids in college are just going to go crazy because they can and even like when they can't is even worse like the high school kids are just like we can't do this so we're going to you know yeah but if they could see I looked out like I've always said I had a brother that was a bit older so he helped",
            "start": 2692.44
        },
        {
            "text": "like the high school kids are just like we can't do this so we're going to you know yeah but if they could see I looked out like I've always said I had a brother that was a bit older so he helped guide me through a lot of those experimentations when I was younger with like with cigarettes and with well cigarettes I'm thinking for that but um but with alcohol especially he was like this is how you do it and have fun drinking but like don't go anywhere and like never get in a car and never do any of these things and of course we've all at some point made a poor decision that that thankfully you know didn't backlash but I just don't I mean I I don't think it would be the same way with cocaine and also I think it's because it hits you way harder than one shot or one alcoholic beverage granted I've never done it before so I don't know but I've seen people do it and they're it's turns them into like Coke monsters for all intensive purposes yeah I still feel like there's a level of personal",
            "start": 2729.32
        },
        {
            "text": "I've never done it before so I don't know but I've seen people do it and they're its turns them into like Coke monsters for all intensive purposes yeah I still feel like there's a level of personal responsibility too like I've never done these hard drugs and I never want to not because they're illegal because you can obviously do them uh but because they're stupid you know expensive and they're super addictive right exactly and it's like you know yeah of we've all known people that have done these kinds of things and it's just like you know I always question it in the sense of like why are you doing this to yourself but at the same time I think about the people in prison hundreds of thousands of people minor drug offenders non-violent drug offenders people that had some Coke on them maybe they had the intent to sell maybe they didn't uh like you know it's like let them go like what like what are you doing you know like like why are these people in prison you know like that's the kind",
            "start": 2766.72
        },
        {
            "text": "they had the intent to sell maybe they didn't uh like you know it's like let them go like what like what are you doing you know like like why are these people in prison you know like that's the kind of stuff that bothers me like we should we should be arresting and and we focusing our our eye on our our justice system at violent people people that infringe on other people's rights so if you did cocaine or you have a little cocaine on you and you go to prison for a little while that's messed up if you go to prison because you stole from your neighbor to buy your heroin that's a different story you know right and so that's why I understand the kind of moral conundrum like I've been saying like there is a real conundrum with drug legalization it can't be as simple as the libertarian slant to saying like everything should be legal but there is something to that where it's saying like maybe it should just be decriminalized you know maybe the cultivation the creation of meth or cocaine",
            "start": 2802.64
        },
        {
            "text": "to saying like everything should be legal but there is something to that where it's saying like maybe it should just be decriminalized, you know, maybe the cultivation, the creation of meth or Coke or these unnatural things which they are, they're all unnatural, you know, they're all creepy especially meth is like horribly unnatural but Coke is unnatural and you know heroin's unnatural, uh, you know these are derivatives of opium and things of this nature like maybe that should be the crime is to say like you can't sell you can't grow it but like if you did it or you have a little on you or something like that like were you really going to like ruin your life, you know what I mean like that's the kind of thing I think about like I just think about our our crazy like prison system that would be replicated in terms of how there's like what is it like one person for every hundred people in the United States are in prison or something like that's insane, you know like one out of 100 people in the",
            "start": 2839.24
        },
        {
            "text": "in terms of how there's like what is it like one person for every hundred people in the United States are in prison or something like that's insane you know like one out of 100 people in the United States aren't criminals you know and but they make poor choices I mean that's sure but they're poor and then they're thrown in prison but time out you just talked about the fact that we've all made poor choices here and there right I should have been like yeah and and in reality if I had gotten caught I would have suffered the consequences right and that's my that's my biggest problem is that I don't I'm not as trusting in human beings as I think we all would like to and that I don't believe that we I think we abuse substances I think we do I think we're we're fragile and weak and I think we get addicted to things very very quickly and once you're addicted to something by the way it's not like you can just flip that off right you're addicted forever once your brain gets a hold of something",
            "start": 2877.76
        },
        {
            "text": "addicted to things very, very quickly. And once you're addicted to something, by the way, it's not like you can just flip that off right? You're addicted forever once your brain gets a hold of something. Think about that. And you, it's not just one addiction; you can be addicted to multiple things. That's why people's lives get ruined. So I think there needs to be steep penalties, and I think the FDA needs to step in especially and really take a hard look at these substances and how they're affecting you. You don't really know if cocaine were to become legal; I think it would be a good 10 years of really bad stuff probably. But but but I think the middle ground is not legalizing these drugs. I think marijuana should be legal, um, and it absolutely will be. It already is, if it's already legal in a few states. It's already... I just think that like the act of on a personal level to criminalizing all these other drugs will go a long way towards",
            "start": 2913.0
        },
        {
            "text": "be it already is if it's already legal in a few states it's already I think I just think that like the act of on a personal level to criminalizing all these other drugs will go a long way towards helping rehabilitate people like you throw them in prison they stay in prison we pay for them to be in prison then they get out they have no jobs they have a stigma on them for the rest of their lives they have a record they can't get a job they fall into the use of drugs and alcohol and these kinds of things. That's why you know my girlfriend always says, my girlfriend works with you know the these kinds of um kind of like populations like criminal populations whatever and it really is a cycle people that go to prison go back to prison yeah you know if you go to prison it's very rare or rarer to go to prison once and then never go back to prison again and and like you should go to prison for assault or rape or murder or all these kinds of things white collar crimes all these kinds of things like",
            "start": 2952.92
        },
        {
            "text": "prison once and then never go back to prison again and and like you should go to prison for assault or rape or murder or all these kinds of things white collar crimes all these kinds of things like absolutely but I'm just asking the question like do we need hundreds of thousands of people in prison that sold Coke like that's that's all I'm asking like maybe maybe we would save money maybe be smarter and wiser and better for our population better for our people better for their kids better for them if we just not slap them on the wrist but said like don't do it again you know like give them probation and and then but then like warn them and be like we know we want help you like we don't want you to do this you know like it's it's just these the the the problem is there's a ton of money there's a ton of money to be made in that you know T of money be made in drugs is because they're illegal right the hardell but the hard cell like the the the upside to to marijuana is it does have some",
            "start": 2991.64
        },
        {
            "text": "a ton of money to be made in that you know T - a lot of money can be made in drugs is because they're illegal, right? The hardell - the harsh reality, but the hard cell like the the the upside to to marijuana is it does have some actual medicinal purposes, right? This is something that can actually help with things like glaucoma, anxiety, uh migraine headaches, things like that. These are scientifically or quote unquote scientifically proven things. So I feel like that was really the gateway into sort of being like look this isn't necessarily something as destructive as a drug or it shouldn't be thought of as a quote unquote drug when I think of drugs I think more of the harder substances there are no good uses for heroin or for Coke or for methamphetamines other than none, think about the 19th century opium dens and all that kind of stuff like some people are strong that like uh wasn't Arthur Conan Doyle isn't that he was like wasn't he in like opium well I don't know if he was into it or not but his Char main character was",
            "start": 3032.04
        },
        {
            "text": "of stuff like some people are strong that like uh wasn't Sir Arthur Conan Doyle isn't that he was like wasn't he in like opium well I don't know if he was into it or not but his Sherlock Holmes main character was into it so I assume he had I mean my assumption is if you write that that eloquently about chasing the dragon you've done it once or twice probably um so so all right so let's go around the table we wrap so Tim where do you stand um in the beginning I would have just said **** it legalize everything cuz do what the hell you want to yourself but you guys raise really good points I think you should legalize a lot of the softer drugs like I I like defining them defining what is a hard drug and just coming up with rules basically is there any nation in the world where cocaine is legal I don't think so you're thinking where they get the Cocoa Pebbles from oh okay but I don't understand why alcohol and cigarettes are legal if and weed's not we tried to make them illegal didn't work but that's",
            "start": 3070.24
        },
        {
            "text": "so you're thinking where they get the Cocoa Puffs from oh okay but I don't understand why alcohol and cigarettes are legal if and weed's not we tried to make them illegal didn't work but that's the thing like once something's legal you can't go back on that like I think personally I think that from the beginning it should have all been illegal or there should be a clear line of things under this or yeah I mean I feel like and this is going to this is going to be a stretch so walk with me on this one but it's it's very much the same as the internet right now which is there are no there not a lot of laws that govern the internet because the technology and in this instance it would be like that you know people have been smoking and drinking for a lot longer than anyone even cared to have laws about such things right so when you hit the United States you hit other you know developing countries my guess and Colin correct me if I'm wrong is that the laws really couldn't keep up with",
            "start": 3114.76
        },
        {
            "text": "laws about such things right so when you hit the United States you hit other you know developing countries my guess and Colin correct me if I'm wrong is that the laws really couldn't keep up with the the power that these the substances had over people and the money that was to be made so thankfully when I actually I think most of those were laws were probably in place by the time some of these pharmaceutical great drugs started happening like cocaine and hitting the streets which I think Cain didn't really show up until the late 70s right oh no I guess they used it they used it in Wars for a long time like 19th century they us not as a postwar as a as a drug and really yeah they used like they used caffeine pills to keep people awake and like keep people marching and and going forward yeah exactly which is which is crazy to think right could you imagine if you were in the military and you like I'm really tired but I have to go chart and like get take that hill and someone's like you",
            "start": 3152.92
        },
        {
            "text": "exactly which is which is crazy to think right could you imagine if you were in the military and you like I'm really tired but I have to go chart and like get take that hill and someone's like you know take the ring out go for it um take the Lord of the Rings oh I don't know why my brain went there I just saw a 70s movie we had a cool Coke I'm happy that you said the streets like it took us I don't know how long to get to someone saying the streets when did I say the streets you said it a bit ago made me happy though I was think the Coke nail yeah they they always had the Coke ring where you like you tip up a little thing and there's this little bump in there yeah I had some friends that thought that was cool to have those in in high school and I'm like you're you don't do cocaine but they were theater kids theater Thea uh I come down on you know Wi-Fi why why even bother not saying legalize marijuana because it's going to it's going to happen",
            "start": 3191.32
        },
        {
            "text": "you don't do cocaine but they were theater kids theater the Thea uh I come down on you know Wi-Fi why why even bother not saying legalize marijuana because it's going to it's going to happen it's already happening right and if it gets to three or four more States someone some big I mean big tobacco's going to step in eventually and start marketing marijuana if they haven't already if they haven't started marketing it already I'm sure they're working on it they're definitely working on it you're going to be able to walk into a Shell station or a Chevron station for $6 to $10 buy a pack of weed that's what's going to have that's be way more than that but yeah you think there going to be way more oh yeah I know a pack of marijuana cigarettes in the same style as the pack of you have now would be that would probably cost like $80 you think so yeah especially especially especially with taxes well or they'll sell something that's a little packet of it or whatever you your overell it with",
            "start": 3229.0
        },
        {
            "text": "Be that would probably cost like $80, you think so, yeah, especially, especially, especially with taxes. Well, or they'll sell something that's a little packet of it, or whatever you'd overlie it with; they'll probably package it with Zig-Zags, you know, like a two-for-one deal. Um, you'll be able to do that soon, probably definitely in our lifetimes, probably in the next what 10 years? Yes, we vote in California this fall. Do we really, yeah? Once, yeah. I feel like it already failed once though. Here it'll pass now then pass a bad idea for them to put it in midterm elections that's exactly what happened like we voted 2010 and it failed because those were always counterculture years which are Republican years right now because the Democrats are in power so you're putting it in conservative years they should have waited and put it in 2012 and they should wait again and put it in 2016 I bet you it fails again. Greg, I say legalized marijuana. Mhm. And then right now I'm fine with everything else being",
            "start": 3266.84
        },
        {
            "text": "should have waited and put it in 2012 and they should wait again and put it in 2016 I bet you it fails again Greg. I say legalized marijuana, mhm. And then right now I'm fine with everything else being illegal but I Colin raises good points about decriminalization. I would need to look more into that but I'm not prepared to throw that switch yet. Yeah my whole thing is like you got to just pay attention to the cause and effect about legalizing and making things illegal. Why does organized crime exist in the United States because prohibition, yeah so that is the only I thought you were going to say the Italians I'm Italian so I can say you're Italian I uh Pro you know prohibition or organized crime was a is a direct product of prohibition one to one no one would ever deny that and when you make things hard to get you criminal Enterprises will fill the void there's no such thing as a there there being no market for anything there's a market for everything whether or not it's legal",
            "start": 3304.48
        },
        {
            "text": "you make things hard to get you criminal enterprises will fill the void there's no such thing as a \"there\" there being no market for anything, there's a market for everything whether or not it's legal or illegal doesn't matter because there is a market, a thriving drug market in the United States, there always has been and the harder you clamp it down the more thriving it becomes and the more money those people make so the balance that they have to make in Washington and Colorado right now with marijuana for instance is not making it too expensive because they make it too expensive the black market won't go away and in fact the black market will become cheaper and undercut the government so they actually can't tax it too much, they have to actually make it kind of appropriately priced is a huge but then don't you think they'll don't you think they're going to reach out to those people and whoever's got some sort of dealers or some sort of uh what do you call I guess",
            "start": 3351.68
        },
        {
            "text": "priced is a huge but then don't you think they'll don't you think they're going to reach out to those people and whoever's got some sort of dealers or some sort of uh what what do you call I guess Grove pot Grove, like a place people that are growing it right, a pot grower don't you think they're don't you think they're just going to reach out to those people and offer them jobs, I mean wouldn't that be the best thing to do maybe I mean people are signing up in these states to like become official growers and stuff but there's always going to be an under market they don't want to pay taxes so like there's always going to be people that be like I don't care in fact it makes it easier for them to say like I don't care because it's no longer technically illegal yeah but I mean they're dodging their taxes which is the part if Philip Morris gets into the game it's endgame, like you can't compete with that company sure you can't like there are very I mean the same reason why there are",
            "start": 3384.48
        },
        {
            "text": "their taxes, which is the part if Philip Morris gets into the game, it's end game, like you can't compete with that company. Sure, you can't. Like there are very I mean the same reason why there are no cigarette like black market cigarette dealers, yeah we'll see. But but but there is a Black Market cigarette market for sure, you know. And yeah, mean those are stolen though, I mean those are they steal off of trucks before they go through customs or something. Good Fellas well, they're yeah they're exactly good, yeah they're unstamped and they didn't they haven't paid taxes on them and they sell them at bodegas and they get them off Indian reservations pay taxes and stuff. I mean so what all I'm saying is like we have to kind it's such a complicated problem. So my my stance would be yes legalize marijuana probably legalize all the quote unquote soft drugs as Tim put it, which is a good way of putting it. And then yeah have really commission a study by the FDA to say like what is it what does it",
            "start": 3416.72
        },
        {
            "text": "probably legalize all the quote unquote soft drugs as Tim Gettys put it which is a good way of putting it and then yeah have the FDA commission a study to say what does it look like to legalize these other drugs what does it look like to decriminalize them and what does our prison system look like if we handle drug related crimes in a more rational way that are not violent violent crimes whether or not they're related with drugs should be dealt with very harshly um and what does that look like for our society if we open it up and make it a little more free now I think that where that ends up is saying like yeah decriminalize all the use of all drugs keep the cultivation and sale of hard drugs illegal so it's not illegal on a personal level you know it's really illegal to sell it's not illegal to buy and um that and make even you can even make those crimes harsh if you want but I still feel like the War on Drugs has been a major failure and it's propagated",
            "start": 3453.12
        },
        {
            "text": "illegal to sell it's not illegal to buy and um that and make even you can even make those crimes harsh if you want but I still feel like the War on Drugs has been a major failure and it's propagated and instigated and fueled the fires of of drug use in this country and certainly drug profits which are cyclical if there's a lot of profit people will do illegal things no matter how dangerous they are to get that money so there's like all of these different things you have to keep keep in in in mind it's it's it's a very complicated issue but I think that you know we have to kind of start being honest with ourselves at least about some of these these substances um and be a little more consistent about them and remember that prohibition of any kind on popular substances usually backfires so in in in unexpected ways like I said like the Prohibition was good like the people's hearts were in the right place but they spawned massive criminal Enterprises in in a few years yeah before you knew what",
            "start": 3489.08
        },
        {
            "text": "in unexpected ways like I said, like Prohibition was good, like the people's hearts were in the right place but they spawned massive criminal enterprises in a few years. Yeah, before you knew what, people are being murdered all over the place. It was it was no one, no one expected that. You know, like so you just have to be honest that like sometimes, so the law or the unintended consequences now we have hundreds of thousands of people in prison who don't belong there. Yeah, and that's really sad for the families. It's sad for us that are paying for them to be there. Prison's expensive, man. You know? So just for thought for all our our loyal listeners out there who'll be voting in their upcoming elections, I hope so. My turn, go for it. I want to know what sitcom character you hated and now I want to make it very clear we talked about hater trolls and everything else on this show before and I always tell that story about The Office when I almost tweeted how much The Office sucked it or",
            "start": 3530.92
        },
        {
            "text": "I want to make it very clear we talked about hater trolls and everything else on this show before, and I always tell that story about The Office when I almost tweeted how much The Office sucked. It was in the second or last season that it got good in the final season. I don't mean actor or actress; I mean character in a show. You had it, and I will always go back to Jill from Home Improvement, who was a terrible wife and a terrible mother. Jill from Home Improvement was a terrible wife because she lived with the dude who was like this – all he did was guess what? You married him and kept having sex with him. Maybe it's Tim \"The Tool Man\" Taylor; maybe he was just a mechanic when she first met him, and he was a nice guy. Then all of a sudden, the show and now the world's most annoying human being – you live in Detroit, you're on The Howard Stern Show. I would argue that Tim is more annoying than Joe Rogan. No, you're saying he's a millionaire; he gets free stuff all the time.",
            "start": 3577.0
        },
        {
            "text": "the show and now the world's most annoying human being you live in Detroit you're on he's HI I would argue that Tim is more annoying than Joe no you're he's a millionaire he gets free **** all the time she doesn't want he redid the bath I you this free car did the bathroom they had all yeah but he always screws it up like go would flick a freaking light and like a turkey would shoot out of the oven like and then the next episode be fixed because what's his name the dude with the beard didn't do **** Al did everything Al had to come over and fix it I think Jill and Al were banging no had that girl I'm putting that out there no that's not true that's not what it was was annoying she in the very she she always had that voice and like this is the weird thing about Patricia richon doesn't sound like that but she was always like shut up no you think do you think when they had sex and he finish he was like I hope so definitely I would this is how it would sound if I if I were him having sex",
            "start": 3616.12
        },
        {
            "text": "like that but she was always like shut up no you think do you think when they had sex and he finish he was like I hope so definitely I would this is how it would sound if I if I were him having sex H H and he just rolls over that's it you roll over you get sandwich makes you a sandwich and then you get to bed he puts dye in his sandwiches I bet he puts dye in his sandwiches that's the real thing I watched a lot of Home Improvement that's what Jill used to be called couldn't they couldn't catch fish in that episode cuz they used hand cream that had a scent to it and the fish could smell it on stupid how did you get duped by that show I like that show Tim did you watch so much of it it was on after Simpsons on rerun syndication man when we worked in Brisbane Clem and I would go to by the way his name is pronounced Clements everyone I got a couple tweets that like why you guys say the last part of his name why do you put the emphasis in the last part of his name cuz it's Clement yeah Clement",
            "start": 3664.72
        },
        {
            "text": "name is pronounced Clemens everyone I got a couple tweets that like why you guys say the last part of his name why do you put the emphasis in the last part of his name cuz it's Clement yeah Clement it's not CL I we used to go to get like McDonald's or some other lunch when we worked in the Brisbane office and then watch Home Improvement uh every day and that show actually makes me laugh like that show is actually funny show it is like I it authentically is a funny show like like I really it's not like Golden Girls or Seinfeld funny like where it's like really **** funny stop right there are you serious about Golden Girls yes dude Golden Girls is probably one of the best in love with you before this happened but you do know that Golden Girls was like my youth oh I watch Golden Girls every night I used to I used to watch Golden Girls with my mom and now my wife watches Golden Girls and I will sit and I will watch it without dude it's so so well aot first of all a lot of great TV writers",
            "start": 3712.16
        },
        {
            "text": "\"Night, I used to watch Golden Girls with my mom, and now my wife watches Golden Girls. And I will sit and watch it without her. It's so well-written. First of all, a lot of great TV writers got their start on Golden Girls, which I didn't know until recently. Yeah, and that show is really funny - it's really, really well written. It's one of those shows that you just sit back and enjoy, like my wife does. She likes the show so much that she plans for me to die first, naturally. The Taco Bell will do us in, oh God! The incessant late-night podcasting... But when I die, Italian families know - the guy always goes first, the wife lives 20 years later because we're married like Dutch girls and they're super healthy. She wants to live like Golden Girls; she wants to move in with...\"",
            "start": 3746.68
        },
        {
            "text": "you know 20 years later cuz we married like the Dutch girls and they're like super healthy um that was totally I just made that all up she wants to live like Golden Girls she wants to move in with her sister and like some of her friends and live in a big house and like someplace warm and eat cheesecake at night in the in the in the kitchen and just talk to each other and like always wear robes and like flowing things she wants to what a great show that was what a great dude it's so like my favorite part of this and I identified this in college I used to watch it with my friend Abby and we would sit there and I'm like the best part of the show The comedy's well written and the characters are awesome and you should read some of by the way some of the stuff like um the characters were transfixed like the car like Rose Nylund or whatever her name was was actually supposed to be the idiot Betty White was actually supposed to be the the sexy one really and like when they were reading and like",
            "start": 3787.96
        },
        {
            "text": "like the car like Rue McClanahan or whatever her name was was actually supposed to be the idiot Betty White was actually supposed to be the sexy one really and like when they were reading and like there's all these things like it's so funny like you read about it but um I can't even imagine Betty White is the sexy one is the best Betty White used to be hot Betty White used to be hot really yes like even Maureen Stapleton or something like that she was always super funny too so she had that added dimension of like genius um she genius but uh my my favorite the funniest thing and people should pay attention to this they watch Golden Girls It's not Hallmark Channel like every night you should watch it uh it's on right now I guarantee somewhere in the world on dead pan is the best and she does it all the time and they know because they always zoom in on her like when someone makes a joke about her or someone says something funny she's always like looking all serious at him like like She",
            "start": 3822.48
        },
        {
            "text": "it all the time and they know because they always zoom in on her like when someone makes a joke about her or someone says something funny she's always like looking all serious at him like like She **hates** them and that is the comedic Genius of Golden Girl so you know people didn't like her right what do there's a lot of stories from she they were just like like directors would work with her and she would just constantly give them **** well she had a huge she had a huge show mod mhm and she was like a huge star on that show and I think I think Bea Arthur was on that that's her name right like the redhead that I think she was on that show with her and I think that like she had like a big sitcom that she carried for a long time I think it was in the late 70s early '80s and then they went on Golden Girls do all that kind of stuff so probably she probably thought she was kind of like hot **** but you know that show is really special now the answer to the question Greg yeah who you",
            "start": 3859.08
        },
        {
            "text": "on Golden Girls do all that kind of stuff so probably she probably thought she was kind of like hot **** but you know that show is really special now the answer to the question Greg yeah who you ha what character you hate what character I hate and it's is and I got to be honest with it's Urkel like was the worst part of Family Matters, yeah he was part like I loved you know I'm serious about that I I didn't like his sister I like the mom and dad and all I like like their whole kind of dynamic but and Urkel was like really important to the show and like fundamental to the story and stuff he was but he just kind of sucked you know like Urkel kind of sucked. Urkel had the same problem that when he started and he was a side character in the show he was fine and he was funny but then once he hit in the show it reversed to be all about him he got really annoying every episode like all right it almost as bad as Harry with Carl, Carl do you know real quick real that's Harriet saying Carl every episode she",
            "start": 3895.44
        },
        {
            "text": "The GameOverGreggy Show Ep. 32\nshow reverse to be all about him he got really annoying every episode like all right it almost as bad as Harry with Carl Carl do you know real quick real that's Harriet saying Carl every episode she get mad at Carl you know the story about Harriet all right so obviously we know well so obviously she was in a per a perfect stranger she was the elevator operator so that Family Matters a spin-off but do you know like so my God that's right so when they when Family Matters in stepbystep on TGF ABC didn't want them anymore they were going to cancel both these shows you know do you know this no I know that so they sold them to CBS This was in like 1997 1998 now the woman who played Harriet I guess is kind of an OG actress and she wanted to start um directing shows okay episodes of the shows and they wouldn't let her so she just quit so if you watch any of so she wouldn't be on the show anymore so if you watch the CBS season the last season of Family Matters it is just a different mother",
            "start": 3934.84
        },
        {
            "text": "and they wouldn't let her, so she just quit. So if you watch any of the CBS season, the last season of Dallas, it's just a different mother, really. And they never just never acknowledge it. It's so funny. By the way, the other question is we were watching uh we were talking about Step by Step a while ago. Patrick Duffy's great and how that show went on for a really long time and the daughters all got older and it got really hot. Yeah, I was watching on the on the way down to VidCon, it was on the TV or whatever, and they're just so those daughters are just so hot like in like the later seasons. They were just Suzanne Somers was the mother in that right? God, she was good-looking back then. But like when they like when they are like when they're all in like their 20s, Greg, she's 94 years old now. She's not oh yeah they used did you ever think about that like when you were a kid at the same age you're like which one of",
            "start": 3979.28
        },
        {
            "text": "are like when they're all in like their 20s Greg she's 94 years old now she's not oh yeah they used did you ever think about that like when you were a kid at the same age you're like which one of these girls is going to grow up like when you were a kid not now but like when you were like 13 14 were you like did you have the crush knowing that girl was going to grow up and you like had this hope that she would be amazing you'd meet her one day in Hollywood and you guys would get married no I never I wouldn't go that far with it I had a I was always more like man these people are doing way more with their lives at 13 than I am really they're making way more money than I is is it inappropriate to look at someone be like they're going to be really hot no I don't think so cuz that happened that happened recently I don't remember who I was talking about I was talking to one you guys what do you mean by inappropriate I guess no I know I don't know I this probably should just end here okay",
            "start": 4014.2
        },
        {
            "text": "happened recently I don't remember who I was talking about I was talking to one of you guys what do you mean by inappropriate I guess no I know I don't know I think this probably should just end here okay yeah yeah it'll save me the bleeping later later down the road yeah um the thing about the blonde on Step by Step thank you your girlfriend reminds me a lot of her in terms of looks from what I what I what I remember Dana looking like in my head and Dana of course being the also the girl from My Two Dads right yeah that is the girl from My Two Dads so you I think that I think that subconsciously is why you're in love with Cheryl it could be Step by Step I remember how long that all right so you remember this random Step by Step aside in the first season oh they had like this shitty neighbor that they just wrote out and then in the later seasons they brought in Balki from Perfect Strangers yeah like they just did and then they had a daughter like The Brady Bunch",
            "start": 4048.72
        },
        {
            "text": "Neighbor that they like just wrote out and then in the later seasons they brought in Balki from Perfect Strangers, yeah, like they just liked, and then they had a daughter, like, The Brady Bunch style, they were Brady Bunch style kids, and then they or family and then they had like a daughter who then like was suddenly seven years old, yeah, that's a normal thing to happen, yeah, they did the same thing in um in Growing Pains too, yeah, with our friend Ashley Johnson, that's right, um also though now that we're talking about this another person I hate character I hate Mrs. Pool, oh Mrs. Pool from Hogan's Family and then she was also the she played the same character in Hogan's Heroes not Small Wonder, same character name, the neighbor annoying neighbor, she and off she was she was the secretary, she's an awesome actress that's what I'm getting back to on this she seems like a nice person but in these when she's the annoying neighbor she plays it so well she got under my skin nonstop I was",
            "start": 4098.4
        },
        {
            "text": "Secretary she's an awesome actress that's what I'm getting back to on this. She seems like a nice person, but in these when she's the annoying neighbor, she plays it so well. She got on me nonstop; I was like, \"I want her to die.\" What said? She's the secretary. She was the secretary. Like, she liked him; he's a righteous dude. Yeah, yeah. She was Ed McCaffrey, I think her name is. Nailed it! Uh, yeah... I don't know any actresses or actors' names. I know her. I know uh, yeah, Mrs. Pool. Well, dude, I feel like Hogan the Hogan family is just such a special show like that really isn't when that was on. They put that on Fox Family or whatever when I was in college, or The Family Channel, whatever the hell it was called at that point. And I was so stoked; it was only on for like a few months, like one episode at 3:30 in the afternoon, and I go home and watch it every day, and like DVR, \"This is awesome!\" Yeah, I remember watching all these shows in syndication at my grandmother's house.",
            "start": 4142.64
        },
        {
            "text": "one episode at like 3:30 in the afternoon and I go home and watch it every day and like DVR I'm like this is awesome yeah I remember watching all these shows in syndication at my grandmother's or yeah after dinner on Fox and ran all this SC man I never watched the Hogan Family I have no idea what the show is it's so funny cuz like 90% of the shows you guys talk about to me are just Nick at night shows yeah where it's just like you know after all my Rugrats and cartoons and stuff it's like then I get to watch The Facts of Life yeah you take take the fact two two other just OG shows by the way we really should throw out there for people young people like Tim Gettys one of those shows you should watch Newhart is New Heart Is Awesome Newhart's because of him Bob Newhart is a comedian he used to have a show called The Bob Newhart Show then he did a show called Newhart and it was just totally different he was like uh he had like a different family",
            "start": 4186.16
        },
        {
            "text": "of him Bob Newhart is a comedian he used to have a show called The Bob Newhart Show, then he did a show called Newhart and it was just totally different. He was like uh, he had like a different family yeah, he owned an inn in Vermont and like it was just about the inn and it was like so funny. And the last episode of Newhart is spoilers everybody yeah spoilers from Newhart, it was it was it's it happened 30 something years ago now uh, is he the last episode is he wakes up at the end of the episode and he's with his wife from The Bob Newhart Show I love that it and Newhart was a dream uh. The other show is Welcome Back, Kotter which is a genius genius genius show from the 70s now we're getting way off track funny yeah Trolla yeah and we get back on that cuz Horshack's kind of kind of sucks you hated Horatio no I don't hate him you just kind of sucked no one liked Horatio well who do you hate then what character did you not like from one of these shows I'm trying to think come back to me go to Tim first and let",
            "start": 4223.24
        },
        {
            "text": "\"Hate him, you just kind of sucked. No one liked Horatio. Well, who do you hate then? What character did you not like from one of these shows? I'm trying to think. Come back to me. Go to Tim first and let me think. Who do you hate from TV6? You mentioned The Brady Bunch, and that instantly Jan... you know, I like her. Yeah, but the problem with Jan is, and that's the thing I was going to say, Screech. But the problem with hating Screech is that Screech was the character that's written in to make all the other characters look cooler, and so like, you can't hate on him, and you can't hate on Jan because Jan did their job; they made you want to hate this character so you do hate them. So you like the other characters better. I mean, actually, Jan back in the day wasn't that bad. Yes, she was terrible in the movies. They made her out really bad. I love those movies. So when they get married... yeah, yeah, yeah. I was just watching those not too long ago and they were like spoof movies, which is great. You mean the movies.\"",
            "start": 4268.04
        },
        {
            "text": "made her out really bad I love those movies so when they get married yeah yeah yeah I I was just watching those not too long ago and they were like spoof movies which is great you mean the movies from the '90s I'm talk movies in the 90s oh like they did the Brady Bunch like the real movies in the 80s where like they get like there's one movie where Brady Christmas very yeah like when they get married like Jan and Marcia get did you never saw this Jan and they get the original cast back there they're all adults this isn't like the early 80s and Jan and Marcia have a dual wedding and Marcia's marrying like some straight edged dude and Jan or no Marcia's marrying some like crazy dude and Jan's marrying like some straight edge dude and I was watching with Charlene like this sucks like I'm like can she can you change it I'm like no I love this stuff so like it's so weird it's so awkward like Mrs Brady in the beginning calls all the kids to let them know they're getting married Peter's in",
            "start": 4305.56
        },
        {
            "text": "can she can you change it I'm like no I love this stuff so like it's so weird it's so awkward like Mrs Brady in the beginning calls all the kids to let them know they're getting married Peter's in like the Air Force now and uh and like Bobby's at school and college in the dorm room was like a baseball pitcher I'm like this was this wasn't from the ' 80s wasn't this like this was like 1990s no this is like 1981 I'm pretty sure this was after mov I think it was no this is no no this is they did another one that was way later they did they did they did they did multiple movies but Brady Bunch was 65 72 I'm looking it up so this is like 1980 81 and they reunited every few years and they would get fewer and fewer of the original cast um Very Brady Christmas is the last one though and that was that Alice just died recently what was it about the Brady Bunch that we liked the we still like D Jones Davey Jones it's the quintessential American family I feel like it's it's a fusion",
            "start": 4342.36
        },
        {
            "text": "was that Alice just died recently what was it about the Brady Bunch that we liked the we still like David Jones Davy Jones it's the quintessential American family I feel like it's it's a fusion comforting to want it is it's the same reason why uh Leave it to Beaver is so good still because it's just it's wholesome and we don't have that kind of stuff anymore like it really just we never with though it was never reality that's why it's like why when we watch that do we do we need as human beings like that level of perfection I just don't get it it's s together and goes through puberty and yeah and they roller skate together everything together and like the dad oh there a problem and it's not but it's not infidelity or like maybe he's gay it's none of that stuff it's like oh trouble at work oh it's okay he lost the plans oh he did he always lost the oh we forgot Peter forgot the plans come on but but but just real quick you guys were mentioning the Brady Bunch movies like The the ones",
            "start": 4386.12
        },
        {
            "text": "oh it's okay he lost the plans oh he did he always lost the oh we forgot Peter forgot the plans come on but but but just real quick you guys were mentioning the Brady Bunch movies like The ones from the 90s those movies are awesome they are so good I watch them like make me laugh from my belly how pitch those films as like let's just make the Brady like someone was like Brady Bunch modern times that's it that's it I mean they just took the classic story lines and then just made them from 30 minute episodes into just every 3 minutes was a different BR Bunch storyline was it the guy from Office Space yeah he was the dad right isn't that the yes he was the dad in Co right uh Peter let's talk Peter L Lum hell lber what was the name of the oldest son Peter no middle Greg yeah where Greg and Marcia have to share a room she's like getting addressed that was great that was really fun I love I love how they the neighbors make fun of um the one scene I remember so much is like when um",
            "start": 4427.88
        },
        {
            "text": "and Marsha have to share a room she's like getting addressed that was great that was really fun I love I love how they the neighbors make fun of um the one scene I remember so much is like when um the youngest daughter goes to the neighbors to get them the the mail and like they hate the Bradys like they trying to get them to sell and like the one the wife's like an alcoholic whatever and they're just making fun of the way she talks and like they can't understand what she's saying yeah and like she's like she's like there to get the mail or something like this so and and and Mr. Brady going on and on with his tangents like it's I think they're all I'm pretty sure they're all on Netflix they're so good if they're really good they're genius because it really is they don't even try to make it like a joke or a satire at all it's just take the Bradys as they were in 1965 or 68 whatever throw them into the '90s put them into 1995 but no one else is like that no one else is like that just let",
            "start": 4478.24
        },
        {
            "text": "like a joke or a satire at all it's just take the Brady Bunch as they were in 1965 or 68 whatever throw them in the '90s put them into 1995 but no one else is like that no one else is like that just let him exist and it's so genius this is a car jacking I'm not Jack I'm Greg and this is my sister Marcia Mr Brady's getting in trouble at work cuz he keeps designing things that are just the house they live in in a supermarket it's so it's brilliant I love how we're going on and on about yeah I know right this is the Topic's going in a so I'd say I'd say cuz you're supposed to hate her another character that you're supposed to hate is the nanny, Alice Kramden no Sheely hot but the voice she did was not hot it's just like oh my God who was the girl Kimmy Gibbler yeah on Full House hated her on Full House hated her yeah she sucked I love how I love how brutal they were to her too like they would she become an alcoholic or something",
            "start": 4520.08
        },
        {
            "text": "who was the girl Kimmy Gibler yeah on Full House hated her on Full House hated her yeah she sucked I love how I love how brutal they were to her too like they would she become an alcoholic or something I don't I don't know all I know is that they on show it was an episode she was like she was the kid that like messed around with drugs and alcohol and they were like not Kimmy Gibler right and then like they had to have the more you know episode it was from years of abuse from Joey and uncle Jesse just lay on her for all of her life she she walks in it's just two 34 year old men making fun of you for all of your life she took though she took in stride she was she probably went home and cried a little bit but well she was super skinny so my guess was you know and the anorexia or cocaine I was I was coke yeah Coke yeah good for her yeah I don't know how she afforded it but you know these rich kids in these rich what do you mean how she afforded she was on Full House Oh you mean in the in the storyline I was",
            "start": 4567.32
        },
        {
            "text": "yeah good for her yeah I don't know how she afforded it but you know these rich kids in these rich neighborhoods what do you mean how she afforded she was on Full House Oh you mean in the in the storyline I was joking about her character not her actual they also lived in like a beautiful part of San Francisco know the 40 billion mansion that you would have needed to like shell out that much money to live in in San Francisco the kitchen is the size of my apartment I like how nobody ever thought about it too you watch that show and like it doesn't even dawn on you and now that we live here like oh we got duped and that house is on Broderick Street go see the house well no The Painted Ladies are in the beginning but their house like the facade of the house when they're like zooming in the show is on Broderick where is it you should go look at it right now it's like yeah I went that was one of the first things I did it's like 1687 or I don't know but like they planted trees in front of it you can't",
            "start": 4616.4
        },
        {
            "text": "Broad, where is it you should go look at it right now? It's like yeah, I went. That was one of the first things I did. It's like 1687 or I don't know but like they planted trees in front of it. You can't really even tell but people go down there. There's like a whole website that like Tracked Down what house it was whatever. But even if you think about the house, it's like a normal San Francisco house and then you think about the layout of their house back impossible and the the Zordon's Uncle Zordon's house above the garage. No one has houses above the garages in San Francisco. We don't drive here. Yeah Kimmy's probably she was a close second to me. I would say my biggest hatred though is Alpha 5 from Power Rangers. He was Zordon's little assistant, dude. Oh no, UFO head yeah n dude you're supposed to hate him though. You how could you hate him? He was a little punk. Gordon was just a Giant floating head. Gordon shout out to Gordon what was his name? Zordon, Zordon, Gordon hi I'm Gordon welcome",
            "start": 4648.92
        },
        {
            "text": "to hate him though you how could you hate him he was a Little Punk Gordon was just a giant floating head, Gordon - shout out to Gordon what was his name Zordon? Zordon, Gordon hi I'm Gordon welcome to my pizza shop have some Gordons Pizza another head just pops up spelled G it's just spelled Gordon story eventually where he got out he had a body didn't he get a body in one of the movies he had a body the movie he had a body how did that work out it didn't work out well the movie's not really Cannon oh really that's not good what about the show Al did we hate the dad on that? No, the dad was awesome on Al, he was essential he was essential to their whole dynamic I feel like I mean it was like one in a conversation or some maybe we talked too much about just TV told me how Alpha ended I didn't believe you and I had a YouTube video how did it end he gets captured by the authorities",
            "start": 4690.36
        },
        {
            "text": "one you in a conversation or some maybe we talked too much about just TV told me like how Alpha ended I didn't believe you and I had a YouTube how did it end he gets captured by the authorities, he said at gunpoint, he just like they come up on him with like spotlights and he's like and then it was like I think it might have said to be continued and that would be an awesome idea for a show just spoiling the end of all the 80s shows so like cuz I've started doing this right so I I told you guys I was watching Star Trek: Voyager well I got tired of watching Star Trek: Voyager as one does because the show is so overacted and so completely cheesy but it's still pretty good I wanted to see how it ends and so I got the idea, of course, the brilliant idea I'll just watch the season finale and the season premiere of every season and you know you kind of get the gist no matter what like some people partner up someone's pregnant",
            "start": 4737.96
        },
        {
            "text": "idea I'll just watch the season finale and the season premiere of every season and you know you kind of you kind of get the gist no matter what like some people partner up someone's pregnant you're like they're banging it's not a big deal but then I watched the end of it I was like this is super gratifying cuz I didn't have to spend seven seasons there's 162 episodes of that show you have any idea minutes or whatever oh my God it's so long I can't do the math but it's it's unprecedented but now I want to know how Star Trek: The Next Generation ended, because I remember they went from being in a school together, they killed Mrs. Garrett, hit her body well remember Mrs. Garrett then had like a bakery or a sweet shop right then George Clooney worked at yeah that's right yeah how did \"A Fistful of Datas\" end though, that is actually a genius idea we should do that for this video yeah exactly by the way it's like we don't know how to cut you could cut and then make a cut",
            "start": 4774.84
        },
        {
            "text": "right yeah how did Final Fantasy X end though that is actually a genius idea we should do that for this video yeah exactly by the way it's like we don't know how to censor you could bleep and then make a cut but we like to just bleep the full thing so 20 minutes of just a beep um yeah I think Tim let's get on that let's come up with the name let's call it The True Facts of Life: How It Should Have Ended But How It Really Ended how it really how it really ended **** you how it should have ended also how it really ended all right all right good topic Greg good thanks I tried for you it was nice to line it up we we talked about yeah we had some serious hardcore drug abuse and now it's now we're good Tim yes what's your topic so usually I like to talk about really stupid things yep today a little nothing special no different yeah okay but it's a little less stupid okay physical Media or digital media oh that's not stupid at all we're getting we're getting to this point where now everything is",
            "start": 4814.88
        },
        {
            "text": "nothing special no different yeah okay but it's a little less stupid okay physical media or digital media oh that's not stupid at all we're getting we're getting to this point where now everything is digital you can get day one digital you can get all this stuff yeah but you can also buy stuff in stores but more and more you can't buy it in stores you and I are literally on the other side of the table from each other on this point yes I know that and it's so weird because the generational gap should be the flip side right you love blu-rays you collect them you go out and buy them you actually watch the special features on the blu-rays the commentaries all these things you love it I don't want it in my house I don't want it cluttering up my shelf I don't even have shelves I want to be able to stream it wherever I am whenever I am with just one device and that's why I mean I'm totally fine with streaming whatever where ever years 2424 um no but I used to think that way like you",
            "start": 4856.6
        },
        {
            "text": "to stream it wherever I am, whenever I am with just one device, and that's why I mean I'm I'm totally fine with it whenever you are, whatever where years 2424 um no but I no I used to think that way like you know when you especially when you use digital media, you do have and I still love film and I still love all those analog formats um but I came to the conclusion a long time ago that it's it's one of those things that you just similar to sort of like Colin's Kickstarter conversation earlier it's like the more you're sort of you see where it's going to go, you just realize that it's going to be a part of our sort of collective mindset here on out and digital is going is the way like digital distribution for instance especially never going to go away, it's going to be the main distribution path might as well just accept it and move on, you don't have to like it but just accept it and move on right yeah see for me it's interesting because I I like the collecting of it of the physical",
            "start": 4897.64
        },
        {
            "text": "\"Might as well just accept it and move on. You don't have to like it, but just accept it and move on. Right? Yeah, see for me it's interesting because I like collecting of it of the physical stuff - um, whether it's CDs or movies or games or whatever. But in addition to that, I actually do like archiving digital versions of all the things too. I just like knowing that I have the highest quality. Right? Like what we disagree on is the whole streaming thing. I don't like streaming because of the quality - all because it's really bad quality. Which is so funny too, cuz I had never really exposed myself to Blu-rays before until I came over to Alfredo's new place to see it. He was like 'You want to watch Blu-ray?' I'm like 'Sure.' And he put on Predator and I'd never seen Predator on Blu-ray and I was like...and I've seen Predator hundreds of times at this point, you know? Bite-sized pieces - it's been on I watch it a little bit here and there and I I watch it at least once a year just as a...\"",
            "start": 4941.32
        },
        {
            "text": "and I was like, and I've seen Predator hundreds of times at this point, you know. Bite-sized pieces - it's been on, I watch it a little bit here and there, and I, I watch it at least once a year just as a matter of rule. Um, it was amazing; I was like, \"WOW, this quality is insanely good.\" I'm used to it looking way more degraded than this. It opened my mind up yet still no Blu-ray player. What's interesting for me is I buy the Blu-ray but then I like to rip the Blu-rays myself. I like to buy the CDs and rip the CDs myself - just knowing that my digital copy is the best it can possibly be, right? It does take up so much hard drive space, like yeah, but hard drives are cheap as **** nowadays. You had you carry that around with you, and that's my biggest thing, right? Is like what I know I I just long for a day when like Netflix - when I have to when I can subscribe to like three or four different services and I'm willing to pay the money for it because I'm at that point in my life. Um, cheers to being loaded",
            "start": 4982.12
        },
        {
            "text": "when like Netflix when I have to when I can subscribe to like three or four different services and I'm willing to pay the money for it because I'm at that point in my life um cheers to being loaded right bazillion I can afford Netflix I can you know when I was when I was in college or high school I used to steal stuff like I did actually not high school cuz that was before the internet was you but in college I used to download all my music illegally and I download all my programs legally see that's my thing I steal everything but then I buy everything yeah which is so sometimes at the same time like I'll buy a CD from Amazon and I'll download it illegally because I know it's on the way but I still want it but I want be able to make my own copy that's so crazy to me um but yeah but uh I forget what my point was with I don't know where I was going with that I'll pick it up digital only for Greg Miller that's the thing a long time like I used to col and I always talk about that you know",
            "start": 5019.72
        },
        {
            "text": "what my point was with i don't know where i was going with that i'll pick it up digital only for Greg Miller that's the thing a long time like i used to col and i always talk about that you know when DVDs came out we were on the same page even though we didn't know each other we need to have these DVDs we love these DVDs bought so many DVDs what was your first DVD do you remember oh yeah Ghostbusters was the Ghostbusters you never heard the story mine was The Matrix I think first DVD yeah ever bought I think Brat's the movie Jesus **** mine was the replacement killer starring Chow Yun-fat and Mira Sorvino wow how weird is that we you we all had that same run of DVDs you had the Kevin Smith ones you had road trip you had Varsity Blues there's all these goofy ass movies Jerry Seinfeld stand up I had there you go is deal this thing and so my i had all these things and then i realized i never watched them that i had these on my shelf just taking up space and then you move to San Francisco where",
            "start": 5062.08
        },
        {
            "text": "Had there you go, it's a deal. This thing, and so, my I had all these things, and then I realized I never watched them; that I had these on my shelf just taking up space, and then you move to San Francisco where you have no space, and I immediately started getting rid of stuff. I sold a whole bunch of graphic novels when I moved here; I sold this whole bunch of DVDs, and even now there's some DVDs out there that I still have in the shelf that I don't ever plan on watching, but I can't bring myself yet to get rid of them like Superman and Justice League that I know. But like, the thing is, I don't bring anything new in; I haven't bought a DVD or a Blu-ray in forever. The last Blu-ray I bought, I watched it, yeah, love that movie. There's a Missouri shirt in it, Terry Funk's in it; it's got everything you need for high quality. I do have a bad problem of buying them and not watching them, yeah. See, I used to have, and this was a point my wife made when we got married: they start pointing out stuff.",
            "start": 5101.32
        },
        {
            "text": "you need have high quality I do have a bad problem of buying them and not watching them yeah see I used I literally used to have and this was a point my wife when you get married they start pointing things out like this you're like damn it how come I never noticed that before she was like are you aware that you have not one not two but approximately 10 DVDs on your shelf that are still in the cellophane mhm and I'm like yeah keep them there until I'm going to watch them and she's like you're never going to watch those and even the ones that I do buy I never I don't actually like going back and watching something I own again I like catching it randomly out in nature we talked about this before randomly in nature right you know where or it's natural habitat which is either like oh it's on Netflix now check it out check it out or it's on Fox or FX and it's like sped up and cut out parts of it but I just I something about owning something like as amazing as a film I just I don't want to",
            "start": 5141.12
        },
        {
            "text": "Netflix now check it out, or it's on Fox or FX, and it's like sped up and cut out parts of it. But I just something about owning something as amazing as a film, I just don't want to own it, I just want it to kind of come to me when the world wants it to come to me, so to speak, that's so unique, it's really weird, very very interesting. I, all right, so first of all, the Seinfeld stand-up that uh I'm gonna tell you for the last time, funniest quote, Nick, Greg, you might agree, you might disagree, is in the beginning he's like the Tide commercial, if you have blood on your laundry, you have blood on your shirt, laundry might not be your biggest problem right now. I like that one a lot, yeah, uh but uh I forget, is it that one or his his like comeback one which is the one uh? Christine, I always make fun of uh he's driving on the road with a like a couch on top of his car and but he's got his arm over it, he's got don't worry everybody, I've got it, I've got it, I'm using my arm, uh but I",
            "start": 5176.4
        },
        {
            "text": "always make fun of uh he's driving on the road with a like a couch on top of his car and but he's got his arm over it he's got don't worry everybody I've got it I've got it I'm using my arm uh but I feel like I think Tim Gettys is the exception of the rule because he cares about the quality right to me I feel like usually having shelves lined with DVDs or books whatever is a vanity thing and I think we have to like slowly get over that or whatever I feel the same way I have a **** **** ton of books like a metric **** ton of books and like most of them most of them are not even here like I I go to my mom's house and they're just like everywhere I'm like Jesus Christ I have so many books why do I have so many books you know and then a couple years ago a few years ago I started using my Kindle or the Kindle app on my iPad and just I buy books all the time I still read just as much if not more it's cheaper and it's more accessible I I wanted to read a book about",
            "start": 5219.0
        },
        {
            "text": "started using my Kindle, the or the Kindle app on my iPad, and just I buy books all the time. I still read just as much if not more; it's cheaper and it's more accessible. I wanted to read a book about World War I after playing Valiant Hearts, so I just went online, looked up some World War One books. I'm reading a book about The Road to 1914 - 700 pages, paid like $8 for it; it's brand new, downloads to my iPad instantaneously. I'm reading it; it's all backlit; I don't have the light on; it's like it's perfect. It's I have like experience; I actually love reading on my phone now because there's a Kindle app for your phone, which of course has been around forever, but since I discovered things at a snail pace, just discovered and I've been reading non-stop books upon books upon books, comic books Tim introduced me - he's like dude get on Comixology; you can download all these amazing things. I have sales and now I've just like I'm constantly reading which is so much better than what I used",
            "start": 5258.4
        },
        {
            "text": "me he's like dude get on Comixology, like you can download all these amazing things. I've got sales and now I'm just like constantly reading, which is so much better than what I used to be doing, which was just randomly surfing around online and not really ever discovering anything of validity. It's perfect, right? Like we don't have all this clutter anymore. And then I'm having the same problem now that I had with my DVD collection - my DVD collection was great from 1999 to 2003, I had everything right, and then I just stopped. So I had like this DVD collection in stasis, caught in limbo time, till like what year? Till 2003, 'cause I went to college, got busy, and then you stopped. I don't know if I had She's All That, I think probably the last one I bought was like Signs or something - Signs, and And Then...",
            "start": 5294.72
        },
        {
            "text": "That I think probably the last one I bought was like Signs or something, like that. Signs and Andromeda - why would you buy that movie? I have Signs on Blu-ray, children. I love, I love, I love Signs in The Village was my favorite. The Village was actually really good, and someone spoiled the ending of that for me before I saw it, and I was like, \"Oh my God, son of a...\" I never saw it. Some people like it's obvious it would have been a cool movie, uh, but so I'm having the same problem now with my video game collection because you know I have like my GameCube, my PS2, my Xbox collection and then I have like a ridiculously amount of PS3 games right, like on my shelf and then just a few PS4 games. I know slowly I got to get rid of these games because like I'm not going to have that many physical PS4 games and where I have a bunch of digital PS4 games in fact I was thinking about I have like a majority of the PS4 games which is like insane, there's not that many of them but that was I mean that's.",
            "start": 5331.88
        },
        {
            "text": "games and where I have a bunch of digital PS4 games in fact I was thinking about I have like a majority of the PS4 games which is like insane there's not that many of them but that was I mean that's your job right but I'm just saying it's so weird like you're keeping up that well take those and donate them to IGN or something like that maybe Shouldice and have we talked about that before bringing in our PS3 collection just mark them as I mean this is what I would do mark them as yours like put a sticker on just says Greg or whatever just Mark all of them and then give to IGN and that way you know that if you want to get them back you can go the plan the plan Colin and I have kicked around on Beyond before is that we bring in our entire PS3 collection and every episode give away one game to a listener that's awesome we haven't done it we talk a big game about it God forbid when I was like hey guys I can you bring in cool stuff to put in the podcast for and dress it you were like yeah",
            "start": 5370.52
        },
        {
            "text": "listener that's awesome we haven't done it we talk a big game about it God forbid when I was like hey guys I can you bring in cool stuff to put in the podcast for and dress it you were like yeah and you brought in like a picture of yourself drawn with uh cuc which is amazing whoever did that is amazing but yeah bring you want me to bring in my video games and put them on the walls they look awesome right now the room looks awesome did a good job room not like clutter where we could do that uh so that's all I'm saying I feel like it's more of a vanity thing for me like eventually I just want to have clean futuristic look to everything none of this clutter anymore it's the same thing with my book like all the books I have a huge bookshelf in my room of all the books I bought since I've been here so it's like 2007 2011 and again this is just caught in time here's what I will do for you I will loan you my wife you can pretend like you're marrying her you pretend like",
            "start": 5402.92
        },
        {
            "text": "since I've been in here so it's like 2007 2011 and again this is just caught in time here's what I will do for you I will loan you my wife you can pretend like you're marrying her you pretend like you're moving out of this place and she will do this she will sit on your bed and just shake her head of the things that she thinks you should let go all you have to room all you have to do is hold something up and she'll go and you put it in a bag and you take it to Goodwill I I took No I gave my DVDs away when I moved in with my wife I took like four bags of DVDs **** seven bags of books and like all my clothes to the Goodwill actually it was the uh out of the closet on California Street yeah just packed him in my car took him over there moved into with my house and I was like I have nothing and it is liberating and you've seen my place you've been my place Danielle really subscribes to the notion she's like if it's something that we we we don't keep in the house unless we absolutely",
            "start": 5442.8
        },
        {
            "text": "and it is liberating and you've seen my place you've been my place Danielle really subscribes to the notion she's like if it's something that we we we don't keep in the house unless we absolutely need it or absolutely find it beautiful like that is her methodology and you're I find this copy of The Village beautiful but I don't need it right because I go on this two DVD set of Dogma oh man like the hardest one was I had the I think I had the uh Criterion edition of like Armageddon and it was like in a black box with like two DVDs and I never even touched the second DVD but see I have a problem where I love how that looks on a shelf and that might just be the the young Tim me but no see but I'm I'm with you too it looks so good and like I I'm the type of person that I don't just want to buy the Blu-ray I want to make make sure I'm buying the best version of the Blu-ray in the the nicest looking box that looks best next to all my other boxes in that regard I kind of I love",
            "start": 5481.56
        },
        {
            "text": "want to buy the Blu-ray I want to make sure I'm buying the best version of the Blu-ray in the nicest looking box that looks best next to all my other boxes in that regard I kind of love steelbooks, steelbooks are beautiful, those are you have all my Fast and Furious steelbook collection on my desk is awesome it's pretty amazing um but I mean I'm with you though on the whole like I like the look of things and I'm also super drawn to like covers right cuz the movie covers so like you instantly recognize it and it's instantly like it's something you respond to I would I've always wanted a room in my house that's like the guy room that has like the original Star Wars or uh Big Trouble in Little China and just like see you know I I just love that like if that were the cover or something I would definitely want to keep in my house but it just gets to a point where you're like I it is gorgeous especially the one on the top right Colin",
            "start": 5523.08
        },
        {
            "text": "love that, if that were the cover or something I would definitely want to keep in my house but it just gets to a point where you're like I it is gorgeous especially the one on the top right Colin you look amazing he looks a little like a football player or a hockey player um but I just you look at it at the same time and I'm like why am I keeping these things one more thing for me to dust and I'm never going to watch these DVDs I'm never going to get around watching that DVD again it's just not going to replace me, colors I'm never going to watch that movie again see the worst thing for me and this is a true thing that I'm like **** why' I even start this is Disney movies because it's like cuz then you got to buy the C it's only out of the Vault for a limited time they have this game on lock with that the whole Vault thing oh the struggle is real like they that's the thing that they've been doing since the VHS days but now they do it again and again and again and with",
            "start": 5563.44
        },
        {
            "text": "this game on lock with that the whole Vault thing oh the struggle is real like they that's the thing that they've been doing since the VHS days but now they do it again and again and again and with the Blu-rays it's like if you don't get those things when they first come out like and those things never drop in price Disney Blu-rays will always be $30 like just that's just what they are unless you miss the Vault time and then they're 90 dollars yeah you have to buy them on eBay you have to buy them from like other people Edition BR so people start flipping these right now is good cuz it's not it's it's out of the Vault it's going to be hard for you to find it cuz that was from like last year's run you got to stay on top of this **** and it sucks cuz I I spent way too much time doing this and I go to the store with my friends we I buy the **** and I'm I've only missing like I think three total I'm missing Pinocchio Fantasia those are the only ones I can think of you have Fantasia",
            "start": 5600.36
        },
        {
            "text": "go to the store with my friends, we I buy the **** and I'm I've only missing like I think three total I'm missing Pinocchio, Fantasia, those are the only ones I can think of. You have Fantasia, Fantasia is awesome lady, the **** I got that, I got I literally have everything else Little Mermaid, um those are those are like $90 each. What about the one Steamboat Willie? Do you have that? Is that on some Blu-ray but it's crazy they're almost at the point now where every Disney movie, every Disney classic, the one do you even get the ones that are like Chip 'n Dale's Rescue Rangers the movie or something like that The Rescuers, oh yeah whatever that no not The Rescuers but like when they do the random spin-offs the Disney TV shows do you buy those too? Aladdin 3 Jafar needs glasses, yeah King of Thieves which is awesome and Aladdin's not on Blu-ray yet I've never actually seen The Rescuers, we watch it, it's so good, but um they there was a set of the classics that they call the Disney Vault or Disney Treasures, I'm blanking on",
            "start": 5643.88
        },
        {
            "text": "Thieves which is awesome and Aladdin's not on Blu-ray yet I've never actually seen the rest we watch amazing it's so good but um they there was a set of the classics that they call the Walt Disney Classics and there's like 52 of them Frozen was the newest one so I buy those I don't buy so does that mean it's movie that they're actually like this is a this is a Disney movie there are there's a designated set of Disney movies done by Walt Disney Studios proper probably yes I do buy some of the sequels if they were good like The Lion King 2 there's a Lion King 2 and The Lion King one and a half does Brad do the voice for those Matthew Brad hell no no I think he does does he really yeah and for Aladdin Robin Williams did not do the voice of genie in the second one but then he came back for the third yeah that's weird he the reason he didn't do the third or the second was because he said that he would only do the",
            "start": 5688.8
        },
        {
            "text": "did not do the voice of Genie in the second one, but then he came back for the third. Yeah, that's weird. He said he wouldn't do the first movie if they didn't give his character top billing on the poster. I don't know if you guys remember the poster cover of Aladdin, but he's like the biggest part of the thing. Yeah, he's the biggest. He was pissed, but then he was like, well, Aladdin's a big deal. And then there was the Aladdin cartoon that had a crossover with Hercules, and there was an episode where there's a crossover, and that was awesome. Did Steve from Full House do the voice of the main character in Aladdin too? Because he did the voice in the first one, I'm pretty sure. Aladdin stayed throughout one, two, and three, and the cartoon. You probably weren't getting that much work drinking all your water sorry",
            "start": 5732.28
        },
        {
            "text": "in the first he did well it was the same Aladdin I'm pretty sure Aladdin stayed throughout one two and three and the cartoon you probably wasn't getting that much work drinking all your water sorry I no don't worry all right yeah you right there yeah scratching my back that's the GameOverGreggy Show everybody thank you so much for joining us as always if you like the show you can pick it up as an uncut unedited most of the time MP3 at gameovergreggy.bandcamp.com for $1 each and every Friday if you don't think we're worth the dollar we don't think we are either you can wait until the next week when every topic is broken out one by one over on youtube.com/gameovergreggy then you go buy T-shirts at districtlines.com/gameovergreggy like this new Team Fat one it's awesome I like it a lot i've been I've been looking at myself in the mirror a lot I like it a lot looks cool yeah I did a good job it's a window you did a great job thanks is that what it is it's kind of this mirror over mirror",
            "start": 5773.44
        },
        {
            "text": "been I've been looking at myself in the mirror a lot I like it a lot looks cool yeah I did a good job it's a window you did a great job thanks is that what it is it's kind of this mirror over transparent I can see myself as clear as day in it that's that's not hey that mirror at what point does the window become a mirror when it's 100% reflective rather I think that's that's the opacity over there the opacity on that is probably at a 10% right there that's a that's a window and it's only because of the screen behind it that you can't really see through it I can see your screen really needs to be clean you see all the dust on it yeah you can see how Mike left it open all the time and that's what happened what an jerk ladies and gentlemen we'll be back next week until then it's been our pleasure to serve you",
            "start": 5816.24
        }
    ]
}