{
    "id": 3739,
    "video_id": "Nwcc4AXfsP4",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Tim Gettys",
        "Andrea Rene"
    ],
    "title": "Fallout 76 B.E.T.A. Won't Be On Steam - Kinda Funny Games Daily 08.07.18",
    "description": "Get limited-time package for $39.99 at http://omahasteaks.com and type KFGAMES in the search bar.\n\nGet 15% off your first ThirdLove order at http://thirdlove.com/games.\n\nTim and Andrea discuss Fallout 76, the IGN plagiarism controversy, the MGS movie, and more!\n\n00:02:00 - Housekeeping\n What’s Good Games Special LIVE! Episode on Wednesday Aug. 8th at 6:30pm\nTwitch.tv/whatsgoodgames\nYoutube.com/whatsgoodgames\nPresented by PayPal #LevelthePayingField\nSmash Direct 7AM\nThe Roper Report   -\n00:09:50 - FallOut won’t Launch on Steam (Andy Chalk: PCGamer)\n00:14:14 - IGN Allegedly Plagiarized their Dead Cells Review (Boomstick Gaming)\n00:28:36 - OctoPath Traveler Success (Wall Street Journal)\n00:30:30 - Capcom on Sales vs Reviews (Gamespot)\n00:33:10 - MGS Movie Director Gets It Right (Shabana Arif IGN)\n00:38:35 - Superman actor Henry Cavill wants to play Geralt in Netflix's Witcher series (Daniel Krupa IGN)\n00:40:00 - Out today\n Reader mail   -\n00:48:27 - I just got a Switch what games should I play? - Ty Harrington\n00:50:30 - If someone was interested in getting a VR headset today should they wait for the PlayStation 5, or just buy the headset now. On that matter, will the PlayStation 5 even launch with a VR headset, or will PSVR go the way of the vita? - WhyNotPete\n00:53:00 -  - Marc Lopez\n00:56:00 - PvP in Pokémon Go - LukeShot1st\n01:03:50 - Squad Up: Campbell (PS4) - xessentials\n01:04:10 - You‘re Wrong\nTomorrow’s host: Greg and Gary\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1533678221,
    "duration": 4234,
    "transcript_chunks": [
        {
            "text": "[Music] what's up guys welcome to kind of funny games Daily for Tuesday August seventh 2018 got it right today I appreciate your little jingle jangles there Andrea Rene as soon as soon as Kevin goes audio going live you start jiggle jangling you know you got to give the people what they want they've been asking for it and you finally gave it to her I didn't think that it would this microphone would pick it up that that bad yeah it probably didn't but it did enough just to give Kevin a little a little bit of a run for his money you know what I mean I appreciate our coordinated look today we don't talk about this black and white bomber yeah I'm into it I'm into it I feel like I'm a little too high though so I'm gonna yeah there we go that feels right what's up guys I'm Timmy Gettys this is the busy busiest lady in the biz what's good to him so much so much not this drink I'll tell you that yeah so he walked on set ladies and gentlemen with this all proud that he added what is it what",
            "start": 2.17
        },
        {
            "text": "the busy busiest lady in the biz what's good to him so much so much not this drink I'll tell you that yeah so he walked on set ladies and gentlemen with this all proud that he added what is it what kind of akroy so the problem was my brother got me a Trent iced coffee from Starbucks and I appreciate it a lot but I drank most of it during the morning show so I was down to maybe a third of iced coffee I'm like well I need to fill up my drink how else am I gonna need to pee in the middle of a show you know so then I took some orange Lacroix and poured it in and I'm like we'll see how this goes and I took a sip like oh not as bad as I thought now here we are mistakes were made two sips in you're like wait actually this is weird but I guarantee you by the end the show it will be gone is I am a monster of a human being ladies and gentlemen this is kind of funny games daily each and every weekday right here on twitch.tv slash kind of funny games we come to you with all of the video game news",
            "start": 48.87
        },
        {
            "text": "monster of a human being ladies and gentlemen this is kind of funny games daily each and every weekday right here on twitch.tv slash kind of funny games we come to you with all of the video game news that you need to know that's right you can watch it live on Twitch or you can watch it on YouTube whenever you want at youtube.com slash kind of funny games or you can listen to it on podcast services including Spotify by searching for kind of funny games daily on whatever podcast service you decide to listen to a little bit of housekeeping for you what's good games is doing a special live show first time ever live show yeah on Wednesday that's tomorrow tomorrow 6:30 p.m. Pacific time twitch.tv slash what's good game youtube.com slash what's good games as presented by PayPal hashtag level the paying field that's right mention this on the show yesterday and apparently some people on the internet are very upset about this we're gonna be talking about some stats that PayPal has pulled and",
            "start": 90.03
        },
        {
            "text": "paying field that's right mention this on the show yesterday and apparently some people on the internet are very upset about this we're gonna be talking about some stats that PayPal has pulled and some some data and as well as our personal experiences with it so if you are open to that conversation come on by but remember that's just in the back half of the show if you want to come for our commentary analysis and funny stuff which you know what's good games for we're gonna have that for the first like hour and a half of the show so we hope that you join for the whole thing and and get in the chat and leave some comments it'll be great go support him show you show you what's up cap okay what does that mean for us okay no worries we're only three minutes in we can do this all over again all again have a backup record just in case no can we get back on please thank you we just keep going and we can check it later we can do new intro free after ladies and gentlemen we are having some",
            "start": 137.66
        },
        {
            "text": "all again have a backup record just in case no can we get back on please thank you we just keep going and we can check it later we can do new intro free after ladies and gentlemen we are having some technical difficulties today that's what happens the internet man Comcast you know no matter how much money you throw at him it doesn't solve the problems there's still a piece of [ __ ] I hit him so much it's just like there's certain things in life that I feel should just be figured out internets one of them printers are another one of them mm-hmm you know refilling a cup without having to actually refill it yourself I don't know why someone hasn't figured that out I just want unlimited liquids at all times you know about getting a like some type of fountain drink system that's just in the desc so that I never to leave and also underneath the desk like a mini fridge and I was gonna go toilet but oh oh come on it's for you know it's that you drinking pee is the recycling well though",
            "start": 187.04
        },
        {
            "text": "the desc so that I never to leave and also underneath the desk like a mini fridge and I was gonna go toilet but oh oh come on it's for you know it's that you drinking pee is the recycling well though recycle don't recycle it you could seamlessly go to the bathroom without breaking in conversation hundred percent hundred percent and to be clear you know in on the conversation you feel like you can you what was the question you could you'll see go to the bathroom without breaking right so he Tim was proposing that there's be some kind of toilet on set so he doesn't have to get up and leave Oh Tim could easily do that maybe you don't understand this but that's why God invented the urinal at bars then guys don't have to stop talking while they can keep it ball they can pee the big question is can you can you poop without without brain I want to go there we don't say the p-word on kind of funny games daily Nick okay rigmarole morning she say I'll say it in a different language and I'll say",
            "start": 236.54
        },
        {
            "text": "can you can you poop without without brain I want to go there we don't say the p-word on kind of funny games daily Nick okay rigmarole morning she say I'll say it in a different language and I'll say it in Spanish dia caca oh my god caca no see it I was about to say before Nick gotten wrong I was gonna go there so fast but like obviously I'm not talking about for that I'm talking about just the liquids cuz liquids are less of a - do you know what he means the whole thing is just yeah how we look every couple things that you guys should know about me one day my wife watched the movie my maid she actually wanted to and I was like this you're not gonna enjoy this the movie stealth mmm-hmm starring Jamie Foxx and Jennifer Biel Jessica Biel's Jessica Biel's now that brought in a very interesting question of how do you fighter pilots go to the bathroom while they're in the air and that's very interesting for guys they pee into a bag that has like a some sort of like powder in its a mix of",
            "start": 285.59
        },
        {
            "text": "question of how do you fighter pilots go to the bathroom while they're in the air and that's very interesting for guys they pee into a bag that has like a some sort of like powder in its a mix of gelatin for women y'all have to just wear it depends unfortunately and that sucks because there's no way to get it out now I don't know what the second part of that was but I just want that was the other thing the second question was do you think that we are literally making you dumber every time you come into this office I think so are we are we good to go on the show okay we're double recording all that thank you very much I love you all very much more housekeeping tomorrow at 7 a.m. Pacific time we're gonna be doing the super smash brothers direct livestream reactions I don't know who's gonna be on it I'm gonna be on it for damn sure very excited about it cannot wait to see what they do I hope to see some of you there I guess 7 a.m. is only really bad for Austin like the Hawaii people",
            "start": 340.16
        },
        {
            "text": "be on it I'm gonna be on it for damn sure very excited about it cannot wait to see what they do I hope to see some of you there I guess 7 a.m. is only really bad for Austin like the Hawaii people otherwise it's like 10:00 a.m. you that's pretty cool you know Tim somebody wrote into kind of finding calm /k fgd about this exact thing professor woke says what's blipping good kind of funny I wanted to ride in with a minor correction with potentially significant implications to yesterday's discussion yesterday Tim said that he found it interesting that a Nintendo Direct will be at 7:00 a.m. Pacific time which is quote perfect for Japan time and that he wouldn't be expecting any third-party Western characters and announcements 7:00 a.m. Pacific time is actually 11 p.m. in Japan on the same calendar date so unless it is conventional for a Nintendo to hold the directs at the 11th hour pun totally intended this is probably not a good time for a Japan centric audience furthermore 7 a.m. Pacific",
            "start": 386.63
        },
        {
            "text": "date so unless it is conventional for a Nintendo to hold the directs at the 11th hour pun totally intended this is probably not a good time for a Japan centric audience furthermore 7 a.m. Pacific times of course 10:00 a.m. Eastern Time both perfect and conventional press release times for a u.s. western-centric audience with that in mind how would you adjust your expectations regarding this particular Nintendo Direct if it were in fact targeted at a u.s. Western audience could smash Ultimates distinctive feature be the introduction of third-party questing characters and worlds thanks for all the awesome content from kind of funny what's good games and hot live in a John here's the thing yeah that was great that was really good that was real good I hope that it means that it's opening the world to all those things because that would be fantastic a couple things to keep in mind Nintendo of America based on West Coast and traditionally does not follow the kind of East Coast time PR you",
            "start": 429.8
        },
        {
            "text": "world to all those things because that would be fantastic a couple things to keep in mind Nintendo of America based on West Coast and traditionally does not follow the kind of East Coast time PR you like they really do favor weirdly enough like that 2 p.m. time slot is such a big fan of time so I'm gonna look up when this this smash announcement came in this mash press release was during evo so that that's a little unfair okay but again it doesn't matter that was still West Coast what it was 133 p.m. so uh yeah so during yeah exactly but again during evo so it's a little weird but Professor woke was his name you were you are correct it said when I said perfect I should not have said that if I'm being honest with you I didn't do the actual time conversion I just looked to see that and I I somebody didn't you're wrong us now well here's what's interesting though I'm not wrong I'm not wrong and here's why the director matsuhiro Sakurai him self said he tweeted out there's gonna be",
            "start": 468.98
        },
        {
            "text": "I I somebody didn't you're wrong us now well here's what's interesting though I'm not wrong I'm not wrong and here's why the director matsuhiro Sakurai him self said he tweeted out there's gonna be another direct and I'll try my best it's scheduled at a manageable time for Japanese viewers so please watch my eyes might appear a little red but I'm just tired so it's like he himself is being like hey Japan watch this and that's what I was jumping off with that ok perfect time maybe not but manageable manageable yeah he's do you think about if they move it up to 9 p.m. then it's now 5:00 a.m. on the west coast mm-hmm which is like gross it is gross 7:00 a.m. come on thank you guys for your patience with this show we're gonna get that we're gonna get in we're gonna make this all work finally is brought to you by third love and all my steaks we'll get to that later a little bit I forgot is you can be part of this show by going to kind of funny calm /k f GD to write new questions or kind of",
            "start": 522.65
        },
        {
            "text": "brought to you by third love and all my steaks we'll get to that later a little bit I forgot is you can be part of this show by going to kind of funny calm /k f GD to write new questions or kind of funny comm slash you're wrong to let us know we got what we get wrong like my boy professor woke did I appreciate you very much but first off let's get into what is and forever will be the rover report we got six stories today first off couple fall out seventy six stories fall up 76 won't launch on Steam this comes from Andy chalk at PC gamer the fall of 76 beta FAQ states beta that's a fallout style acronym for a break in early test application and the game will be available on Xbox one ps4 and on PC via Bethesda net only the follow music's purchase page also bears only a generic PC game logo with no mention of steam and today but des des confirmed that neither the beta nor the full game will be released on the platform the PC version of followed 76 for both the be ETA and the launch will",
            "start": 572.46
        },
        {
            "text": "with no mention of steam and today but des des confirmed that neither the beta nor the full game will be released on the platform the PC version of followed 76 for both the be ETA and the launch will be available only via Bethesda net and not on steam but des des rep set an email quote I'll current plan for the be ETA is it will be the full game and all your progress is saved for launch that's awesome the beta will also not be under NDA although that was previously known but it takes on an increased significance if the beta build is actually the full game the Valen 76 beta test is set to begin sometime in October everyone pre-orders the game will be invited to take part that's exciting and completely unexpected yeah especially if this game is four times the size of fallout 4 that's a massive beta I wonder if there will be invisible walls anywhere I mean it makes it sound like there's not like from what they're saying is it's the the final game you just imagine that part of the",
            "start": 632.16
        },
        {
            "text": "a massive beta I wonder if there will be invisible walls anywhere I mean it makes it sound like there's not like from what they're saying is it's the the final game you just imagine that part of the narrative they wouldn't want to block though because that would be such terrible spoiler territory if you allowed people to look at like end game narrative stuff ahead of launch right I mean from everything they've shown in this game it seems like it's not necessarily going to be that narrative heavy and it's gonna be kind of like an ongoing plan to just keep supporting this game and keep adding stuff as it goes so to me this actually kind of makes a lot of sense and like I don't think too many developers can pull this off but Bethesda is probably one of the only ones that can and I also think that this gives them a leg up like the beta is super important and especially for a game like this because not that they haven't done games like this before but this is definitely the first step for",
            "start": 676.76
        },
        {
            "text": "that this gives them a leg up like the beta is super important and especially for a game like this because not that they haven't done games like this before but this is definitely the first step for the Fallout franchise in this type of category and I think it's a really interesting ballsy move for them to commit to this and I also think it's interesting to not be on Steam this goes back to what we were talking about yesterday that's wild with the the Android app that the fortnight's situation where it's like yeah why have to go through this other system when you have your own place to kind of push something and especially for the for the beta like why wouldn't you just push to but that's the net and really try to own that and stress test the [ __ ] out of that so that in the future maybe all games will but those things will only be available there on PC and that would be a very good thing for them to do but it would limit their reach because steam is kind of the default of fact oh",
            "start": 719.51
        },
        {
            "text": "all games will but those things will only be available there on PC and that would be a very good thing for them to do but it would limit their reach because steam is kind of the default of fact oh those four games on PC true but I think that you know Steam has had no I mean monopoly is probably a strong word obviously there's still a lot of people out there who are supporting you know GOG calm and a variety of other sources of places to buy PC games but I mean they are clearly like the king of the mountain there right so I would be I would be curious to talk to when Pete Hines about this decision and why Bethesda has made it and what implications for future releases it means yeah you know I want to give it up to Bethesda because they don't always get it right but I like that they seem to always be experimenting with the industry and with how they not only distribute their games but how they control the media and I know that that's been a very like contentious subject but for them to",
            "start": 763.43
        },
        {
            "text": "always be experimenting with the industry and with how they not only distribute their games but how they control the media and I know that that's been a very like contentious subject but for them to try different different things I think is interesting and it's important for people to kind of test the waters and see what makes the most sense because games I feel are evolving at a more rapid pace than we've ever seen before back in the day was so much more contingent on the graphic quality and it's like you would compare ps1 to ps2 and talk so much about the graphics and how big the worlds are now it's way more about expanding genres and expanding how games can interact with people and getting more people involved with each other and being these ongoing things with patches and DLC and all this stuff and it's I hats off to them for trying that's what the very least heck yeah second news story a little less fun IGN allegedly plagiarized their dead cells review this comes from boomstick",
            "start": 816.59
        },
        {
            "text": "this stuff and it's I hats off to them for trying that's what the very least heck yeah second news story a little less fun IGN allegedly plagiarized their dead cells review this comes from boomstick gaming IGN dead cells review if you if you go currently there now there's an editor's note that says as a group of writers and creators who value our own work and that of others in the field the editorial staff of IGN takes plagiarism very seriously in light of concerns that been raised about our dead cells review we've removed it for the time being and our investigating so IGN is straight up taking the review down both on youtube i GN all the other video platforms it's on and has a written article itself on IGN because boomstick gaming a semi popular youtube channel on on youtube put out a review of dead cells a week ago before the embargo for normal media put up putting up reviews but it was okay because it was based on the early access version that was available on Steam and IGN's",
            "start": 861.47
        },
        {
            "text": "a review of dead cells a week ago before the embargo for normal media put up putting up reviews but it was okay because it was based on the early access version that was available on Steam and IGN's review is shockingly close to the original boomstick gaming review I'll read a couple excerpts of it so you can decide yourself what you feel about this boomstick gave me since dead cells only falters slightly with some repetition setting in especially on the early areas in during longer play sessions whereas IGN says dead cells does falter slightly with some repetition but it's only felt in its earlier areas and during extended play sessions boomstick says dead cells figures out an intriguing way to have your roguelike and Metroidvania experience all in one by focusing on your failures and encouraging you to try something new the next time and IGN says dead cells strikes a perfect and engaging balance between the metroidvania and roguelike experiences but focusing on your failures and",
            "start": 909.02
        },
        {
            "text": "encouraging you to try something new the next time and IGN says dead cells strikes a perfect and engaging balance between the metroidvania and roguelike experiences but focusing on your failures and urging you to experiment every time you do fail there are many many more examples like this within the four-minute review video that IGN has in the four minute review video that rooms to gaming has the structure is very similar and if it's not word-for-word it is definitely kind of format by format I mean this is like this is definitely some Melania Trump and Michelle Obama stuff happening here for where sugar so he went to read it and said what do I do about this you know the guy who made the review and there is a side by side video comparison if you want to watch it all for yourself and some other people have already you know weighed in on the issue people like Jim sterling and a bunch of other people and a lot of you wrote in to cave GD about this but we did pull just a couple of your",
            "start": 958.61
        },
        {
            "text": "other people have already you know weighed in on the issue people like Jim sterling and a bunch of other people and a lot of you wrote in to cave GD about this but we did pull just a couple of your questions since a lot of them were very similar dr funder says hey tim and andrea in the recent weeks there's been a significant amount of discussion between some games media and gamers about the lack of new thought in opinions in games journalism and how much of it revolves around the same few talking points while i don't necessarily agree with the sentiment i bring this up because of the controversy yesterday between IGN and boom said gaming and their debt sales review do you think that this was a case of plagiarism or just a coincidence because much of game reviewing does center around the same talking points do youtubers such as yourself now have to be hyper-vigilant for larger game media organizations copying their ideas or do larger sites such as IGN have to search out a larger",
            "start": 1001.63
        },
        {
            "text": "the same talking points do youtubers such as yourself now have to be hyper-vigilant for larger game media organizations copying their ideas or do larger sites such as IGN have to search out a larger diversity of thought and opinions when it comes to game reviews thanks guys and have a great Tuesday there's a lot there to dissect um I think that a lot of that does need to be addressed and it is one of those things where yeah everybody needs to be aware of work that they do and like I feel like the gut reaction I had personally to this is when I saw it I was like I want to believe this isn't true you know so then I looked at I started listening to and I'm like all right like they're similar but they're not that similar and I did have that gut reaction being somebody that's been in the industry for a while of like I've read so many PR like just press releases of video games and I've seen the review sheets that people give and they are using a lot of similar words and similar phrases to",
            "start": 1040.3
        },
        {
            "text": "for a while of like I've read so many PR like just press releases of video games and I've seen the review sheets that people give and they are using a lot of similar words and similar phrases to the things being said and when you're describing and reviewing a video game like dead cells that is a Metroidvania game that is a row glide all the stuff those words are going to be used so I was like okay like this could just be a coincidence but then as it goes on it just becomes more and more clear that it's like no it's things like specific words being used and formatting and things that I'm like these ideas are not so unique like they are not sorry the opposite of unique they're not so general it's like these are very unique statements being made right um so I mean personally I find it very hard to believe that this was not a case of plagiarism I do think that IGN handled this extremely we're extremely well so far as of recording this now Tuesday morning the day after this happened they",
            "start": 1085.1
        },
        {
            "text": "hard to believe that this was not a case of plagiarism I do think that IGN handled this extremely we're extremely well so far as of recording this now Tuesday morning the day after this happened they still haven't put out a follow-up response Phillip hasn't put out a any response at all I'm sure they're still working it out with legal and HR right so Dan Stapleton got into the reddit thread immediately it was like hey we see this or on top of it you know we're not making any excuses we just can't comment because we need to find out what happened and get to the bottom of it and a company as large as if Davis of course can't just like throw out a statement they need to make sure it's you know the right statement to make it's really it's really kind of disappointing I am going to be the first to admit as somebody who wrote video game news and still writes it for a very long time I mean it's easy to just you know paraphrase press releases but that's me just regurgitating what the",
            "start": 1133.49
        },
        {
            "text": "the first to admit as somebody who wrote video game news and still writes it for a very long time I mean it's easy to just you know paraphrase press releases but that's me just regurgitating what the publisher has said like if I get a press release from Ubisoft about the new rainbow ceej dlc i'm gonna use a lot of their language to make sure I get the facts right but this is not that this is a review this is supposed to be independent critical thought that's the whole purpose of a review yeah and as the number one video games website ign.com they have more of an obligation to get it right then some of these smaller sites do not to say that people shouldn't have personal responsibility no matter how big your site is whether you're a brand new independent gamer and you only have five followers or you have 5 million followers you should do your due diligence to make sure that you're having your own original content but it's really kind of a bummer that IGN let this slip by and well see",
            "start": 1181.85
        },
        {
            "text": "or you have 5 million followers you should do your due diligence to make sure that you're having your own original content but it's really kind of a bummer that IGN let this slip by and well see here's my thing is I I don't feel like I Gian let it slip on I think that I am taking it down immediately is I mean like we're not letting this lip off know what it got it got published though right but like it's tough particularly with video content there are lots of tools that can like troll internet pages for plagiarism in texts like those are resources that are available but unless somebody's transcribing and providing captions for their video it's a little bit harder to do see I don't buy that because even if they were to transcribe or like to do all that this wouldn't be fly it's not like it is word-for-word it's different enough that it's but those tools like teachers use these tools right if you have a certain amount of words that match over like a certain percentage is when it gets",
            "start": 1227.54
        },
        {
            "text": "it is word-for-word it's different enough that it's but those tools like teachers use these tools right if you have a certain amount of words that match over like a certain percentage is when it gets when it gets flagged my argument with that is I feel like any review of dead cells would then get flagged because there a lot of the words the things that would get flagged from that type of system would all be the same it's the formatting it's the yeah the order of things are put and it's all of that and it's like because everybody went to college they know how to pluck and play the Turnitin system or at least I did I don't know but wouldn't it I feel like I Jan is in such a shitty spot right here because the IGN is not one person it is a bunch of different people and for one person to make a mistake and [ __ ] this up it affects everybody and I I'm happy that this seems like the type of situation that there could be a very clear way and to find evidence that he is guilty of doing this",
            "start": 1274.61
        },
        {
            "text": "a mistake and [ __ ] this up it affects everybody and I I'm happy that this seems like the type of situation that there could be a very clear way and to find evidence that he is guilty of doing this because if you just look back through the his work computer on internet searches did he look at this other guy's video like there's ways to find it to be like yeah undeniably that's a thing then but there's other ways that maybe he did it on a personal laptop or maybe there's some other stuff that we won't be able to find actual evidence of it well I hope he would be honest with his employer about what happened lutely because it's going to forever smear his reputation and I'm with you that I think it's important to not have a mob mentality about this already in that reddit thread there's tons of people who are just lobbying just like the most ridiculous insults at IGN as an organization because of one employee and that one employee does not speak for the entire brand does not speak for",
            "start": 1321.59
        },
        {
            "text": "of people who are just lobbying just like the most ridiculous insults at IGN as an organization because of one employee and that one employee does not speak for the entire brand does not speak for every person that works at that site and I would hope people would take a moment take a breath to think about what you're saying and what the situation is before just saying really toxic or hateful things jason Schreyer was in the reset IRA thread I'm talking about all of this stuff and he was just like hey like something to keep in mind is to not vilify the game media outlets because they do not represent one person they are a bunch of different people that over years change and things happen and people are let go for bad things that they do and this and that like they and you go forward and I feel like i GN typically handles these things well there was a bunch of situations where they didn't and there's gonna be a bunch of situations that they do and don't but they are trying and I feel",
            "start": 1371.12
        },
        {
            "text": "I feel like i GN typically handles these things well there was a bunch of situations where they didn't and there's gonna be a bunch of situations that they do and don't but they are trying and I feel like where we're at now seeing them put up this statement that is the best foot forward that they can possibly put I I don't see this ending well for Phillip at all I've you know I don't know him too well we've done things together and like he's always been great to me having said that though it's like this is in my opinion the type of thing that you don't you don't get a second chance for like you represent IGN and IGN specifically for news and reviews that is their bread and butter and you are representing them and this is now going to affect so many other people that are trying their best and are never going to hear the end of this the rest of their careers back when I worked at IGN I had to deal with the mistakes that other people made because I'd have to see people and forever it",
            "start": 1417.44
        },
        {
            "text": "and are never going to hear the end of this the rest of their careers back when I worked at IGN I had to deal with the mistakes that other people made because I'd have to see people and forever it would be like too much water and not to say that was a mistake that wasn't a mistake but it's like you know anytime that there's like I Jing gets me methide so quickly and horizons paid off I didn't like all this [ __ ] that's not true but then all the people that are doing great work have to deal with all of that you know if fox mccloud Roden says i'm not here to ask if you believe he's guilty of plagiarism or not i want to know your opinion on how this event changes the perception the fans have of IGN and on plagiarism in general does the mere accusation of plagiarism hurt the site's credibility enough to where fans can't fully trust IGN anymore if so what would I Gaea need to do to recover their image live you guys and hope you guys make it to the lylat system one day for a meeting great",
            "start": 1464.6
        },
        {
            "text": "enough to where fans can't fully trust IGN anymore if so what would I Gaea need to do to recover their image live you guys and hope you guys make it to the lylat system one day for a meeting great that's funny here's my perspective on this I think it does obviously affect how people see IGN I don't think it affects how the but this isn't gonna stop people from looking at IGN reviews it's not gonna stop my chin from being number one it's not even gonna take him down a peg they the majority of IGN viewers are people that come from Google because they're searching for call of duty review halo review Madden review whatever it is maybe no Madden but uh these like big games are like you know best switch games best ps4 games and like they get in from Google there are a ton of people to visit IGN date that on the day to day that know the personalities that know all the people and unfortunately I feel like this type of situation affects those people most it affects the people that are on",
            "start": 1505.14
        },
        {
            "text": "IGN date that on the day to day that know the personalities that know all the people and unfortunately I feel like this type of situation affects those people most it affects the people that are on recent it affects the people that write in to kind of funny games daily where they are gonna be tarnished and they are gonna think about IGN negatively from all of this stuff and there's with that those are the people with opinions and with that it gets to be a dangerous situation because they'll act and as we've seen on the internet usually if you have something nice to say you're not gonna go out and tell somebody it when you have something mean to say you're gonna go do it and that's why I do not I'm so sorry for pear and all them over there that need to deal with this now because I'm sure that there Twitter mentions are just going to be a cesspool of hate yeah when I know that they're working their hardest to figure this out and make things right because they do care they care so much",
            "start": 1554.43
        },
        {
            "text": "that there Twitter mentions are just going to be a cesspool of hate yeah when I know that they're working their hardest to figure this out and make things right because they do care they care so much about their credibility and for how many times have people said all ideas paid off this or that or GameSpot's paid off or this person's paid off and it's like where's the evidence of this you know where where are we seeing that happen we're not yeah I I think it's also interesting with IGN that they had a plagiarism issue a couple years ago like two years ago on the video side at e3 I guess it was last year where someone from IGN UK that I don't know personally made a video that was ridiculously similar to Steven septic from sugar pine sevens style of video right when that was getting really famous and I remember looking that and being extremely offended because I like was so proud of what Steven created with this with this style and to see them at that moment of inception of it like",
            "start": 1596.46
        },
        {
            "text": "famous and I remember looking that and being extremely offended because I like was so proud of what Steven created with this with this style and to see them at that moment of inception of it like blowing up to see a big company like IGN run that video nothing you're still up to this day and I personally do not think I didn't handle that correctly but there is a big difference because hydrogen isn't known for comedy videos still still plagiarism and they should not have [ __ ] done that but there's a the stakes are so much higher when it's reviews and when it's news because that is the credibility IGN is known for and that stuff needs to be handled in a very different way where you can't just sweep this under the rug like there needs to be real a real series of events that happen on that prove that this is being looked into and proven one way or another well I mean their Metacritic status could be at risk if it's found that they have multiple reviews that have been plagiarized right",
            "start": 1643.59
        },
        {
            "text": "prove that this is being looked into and proven one way or another well I mean their Metacritic status could be at risk if it's found that they have multiple reviews that have been plagiarized right and being on Metacritic is incredibly important for four major sites for any site because it gives you almost carte blanche access to almost review code anywhere yeah and it's going to be interesting to see how this plays out I have no doubt that they're gonna handle it the right way like you already said and just to echo that that there's a great management staff over there they have you know really great leadership and I think that it's going to come out that they are going to make the right call I have faith yeah me too and I really hope they do third-story octa bath traveler is a huge success this comes from The Wall Street Journal Wall Street Journal reporter Takahashi Mochizuki was at a square-enix earnings conference today and tweeted a couple things that he thought he had",
            "start": 1687.84
        },
        {
            "text": "huge success this comes from The Wall Street Journal Wall Street Journal reporter Takahashi Mochizuki was at a square-enix earnings conference today and tweeted a couple things that he thought he had translated from interview he did sales are stronger than the firm's pre-sales forecast and they exceeded expectation expectation especially in the US and Europe there's a higher than average ratio of download version versus packaged interesting and when asked on the analysis on the success of it they said that there's more appreciation to JRPG in recent years and the game design that appeals to old square-enix game fans new elements including HD 2d attractive characters and etc are all contributing to that what asked if you still think the switch is a good platform for middle range games they said yes and when asked when can we expect more of similar games from you they said yes and on what platforms off two paths to switch exclusive but where appropriate for forthcoming ones this is hot",
            "start": 1731.55
        },
        {
            "text": "said yes and when asked when can we expect more of similar games from you they said yes and on what platforms off two paths to switch exclusive but where appropriate for forthcoming ones this is hot up the heels of octave path travelers selling over a million units which is a huge success for guys did the switch so doing well I'm really excited about this news you know I hope that there's more games done not only in that art style but in that type of game and I'm happy that not everything needs to be this giant triple-a or this indie but there is room for a game I talked about traveler that is somewhere in the middle yeah absolutely and this seems like a game that would be perfect on ps4 since that is also a big home to a lot of JRPGs so I would be surprised if squared wasn't looking at ps4 as a potential future platform for this game and not to say that you know JRPGs don't exist on Xbox but I mean historically yeah it's been you know PlayStation has just had more of them um but yeah",
            "start": 1780.6
        },
        {
            "text": "as a potential future platform for this game and not to say that you know JRPGs don't exist on Xbox but I mean historically yeah it's been you know PlayStation has just had more of them um but yeah good job and more news kind of similar that as is from GameSpot Capcom on sales vs. reviews despite a much better critical reception Resident Evil 7 didn't quite match the financial success of its predecessor residence 6 Capcom says it's comfortable with that though since artistry counts for more and they would for a battle better critical reception at the cost of some sales quote while we have shareholders to appease it's not just about commercial performance Capcom Europe CEO Stuart Turner told game industry top is there's an artistic element that always comes in where we know this is the right way and while if we compare re $7 six the absolute numbers are not the same in terms of the profitability it's completely fine it ticked all it took all of our boxes internally it was really well",
            "start": 1831.21
        },
        {
            "text": "way and while if we compare re $7 six the absolute numbers are not the same in terms of the profitability it's completely fine it ticked all it took all of our boxes internally it was really well received and in some respects getting some very good review scores counts as much for Capcom it's a game that sells millions and millions and millions we'd prefer a game that got an ID and sold less than then got a six put salt more well let's focus on day one sales these days - we're looking much more at the long term in the case of that and in that case re 7 is performing amazingly said Capcom's Antoine Milan even now after almost two years it's still the VR flagship title that helps the game selling well I love their saying this I don't know that is fully true but good for them coming out there I do think it helps that Resident Evil 7 was followed up the following year with monster hunter world becomes bike you know the best-selling and all that but I do think that just despite me being a",
            "start": 1878.23
        },
        {
            "text": "I do think it helps that Resident Evil 7 was followed up the following year with monster hunter world becomes bike you know the best-selling and all that but I do think that just despite me being a little pessimistic about it they're proving me wrong with Resident Evil 2 remake like they're going through with we're gonna give the people what they want even if the people aren't as big a group as they know they can get with a more action-oriented Resident Evil game it's the right call because you know that we've seen them kind of struggle over the last five years with their tentpole releases and they have of course had a couple of stand-up hits obviously Monster Hunter World earlier this year doing fantastic and then winning best of show at e3 for a Resident Evil 2 I'm glad to see that they kind of are hitting their stride again as a as a developer and a publisher really looking forward to what they're going to do in the future and how they're gonna expand their roster but I think this",
            "start": 1922.09
        },
        {
            "text": "kind of are hitting their stride again as a as a developer and a publisher really looking forward to what they're going to do in the future and how they're gonna expand their roster but I think this is the right way to do it right like focus on games that are maybe not as wide of a reach and doing them really well and if they are a smaller footprint that's okay that will help lay the foundation to get games that have a bigger footprint later on mmm-hmm I think it's awesome I cannot wait for remake - and I love Dresden evil seven so the more that stuff and better for me v news story this comes from Shabana Arif at IGN the middle of your solid movie director is getting things right and I'm gonna read a lot of this actually because there's a lot of quotes that I think are really important Metal Gear Solid director Jordan Voight Robert says the film is a different approach to a videogame movie and will be made to reflect today Okajima approach to storytelling in an interview with Collider",
            "start": 1971.14
        },
        {
            "text": "Gear Solid director Jordan Voight Robert says the film is a different approach to a videogame movie and will be made to reflect today Okajima approach to storytelling in an interview with Collider Jordan says that he wants to make a film adaptation of Metal Gear Solid that appeals to quote the hardcore fans of the series will also make a general audience fall in love with it quote even if I wasn't involved in this movie I would read the script and say holy [ __ ] it represents a different approach to a videogame movie it represents a different approach to how a three-act structure is put on string on screen as well as snake and Big Boss Voight Roberts plans to expand the cast with a number of other characters saying that these two figure heads of the franchise to find themselves based on the relationships of the people around them so much the game ends up being the tragedy that these characters experienced you have a boss fight and instead of feeling like you accomplished something",
            "start": 2019.33
        },
        {
            "text": "the relationships of the people around them so much the game ends up being the tragedy that these characters experienced you have a boss fight and instead of feeling like you accomplished something you feel a sense of loss which is such a unique Metal Gear feeling so it's important that those characters are surrounded by a roster of people so are finding exact so what so we're finding the exact right amount of people where we can introduce enough of them where it feels were bust where we can define snake or boss through these characters but not enough to get lost he also wants the threat of mutually assured destruction and the fear of nuclear war to be at the forefront of the film adding that a lot of work has been done to make the metal gears themselves relevant in a very cool way talking about a potential r-rating Voight Robert still wants to keep the cost down someone it's about doing it for a price so you can make the riskier balls-to-the-wall Kojima song version of it the",
            "start": 2055.36
        },
        {
            "text": "talking about a potential r-rating Voight Robert still wants to keep the cost down someone it's about doing it for a price so you can make the riskier balls-to-the-wall Kojima song version of it the director is keen to make a film that touches people the same way the game affected its audience stressing that he will be fighting to make the vet the best version of it on screen because he believes it's a world that people are ready to see I'm all about that this interview the concept art that we've seen my god get this man of budgets that's all that we need and it's not gonna happen and that is the saddest reality to this the only thing that gives me hope is that movies like Deadpool and Logan have proved that there is an audience worth investing in for r-rated movies based on properties like this that need that R rating to get it right you know and it's obvious that he cares deeply about this franchise and for as convoluted and crazy as the the story is I think that is part of the",
            "start": 2090.04
        },
        {
            "text": "like this that need that R rating to get it right you know and it's obvious that he cares deeply about this franchise and for as convoluted and crazy as the the story is I think that is part of the charm and I feel like with everything he's saying here you can take that boil it down into a two-and-a-half-hour movie and make something really special that might not follow the Metal Gear mythos but is its own thing in the style of Metal Gear Solid and I feel like there's something really cool there I agree with you that I think there could be something really cool there but this is a really kind of divisive idea because with any kind of IP that has a rabid fan base there's going to be that group that wants it to like stay true to can and stay true to the original and then there'll be people who are just like casual fans or like oh maybe I heard that but it's a cool action flick so I'll go watch it right and I there's no way to please them both and especially with a with a property like",
            "start": 2138.36
        },
        {
            "text": "who are just like casual fans or like oh maybe I heard that but it's a cool action flick so I'll go watch it right and I there's no way to please them both and especially with a with a property like Metal Gear that's not something that is incredibly widespread like the Marvel characters are I think the fact that Deadpool was in the x-men universe in the Marvel movies helped that franchise get off the ground right like because he was introduced how are we going to sell this to an audience that has never heard of metal Metal Gear Solid before right I would argue that Metal Gear is more what especially was before the movies more well-known than Deadpool but I feel like Deadpool had the magic factor of Ryan Reynolds pushing it so much and believing in it so much so I think this is a similar situation of Jordan Roberts believing and pushing and there is the difference that Jordan and Ryan Reynolds are not on the same tier in terms of how well-known they are but coming off of Kong Skull",
            "start": 2190.77
        },
        {
            "text": "situation of Jordan Roberts believing and pushing and there is the difference that Jordan and Ryan Reynolds are not on the same tier in terms of how well-known they are but coming off of Kong Skull Island like he is a known entity in the blockbuster film world and I feel like this is the type of thing or despite what people might think of that movie one way or the other I think that this is the type of that wouldn't necessarily be an action movie it would be more character-driven and it would be more like we want we'd rather get this right then have this kind of try to appeal to as many people as possible then you won't get budget yeah I know but that's the thing is it's just like I will be like that doesn't sound like something we want to spend money on but then there's Logan you know oh that's not even that's apples to oranges and you know it Logan is different I mean like you attached Patrick Stewart and Hugh Jackman to anything anybody will put money behind it yeah but when you",
            "start": 2240.99
        },
        {
            "text": "oh that's not even that's apples to oranges and you know it Logan is different I mean like you attached Patrick Stewart and Hugh Jackman to anything anybody will put money behind it yeah but when you look at even the sales numbers like the money made from the x-men movies like that there's not that kintyre consistency and Logan was a standout and in terms of how much money it made based on how much budget was put into it I feel like for something like this we don't need a hundred million dollar budget they can make a dope-ass Metal Gear movie for 50 million and maybe even less than that and make something really special I don't know I'm gonna take your word for it I believe I want this to happen final news story the day Superman actor Henry Cavill wants to play Geralt's is it Geralt straw Geralt ain't Netflix's Witcher series it's come from Daniel Krupa at IGN out a recent junket from Mission Impossible fallout yeah mission impossible fallout IGN asked cavil what he was busy playing",
            "start": 2284.53
        },
        {
            "text": "Geralt ain't Netflix's Witcher series it's come from Daniel Krupa at IGN out a recent junket from Mission Impossible fallout yeah mission impossible fallout IGN asked cavil what he was busy playing these days The Witcher 3 he says I just replayed all the way through I loved that game really good game with that in mind we asked if he'd be interested in the role of Geralt in Netflix's adaptation and he said absolutely yeah that would be an amazing role cavil also went on to reveal his love of the source material Jesus Christ can you help me here give me give me give me a landline Andres is CIPA house key series of fantasy Don definitely didn't say all right the books are amazing cavil tells us the books are really really good the books I started reading and they're well worth the read oh man would that be a good fit I'm unfamiliar I'm familiar with The Witcher universe movies are typecast henry cavill would have to go undergo quite a physical transformation to become Geralt I don't",
            "start": 2334.81
        },
        {
            "text": "man would that be a good fit I'm unfamiliar I'm familiar with The Witcher universe movies are typecast henry cavill would have to go undergo quite a physical transformation to become Geralt I don't think that he would be the right fit because of that but I like Henry Cavill I think he was great in Mission Impossible fall out which by the way if you haven't seen it it is awesome did you see it Kevin it's yeah I want to go back and see it again are you again are you excited for a potential sequel oh yeah 100% yeah I need a wait a while for that potential sequel but if I wanted to know what games were coming out today Adria where would i look Tim you would go to the official list of upcoming software across each and every platform as listed by the kind of funny games daily show host each and every weekday dudududududududududududu got a big list it's Tuesday so you know we got dead cells coming out on ps4 Xbox one and switch we got defenders of Ekron the definitive edition on ps4 and Xbox",
            "start": 2380.02
        },
        {
            "text": "every weekday dudududududududududududu got a big list it's Tuesday so you know we got dead cells coming out on ps4 Xbox one and switch we got defenders of Ekron the definitive edition on ps4 and Xbox one we got electro knots on psvr we got flippin death on ps4 Xbox one and switch we got hyper universe on Xbox one we got in between on switch we got overcooked 2 on ps4 Xbox one and switch we are loving that game we got minecraft story mode season 2 on switch oh we faced a conundrum here Andrea yeah I can't say the name of this next game based on a rule that I created on this show today I'm gonna do it I'll say it its poop slinger I looked it up cuz I was like I need to see what this is what is boob slinger so it looks like it's a 2d slingshot game where you're from first-person perspective flinging little pieces of poop at people as they walk by and you hit them does it look good no ok slam land on ps4 switch and PC super blackjack battle 2 turbo edition the card warriors on so it's",
            "start": 2428.02
        },
        {
            "text": "flinging little pieces of poop at people as they walk by and you hit them does it look good no ok slam land on ps4 switch and PC super blackjack battle 2 turbo edition the card warriors on so it's Tetris escape on ps4 and PSVita the dream lads Aisling is quest on ps4 and PSVita and word search by pogey on ps4 and PSVita 3 Vita games today Vita lives an h1z1 has officially left open beta and launched on ps4 as a free-to-play game today the update which converts the early access version to an official release makes launch button and a season pass available as well as new vehicles to roll around in and this comes from GameSpot if you're a fan of the cult favorite tactical RPG series Valkyria Chronicles you'll be happy to know that you can download a demo of its fourth entry right now it's available as a free download on ps4 Xbox one switch and PC Valkyria Chronicles 4 is the first non portable mainline entry to launch on major consoles since the series debut in 2008 the demo allows you",
            "start": 2491.32
        },
        {
            "text": "as a free download on ps4 Xbox one switch and PC Valkyria Chronicles 4 is the first non portable mainline entry to launch on major consoles since the series debut in 2008 the demo allows you to play through the prologue up until the end of its second chapter according to Sega this amounts to around 2 or so hours of gameplay and any progress you make is transferable to the final game so many customization options and lasting consequences you make like dead comrades will follow you should you choose to allow it I love this I love this trend of demos and betas going on octa path traveller did it as well I was just in such an awesome move on due dates IGN reports The World Ends With You Final remix will arrive on Nintendo switch on October 12th originally released on DS just over 10 years ago the world ends with you switch re-release was announced in January final remix force which features new HD visuals and additional content and gameplay options that weren't in the 2008 original taking",
            "start": 2543.37
        },
        {
            "text": "the world ends with you switch re-release was announced in January final remix force which features new HD visuals and additional content and gameplay options that weren't in the 2008 original taking full advantage of the switch final agreements will allow players to use either the touch screen or droid cons as control options and additionally final remix includes a new two-player co-op mode I'm very excited for more people to play that game it's time for reader mail but let me tell you Andrea it's brought to you by third love we are talking bras for the modern woman alright perfect fit most sizes of any brand third love just added 24 new sizes making them the industry leader with a total of 70 sizes I said it yesterday I'll say it again that's a lot of sizes I was surprised to know there was that much variation going on well you know women um come in all shapes and sizes Tim and it's tough to get standard sizes for things that aren't standard you know mm-hmm that is true and the real",
            "start": 2590.29
        },
        {
            "text": "was that much variation going on well you know women um come in all shapes and sizes Tim and it's tough to get standard sizes for things that aren't standard you know mm-hmm that is true and the real thing about bras is that they have to fit really snugly yes you don't really have a lot of leeway up or down with sizing like you buy t-shirt that's maybe like a half-size too big or too small you can kind of get away with it doesn't really matter bras nah man you're gonna be chasing those straps all day long you need that perfect fit speaking in the straps and speaking of getting the perfect fit Paris my beautiful girlfriend she is a half-size and so she was happy to know that she could find the exact size that she needed and she found a bra that was convertible into strapless and she said it's chic and simple I never really knew how to spell chic until she takes to do this how would you think you spell it because if it's CH IC you'd be correct otherwise you're wrong Jia's friends also",
            "start": 2631.66
        },
        {
            "text": "it's chic and simple I never really knew how to spell chic until she takes to do this how would you think you spell it because if it's CH IC you'd be correct otherwise you're wrong Jia's friends also hit me up and let me know that they have been wearing third love bras for a while one of them saying they're very comfortable and others saying no lines showing when you wear a shirt that sounds like a big plus it definitely is not been an issue for you yeah as I mentioned yesterday as somebody who's on camera these are things that you have to think about all the time you can't have a bra that has lace on the front if you're wearing it like a sheer material shirt because then all anybody's doing is staring at your bra yeah news Fair's for everybody this is and they have pretty ones too I have a basic nude one that's pretty invisible under most clothes but I also have like a lacy black one that's sexy and guys like it so that's fun for you and then another one friend says I have the nude",
            "start": 2676.54
        },
        {
            "text": "a basic nude one that's pretty invisible under most clothes but I also have like a lacy black one that's sexy and guys like it so that's fun for you and then another one friend says I have the nude one too and I really love it so there you go that's some real world testimonials from people that have just actively been using 3rd lob now G is using 3rd love everybody's using 3rd love well and just so everybody knows they also have underwear sleepwear and body suits and they really care about comfort and quality there's tagless labels so there's no itching I'm a big fan of the tagless labels there's been a big shift recent recently and all clothes for this and I support it there's a fit guarantee third love guarantees a perfect fit returns and exchanges are free and easy third love knows there's a perfect bra for everyone so right now they're offering listeners 15% off your first order you can go to 3rd love.com slash games now to find your perfect fitting bra and get 15% off your first",
            "start": 2720.34
        },
        {
            "text": "a perfect bra for everyone so right now they're offering listeners 15% off your first order you can go to 3rd love.com slash games now to find your perfect fitting bra and get 15% off your first purchase that's third love comm slash games for 50% off th IRD l.o.v.e comm slash games third love where you'll bras and now Omaha Steaks you heard us talk about that many many times before we are very big France big fans of the meat that they send us Kevin what's your favorite thing about Omaha Steaks the country fried steaks country fried steaks cookies how do you how do you make them I have some in my freezer and I was like do you just bake them oh no my husband threw away all of it all of the instructions that came with it they would tell me oh ma steaks offers everything to satisfy your grilling needs all the highest quality cuts with one-of-a-kind flavor all beef is USDA inspected for quality and aged for 21 days to unlock the full flavor of tenderness of the cuts and there's the thing",
            "start": 2760.81
        },
        {
            "text": "needs all the highest quality cuts with one-of-a-kind flavor all beef is USDA inspected for quality and aged for 21 days to unlock the full flavor of tenderness of the cuts and there's the thing who doesn't love meat you know what I mean besides Paula koala but that's a issue that we'll have to deal with another day they are all the best cuts of beef bison from the golden plains globally sourced and frozen fresh seafood from the world sport seafood whole bunch of great stuff here right now Omaha Steaks is giving a limited time offer to our listeners for the summer go to Omaha Steaks dot-com type KF games in the search bar and you can get this Omaha Steaks grill ready collection for only $39.99 that's 80% off and let me tell you what you will get you got to tender filet mignons to beefy top sirloins for juicy boneless pork chops for boneless chicken breasts for all beef Omaha steak burgers for traditional kielbasa sausages for award-winning gourmet jumbo Franks one Omaha steak",
            "start": 2833.1
        },
        {
            "text": "beefy top sirloins for juicy boneless pork chops for boneless chicken breasts for all beef Omaha steak burgers for traditional kielbasa sausages for award-winning gourmet jumbo Franks one Omaha steak seasoning packet plus get four made from scratch caramel apple tartlets for free those things are delish hashtag delish again get this limited-time package for only $39.99 when you go to Omaha Steaks com type KF games in the search bar and add the grill ready collection to your cart don't wait you want to get this offer soon in time for the summer go to Omaha Steaks com type KF games in the search bar grab your friends and family and fire up that grill yeah read a meal time let's do it where do we want to start Tai Harrington says what's up cave GT two days ago I bought myself a switch finally and I'm looking to sing some hours into it although I will dip my toe into Zelda and Mario Odyssey I'm no Tim Geddes and I've always been far from an intended I wanted to get a few recommendations",
            "start": 2872.4
        },
        {
            "text": "and I'm looking to sing some hours into it although I will dip my toe into Zelda and Mario Odyssey I'm no Tim Geddes and I've always been far from an intended I wanted to get a few recommendations on what to load my shiny new toy up with both single and multiplayer as I'm back at uni this month or in a month and I'm sure we'll be putting it to good use with blood buddies up there let's see I mean there's so many just generic answers that are great but I mean if you're going to university and if you're not a Nintendo dude you got to get Mario Kart 8 deluxe you probably haven't played it before it's a fantastic game I keep going back to I was playing it last night it's fun both single and multiplayer so that's definitely a good answer on top of that if you're into platformers Sonic mania plus is the best Sonic game to ever exist so I recommend that's there's a ton of just like smaller titles like dead cells is another one everyone's talked about now if you're into JRPGs give out to path",
            "start": 2924.49
        },
        {
            "text": "is the best Sonic game to ever exist so I recommend that's there's a ton of just like smaller titles like dead cells is another one everyone's talked about now if you're into JRPGs give out to path traveller shot I actually really enjoyed playing Bayonetta and be no.2 on my switch you ever played those if you want something a little bit more action focused a bit more of a traditional like non Nintendo game there's like a bunch of Indies that are on there that are overcooked to is a great jump on point you guys are gonna have a lot of fun with that just shapes and beats is a great game if you're into hating yourself hating yourself rhythm games at all I just beat it on a flight from Texas and my god that thing was like cuphead hard I was like why why but it's so good that's good list though I think I think you should start there and honestly dude just start playing Mario to see just see what happens you're gonna get so lost in its awesomeness so much to do oh you already read professor",
            "start": 2966.79
        },
        {
            "text": "I think I think you should start there and honestly dude just start playing Mario to see just see what happens you're gonna get so lost in its awesomeness so much to do oh you already read professor woke there let's go to why not Pete cuz it's happy Tuesday hoses someone was interested in getting a VR headset today should they wait for the PS 5 or just buy the headset now on that matter with a Playstation 5 even launched the VR headset or a psvr ago the way of the Vita this is an interesting question why not Pete I don't think you want to wait for the PlayStation 5 because that's at least two years away from launching more than likely it could be essentially be three years away from launching so if you want to get into VR there are some great specials throughout the year on PSP our bundles particularly around the holidays but I mean just kind of keep your eye out for specials I mean because you there's a really great offering of games on that system right now and I believe Sony",
            "start": 3024.98
        },
        {
            "text": "bundles particularly around the holidays but I mean just kind of keep your eye out for specials I mean because you there's a really great offering of games on that system right now and I believe Sony announced that they've sold three million units I mean double check which is quite a few mm-hmm this is probably not going to be a popular opinion among our audience but I honestly believe based on a fairly extensive use of PS VR among a bunch of different games that it is not worth buying because you should find a friend that has one and use theirs if that's not an option for you maybe it's gonna be worth investing for you but I've had a great time with psvr just borrowing it from people here and there just playing in other people's houses I'm like I'm good with these experiences I don't need to invest hundreds of dollars into this thing we'll ps5 continued psvr or will go the way of the Vita I'm not convinced they will necessarily I think that they that it's a success and it's it's",
            "start": 3073.29
        },
        {
            "text": "need to invest hundreds of dollars into this thing we'll ps5 continued psvr or will go the way of the Vita I'm not convinced they will necessarily I think that they that it's a success and it's it's working but I don't know given the VR showing at e3 this year I think you're wrong also it's they announced they announced two million units sold that's of May of 2018 so with over two million so we don't know how much over two million it is but just to make sure that you guys don't need to write into you're wrong about that I think if you're interested in VR the easiest way to get in is psvr particularly if you already have a ps4 it's it's much simpler to plug-and-play than the other two systems are which require a little bit more set up in a little bit more kind of like I don't know it's just like mess because there's just so many cords everywhere but that being said there are things coming down the pipeline like the oculus go which is wireless and when you know vive hat prototype their",
            "start": 3121.53
        },
        {
            "text": "like mess because there's just so many cords everywhere but that being said there are things coming down the pipeline like the oculus go which is wireless and when you know vive hat prototype their wireless thing at CES earlier this year so if you want to wait for maybe something that's PC based those are some options but we also don't know if they're going to be as powerful because they are wireless mm-hmm I would say don't hesitate the only VR experience that I'm like oh man I don't care how much this cost I would pay it to have this is beat saber that game is there it's coming to be as VR so it's like that that's one thing one of my are I can see it because that's a game that I can see myself playing for a very long time if there was more songs that and stuff I don't know how psvr is gonna handle that with like mods and stuff I think they'll work it out but even with Sony's uh showing the VR games at e3 it's like but will it be that next year and will it beat out the year after of",
            "start": 3171.61
        },
        {
            "text": "handle that with like mods and stuff I think they'll work it out but even with Sony's uh showing the VR games at e3 it's like but will it be that next year and will it beat out the year after of course not it's never going to be the focus every year you know small trickling because I member e3 is where there was a strong Vita focus as well and then all of a sudden there wasn't i also remember in threes there was a strong focus on 3d and all of a sudden there was but there's so many people in the VR space more so than 3d I'm with you 3d was like in and then it was out very quickly but we still continue to hear so much about development happening in in VR so I don't I don't think it's going to take off and become like the next big wave I don't think everybody's going to get into VR mostly cuz it's not that comfortable as we're but I think it's going to continue for at least the next like two to five years mm-hmm 2 to 5 I'll give it that I'll give it that Mark Lopez says hey Tim and",
            "start": 3218.8
        },
        {
            "text": "cuz it's not that comfortable as we're but I think it's going to continue for at least the next like two to five years mm-hmm 2 to 5 I'll give it that I'll give it that Mark Lopez says hey Tim and Andrea Madden 19 is officially out for the hall of fame edition however last week people who had the game thanks to EA acess noticed something off about Madden the song big bank by yg had part of Big Sean's verse bleeped off because he referenced Colin Kaepernick my question to you guys are do companies like EA in the NFL need to be specific when it comes to their licensing agreements of real-life people or is it more loose and it all so how do you guys feel personally about this thank you for everything you guys do why do you never read any of the chicken stuff I don't know you skipped three of them yeah yes the short answer is yes they absolutely need to be incredibly specific about their licensing agreements with regards to images of people there was a whole big lawsuit with the NCAA",
            "start": 3266.95
        },
        {
            "text": "of them yeah yes the short answer is yes they absolutely need to be incredibly specific about their licensing agreements with regards to images of people there was a whole big lawsuit with the NCAA about this a couple of years back because players weren't getting paid for their likenesses being used in the game so this absolutely has something to do with a legality somewhere totally what the specifics are we'll probably never know yeah I mean I feel like it's not too hard to put it together about what the specifics are I'm sure that and it felt was like if you're gonna use this in your game you're not mentioning him in that in any way positive or whatever it's like all right that sucks my opinion on it that sucks like it's ridiculous that the whole Colin Kaepernick thing is ridiculous when it comes to how then FL is treated at all and how much they've gotten away with it it's embarrassing it is it's [ __ ] embarrassing but that's it Luke Shaw first says what's up Jim and Andy I just",
            "start": 3311.59
        },
        {
            "text": "it comes to how then FL is treated at all and how much they've gotten away with it it's embarrassing it is it's [ __ ] embarrassing but that's it Luke Shaw first says what's up Jim and Andy I just want to say it was awesome in you guys at prom what an amazing night that was yes yes it was this week knee antic said they were going to launch PvP and Pokemon go by the end of 2018 fans have speculated they might change the combat style for a while to make PvP more interesting than just tapping over and over again my question is twofold do you think PvP would bring either of you back for another go-around a Pokemon go my wife and I have just bumped back in with some friends and it's really been fun exchanging gifts and training Pokemon into how much the Pokemon go do you guys think really carries over to let's go Eevee I don't even need to mention the other starter cuz I mean come on Phoebe's way better okay y'all I love you Luke shoppers you are absolutely correct I'm afraid that with the",
            "start": 3363.31
        },
        {
            "text": "over to let's go Eevee I don't even need to mention the other starter cuz I mean come on Phoebe's way better okay y'all I love you Luke shoppers you are absolutely correct I'm afraid that with the popularity of Pokemon go and it's widespread fan base that the let's go games are going to feel hollow and not true not hold true to the awesome in-depth battle systems and strategies that I love about the Pokemon core games dots PS love everything you guys do I miss my games daily so much last week I'll start with two since I don't really play a lot of Pokemon go I think that your fears are well-founded and that I hope you manage your expectations for let's go games based off what we saw at e3 it clearly isn't going to be as robust as like a true Pokemon RPG from the main series we got that coming next year they've already said that like they've anybody expecting a like true quote-unquote hardcore Pokemon game in let's go they're not getting that the branding is obvious with what they're",
            "start": 3402.01
        },
        {
            "text": "next year they've already said that like they've anybody expecting a like true quote-unquote hardcore Pokemon game in let's go they're not getting that the branding is obvious with what they're trying to do here there's nothing that could really get me back into Pokemon go the PvP stuff doesn't really interest me it could have back then but definitely not now having said that Pokemon let's go Pikachu and Eevee I I wonder I wonder how deep the connections gonna be and if that will entice me in any way to pull out my phone or do something with my phone to train the Pokemon whatever we still don't know a lot about the battle systems and how the experience points work from catchy the wild Pokemon to training or to battling them and training them raising the levels because if you can only do traditional Pokemon fights in trainer battles like how are your wild Pokemon experiences which is typically where the grinding takes place how does that all work I don't know we'll have to see I am",
            "start": 3445.3
        },
        {
            "text": "traditional Pokemon fights in trainer battles like how are your wild Pokemon experiences which is typically where the grinding takes place how does that all work I don't know we'll have to see I am very excited for these let's go games it's not what I want necessarily it's not exactly the Tim Gettys thing but I knew we were never gonna get that I wanted a sequel to the red and blue I wanted it to be darker a little bit more grown-up and like in whatever I'm not gonna get that like I just need to be real I'm very excited about this though because this is a perfect gateway for me to be like Gaea give this a shot try this see if it's for you it's all the classic characters that I know and love from the original Pokemon game all the original gym leaders and all of that from the the bits I've seen of it I got to play a little bit of it at Comic Con it's it's Pokemon and it's like I can't believe the game looks as good as it does like looking at it I'm like this is what I thought Pokemon",
            "start": 3494.08
        },
        {
            "text": "seen of it I got to play a little bit of it at Comic Con it's it's Pokemon and it's like I can't believe the game looks as good as it does like looking at it I'm like this is what I thought Pokemon looked like when I played it in 1998 and it's the the anime ask look it's like wow this looks just as good as the Pokemon cartoon it gets me very excited for next year's Pokemon game I wonder what that's gonna look like and I do expect it to be a fairly significant even higher than this yeah I think Pokemon let's go is going to be a massive success potentially the best-selling Pokemon game of all time and that's crazy yeah isn't it already come on let's go oh come on go no I'm not kind of I'm sorry about in terms of like the portable or like what a reporter was any matter core Pokemon games I'm counting this is a core Pokemon game even though it's technically a spinoff that's that's an interesting idea and I would need to look at the numbers do you think about like the 30s install base",
            "start": 3541.21
        },
        {
            "text": "I'm counting this is a core Pokemon game even though it's technically a spinoff that's that's an interesting idea and I would need to look at the numbers do you think about like the 30s install base that's a massive that's a massive install it's true but this is so early in the switches life cycle and we've seen anything from Pokemon it's that Pokemon cells throughout the entire life of the system and it's more and more people buy switches if let's go if Pokemon let's go is the gateway into Pokemon for even the youngest people right it's gonna sell the most this is an interesting idea I know hmm hmm I don't know what to think of it what's really intriguing here or you could like this could completely fall on its face I don't know I these games are going to sell they're based on no doubt about that I mean I mean sell astronomically well maybe yeah he's done the most popular Pokemon they are dumbs down to degree for most people to be able to play true all the people being like oh I'm",
            "start": 3594.58
        },
        {
            "text": "about that I mean I mean sell astronomically well maybe yeah he's done the most popular Pokemon they are dumbs down to degree for most people to be able to play true all the people being like oh I'm not gonna play this they're gonna buy it maybe somebody can sneak in a quick you're wrong and let me know what the number one selling Pokemon game is of all time if I had to guess just totally off the top of my head I would I would assume it would be it's the 3rd gen the GBA gen of rubies sapphire emerald do you think it is I don't know I I would need to see the numbers of that but well then the DS does have such a large install base yeah hmm I don't know look it up just ok ok I hate you so much Kevin all right the best-selling Pokemon game and I have to corroborate this but the first hit was pokemon red and it says pokemon red slash green slash blue slash yellow - gb / various oh and it says - fifty nine point five two million all right yeah pokemon gold silver crystal second place with",
            "start": 3639.64
        },
        {
            "text": "pokemon red and it says pokemon red slash green slash blue slash yellow - gb / various oh and it says - fifty nine point five two million all right yeah pokemon gold silver crystal second place with forty two point two so i guys don't look right into your wrong yeah keep going oh hold on this is just the best selling nintendo games let me get a better thing here there have been more than 300 million pokemon games sold total let me look here if there's a list by generation mmm this is not the list that I'm looking for cuz hearing this makes me think I'm an idiot and totally wrong for saying that these would be that the most selling games however the more I think about I'm I I don't know that it's wrong we don't know where the switch is going to end up we don't know how long the switch is going to be a thing how long this generation is going to be and how many iterations on the console itself there will be I would not be surprised if the switch kept going for longer than we expected to",
            "start": 3709.71
        },
        {
            "text": "to be a thing how long this generation is going to be and how many iterations on the console itself there will be I would not be surprised if the switch kept going for longer than we expected to especially with different kind of switch excels which microbes whatever all of these all of these lists are like super hard to read it looks like number two is like a sapphire okay on GBA okay so hmm interesting the Virtual Console side of this changes the game because the only games that have been on Virtual Console console are gen one and two so it's the number one and two what's so the one you just said what was the number for it for sapphire ruby sapphire it's a Safi version on the game on the boxart well what's the number sales number oh it's the sales number look at this graph is so hard to read it looks like it's like just at 16 million okay so see that's but wait what yeah no yeah I don't know what the total maybe you're wrong we'll give us a better look it's just not formatted the",
            "start": 3770.19
        },
        {
            "text": "to read it looks like it's like just at 16 million okay so see that's but wait what yeah no yeah I don't know what the total maybe you're wrong we'll give us a better look it's just not formatted the right way it's time to squad up Campbell on ps4 his PSN name is X e SS enti ALS X essentials says I need friends for siege I love playing ranked but I find myself bogged down playing with randoms I want some best friends to play ranked with so go help out Campbell X essentials on PSN now it's time for you're wrong correct me please okay so pokemon ruby sapphire emerald sold 36.6 okay million okay season third that's what I'm thinkin and I can see that can be yeah and then it was diamond pearl platinum 25 point to pokemon black and white twenty four point one X&Y 16 point to sun and moon' did twenty three point six mmm i don't know why so it's almost like in chronological order with the exception of sun and moon they've gone from the most selling to the least selling well so that just",
            "start": 3829.47
        },
        {
            "text": "did twenty three point six mmm i don't know why so it's almost like in chronological order with the exception of sun and moon they've gone from the most selling to the least selling well so that just makes the longer they're out they just keep going correct so they keep growing so I might I might be wrong because then if the old ones just keep selling more let's go the katooni we could never beat them right the older ones are only gonna be re-released on more consoles and that those sales numbers are just gonna grow well on this this chart that I'm looking at breaks it down so like for example the pokemon black and white numbers are broken down between pokemon black and white and black 2 and white 2 well that's necessary those are different games right but the total is those two added together what yeah black black white one and two right so here for example it says black and white sold 24 point one six black and white by itself sold fifteen point six pokemon black and white black 2",
            "start": 3890.77
        },
        {
            "text": "what yeah black black white one and two right so here for example it says black and white sold 24 point one six black and white by itself sold fifteen point six pokemon black and white black 2 and white 2 sold eight point five so together they sold 24 point one that's that's shenanigans OH like pokemon red blue yellow sure those are the same game with isolate these the number one selling Pokemon games standalone was pokemon red green and blue release in 1996 with 31 point three million yes stand alone no I don't know because they have pokemon yellow pokemon firered and leafgreen and pokemon red green blue and yellow all listed under one so that's how we got an astronomical number early fifty nine point five yeah oh what a disaster I should have found this list first so that by that by this list number two of all time is pokemon gold and silver with twenty three point one that's okay number three is pokemon diamond and pearl hmm hmm interesting yeah you're wrong i got you're wrong here",
            "start": 3937.33
        },
        {
            "text": "list number two of all time is pokemon gold and silver with twenty three point one that's okay number three is pokemon diamond and pearl hmm hmm interesting yeah you're wrong i got you're wrong here we go on today's morning show this is the morning to show you're wrong that doesn't count get out here really you know it was this about tim mentioning that there would be six spider-man movies including venom actually there would be seven Oh spider-man 1 through 3 from Rami amazing spider-man 1 and 2 spider my homecoming and then sad we're not including MCU movies your punk ass [ __ ] oh [ __ ] I need a piece so bad I'm gonna be ignacio has admitted he did not bring up a role 16 during the Evo drama yesterday Thank You Lourdes apone says Nintendo was the publisher for octo path traveller outside of Japan so it would be very unlikely they come to ps4 oh not necessarily I would wonder if there's been a historic as history for that if Nintendo was a publisher switched and somebody else",
            "start": 3994.83
        },
        {
            "text": "outside of Japan so it would be very unlikely they come to ps4 oh not necessarily I would wonder if there's been a historic as history for that if Nintendo was a publisher switched and somebody else publish it maybe maybe we're are the very final minutes yeah let's falling apart of the seams learn a poem thank you for those psvr numbers but I did update that during the show let's see here yeah I would tell him correction someone mm-hmm wait what so this says a correction for Luke shock first someone at Niantic said the developer wants to add PvP in 2018 not that they will add it in 2018 just trying to keep expectations in check as it technically has not been confirmed for this year that's that's important you alright ladies and gentlemen I believe did he do the squad up okay I was looking at Pokemon numbers tomorrow's host is Greg and Gary yes mr. Greg Miller is back from Battle Creek Michigan to tell us of his time at Buffalo Wild Wings and don't forget tomorrow morning at 7:00 a.m.",
            "start": 4055.37
        },
        {
            "text": "at Pokemon numbers tomorrow's host is Greg and Gary yes mr. Greg Miller is back from Battle Creek Michigan to tell us of his time at Buffalo Wild Wings and don't forget tomorrow morning at 7:00 a.m. bright and early mr. Tim Geddes will be here to do live reactions to the Nintendo Direct for smash ultimate I'm so excited I'm not lying it was difficult to fall asleep last night yeah I'm such a [ __ ] nerd I don't care man I just love there's nothing I love more than smash brothers and for them just be like we're gonna do all holterhaus on this I'm like again so great I love it and don't forget you can join me and the rest of the what's good games crew tomorrow at 6:30 p.m. Pacific Time twitch.tv slash what's good games or youtube.com slash what's good games for our first ever live stream show you can spend your whole day with us tomorrow pretty much because from 7:00 to whenever we're gonna be doing the Nintendo Direct reactions then we got morning show at 11:00 then we got a me",
            "start": 4120.83
        },
        {
            "text": "show you can spend your whole day with us tomorrow pretty much because from 7:00 to whenever we're gonna be doing the Nintendo Direct reactions then we got morning show at 11:00 then we got a me whenever that happens then if you're a patreon supporter on patreon.com slash kind of funny we're gonna be doing a live game of a greggy show and then once that ends you can go right into what's good games doing their live stream on twitch.tv slash watch good games well it's gonna be great one day did we dock anything wrong no I read them all already okay thank you for that well I know but like that was it wasn't much that was just cool thanks love it alright well till later I love you bye everybody",
            "start": 4172.52
        }
    ]
}