{
    "id": 461,
    "video_id": "CzgyaqePCUw",
    "show_name": "Follow the Liter",
    "hosts": [
        "Nick Scarpino",
        "Erick Castro"
    ],
    "title": "What Drink to Order a Girl at the Bar - Follow the Liter",
    "description": "Welcome to our newest show Follow the Liter, where we teach you how to make fancy drinks that will impress your friends. This week, the Paloma!\n\nGet a cocktail named after you here! http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter!\nNick - http://www.twitter.com/Nick_Scarpino\nErick - http://twitter.com/castrodisiac\n\nMusic by Tonedeff: https://twitter.com/tonedeff",
    "published_at": 1417712413,
    "duration": 187,
    "transcript_chunks": [
        {
            "text": "I'm Nick scarpino with me is Eric Caster Eric you are a master bartender is that correct uh that's some people say not my words you know back when you and I used to be uh what we call single uh I used to frequent a lot of bars one of my favorite things to do to break the ice with a girl was to offer her a drink what is the best drink I can offer to buy a girl that might impress her I recommend buying a girl Paloma a Paloma what's a Paloma it's got tequila so you're letting her know you mean business wow let see 3/4 Ozz lime [Music] juice half oz simple [Music] syrup 2 oz of some tasty tequila o tequila tequila as they say in Mexico that's basically how you say that word then now that you got the tequila in there we're going to turn this into an energy drink and put a quick pinch protein powder salt in there sea salt okay got it and honest see this drink's ready to go but but if you happen have a bottle of grapefruit bitters around I recommend doing a dash or two in there to give it a",
            "start": 3.48
        },
        {
            "text": "salt in there sea salt okay got it and honest see this drink's ready to go but but if you happen have a bottle of grapefruit bitters around I recommend doing a dash or two in there to give it a little bit of added depth and complexity okay I'm a complex guy so complex drink right at my alley yes sir we're going to ice up our [Music] glass wow we ice up our tin put the Sher on top you know what to do here folks mhm that's how the pros do it ladies and gentlemen now this drink all chilled and shaken up pour it over ice what that bad [Music] Bizzle looking sexy and refreshing we're going to little hit it with a little bit of grapefruit soda all right you can keep it authentic by getting the Mexican kind if you can oh that is Tim likes that Tim goodies they'll suck all that down couple straws and for garnish drop the lime wheel in there fancy there you go folks a Paloma all right man give it a sit all right here we go here it is the Paloma that is tasty that is like a warm summer day in",
            "start": 55.24
        },
        {
            "text": "and for garnish drop the lime wheel in there fancy there you go folks a Paloma all right man give it a sit all right here we go here it is the Paloma that is tasty that is like a warm summer day in Southern California right there just what I love perfect the bar scene thank you so much Eric if you guys at home want to try some of these awesome custom cocktails if you're in San Diego you can go to Eric's bar polite Provisions or if you're on the east coast in New York you can go to the boiler maker another great bar which is fantastic uh also if you like this video make sure to like it leave a comment below and share it with some of your friends Eric you have a special offer for the audience at home if you'd like me to come up the special cocktail tailor made specifically for you go to patreon.com kindof funny awesome Eric thank you again so much for joining us subscribe to con of funny if you like this content if not I'm going to go take my shirt off cheers and happy mixing walking",
            "start": 118.36
        },
        {
            "text": "kindof funny awesome Eric thank you again so much for joining us subscribe to con of funny if you like this content if not I'm going to go take my shirt off cheers and happy mixing walking out this way walking out this way he [Music]",
            "start": 164.32
        }
    ]
}