{
    "id": 458,
    "video_id": "AH45lHfOgNE",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Disneyland Sucks?! - The GameOverGreggy Show Ep. 52 (Part 1)",
    "description": "Mike Aransky loves Disney, but does the rest of the group?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1417334400,
    "duration": 2171,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer Nick Scarpino. Hi, you're in the classic Nick Scarpino Coke shirt. I haven't seen this a long time. I am, I brought it out of uh retirement. It was in retirement; it went to the rafters and you brought it down. You brought it down for this occasion like Michael Jordan first down, first retired jersey. There it is, that's how it happens. Sports over there, the Pride along Island go Islanders. You're wearing your monoko shirt down from the rafters. Everyone knows it from D Anda to yeah Danga one. I bought it when Aransky and I were in Japan. It's true, and it was a very... The story actually me buying the shirt is no one obviously spoke English. I was trying to buy it from, and I kept trying to get a medium, and they eventually told me like it's one size for everybody, and I was like, \"Oh no, yeah.\" Because they're so much smaller than you know fat American. I was",
            "start": 1.1
        },
        {
            "text": "buy it from and I kept trying to get a medium and they eventually told me like it's one size fits all and I was like oh no yeah because they're so much smaller than you know fat Americans I was but it fits I think it fits okay it fits really well you look good in it don't doubt yourself thank you over there the host Tim Gettys let's him host how are you doing good very good really good you say yes extremely good I'm surprised you're that good cuz we're here with Mike Aransky well that's the thing over here the hype man Mike Aransky round of applause yeah it's time thank thank you if you didn't know ladies and gentlemen Mike Aransky is the man that makes IGN run over there he works on The Daily Fix nobody cares about that what he does is sometimes for us at noon he comes in he Hypes up the crowd he tells them to clap he has a great laugh enjoys laughing he likes Ghostbusters that's when we bonded when he first showed up he was wearing a Ghostbusters shirt at first people wanted us to fight and then we fell",
            "start": 45.72
        },
        {
            "text": "Clap, he has a great laugh, enjoys laughing. He likes Ghostbusters, that's when we bonded when he first showed up; he was wearing a Ghostbusters shirt. At first, people wanted us to fight and then we fell in love. Was fine now he's a Nick Cage fan, yeah, he's a big Nick Cage fan. Who's this? Who's this artist you always rep? You got the Harrison Ford plays... oh yeah! Play \"Take a Master System\" with him here and Ford. Uh, BR get on the mic come on, you watch this scoot this in, get in there, get right up on it. Imagine you're making out with your high school sweetheart; you just want to win a cake competition. Go, just imagine that! If you're not near the mic, no one can hear you. Okay, just imagine that... Mind's Eye, sorry everybody. Perfect, that's better. Come with me, yeah. In your mind's eye, yes. Some Neil the grass Tyson up in there; Neil the grass Tyson, uh, yeah. Brandon Bird, Brandon Bird, that's the artist who did those uh stuff cool. He's the he's the man, yeah. Uh, tell us a little bit about yourself for the kids at home. How long have",
            "start": 87.92
        },
        {
            "text": "\"Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\"\n\nNote: I removed the raw chunk's text as it was not provided in the instructions.\n\nHowever, if you'd like me to clean the raw chunk, here is the result:\n\n\"Greg Miller loves Disneyland, but does the rest of the group? Brandon Bird that's the artist that did those uh stuff cool he's the he's he's the man yeah uh tell us a little bit about yourself for the kids at home how long have you uh been in San Francisco where did you come from what do you do uh former uh formerly from the East Coast uh Connecticut New York you're still you're still technically from the East Coast yeah technically it's always in my blood that's how it works uh I've been in San FR for what two and a half years really a little closer it seems so long here we go Nick going to tell you how to choke this right there problem is the problem with we have it's on my man breast such amazing just lean into it you may fun bags I know these babies going to be popping soon by the way cuz they're just going to just have a good time sming it wait they're popping out yeah I know they're doing it sounds hot I know right so excited by this uh yeah so I've been in San Fran two and a half years and good old times\"",
            "start": 132.4
        },
        {
            "text": "have a good time drinking it wait they're popping out yeah I know they're doing it sounds hot I know right so excited by this uh yeah so I've been in San Fran two and a half years and had good old times working IGN nice with all you fine folks yeah that's one way to put it know what we are over here five folks now ask you there's another fact about you yes you're a punk ass b**** who what's up with this oh Pepsi yeah oh my God you're crazy this thing was in my booth you're a punk ass b**** uh Pepsi is the king of colas it's a fact if you're listening to the MP3 thank you for on the MP3 Tim of course always has his Mexican Coke over there in a glass bottle Pepsi now Ransy brings a glass bottle of Mexican Pepsi yep and it's delicious yep yes it's just the way it is I get it I'm cornered off by Coke by the way here so I'm not going to win this battle so it's uh yeah you know like win that that's a taste test that Pepsi fans lose it's not I've seen the Pepsi challenge I know we",
            "start": 172.32
        },
        {
            "text": "off by Coke, by the way, here so I'm not going to win this battle, so it's uh, yeah, you know, like win that, that's a taste test, that Pepsi fans lose, it's not. I've seen the Pepsi challenge, I know we always win, remember Ray Charles, you picked the right one, baby, that's right, uh-huh, mhm, yeahhuh. Now there's rumors that the Pepsi is what made him go blind, but it hasn't been proven yet, it hasn't been proven yet, makes sense, oh God. The Pepsi challenge always bothered me because you could basically tell the difference between Pepsi and Coke just by looking at them, oh yeah, well, nonetheless, nonetheless drinking them, so are you really going in and you're like I don't know which one's Coke, are you kidding me? That from 10 out of 10 times I can tell the difference between Pepsi and Coke, like there's no it's so obvious which one's which, Mex that I believe that I believe well maybe not on sight but definitely on taste you can tell dark yeah I don't know about that it is poor like look at a 2 liter.",
            "start": 221.64
        },
        {
            "text": "it's so obvious which one's which, Mex, that I believe that I believe well maybe not on sight but definitely on taste, you can tell dark, yeah, I don't know about that, it is poor like look at a 2-liter the glass doesn't show too well but if you look at two liters, it's cuz this one is this one's green, yeah, can see glass give a little definition, Pepsi, Pepsi's darker and more delicious, but we do have to do it, Colin Mor already 10 out of 10 taste test I told you about my buddy Kevin, I'm going to Thanksgiving, I went to North Eastern with him and he lives in in the hate and we had I went over to watch a Rangers Islanders game with him last year and he got mad at me, he's oh my I'm going to go get a Coke, we ordered pizza and he's like I have Coke in the fridge, I'm like this is old Coke, this Coke's been here open half open for months and then he had like a can of Coke that was also old and he's like you can't **** tell the difference between all these Cokes and we did a taste test and I nailed it",
            "start": 264.08
        },
        {
            "text": "here open half open for months and then he had like a can of Coke that was also old and he's like you can't **** tell the difference between all these Cokes and we did a taste test and I nailed it I was like I just watching him you're a joy to be friends with I was like come on man who you trying to kid who you trying to fool ladies and gentlemen this is the GameOverGreggy show each and every week four sometimes five best friends gather on this table each bring a random I almost Miss I almost Miss one more time okay each week four sometimes five best friends gather on this table each bringing a random topic discussion for your amusement uh Nick was getting trash in the comments cuz he misses it every time every time every time you have work to do yeah is this is our One year anniversary it's a big moment for us that's why we were mic'd on yes stick stick with me by the way everyone CU I I do realize the first seven minutes of the show the audio sounded like someone was cramming hell",
            "start": 302.2
        },
        {
            "text": "It's a big moment for us, that's why we were mic'd on yes stick. Stick with me by the way, everyone. CU, I I do realize the first seven minutes of the show the audio sounded like someone was cramming hell through a thimble. I was going to say you look concerned the entire time, that's an awesome saying - it is a real saying, no, I just made that up, \"cramming hell through a thimble.\" Yeah, it's uh got to make air guys, I have to pull out the second board for you guys and it's hard for me to get it. It doesn't matter, I got it fixed now. I think it should how bad was it in the beginning? That's fine, bad enough to restart. How bad was it? Nice. Should we do a PSA in the beginning? You think what's up everybody, we're The GameOverGreggy Show and blah blah and we'll cut that and put it at the front. I mean we could just do it now but the people now they understand now they'll organically see this is like time travel - it's like in Bill and Ted's head when they were like \"I'd put the keys here\" and the keys were...",
            "start": 344.12
        },
        {
            "text": "the people now they understand now they'll organically see this is like time travel it's like in Bill & Ted's head when they were like I'd put the keys here and the keys were **** in there Bill and was how they know that was work Journey you know what I mean what was I'm sorry Bill & Ted's Bogus Journey was better than the original Bill and Ted take that bottle you like Pepsi and Bill & Ted's Bogus Journey more bizarre world oh man you really are negative bizarre Tim over there I don't like it uh each person of the five bring a random topic of conversation for your amusement if you like that of course the show posts each and every Friday as a video In Mp3 you can get them all at patreon.com kind of funny with a little bit of support but if you don't have the money or don't think we're worth it no big deal you can go to youtube.com/ kindof funny the next week and every topic goes day by day topic by topic for your amusement till the entire show posts and then it also goes to iTunes and SoundCloud and all",
            "start": 382.72
        },
        {
            "text": "can go to youtube.com/kindafunny the next week and every topic goes day by day topic by topic for your amusement till the entire show posts and then it also goes to iTunes and SoundCloud and all the other podcast apps that you guys like so go subscribe like share all those links do all that stuff rate them rate them rate subscribe on the iTunes and then follow on SoundCloud speaking of follow Greg way uh we also have a show called Follow the Leader its brand new it needs your support please watch each and every Thursday where Eric Castro a master bartender shows you how to make amazing drinks and also at the end tells you how you could get one named after you and sold at your bars not your bars his bars side no did he come up we just started randomly calling him Master Bartender right yeah hes got hes won competitions and hes like nationally a drink no cuz I was cutting one of them with mine and I said it and he was like thats not those are your words not my words like I I I",
            "start": 423.12
        },
        {
            "text": "yeah he's got he's won competitions and he's like nationally a drink no cuz I was cutting one of them with mine and I said it and he was like that's not those are your words not my words like I I I don't think he I don't know if he's comfortable with that it's cuz he got to be hum he's got to be humble it's like everyone calling us internet Superstars and I'm like guys not until we have 100,000 YouTube subscribers it's almost like when people refer to me as president and you as vice president because that 2016 election is a damn a it has the election hasn't happened and everyone knows that the she know is out there campaign and right now the mon the banner of Love happens over at District lines.com kindof funny buy your shirts there you can either buy the correct shirt Mor Ari Miller for president or the party stupid shirt over here the party stupid hey it's us everybody it's me it's Zack eon it's that the the Franco we all like and it's us that's your party that's I'd actually kind",
            "start": 462.4
        },
        {
            "text": "president or the party stupid shirt over here the party stupid hey it's us everybody it's me it's Zack Efron it's that the the Franco we all like and it's us that's your party that's I'd actually kind of like to go to that party sounds like an awesome party you're basically just describing um what was that movie with World neighbors neighbors neighbors oh neighbors I literally named two of the actors the two actors I named are from Neighbors James Franco was not in neighbors JF's younger brother I said Jackass I wasn't listening to this is the end this is the end this is the end yeah real quick too Nick I forgot to talk about this earlier and I just did again we need to kiss we have to kiss yeah everybody says I was too mean to you last episode you're fine I don't but I love you somehow come on there is every F it's all in I watched that and I was like I guess it's because I know you guys but like that they think Greg's mad at Nick yeah well it's just because I I **** on Nick a",
            "start": 503.8
        },
        {
            "text": "come on there is every F it's all in I watched that and I was like I guess it's because I know you guys but like that they think Greg's mad at Nick yeah well it's just because I I **** on Nick a lot but it's because Nick and I have that Vibe that's how we do it no what happens is this I say something that I think is funny and screw you guys I Look to Greg for validation and if he doesn't give it to me it is soul crushing and he withholds it sometimes sometimes I can tell that he thinks it's funny but he but I know that interaction is kind of funny just like it'll be kind of funny when I win the election in 2016 damn all right thanks for kindating for Country this is this is it this is where it pays off to be a patreon fan or someone watching this YouTube instead of the giant video if you're watching this on patreon Friday or YouTube patreon Saturday or YouTube Sunday there's a sale districtlines.com kinda funny right now you can get all the shirts at a discounted price including the",
            "start": 544.6
        },
        {
            "text": "watching this on patreon Friday or YouTube, Patreon Saturday or YouTube Sunday, there's a sale at districtlines.com kindof funny right now, you can get all the shirts at a discounted price, including the brand new \"This is what baller feels like\" t-shirt. Is this what baller feels? I apologize, I did not realize that was a question; I thought we were explaining what it is. No, it's a question. This of course is a reference to an inside joke from a Game Over Greggy show a long time ago, but it also pops up in this week's Fall Guys, which you can catch as well. It's a new shirt, now; it's very tasteful, it's humble, it's precocious - simply asking a question is magnanimous. I love it that you're trying to use it to take a subtle dig at Sean Finnigan, who likes hiking, and then you can't even say it yourself, like just reaching for what it was; you know, it's out there, very magnanimous in the ether, very magnanimous.",
            "start": 585.44
        },
        {
            "text": "a dig at Sean Finnigan who likes hiking and then you can't even say it yourself like just reaching for what it was you know it's out there very magnanimous in The Ether very magnanimous hugely magnanimous let me see I'm make sure I got all the housekeeping out of the way yep yep yep oh also that we put up the exclusive Patreon episode last week yes we and again if you're listening Patreon Friday then you see it on Thursday it's in the activity feed if you aren't a Patreon and would like that exclusive episode an hour and a half of our content that you can get nowhere else you can just go get it it's all all old Patreon shows are going to be up there still you can go see them at your will you don't have the money now maybe later you give us some money no big deal cool everybody's cool yeah Mike yep the guest always goes first on The GameOverGreggy Show it's you got you got to bring the thunder right now no oh you're drinking too I'm working I just just C me up St before",
            "start": 628.0
        },
        {
            "text": "cool yeah Mike yep the guest always goes first on The GameOverGreggy Show it's you got you got to bring the thunder right now no oh you're drinking too I'm working I just just C me up St before you bring Thunder lean into that mic like it's the first woman you've ever kissed all right here's what I'm going to do I'm I'm going to get it away from your boobies okay you okay can you do this what hold on no it's fine keep good go just talking what okay I'm just talking talking okay yeah keep talking the show I'm doing it hey guys we're uh Greg just hooking me up here I know it I realize that we put you in the in the in the guest which is always just a little bit we put inest chair huh I know that makes sense that makes no sense at all there you go you're fine not cutting your boobs cuz I got boobs cuz I'm a member of Team fat as well I got boobs too Greg is not a member of Team fat and truth be told his membership card has not been valid it has not been up to date in a long time you're",
            "start": 664.88
        },
        {
            "text": "\"Boobs cuz I'm a member of Team Fat as well, I got boobs too. Greg is not a member of Team Fat, and truth be told, his membership card has not been valid, it hasn't been up to date in a long time. You're now you're doing this, M here's my problem with you, thank you. Here's my problem: you've never been a member of Team Fat. No, but I'm with him on being a member. Here's my problem: you're an outskirt member, keep with all the Team Fat hate from last week. You're all, all of you watching who tweeted at me, you're a bunch of cowards. You, you got one piece of information from Morarti, he's over here, The Red Scare. He just says everything's wrong and you all believe him. He's never led you wrong before, huh? Y'all enjoyed Little Devil in Stin and Sh, I, it's like the one time you're wrong, you weren't even that wrong. He was like, 'That could be cool.' We already three, I was like, 'That looks fun.' I am still Team Fat till the day I die, and as I pointed out when I when we first started selling Team Fat.\"",
            "start": 708.76
        },
        {
            "text": "even that wrong he was like that could be cool we already three I was like that looks fun I am still team fat till the day I die and I as I pointed out when I when we first started selling team fat t-shirts should being small and I was like team Fat's a lifestyle it's a mindset of eating what you want to eat and this is what I thought cuz I have stewed on this since my my honor was called into question by one Colin War it was lambasted and what I've come to what I I I think a big part I thought we weren't going to interrupt anybody anymore that was the other thing we've been yelled at everybody one year in specifically said I'll never do it car never do the car I want to call it the fact that I think I am more team fat than Colin based on the fact that I'm too lazy to exercise and you exercise every day to maintain your team fat lifestyle I think that's a benefit to that yeah I think that's complete crap I'm just saying that I it was like I'm sure we're",
            "start": 752.56
        },
        {
            "text": "you exercise every day to maintain your team's fat lifestyle, I think that's a benefit to that, yeah, I think that's complete nonsense, I'm just saying that, it was like, I'm sure we're all familiar with the seminal film The American President, where I sat there and I was taking it on the chin last week from Richard Dreyfuss over here, but now I'm swinging back, and I'm Greg Miller, and I am the President of that movie is awesome, that was a great movie, God, I love movies, uh, uh, confused with Dave, where uh Kevin Kline just looks a lot like the President, not even a lot like he looks, just like it's pretty much the same actor, that was a great um in the spirit of mending our relationship, excellent Michael Douglas reference, God, I love that, that's one of those things I don't talk about enough, I **** love Michael Douglas, save it for the show, mention it this week about the game and now American President, I will stop right, I also a big fan of his, his work with Catherine Zeta-Jones",
            "start": 793.92
        },
        {
            "text": "I love Michael Douglas, save it for the show, mention it this week about the game and now American president I will stop right. I also a big fan of his his his work with Catherine Zeta-Jones, I'll talk about that another time. Now what happened to her by the way? By the way, I'm just going to throw this out there - I mean you can say how you want, everyone can make their own decisions right? Yeah they can know all about it. You come back at me on this Hamilton Aaron Burr, yes and you say... and you say that I exercise and therefore I'm not team fat but we went to Burger King after work just now, like an hour two hours ago, and you didn't get anything because I had dinner, I was like that's it, that's the end of dinner. You had two tortillas with some chicken in him Fried Chicken yes with hot sauce and American cheese.",
            "start": 842.04
        },
        {
            "text": "because I went to dinner, you was like that's it, that's the end of the S for dinner. You had two tortillas with some chicken in him, Fried Chicken yes, with hot sauce and American cheese. And my left, I had a Double Whopper and eight chicken nuggets and an extra-large Coke and a fry. Now, are those are those eight chicken nuggets including the two I ate? No, yes, I ate one. Oh what's can you believe, ladies and gentlemen, the fact that I just want everyone to know and realize that this is the party that you're not supposed to V. I know we're good. The other thing I forgot to mention too, sorry if if you're watching this on Friday, uh Colin and I are doing right now a live stream Black Friday Monopoly championship, and if you aren't catching it live, it'll be archived. I'm so sorry my CR gets usually not this heated, it's okay, I'm taking it, I'm just enjoying us. You know what it is? It's not really heated, no, no, not at all. It's cuz you're a guest, we're trying to show off for you. Mike loves he loves us, we love",
            "start": 888.76
        },
        {
            "text": "Heated, it's okay, I'm taking it, I'm just enjoying us, you know what it is, it's not really heated, no, no, not at all, it's 'cause you're a guest, we're trying to show off for you. Mike loves he loves us, we love him, we're peacocking right now. Like watching like I'm like in the middle. Mike, what's your topic tonight? Um, my topic is uh so here's the deal, big Disney fan, huge Disney fan, I love the Disney parks. Another one, another one. Yep, oh you love the park, oh I guess Tim loves the parks, do you love everything Disney like Tim does? Uh, Tim is hardcore on the princesses. I was going to say what if there what if 52 weeks ago we started a show and your topic was what princess you want to **** that is that how you would introduce yourself to the world? That's we started the we literally the entire time should we be like should be a little more reserved, we should hey this is a great we let's do a podcast yeah podcast great idea, hey what sh topics be let's make them reserved let's make let's just talk.",
            "start": 938.88
        },
        {
            "text": "should we be a little more reserved? We should, hey, this is a great idea. Let's do a podcast, yeah, podcast, great idea. Hey, what topics would you want to cover? Tim, what's your topic? What Disney girl would you go down on? Jesus, wait, the first episode that was very first episode there you go, it's a full circle. You're into this; we've made a Disney do I need to sing any sort of Queen? Alright, you're a Disney fan, alright, big-time Disney park fan. The big question on the table here is: Do you like Disney Parks, Disneyland, Disney World, all the other ones in the world? Uh, yes or no; and then why? No, that's not a question; that's not an answer. Oh my God, that's ridiculous. Yeah, I respect Disney Parks; I don't like them. I don't find any fun in the lines; I'm getting spun around; I'm getting motion sick; I'm going over this thing; I'm doing over that thing then the lines don't get",
            "start": 982.12
        },
        {
            "text": "yeah I respect Disney Parks I don't like them I don't find any fun in the I'm getting spun around I'm getting motion sick I'm going over this thing I'm doing over that thing then the lines don't get me started on the lines the food isn't great fast pass there you go yeah but I don't even want to go on the rides the other thing I'm getting dragged along then so then you got to wait in line where you hold people's purses while they go up and they get in the thing with the chains and the swings and they go around or you get in the Dumbo and the Dumbo goes around it's like **** the wrong ride I don't know which one you're going I went to I went to California and I went on Soarin' Over California Cruising California whatever where Putt-Putt talks to me and they spray like they spare air fresh that that made me sick music I was afraid I was going to fall in my death well you didn't though then I went over I went on the the the Tower of Terror there oh the tower The Twilight Zone Tower of Terror is awesome",
            "start": 1025.08
        },
        {
            "text": "Fresh that made me think of music I was afraid I was going to fall in my death, you well, you didn't though. You then I went over, I went on The Tower of Terror there. Oh, The Tower is awesome, especially because The Tower is awesome specifically because of The Twilight Zone. Uh, Tim yeah, at least that's the way it was when I used to go because The Twilight Zone is one of the great shows of all time and if people don't like The Twilight Zone you don't like science fiction and I'm calling you out right now. Get that Roddenberry respect ring is... you know it is. It's almost as bad as pretending that you're still a part of Team Fat, oh no, you're just going to pop but just running in the other directions, you know what I mean? My favorite thing about Scarpo too is like he pretends to be team fit and he just... needs shredded meat and he goes to Burger King and as if he couldn't sink any lower he gets his like disgusting plastic container with one goddamn patty, three patties.",
            "start": 1069.08
        },
        {
            "text": "Fit and he just needs shredded meat, and he goes to Burger King. And as if he couldn't sink any lower, he gets his disgusting plastic container with one goddamn patty, three patties when I play - my favorite part of that is trying to explain to the person who works at Burger King that you're low-carb, and having him just stare at you. Well, yeah, no, you walked up to him, you're like, \"Can I get a triple Whopper?\" And all of us in the back go, \"Whoa.\" And then you're like, \"But no bun, can you just put lettuce?\" And then the guy goes, \"What? Yeah...\" He lost it. He was like, \"Uh...\" And then they come back with just a plastic thing with a bunch of stuff in it to his credit, though - did you see how he arranged it? Yeah, it was like three beautiful patties laid out like in a procession, really, with onion rings on top, laid out like the logo from the Olympics for the most part. A little smattering if you will of mayo on the side.",
            "start": 1105.8
        },
        {
            "text": "out like in like like a procession really with onion rings on top laid out like they looked like the the logo from the Olympics for the most part a little a smattering if you will of mayo on the side just cuz he didn't ask but he's like I'm not going to put mayo on if this guy doesn't want it this guy's clearly a psycho circled in and his phone number just tucked right into the in between bun number or yeah bu one and two choke on my phone number so no nobody likes Disney, Disney sucks, this is the best dude it is it is so the best for so many reasons fireworks it's the best fireworks you're not getting better fireworks else fireworks are another topic but they're stupid too wow yeah they are stupid Disney fireworks though they're not stupid they're syncopated to music awesome music cuz number two the music it's awesome the theme everywhere you go every different land has its own, you go there's different food the Dole Whip is great what's a Dole Whip oh you haven't",
            "start": 1149.24
        },
        {
            "text": "music cuz number two the music it's awesome the theme everywhere you go every different land has its own feel you go there's different food the Dole Whip is a must try what's a Dole Whip oh you haven't experienced Disneyland then that's why you need to go in what's adult no we've talked about this a little bit right yeah Disneyland is the best yes I've been in I haven't been to any other ones but Disneyland is it's so it's everything in one thing Disney World's a little too big too big you have to spend too much time doing a little too much day at Epcot get that Epcot I like that Epcot the Hoop-Dee-Doo epcot's messed up what does that mean feeling it what I don't know it's just Disney I've been to Disney World maybe eight times and I've been to Disneyland twice I think and first of all Disney World isn't as fun for me anymore I got older I haven't been there since I was in high school okay I used to go every year um with my one of my best friends families because they would go every year",
            "start": 1191.68
        },
        {
            "text": "of all Disney World isn't as I got older I haven't been there since I was in high school okay I used to go every year um with my my one of my best friends families because they would go every year and it freaks me out I mean like it's it's a cool place I appreciate what Disney is all about I have a lot of love for Disney properties uh most of them I would say I really love you know I have a soft spot for a lot of that stuff it's just that this place is too weird for me it's like because you know underneath because you see the shows the old shows on the History Channel you read books whatever it's just like a whole city of people underneath yeah and there's just old rides that they don't update or they they just kept around forever Epcot Center itself or like what's that one ride where you're in the the globe oh it's uh the Planetary Space no no like the one yeah like that shit's old like there's like there's just stuff there that I'm like this doesn't feel right this feels like",
            "start": 1237.0
        },
        {
            "text": "where you're in the globe, oh it's uh the plan space no no like the one yeah like that shit's old like there's like there's just **** there that I'm like this doesn't feel right this feels like I'm trapped in another time and I don't like it like when I when I I like Six Flags parks I like you know Universal Studios is awesome like Cedar Point is still my favorite park anywhere in the world um but so Disney's got a special place but I don't need I don't feel the hankering to go there I don't like Disney as much as Tim does but I know I know full I know full well how much Mike loves because we went to Tokyo Disney right we just want to point this out we've been we've been to Japan twice we stayed on the property at Disney in Japan the first time you both times you have not gone into that Park you Tokyo Disney you that's next level for me I don't know if I can do it that's just too much for me oh my God too much Tokyo too I'm like I'm going back to the hotel and I'm going to watch",
            "start": 1276.56
        },
        {
            "text": "Park you Tokyo Disney, that's next level for me. I don't know if I can do it, that's just too much for me. Oh my God, too much Tokyo, too. I'm like, I'm going back to the hotel and I'm going to watch something on TV that I can't understand. No, I've only been to Disneyland. Yeah, the Disney park in Tokyo is like... did you go to Tokyo Disney? Yeah, oh first year I went to TGS we had we flew in and we were we had like an extra night and none of us could sleep and we were like let's go to let's hit up Disneyland for a couple hours, get wild and just go crazy. And it's uh it's an experience. It's like cuz they have stuff most of it's similar. They've got the Indiana Jones ride that we could get to - that's Indiana Jones. They had the Tower of Terror, Tower of Terror definitely not the Twilight Zone Tower of Terror by the way. It's like this ridiculous... did you go to the I didn't say I didn't actually get on one of the tower te I just saw it. Yeah, it's like this is ridiculous. Like Museum story about this.",
            "start": 1320.44
        },
        {
            "text": "of Terror by the way it's like this ridiculous did you go to the I didn't say I didn't actually get on of the Tower of Terror I just saw it yeah it's like this is ridiculous like Museum story about this artifact that comes alive and tries to throw people in elevators was Eddie Murphy involved uh he might have been involved he's just there in a Disney movie oh my God Murphy was really bad but um wait to he Haunted Mansion you're right you're right Tower Terror yeah yeah yeah a Steve Guttenberg movie with Tower a Tower of Terror film that's a fact I like that I know there you go the guy by the way is one of the only people that can by far out reference me that I know what with movies with movies yeah yeah like because you you go deep into the roster I can tell you who was in movies and what the titles were but she'll go like who directed them who co-graphed best friend is that you're a trained filmmaker uh I guess is it also be you owned a video store at one point correct",
            "start": 1360.76
        },
        {
            "text": "movies and what the titles were but she'll go like who directed them who co-graph best friend is that you're a trained filmmaker uh I guess is it also be you owned a video store at one point correct a video game store video game store I actually managed a bunch of video stores like Blockbuster Video oh that people remember that you read about those in your you managed to Blockbuster I did what dude I would have I would have absolutely loved you and here's why yeah if you had been my friend back then we would have been friends or would have just we would have friends if I knew you yeah that's true uh I would have come in and you would have given me free movies and Butterfingers I just really like the butter fingers that part of the Blockbuster experience for you dude the Butterfingers yeah yes butter fingers are we need to make blockbuster its own concession stand yeah we should write that's for another day we'll have to do that I want to come back into that for that one guess okay",
            "start": 1407.76
        },
        {
            "text": "yes, Butterfinger are we need to make Blockbuster its own concession boxes yeah we should write that's for another day we'll have to do that I want to come back into that for that one guess okay yeah Blockbuster I I have a soft spot in my heart for Disneyland I grew up in Southern California I used to go to Disneyland once a year how many people you work there I was going to say still know people that work there I have friends that still work for Disney because if you're in Orange County chances are at some point you've worked for Disney if you're in theater or entertainment on some level so all of my friends what they they have this thing called overhire where uh when they're striking or loading in a set they have over hire people that they just randomly hire to to come in and and take stuff down cuz Disneys insane like the second something's done they strike it it has to be out of the park and done by the next day when the park opens so think about all the installations you've",
            "start": 1449.16
        },
        {
            "text": "Stuff down cuz Disney's insane, like the second something's done, they strike it. It has to be out of the park and done by the next day when the park opens. So think about all the installations you've ever seen there - how many people do you think it takes? And it's all coordinated, and they just go in there... I worked with one of my friends; um, one of my friends who does lighting for a lot of stuff at IGN was like, \"Yeah, I got to go. I got to um, one of his guys was like, 'I got to go. I got to go to the Disney thing.'\" And he hadn't been up since like 6:00 in the morning, was like going to go all night and then come back to do to finish our thing... And I was like, \"Dude, you're insane, crazy.\" Yeah, making that money hustling, making them dolla... appr yeah. I mean, I just - I love Disneyland kind of for the opposite of why you're saying you don't like it. I like that feeling of being at a different time, like when they redesigned some of the stuff... They redesigned Tomorrowland, and it was like",
            "start": 1485.12
        },
        {
            "text": "of why you're saying you don't like Disneyland I like that feeling of being at a different place in a different time, like when they redesigned some of the stuff. Um, they redesigned Tomorrowland and it was like they kind of made it that retro-future and I was like this is kind of cool. Been on Space Mountain over the last few years with the Michael Giacchino score - how do you pronounce this? I screwed this up, the guy did the music for Lost. Wow, I had a brain fart there. Uh, wow, hammered ladies and gentlemen, he did the score for Lost. Okay, uh, that is the same guy who did the music; he's rebranded the music for Space Mountain. It's really legit - it's his version of Space Mountain. I just put in earbuds and I put Duel of the Fates in, that's a good idea too. To rip through that and just imagine Darth Maul not dying, you know what I mean? Yeah, is that how it goes? Like, just everyone close your eyes for a second and imagine a world where Darth Maul didn't die. I'm not I'm",
            "start": 1522.56
        },
        {
            "text": "that and just imagine Darth Maul not dying, you know what I mean? Yeah, is that how it goes? Like, just everyone close your eyes for a second and imagine a world where Darth Maul didn't die. I'm not, I'm confused - is there is there a Star Wars thing here or are you I just Disney own Star Wars now have they done that? That's that's the one thing if they start doing Star Wars and Marvel **** then I'll be like all I mean yeah they've done I mean they've had Star Wars forever, there's a Stars and uh it's yeah there's a ride that like it's one of those like Motion theater things you can now there is racing yeah racing now is racing. They also do this like Star Wars installation thing where they they teach you they teach little kids a Jedi Academy and it's the best oh yeah yeah yeah CU they teach little kids how to be Jedi, you need to make your little girl a Jedi that's right there's a video on YouTube that if Kevin was here he would put in I'll find it I'm um of this little girl and it's like the",
            "start": 1566.0
        },
        {
            "text": "Kids, how to be Jedi? You need to make your little girl a Jedi. That's right, there's a video on YouTube that if Greg was here, he would put in. I'll find it. I'm um of this little girl and it's like the Mace Windu type character that's like teaching the kids how to be Jedi and he's like, \"Oh, Darth Vader's here. We have to defeat him.\" And then Darth Vader walks up and the girl just gets down and submits to the dark side. It's the best thing in the world. Awesome! That's amazing. Side note: Tim, Darth Vader walks in and is like, \"I'm going to kill all of you unless you submit to the dark side.\" What do you do? To DV, to the dark side... yeah, to DV, Big. He doesn't let you submit to the dark side. He comes in, he kills everybody. Period. I think he would kill all four of us, but he might see something special in Tim that he can...",
            "start": 1606.6
        },
        {
            "text": "girl straight up kneels though it's the **** best I just think to if I can lament on this for a second I feel like he would kill all four of us but he might see something special in Tim that he can like exploit darkness in in my heart I can make him strong you know it this is Darth Vader coming at me kidding me you try to pull that Han Solo **** where you just take the gun out and start shooting he just does that that **** where he's like I would do that so Boba Fett came out and I'd be like oh **** it's Boba Fett all right you can kill me now oh **** it's Boba Fett Boba Fett yo it's cool how you're don't mess with that oh God I was you remember me I wasn't that bad IGN tweeted out the best picture of Boba Fett the other day though which was the uh because the the 2016 movie is supposed to be maybe about Bounty hunters yeah and uh the the that awesome shot of him like holding the gun on this on Jabba's skiff and Return of the Jedi with the blue skies behind him it looks so",
            "start": 1648.32
        },
        {
            "text": "Is supposed to be maybe about Boba Hunters, yeah, and uh, the the shot of him like holding the gun on this on Jabba's skiff and Return of the Jedi with the blue skies behind him it looks so good. Oh it's so good that shot is so awesome it looks so good he looks awesome in the armor with like he had the coolest armor by far and the coolest helmet, looks like a janitor with a gun and a helmet his frumpy body you're a piece of work with your Boba Fett comments how dare you sir you can talk about Bossk or Zuckuss like that but no one's talking about Bossk come on about Boba like talk about IG-88 like that three just throw Boss down it's okay, okay there you go. I think I think when I trace back you know like our time in second grade we went to Disney World drove the motor home from Chicago to Orlando W you had a motor home yeah that's awesome I've always wanted a motor home it was fun it was cool there was good times and bad times in that motor home as you as you know I",
            "start": 1692.56
        },
        {
            "text": "to Orlando, you had a motor home, yeah, that's awesome. I've always wanted a motor home; it was fun, it was cool. There was good times and bad times in that motor home, as you know, I was a kid, so I puked a lot, so that wasn't fun for them. My parents were weird about me puking a lot; they said it's because you're a kid, it's because you're weird. I think kids puke a lot too; they're always one step away from just disaster. Greg Miller, those hot dogs – I ate a lot of hot dogs there. Now we're on to a different story where I ate a couple of hot dogs, yeah, and then went to a bouncy castle, and then went and vomited all over a porta potty like at the fair. This has nothing to do with it, and then another time I ate cherry pie and vomited at another fair where she was there with the bucket, puking her life away and regretting your decisions; you're like a comedy relief in an 80s film, yeah, it's like hey let's take",
            "start": 1742.28
        },
        {
            "text": "pie vomited at another fair where she's there with the bucket puking her life and regretting your decisions you're like a comedy relief in an 80s film, it's like hey let's take a break from this weird teen drama to show the young kid with glasses all over the place true that's I can't argue these facts that you're giving but went to Disney World I'm having a good time but I was always against rides I don't like the rides that twist me and turn me and make me feel sick or whatever have scary drops or whatever and so we at my M you know we you're in line forever because these places suck and you get the chance doing it so wrong in 1990 whatever there weren't fast passes in the early 90s I'll give you I'll give you guys a little pro tip though if you ever want to go to Disneyland Disney World and you want to go there's no lines fake wheel share no well that's good too the the thing that does work also fake hip displasia that also works also vomit",
            "start": 1778.8
        },
        {
            "text": "to go to Disneyland Disney World and you want to go there's no lines fake wheel share no well that's good too the the that does work also fake hip displasia that also works also vomit that one that does not work yeah so the so my Pro tip is this we went uh in September this year the first week in September nobody no lines starting yeah yeah School St you can just fly through anything do anything Easter or Christmas one of those definitely not Christmas not Christmas I'm sorry I apologize anyways yeah ask every is there anything scary on this ride there's nothing scary on this ride get on Pirates of the Caribbean Caribbean told us did I tell us show okay then I won't even go through new leners every time I so we're thanks for watching the GameOverGreggy Show you pie sh I usually get in the boat and you're going you're going and it starts to go like I'm like this sounds like a ride Mom she's like no I said it was fine I'm like this sounds like and like there's that drop at the very beginning two drops",
            "start": 1822.48
        },
        {
            "text": "going you're going and it starts to go like I'm like this sounds like a ride Mom she's like no I said it was fine I'm like this sounds like and like there's that drop at the very beginning two drops there's two and then Wily Wonka came out and started saying forget it yeah anyways the drop happens and I immediately just lose my **** as a second grader and I'm screaming and crying and scream for help help and I'm ruining the ride for everyone on this thing that waited like the 5 hours in people probably tell this story about sure and my mom's like I'm my mom's like I'm right here and I'm like not you The People Behind the Walls I wanted that ride to **** stop and for them to open one of the **** doors and get me out and it never happened I struggled and so like from that moment on every **** ride we were in line for was like is this a ride no no it's no he's scared of Pirates of the Caribbean oh really yeah well no you should be fine there was like one where I forget what",
            "start": 1866.84
        },
        {
            "text": "on every ride we were in line for was like \"is this a ride? no, no he's scared of Pirates of the Caribbean\" oh really yeah well no you should be fine there was like one where I forget what it was where you get in the theater and you move around and like like a family you go through their timeline or whatever like they start they're all robots or whatever and they start as babies and then they become something whatever oh that I think it's the same one that's \"it's a small world\" again yeah okay there you go right between between the first and second section when we started spinning like I grabbed the thing and it just did like the hardest stop like something abruptly stopped and we were like that was probably for us like if you if you had to get out of here I was like oh thanks Mom that's fine looking out for you yeah that's good something right stop stop stop I don't know have you taken your daughter uh I have taken my daughter twice how old is she she is less than two",
            "start": 1910.8
        },
        {
            "text": "Mom, that's fine looking out for you, yeah, that's good. Something right, stop, stop, stop. I don't know, have you taken your daughter? Uh, I have taken my daughter twice. How old is she? She is less than two years old; she's almost two years old. Uh, I took her six months ago, which was so here's the reason why I took her cuz uh kids are free till two, so I'm like I'm going to abuse the situation and take my child now cuz it won't cost me anything until I have to get into that. I've considered having kids just because of that. Yeah, wait, do you get in free too? But the kid gets in free, so you're like doesn't remember anything has a burden weighing you down, yeah, like a Yoda that keeps puking and **** your back, yeah, like me might it's like also also is it just like it must be traumatizing for a child who doesn't really understand the world to see a giant mouse come at her. She uh here's the funniest thing my kid freaked out when she met like Minnie Mouse and Mickey Mouse; she's like \"CU\"",
            "start": 1946.44
        },
        {
            "text": "for a child who doesn't really understand the world to see a giant mouse come at her she uh here's the funniest thing my kid freaked out when she met like Minnie Mouse and Mickey Mouse she's like \"they're terrifying\" but my kid loves Pirates of the Caribbean, especially Johnny Depp - she's a big fan though yeah she's all about Jack Sparrow and they've redone Pirates of the Caribbean to be all about Johnny Depp throughout it he's like popping up and doing his stuff yeah and it ends with him really just being himself that's what he does yeah when he's not making bad movies, he's weird so he would do something like that he's like \"I'm going to spend an entire year doing this ride for every day, 18 hours a day\" I mean he really is method he's that character part is a robot M he also plays the same character in every movie",
            "start": 1990.52
        },
        {
            "text": "year doing this ride for every day every ride for 18 hours a day. Ride, I'm just going to's method. He really is he's that character part is a robot M. He also plays the same character in every movie yeah just like just like Jeff Goldblum. He does Goblin but goblin does it better let's be honest yeah there's no one like I said I declare on Twitter today Jeff Goldblum's on that Jurassic World movie or whatever the **** it's called, that biggest mistake of that I don't give a flying **** about that is he not it do we know Dr. Malcolm? Not we don't know if he is not he better I'm pissed he's not in the trailer though it should have been a fun cameo wasn't in the third one so yeah that was different him but they they gave him they gave him the starring role in the second film right yeah and he botched the **** out of that. I don't blame that him some say botched I wouldn't say he botched he wouldn't need The Botch anyway totally dropped the ball yeah yeah that was what I always wanted I wanted",
            "start": 2033.2
        },
        {
            "text": "**** out of that I don't blame Tim Gettys for saying he botched it, I wouldn't say he blocked it, he wouldn't need The Botch anyway, totally dropped the ball, yeah, yeah, that was what I always wanted, I wanted the dinosaurs to come to land like to deal with us not be on some stupid island we could just nuke and be done with it, I want them on land, are they going like PT boats landing, that's what happened, remember, yeah, that's what I'm saying, I like that storyline if there was like some sort of hybrid dinosaur that they made and we're not sure if he jumped over a 40ft wall or not but we're not sure how big it is to show I think in this scene potentially could there just be scratch marks that lead all the way up the wall yeah and then but they're not sure if he actually climbed the wall or not, I'm out of Chris Pratt's involved though can Chris can Chris Pratt do some sort of really bad southern accent the whole time that would be preferred awesome you got something going here it's a winning formula",
            "start": 2073.16
        },
        {
            "text": "of Chris Pratt's involved though can Chris can Chris Pratt do some sort of really bad southern accent the whole time that would be preferred awesome you got something going here it's a winning formula around this table right that them using the Jurassic Park like piano theme song though I still got chills even though it was a shitty trailer it's bad okay it's going to kill I can't remember I'm I'm I really wanted to make a reference and I can't do it so I can't do it but what was the M. Night Shyamalan movie that happened in the wilderness The Village oh my God I hate I was going to say what what if it all turned out to be a sequel to The Village the village is so good should be another Topic in time he will oh my God put on your list M night I want on that one too dingdong love him yeah I love those everybody calm down it's a different topic you're not going to steal this all right",
            "start": 2115.6
        }
    ]
}