{
    "id": 2144,
    "video_id": "MFsAvu07X8M",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Power Rangers vs. Voltron Commentary - Kinda Funny Reacts",
    "description": "Go watch the video now! https://youtu.be/HNIyztmU8dk\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1477756801,
    "duration": 375,
    "transcript_chunks": [
        {
            "text": "what's up guys I'm Tim Gettys this is Greg Miller hi here you're looking at Ishimaru's latest minute matchup we're talking the Power Rangers Megazord versus Voltron me and Greg were both featured in this video there I am I'm right I'm right there it's me the fat one n I'm not the P one I'm Hunk hunk you idiot I don't know whatever that was the thing that was the funny thing about blue yeah you're about to see yourself over here in the Blue Ranger one yeah that was the thing about that was interesting about this uh including the entire Voltron cast and everybody who worked on the production and all the Power Rangers only Anthony Carboni knew anything about Voltron that's how popular Voltron is we all knew Power Rangers of course you did look at this Power Rangers are awesome dream come true I got to morph yeah that's being the Blue Ranger not so much my dream come true mean Blue's my favorite color though that's my thing I like I'm not a red guy you know the I'm definitely not a black guy",
            "start": 0.12
        },
        {
            "text": "got to morph yeah that's being the Blue Ranger not so much my dream come true mean Blue's my favorite color though that's my thing I like I'm not a red guy you know the I'm definitely not a black guy but I'm a blue dude for sure you are a blue dude but Xavier Woods uh we got uh Danny Shepard himself hisaw we got Mario Takahashi from GamesRadar+ we got uh this this girl Tara Maguire I think her name is Pink Ranger and then you guys on the Voltron team sure Anthony Carboni I Justine the guy from Corridor Digital whose name I can never remember and thank you Nico yeah yeah oh and then uh the guy who actually is a Power Ranger Yoshi the actual current or last season Blue Ranger yeah very cool and you left off your team Danny Shepard is your red ranger I said that you said it was a Danny Sheard Video I said Danny Shephard You said Danny she so here's things get crazy there's the giant robots they're doing CG yeah damn that's us right there it's me on green screen you didn't get to do any of the",
            "start": 37.4
        },
        {
            "text": "I said Danny Sheard You said Danny she so here's things get crazy there's the giant robots they're doing CG yeah damn that's us right there it's me on green screen you didn't get to do any of the green screen stuff like I did no no no you weren't as cool as me you didn't get to be in a cockpit you didn't get to move the handle bar there other people in in the cockpit that's what stunt doubles are for I'm just there you're just face uh but this is my favorite scene in the entire thing Max and Brian we got Brian Altano and Max Scoville as Bulkhead little musical cues and all that stuff so perfect it's so Altano and it's so Bulkhead yeah that's great one of my other favorite scenes is when the Voltron first the the big ass robot I don't know what the **** it's called the formed Voltron that is Voltron steps his foot down all the Power Rangers like oh **** it's like damn this is an impressive ass video well I mean that's what Danny does of course you know Danny he's the guy who",
            "start": 85.56
        },
        {
            "text": "that is Voltron steps his foot down all the Power Rangers like oh **** it's like damn this is an impressive ass video well I mean that's what Danny does of course you know Danny he's the guy who did well is Mah Hawk in general I should say are the guys who did Nightwing the series we brought them on up at noon back in the day kind of were there like that was their big breakout Nightwing the series and since then yeah they've done a bunch of these that are really really well done I of Flash versus Quicksilver they've done that one Deadpool vs. Deadpool is really good yep all their minute match ups been super awesome this one obviously the most ambitious I think this the best cuz we're in it oh that that too but I think this might like be some form of record of like craziest collaboration between people when you look at all the people in people they brought in it's super I mean it's an honor for me to be even alongside these people so that it's super cool and be honored to be here",
            "start": 125.12
        },
        {
            "text": "between people when you look at all the people in power rangers they brought in it's super I mean it's an honor for me to be even alongside these people so that it's super cool and be honored to be part of the most ambitious thing ever they're like there's CG robots fighting yeah hell yeah hell yeah hell yeah super super dope Jeremy shout out to Jeremy he's the other one of the ismahawk guys um very talented behind the camera and he definitely made us look damn good um we're kind of talk over this whole thing cuz we want you guys to go check it out on their Channel youtube.com/ismahawk uh support them this is such a cool video and I I want them to grow they're the type of channel that man this guy just like lives and breeds creating cool stuff so I I hope that uh he gets a lot of love and support I love the cockpit shots of the power rangers like what what's crazy to me is how good this looks compared to the original Power Rangers movie oh yeah in '95 you think this looks better oh my",
            "start": 157.2
        },
        {
            "text": "Support, I love the cockpit shots of the Power Rangers. Like, what's crazy to me is how good this looks compared to the original Power Rangers movie. Oh yeah, in '95, you think this looks better? Oh my God, this Megazord looks way better - way better! If you Google everyone, Google search Power Rangers Megazord uh movie and just see what happens. It's like it's bad. Like, I think I could come up with CG that looks like that. But you don't know anything about doing it. I definitely could do it. I would do it. Citation, citation are big yes yes. So we got them fighting in the skies and doing a whole bunch of fun Shenanigans and whatnot. Uh, there's a couple fun moments this movie or this uh video is very uh tongue and cheek and parody and kind of that's what I mean that's what the Voltron and Power Rangers are. A lot of the let me clarify that that's what Power Rangers were. Nobody watched Voltron. I have no idea if there was a moment where Danny was like can you guys sing the Voltron theme song.",
            "start": 200.88
        },
        {
            "text": "\"Reactions a lot of the let me clarify that that's what Power Rangers were nobody watched Voltron I have no idea if there was a moment where Danny was like can you guys sing the Voltron theme song and everyone's like no Voltron, the friendly robot he's got a heart as big as a big robot yep he's running around in punch and things so we got the swords we got a bunch of cool stuff happening so there's a whip. Ex D Woods gets a bunch of cool lines cockpit things are happening now don't ruin the whole thing don't tell them everything that's being said I want them to know they they're going to watch it over at youtube.com they don't you don't need to tell them everything what's bad though Greg what is bad about this what's bad it's I'm dropping some exclusives here some real damn exclusives who wins this us team Voltron the original people which is **** **** the Power Rangers should have won and guess what the whole internet agrees cuz all the comments are saying this is bull**** ****\"",
            "start": 242.72
        },
        {
            "text": "this us team Voltron the original people which is **the original creators** of the Power Rangers should have won and guess what the whole internet agrees cuz all the comments are saying this is bull **crap** the Power Rangers should have W so if you stay to the end of this video you'll see that there's a nice little umeg Easter **egg** thing so you can experience that for yourself but I'm telling you right now they're working on a director's cut it's going to be a tighter edit with the addition of the Green Ranger and the dragon Zord oh really oh yeah it's going to be awesome R is going to win there like they **should have** in the beginning hell yeah they are now as a member of Team Voltron I will tell you yes I hope the Power Rangers win they are the better team they are the better team it's absolutely true anyway here you go that's Danny look look at it no that's Danny that's move for a second why did you what do you do with the beard man their video was **SpongeBob** control not not our video",
            "start": 288.44
        },
        {
            "text": "true anyway here you go that's Danny look look at it no that's Danny that's move for a second why did you what do you do with the beard man their video was SpongeBob: SquarePants control not not our video you can tell like how long he's been working on this video from the beard I've had I've seen this before his next minute matchup is going to be Jesus look at him that's not Jeremy I don't even know what they're talking about here anyways ladies and gentlemen youtube.com/ismahawk they are super talented guys they're super awesome please go so show some support on this video share it with all your friends so they can do way more cool stuff and hopefully they invite us back to some things I was talking to them recently about getting you involved in another one it's going to be good is it the Blob vs. someone Clark Kent vs. someone it may or may not involve Batman",
            "start": 331.84
        }
    ]
}