{
    "id": 65,
    "video_id": "WZqI0fUK33s",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "The Sandwich: Best Food Ever? A Conversation with Colin",
    "description": "Is the sandwich the best food of all time? One viewer asks, Colin answers! \n\nToday's topic was submitted by Daximunlove. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1361455236,
    "duration": 439,
    "transcript_chunks": [
        {
            "text": "they the the cold cuts are pre-cut who the **** buys pre-cut cold cuts first of all that's horrifying that's weird and then they cut them like a h like so thick like these thick slabs of like turkey it's like who wants to eat it like that what's up everybody Welcome to A Conversation With Colin I'm Greg and this is my roommate Colin now sometimes Colin says crazy stuff so every Tuesday and Thursday I reach into my random topic pile pull one out read it aloud Colin and I talk about it you have a great time on the other side of the screen if you like the idea of this show like the video subscribe to us on YouTube Share us with your friends Colin are you ready yes topic of conversation is the sandwich colon the best food of all time question mark this was submitted by Daximunlove Weird names is the sandwich the best food of all time no I mean it depends on how you define the sandwich because I think I think you know the sandwich obviously is two pieces of bread with meat in between",
            "start": 0.12
        },
        {
            "text": "names is the sandwich the best food of all time no I mean it depends on how you define the sandwich because I think I think you know the sandwich obviously is two pieces of bread with meat in between it so if you were to count the cheeseburger as a sandwich that's the cheeseburger then the cheeseburger is the best food all time so the answer is no cheeseburger is the best food of all time yes wow yeah that's a it's Pizza clearly is the answer oh pizza's up there yeah cuz it's so it's so many different things too that's the other thing you got to go with you cheeseburg be so many different things not really yeah yeah oh yeah you got different toppings you got my my cousin Carl used to come over to our house on Long Island let me tell you a story I'm I'm I'm ready to go on the journey back on Long Island this place I'm from we would have barbecues cuz people like to be outside onl sure it's beautiful and um you're out there you hear the the fairies going by the fair you got the long",
            "start": 44.48
        },
        {
            "text": "on Long Island this place I'm from we would have barbecues 'cause people like to be outside only sure it's beautiful and um you're out there you hear the the fairies going by the fair you got the LIE you talk about how he you got the bab uh that's how we talk yeah so my cousin Carl would come over and he would make these great cheeseburgers that were um that were like all spiced and stuff so they were like meatballs basically and you would make patties you just add some of American cheese put them on so that's like one kind of cheeseburger almost like a almost like a you can have like almost a meatloaf like a thick thick cheeseburger uh you can have just a standard patty you can there's and then you have the toppings you can have mushrooms and sautéed onions you have lettuce and tomato you have avocado different kinds of cheeses you can put mayo on it you can put ketchup on it you never put mustard on the cheeseburger ever that's that's bad for me the perfect",
            "start": 79.76
        },
        {
            "text": "and tomato, you have avocado, different kinds of cheeses. You can put mayo on it; you can put ketchup on it. You never put mustard on the cheeseburger ever, that's that's... um D for me, the perfect cheeseburger is the one I know from Burger Joint here in San Francisco. I know what I'm getting into, that like you know I always talk about having to be in a mood for a burger. I'm not just ready; I don't I'm not one of these guys who just orders burgers from everywhere. But I like The Burger Joint because I know what I'm getting every time. I feel like it's a good standard burger, but then what I do is I take the... I ask for extra pickles, no onions, put pickles on one side, ketchup and mustard dust on one side, patty on the other, and then you put the pickles back over here, ketchup and mustard, and you put all together maybe some a little bit of lettuce. I don't put all the lettuce on there; that's what they do. It's got tomato, I like the tomato too. Yeah, I mean, the perfect cheeseburger for me at a place like",
            "start": 126.04
        },
        {
            "text": "you put all together maybe some a little bit of lettuce I don't put all the lettuce on there that they do it's tomato I like the Tomato too yeah I mean the perfect cheeseburger for me at a place like that is just the American cheese mayonnaise ketchup and onion okay and that's it yeah yeah yeah um a good Bermuda onion man goes a long way on a cheeseburger you got that that kick on the cheeseburger I'm going to give a shout out real quick to a great cheeseburger place in San Francisco um called Bullhead that you and I have been to before Portillo don't even he's given a shout out for it uh and Bullhead is at Haight and West Portal in San Francisco um right off the L line maybe yeah there's like a Muni terminal there much pay and uh Portillo Portillo I'm linking to the Portillo conversation right now and uh so that's a great place if you guys want a great cheeseburger in San Francisco um but uh but otherwise yeah the sandwich is good but see the thing about sandwiches in San Francisco is",
            "start": 158.56
        },
        {
            "text": "now and uh so that's a great place if you guys want a great cheeseburger in San Francisco um but uh but otherwise yeah the sandwich is good but see the thing about sandwiches in San Francisco is that they're not very good and so we have to we have to have it's the same thing with Bagels had we had these conversations exactly you've mentioned before in New York you go to any Deli right there's their Deli on the corner and they all make great sandwiches there's there's standouts right like IES makes a really good sandwich like that's their whole thing they put the mozzarella sticks in I mean it's a crazy sandwich it's not the sandwich that I like kind of grew up knowing L people like that kind of sandwich good Darby Dan was really good out in South City uh um we have Jimmy John's now which is pretty good uh up there Market but to me a sandwich has to have a a very certain a very specific thing it has to have board meat on it okay Boar's Head meat is very rare here for some reason",
            "start": 201.8
        },
        {
            "text": "which is pretty good uh up there Market but to me a sandwich has to have a a very certain a very specific thing it has to have roast meat on it okay roast meat is very rare here for some reason and the thing that really bothers me when I go to Safeway for instance and try to get cold cuts is that they the cold cuts are pre-cut who the **** buys pre-cut cold cuts first of all that's horrifying that's weird and then they cut them like a h like so thick like these thick slabs of like turkey it's like who wants to eat it like that no I I totally I mean I I don't remember ever going to a deli and having it be like a big deal if it was sliced or not sliced I don't remember that kind of stuff so I'm not horrified by that I understand wanting it thin the fact that they do the dinner roast at Safeway turkey where they cut thick it's like it's right off the breast of the turkey that I like and and then outside of that I can go either way",
            "start": 236.76
        },
        {
            "text": "it's thin the fact that they do the dinner roast at Safeway, where they cut it thick, it's like it's right off the breast of the turkey, that I like. And and then outside of that, I can go either way. Andronico's you should go to Andronico's get your meat there. I know it's a I pay like $17 for a pound of tur- we go yes it's expensive when they cut it in front of you, you're getting the service, well, well Safeway, I make them cut it okay and sometimes they I'm like I'm like can I get a you know can I get a pound of yellow American and they go to reach for the like the gross inch thick slabs of yellow American I'm like no no no no no no no sorry guy. And and one new guy because I deal with the same and they know, like I think CU I'm I'm sure not the only person from the east or from a place where we get cold cuts that are good to be like we don't want cold cuts that have been sitting in this thing for that are cut disgustingly thick we don't want that. Um so I don't think I'm the only person that",
            "start": 277.84
        },
        {
            "text": "get cold cuts that are good to be like we don't want cold cuts that have been sitting in this thing for that are cut disgustingly thick we don't want that um so I don't think I'm the only person that that does that but one not too long ago one new guy was like uh that I've never seen before he's like oh this is this is the only way we're doing it I'm like no no no I don't think so and he's like I'm like I'll talk to your manager you can cut the cheese and and he any and he he cut the cheese for did he giggle up the cut the cheese line yeah of course all right you're pretty cool uh and then I go to to Louie's on 20th yeah uh and get they have Boar's Head there um and I get pepper turkey because Boris had pepper turkey with that orange hue man that's the best you put that on on a sandwich lettuce lots of mayonnaise thinly sliced onion just one thinly sliced piece of onion American cheese on let's say I don't know I can go for like just toasted white bread I can go for Dutch crunch",
            "start": 316.04
        },
        {
            "text": "Lettuce lots of mayonnaise thinly sliced onion just one thinly sliced piece of onion American cheese on let's say I don't know I can go for like just toasted white bread I can go for Dutch crunch I mean I it really depends on I don't like the bre the Dutch crunch is this new phenomenon which I enjoy but sometimes way too hard you get that like you feel like your teeth are pulling on like I don't want yeah I understand that I mean ideally um you would get it you know straight out you know even a kaiser roll that seems to be a rarity out here like I don't you're right and that that is a damn shame or an onion roll is another good another good uh a good thing to do so is the sandwich A Fine Food Greg yes the sandwich is one of the great foods does it affect me because I have celiac disease and I'm not supposed to e bread yes do I ignore the fact that I have celiac disease every day like a pro um am I going to regret it almost definitely and uh that's the end of that story yeah all",
            "start": 350.0
        },
        {
            "text": "and I'm not supposed to eat bread, yes do I ignore the fact that I have celiac disease every day like a pro um am I going to regret it almost definitely and uh that's the end of that story yeah all right cool so Daximunlove no sandwich not the greatest food but it is a Fine Food uh ladies and gentlemen what do you think what what's your favorite food let us know in the comments below then also suggest future topics of conversation until then like this video subscribe share it with your friends please cuz we are ready to sell out as soon as possible I tell you what Colin thank you so much for your time thank you ladies and gentlemen have a conversational day what a I'm going be I'm going to be honest with you I like Olive Garden",
            "start": 395.64
        }
    ]
}