{
  "id": 522,
  "video_id": "0UWDUr4sph8",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Will We Run Out of Things to Talk About? - The GameOverGreggy Show Ep. 58 (Pt. 2)",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\nNick Scarpino wonders if we will ever burn out talking about stuff.\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1421136001,
  "duration": 1112,
  "transcript_chunks": [
    {
      "text": "Nick , what's your topic? My topic, of course, comes from Twitter as all topics do for the show, right? All four of them? No, just yours. Just mine. Yes, yours. That's why people should follow you, Nick Scarpino. Tweet you topics if you have a topic like hash topics so you know it's a topic, not just a question like Powerman 293 topic for the GOG show. Almost Powerman 5000, little off. Well, Powerman 5000's gone down a little bit. Maybe it is Powerman 5,000. We can't, we're not going to lie and say we're 5,000. We're not. We're more like 293. Uh, are you guys afraid of, uh, of Colin and Greg burning out due to having to talk so much during the day? You guys are talking now. I fear that every day. I was really hoping I was just, are you afraid of Colin and Greg period? Oh, I'm mortally afraid of you guys. And then Colin opens his phone and he's Power Man and then we just **** go. You ready to go? And a giant ant burrows through the wall. We out. This is what games. I saw Power Man 5000 one time. No, you did? I, I did. I think",
      "start": 2.92
    },
    {
      "text": "opens his phone and he's Power Man and then we just **** go. You ready to go? And a giant ant burrows through the wall. We out. This is what games. I saw Power Man 5000 one time. No, you did? I, I did. I think that's, I've only been to like five concerts in my entire life. Most of them have been like small concerts at like a Starbucks where my friends like, I'm singing tonight. I'm like, ****, I guess I'll go'cause I got nothing else to do and there's coffee there. Uh, but the one concert that I have been to was the Summer Sanitarium. Oh, hell yeah, dude, which was down at the Coliseum in LA. It was Metallica was the headliner, but it was Metallica, Korn, System of a Down, Power Man 5,000, and Kid Rock. Oh, Kid Rock. That's a pretty, that's a pretty knocked him out there. It was one night hilarious and Powerman 5000 came on and they did the one song that everyone knows. Yeah, and then they did one more song and then they were done. So actually of all of them, System of a Down was amazing. Oh, were amazing and Metallica which I",
      "start": 80.16
    },
    {
      "text": "and they did the one song that everyone knows. Yeah, and then they did one more song and then they were done. So actually of all of them, System of a Down was amazing. Oh, were amazing and Metallica which I was never a huge fan of, uh, because I just, I didn't like their sound on their albums, um, or CDs, I guess. An amazing live band. Like to be a CD too. I know no one he. I'm not sitting. I, I don't want to be the guy that I'm sitting there spinning records and I'm like, oh no, it sounds better on the vinyl. Never touch vinyl. I don't want to touch vinyl. I'm all digital. I don't my own vinyl. You know who likes, you know who likes vinyl a lot? Ramon. Ramon. Uh, anyway, they were amazing. What was the topic? Oh yeah, are you guys going to burn out? I don't think you're going to burn out. Well, this week is definitely testing that theory. I'm fresh as rain right now. I don't know if you can tell. I woke up at 7:00 this morning and did an interview in the UK. Yeah, then I'm doing this show, then we'll do the Twitch show, then I have a",
      "start": 127.92
    },
    {
      "text": "theory. I'm fresh as rain right now. I don't know if you can tell. I woke up at 7:00 this morning and did an interview in the UK. Yeah , then I'm doing this show, then we'll do the Twitch show, then I have a call with Twitch, then we're going to do the GameOver the the Kinda Funny Games Cast, then I have another interview for another podcast. So that's a long day. Kinda Funny Games Cast today too. Jesus Christ, strap in. Remember when Kevin Smith, you wanted this? Yeah, or I, I found a great Hunter S. Thompson quote'cause like on Sunday night when we were launching, like getting everything ready to launch, I was of course a nervous ball of just energy and, uh, I don't know what I was watching, but there was a great quote that popped up from Hunter S. Thompson that just said, take the ride. Hunter S. Thompson and I was like, that's Kismet. That must be, that's Hunter S. Thompson from the grave telling me or is he still alive? I can't remember. He's dead. Pretty dead. What did you just say it was? Kismet. Kismet. She's a DC Comics",
      "start": 173.08
    },
    {
      "text": "that's Kismet. That must be, that's Hunter S. Thompson from the grave telling me or is he still alive? I can't remember. He's dead. Pretty dead. What did you just say it was? Kismet. Kismet. She's a DC Comics character that like is like controlling the universe out there and Superman interacts with her once in a while. She's also like fate of Carl M real life. Oh, okay. Not to go too far off on a tangent, but this blew my mind the other day. I was looking up, don't ask me why through the click hole of IMDB. Yeah, I went from Bond film girls to Superman and I didn't realize that Terrence Stamp is credited all three of them. Terrence Stamp, Ursa, and are credited in the first Superman movie because I guess they were in a scene in the beginning. Yeah, remember? No, I don't remember this at all. It starts on Krypton with their trial. Guilty, guilty, guilty. I think that was, I could have swore that was a flashback in the second one. They flashed back to it. Yeah, but they said it remember Richard Donner filmed them back was filming",
      "start": 215.84
    },
    {
      "text": "trial. Guilty, guilty, guilty. I think that was, I could have swore that was a flashback in the second one. They flashed back to it. Yeah, but they said it remember Richard Donner filmed them back was filming them back to back like out and they was going to be that those stories got all discombobulated, but they were going to be, I mean they were awesome to begin with, but they would have been even cooler. They would have left Richard Donner alone. Anyways, burning out, uh, no, it's our own thing in it's, it's F. The Twitch show is super easy. The Colin and I, Colin and I joke all the time, all the time the last two days in the fact that Colin and I never met about that show and never talked about it. Colin's like, let's do Mike and Mike for nerd stuff and I'll be the host. I was like, all right and that was that. Yeah, the day before the literally the night before. So Sunday night I was like, did you want to talk about anything? She we and he's like, and you're like, no, not really. I'm like, all right and I just went to bed.",
      "start": 256.88
    },
    {
      "text": "day before the literally the night before. So Sunday night I was like, did you want to talk about anything? She we and he's like , and you're like, no, not really. I'm like, all right and I just went to bed. You and like we just got up in the morning and we did it because we've done so many, we've done hundreds and hundreds and hundreds of shows together. So yeah, it works fine. That that show is the least of my concerns. I'm not worried about that show at all. Yeah, uh, I want to make sure the qu I'm not, I'm not so worried about the burnout. I think we have to just figure out the rhythm in which we we do all these shows like **** knock Portillo in his face. Um, and, uh, I think that, you know, my biggest concern now that we're, you know, people have been so generous to us on Patreon and people are supporting us so much is I want to make sure that the content is a quality at all times. Um, obviously we're going to have hiccups and misses. I mean like we like everyone does whether you write or whether you do",
      "start": 298.24
    },
    {
      "text": "us so much is I want to make sure that the content is a quality at all times. Um, obviously we're going to have hiccups and misses. I mean like we like everyone does whether you write or whether you do podcast or whatever. Um, but my biggest concern is not so much to burnout, but to make sure that people feel like they're getting quality. Um, and you know, and I'm not talking about like production value necessar. I'm just talking about like, is it making you laugh? Is it insightful? Whatever it is your we want to give you an hour of dribble mean do make any sense. That's a big concern. So far, I think the fact that every show feels very different at least to me is a big deal. Right here I'm the host. I try to drive a little bit. I try to do this. Um, Games Cast Tim's driving like I said in the first episode, it felt very npish, you know what I mean? It was like a different level. Uh, you and I just bullshitting for an hour with the kids reading the Twitch is great. Then the Twitch streams at night are super",
      "start": 331.8
    },
    {
      "text": "it felt very npish, you know what I mean? It was like a different level. Uh, you and I just bullshitting for an hour with the kids reading the Twitch is great. Then the Twitch streams at night are super lowkey, right? Like so far it's been one of us sitting at the table, the other back here working chime in, but it's also super like okay, whatever that's the show where like last night we we streamed our first ever Steam game Axiom Verge and **** me if we know how to turn the sound down on a Steam game. We couldn't figure it out so we had to mute it and then just go and then it's just like this is like that's part of that interaction. Twitch is like you're in the room with us like you're in the room with us now obviously, but you also know that we had time to produce this. Let's make it not crap, you know what I mean? Twitch is crap big deal. You can either get it really crappy or you can not have it at all. What do you want? Yeah, how do you want it? Big Tony style. That's how you're going to get it.",
      "start": 366.76
    },
    {
      "text": "know what I mean? Twitch is crap big deal. You can either get it really crappy or you can not have it at all. What do you want? Yeah, how do you want it? Big Tony style. That's how you're going to get it. Damn. Uh, and then yeah, like right now I on the in the interview today, uh, I was getting interviewed. It's rough. I'm throwing garbage already. It's going to be a long day of podcast, but, uh, they yeah , that was, you know, a question too of just like what is what's it like right now on the outside and like what's your your new life? I'm like there's no regular schedule. Like I'm excited for three weeks from now. We know what we're doing . It's not it's not a million emails and we had we keep when we we're getting ready to launch this, we're like, all right, here will be the production timeline on shows and then that was all out the window as soon as we hit the ground this week because it's GameSpot because of this because that, you know what I mean? So like once we get into a rhythm where we can say okay every",
      "start": 400.24
    },
    {
      "text": "was all out the window as soon as we hit the ground this week because it's GameSpot because of this because that, you know what I mean? So like once we get into a rhythm where we can say okay every every week this is what it is, it'll be a different thing. It'll be more time to breathe, but right now yeah, to wake up and run, run, run, run, run, which is awesome. I love it. Yeah, it's been cool. Like yesterday was awesome like, um, going to GameSpot, walking in, answering emails while you guys are doing the show. It feels like every day is production, which it hasn't felt like that in my life in a while. That's going to burn us out eventually, but for right now it's super exciting. Well, it'll wind down though, right? I mean like I don't think so, but that's the problem is like every time people give us, you know, come out and show support at patreon.com/kindafunny, um, we have to do more stuff, which is cool and I shouldn't say we have to, I should say we get to do more stuff, right? But the the thing I guess",
      "start": 439.32
    },
    {
      "text": "come out and show support at patreon.com/kindafunny, um, we have to do more stuff, which is cool and I shouldn't say we have to, I should say we get to do more stuff, right? But the the thing I guess we're going to run into eventually is that there is just the four of us, sometimes five if you count the monkey behind the camera. Yeah, um, it's going to be, I mean the days are just getting longer. Like last night you called me three times. I was telling Tim I was like, I feel like I'm working for my mother. Like you call you're like, hey, well it's'cause I, I, I always call you'cause you make the third graphics. So the conversation's either going to go one one of two ways. One, I can't find it in the **** garbage pile of lower third we have. Google Drive is just a mess of everything or two, I'm giving you more work at 9:30 at night'cause I have'cause I'm so behind editing tomorrow's Let's Plays the night before they go live. Yeah, and again, I'm totally fine with that. I'm just giving a **** but, um, that's just",
      "start": 475.92
    },
    {
      "text": "work at 9:30 at night'cause I have'cause I'm so behind editing tomorrow's Let's Plays the night before they go live. Yeah, and again, I'm totally fine with that. I'm just giving a **** but, um, that's just I think the way our lives are going to be from here on out. That's kind of the life we chose. My my yeah, again, Kevin Smith, you chose this. You chose this. I think it won't be that bad'cause I think we're going to get once we settle down and there's not we're going off to do this show , go to GameSpot or there's an interview or we're going to go to this lunch meeting or we have a dinner meeting that night and it just becomes all right, there's Colin and Greg every day and they're streaming at 2:00 p.m. every day. Then it's like all right and Tuesday will be the GameOverGreggy Show and Wednesday will be the Games Cast and then we'll have a Let's Play day I guess on Friday or something like that and like once it's those like you know modules that are plugged in it'll be yeah, I agree with that . I think that one",
      "start": 521.72
    },
    {
      "text": "and then we'll have a Let's Play day I guess on Friday or something like that and like once it's those like you know modules that are plugged in it'll be yeah, I agree with that. I think that one thing that I've been thinking about very um very often the last 24 hours or so has been you know we have to get some sort of financial stability amongst us and our business and make sure we can eat and stuff like that. Like I said on GameSpot yesterday, we are not, uh, we obviously really didn't do this for the money because, um, we were all pretty well compensated at IGN. Um, we did it for the happiness and to directly connect with you guys out there and and, uh, kind of sacrifice maybe the platform, the the the reach of the platform for the more sanctity as it were of the core audience that really likes our stuff and I want to make sure that they're happy with our stuff. What I've been thinking about the last day is that when we if and when we find some sort of financial stability, I feel like we're",
      "start": 554.48
    },
    {
      "text": "our stuff and I want to make sure that they're happy with our stuff. What I've been thinking about the last day is that when we if and when we find some sort of financial stability, I feel like we're actually a lot closer to hiring someone than I thought we were, um, in terms of not in terms of the money we have because we don't have the money, but in terms of what we need, you know, like I think that, um, the four of us working constantly is great and we own it and we want it, um, and we're going to do it. It is what we asked for and and I'm happier doing this. I'd rather be tired doing this than awake doing, uh, something for anyone else at that's that's the way I feel. Um, what motivated me last night to go through and answer every Patreon message was the fact that I love these people and I want them to know they're not talking into a void and not the Patreon wall'cause that thing's out of control. That's a I need a day for that, but like to go through and get every message that was sent to us because",
      "start": 597.4
    },
    {
      "text": "know they're not talking into a void and not the Patreon wall'cause that thing's out of control. That's a I need a day for that, but like to go through and get every message that was sent to us because there's a lot of questions of like, I'm new, how do I do this? I'm like, all right, right. I can explain all that. Yeah , I think you know, but I was just thinking about that specifically. I'm like, you know, because I was I I remember thinking like we don't need to we don't need help, you know, like we have Kevin sometimes and that's great and we the four of us are very competent and educated and and and kind of go-getters and stuff and then I just started to think I'm like we are going to I think that if we continue to grow, we're going to grow as a staff and and and we're going to need more help and I think that that will alleviate that stuff as well, but who the hell knows when that happens. Yeah, but that's the thing though. I mean like these people helped us become legitimate thing like Kinda Funny and",
      "start": 637.08
    },
    {
      "text": "that that will alleviate that stuff as well, but who the hell knows when that happens. Yeah, but that's the thing though. I mean like these people helped us become legitimate thing like Kinda Funny and Kinda Funny Games. Like Nick killed it on the logo design and all that stuff and the the YouTube channel youtube.com/kindafunnygames looks so legit. Yeah, I look at that. I'm like hell yeah. Yeah, it's good. Real quick, I want to call people out. We haven't done because it's been such a thing we're talking about needing help eventually. We had a lot of help coming into this. I want to talk about Graham Reed. Yes, he made the Colin and Greg Live logo that swings up. Uh, he's a graphic designer obviously. Adam Smith, he's the one who did the new thumbnails for he also talked about capitalism a lot in the. Yes, that's true too. He then he time traveled here to be a graphic designer made the unboxing thumbs 2015. I need to go and then of course completely not to mention Panda Musk. Oh God, Panda Musk is the guy who I",
      "start": 672.28
    },
    {
      "text": "true too. He then he time traveled here to be a graphic designer made the unboxing thumbs 2015. I need to go and then of course completely not to mention Panda Musk. Oh God, Panda Musk is the guy who I said, hey Panda Musk, I need if you have time a 15c loop of animation that we can just put up over and over again for the Kevin Smith podcast and he said okay and he started working on that and then he said here I made this intro for you and I said I didn't ask this is not what we want you don't need to do this. He's like no no I just thought I wanted to do it and then he's like you know what I've decided I can go through and animate head bobs to everyone talking and so he sat there and made sure everyone's heads bobbed up there's cuts I don't know you've watched it it's not even just head bobs it's the like arms AR Portillo runs by every once in a while he's got the there's a whole bit where we are outside the quick stop with Jane Silent Bob really just like Jesus Christ oh my God I got to go",
      "start": 708.0
    },
    {
      "text": "the like arms AR Portillo runs by every once in a while he's got the there's a whole bit where we are outside the quick stop with Jane Silent Bob really just like Jesus Christ oh my God I got to go back and rewatch our stuff that's insane. But to continue the shout outs real quick shout outs uh Tonee for oh right which now we use his music for like pretty much every single show so if you aren't already twitter.com q .com check out his music for sure and also this has been a long time coming but I don't know how to say it Rakus it's R A K O H U S oh yeah the dude is the Bob yeah he's the dude that made the um the chip tune intro for Kinda Funny Games Cast it is super awesome he made that for us for the GameOverGreggy Show months ago but we never got to he also did the music that's underneath the Patreon videos yes yes yeah and we're going to be working with we ask that question a lot who did that music it's R R A K O H U S yeah if you look him up he's on he's on band camon out Cloud",
      "start": 748.08
    },
    {
      "text": "the Patreon videos yes yes yeah and we're going to be working with we ask that question a lot who did that music it's R R A K O H U S yeah if you look him up he's on he's on band camon out Cloud right he's he's youtube.com a k h u s what was B cam so you can support he wants the YouTube he wants YouTube yeah he wants the YouTube and uh also hit him up on Twitter and just say thank you from the GameOverGreggy Show there you go our lives are so stupid tell us why Greg uh you know how we well this isn't we don't have it yet but a timeline shifted for a project we submitted for that one with the thing and the thing and the spray oh yeah all right cool it it would be do by like Tuesday like the live link oh the live link yeah so that would be fun if that happens so we'll talk about that I guess we're working over the weekend yeah we see how that goes um oh we also left off uh Shar Stewart that was the other one sh thank you kindafunny.com if it isn't fixed and looks awesome by the time",
      "start": 792.08
    },
    {
      "text": "we're working over the weekend yeah we see how that goes um oh we also left off uh Shar Stewart that was the other one sh thank you kindafunny.com if it isn't fixed and looks awesome by the time you hear this then you can go tell Shar to go straight to hell no do not do that I'm kid here's how awesome Shar is we've given her zero direction zero direction not only that but I talked to her a combined one minute I think the other day I was like hey Shar's Nick glad to talk to you for the first time listen this this this and this okay bye and she was like all right I guess I'll do what I same thing with Graham Reed we would like this show opening I can't tell you anything about we couldn't even tell them we were quitting yet yeah we're doing a live show it's going to be like this okay thanks here's a library of music to match things to yeah he did a great job great job yeah we have a lot of rock stars in the community and and and we appreciate each and every one of you what yeah I've",
      "start": 838.8
    },
    {
      "text": "here's a library of music to match things to yeah he did a great job great job yeah we have a lot of rock stars in the community and and and we appreciate each and every one of you what yeah I've just been thinking about that you know cognizant I'm like I don't know like we have a real company we we also ask this question a lot too right people are like do you offer internships and jobs and everything else I keep tell everybody hold youres yeah we're trying to figure all that stuff out internships are hard in the state of California they're just really a hard thing to get going I would love to do that at some point um but you know Kevin's looking at me with like little like doughy eyes like don't he was giving you mean eyes he wasn't giving you dough don't replace me Kevin you're irreplaceable you're like a Picasso you're like the Mona Lisa know about him you must not know about K oh man iing I don't think we're going to burn out talking for sure the workload is crazy right now I think",
      "start": 877.76
    },
    {
      "text": "you're like a Picasso you're like the Mona Lisa know about him you must not know about K oh man iing I don't think we're going to burn out talking for sure the workload is crazy right now I think that'll temper off easy because it's I you know we need to start now that we know what we're doing or when we start to know what we're doing what a normal day like it'll be easier to shift I was talking to you guys today I need help with Patreon right that's easy we can just trade off nights messages or now that when we're doing Colin and Greg Live you can go and talk to the wall or whatever yeah and the other thing that I've been thinking about too is that my you know maybe maybe not always but my weekends are going to be sacred now you know because like we're working so hard during the weekend sure um you work you I mean maybe not this week we're definitely going to work this week but but uh you know we work so hard Monday Tuesday Wednesday Thursday Friday and then you kind of have your",
      "start": 916.32
    },
    {
      "text": "sure um you work you I mean maybe not this week we're definitely going to work this week but but uh you know we work so hard Monday Tuesday Wednesday Thursday Friday and then you kind of have your downtime whatever so you go real hard for five days like a normal person does and then um you break for two days and so I'm fine with that I'll be fascinated to see if that's the case my my gut tells me that we are there just going to be days where we don't have to work and then days where we work and those like literally on Saturday when we were prepping everything I thought it was Monday yeah I was convinced like it was a day of the week and my wife's like I'm like uh how many clients do you have today'cause my wife has know teaches Pilates and she was like what are you talking about I'm like like what do you like are they all not back from break yet she's like it's Saturday and I'm like holy **** and that's just that's just production like when you're shooting movies or TV or film or you",
      "start": 954.16
    },
    {
      "text": "what do you like are they all not back from break yet she's like it's Saturday and I'm like holy **** and that's just that's just production like when you're shooting movies or TV or film or you know your awesome internet Superstars like we are now um hey you just work when you got to work yeah like last night I had an hour to watch The Living Daylights and I was like this is the most enjoyable thing'cause I've earned this like they said at the end of Private Ryan earn this I don't remember that part he's dying he's like earn what's he handing him is the Purple Heart I know his hand's dying the rest of him's dead all he's trying to write earn this but he can't you want you want know an interesting fact about the Purple Heart yeah uh of course I'm going to give you an interesting fact about Purple Heart uh in the fall of 1945 we were scheduled to invade Japan it was called Operation Downfall and we obviously do that because of uh we dropped the bombs and they surrendered um in",
      "start": 991.88
    },
    {
      "text": "about Purple Heart uh in the fall of 1945 we were scheduled to invade Japan it was called Operation Downfall and we obviously do that because of uh we dropped the bombs and they surrendered um in anticipation of what they assumed would be about a million American soldiers dying in the first year of the war in Japan uh they made 500,000 Purple Hearts um and the Purple Hearts that are used today for Afghanistan Iraq are still those Purple Hearts because we never invaded them so we had like too many of them so all the guys in Korea that got injured all the guys in Vietnam that got injured all the guys in Iraq that got injured all the guys in Afghanistan that got injured all used the Purple Hearts that were supposed to be for the invasion of Japan that's crazy that is insane and there's your history factoid of the day bam no that's not the right failure prices right really good I wanted something better wow appar I'm tired too I'm sorry yeah it happens it's going around my dad uh I don't",
      "start": 1032.88
    },
    {
      "text": "history factoid of the day bam no that's not the right failure prices right really good I wanted something better wow appar I'm tired too I'm sorry yeah it happens it's going around my dad uh I don't think you have to worry about it's burning out I think we will continue expand grow shift the the responsibilities we'll be all right and we're also having time over lapse yeah exactly yeah this has been fun thank you for your support no complaint on at all of [Music] course does that sound better oh I see what you did I thought you actually going to do something let's actually pause for a second let me try something real quick you just let it run we can cut this out leave it in what do we care that's very true how we fix it on the goat",
      "start": 1070.88
    }
  ]
}
