{
  "id": 502,
  "video_id": "0WHkIC15YKU",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Kevin Smith",
    "Pandamusk"
  ],
  "title": "Kevin Smith (Special Guest) - The GameOverGreggy Show (Special Episode)",
  "description": "Special guest Kevin Smith talks to us about why we left our jobs at IGN, our favorite YouTube channels, Clerks, and the internet. (Released 01.06.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1420563612,
  "duration": 7304,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I am one of your host Greg Miller alongside the producer Seducer Nick Scarpino. Hi everyone. Hey, how are you? Good Greg, how are you? I'm good, fantastic. It's been a long day in LA . It's been a great day in LA. I agree. Every day in LA is a great day in LA. You love LA. You wish we could move here. Love this place, man. Are you kidding me? It's always hot and that's it. That's why you're not a member of Team Fat. You would that would be that would be a drawback for anybody else . Oh no, if we move down here, when we move down here, I'm going to stay optimistic about this. When we move down here, we are all getting super in shape. Nope, not not even even remotely. I've been here a while and I'm still not. I have a shape, it's just not in you have the Jelly Bean shape. I'm a fan of that one. I use that a lot over there. The pride of Long Island, Colin Moriarty. Go Isles, go Islanders. Good to be it's good to be here with you Greg. It's good to be here with you.",
      "start": 2.82
    },
    {
      "text": "Bean shape. I'm a fan of that one. I use that a lot over there. The pride of Long Island, Colin Moriarty. Go Isles, go Islanders. Good to be it's good to be here with you Greg. It's good to be here with you Colin. Thank you for having me. It's a pleasure. It's always my honor to have you sitting on a podcast over here. The pure one, Tim Gettys. Let Tim host and then across the table from us where this we're we're we're we're in his Batcave. We're we're in Kevin Smith's house. This is really weird. How you doing Kevin Smith? How are you? I'm excellent. Um the producer SL Seducer is that's tremendous. I mean that's it's one of those things like every once in a while you have an idea you hear somebody say something you're like has that been said before you run to the internet and do a quick Google search. Yeah, I I doubt anyone's ever put that together. You should Google it. Good things come up. I'll tell you that much. Really? Is it all in relation to you? We had it going for a while where if you put Nick's name into",
      "start": 71.76
    },
    {
      "text": "anyone's ever put that together. You should Google it. Good things come up. I'll tell you that much. Really ? Is it all in relation to you? We had it going for a while where if you put Nick's name into Google like the first autofill was cocaine and I was like we're we're doing the Lord's work. It was it was it was cocaine then scumbag then producer Seducer now thankfully due to a marketing campaign of my own it's just producer Seducer. Okay, well ladies and gentlemen if you are listening do the MP3 then nothing it's the normal MP3 It's the game over grey sh for Sho for show for you if you're watching on YouTube I've put up just an image that's cuz we're in Kevin Smith's house top secret they they said hey can we set up cameras and I was like God no so you respons very sweetly though you were like ah can we not and then you blinked at me a couple times and I was like I can't say no to Kevin Smith's face dyed way of of passing that across that kind but yeah I was unfortunat I was not prepared to",
      "start": 111.8
    },
    {
      "text": "can we not and then you blinked at me a couple times and I was like I can't say no to Kevin Smith's face dyed way of of passing that across that kind but yeah I was unfortunat I was not prepared to to no it doesn't matter I'm just explaining for these YouTube kids at home they're at home tapping the screen wonder why moving people talking what the **** is this old timey radio this garbage I hate this crap uh ladies and gentlemen if you didn't know you're listening to game over gregy show the idea is simple each and every week four sometimes five best friends gather around this table each bring a random topic of discussion for your amusement if you like that The Show Goes live on patreon.com kindof funny each and every Friday as an MP3 and a video then if you don't want to give us any money we totally understand you can go to youtube.com/ kindof Funny Monday through Thursday have it broken out topic by topic before we post the entire show for your amusement and by now it's January so",
      "start": 152.12
    },
    {
      "text": "we totally understand you can go to youtube.com/ kindof Funny Monday through Thursday have it broken out topic by topic before we post the entire show for your amusement and by now it's January so it is definitely going to be on Soundcloud and iTunes and we can all Li these are just lies that you're telling the world him no no it's happening guarantee it promise I promise Kevin Smith I wouldn't let him it sounds like you boy are branching out this year see now that's the thing Kevin Smith on the GameOverGreggy show tradition dictates that the guest goes first but we're putting this up with you we're doing this crossover thing with you and your podcast series we need to get to Brass tax and let you know break it to you because you're one you're one of the best friends we came to tell you to your face we all quit our jobs how really all all four of us have left lucrative careers at IGN to go just do Kinda Funny things what um what now of course I always Branch independent I I always",
      "start": 188.56
    },
    {
      "text": "to your face we all quit our jobs how really all all four of us have left lucrative careers at IGN to go just do Kinda Funny things what um what now of course I always Branch independent I I always always um I always applaud anyone who branches out and do something independently and whatnot instead of working for the quote unquote man the man um but you know in my experience the man was never that bad at IGN no no no no no we love IGN yeah what happened why why why quit the jobs and to do the thing as opposed to doing them simultaneously sure we had been doing them simultaneously for a while and that was really starting to kill us really and so now you guys are like I want to commit to the I want to pop commit like we're teetering and we a teeter to the other side it's one of those things it's you know the safe choice is obviously to stay with IGN and be there I mean they've been great to us i'i'had been there eight years Nick had been there nine Colin had been there eight Tim is",
      "start": 225.28
    },
    {
      "text": "it's you know the safe choice is obviously to stay with IGN and be there I mean they've been great to us i'i'had been there eight years Nick had been there nine Colin had been there eight Tim is a baby he's almost five almost five sorry so you know what I mean an internet lifetime ex oh and that's the whole thing they've been a face and they've you know let me rise up to become one of their dominant personalities and they've given me so much but it we started to feel like all right what's next for all of us let alone just me you know what I mean and the success we've seen with making Kinda Funny and the fun we have creating that content that was getting to the point where to continue to invest in that would start to detract from Ian and it wouldn't be fair to them for everything they've done for us now do you guys are are you IND independently wealthy enough to walk away from we will see kind of we're seeing about that we're actually selling's body is that what yeah we're going",
      "start": 270.4
    },
    {
      "text": "done for us now do you guys are are you IND independently wealthy enough to walk away from we will see kind of we're seeing about that we're actually selling's body is that what yeah we're going to start selling he doesn't know that yet we're going to start sing are married here just him you're okay and your wife was never like don't do this she went through phases we we'll say right uh largely she was terrified and is still in that phase scary yeah yeah but she you know it's one of those things where she sees us get super excited right and she hasn't seen that and and not again not we're not knocking IGN IGN's a great place to come to work every day but after nine I've been there nine years so after 9 years at a place um you start to lose that sort of Shimmer you know and she finally started seeing it again to me which is weird to say and kind of just gave me the nod like do it try it why not all right what's the worst that can happen right you might that life partner yeah oh my God",
      "start": 308.92
    },
    {
      "text": "seeing it again to me which is weird to say and kind of just gave me the nod like do it try it why not all right what's the worst that can happen right you might that life partner yeah oh my God if that's on the list that's not bad sleeping outside this house like I'm real I'm I'm kind-hearted so I would never be like get this **** homeless person out of here particularly if I was just like that homeless person was once in my house recording a podcast the moment before that dude changed his life and then went homeless so let him **** sleep there like here's an extra Justice League blanket that is an excellent life partner somebody who's like you know what I could smell that you're not **** happy where you are right now and so if you got to make a move make a move the rest of you guys just have the freedom to make the move well yeah Colin and I each have a girlfriend and we live together in in next bedrooms that are next to each other and then the third bedroom is our",
      "start": 351.12
    },
    {
      "text": "of you guys just have the freedom to make the move well yeah Colin and I each have a girlfriend and we live together in in next bedrooms that are next to each other and then the third bedroom is our podcast studio and everything else we do there for filming so both of our partners have been super supportive as well yeah Cheryl Cheryl my girlfriend has been been awesome about it I mean she there's some trepidation of course but she always wants me to just do what makes me happy totally and uh it's but to be fair she there's no you know at the end of the day she could be like well that's your problem goodbye forever right this guy he's got you know in order for that to happen they got to go to court and **** like that so a girlfriend or somebody who's not like **** I'm not putting down uh somebody who's not married but the freedom of not being married is the freedom to be like I support you in everything you do but if this **** blows their life up I get out of here fast absolutely",
      "start": 394.6
    },
    {
      "text": "somebody who's not married but the freedom of not being married is the freedom to be like I support you in everything you do but if this **** blows their life up I get out of here fast absolutely I mean that we can dodge the litigious nature of the whole uh but yeah she's been great and and you know we we we owe a great deal to IGN I mean they gave us all of our opportunities we'll never forget that we'll never forget who paid our bills for many years and and and allow us to rise to F-list internet prominence right um but uh you know it is good place we're really excited and and honored that a lot of our people uh from IGN you know the listeners of podcast beyond and all these things that we do are coming with us and you know and and are excited I think yeah definitely I mean they're the whole reason I mean you know the big movement for us and the change was when we launched the Patreon and when we when we we rebranded as Kinda Funny and launched the Patreon 3 months ago and the",
      "start": 431.84
    },
    {
      "text": "whole reason I mean you know the big movement for us and the change was when we launched the Patreon and when we when we we rebranded as Kinda Funny and launched the Patreon 3 months ago and the outpouring of support there was the one was we looked at each other like huh we could be internet Superstars if we try yeah we we believe that we will be internet Superstars when we hit 100,000 views I am **** shocked that Kinda Funny wasn't taken isn't that crazy that is nuts that is nuts to me that's one of those things that like producer SL Seducer you're like that's not taken already you didn't steal that from like **** Gallagher or something like I must have heard that and then you're like no I didn't hear that before at all there is a woman in the suburbs of Chicago who has the Kinda Funny Twitter and she doesn't I'm not saying doesn't use it correctly she's just not very active on the Twitter she doesn't seem to get it so when I had to follow this woman then tweet her to",
      "start": 476.08
    },
    {
      "text": "Kinda Funny Twitter and she doesn't I'm not saying doesn't use it correctly she's just not very active on the Twitter she doesn't seem to get it so when I had to follow this woman then tweet her to follow me back then try to explain to her how to use DMs then go into the DMs and like I'm launching this business is it possible for us to trade names she's like no I like this this is an inside joke between me and my friend I'd like to keep it I've had it for years and just like I totally get that but wouldn't a better inside joke joke be the time four idiots on the internet offered you a few thousand for your name and she said this sounds like a scam please stop talking to me and I said no no no no no it's not SC please don't go I'm like you I'm verified and you can look at me and like here's links to everything she's like I'll have to think about this and then she started publicly tweeting she's like is has anybody ever heard of someone coming through and trying to buy your Twitter",
      "start": 512.84
    },
    {
      "text": "links to everything she's like I'll have to think about this and then she started publicly tweeting she's like is has anybody ever heard of someone coming through and trying to buy your Twitter name and then she'd be like thank goodness my my bro is dating the lawyer and I'm like oh God oh my you became like the conversation for a week totally you were there Bill Cosby Ebola Isis like that's what they talked about like what I mean what does that by the way all the time Cosby any you know what you know as long as you're making headlines you're doing it right is what I like to think so yeah I like to think every so often she see something happen now she like oh I could have had a few thousand dollars off these idiots it was funny too cuz the the the we had to buy the Kinda Funny URL but I think it was open on did we get it on YouTube like just it was just open on YouTube how much was the URL just out of curios like 2,000 that is not bad no not at all really we would have paid more for",
      "start": 550.8
    },
    {
      "text": "think it was open on did we get it on YouTube like just it was just open on YouTube how much was the URL just out of curios like 2,000 that is not bad no not at all really we would have paid more for it come now right we have contracts it's all the same we're not very good about renewals okay I got to stay on top of that yeah well yeah we have to many and so the rebranding um going from uh game over gregy the idea is like well it's not one person 100% that was the big thing and that's bold in and of itself too because that is like all right we've got a very we got something that works now we're stepping away and building something else but the time to do it is now when you've got more eyeballs and earballs than I guess you anticipated like you've been able to take something fun at the job and turn it into a potential career it's within reach within grasp and you're like well **** it if we if not now **** win yeah that was the thing we talked about is we could have stuck in Ben game",
      "start": 591.72
    },
    {
      "text": "turn it into a potential career it's within reach within grasp and you're like well **** it if we if not now **** win yeah that was the thing we talked about is we could have stuck in Ben GameOverGreggy and we could have blown up to 200,000 followers and then it gets really hard to right now let's change it and then you have more people pissed off whereas this time we had this really core group like I always talk about it right like you know the number we have on YouTube right now or right before before we flip the switch on the 5ifth right those are the ride or die **** those are the kids who like they want to hear Colin and I talk about video games and for the longest time we couldn't on on our YouTube channel because we worked at IGN and like that was the agreement right like no no you talk about video games here so give us that content we're like that makes sense so the people who actually came to watch Colin and I talk about ants or Tim talk about the Disney Princesses he",
      "start": 635.28
    },
    {
      "text": "no you talk about video games here so give us that content we're like that makes sense so the people who actually came to watch Colin and I talk about ants or Tim talk about the Disney Princesses he wants to **** it's like there's a lot of them you're you are the good kids thank you for sticking it out with us how I mean wait how many princesses are there oh god oh there's there's plenty let me let me tell you about this is there over 20 is there are there over 20 princesses there's not 20 no not not officially and so of that list you've never you're like not all of them some not all of them top majority top three no I'm more Curious in who doesn't make the list all who doesn't make the list who is the Kevin Smith what why how does Mulan not make the list officially is a princess but Mulan doesn't make the list she was hot she **** L an army man and she passed as a dude so you get the Strange going on she puts on the armor you me and suddenly all right all the princesses are on",
      "start": 669.6
    },
    {
      "text": "Mulan doesn't make the list she was hot she **** L an army man and she passed as a dude so you get the Strange going on she puts on the armor you me and suddenly all right all the princesses are on the list now just saying fair enough so then since I've forone letting you go first the topic I want to bring to the table is you've struck out on your own before you and I've struck out period yeah well sure what what did you wish you knew when you went out on your own and you said goodbye steady jobs and things like paychecks and health insurance somebody else pays for and security um I you know honestly done there there was only one thing like I don't have regrets because and you guys won't either because the it was untenable to remain in the situation you were because your appetites and your aspirations have grown larger and so now is the time it's an entrepreneurial time in this business where people can make bold moves like what you're doing right now and actually make a career of",
      "start": 708.96
    },
    {
      "text": "your aspirations have grown larger and so now is the time it's an entrepreneurial time in this business where people can make bold moves like what you're doing right now and actually make a career of it um but the uh you know for me I kind of I the thing that I learned when I like left Weinstein Company in Miramax they were like uh the Weinstein Brothers Harvey and Bob were kind of my padrinos for like a long time like 12 years running and **** all my art was sponsored by them so part of that was like you got this sweet overall deal to run your office and stuff just a big chunk of money that they're like here this is to run your office I they didn't account for it you didn't have to sit there and be like this is where we spent and stuff um **** like that went away and then right away you were like oh wow that was a lot of money to pay do bills like a staff and stuff like that so naturally I noticed things like that which is what you'll notice the pinch of uh not the exact same",
      "start": 756.12
    },
    {
      "text": "you were like oh wow that was a lot of money to pay do bills like a staff and stuff like that so naturally I noticed things like that which is what you'll notice the pinch of uh not the exact same situation but oh my God we had paying jobs and now we don't Comic-Con was a lot cheaper when we expensed everything Bingo Bingo but the thing that I saw I mean I this isn't like a really practical piece of advice but the thing that I saw in a years later after a move was uh wow like so much of what I did leaned on where I was was like as much I was never like I you know **** I'm everything and the YC's are nothing no I was always very appreciative of the fact that Harvey and Bob had kind of bought clerks and and kept making movies with me and stuff but then like simple things like getting into the can film festival just like you said like U to a degree of you can't expense everything now at Com iCon getting into can was a breeze when you know Harvey had the movies and then when Harvey",
      "start": 804.96
    },
    {
      "text": "into the can film festival just like you said like U to a degree of you can't expense everything now at ComiCon getting into can was a breeze when you know Harvey had the movies and then when Harvey wasn't involved you know it's like uh did you guys get my email so there were definitely like uh things that I realized ah **** that was easier yeah back then but it was never like man I wish I **** had that again or I wish I could change that in the present to look more like the past because that was a moment just like IGN was your moment brought you all together **** introduced you and taught you what you dream about like the thing that you were going to change your life for worth going after for the rest of your **** life from your job to a **** career and so you know you'll always love the place and and with distance from it you'll be like oh wow so much of who I am and what we're doing has everything to do with that it's part of your DNA so it's not I'm sorry it's not",
      "start": 852.6
    },
    {
      "text": "always love the place and and with distance from it you'll be like oh wow so much of who I am and what we're doing has everything to do with that it's part of your DNA so it's not I'm sorry it's not practical advice where it's just like yeah that'll help them help help us make our business better but it is something that like right now what human beings are all about survival so right now you're making a big move and part of that survival is about moving forward as fast as you **** can and not looking back when you're safe about two years from now three years from now you get your feet on the ground and you're not worried about building as much as maintaining then you'll be able to look back and be like holy **** that was the **** Glory year that was the you Glory Days **** salad dayss like the the houseon moment when everything was not only did we all meet and we were all working but somebody else was **** paying the bills and **** like that but it's worth sacrificing",
      "start": 899.32
    },
    {
      "text": "dayss like the the houseon moment when everything was not only did we all meet and we were all working but somebody else was **** paying the bills and **** like that but it's worth sacrificing because now you're captains of your own destiny I mean it's a very small thing and this is these are very first world kind of uh issues but like you talked about like we want to be able to talk about podcast or video games but you know we had to do it exclusively there blah blah now you have the freedom to do whatever the **** you want youtube.com Kinda Funny games come subscribe exactly and there'll be that aspect now all the time the panhandling the chilling the Shameless self-promotion thankfully I got over that we're really good at that have we told you about kindafunny.com store and at least doing it on your behalf you know what I'm saying like if you weren't already doing the panhandling for IGN you you know you would eventually be but I'm sure you have to anyway why yeah we",
      "start": 943.52
    },
    {
      "text": "at least doing it on your behalf you know what I'm saying like if you weren't already doing the panhandling for IGN you you know you would eventually be but I'm sure you have to anyway why yeah we were well it's not even you know you make so many we make so much content at IGN right so when podcast beyond goes up I promote that and up at noon goes up and this conversation and then don't forget to get your Bey on like we're used to it and and our audiences too right because our audience we always I always say if you're listening to the show you're one of our best friends you know me better than my family does cuz we have conversations here that aren't just what's the weather like in Chicago **** true God that's how this whole thing works right that we're all one giant Community together and they get that that you know it's not like we're sitting there counting millions of dollars we're just like oh here's that t-shirt you always talk about in the comments you want to see and that's",
      "start": 987.96
    },
    {
      "text": "and they get that that you know it's not like we're sitting there counting millions of dollars we're just like oh here's that t-shirt you always talk about in the comments you want to see and that's how you get it here's the here I mean this is this may be a very me specific thing but you know it it may apply as well and and and maybe it's doesn't apply because you now have kind of branded into a a group more than anything else but there was a certain point where all I used to do was one thing for a living like that was my job to make as my career and it was awesome to make movies and then there you know I realized I got to do that and and but there were other things I wanted to do too like write comic books or **** later on podcasts or stand on a stage and **** do Q&A and **** like that so as I started like branching out or or or what do they call it diversifying the portfolio so to speak um there was a bunch of things it wasn't just one thing anymore and then there was a",
      "start": 1022.8
    },
    {
      "text": "like that so as I started like branching out or or or what do they call it diversifying the portfolio so to speak um there was a bunch of things it wasn't just one thing anymore and then there was a certain moment I don't know how else to describe it but there was a certain moment where I realized oh my God because of all these things I am no longer just a director like my job is to be Kevin Smith it's not job that's awesome my career now is being Kevin Smith however a job is something you can end and walk away from and take a holiday from or quit as you guys just did once you become the business that's it yeah **** until you're in the grave or until you want to do something else this is the LI this is the path you've chosen and this is probably the best piece of advice I can always I can pass off cuz it helps me whenever I'm standing somewhere where I'm like **** this is where I am right now it always helps and you know you'd rather say it to yourself some other **** say it",
      "start": 1064.36
    },
    {
      "text": "I can pass off cuz it helps me whenever I'm standing somewhere where I'm like **** this is where I am right now it always helps and you know you'd rather say it to yourself some other **** say it because they say it then you want to punch them but this is this is what you need to say you wanted this like everything that happens from this moment forward you wanted this so the highs when you earn them you're like **** I wanted this and I was right but the lows when you're like Jesus Christ uh you you know that's what will give you strength like you wanted this and it'll take you back to the moment it won't make you sit there and go like I want to meet the dumb jackass who wanted this and **** put my **** dick in his mouth and tell him stay at IGN it'll just make it'll make you even more Steely in your decision you're like yeah my resolve is kind of more tighten cuz you're like oh yeah I remember now like you won't **** it's a very first world temptation to complain um even",
      "start": 1112.92
    },
    {
      "text": "more Steely in your decision you're like yeah my resolve is kind of more tighten cuz you're like oh yeah I remember now like you won't **** it's a very first world temptation to complain um even when we're making our dreams come true it's very American thing but uh at the same time it's very you can find strength and resolv just knowing that this is what you wanted good or bad man it's like you know there many times over the course of the last few years where I'm like **** how did I get here and then I'm like oh yeah this is what I wanted you wanted this yeah well that I this is reminds me a couple days ago we did hot pepper gaming we filmed it are you familiar with this where you you review a video game but you also review a habanero pepper at the same time so you eat the pepper and then you have to try to get through this review and then you score them all at the end and I've done it before and this time was way worse and then Colin Did It For the First Time The Misery he was in",
      "start": 1162.04
    },
    {
      "text": "you have to try to get through this review and then you score them all at the end and I've done it before and this time was way worse and then Colin Did It For the First Time The Misery he was in at the end and how good he was on camera I immediately texted Tim and said Colin just became a YouTuber and it's because it's like before Colin has been a writer and editor you know this podcast HST and I think now that we're making this jump you see him embracing it the same way so even though he hated his life right then and there now he's for the red yeah let me just tell you Kevin about hot pepper gaming just don't don't do it it sounds it it just sounds so **** I mean it made me feel old the moment you explained it cuz I was just like man I'm 44 aren't I cuz I don't know anybody in my age who just like this hot pepper game like you know most people most people are just content to be like this's just game man but there's someone out there there and it's always youth that's just like",
      "start": 1207.88
    },
    {
      "text": "who just like this hot pepper game like you know most people most people are just content to be like this's just game man but there's someone out there there and it's always youth that's just like this needs an edge you know what that edge is we're going to combine eating a hot pepper with reviewing it again you know it's just seems very young it's like boy you guys are multitasking like **** it's a stroke I mean I said like I I kid of course because I think it's a a stroke of Genius it's brilliant um but oh my God like a habanero and trying to so is the idea that you eat it and then you're trying to review before what you take a drink or something you can't drink milk till you finish your review yeah yeah yeah you can't drink what milk they have a cup of milk there yeah you can drink milk and and it's why is milk neutralized knocks out the heat yeah it actually works very well not not instantly but I mean it'll definitely lessen the pain you're in cuz you were in a lot of pain so",
      "start": 1249.28
    },
    {
      "text": "milk and and it's why is milk neutralized knocks out the heat yeah it actually works very well not not instantly but I mean it'll definitely lessen the pain you're in cuz you were in a lot of pain so you eat it right it cooked raw ra oh just a raw habanera just right into it bite into it and and for one bite no you take you eat the whole thing and I didn't I was looking this up on the Scoville chart or whatever of heat a jalapeno is like 5,000 units and a habanero is 300,000 units I mean isn't that one of those things that you could it could kill some people cool yeah it said if you have stomach problems not to do it and luckily Colin is has a million stomach problems yeah I have I have I have ulcers and like just bowel issues and I I definitely felt it uh was definitely a little scared at moments yeah you're like why am I doing this but I I I we wanted to do it because it was I think it would make our our people laugh um but I couldn't believe Greg did it again because I was like I'm",
      "start": 1290.2
    },
    {
      "text": "moments yeah you're like why am I doing this but I I I we wanted to do it because it was I think it would make our our people laugh um but I couldn't believe Greg did it again because I was like I'm never do like I I'm never doing that again but I'm glad that it was funny and that we got it on camera that we were actually filming I was afraid that maybe we didn't actually get it something terrible would happen like where I just went through all the pain and misery for you know more than a day because it comes out the other end as well true um you guys shoot that as Well's I text I did text them on a a group text saying uh it's it's happening yeah I love that doing dumb things on camera is the future and like I feel like it's not even the future anymore it's been the last couple years it is he made it now but it's it's the you know why it's the perfect measurement of uh unit a time for wasting you know what I'm saying like you can't it's not a movie 90 minutes to to 2 hours a big",
      "start": 1329.92
    },
    {
      "text": "it is he made it now but it's it's the you know why it's the perfect measurement of uh unit a time for wasting you know what I'm saying like you can't it's not a movie 90 minutes to to 2 hours a big **** commitment now in a world where everything has shrunk in terms of like we got a lot more things to pay attention to the movie is a thing you do later you know or unless you do professionally movies are an event that's a thing dat night you're a date night thing so if you're sitting around you just want to waste some time you want to look at some content half an hour sitcom might be a little too much too man it it's YouTube is the perfect choice because you can watch something **** four minutes you're like oh my God my my big uh and you know what I got my topic coming up okay we'll go to it but I know you want to say something before I was just going to launch into something else look at you look at you I'm not you might have a host you have a hosting position in this podcast World",
      "start": 1367.48
    },
    {
      "text": "it but I know you want to say something before I was just going to launch into something else look at you look at you I'm not you might have a host you have a hosting position in this podcast World sometimes you you know what you do you know how to transition look at you seg I heard I heard somebody wanting to no I was going to say this you know you mentioned yeah you are ultimately responsible for your own success or failure right which is part of the reason of wanting to own your own thing right but I will say you are in part a little responsible and here's why about two years ago you were VidCon yeah yes and I heard you speak for the first time on a panel and and I'm paraphrasing you said something to the extent of there is no barrier to entry to create and distribute your own art yeah and that was a kind of an aha moment for me I was like I have been uh kind of creating content or art uh however you want to call it probably more on content side in my case for someone else because",
      "start": 1410.8
    },
    {
      "text": "and that was a kind of an aha moment for me I was like I have been uh kind of creating content or art uh however you want to call it probably more on content side in my case for someone else because they had that distribution platform and then it Dawn to you if you just start some something small two years from now it might be the thing that you can forward it just requires patience diligence yeah a little bit of Panhandle where you know subscribe subscribe but it it's you get there and you'll get there with somebody else cuz yeah you know they'they've got more eyeballs on them at the moment but you're you're making the the choice to kind of Branch at the right time you've built enough audience where you can like make a transition over here and then continue to build without having to like tell everybody we used to be this but now we're this um but more importantly man you just like you know what like it's it's great working for IGN but it's amazing working for ourselves right and",
      "start": 1445.04
    },
    {
      "text": "like tell everybody we used to be this but now we're this um but more importantly man you just like you know what like it's it's great working for IGN but it's amazing working for ourselves right and you know that's that is this generation it's an insanely entrepreneurial generation that is the you know I read New York Times article last year it said this is the first generation in in America in maybe um **** 100 years where people aren't trying to tell their kids go to college you know get a college degree and then find a good job keep parents are starting to tell their kids do what you love like find out what you love and **** try to get picked for well there's I mean I always talk about it when you meet somebody like you know the first time I met Aisha Tyler like we saw it in each other that we had that kindred connection of hustle you know what I mean like we just go and do things and you do it and you make it happen and it's the same thing when we'll try to get together for",
      "start": 1485.16
    },
    {
      "text": "other that we had that kindred connection of hustle you know what I mean like we just go and do things and you do it and you make it happen and it's the same thing when we'll try to get together for anything like we each have a million things going on right we've talked about on her show before and it's just like that's what it's about and I think if you can see that in a in a child you know what I mean I think about that all the time like I would I would be drawing comics and if I wasn't drawing Comics I was you know making stupid Saturday Live shows in the basement that terrible but you know what I mean like my parents saw it and encouraged that and fostered that and gave me that you know you can do anything you put your mind to kind of thing wow man see my parents they weren't discouraging parents by any stretch of the imagination but we didn't come from that world of like yeah that's cool if you put your mind to it you could do anything you want it was like that looks fun but you",
      "start": 1535.4
    },
    {
      "text": "parents by any stretch of the imagination but we didn't come from that world of like yeah that's cool if you put your mind to it you could do anything you want it was like that looks fun but you know make sure you get a fuing job yes oh God Banker what the **** that was Aiming High it was like be a bus boy be a waiter that was the big like I remember my parents were like your brother has been a waiter for years and he's you know R really risen really high in the ranks at this one restaurant in town so like that's what you should shoot for because we didn't have like a profession in our family the old man worked at the post office canceling stamp so he wasn't like come here like he was I love **** yeah he's like oh my God kill yourself before you do this so you know they were just like get a job like there was there was no and even like we're in a place now where you could tell a 15-year-old kid take their **** smartphone go shoot a feature and there's a good chance that you may",
      "start": 1565.84
    },
    {
      "text": "get a job like there was there was no and even like we're in a place now where you could tell a 15-year-old kid take their **** smartphone go shoot a feature and there's a good chance that you may turn in she that person that girl boy may turn in something **** amazing actually winds up getting played and stuff it's no longer um a stretch to the imagination that's what I tell everybody you know I mean like people ask me how I got started and the thing I always say is that in the fourth grade there was an issue of Game Pro and on the cover was Maximum Carnage and on the inside was the Death and Return of Superman and I read it covered to cover for an entire month and it finally dawned I mean somebody got paid to write all the words so I went into the kitchen I'm like Mom I I know what I'm going to do with my life and she's like what like I'm going to write about video games and I always say to her credit she was like okay how are we going to make that happen and like that set me on",
      "start": 1608.28
    },
    {
      "text": "going to do with my life and she's like what like I'm going to write about video games and I always say to her credit she was like okay how are we going to make that happen and like that set me on this path to go to journalism school and get this degree and come out and do all these different things and now people I'm like you know that's a dated thing now do it be doing it right now be blogging be doing your own podcast make your own YouTube videos it doesn't matter if nobody watches them or downloads them you're getting good at it so that when you have your shot to swing the bat you hit a home run but see how it changes from generation to generation I was born 70 what year were you born 83 so you come from a generation of parents who are were like yeah you could do this sort of thing whereas our parents were like you know get a job or go to college or something like that and like there was nobody in our world to like point to or and it this there was no examples of people I could",
      "start": 1646.36
    },
    {
      "text": "whereas our parents were like you know get a job or go to college or something like that and like there was nobody in our world to like point to or and it this there was no examples of people I could point to like a Richard Linklater I'm like this guy made this movie in Austin Texas and **** you know it got picked up and it's playing in art houses but that you were still speaking Martian you know this was still kind of a IND indie film was more of a hobby medium to to a lot of people andu stuff so you couldn't find a lot of support because there wasn't a lot of understanding where we were if I'd grown up in like Los Angeles or New York City or you know **** Austin Texas then you've got like college communities and creative folks who are like yo yeah making a feature blah blah blah but in our world where I was from there was you didn't have that there it's always important to have the examples yeah yeah and I for me that example was Richard Linklater like him how Harley um was",
      "start": 1679.0
    },
    {
      "text": "but in our world where I was from there was you didn't have that there it's always important to have the examples yeah yeah and I for me that example was Richard Linklater like him how Harley um was another one he'made Mo Movies in Long Island even Spike Lee's flicks um those were the people who had kind of Jim Jish made stuff that I'm like all right well they they're not from Hollywood or this place they're doing their thing in their little corner of the world maybe I can kind of do that thing and you see somebody do it and then they inspire you it's just like art man there's no real original art all art is consumed other art and then it's regurgitated with your own flavor right you're like oh this the **** I like blah and it comes out so you know now we live in a time where you can be like **** kids chase your dream and and and you know there's always work out there sometimes there's not so air on the side of **** like if you're going to fail fail going after what",
      "start": 1723.84
    },
    {
      "text": "you can be like **** kids chase your dream and and and you know there's always work out there sometimes there's not so air on the side of **** like if you're going to fail fail going after what makes you happy yeah that was the big thing for us right of like we you know for the longest time we looked at it in the inverse where we're like man like what what's everybody's number to quit what would we have to be bringing in to make sure we quit like oh we're nowhere near that this can never happen and finally it like Tender Trap but it was like you know the thing of like well wait we're making this much now we're not doing the content we want to make what our audience wants so like let's not think of it in terms of like what we're making now but in what our you know highrisk High reward what could happen if we go out and make the stuff everybody wants it's the it's the smart play I mean you know I I I got very fortunate right off the bat early in my career um and and was protected",
      "start": 1769.4
    },
    {
      "text": "what could happen if we go out and make the stuff everybody wants it's the it's the smart play I mean you know I I I got very fortunate right off the bat early in my career um and and was protected for a while or or my art was Finance i m medich if you will and then at a certain point like had to kind of go off and and fend for myself and between the two one era was easier but one era is more satisfying so I think the road that you've chosen may not be as easy as it is being comfortable at some place with you know with a steady paycheck but my God it's going to be **** absolutely which was more fun though um the one that you build hands down just because somebody honestly you know the more resources you're given chances are Art's not necessarily going to improve you know what I'm saying unless you're making a **** Marvel movie more money you know then it looks good well then yeah no no our goal is a DC movie everybody get on get on or the Invincible movie those are our two choices",
      "start": 1807.4
    },
    {
      "text": "unless you're making a **** Marvel movie more money you know then it looks good well then yeah no no our goal is a DC movie everybody get on get on or the Invincible movie those are our two choices that would be amazing um yeah I I don't know there's there's no hands down it's building your own thing is always more fun right and and because every day that it crystallizes and becomes more real you're like holy **** this is me doing my **** like you know I love comic book movies but I don't want to make somebody's comic book movie because as much as I love every one of those characters like some else's **** you know somebody else created that character that's somebody else's story and there is a zillion people out there that love to **** they they don't have a story in them so they're like **** give me a script and you give them a script and they go off and make a comic book movie and stuff like that or sometimes they write it too but generally speaking there's more than",
      "start": 1860.48
    },
    {
      "text": "they're like **** give me a script and you give them a script and they go off and make a comic book movie and stuff like that or sometimes they write it too but generally speaking there's more than enough people out there to make those movies so as much as like you love them it's like like well I don't necessarily want to do that I want to do my **** thing even though that thing is lucrative or whatever this is the thing I build why would I want to make a you know a **** Superman movie Batman movie an Iron Man movie even though I love these characters and I love watching other people's versions of them when I can make my own **** movie you know what I'm saying like there's there's so many people out there to take care of those flicks and way more talented than me so you know there's there's more it's more satisfying building your own thing it may not be as popular you may not meet reach as many people but at the end of the day you're like **** it's mine I can tell you one",
      "start": 1903.48
    },
    {
      "text": "there's more it's more satisfying building your own thing it may not be as popular you may not meet reach as many people but at the end of the day you're like **** it's mine I can tell you one thing right now I speak I think I speak for all your fans out there where I can say if even though it's not as popular uh it's been really fun watching you come back into the prey it really has and like what you have a you have such a hardcore fan base out there that will support you in anything you want to do and you know of that I have no doubt they're very sweet man and it's you know it's the old older I get the more I'm sure it shrinks or dwindles or whatever but I've I've watched them kind of grow up with this our fan base they have kids now you know they ask like hey man you going to sell any kid clothing I'm like oh **** these people are **** and having children like appro they're no longer just people who used to like write me from their **** parents'homes they have their own",
      "start": 1947.32
    },
    {
      "text": "any kid clothing I'm like oh **** these people are **** and having children like appro they're no longer just people who used to like write me from their **** parents'homes they have their own homes and **** we've all kind of grown up together and time flies when you're **** having a blast as you'll see very quickly as you've seen already these **** as you listed the years you've been working at IGN I'm sure you don't sit there and be like every one of them felt like a **** DEC on forever totally time flies when you're enjoying yourself and **** like that when you're doing what you want in life if you would ask my old man he would have said time went **** slow cuz he hated working at the post office we all get to make pretend for a living and **** and Chase that as our dream and try to make that dream a reality so it'll the time will fly by even **** quicker man that's the the weird thing it just goes very very fast and you know you look back because like I said",
      "start": 1987.24
    },
    {
      "text": "dream and try to make that dream a reality so it'll the time will fly by even **** quicker man that's the the weird thing it just goes very very fast and you know you look back because like I said we're we're kind of programmed to move forward as quickly as possible you you look back after a certain point and you realize oh **** there's a long taale you know there that means there are a few people who will go see what like whatever we wind up making in the future and stuff like that because of everything that we've kind of done before and not just like the movies but like the podcast or the live appearances **** a cartoon or what it's the same thing I mean on a much larger scale that like we have right everybody who listens and knows you is a fan you I mean a friend you know what I mean that was always the thing of like you know you know when I fell in love with you and everything else it was Mallrats right because like speaking the same language I had never seen it's hard for Tim",
      "start": 2028.08
    },
    {
      "text": "that was always the thing of like you know you know when I fell in love with you and everything else it was Mallrats right because like speaking the same language I had never seen it's hard for Tim to believe because I know he's he's the pure one he's super young but I at this day and age no one was talking about Superman on on a Silver Screen nobody was putting Stanley in a movie to see Wizard magazine in a movie like you know what I mean it's like yes this is something that's us and then you know you're on you're on the message boards you're part of it it's akin to like um you know **** seeing gay porn as a child and getting a heart on and and being like Oh my god this is my world me I got to go **** tap under a stall in a bathroom this is amazing it was it spoke to very few people but but that that group of people just didn't have a way to get in touch with each other yet that was right as the internet was **** cranking up and stuff so like now like it's a you know there's gay",
      "start": 2069.56
    },
    {
      "text": "but that that group of people just didn't have a way to get in touch with each other yet that was right as the internet was **** cranking up and stuff so like now like it's a you know there's gay por everywhere yeah exactly exactly and everywhere you turn there's somebody talking about Superman or **** Stanley shows up in movies but like that was just at a time where that didn't quite exist but I'll tell you man where that came from like this is I always kind of like to give credit or credits too like Quentin Tarantino of course watching Reservoir Dogs and watching in the opening sequence where they talk about the Madonna song Like a Virgin blah blah blah um amazing because you're like oh my God they're talking about **** song and this is I know this is a bankis movie but they're talking about pop culture blah blah blah so I remember seeing that and being like we're allowed to do this holy **** then I I I'm going to talk about **** other movies cuz that's all me and my",
      "start": 2110.24
    },
    {
      "text": "talking about pop culture blah blah blah so I remember seeing that and being like we're allowed to do this holy **** then I I I'm going to talk about **** other movies cuz that's all me and my friends talk about but referencing something the magic of referencing something where an audience goes like I know that that like didn't that didn't exist like it's now it's everywhere you know it's its own **** genre um uh I can't make a movie without referencing **** other movies it's my language but I remember when I was a kid man it had to be night is 19 83 I'm watching um Facts of Life you know the **** girl school TV show yeah TV show when the world doesn't seem to be living up to your dreams solo come on oh no that's the part no knows that that's hacks of Life are all about you ladies and gentlemen this is the game of a gra show middle of it no nobody does nobody does St away to Heaven man there's a part where you're just like down the road you just start filling in words I like",
      "start": 2153.72
    },
    {
      "text": "and gentlemen this is the game of a gra show middle of it no nobody does nobody does Stairway to Heaven man there's a part where you're just like down the road you just start filling in words I like how it was just a standoff we both cut off there like I love how that's a second language for you too you can get anyone to sing with you up until a point yeah sings are **** awesome though because they make you feel a alive so I was watching that show man 1983 and it's I think it was an end either it was the last episode ever which might be the case or it was the season finale but they were all going their separate ways and you know I watch the show every **** week we didn't have a lot of choices back then it wasn't a bad show I mean I'm sure now like you try to watch it be like holy **** hair in that show Mrs Garrett Jo had some bad hair it it might not have aged that well but like back then there wasn't a **** ton to watch and every week watch that show but this was the first",
      "start": 2213.44
    },
    {
      "text": "hair in that show Mrs Garrett Jo had some bad hair it it might not have aged that well but like back then there wasn't a **** ton to watch and every week watch that show but this was the first week they did something blew my hair back and that's considered that's saying a lot cuz I always had very special episodes in **** where someone got drunk Joe is a drug addict or Joe's cousin has CP and then you were like oh my God how are they going to make this work in a sitcom and they found a way to do it this this particular episode they talked about like we're all you know cuz they were leaving they're like we're all going to see each other this summer when the new Star Wars movie comes out and that wasn't normal like they didn't do that it wasn't like you watch other shows and they talked about movies that were in a theater nobody was you know SAR ain't live of course we do topical humor but like ver and charlee and happy days were set in the 50s and they didn't even really reference",
      "start": 2260.28
    },
    {
      "text": "about movies that were in a theater nobody was you know SAR ain't live of course we do topical humor but like ver and charlee and happy days were set in the 50s and they didn't even really reference **** movies and stuff like that and I remember watching that episode and being like holy **** like I'm going to see that movie this summer like I exist because they exist we're in the same universe this is all Canon totally and it was it was thrilling and so later on in life you know when I when I watched Reservoir Dogs and I'm like oh man you can like do a whole scene where you talk about a **** song and just like it hasn't doesn't really move the plot forward but it says a lot about the characters and stuff like that so for me I was like I'm I'm going to do that I'm GNA I'm going to do what me and my friends do we don't we didn't talk to each other in real language we **** used lines from Raising Arizona to express ourselves to one another and The Blues Brothers and stuff so my",
      "start": 2302.68
    },
    {
      "text": "what me and my friends do we don't we didn't talk to each other in real language we **** used lines from Raising Arizona to express ourselves to one another and The Blues Brothers and stuff so my characters did the same kind of thing because of that so Mallrats is that movie that it's very much the internet just before the internet existed that's what I whenever I think of that movie I'm like **** M rats is like the internet come to life every lford the whale once maybe twice that's what I going to say it was formidable for me too those for like Clerk's, Mallrats, Chasing Amy, Dogma and then even up to Jan Jane's Bob because my brother is 11 years older than me we always bonded over media whether it was video games or movies or whatever I remember him coming home he lived in Philadelphia and I remember him coming home being like you have to see this movie Mor rats like and I was like you know in eth or nth grade and we watched it we bonded and and I'm a huge hockey fan so that that",
      "start": 2345.24
    },
    {
      "text": "and I remember him coming home being like you have to see this movie Mor rats like and I was like you know in eth or nth grade and we watched it we bonded and and I'm a huge hockey fan so that that beginning scene with the Whalers and the Canucks like like I'm like oh we can we can you know and then and like he's right yeah Harford would only be the a whale would only once maybe twice in a lifetime and then you go back to clerks and you're and there's and there's more hockey references there and there's more references we can engage with and so it wasn't only something that spoke to me but it helped me speak to my brother in a way like it it was it was almost like a generational Bond my my brother I told I had to tell him I'm like I'm going to I'm going to meet Kevin Smith man he's like that's that's **** insane because that was that's a special person to us as in our relationship mean means the **** world to me though cuz that's what you do it for like I I would love to say that",
      "start": 2387.24
    },
    {
      "text": "that's **** insane because that was that's a special person to us as in our relationship mean means the **** world to me though cuz that's what you do it for like I I would love to say that like oh I do it for the money but like I'm not a I like making money but I'm that's not why I do it you do it because you just want to throw something out there into the world to see if anybody agrees and see that you're not alone that's the beauty of of the communications Medium you're like I think this weird way ises anybody else **** agree and a bunch of people that find you funny or be like or enjoy your blog or enjoy your podcast or or **** sign up for your YouTube channel or whatever however one expresses themselves in social media these days you sit there going like oh **** I'm not alone like everyone **** agrees so that story or not everyone but there are people that think like me pre- internet man you couldn't really do that like you meet people at conventions or comiccons or",
      "start": 2420.92
    },
    {
      "text": "like everyone **** agrees so that story or not everyone but there are people that think like me pre- internet man you couldn't really do that like you meet people at conventions or comiccons or like-minded individuals if you were lucky in school like I remember there was a guy named James burn who was the only dude in high school at the balls to be like oh I like comic books like the rest of us kind of put them way and **** and he was just still reading and still drawing he was an excellent artist so a story like that where it's just like me and my brother bonded over your **** that's like that's why I did it like for that and that's why I kept doing it first time I did it for me like let me throw this out there and see if anybody **** like feels the way I do and because of that I built an audience and then after that almost every time after that it was just like let me throw this out there and hopefully like I don't know people embrace it as this thing the way we embraced",
      "start": 2465.12
    },
    {
      "text": "I built an audience and then after that almost every time after that it was just like let me throw this out there and hopefully like I don't know people embrace it as this thing the way we embraced Raising Arizona Raising Arizona was religion you you know just like religion is not for everybody some people mean like I **** got no use for this Raising Arizona was something that like like Catholicism you know it bound you to people where you were like oh **** you know that movie and it begins there and then there are other sacraments that come into play Blue Velvet was a massive Sacrament in our world in terms of like we communicated through that movie like that's how you did you found your friends because it was like do you like this is is **** up and the people that liked it you hung out with the most and **** do the right thing was another movie that like bound a lot of friendships and like made you kind of like go like you know I don't need to hang out with these people",
      "start": 2505.28
    },
    {
      "text": "hung out with the most and **** do the right thing was another movie that like bound a lot of friendships and like made you kind of like go like you know I don't need to hang out with these people anymore some people you'd show that movie to you'd feel enlightened by that movie and be like hey man let's watch this and you watch some cats and like suddenly they get kind of racial or whatever and you're like okay I yeah on in life exactly so stuff like that you like movies man are the the way we like you you kind of crystallize it perfectly there's almost no need for for me to ramble but the way that you and your brother bound over that or bonded over that bound sounds kind of like couldn't pass the movie The Way You B bound bound get bonded bonded over like that's I don't know like that's what I did with my father my father wasn't a hugely communicative guy like he'd have conversations but they were very like you said earlier like how's the weather good you know like I saw Peter King",
      "start": 2545.4
    },
    {
      "text": "what I did with my father my father wasn't a hugely communicative guy like he'd have conversations but they were very like you said earlier like how's the weather good you know like I saw Peter King like oh good like nothing really deep never I remember asking my father like at one point what were your dreams dad like what did you want to do and he's like what do you mean as if I was just like you failed in life what did you want to do no I was just like when you were my age like I know you was this one thing the guy who like puts the roof our our heads and **** like **** mom and and like you're your dad but what were you before Dad like and did you hit it and then I realized later in life he **** my father was the most successful person I ever met all he wanted to do in life was get married and have kids so everything else was **** scenery and Greenery so he had the jackpot early in life and he was so content his job was just a **** burden to him so he wasn't like way",
      "start": 2591.2
    },
    {
      "text": "get married and have kids so everything else was **** scenery and Greenery so he had the jackpot early in life and he was so content his job was just a **** burden to him so he wasn't like way communicative but the way we communicated was **** through movies so a **** would take me to see World According to Garp at age 12 which is probably you know maybe a little heady for a 12-year-old just a bit a little you know you how do you explain like did he did that and this is not in an era where people were like openly communicative but like to have a conversation afterwards which we didn't but like the you know you take your kid to see the movie the potential of conversation after is like did that dude get his dick bit off in the car spoilers if you've never seen World oford guard he was in my queue but uh he you know he was like he can handle it and if if he can't well he will after the like it was I don't know like some there was a generation prior to me where fathers would go",
      "start": 2633.68
    },
    {
      "text": "was in my queue but uh he you know he was like he can handle it and if if he can't well he will after the like it was I don't know like some there was a generation prior to me where fathers would go out and play catch with their sons and I think my father realized like if I throw a ball at this **** butter ball it's going to hit him in the face so how can I bond with him and he was like movies like I like movies he likes movies and so when you say something about like you and your brother bonding it just like takes you back to like oh yeah that's why I got into it like to make something that you could like share with somebody in that instance it was me and my father in your instance it's you and your brother it's thank you that means a lot no no I mean thank you because I mean we were we were just reminiscing about he even came home when Jay and Silent Bob Strikes Back came out which was right before 911 and we are from New York so that was a a traumatic time but it was a few days",
      "start": 2677.44
    },
    {
      "text": "we were just reminiscing about he even came home when Jay and Silent Bob Strikes Back came out which was right before 911 and we are from New York so that was a a traumatic time but it was a few days before that I had broken my like my collar bone just a couple days before could barely get a shirt on just had my like a for no good reason you broke your col I I broke it on a like BMXing on Long Island somewhere and and just and just you know as as young as young children do it's such a sad pre 911 story you're like I was BMXing on Long Island minding my own business enjoying the **** out of life bust a c but whatever the **** and then Darkness well I when things couldn't get worse I just remember I just remember the middle of the sandwich of that happening in early September and then obviously 911 was that my brother came home and we saw we went and saw the movie and I couldn't I could barely move like that was such a deil surprisingly debilitating injury where I had to like drape",
      "start": 2720.36
    },
    {
      "text": "911 was that my brother came home and we saw we went and saw the movie and I couldn't I could barely move like that was such a deil surprisingly debilitating injury where I had to like drape a button down over me basically I could like put my arm in it and we sat in the movie there and we were hysterical laughing it I was laughing Why I Hurt I'll never forget that you know and so yeah it is those moments that that are special that's why it's very surreal that we're here I wins the world do you remember that summer like prior to September 11th yeah what the big story was so big that I believe it was on the cover of Time Magazine no well I don't remember this part shark attacks up and down the East Coast shark attacks had like dramatically increased for the first time in in a decade or more and so there were all these shark attacks happening right in that summer man and like getting national attention like what the **** up with shark that's how **** like that's the world we lived in",
      "start": 2761.32
    },
    {
      "text": "and so there were all these shark attacks happening right in that summer man and like getting national attention like what the **** up with shark that's how **** like that's the world we lived in right prior to September 11th where people like sharks what are we going to do about them then everything **** changed everything got really really serious really if you were a shark publicist you were like **** man **** God damn it Al-Qaeda Shark Week was going to be the biggest thing ever P just off the cover of time yeah it took him a while to get back but it had to be a bunch in a tornado and then suddenly sharks were like we're back **** it's you know Colin has the collar bone but like for me right before September 11th I was going to college like for you know M University of Missouri and so like I remember everything leading up to that and then how yeah it all flipped but like yeah how you know when I got there like I told you this after the ComiCon panel right like what I",
      "start": 2804.92
    },
    {
      "text": "and so like I remember everything leading up to that and then how yeah it all flipped but like yeah how you know when I got there like I told you this after the ComiCon panel right like what I what I introduced myself like I remember when we had our freshman year you know you're on the dorm floor like two truths and a lie kind of **** and the one that I got everybody with like I'm going to be in Jay Silent Bob Strike Back And when they came around that's a lie I'm like that's the **** truth I pull up view skew and I'm like look there's my picture on this poster that's going to be in the background in what's his name's office office God I remember that and I remember going like now it's common place where you send something in yeah fan could it's a Kickstarter reward now they now they'll if you give them 500 bucks they'll do it but it was like you know the 20 00 right you know right before 2000 right before September 11 so it was this glorious heady time on the internet where a lot",
      "start": 2843.76
    },
    {
      "text": "if you give them 500 bucks they'll do it but it was like you know the 2000 right you know right before 2000 right before September 11 so it was this glorious heady time on the internet where a lot more people had jumped online and **** and so the VSC Message Board which was this is very simple whiteboard very simple to Reddit yeah very s similar to Reddit um where you post thought and then **** Branch into a thousand responses and **** and we were able to do things like hey man if you want like you know to see yourself in the background we got to put pictures up anyway why not you folks and so they sent in a bunch of pictures and we put them up on the on the peg board and the pin board in the background so that's **** wild well just there was that and that was like the biggest thing coming up to that remember I remember listening to the J son Bob soundtrack on repeat right cuz that was one of the albums I bought right before I went and I knew everyone one of the lines like you",
      "start": 2883.56
    },
    {
      "text": "coming up to that remember I remember listening to the J son Bob soundtrack on repeat right cuz that was one of the albums I bought right before I went and I knew everyone one of the lines like you know had the interstitials or whatever in there and like being so into you and three people in the theater when loving it religiously but like I remember like one of the stories I always tell about before and after is I forget who who's saying it the artist but on the you had how many people want to kick some ass on the thing right and I remember went to college got lime wire started legally downloading music but at the time whatever who cared and I remember like on September September 15th they put up a new version of that live and it was their first live performance after it and it was like this whole thing about violence is no answer to violence it was like like that you know what I mean just a week separated the way these guys changed their song you know",
      "start": 2928.12
    },
    {
      "text": "after it and it was like this whole thing about violence is no answer to violence it was like like that you know what I mean just a week separated the way these guys changed their song you know what I mean to respond they took how many people want to kick some man into there's like that part you know don't L and like violence is no answer of violence blah blah and it's hardest to like it was totally like everybody calmed down and it was like what I needed to hear it's like really weird I did not expect to get into this the rabbit hole obviously we're still all still so that's our advice for starting yeah own great Stroke Nine Kevin what's your topic um God where do I want to go man we were just talking about something where I was like oh that's an interesting there's plenty we can get around if you want you're talking about YouTube when you were saying this yeah yeah I was just going to throw here I'll throw a little love toward uh toward something but this is my go-to like the way",
      "start": 2965.96
    },
    {
      "text": "if you want you're talking about YouTube when you were saying this yeah yeah I was just going to throw here I'll throw a little love toward uh toward something but this is my go-to like the way that when I was younger I'd be like ooh uh Mork and Mindy is on on uh Thursday and you circle it in TV Guide and uh you know we didn't we couldn't DVR so you had to watch it when it happened you're so good now oh amazing so it really it killed family time you know because it's just like well we can catch this whenever but it's kind of sad that family time was spent in front of T anyway so there was a time where the family time at the dinner was killed by television and uh but um uh what was I talking oh so this is what I go to my go-to for entertainment the thing that I'm like oh uh it's Sunday my my my stories as my grandmother would call like The Young and the Restless like you couldn't bother when her stories on my stories are on Cinema Sins on YouTube oh yes oh my",
      "start": 3005.16
    },
    {
      "text": "oh uh it's Sunday my my my stories as my grandmother would call like The Young and the Restless like you couldn't bother when her stories on my stories are on Cinema Sins on YouTube oh yes oh my God this is the perfect form of entertainment for any movie fan number one you get to watch the movie again kind of because it's nothing but clips of the movie and then number two it's just like it's it's hysterical or enjoyable on a whole different level because you know it's almost like its own commentary track and the movies you know truncated usually down to the number's been growing now it's like how you know everything wrong with a movie in 19 minutes used to be like 4 minutes but I got to tell you like I don't care I uh gather around and be like oh it's my jam um so I I I mean I you know I mean they certainly don't need the help they have lots of subscribers on YouTube but that has been my go-to lately for entertainment like and and it makes me then go watch that movie again",
      "start": 3048.32
    },
    {
      "text": "you know I mean they certainly don't need the help they have lots of subscribers on YouTube but that has been my go-to lately for entertainment like and and it makes me then go watch that movie again like it's kind of like fantastic advertising for whatever movie they're doing but it's also just fun it's kind of cool watching somebody practice their art man like watching them build an audience and go like oh you know what I'm going to do I'm going to uh throw up clips and I'm going to talk about like what's wrong with this movie is it's I don't know it's the perfect 21st Cent Century distillation of what's possible on the internet how you can like create as you guys are learning and as you guys are branching out to do right now you can create your uh living and dictate the terms of your living and be responsible for uh how you earn by being artistic being creative we're just uh around on the internet eating peppers and uh talking about video games it's a great time",
      "start": 3094.0
    },
    {
      "text": "your living and be responsible for uh how you earn by being artistic being creative we're just uh around on the internet eating peppers and uh talking about video games it's a great time to be alive yeah yeah we met those guys uh at VidCon a couple months ago are they is it more I always assume it's one guy cuz one dude but it's a team that need you know edits all the clips and all that stuff another one I love is the Screen Junkies Screen Junkies are great uh Whatchamacallit uh Honest Trailers and I watched there behind the scenes of how it was done I found that uh fascinating cuz I was I always assume oh it's like one guy sitting there watches it writes a bunch of jokes it is a they it's no uh joke dude like they produce they produce YouTube videos now the way they used to produce television everyone's got a uh staff like a staff of researchers and stuff like that we have Kevin over there good job Kev our staff all it's kind of crazy but yeah it's those both",
      "start": 3138.72
    },
    {
      "text": "to produce television everyone's got a uh staff like a staff of researchers and stuff like that we have Kevin over there good job Kev our staff all it's kind of crazy but yeah it's those both of them are real like I the one Cinema Sins seems to be far more consistent and I get pissy when they don't do like more than like two a week or something yeah right that's the thing know how much content how much time it takes to create that content I'm like uh can you do more where they all been hot mess moves hot mess moves get your uh together make more episodes you will be hearing that for the rest of your life like that's the when you you choose to enter the Arts man this is the common conversation you have with your audience after you show them something you've just labored on forever they go that's great what's next and you're like I just uh finished that magic trick man like what what do you mean what's next icious it's with video games right where I'll talk to develop ERS and",
      "start": 3183.96
    },
    {
      "text": "go that's great what's next and you're like I just uh finished that magic trick man like what what do you mean what's next icious it's with video games right where I'll talk to develop ERS and have them on or I'll see them get interviewed by somebody else and you're like all right so what's happening with the sequel and he's like I just spent 3 years making this like get something from nothing little numbers on a computer and they kick each other's ass and shoot each other and you want to know what's next but yeah it's like we're we've seen it let me see the next these days it's so crazy too especially with the internet where we can sometimes produce especially at IGN multiple videos a day and we're just put in all this content so then when we put way more effort in work into something that we love and care like there'll be videos make that we pour our hearts into some we just we're talking we're not really doing anything and the audience doesn't see the difference you know I",
      "start": 3223.04
    },
    {
      "text": "that we love and care like there'll be videos make that we pour our hearts into some we just we're talking we're not really doing anything and the audience doesn't see the difference you know I agree and it's crazy then they'll just move on to the next one they'll just be oh cool and you're just like no no guys guys no we did this thing like this is the one that's supposed to blow up yeah you should know this one and it's it's just crazy that there's no pointing to what becomes viral there's no you know the best you can do as a new media Creator um is just create vast amounts of content and hope that they something pops or they find I the other day you know things gravitate to the top of the YouTube page there's some little cartoon about um a dad explained Slave Leia outfit to little girl oh yeah yeah and the dude I looked at the dude's Channel and you know dude's got very few subscribers and he's made a couple of these videos and stuff and all you know they're both all animated all",
      "start": 3263.16
    },
    {
      "text": "oh yeah yeah and the dude I looked at the dude's Channel and you know dude's got very few subscribers and he's made a couple of these videos and stuff and all you know they're both all animated all clever but perfect Topic at the right time and the way it was phrased all a sudden you a bunch of people going like oh uh that is interesting What would you say to a uh girl a young girl who's like the uh with this costume yeah and boom that is now over a million hits probably at two it's gone viral but you can't gauge that like that dude wasn't sitting there going this is the one I don't know maybe well and that's the thing for us right like even when we were before we rebranded and we were doing all this content we're doing the podcast we're doing great topics they're timely we're expecting this one could do big numbers it doesn't or it does they all do fine we have a great audience but for the longest time our most successful video was the AR it was the archive of The Fast",
      "start": 3305.84
    },
    {
      "text": "expecting this one could do big numbers it doesn't or it does they all do fine we have a great audience but for the longest time our most successful video was the AR it was the archive of The Fast and Furious live stream which was a camera pointed at a bunch of fat guys on a couch watching The Fast and Furious not giving commentary not doing anything it's just that was a great headline people tuned in they'd watch what's happening they'd pop to the comment and they'd be like wait why why are you showing the video why aren't you showing all the movies back to back to back because we were we were marathoning all the Fast and Furious and it's like well that's not what we're doing you know what I mean we're an amazing age where somebody will uh watch you watch watch movies well that the other you know we had a breakout success on a stupid live stream on what on Black Friday where Colin and I played a best of seven Monopoly tournament on a board game and we had two cameras one on the",
      "start": 3344.84
    },
    {
      "text": "other you know we had a breakout success on a stupid live stream on what on Black Friday where Colin and I played a best of seven Monopoly tournament on a board game and we had two cameras one on the board and one on us and like No One's Gonna watch this and I'm watching the numbers on we have like 2,000 people concurrently watching this right now like live and now it's got like 35,000 people there's like 35,000 views on this video on demand it's just like what did we uh do before the internet right yeah no know like how starved were we for entertainment but it's so weird and and and I don't know encouraging to know that there are 2,000 people out there be like I got a few few minutes watch Monopoly it's the weirdest thing and this is going back to Moratz right is that and I I remember when you got into podcast and I was like oh great I'm glad he because we've been podcasting at IGN forever right and with Beyond and everything else and our own uh but when you did I'm like oh",
      "start": 3379.44
    },
    {
      "text": "when you got into podcast and I was like oh great I'm glad he because we've been podcasting at IGN forever right and with Beyond and everything else and our own uh but when you did I'm like oh that's such a natural thing blah blah blah blah but it never dawned on me to flip it back and remember the first DVD I ever saw was Moratz and how amazing it was to watch you guys picture and picture talk about the thing and how that bonded me to everybody and that's why like when when Affleck started blowing up I'm like oh man that's it I'm I love Ben and I know Ben because of this and I'm glad I've heard him make jokes like that he would never make in an interview you know I'm like oh you like that movie with that guy he slept on Kevin Smith's couch mom when they were making this movie and here he heard this fight between Kevin and his then girl it's a long story that's how I got to to podcasting because like the way Moer described it Scott Moer had uh listened to an episode of the Ricky",
      "start": 3419.64
    },
    {
      "text": "he heard this fight between Kevin and his then girl it's a long story that's how I got to to podcasting because like the way Moer described it Scott Moer had uh listened to an episode of the Ricky Gervais podcast and he goes It's kind cuz I was like what is it and he's like well that is a radio show that they put up online for for us to be able to listen to here but he goes but it sounds just kind of like you know what we do when we do a commentary track he's going people sit around just bullshitting and I was like really that appealed to me very much there was a podcast that I was on like I never give these guys any credits I think it was called geek geekscape or geek cast this is going back to 2006 okay um uh um yeah they had a real like very simple theme like kind geek geek uh I forget the name of it anyway these two dudes came to our old office on uh down the street a little bit the VCQ office and they brought their little uh recording device with them and uh they",
      "start": 3453.88
    },
    {
      "text": "I forget the name of it anyway these two dudes came to our old office on uh down the street a little bit the VCQ office and they brought their little uh recording device with them and uh they found me online we were talking on some form though okay you want to do a podcast I was like oh sure and we sat down recorded a desk you know three mics and uh it's the first podcast I ever did and I instantly fell in love I was so jealous of these two dudes I was like you do this all the time like uh just for free for nothing like there's no it was clearly passion project sure sure so I was like uh this is possible and so I remember hitting up Moer I mean really we started SMod cast um one of the reasons was Ken Plume the guy was running uh Quick Stop entertainment which used to be movie poop shoot we had movie Poop Shoot became Quick Stop entertainment there a lot of people people bitched about like you know people that used to write for the site be like it's tough to get",
      "start": 3504.92
    },
    {
      "text": "be movie poop shoot we had movie Poop Shoot became Quick Stop entertainment there a lot of people people bitched about like you know people that used to write for the site be like it's tough to get credentials with a site called movie poop shoot and I was like really well I remember I remember when you guys did that when I was still you know hitting up the website all the time and I clicked over because I was like you were like somebody's talking uh about us on this super site and I went talk and I'm like oh it's got an ass and I immediately exed out and then like weeks later somebody's like oh it was this and it was that and like oh I never dug deep enough to find the Easter eggs to BL man and chronic we put up a we had put up a fake website an ATI Jane on Bob website that had the trailer the first trailer buried in and stuff um I'm sorry I hit a poth ole what was I talking about right before that it was that boring nobody remembers we just keep going with you we're just we're",
      "start": 3560.12
    },
    {
      "text": "trailer the first trailer buried in and stuff um I'm sorry I hit a pothole what was I talking about right before that it was that boring nobody remembers we just keep going with you we're just we're just shucking the Jing around forgot what it was Shadow Boxing it's going to fall you were you were talking about the guys you were podcasting with and then the thank you God God damn Ken Moer come on Round of Applause so those dudes man I sat down I was like this is what I want to do I want to do with these cats soon Ken Plume was like well we could use some tra on Quick Stop entertainment and so uh I said hey man well this is the Confluence of events the topped with Scott Moer and I hadn't been hanging out and and having a good time like bullshitting all our hangout time was work related and uh and what you know our relationship had been predicated on sitting around going like hey man what do you think uh happened after the Death Star blew up like uh like that so I was like well",
      "start": 3594.24
    },
    {
      "text": "and what you know our relationship had been predicated on sitting around going like hey man what do you think uh happened after the Death Star blew up like uh like that so I was like well maybe if we sat down forced ourselves to sit down record one of these podcasts once a week where you know it's not business it has nothing to do with our work or anything like that it's just this uh and whatnot and then we have to put it up then it'll Force us to hang out for once a week and just uh and not work or something that's the exact same thing that happened with us is you know what I mean like we Colin and I live together and work together at IGN you know what I mean people were always like oh don't get sick of each other and it was like no we don't see each other that much at the office and when we go home we go to our separate girlfriends our separate rooms we do separate things so we weren't even having like friend time anymore you know what I mean you crucial oh yeah you",
      "start": 3638.36
    },
    {
      "text": "office and when we go home we go to our separate girlfriends our separate rooms we do separate things so we weren't even having like friend time anymore you know what I mean you crucial oh yeah you lose sight of it's a real relationship you need to you need to treat it like a relationship and so when we started doing that yeah for sure it was time with us but then on top of that you know Nick and Tim went from being like Oh we know them they're our friends to being like Oh well they're our Bros we'll die for them you know what I mean that is uh that was how I got to it man was like that Confluence of events was like I want to do this like those two guys that podcast was just fun I was like what wait we could talk about whatever we want we could go as long as we want there were no rules yeah exactly and then the idea and it's still the same today man as most cats know or maybe don't know but like there's no uh gatekeeper yet still still keep waiting every day somebody would be like",
      "start": 3676.2
    },
    {
      "text": "exactly and then the idea and it's still the same today man as most cats know or maybe don't know but like there's no uh gatekeeper yet still still keep waiting every day somebody would be like from now on Mr internet says you can or can't post something but it's the WW West it continues to be the WW West the only medium that I can think of like if you want to Stage a play you got to get permission pay some uh rent whatever the uh if you want to make a movie that goes into theaters believe me there plenty of Gatekeepers that will keep this in check unless you're finan it yourself and even then if you want to get in the theater there's a gatekeeper who could say no if you want to make a television program there's a lot of checks and balances to keep you from uh expressing yourself but in this medium podcasting still and YouTube still there's nobody like uh it's very extreme what you have to do to get something taken off uh YouTube and and even more extreme you",
      "start": 3709.92
    },
    {
      "text": "yourself but in this medium podcasting still and YouTube still there's nobody like uh it's very extreme what you have to do to get something taken off uh YouTube and and even more extreme you have to say something insane to get a podcast taken down like it's just utter Freedom right now and one day somebody going to figure out how to uh charge you to do this or uh stop you from doing it without uh them saying Oh we approved this right until then man do it because it's it's as close to Homegrown entertainment as you can get and nobody's uh there's nothing but upside like you can find a massive audience without uh having to get through some gatekeeper pay to do so or you could just hobby it man like you just like record conversations use it as an excuse like me and Moer as an excuse to Hung used it as an excuse to hang out use it as an excuse to sit down with your uh mother or father and be like hey man what was your life like because one day you run",
      "start": 3752.4
    },
    {
      "text": "me and Moer as an excuse to Hung used it as an excuse to hang out use it as an excuse to sit down with your uh mother or father and be like hey man what was your life like because one day you run out of that opportunity and you don't ever get to uh find out like I recorded some podcasts with my mom and it was nuts cuz she just I fed her weed cake and she was so honest but you know I got to like talk to her as like what was this like what's that like rather than just be like you know you're my mother and I honor you as my mother kind of want to get to the heart of who she was as a person if you ever want to figure out who the uh you are as a person how the uh did you get here what decisions did she make that led to the moment where she's like I'm going to uh this doofus and then nine months later I was born yeah so you know you can even use that uh podcast as an excuse to like sit down and like talk to somebody that you find interesting but you don't have any",
      "start": 3802.0
    },
    {
      "text": "and then nine months later I was born yeah so you know you can even use that uh podcast as an excuse to like sit down and like talk to somebody that you find interesting but you don't have any like entree into sometimes it's weird in our culture to be like hey you want to go out or go to a movie or want to get something to eat it's much easier to be like I'm thinking about recording a podcast you want to come over and be like oh yeah I understand that makes sense we'll sit around we'll talk for 2 hours it'be great yeah well and that's the whole thing we always talk you know like it you know we record out of the spare bedroom and we call it our home studio but like when you when we invite a guest over I have to like they come like this is our house and that's my dog and my girlfriend's over this where the and like you know what I mean there's that initial like oh all right cool and then it's just like but on what other situation would I have Michael Rosenbaum in my house we",
      "start": 3841.64
    },
    {
      "text": "over this where the and like you know what I mean there's that initial like oh all right cool and then it's just like but on what other situation would I have Michael Rosenbaum in my house we should really telling them ahead of time by the way I do I say home studio I drive home that it's the home but I think people don't understand it's the home home they're like we heard the studio part you weren't uh kidding about the home but what what better job to have where you can like literally roll out of your uh bed and put on a robe and go do it do you hear let me ask you this do you find yourselves going like oh save that for the podcast sometimes it interrupts all the time this guy won't let us talk like I swear every conversation we have he's like save it for the show show it's CU we'll be in the car like what's your topic and my topic is you know what it's it's tables and then ni I got a story about table it's one time where I'm like no that's no I don't want to hear the",
      "start": 3878.8
    },
    {
      "text": "CU we'll be in the car like what's your topic and my topic is you know what it's it's tables and then ni I got a story about table it's one time where I'm like no that's no I don't want to hear the story twice I want to have an honest what I like when you listen to me well I only listen to you on the podcast that's true that's why I need that in my life what you got to do is wire everything so you're constantly recording all the time we wish we could do that but see the car rides to the podcast rides those are the ones that you know what you're saying the the internet like doesn't take things off that's the stuff that they're going to take off right we get all the runch out in the car ride and then we go PG-13 for the podcast we got to we got to test it on the trip down here yesterday we set up a GoPro and miked everybody in the car and that way that was like our Patreon exclusive episode we put up over on it was how long did you shoot oh same thing hour and a half we tried to that's",
      "start": 3913.8
    },
    {
      "text": "set up a GoPro and miked everybody in the car and that way that was like our Patreon exclusive episode we put up over on it was how long did you shoot oh same thing hour and a half we tried to that's our like promise to the listen who was driving Uh Kevin did Kevin Kevin is like the he every people who listen to the show and watch the show know Kevin's the unsung hero even though we mention him but we won't let him on camera only I think three fans now have seen you in person today meltdown a fan came over to meet us and I was like and I'm like this is Kevin he's like oh it's a pleasure to meet you get out of here it's like seeing Clarabel with the makeup off right A lot of people in the audience like who the uh is clar do your uh history on TV look that up on the inter by kids so sad um all right so that was my topic what's your topic Al so we're skipping my topic we're going we're going straight to Nick here yeah I want to ask you the question firewood a good question so we're",
      "start": 3949.64
    },
    {
      "text": "um all right so that was my topic what's your topic Al so we're skipping my topic we're going we're going straight to Nick here yeah I want to ask you the question firewood a good question so we're talking about you talked earlier good rest the show sucked rubbish was all build up to this moment uh you mentioned how our attention spans have gotten a lot shorter right and there's so much content out there that we feel we need to watch a lot of it well that wasn't the case uh back in the mid90s when you made Clerks so in your opinion can something like can can something like Clerks happen again is there is is that even possible in today's society here's what here's here's the one thing I can say definitively about Clerks there will never be a movie that looks that bad again like think about it looks really great on Netflix by the way very crisp very it does it really but it's it's still like you can't even with a cell phone uh you can make a better looking picture than that at this",
      "start": 3986.68
    },
    {
      "text": "it looks really great on Netflix by the way very crisp very it does it really but it's it's still like you can't even with a cell phone uh you can make a better looking picture than that at this point everything looks like 35 mm at this point right now could that happen again I mean every year at Sundance there's a hey this film like got came out of nowhere um the girl the woman who does Girls uh Lena Dunham she came from indie film world what was it Tiny Furniture I think her flick so I definitely think it's possible um but it's like YouTube is kind of supplanted that so to speak like indie film there was a period where you know they were taking chances like crazy and now indie film is like uh a movie that a studio didn't make but it Still's got tons of famous people in it and sometimes cost 15 to 20 million bucks so it's it's a completely different like uh Imitation Game with Benedict Cumberbatch that's an indie film that's pretty uh expensive indie film and stuff so the",
      "start": 4027.96
    },
    {
      "text": "cost 15 to 20 million bucks so it's it's a completely different like uh Imitation Game with Benedict Cumberbatch that's an indie film that's pretty uh expensive indie film and stuff so the lowbudget kind of like uh out of nowhere thing the Cinderella story as they used to call it like me and Robert Rodriguez um Ed Burns a host of others who came through Sundance I don't know if that can happen again I not quite that way you know it seems like I mean like for me right it's the fact that it I always talk about like our attention spans are shattered glass you throw that giant you have you start with a giant piece of glass you throw it down you have all the shards and it seems like to capture the moment that way for an indie film would be so tough where everyone's talking about it where it's like spreading like I I always think about it in the same way of like Blair Witch Project right where you heard these like Rumblings of this it was the first found footage film and people couldn't",
      "start": 4080.36
    },
    {
      "text": "like spreading like I I always think about it in the same way of like Blair Witch Project right where you heard these like Rumblings of this it was the first found footage film and people couldn't tell if it was real or not you know I mean like by the time it got to theaters everyone knew about this flick and wanted to see it yeah we had that we had it sort of happen with Paranormal Activity but that was a while ago I agree Paranormal Activity was the last one but that was not like um that I don't think that movie like Paranormal Activity stood on its own feet based on the concept so did Blair Witch Project so much of Clerks was predicated on and this guy he made the movie in the convenience story so that movie leaned heavily on on the backstory at least in its theatrical life and it never played on more than uh 50 screens in theaters it didn't go uh wide and deep when where it found its true audience is when it went went to Home Video and that's where people were like they",
      "start": 4124.96
    },
    {
      "text": "played on more than uh 50 screens in theaters it didn't go uh wide and deep when where it found its true audience is when it went went to Home Video and that's where people were like they weren't writing think pieces about it anymore the true audience was going that's me that's my friend it you know I remember there were a few reviews there's one review in People magazine that said about Jason Mewes's character you want to find the the rock the actor crawled out from under make sure there's nothing else like it under or something but like you know it was a they were foreign people to the people that reviewed the movie because they there weren't a bunch of Internet bloggers right now that probably worked in my benefit because he had a bunch of people writing in newspapers and stuff like that going like well this movie is a snapshot of Gen X and blah blah blah if Gen X had had a voice like the internet at that point maybe they would would have said no he's not like this is you know",
      "start": 4170.12
    },
    {
      "text": "that going like well this movie is a snapshot of Gen X and blah blah blah if Gen X had had a voice like the internet at that point maybe they would would have said no he's not like this is you know what I'm saying yeah there's no one there to say wait I am a representative Gen X and I don't know if this is bingo bingo just uh a corpse exactly so I uh I mean look the closest I came to that was I remember Harmony Karin filmmaker at one point said in some interview uh if he is the voice of Gen X then I want to kill myself or something like that he doesn't speak for me or so and that was at the beginning of the internet too so I I benefited greatly from people that wrote about that film um intelligently or or something but that a that movie found its audience at home where people were like oh I am Randall oh I am uh Dante or I know Jay and Silent Bob and stuff so it had this weird two life effect but I don't know if I mean there there always movies that come out of Sundance but",
      "start": 4212.88
    },
    {
      "text": "like oh I am Randall oh I am uh Dante or I know Jay and Silent Bob and stuff so it had this weird two life effect but I don't know if I mean there there always movies that come out of Sundance but it's tough to surprise people anymore and they've and you know low budget is kind of not the move anymore and and the low budget quickly gets absorbed into the business like you got to remember when we started it wasn't us going like we're going to get uh rich and direct a studio movie like that was not the path now it is now you can make a movie like the guy that made Godzilla made that weird what was it Monsters Monsters you know lowbudget movie where he went and Sh very clever how he did it and uh and shooting in in areas where you know there was already damage and whatnot but like that dude went on to like make uh Godzilla that didn't happen back the day and now a uh Star Wars movie so you know I think if that had been on the table back in the day for me that",
      "start": 4263.08
    },
    {
      "text": "but like that dude went on to like make uh Godzilla that didn't happen back the day and now a uh Star Wars movie so you know I think if that had been on the table back in the day for me that would have been intimidating enough for me to not try to make a movie you know what I'm saying like like oh that's the path you make one of these indie films and then you make uh Godzilla like you know that maybe that's the path for talented filmmakers and stuff but I guess for me I was I was so I don't know I'm glad I came up in a time where there was not like this is a fast track to that blaz your own trail kind of thing right or not even just like there's like I'm not a visual stylist so I was never going to make a comic book movie I love watching them but like you couldn't get a comic book movie out of me it's requires too much effort and and I was still learning my craft I I'm still learning my craft to this day but I didn't start out as a strong visual stylist all content with",
      "start": 4309.48
    },
    {
      "text": "book movie out of me it's requires too much effort and and I was still learning my craft I I'm still learning my craft to this day but I didn't start out as a strong visual stylist all content with no way to uh express it and uh so two decades into it now I know how to express myself visually with a camera I just don't have access to the same type of material and it would also be redundant this at this point like the stuff uh that I wrote about like Clerks and Mallrats Chasing Amy Dogma Jane son Bob strike back the uh that like oh people identify with that from that period blah blah blah that if I make that a movie like that again people like what's the uh point D the internet does that every day in a far more clever way than you do then there's also the question of like I can't really access personal stuff anymore that's how I played the game early on I just took my real life and put it into the movies right but then at a certain point my real life became the movies like",
      "start": 4355.08
    },
    {
      "text": "really access personal stuff anymore that's how I played the game early on I just took my real life and put it into the movies right but then at a certain point my real life became the movies like you know I got my wish like this is what I wanted and I became a filmmaker but when that becomes your life you stop living a real life like you I'm going to write a new script about how I'm so tired from podcasting and going to events Bingo like I ran you could tell when I ran out of personal things to say more or less when by the time I get to Jay and Silent Bob strike back cuz I'm like this is a movie about making movies like half of the movie takes place on on a movie set you know that's like the furthest thing from Clerks you can imagine Clerks is is relatable to anybody who's ever had a uh job whereas James S Bob strike back is just a flat out balls out comedy that's completely unrealistic and stuff and that's because my life had become completely unrealistic I made a little black and white",
      "start": 4401.04
    },
    {
      "text": "James S Bob strike back is just a flat out balls out comedy that's completely unrealistic and stuff and that's because my life had become completely unrealistic I made a little black and white movie and I made it going like someone will see this and then they'll give us money next time so I don't have to pay for the movie it wasn't like this will start my career it was just like this is this is going to this this will get us to the next movie get me out of debt maybe at that so had I thought that like well this is the path to a career blah BL blah that would have seemed seemed too daunting to me and I wouldn't have tried just like if I had known Richard Linklater like he was from Austin I knew that but I was like this guy's from Bumble uh Texas man he made a movie He's not in Hollywood or Los Angeles and uh or New York if he could do it in Bumble uh Texas I could do it in Jersey and Bumble uh Texas is Austin and then there's no it's not Bumble uh uh Austin",
      "start": 4441.0
    },
    {
      "text": "or Los Angeles and uh or New York if he could do it in Bumble uh Texas I could do it in Jersey and Bumble uh Texas is Austin and then there's no it's not Bumble uh uh Austin it's a cultural Mecca not to mention the state capital it's an amazing place especially if you celebrate the Arts particularly in Austin but thank God I didn't know that if I had a little bit of Education it'd be like well Austin is an Arts community supported by UT and of course they uh he could make this amazing film in that world and I would have then also been like oh maybe I shouldn't try this after all little ignorance goes long way you know and and we're hoping so it absolutely helps because if you knew everything you were about to face you might not go on the journey sometimes you got to discover uh along the way and whatnot and some things are harder than you think they're going to be and some things are way easier than you ever imagined man sometimes you catch a wave and",
      "start": 4483.32
    },
    {
      "text": "got to discover **** along the way and whatnot and some things are harder than you think they're going to be and some things are way easier than you ever imagined man sometimes you catch a wave and you're off and running but I don't know I don't know if it can happen like that again in movies it happens like that all the time on the internet there like I I'm this weird hybrid or cross between like I don't know I swear and I don't say this in this is not I don't mean this sound arrogant it's just something I've been thinking of a lot lately like I just can't point to somebody else and be like he's like me like and and and not like I'm a true original anytime I want to be like Oh I'm like U I'm a filmmaker like David Fincher I'm like well no I'm not David Fincher like that's what he does the only thing he does and he's exceptional at it and then I go like oh well I'm a podcaster like this person but that person's also not a filmmaker like I am or doesn't have a TV show I'm like all right",
      "start": 4527.6
    },
    {
      "text": "only thing he does and he's exceptional at it and then I go like oh well I'm a podcaster like this person but that person's also not a filmmaker like I am or doesn't have a TV show I'm like all right well then I'm I'm a guy who who does **** comic book you know like it's just there are so many different things that I do that I can't like point to someone else exactly and be like we do the exact same **** thing but I noticed that it's happening more and more many artists are spinning more plates because a we can and B that's survival like at the end of the day man sometimes it's like all right this is what I do but when I'm not doing this I can also do this it helps to be you know have a few Tools in in the toolbox yeah there's a ton of YouTubers now writing books that are then getting turned into movies yeah which is very interesting and with some good success famously uh The Fault In Our Stars was was a b was his name uh John Green yes and I mean brilliant guy my kid was hipped to him",
      "start": 4571.08
    },
    {
      "text": "turned into movies yeah which is very interesting and with some good success famously uh The Fault In Our Stars was was a b was his name uh John Green yes and I mean brilliant guy my kid was hipped to him long before I was like I remember seeing that book years ago on her desk and being like what's this she's like there's a guy on YouTube he makes videos and I watch him and he wrote a book and I was like oh good for you and good for that young gu good for that young guy little that I know is good day in his life oh my God and you want to talk about subscriptions on **** YouTube but that dude is **** insanely famous in that Circle and and translated over to film and so now it goes into another medium so like that's all possible now and you know that's why you guys are like coming you are merging at the absolute right time you can absolutely be captains of your own destiny there's a couple cats Brian Quinn uh is a friend of mine a guy he's in a group called The Tenderloins they do show",
      "start": 4620.64
    },
    {
      "text": "at the absolute right time you can absolutely be captains of your own destiny there's a couple cats Brian Quinn uh is a friend of mine a guy he's in a group called The Tenderloins they do show on True TV called Impractical Jokers oh okay so Brian Quinn love that show oh Brian Quinn is such a beautiful human being I've known this dude since like 1995 he was like you or or you one of three people who saw **** Mallrats in a theater or James Bob sh back in the theater he went and he was a Staten Island kid and um you know he had uh it was early on the internet like the days of the Forum the the Whiteboard the VCU Message Board of vcu.com whiteboard sounds so **** racist but you know that's what they call just writing on a whiteboard and you're a racist and I'm pretty damn racist um so he had said hey man I went into a bookstore um to look for the Mallrats script book and the guy beyond the counter and this was weird this is like the first time I heard about this but certainly not the last",
      "start": 4661.12
    },
    {
      "text": "said hey man I went into a bookstore um to look for the Mallrats script book and the guy beyond the counter and this was weird this is like the first time I heard about this but certainly not the last guy beond the counter having opinion on me like to a total stranger and this would come to Define who I am and what I do like you know for those who know and give a **** about it entertainment and stuff if you say oh that guy you know some people go oh I love that guy and a lot of people go I **** hate that guy you know so this was the first instance of the guy Brian Quinn going this guy I went to get the book in a bookstore in a Walder books or whatever and a **** dude said oh that movie's terrible and so I said you know oh well you should go back and give the bookstore dork some **** Brian Quinn sends a recording it's cassette a week later and uh he he goes uh uh Kev Smith told me to go give the bookstore dog some **** so I went to the bookstore and this is what happened and",
      "start": 4707.2
    },
    {
      "text": "Brian Quinn sends a recording it's cassette a week later and uh he he goes uh uh Kev Smith told me to go give the bookstore dog some **** so I went to the bookstore and this is what happened and it's a **** tape recording of the dude going hey hi do you remember me he's going yeah I came in last week looking for a Mallrat's book and the guy goes uh yeah yeah I remember he was going yeah well I know Kevin Smith and I told him that you didn't like his movie and you know what he said and you're the guy go no and he goes he told me to give the bookstore dork some **** screaming at him he goes uh **** **** you what and the guy goes time to leave and he goes what are you going to do about like screaming at him and stuff recording it and it was really disturbing but at the same time very flattering so power you have over your fans to send them out to do your bidding right away I hired Brian Quinn I was like you you deserve a job and he helped us build our **** web uh sales division",
      "start": 4754.76
    },
    {
      "text": "flattering so power you have over your fans to send them out to do your bidding right away I hired Brian Quinn I was like you you deserve a job and he helped us build our **** web uh sales division like he was the first guy there was no web sales people would send in a check or money order and you know he would do the the mail order form but years later man he you know he's got this **** show now him and his buddies had this **** comedy group that they you know would do sketches together and stuff they did one for like some NBC show I forget what it was I don't know if it was the the standup comedy show but like they were involved in this competition where they won something online and whatnot and the dudes turned that they parlay ed that little bit of YouTube success into a **** television their own television show which also has its own spin-off television show where they talk about how they made the show one of those shows yeah all from sitting around hanging out with",
      "start": 4802.6
    },
    {
      "text": "television their own television show which also has its own spin-off television show where they talk about how they made the show one of those shows yeah all from sitting around hanging out with friends chasing the **** dream and stuff so you guys are doing the exact right thing man um whether another Clerks can happen or not doesn't matter it did happen and now people expect more and you know when your next well not even of me of you guys like you can't even do that you can't get away with something is like look how cute and simple and **** like user friendly this tiny little movie obviously made by an idiot is now there are lots of us out there you know now the internet is full of Kevin Smith circuit 1994 everybody far more talented than that guy as well and everybody with form to tell the story and you guys are diving into that **** pool I I salute you man that's awesome now in the middle of that it all dawned on me that I had to send Kevin to the car because I've been",
      "start": 4846.0
    },
    {
      "text": "to tell the story and you guys are diving into that **** pool I I salute you man that's awesome now in the middle of that it all dawned on me that I had to send Kevin to the car because I've been carrying with me in my bag because I haven't unpacked it a copy of Phobia now Phobia is an independent movie made by our friend Mike Ahr who came on the show to sell it and he he of course cited you and Clerks as being one of the their Inspirations because this is a movie they shot over what five years on weekends no I think it was over like 1 8 months or something like that of weekends so they had regular jobs but they kept it going for months every weekend to film and they make they've made quite a few of these movies uh and this was five years later I think after they made this they finally finished it and got it distributed and they have this amazing cover for it it is **** I mean this looks insane it's a it's got an O as they call it in the industry uh an oversleeve something",
      "start": 4895.28
    },
    {
      "text": "finished it and got it distributed and they have this amazing cover for it it is **** I mean this looks insane it's a it's got an o as they call it in the industry uh an oversleeve something completely different to me there's another industry where it's far more far far filthier to say over yes um this this looks **** Pro like as I was pulling apart I was like wow man **** had a dream about making a movie and now they can actually hold on to the movie and it looks like every other **** movie as good professionals any other **** movie you would see sitting on a shelf or **** yeah you got that that one's from Walmart I that's **** is awesome like you know and and some people like that's success like unparalleled success now arrogance ego would dictate like uh oh did it play in a theater blah blah blah don't **** matter it's he had a dream he made a movie it's founding its audience like that's what I love about um right now being able to practice art right now there's no",
      "start": 4935.04
    },
    {
      "text": "a theater blah blah blah don't **** matter it's he had a dream he made a movie it's founding its audience like that's what I love about um right now being able to practice art right now there's no like oh if it doesn't do this it doesn't count like there was a time in our business where um if if a movie went like straight to video that was like the worst **** thing the kiss of death the kiss of death and that was the thing like oh my God not what could be worse than straight to video movie and it was only because you know it had that kind of like well there this is how things work a movie comes out and then months later if not years later it comes out on video then it eventually goes to Cable then it eventually goes to television and that's all changed now now it's by any means necessary reach the audience you don't need to go through **** particular channels like this cat you know he was like **** I'm going to make a movie just like years ago with Clerks I was like I'm going",
      "start": 4987.8
    },
    {
      "text": "reach the audience you don't need to go through **** particular channels like this cat you know he was like **** I'm going to make a movie just like years ago with Clerks I was like I'm going to make a movie I got very lucky because that movie got picked up by a company that like then was like all right what do you want to do next what do you want to do next and they had resources they had just been bought right before they bought me by **** Disney so I make like the you know Rost um but not not intending like this is going to be hardcore but for that year the Rost uh looking sounding **** American independent film it winds up being a goddamn Disney movie so you know that that was not planned for I wanted to be this guy more than anything in the world who made Phobia Rory Ael this Mich ransy and Michael Ransy Rory was the director I know but I'm saying we it's in our life because of Michael Ransy right now M Ransy is so happy M ignoring his kid listening to Kevin Smith mention",
      "start": 5035.32
    },
    {
      "text": "Mich ransy and Michael Ransy Rory was the director I know but I'm saying we it's in our life because of Michael Ransy right now M Ransy is so happy M ignoring his kid listening to Kevin Smith mention who I wanted to be like I didn't think you know my I'd make a movie that like I all I had in me was Clerks and then then Dogma I knew I wanted to make Dogma and I knew I couldn't make Dogma until I made Clerks and stuff so I didn't expect Clerks to like get picked up and go into movie theaters like at most best case scenario I expected to four wall it myself which is what we later did with Red State and that too was like that was my plan and it was interrupted by **** like unexpected dumb luck success with Miramax going we're going to put the movie out and **** like like that but this is who I want it to be the dude who was just like I I I don't care how many people see it I need to hold it yeah like and I can't hold it in my head and heart anymore I got to hold it here man like the you",
      "start": 5077.72
    },
    {
      "text": "I want it to be the dude who was just like I I I don't care how many people see it I need to hold it yeah like and I can't hold it in my head and heart anymore I got to hold it here man like the you all seen Birdman of course by this point having yeah it's awesome Birdman is a wonderful movie but what it doesn't of course like the series of single takes is spellbinding film making but I don't think I've ever seen a movie that so portrays the inner voice so perfectly the inner voice that some people hear and some people don't like the uh they talk about that **** voice in that Muppet song even the Rainbow Connection where he's like have you been half asleep and have you heard voices I've heard him calling my name it's dippy little line but so **** true those of us who want to join the circus here's something that other people don't and that voice can drive you **** far you know it it will make you chase **** dreams it'll make you push Whimsy into reality and stuff like that but",
      "start": 5122.56
    },
    {
      "text": "here's something that other people don't and that voice can drive you **** far you know it it will make you chase **** dreams it'll make you push Whimsy into reality and stuff like that but it is the flip side to that voice it's a double-edged sword it is **** Relentless like you never get to a place where you're like I have achieved everything I wanted to and I am done yeah the voice doesn't let you stop and that movie I was watching that movie and it was creepy CU I was like oh my God like it's never as like his voice his inner voice was just like we're a **** god it's never quite that that was awesome it was it was tremendous but that voice was familiar to me where I'm like oh my god I've had that **** voice telling me to not stop and pushing me and that got me to where I am but it also **** keeps you from ever being satisfied in that you know in that first world **** way it keeps you going like well maybe I'll do something else maybe I'll diversify maybe I'll try",
      "start": 5169.88
    },
    {
      "text": "am but it also **** keeps you from ever being satisfied in that you know in that first world **** way it keeps you going like well maybe I'll do something else maybe I'll diversify maybe I'll try this maybe I'll try this but that that that voice is a real thing man like it's it's something that anybody that wants to stand in front of people and do something somebody who's not content to just live a normal life like my parents lived and **** like that well that's the thing exists and drove you to the point you all have it you whenever I go back to Chicago this and my friends be like oh cool like you know they're in the suburbs and they have their jobs that and their families they love and like like have you watched and they'll list off a million TV shows and I'm like no and I'm like you guys don't come home and make YouTube channels go and go do conversations and bars with your friends and film those and put those up and you know you you were talking earlier about how Clerks was",
      "start": 5219.76
    },
    {
      "text": "you guys don't come home and make YouTube channels go and go do conversations and bars with your friends and film those and put those up and you know you you were talking earlier about how Clerks was it was mostly because of you like you became the personality behind that and they pushed you out there for it it was an adorable story it was like they made that movie where that **** where he works and he still works there genus by the way kudos to that for thinking of that um that was act that was just honestly not even like um calculated because for me the backstory the best backstory in the world had been told Robert Rodriguez made a movie for $7,000 and he **** went through medical experiments to do it like and what was our story our movie cost 27575 that seemed ridiculous compared to the budget of El Mari achi and I didn't sell my body to science so I figured like the movie was actually going to have to stand there by itself I didn't have a cool clever backstory they found it the",
      "start": 5258.08
    },
    {
      "text": "the budget of El Mariachi and I didn't sell my body to science so I figured like the movie was actually going to have to stand there by itself I didn't have a cool clever backstory they found it the press found it and or created it or they started writing about it up at Sundance when Clerks got bought when they first started you know I saw this movie and I met the **** dude andah blah blah and they were like well wow this Festival could change your life it was early in the festival so nothing had happened yet but they were like you know what what are you going to do when it's over and I was like well I have to be back at Quick Stop on Monday to work and like I wasn't being ironic just like this like we had shown yeah like I was **** like we had shown the movie to every distributor who could potentially pick it up in advance of Sundance all of them passed so we were just going to Sundance there was no like we're going to get **** rich and this is before they made big deals there",
      "start": 5306.4
    },
    {
      "text": "could potentially pick it up in advance of Sundance all of them passed so we were just going to Sundance there was no like we're going to get **** rich and this is before they made big deals there and **** like that in fact our year was the first year anyone ever sold a film at the festival normally it was done before or after the festival and stuff there was none of this bidding frenzy stuff so going into it I was just like playing at the festival it's own reward and I couldn't like I never thought people would give a **** like we had no backstory if anything I thought the Press would be like $27,000 do you know **** El Mariachi only cost $7,000 and there was a car chase that's got money to burn yeah like what what's your problem where did you spend the money that's what I thought they'd say but the backstory became people going like oh he actually works in that convenience store and he's going back to work at the convenience store and that's and that's what the cool the most",
      "start": 5350.52
    },
    {
      "text": "they'd say but the backstory became people going like oh he actually works in that convenience store and he's going back to work at the convenience store and that's and that's what the cool the most powerful part of it was right it was that hey I mean I think unanimously Clerks is a very entertaining film it's hilariously written it punk rock song you know what I'm saying like like you can't judge it like like like a normal piece of music CU you're like it does something to you it's Primal and it's raw and it's by hook or by C by any means necessary and because of that you root for it I think that's absolutely correct I think also uh you know sort of part of the reason why it's so important and part of the reason why you're so influential is because you showed everyone that if you just take that first step if you take that leap and that risk that maybe just maybe good things will come and if you don't nothing's going to happen right I mean I didn't even create nothing ventured nothing",
      "start": 5391.32
    },
    {
      "text": "that first step if you take that leap and that risk that maybe just maybe good things will come and if you don't nothing's going to happen right I mean I didn't even create nothing ventured nothing game but that's exactly what it is it's like you can either I mean the Tusk was a perfect example either could have died as a fun podcast we all recorded reced and some people will argue till the end of time it should have **** but for me I was like I really want to see this **** movie it's worth it for that frame that alone just to get there but I was like I I want to see it nobody else is going to **** make this movie and that was the same way I felt about Clerks I wanted to see Clerks but nobody was ever going to make Clerks nobody was going to make a movie where people talked about Star Wars and **** and **** like that like or in hockey that particular booah Bay like if I wanted to see it I had a mind snap years ago where I was like if I don't **** if you want to see a movie",
      "start": 5431.44
    },
    {
      "text": "Wars and **** and **** like that like or in hockey that particular booah Bay like if I wanted to see it I had a mind snap years ago where I was like if I don't **** if you want to see a movie about the **** you and your friends talk about nobody's ever going to **** make that movie just make it yourself and so I was like all right and and then that kicked off my career so years later with Tusk same thing where it's like man I want to see that **** movie nobody's going to make that movie but the thing that made me want to make that movie more than anything else cuz I hadn't made a movie in like three years and **** and I was content to like just tour and podcast do TV or whatever but I'd seen reaction on Twitter and Facebook of some cats going like is that it they heard the podcast and by the end of the podcast IID talk myself into making a movie and stuff and the the uh they said like there were a few people react like this is that allowed all you you guys just talked",
      "start": 5471.36
    },
    {
      "text": "podcast and by the end of the podcast IID talk myself into making a movie and stuff and the the uh they said like there were a few people react like this is that allowed all you you guys just talked about the stupid Meme and then you said oh we could end it like Iron Man where a bigger suit comes out at the end and then you said that's a movie like does that count is that creative process and that that's what I loved like so rarely do you have a **** microphone or a camera on the moment of conception you know unless it's **** home porn but you never have that **** it's never recorded Bing that idea moment or something and so many people had heard it and they were like okay these two meaning me and Scott Mosier they work in the film industry for a few years now they're you know For Better or For Worse you got to consider them **** professionals or whatever and they just sat there and said **** wal rus and of Iron Man equals movie and they're off and running and there was some",
      "start": 5510.2
    },
    {
      "text": "or For Worse you got to consider them **** professionals or whatever and they just sat there and said **** walrus and of Iron Man equals movie and they're off and running and there was some there was one that was like like is that allowed as if there were rules and so I was like **** there's a bunch of people out there don't know how to do that one thing take that first **** step that's the thing right and that's and when you were and I'm not saying working for a corporation is bad I'm not saying put your job and go out there and no it's awesome but corporations have rules because they have to because they are organizations that have to that have to put rules forth in order to you know succeed you get in that mindset of I have in order to do this I have to get my boss to approve it he has to get his boss to appr it let's play the strategy game you forget sometimes IGN's different IGN obviously we do some really creative stuff there is a lot of that a little bit of levels there",
      "start": 5558.4
    },
    {
      "text": "he has to get his boss to appr it let's play the strategy game you forget sometimes IGN's different IGN obviously we do some really creative stuff there is a lot of that a little bit of levels there uh but you normal people do forget that they have it in them to do whatever the hell they want yeah and now is the time nobody can stop and now is the best time to do it because now there are more uh ways to distribute whatever content you're creating than ever before Reach people in different countries think about that like who who aren't **** local but still find it's no different than when I was like I want to make this movie and see how many people think like I do the internet just gives you a chance to do that like with anything instantaneously and instantaneously but some cats just don't know how to take the first step and part of making Tusk was like let me open source the movie they could see like this was the idea and let me show them like **** you can do this like you can",
      "start": 5598.08
    },
    {
      "text": "don't know how to take the first step and part of making Tusk was like let me open source the movie they could see like this was the idea and let me show them like **** you can do this like you can take a stupid idea with your friends and make it for real like and you know some cats were like well yeah of course you can because you make movies for a living but I had stopped and salted the Earth in my career and been like **** everybody I'm never coming back exactly I was like so long thanks for all the fish and then I was like wait I want more fish and so you know I had to come back into the room and **** so I felt like if I could show the cats who give a **** who listen to podcast or whatever who the people that made that statement which I was profoundly moved by because I take for granted as I think a lot of us do the self-starting ability like you're going like oh this is what I want to do and so you do it and stuff some people are like I would love to do that but I don't",
      "start": 5640.16
    },
    {
      "text": "for granted as I think a lot of us do the self-starting ability like you're going like oh this is what I want to do and so you do it and stuff some people are like I would love to do that but I don't even how do you begin how does that **** what do you do how do you write a script like they just don't know and there's an order of things or **** what's allow or blah blah blah so I was like let me just show them like this is how you do it they heard the moment of the idea the conception of the idea take it all the way through to **** them watching it on Home Video and **** and show them this is how you do it and you could take something stupid that maybe should never been made an idea of you know a guy turns another guy into a wall or some **** but with enough diligence and and and requiring a first step and then a bunch of steps after that you can accomplish and you can achieve and you know it's like whether or not PE all people love it **** man that's just scenery and",
      "start": 5680.64
    },
    {
      "text": "and requiring a first step and then a bunch of steps after that you can accomplish and you can achieve and you know it's like whether or not PE all people love it **** man that's just scenery and Greenery to some respect that's just egoo you're like you would love everyone to love your idea **** it the fact that you get to make your idea and express yourself and support Yourself by doing that you've won the game a thousand times over everything after that is just **** gravy and sometimes the gra gravy runs thick and **** runny all over the joint and you could even throw it out there so much and sometimes it's just a little dollop where you're like can I have more and they're like **** no glad you got that much and **** salt that **** and that's it but taking that first step dude that's it and some cats don't know how to do it man that's why it's important when you do what you do you're just like you say everything you do is with a family with this audience that you built",
      "start": 5724.08
    },
    {
      "text": "that's it and some cats don't know how to do it man that's why it's important when you do what you do you're just like you say everything you do is with a family with this audience that you built that's kind of a family they're all listening being entertained number one but they're also looking for the Special Sauce that you're got the secret code that allows you to be so bold to chase your **** dreams as well so you're responsible for launching a bunch of other ships it's exciting man when you do stuff like that we live in this wonderful first world where like these are our big concerns how do I express myself for a living not like how do I stay alive you know F how do I eat and stuff like that God have you have you ever stopped to actually consider how many careers you've inspired um no but no but I mean but then I always think about Richard Linklater cuz I'm like well he inspired me and **** it it's all like it trickles down right but it does it blow your mind that people are",
      "start": 5766.28
    },
    {
      "text": "no but no but I mean but then I always think about Richard Linklater cuz I'm like well he inspired me and **** it it's all like it trickles down right but it does it blow your mind that people are in film school right now and go I want to be Kevin Smith I never think about that like I always like I'm one of those people that I always lean or assume the negative that's how I've conducted most of my Affairs how I've lived my whole life and I think that's kept me somewhat grounded and not like i'every once in a while I see somebody on the online go he's pretentious with his head up his own ass I'm like you know what man I'll take a lot of **** you can call me a lot of things but like one thing I know is I'm not pretentious and I do not have my head on my ass I am always checking everything I say so I'll say something and two sentences later be like but I'm an **** so **** disregard it and **** I don't believe my opinion really counts for much and that's how I you know some",
      "start": 5806.48
    },
    {
      "text": "I say so I'll say something and two sentences later be like but I'm an **** so **** disregard it and **** I don't believe my opinion really counts for much and that's how I you know some people are irritated by that after you listen to a lot of podcasts that do they like **** dude you you say something and then you cut yourself down whatever that's how I survive in this world so because of that I never ever think like oh there's somebody out there that wants to like be me I just think they look at what I did and be like well if that **** chimp can do it why can't I and that's you know that that makes more sense to me I'll I'll you know maybe when I get close to the end of all this and **** like if I'm lucky enough to have a deathbed as opposed to like I'm in my car and I got **** struck by lightning or some s **** that's double bad luck you know what I'm saying you threw a curve to me that was going to be an accident it's a lightning strike to the car you thought a",
      "start": 5850.0
    },
    {
      "text": "**** struck by lightning or some s **** that's double bad luck you know what I'm saying you threw a curve to me that was going to be an accident it's a lightning strike to the car you thought a truck was coming dang like but if I'm lucky enough to like have a deathbed then I can maybe sit there and go like and look back at the long tail but I find it's dangerous to you know to kind of Naval gays yeah oh **** cuz if I did I'm like I say this no hint of irony I'm the world's biggest Kevin Smith fan so if I really start Fanning out on Kevin Smith and just like diving into a lot of people go like you know **** you are the big Kevin SPI all you talk about is Clerks not really I've done a bunch of things but if I really started **** like gazing at my own Naval oh I'd lose time going like **** I know who I am and I know where I came from and doing what I've done is tant him out to **** becoming an astronaut in my world it's just so **** unlikely that the dominoes fell the way",
      "start": 5889.88
    },
    {
      "text": "**** I know who I am and I know where I came from and doing what I've done is tant him out to **** becoming an astronaut in my world it's just so **** unlikely that the dominoes fell the way they would and so because of that man I I tend to always keep myself in check and I always like I never think like people want to be me I think they want to do what I do and I encourage that all the time it's particularly with the podcast cuz that's easy for years I've been telling people go make a movie but I always say the last thing under my breath which is like it's expensive podcasting is so much easier to be like go record a podcast there's no com put on your phone turn on your voice memo app and go start **** talking you're already talking just put a **** mic on it because it's all content to somebody like you know somebody out there is doing a podcast that is just about Raphael from the Ninja Turtles **** the other three it's just **** Raphael **** there's no one doing a",
      "start": 5935.32
    },
    {
      "text": "content to somebody like you know somebody out there is doing a podcast that is just about Raphael from the Ninja Turtles **** the other three it's just **** Raphael **** there's no one doing a podcast just about ra pretty sure that's Rob Paulsen's podcast talking tunes well when I recorded this episode is Raphael Colin what's your topic I guess this will be I mean this seems kind of pertinent considering some of the things we've been talking about but um because we were talking about you know Clerks and the internet age we talk about you know consuming content on the internet talk about the thing we're doing on Kinda Funny and um so I'm kind of curious you know and this could be kind of a lightning round kind of thing but just what the internet there's no such thing as a lightning room slowest lightning ever with us either that Colin usually likes to lead he's like this will be a short topic and then it's 45 minutes of us talking about whatever how long do you think today you could",
      "start": 5976.96
    },
    {
      "text": "slowest lightning ever with us either that Colin usually likes to lead he's like this will be a short topic and then it's 45 minutes of us talking about whatever how long do you think today you could go without the internet and what a great question and could you conceivably think of a life today where you would never use the internet oh Jesus that's I mean it kind of goes hand in hand with what I was saying before about being Kevin Smith professionally the Internet is just a part of that and if I'm disconnected from the internet then I'm not being Kevin Smith profession and how the **** am I earning a living and am I relevant it's nuts like there is no disengagement so I I mean if I were to step away from the internet it would be almost stepping away from the career even when I walked away from filmmaking I was I didn't walk away from the internet that in fact that was how we sold tickets to Live Events and stuff like that so yeah it would be for me to unplug would be like shutting",
      "start": 6022.6
    },
    {
      "text": "from filmmaking I was I didn't walk away from the internet that in fact that was how we sold tickets to Live Events and stuff like that so yeah it would be for me to unplug would be like shutting down the career and and me going native and like hey just going to go **** live the way people like what was that movie The Village I'm going to **** do this **** like the village live out in the forest totally and and not tell the kids that we live on an animal preserve um just like that movie but I I uh it would be difficult for me to do it professionally personally it would also be difficult because every morning I wake up and before I launch into the business of you know **** being Kevin Smith I try to do human things and I read the news all the time that's my favorite thing in the world to do when I wake up sit there smoke a joint read the news it's the only way to get through the news is to smoke a joint because it's **** it's not news unless it's **** horrifying and so it's",
      "start": 6065.52
    },
    {
      "text": "to do when I wake up sit there smoke a joint read the news it's the only way to get through the news is to smoke a joint because it's **** it's not news unless it's **** horrifying and so it's important to keep your head straight about what's going on in the world stops you from being a spoiled child is particularly in this industry it really tends to like baby person and **** and when it's tough to be like I didn't **** get what I want when you're like a school in Pakistan was invaded a bunch of kids were **** shot cuz because they wanted to get a **** education by a bunch of **** Taliban people so know it's important to **** consume that in the morning and I I guess I could do that with a newspaper and like my father used to do that in the morning you put on your suit you get on the train and you're just rocking back and forth reading totally but I I mean I I don't I think I you know I I don't it's not that I don't trust TV but TV is not nearly as fast as the",
      "start": 6108.56
    },
    {
      "text": "suit you get on the train and you're just rocking back and forth reading totally but I I mean I I don't I think I you know I I don't it's not that I don't trust TV but TV is not nearly as fast as the internet is and I could get updated information 15 minutes the story posted 15 minutes ago so um for me to step away dude I'd really it would have to be me cutting the cord and being like I'm I'm reverting to a way of life that I enjoyed or didn't enjoy uh Circa 1993 like not even let's say 1995 late 95 is when the internet entered my life and you want to talk about like it's almost like my relationship with driving from the moment I've started driving I've never stopped driving and you know if I want to get places that's how you **** do it same thing with the internet from the moment it's entered my life it has never stopped and and then it became so much a part of what I do professionally too and mean I don't have regrets but like if I can do it over or something like that I would",
      "start": 6147.72
    },
    {
      "text": "entered my life it has never stopped and and then it became so much a part of what I do professionally too and mean I don't have regrets but like if I can do it over or something like that I would be more careful about that about keeping maybe a little bit more for myself but I don't know how else to do this except like like personally and **** go flat out like the movies I don't I I you know Tusk is obviously not a personal film I tried at one point to like joke around people like you know what's this movie about I'm like well it's kind of like a metaphor for working with Bruce Willis but that was made up like it was just a joke like that wasn't true so you know for me T usk is like at a point in my career where I ran out of the personal things to talk about so I'm like either I stop doing it or I just start making **** up and I thought I started thinking about like some of my favorite filmmakers like David Lynch and David Cronenberg and they make weird art you know what I'm",
      "start": 6195.92
    },
    {
      "text": "doing it or I just start making **** up and I thought I started thinking about like some of my favorite filmmakers like David Lynch and David Cronenberg and they make weird art you know what I'm saying like happy people don't make great art you know unfortunately that's what I found personally be the case but they can make weird art and David Lynch seems very happy and David Cronenberg seems very happy the brother seem very happy making their weird art and not a one of them you ever look at their movies and go I bet that happened to them in high school you know what I'm saying it's not like David Cronenberg was like the fly this is my college girlfriend you know it's not it's it's just they made **** up and so I got to a place where I'm like maybe I could just make **** up and the internet feeds that in the case of Tusk it fed it directly like I had my audience go like yeah **** do that and you know some people who hate Tusk would argue like maybe you should unplug from the",
      "start": 6240.16
    },
    {
      "text": "internet feeds that in the case of Tusk it fed it directly like I had my audience go like yeah **** do that and you know some people who hate Tusk would argue like maybe you should unplug from the **** internet and stop making **** like Tusk but I you know I don't know any I I support anybody that supports me doing something creative now the internet most people know is very negative place where a lot of people support negativity and whatnot so when you find an oasis of positivity on the Internet it's best to spend as much time there as you can and and and get as much as you can out of it because those meals are few and far between but unplugging would be difficult for I could not do it under any circumstances I when I got the I got the new iPhone the other day and like it's that thing where I was disconnected right like we have to you know turn it on and then replug it and recover and all stuff and like that 10-minute walk to the restaurant to meet my girlfriend I was like",
      "start": 6278.76
    },
    {
      "text": "thing where I was disconnected right like we have to you know turn it on and then replug it and recover and all stuff and like that 10-minute walk to the restaurant to meet my girlfriend I was like check in my pocket and I'm like I was boring I I can't look and I'm like do I know where this restaurant is and I was like I think so but if I keep W like yeah similar thing of of course like our daily lives are the internet my job has been the internet and like I went down uh to LA well I went here to LA a couple weeks ago to shoot a show and the PA is driving me to the set and she's like so what do you do like I you know I know you're on the show I'm like oh I'm an internet personality she's like oh that's cool what does that and I explained it all she's like cool so like what's the what's the future and I'm like do this forever I guess like in space uh robots taking over uh I think a Statue of Liberty Bird in a beach if I remember correct you Mania but yeah like you know like this is",
      "start": 6318.0
    },
    {
      "text": "the future and I'm like do this forever I guess like in space uh robots taking over uh I think a Statue of Liberty Bird in a beach if I remember correct you Mania but yeah like you know like this is what it is and this is the deal I've signed up for now like that's you know but that's not is like who knows what it is right now it's the internet and that's your entree if you will but like as we've seen it leads to television it can lead to movies it could go anywhere where that you want to take it or that you want to direct it and and that's imagine what one person could do you got to **** combine forces of four plus a **** produc orial Force off camera unseen to uh to kind of manifest what it is you're trying to do whether it be like right now it's this with Kinda Funny and whether Kinda Funny branches and think about this one day maybe a year from now maybe a couple years from now however long it takes you'll be working on your first feature making a movie a collective a",
      "start": 6352.44
    },
    {
      "text": "Kinda Funny branches and think about this one day maybe a year from now maybe a couple years from now however long it takes you'll be working on your first feature making a movie a collective a something that you guys put together um under the Kinda Funny banner and you'll think about every **** movie that you've ever seen in your life and it won't be but a few moments here and there where you'll go like that's **** up we used to watch it now we're doing it but you'll be moving forward it's such a **** fast pace and hoping that nobody says hey wait and we thought better of this that you won't appreciate we just Google search Nick Scarpino he's not doing anything producer Seducer you know but but you'll be moving so fast you won't have a chance to appreciate the moment but you will you'll mark it and then later on you'll totally appreciate death right for lightning strike in the car save it for then save it for that moment yeah for me even like you you nailed it with the",
      "start": 6398.64
    },
    {
      "text": "will you'll mark it and then later on you'll totally appreciate death right for lightning strike in the car save it for then save it for that moment yeah for me even like you you nailed it with the career thing like just this is what I want to do like everything you're saying about you are Kevin Smith and that is your job that is all I want is to be Tim Gettys and that be my job and just working towards that and uh but who that is and why I want to do that even besides the career it's the internet was such an important part of my formative years and I'm at my age it's that was my life I don't know a life without the internet really and um it's I can't imagine I could not do it at all like CU even movies and TV and all that stuff they're not enough for me like I need to know what everyone else thinks about it instantly I need to be part of that conversation I need to know I need to know every single thing going into it reading about it being part of the hype like to me that's almost",
      "start": 6440.68
    },
    {
      "text": "else thinks about it instantly I need to be part of that conversation I need to know I need to know every single thing going into it reading about it being part of the hype like to me that's almost more important than the actual movie and that's I can't exactly I I love that it's that's kind of that I myself understand that my wife doesn't understand that um like why do you talking about it and like yes and here's something that like a couple years ago I was like ah **** uh **** critics and stuff um I you know and then recently I was like you know I don't feel that way anymore and then there were a bunch of cynical **** like you don't feel that way cuz you got a movie coming out that's **** this is why I don't feel that way because after every every episode of Mad Men I've I've discovered this slowly over the course of like two seasons watching the show the next day I would get up and as I smoked I'm reading Google news I would go to slate uh.com and I think it's slate or",
      "start": 6482.36
    },
    {
      "text": "discovered this slowly over the course of like two seasons watching the show the next day I would get up and as I smoked I'm reading Google news I would go to slate uh.com and I think it's slate or slant no what was the other one slate and then **** I think it's slate they got two writers or three even that just sit there and talk about their opinion of the show and I would gravitate toward these because I realize I'm not smart enough to process Mad Men my wife's very good at it too I'll turn to her afterwards be like what the **** happened and she'll explain I'll be like wow that's **** like I learned early on she's a wonderful resource like that we watched Mulholland Drive and I was like the **** happened and she explained but she explained she crystallized it where I was like holy **** man like are you **** David Lynch on the side how do you know that and she she's good at that she's really good she'be an excellent story editor man she understands she can call ****",
      "start": 6522.92
    },
    {
      "text": "holy **** man like are you **** David Lynch on the side how do you know that and she she's good at that she's really good she'be an excellent story editor man she understands she can call **** watching TV like this is going to happen blah blah blah so **** I got a hit a pothole what was I on again um oh so I'm looking at thank you you **** list right there man that was awesome um so I've I've after like I don't know weeks and weeks of **** reading other people's thoughts on Mad Men I was like oh this is like what film criticism is for other people as the filmmaker it's difficult because so much the conversation is about your work and of course you want everybody to like what you do and **** and and there's a lot of blood in the water and **** like film criticism isn't really film criticism some of it's real like just **** stab it till it's dead and it's fun to make fun here's the funny double on Tandra I make it exactly and and I get it **** like that's that's the",
      "start": 6575.36
    },
    {
      "text": "film criticism some of it's real like just **** stab it till it's dead and it's fun to make fun here's the funny double on Tandra I make it exactly and and I get it **** like that's that's the way the game's played now is totally fine but you know it was um I I don't know for me it I forgot what I was saying oh the critical thing everybody talking together I I sat there going oh I get it like this is important to me in some weird **** way I have to know what these utter strangers and then the people in the comments thread if they all agree that this show we watch it goes back to that Community thing we're talking about and that's one of the things we were so excited about when you know leaving and now going to do on Kinda Funny and Kinda Funny Games these products where we we were very clear at the front like we aren't reviewing things yeah we're not see that's the problem I think you have with with critics is that there's a difference between a Critic and someone who's just",
      "start": 6622.08
    },
    {
      "text": "very clear at the front like we aren't reviewing things yeah we're not see that's the problem I think you have with with critics is that there's a difference between a Critic and someone who's just an Enthusiast or someone who's just really likes something and wants to evangelize it a little bit right and that's I think you probably cuz you're a pretty positive guy gravitate a little bit more toward the guys that aren't like five out of five or two out of five it's like that's it's about like I love Jay Hoberman in in the Village Voice there was a a guy named Jay Hoberman who uh I didn't know for years whether it was guy or woman before I made a flick ever um he was a guy that wrote the review of Slacker that made me want to go see Slacker and when you read a Jay Hobman review in the Village Voice you had no idea whether he liked the movie or not it was almost a **** just an essay about the movie it wasn't an essay of like I walked in and bought popcorn it was about the movie itself",
      "start": 6663.72
    },
    {
      "text": "Voice you had no idea whether he liked the movie or not it was almost a **** just an essay about the movie it wasn't an essay of like I walked in and bought popcorn it was about the movie itself but it wasn't like thumbs up thumbs down Stars nothing like that it was just a really interesting insight into the **** movie that would then make you want to go see the movie they don't really do that so much anymore some places still do but it's much easier you know and it's clickbait to you know **** have a headline that's like this movie sucks your mother's **** or something like that and you're like holy **** I want to read this **** interview who knew she's so **** hung so you know it's it it's but I get it like I'm not like I certainly am not trying to be like Bill Murray at the end of Scrooge where I'm like I get it now I'm ready but I understand like after reading all those articles and just because I'm like I got to know am I am I alone or did they get something like",
      "start": 6700.0
    },
    {
      "text": "the end of Scrooge where I'm like I get it now I'm ready but I understand like after reading all those articles and just because I'm like I got to know am I am I alone or did they get something like that's what it's all about it's Community it's about finding a tribe it's about the same reason that I like **** made Clerks like let me see if anybody else understands yeah same **** thing here **** writing about a TV show in depth one episode and and then in I think in Slate it's like three people write three separate pieces and all comment on each other's but that's them throwing a message out there like that's the exact same thing that I do it's just the other side of the playing field so to speak I think that's so important too like when when you go to a movie theater like the the instant you leave that theater you're just talking about the movie you're talking about what we just saw how you feel part that's the best part and no matter how bad the movie was you might just say oh",
      "start": 6741.44
    },
    {
      "text": "you leave that theater you're just talking about the movie you're talking about what we just saw how you feel part that's the best part and no matter how bad the movie was you might just say oh I hate it I hate it but here's why I hate it and that's like you get an actual thoughts put into that and all that and I feel like a lot of what we're doing what we want to do is have that movie conversation but about video games about comics about um TV shows and all that stuff to to give the the community and the people that Avenue to have that conversation whenever they want man my wife likes seeing movies by herself and I can't fathom it I cannot fathom walking out of a movie theater and not being able to turn to a good friend of mine and say what did you think or like wasn't that the coolest thing you've ever seen or the biggest piece of **** or whatever you know that's just to me part of the process it doesn't stop when the credits start rolling dude there's a whole industry um of",
      "start": 6786.16
    },
    {
      "text": "thing you've ever seen or the biggest piece of **** or whatever you know that's just to me part of the process it doesn't stop when the credits start rolling dude there's a whole industry um of people that sit around and talk about sporting events while it's going on after it's over in advance of it happening there's a whole industry where people are like I'm putting together my own version of the draft like and this is my happy place in life and **** like that Sports when I was growing up was treated so seriously like almost that as as if it was real as if it was important like being a doctor or you know **** somebody saving life somewhere like this is a real credible **** profession **** and it absolutely is a credible profession and whatnot but it was treated like religion and and and a very realistic thing whereas movies were like oh yeah I go to the movies on the weekends and **** now we live in an age where like movies and pop culture comic books are on equal level",
      "start": 6827.56
    },
    {
      "text": "and and a very realistic thing whereas movies were like oh yeah I go to the movies on the weekends and **** now we live in an age where like movies and pop culture comic books are on equal level with sporting events like you know when I I Colin equal level very much so gol well I mean hockey **** it's you know I look I nobody loves hockey more than me but yeah you're you're a weird company to complain about my passion for hockey um it's hockey has that you know they don't have the numbers of baseball and **** football but they they are all heart like one of the last great sporting organizations that is all heart like even though salaries are you know still kind of up there and whatnot uh and but not nearly as aggregate as they are with other sports you still see that they do it because there's love for the game it's not just cynical like this is our business and blah blah blah it's it's still something that's I don't know pure the fact there's still goons there the fact there's",
      "start": 6872.56
    },
    {
      "text": "there's love for the game it's not just cynical like this is our business and blah blah blah it's it's still something that's I don't know pure the fact there's still goons there the fact there's still goons means a bit a lot yeah I don't know how else to describe it like heart is still in that game and I'm certainly not saying baseball has no heart football has no heart whatever they that look it's very difficult those games particularly **** football and **** that looks Hy as **** but um there's something about hockey which looks **** way more hurty than any of those sports that is so goddamn pure even though it's a business and **** and it's there's still something at the heart of it that is heart not just a **** game that dog loves you man yeah you know fell asleep on your lap I I'm used oh every time we do a podcast my witer dog's in my lap so I'm totally she senses it she's just like this is my bit but it's weird we live in a wonderful age where like you can",
      "start": 6920.72
    },
    {
      "text": "on your lap I I'm used oh every time we do a podcast my witer dog's in my lap so I'm totally she senses it she's just like this is my bit but it's weird we live in a wonderful age where like you can celebrate movies with chatter as much as they celebrate Sports it's just as valid Sports people used to look down on Sports enthusiasts look used to look down on **** movie enthusiasts but now we have just as much credibility in just as much Lobby and you can go just as far out of having a conversation about some **** thing you just watched then you can **** talking about a sporting event that you just watched man people make a living Chris Hardwick makes a living out of **** talking about a show we all just watched yeah you know it's like that's where we are now it's all the same Circle what we've been talking about in the show in being part of that community and why M rats worked for me right because nobody was talking to me about that I was the comic nerd of my group of friends",
      "start": 6963.72
    },
    {
      "text": "what we've been talking about in the show in being part of that community and why Mallrats worked for me right because nobody was talking to me about that I was the comic nerd of my group of friends which was isolating and you know what I mean when the internet came around I was in those **** AOL chat rooms and message boards and like you know I mean like let's talk about it let's **** talk about this new issue of Superboy or Young Justice or whatever I want to have a conversation and now you know you mentioned a second ago like the there's a lot of negativity on the internet right and we've done on this show before a topic of like would the world be better without the internet or all these different things and like I stick with it that like even though the negativity is what we put out a lot of times or people put out the positivity of being able to sit there and just hashtag anything you **** care about and you will find people talking about it and be able to get part of that",
      "start": 7004.08
    },
    {
      "text": "a lot of times or people put out the positivity of being able to sit there and just hashtag anything you **** care about and you will find people talking about it and be able to get part of that community and not feel so alone that's what's awesome pump your passions and and kind of uh stand there going this is what I love this is who I am in terms of the negativity you know look the anonymity affords people that kind of negativity and I don't like you know I'm I'm no expert and they'll maybe study it down the road but feels even internet shitty **** people on the internet man feels like a **** valve of some sorts where I'm I'm glad that exists for them to go and be like **** life and **** you I tweeted an Instagram to a shot of some dude's Twitter stream today where it was like some **** like Hat **** **** Kevin Smith and then right after it was like you know down with racism we need more peace and oh man this is like this is week ago another the hour about this my",
      "start": 7039.24
    },
    {
      "text": "some **** like Hat **** **** Kevin Smith and then right after it was like you know down with racism we need more peace and oh man this is like this is week ago another the hour about this my favorite is when somebody tweet me hey you're a fat **** and I hate you and then you go click through the profile it's a picture of them and their kid and it's like Bible verse whatever whatever it's like come on you don't see this the hypocrisy in this but you need that you need that that's where they blow off their Steam for whatever reason it made that motherfucker's day to be able to be like I'm going to say this and he might **** hear it I'm going to get this off my chest and he's not better than me whatever the **** maybe it's good that that exists maybe other wise we might have a world full of people on top of bell tow it feels like whenever I respond to somebody who hates me and he like well hey that's they like oh I'm so sorry I having such a bad T they immed back down I wish",
      "start": 7090.8
    },
    {
      "text": "full of people on top of bell tow it feels like whenever I respond to somebody who hates me and he like well hey that's they like oh I'm so sorry I having such a bad day they immediately back down I wish that was always the case some people are just like no **** you straight to hell like all right all right fair enough here talk to you later on that but I'll take it man like I'll take the negativity cuz like it's up to you to turn out the positivity like you know if you see an ocean of negativity out there yeah maybe you're **** spitting at that ocean at wave that's coming at you but go the other way you know and be the change and also try to be funny in the process like **** attack me and I'm trying to we Kinda Funny see what we did there Kevin absolutely well done well branded Kevin thank you so much for joining us for this episode see I won't end it I'll just keep well we're still doing another one right where we were rolling into one of your shows correct I just assume that this",
      "start": 7130.08
    },
    {
      "text": "you so much for joining us for this episode see I won't end it I'll just keep well we're still doing another one right where we were rolling into one of your shows correct I just assume that this is we'll split this one in two oh we're going to split in two all right cool you put your bumper on the front of it then you let people know where to go for do you guys have to go any place or no no we're **** so we can just keep rolling yeah sure oh so we're splitting it here I we could let's use this as a split Point perfect ladies and gentlemen we're about to move into one of Kevin Smith's podcast which one are we doing we'll do uh let me see with you you guys branching off and and let's do SModcast we're going to do SModcast so you can go find that obviously on the Kevin Smith podcast Network they're all over the place you get them on the iTunes get them on the website follow you on Twitter the Instagram you Instagram go on Instagram you don't get Podcast there but you'll see pretty",
      "start": 7173.12
    },
    {
      "text": "they're all over the place you get them on the iTunes get them on the website follow you on Twitter the Instagram you Instagram go on Instagram you don't get Podcast there but you'll see pretty pictures yes and then sooner if you somewhere they'll lead you to me in the podcast as no that's too easy you got to give far more uh for us ladies and gentlemen you know this is The GameOverGreggy Show each and every week four sometimes five best friends gather on this table each bring a random topic of discussion for your amusement if you like that you can get all the shows early over on patreon.com/kindafun ny or if you don't have the money or don't think we're worth it we totally understand you can go to youtube.com/kindafunny get the topics broken out one by one day by day and remember we just quit our jobs and really need your support so go to the new channel youtube.com/kindafunnygames support us there subscribe there watch all the new content we have a cool Twitch stream we're",
      "start": 7206.36
    },
    {
      "text": "just quit our jobs and really need your support so go to the new channel youtube.com/kindafunnygames support us there subscribe there watch all the new content we have a cool Twitch stream we're doing a million things until next time it's been a pleasure to serve [Music] you",
      "start": 7243.0
    }
  ]
}
