{
    "id": 500,
    "video_id": "1SMju1EG4cM",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Colin and Greg Play Mega Man 2 - Teaching Tuesdays",
    "description": "Colin Moriarty tries to teach Greg Miller how to play Mega Man 2.\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation\nGreg - http://www.twitter.com/GameOverGreggy",
    "published_at": 1420574403,
    "duration": 556,
    "transcript_chunks": [
        {
            "text": "Greetings and salutations . My name is Colin Moriarty this is the illustrious Greg Miller. Hi. And I'm gonna do something really special with Greg today. And I'm gonna do something special with Tim and I'm gonna do something with Nick and maybe even with Portillo too. I'm gonna teach them how to play Mega Man, specifically Mega Man II and we're gonna beat the game together over the next few weeks, maybe a couple months. It might take you a couple years. Why are you talking like your Hulk Hogan impression? What am I doing, that's my Hulk Hogan, so I'm gonna pull that out from time to time. Now, Greg, we're selecting, there's six Mega Man games on NES. They're all awesome games. We're selecting II for a few reasons. II is the most popular, beloved Mega Man game. Okay. It's the first one that started the real craze. A lot of people didn't care about Mega Man'til Mega Man II came out. Sure. And it's the easiest one. Oh, good.",
            "start": 0.07
        },
        {
            "text": "It's the first one that started the real craze. A lot of people didn't care about Mega Man'til Mega Man II came out. Sure. And it's the easiest one. Oh, good. So I think, so I think that it'll be the, the most, it's by far the easiest Mega Man. It, it scares me, cuz it says Difficult right below. So Nor so, so Normal and Difficult. Uh-huh. Are basically, Normal is easy, and Difficult is the normal game. Oh, okay. So, I'll let you select, what do you, how do you wanna play? Well, I wanna do Normal. I've never. I don't play Mega Man. I, I grew up with the Sega Master System. I didn't know the Mega Mans. Okay. I didn't, I, I used to see him on TV game shows and think he was cool. Oh, okay. So now, I'm gonna play the whole game. Yup. So you're gonna, well, you're gonna, I'm gonna, you'll do a stage, Tim will do",
            "start": 31.84
        },
        {
            "text": "think he was cool. Oh, okay. So now, I'm gonna play the whole game. Yup. So you're gonna, well, you're gonna, I'm gonna, you'll do a stage, Tim will do a stage, and Nick will do a stage. We'll slowly whittle it down. Now, here are the rules. We're doing these every week. I'm this week. Here are the rules. Yeah. If you go through your conti, your, your whole continue, so you, all your lives. Sure. You know, three lives or whatever. Uh-huh. Then I'll beat the stage for you and we'll move on and I'll show you how to do it. Okay. Hopefully we'll be able to progress you to a point where you beat, you know, one of these robot masters. Yeah, yeah, yeah. Move on to the next one. Now here we are on the stage selection. I'm gonna give you the controller. And I just pick whoever? Yeah but. Tell me who you're going to pick because it's unrealistic that you're, you're not going to be able to beat some",
            "start": 58.86
        },
        {
            "text": "it's unrealistic that you're, you're not going to be able to beat some of these guys, so, tell me who you want, what direction you want to go. And some of their stages are way harder than others. I was going to go for Bubble Man. Bubble Man is a legit place to start, I'm going to allow it. That's okay? I'm going to allow it. And then one or two? start. So plus. Okay, and then how do I do things? Alright, so, I'm gonna, I'm gonna show you it's safe in the beginning here. Okay. So give me the control, I'm gonna show you a little something, alright. Yeah. We're totally safe right here. You sure? Yeah. It looks like that iceberg's gonna break. No, you, you know, you move around. Yeah. Left and right. I got it, easy, easy. Okay, jump is, or, or A. Okay. And then B is shoot. Shoot. Okay. That's it. Okay. Okay . Yeah. Now, Greg, remember the first. I, I played until I run out of",
            "start": 90.11
        },
        {
            "text": "Yeah. Now, Greg, remember the first. I, I played until I run out of continues or I beat the game. Yeah, you play, you play until you run out of continues or you beat the game. Now Greg, remember the first rule of-Oh, Doctor! Remember the first rule-Oh, Doctor! Remember the first rule of Mega Man. Can I pick these up? Everything, you can. It's, it's energy. You don't need it. Okay. Everything's fucked up. That's rule number one of Mega Man, everything's fucked up. So if it looks easy, or something looks a little too suspicious, a little too quiet. Yeah. Well, that's just a coincidence right there. That's because Doctor Kwait made me, right? You're looking good, so far. You're looking all right. Might want to pick one of those up. I wasn't expecting, All right, now, wait, wait, before you jump no, go, go to right. Well, I was picking up this energy",
            "start": 128.41
        },
        {
            "text": "jump no, go, go to right. Well, I was picking up this energy. Well, you don't need it, though. But I like it. Now don't jump things, okay? These are going to fall the second you touch them. Yeah, I see it. So you should jump to the right. Oh, dear. Oh, dear. Okay, well, it's good to know, that's good feedback. You made me think too hard about it. Hold on, I'll get you here. Now the frogmen are back? Yeah, everyone'll be back. That's annoying. How do I know how many lives I have left? Press Start. I don't have time right now, man! You got the baby frogs! God! We're gonna have to work on that, because you're gonna have to go to your weapons at some point in the game. God damn, son, these frogmen! Get out, he's back! You scrolled off. What the hell, froggy? You scrolled off the screen. You should know better, Mike. I'm disappointed in you. How is he getting through? It's a one in a million shot for a frogman",
            "start": 160.75
        },
        {
            "text": "What the hell, froggy? You scrolled off the screen. You should know better, Mike. I'm disappointed in you. How is he getting through? It's a one in a million shot for a frogman to make. Now, is there any way, can I lay on the ground and fire into these fucks? No, you can't duck. That's annoying. Mega Man doesn't duck. Will he be, he. You're missing rule number two of Mega Man, which is keep going. God fucking dammit. You're going to keep screwing yourself if you keep playing like this. God dammit. Well there's fucking frog dude. Just jump, you have to use your invisibility. Jump, get out of there. I want this guy dead. Now can I? Yeah, get it. Is the frog man going to come back? Oh, this is already frustrating the hell out of me. Yeah. Oh. Oh. See, no fear on that frogman. The, the key is, I mean you don't always want to keep moving but like the best way to avoid.",
            "start": 191.46
        },
        {
            "text": "hell out of me. Yeah. Oh. Oh. See, no fear on that frogman. The, the key is, I mean you don't always want to keep moving but like the best way to avoid. That's for weapons. Oh my God. This isn't going to well, you have one life left. You sure? Yeah, I'm positive. Okay, start. It should say Men zero so, so press start. Go up to next, press start. Go up to next and press Start. Like that? Look at, oh, look how cute he looks? Then how'd I get out of it before? And then go down to P, which is your weapon. Yeah. And press Start. That's fucking stupid. It'll become like second nature eventually. Oh, I killed one of the frogs in the air! So we've seen about, or 3% of the stage so far, I'm not too confident in your abilities right now, but I think we're going to be okay eventually. You were standing too close to the edge, I",
            "start": 224.65
        },
        {
            "text": "so far, I'm not too confident in your abilities right now, but I think we're going to be okay eventually. You were standing too close to the edge, I knew that was going to happen. You're out Greg . Do you want to give it 1 more go? No, that wasn't in the rules and the rules are that I get to go until I run out of lives and I ran out of lives. Now you're gonna show me how to be a man. Now, hm, it just, it's punishing, it's punishingly difficult. You, huh, yeah, see those frogs are no joke man. You like to think they're funny. It doesn't matter like, people are so obsessed with not getting hit, it doesn't like, like if you're playing a flawless run that's different But, it, like, getting hit doesn't really matter. Your invisible and you can use it to your advantage. Gotcha, gotcha. So I just That was the tough part right there. That, that;s I think where 90% of the gamers turn it off. You can actually glitch the game down",
            "start": 270.3
        },
        {
            "text": "advantage. Gotcha, gotcha. So I just That was the tough part right there. That, that;s I think where 90% of the gamers turn it off. You can actually glitch the game down here, but Im not going to do it I want to show people the, Well, how would you glitch it? You would press, I'll show you the part. You can press start, so when you press start Mega Man. Appears like that, right? Yeah. So he's coming from the top of the screen to the bottom of the screen. Right . If you go over here and then come, like, I'll show you in the bottom. If you just keep pressing start he keeps re-appearing and centering himself. Mm. And you can, you can land all the way in there and then it just shoots to the end of the stage. Oh, damn. I wish I wouldn't have known that. When I get there on my 30th lets play Mega Man. I'm sure I'll be really good at it and be",
            "start": 308.44
        },
        {
            "text": "it just shoots to the end of the stage. Oh, damn. I wish I wouldn't have known that. When I get there on my 30th lets play Mega Man. I'm sure I'll be really good at it and be able to, look at this fucking guy. Close your mouth, bro. So here I'm under water and I can actually jump really high but this is like why it's very dangerous. Metroids, Metroids are coming in. You have to jump. Yup, they look like Metroids though actually. So we're moving, we're going. Why do you love Mega Man so much? Because it's awesome. It's the perfect, it's the perfect mixture of design, of gameplay, of just beautiful graphics and, it's just, it's a perfect game. Now Mega Man II is not my favorite. Well, why do you think it's so hard to pick up for players? Just like myself. I don't know. I actually think that it's, we were actually talking about this before. I actually think it's difficulty's actually still what overrated. Yeah.",
            "start": 342.97
        },
        {
            "text": "I don't know. I actually think that it's, we were actually talking about this before. I actually think it's difficulty's actually still what overrated . Yeah. I think that like it's, it's. I think cas-like, a game like Castle Mania or especially Castle Mania 3 is legit hard. That's a hard game. Right. Like, I think that Mega Man is hard for people because they, they don't have the patience to learn how to play it. Mm, mm, mm, mm, mm. You know, so like once you learn how to play it it's all about. It's all about play. All the Mega Man games play the same. That's what I can pick up, you know Mega Man 9 or 10 when they came out, and beat them easily. You just have to play them like a Mega Man game. Yah, yah. It's not going to obviously as easy as II is to beat. So you think, what is, so what is the key thing? You keep moving and don't worry about getting hit? Yah, so like, like I said rule number 1",
            "start": 385.56
        },
        {
            "text": "key thing? You keep moving and don't worry about getting hit? Yah, so like, like I said rule number 1 is everything is fucked up. Cause I stopped there and I tried to fight all those frogs and I killed them. Right, exactly you gotta keep moving, like use the invisibility to. To your, when you get hit to your advantage. Like, like here this is really hard for people because you have to patient. You have to like, draw these guys out. Oh, they're not just falling from the sky ? They, like, yeah. You have to, there's a, there's a cadence to it. Though they're, they'll only gonna knock you in the pit, basically. Got you, got you, got you. So we're at Bubble Man now. Now Bubble Man's weak actually to Metal Man's weapon, but we don't have that and we don't really need it easy. Okay. The, though, the difficult thing about Bubble Man is that there's spikes at the top of the. Level that will kill you in one hit, so",
            "start": 414.83
        },
        {
            "text": "need it easy. Okay. The, though, the difficult thing about Bubble Man is that there's spikes at the top of the. Level that will kill you in one hit, so you just have to, So the jump is so high. Right, exactly. He shoots these bubbles out and then his little harpoons and then he'll just come down and just like that over and over again. He's really easy. I'm, okay. So, you shoot a lot of bullets. That seems like a good tip, too. Yeah, and a lot of them will go through him, actually, but yeah, you'll wanna. Shoot more. You can only have the stage at the time. That's it? That's it. That's Bubble Man. Oh that didn't seem so hard. So we'll get the Bubble Lead which is his weapon. It's useful against Heat Man, but we don't want to go to Heat Man stage yet because we don't have a specific weapon, or sub-weapon basically that we're gonna need for. You need the cold gun?",
            "start": 442.02
        },
        {
            "text": "want to go to Heat Man stage yet because we don't have a specific weapon, or sub-weapon basically that we're gonna need for. You need the cold gun? Mr. Freeze's cold gun? You're gonna need Mr. Freeze's cold gun. Mm-hm. There he is. So this was always the annoying thing, by the way, with Mega Man II is speed running it, especially if you, Yeah. If you wanna watch a speed run, is that you can't skip this stuff. And when you get certain items, it, this will go on for 30 seconds, and you're just desperate for it to be over. Okay. So, that. Is Mega Man, that was Bubbleman, you did alright. Yeah. And by alright, I mean it was pretty bad. I did really bad, I didn't, I couldn't get past the Frogman, well, I got past the Frogman a couple times. And then, the jumping on the platforms, the platforms, the way they disappeared was throwing me for a loop, Why? and I don't even know why. Cuz I think about, I play Mario, I loved",
            "start": 473.67
        },
        {
            "text": "the platforms, the way they disappeared was throwing me for a loop, Why? and I don't even know why. Cuz I think about, I play Mario, I loved the Mario games. Mm-hm. Super Mario World. Yeah. Mario Brothers, those I'm alright with. I mean, those are way easier. And then I think Mario, or, Mega Man, but Mario is difficult in its own way. Yeah. It just , they're different games, you know? So, we'll be back. Yeah. This stage will be, this stage will actually be a little clearer the next time we meet, and we'll hopefully be able to jump in and I want to see what you have and we'll hopefully, you know , maybe you'll get through one or two of these stages before you get to Wiley's castle and then it really gets, it gets. Well, thank you, Colin. Thank you, Greg. I appreciate your, I appreciate your time. And of course, you can find us on Kinda Funny, KindaFunnyGames, go to kindafunny.com for more information. You can follow me on Twitter, @NoTaxation",
            "start": 505.37
        },
        {
            "text": "I appreciate your, I appreciate your time. And of course, you can find us on Kinda Funny, KindaFunnyGames, go to kindafunny.com for more information. You can follow me on Twitter, @NoTaxation, Greg, @GameOverGreggy, and Kinda Funny, @KindaFunnyVids.'Til next time, we'll see ya.",
            "start": 536.37
        }
    ]
}