{
  "id": 524,
  "video_id": "apLgPIMfDG4",
  "show_name": "A Conversation With Colin",
  "hosts": ["Greg Miller", "Colin Moriarty"],
  "title": "What Happened to Nintendo? - A Conversation with Colin",
  "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\nThanks to our location, Tempest Bar in SF: https://www.facebook.com/TempestBar\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nThe final season of A Conversation With Colin begins!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic By Tonedeff: http://www.twitter.com/Tonedeff",
  "published_at": 1421254808,
  "duration": 830,
  "transcript_chunks": [
    {
      "text": "Yeah , I want, I want what we used to get out of Nintendo, which was an ecosystem that made you want to stay in it. Yeah, not like just dip your toe in it and then run away screaming because it's so terrible. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff, so thanks for your support over on patreon.com/kindafunny. We're back for one final season where I reach into my random topic pile, pull one out, throw it at him, and then we talk it out. Mad, I got a lot of pent up anger, a lot of pent up throws in me. If you like that, like the video, subscribe to us here on YouTube, share us with your friends, support us on patreon.com/kindafunny. Colin, are you ready? Yes. Today's topic of conversation is Nintendo, submitted by Reggie NOA, Nintendo, Nintendo. Where do you want to start with this giant topic of Nintendo? I know this could be a whole season of Conversation With. Let's start in the very beginning. You were a Nintendo kid.",
      "start": 0.72
    },
    {
      "text": "Nintendo, Nintendo, where do you want to start with this giant topic of Nintendo? I know this could be a whole season of Conversation With. Let's start in the very beginning. You were a Nintendo kid growing up. Oh, absolutely. Okay, why? Uh, well, I mean, I, you know, that's why I, that's why I started playing video games was because of Nintendo and enjoyed, uh, my NES very much and that's just what we had. So it wasn't like an active choice. I was too young to make a choice like that. But then as you know, that the NES era wore on and the SNES came out and that was what I was, I was a Nintendo person and I looked at Sega and I looked at Genesis and well, I'm like, man, I just, an abysmal piece of ****. But, but Genesis was a joke and, uh, Genesis wasn't a joke. It was, it was, it was a huge joke. Come on now. Come on now. You a Sega kid, don't go there. Genesis is the one like bright light here to handle your feelings with, with kid gloves, Greg. It's like Genesis was this, this secondary machine, this machine that had",
      "start": 48.96
    },
    {
      "text": "now you a Sega kid, don't go there. Genesis is the one like bright light here to handle your feelings with, with kid gloves, Greg. It's like Genesis was this, this secondary machine, this machine that had some good games on it, but Super Nintendo just trounced it. There's, there's been really few examples. That's a good definition, that's not a joke. That's a good definition of the Genesis. It's, it, it was, it was a pretty, it was a pretty subpar console compared to its competition. I'm sorry to, I'm sorry to tell you . Okay. Um, but as time has gone on, Nintendo has become this company that has done nothing but disappoint me, right? Um, and I was thinking about Smash Bros that just came out on Wii U. It's a great game. It's a lot of fun, really, really great game. We love playing it, but it's very indicative of what Nintendo is. It's a fighting game based on a fighting game that came out on the N64 with characters none of which are really, you know, new except for maybe that guy from Xeno Blade. Yeah, and it's played with",
      "start": 91.6
    },
    {
      "text": "is it's a fighting game based on a fighting game that came out on the N64 with characters none of which are really, you know, new except for maybe that guy from Xeno Blade. Yeah, and it's played with GameCube controllers. So it's played with controllers that are from not the last console , but two consoles ago. And basically that's everything you need to know about Nintendo right now. Yeah, what I mean is it just that they lost their way at Wii? Like, and here's my main thing too, I talk about all the time with Nintendo is that I think right now they are what they've always been. This is very much like Denny Green talking about the Chicago Bears, we are who they thought they were. You know what I mean? Like this is a toy company. They're making toys for the people who like their toys and everybody's like, well, why don't you support third parties? Why don't you try to compete? And they're like, we don't give a **** about that. What makes money for us is Smash is Mario is Zelda, that's what we'll put out.",
      "start": 132.04
    },
    {
      "text": "well, why don't you support third parties? Why don't you try to compete? And they're like, we don't give a **** about that. What makes money for us is Smash is Mario is Zelda, that's what we'll put out. That's what the system we're building. But they, they did give a **** about that and back in the day and that's why the console is that where, you know, NES third party support was so strong that they had to limit publishers to publish going five games a year. And like what a, what a lot of people don't realize is that shell companies like Ultra came up. Ultra is the one that published Metal Gear. Yeah, for instance, because it was a Konami, it was, but it was a shell of a Konami and that was so Konami can release more games because people were so eager to work with Nintendo. Now the, the, um, the formula behind working with Nintendo was difficult. You had to buy cartridges from them. They made a ton of money. You didn't get a huge cut. There was a whole huge quality control thing which was, you know, a relic",
      "start": 172.16
    },
    {
      "text": "working with Nintendo was difficult. You had to buy cartridges from them. They made a ton of money. You didn't get a huge cut. There was a whole huge quality control thing which was, you know, a relic of trying to fix what happened with Atari, which was, you know, a lack of quality. Um, and SNES had extraordinary third party sport, um, both exclusives and, and, you know, obviously , but that's how far you have to look back. Then you jump to N64 and it all goes to hell because that it was with N64 that they started making really weird decisions and the weird decisions just never stopped, you know, and that's kind of, that's kind of where they are right now. Now the N64 was a great console. That was my secondary console. I mean, I was a PlayStation guy at that point. I had my N64 for the Zelda games, you know, I loved weird games like Hybrid Heaven, the wrestling games played, I didn't play the wrestling games , but what, you know, you know, the Mario sports games and all these, you Mario Party and there was a lot of",
      "start": 208.08
    },
    {
      "text": "weird games like Hybrid Heaven, the wrestling games played, I didn't play the wrestling games, but what, you know, you know, the Mario sports games and all these , you Mario Party and there was a lot of great games on it. But, but, um, I even like Castlevania 64, which a lot of people pan, but this is when they started making weird decisions. They wanted cartridges, which made, which developers didn't want to make games for. That made the games more expensive. They were harder to develop. They couldn't hold anything compared to like a CD would hold and you would had have one cartridge. I mean, think about Final Fantasy VII, which was over multiple CDs, discs, you know, the black bottom PlayStation discs and none of that would have fit , like the first 10 minutes would have fit on an N64 cartridge. You know, why would a developer in the'90s, in the mid'90s want to make anything for that console? No load times. Um, yeah, that was the big thing. There's no load times. Well, there's nothing to load. So that was also a big",
      "start": 246.2
    },
    {
      "text": "a developer in the'90s, in the mid'90s want to make anything for that console? No load times. Um, yeah, that was the big thing. There's no load times. Well, there's nothing to load. So that was also a big thing of why, of why, you know, that was it. But then with GameCube, they kept making strange decisions like now we're going to have little CDs. Yeah, here's a handle on it. And it's like, why, why not make, make a DVD player like or do it's like it's so weird, you know, and now granted the GameCube controller and I've said this before is my favorite controller of all time. I love that controller. Um, and again, that's only because you're playing Nintendo games on it, I think, right? Well, well, this was a time when dual analog sticks were a thing, obviously. I mean, there was a dual analog stick even on, on PlayStation, you know, uh, Metal Gear and all a lot of these games, Ape Escape, like you, you know, yeah, you had to use the dual shock, but, um, we weren't playing games quite the way we were today where you were constantly manipulating",
      "start": 282.36
    },
    {
      "text": "gear and all a lot of these games, Ape Escape, like you, you know, yeah, you had to use the dual shock, but, um, we weren't playing games quite the way we were today where you were constantly manipulating the camera and everything. We were playing so like the C wasn't really a big deal. Now that obviously that controller wouldn't have worked today. Yeah. Um, so that was a weird console . Now I actually adored the GameCube, like I liked N64, but I actually adored the GameCube, like I, I had a ton of GameCube games and really, really liked playing it. But you had a lot of great Nintendo exclusive GameCube games. Yeah, there, there were and there were third party games on it like Resident Evil 4 and Beautiful Joe, you know, like there was, there were, there were big games on it. Now those came to other consoles eventually even though they totally lied. I'll cut my head off before this comes and he still walked around, he just released , got a, he released Evil Within, but then it came to Wii and you, you'll remember me during the",
      "start": 318.56
    },
    {
      "text": "even though they totally lied. I'll cut my head off before this comes and he still walked around, he just released, got a, he released Evil Within, but then it came to Wii and you, you'll remember me during the Wii early Wii era. Oh my God, what a Nintendo fanboy this kid was. Um, because I was still, you know, I always had all, you know, so during the GameCube and this, this, I'm sorry, this conversation go on a little longer than, than I'm sure the viewer is pissed. Um, but you know, I had a, let's go back. I had an NES and then I had an, and then I had an SNES and then I bought a Genesis later, like, like in high school. Sure. I bought on eBay, right? That's what I did with my S and then with, um, the Next Generation, I had a PlayStation, then I bought an N64, so had them both, right? Yeah, but this, this particular hour was the first time I had everything. I got a PS2 at launch, a GameCube a launch, and then an Xbox in the summer 2002. I bought it for a Cod tour. I think that was 2002, it might have been 2003 and so I had",
      "start": 352.36
    },
    {
      "text": "was the first time I had everything. I got a PS 2 at launch, a GameCube a launch, and then an Xbox in the summer 2002. I bought it for a Cod tour. I think that was 2002, it might have been 2003 and so I had everything and I always went back to GameCube, but I had most of my games on PS2 and when we went went to the Next Generation, I was a poor college kid again and, uh, I wanted a Wii. I couldn't find one. I was a senior in college. I finally got one when I, when I moved to San Francisco and like the summer 2007, um, and I bought everything on the Wii, you know, like I bought my third party games on the Wii, play everything on Wii, like you playing this, you playing that, you're like, no, I'm playing this Virtual Console game on a Wii. What are you talking about? And, uh, you know, this was before, you know, you know, I had, you know, my, my roommate in college had a PS3 and, um, you know, in our last year there and I couldn't afford that. I wanted one very badly. I didn't get a PS3. I didn't own my own PS3 until the Slim",
      "start": 390.32
    },
    {
      "text": "I had, you know, my, my roommate in college had a PS3 and, um, you know, in our last year there and I couldn't afford that. I wanted one very badly. I didn't get a PS3. I didn't own my own PS3 until the Slim came out. We talked about that on Beyond, like I didn't have any money. Yeah, and, uh, eventually like in 2008 or so, I was like, what am I doing? Like woke up from a dream , you looked around like, I'm like, this, this thing sucks, you know, like, like this Wii sucks and like, why am I like, like why do I pretend like I want to play, like why am I playing double 07 games and, and like broke ass ports that look like they belong on PS2, like why am I doing any of this anymore? And that's, that's when I kind of broken, that's what my anger towards what Nintendo was doing to me really came to the fore because I loved this company and I still love this company and they still make amazing exclusive games including on Wii, got Galaxy. Yeah, an extraordinary game, you know, Brawl, I love Brawl, you know, like Mario Kart, I",
      "start": 429.56
    },
    {
      "text": "this company and I still love this company and they still make amazing exclusive games including on Wii, got Galaxy. Yeah, an extraordinary game, you know, Brawl, I love Brawl, you know, like Mario Kart, I mean, these Mario Kart sold tens of millions of copies. Yeah, but they don't speak to me anymore and that's just me. A lot of people get mad mad at me about that, but my job is to be honest with people out there and, and telling them like every once in a while, every every like few months or a few times a year, I'll have like an epiphany where I'm like, I really love this game. Like I had it with, I had it with Smash and I had it with, um, you know, on 3DS, I had it with, uh, with A Link Between Worlds and Mario Golf was really fun and stuff like that, but then I just put it away and I'm like, I don't want to play this anymore and, and I look at Wii U and, and I'm like, this underpowered machine with a Fisher Price tablet and no games, you know, and then you look at PS4 and Xbox One and these are hulking machines",
      "start": 470.32
    },
    {
      "text": "this anymore and, and I look at Wii U and, and I'm like, this underpowered machine with a Fisher Price tablet and no games, you know, and then you look at PS4 and Xbox One and these are hulking machines with great libraries already and developers want to make games for them because they're not restricted. See this is where I think there's that line between you being a Nintendo kid and me being a Sega kid and while since I grew up hating Nintendo, hating Mario, oh, he's trying to take Sonic's glory, I can't stand this guy. I get to this point now and I see the Wii U tucked away on my, my little shelf on the entertainment center and I know I'm only going to turn it on for Smash now. We play a lot of Smash, but before that cart and then before that nothing and then looking forward, I don't know, maybe a virtual con. Yeah, yeah, exactly. I mean that's, that's literally it. This is the thing that like is really scary about the, I'm sorry, my final point on my thing is though and I'm fine with that. That's what I",
      "start": 508.44
    },
    {
      "text": "con. Yeah, yeah, exactly. I mean that's, that's literally it. This is the thing that like is really scary about the, I'm sorry, my final point on my thing is though and I'm fine with that. That's what I want out of Nintendo. That's what I expect out of Nintendo. You want more than you expect more out of it. Yeah, I want, I want what we used to get out of Nintendo, which was an ecosystem that made you want to stay in it, not like just dip your toe in it and then run away screaming because it's so terrible, you know, like that, like that's the, that's the big thing. It's like I want, I want Nintendo to win me back like more than anything. Like people were like , oh, your PlayStation's your favorite brand, you know, it's like no, Nintendo is my favorite brand and they've, and they've completely lost me. You know, I, I know I, I played everything on NES and SNES, you know, like, like I love those games so much and those first party games, brilliant games, games that set the tone for everything I came after whether it's",
      "start": 551.32
    },
    {
      "text": "know, I, I played everything on NES and SNES, you know, like, like I love those games so much and those first- party games, brilliant games, games that set the tone for everything I came after whether it's Metroid and Kid Icarus, whether it's Mario, whether it's Super Mario 3, Super Mario World, one of the best games of all time, you know, and, and really we were talking about Genesis versus SNES, like Mario World versus Sonic is a joke. That's a **** joke, you know what I mean? Like 100%. Like when you consider like the quality of those games and like what those games are, um, and it's, it's, it's distressing to me that they just don't get it anymore and but the market gets it and that's the big thing. Like PS4 is already outsold Wii U. Wii U's, you know, had had a year head start and two of its three big games are already out so there should they should be the, the game's not the system's not going to sell more than GameCube did, which is bad. Yeah, and you know, Mario Kart was going to sell all these units. Well, it",
      "start": 587.32
    },
    {
      "text": "already out so there should they should be the, the game's not the system's not going to sell more than Game Cube did, which is bad. Yeah, and you know, Mario Kart was going to sell all these units. Well, it didn't and, and Smash Brothers going to sell all these units and it didn't, especially because they released it on 3DS, which is stupid and now they and now just if you wanted to move Hardware, you should have just kept it as a Wii U exclusive. That would have made a lot more sense, but that showed, that showed us that they didn't believe that it was going to move units and that's why they put it on 3DS because there's already all these 3DS's out there and now Zelda, which looks extraordinary is going to come out and that's the last game that's has any prayer of selling a Wii U to to a normal person. So I want Nintendo to go back to the drawing board and this is what they need to do. They need to stop trying to be so different because it's not working. You know, like we sold a lot of units because it",
      "start": 627.44
    },
    {
      "text": "I want Nintendo to go back to the drawing board and this is what they need to do. They need to stop trying to be so different because it's not working. You know, like we sold a lot of units because it was different, but no one cared. The attach rate was pathetic. People put them away and the Wii just died, like it just was dead by 2011. It was done. You know, like stopped. Yeah, because you can't, you can't capture a, a casual market like that and then hope to can, you know, to to have to bring them back to GameStop to get them back to clearly didn't work, clearly didn't work. So they need to make a powerful piece of Hardware that developers want to make games for. They should get a bunch of third parties under contract and use some like, like they did, they try to do with Team Ninja and Metroid, try to get a lot of third party teams to to experiment with their own IP and see what they can come up with. You know, everyone's like, well, I want Mario on PlayStation and all that kind of stuff. I'm like, first of all,",
      "start": 659.72
    },
    {
      "text": "of third party teams to to experiment with their own IP and see what they can come up with. You know, everyone's like, well, I want Mario on PlayStation and all that kind of stuff. I'm like, first of all, that's never going to happen. Sony and Nintendo don't like each other and that goes back a long way. It's like 25 years, the PlayStation was supposed to be a Nintendo SNES add-on as a lot of people know and there's bad blood there. I think it would be more likely actually that Nintendo would get into bed with Microsoft, but that's, that's a thing for, you know, another, another time. But I don't want that to happen. The best Nintendo is in Nintendo that's innovating it with games and making good Hardware that people want to put games on. If you look at NES and SNES, those weren't unconventional, they were just **** awesome. Yeah, you know, and that Nintendo's gone to get them back on track, which I don't know if they will, but I me because they every time we're like this is what they should do, they don't do",
      "start": 701.56
    },
    {
      "text": "**** awesome. Yeah, you know, and that Nintendo's gone to get them back on track, which I don't know if they will, but I me because they every time we're like this is what they should do, they don't do it. They don't listen to us like PlayStation does. Hey, sh, uh, they should make, uh, their next con should be the handheld as well. Yeah, absolutely. We talked about that many times. Beam it to the TV. How do I do that? Make it work that way. Get a great online in an ID that has all my games attached to it. The revolution with the Wii U would have been if that tablet could play games by itself, you know, but like and it can, but the processing isn't on the tablet so you can't like walk, take it with you, you know, like that would have been the revolution and make it so it doesn't feel like you bought it at the toy aisle at Target next to, you know, the Legos because that's like what that thing basically feels like when you hold it. Yeah, so you know, my, my anger at Nintendo comes from the heart, you know, because I",
      "start": 734.16
    },
    {
      "text": "aisle at Target next to, you know, the Legos because that's like what that thing basically feels like when you hold it. Yeah, so you know, my, my anger at Nintendo comes from the heart, you know, because I wouldn't be in this industry and wouldn't be playing games if not for them and what they did for me, but what the hell happened? You know, that's a question you have to ask and that's a question I ask myself literally every day in my life. Right. Well, thank you, Colin. Ladies and gentlemen, what the hell happened to Nintendo? Let us know in the comments, share this video with your friend, support us on Patreon. If you're ever in San Francisco, come to Tempest Bar, which is where we're filming the final season of A Conversation With Colin. If you want to see Colin and I talk about games all the time, go over to youtube.com/kindafunnygames and I believe that's all the plugs. Buy the shirt, Districtlines.com/kindafunny. Go see Kevin on tour wherever Kevin's touring, then you know, watch the GameOverGreggy show",
      "start": 769.32
    },
    {
      "text": "to youtube.com/kindafunnygames and I believe that's all the plugs. Buy the shirt, Districtlines.com/kindafunny. Go see Kevin on tour wherever Kevin's touring, then you know, watch the GameOverGreggy show and, uh, do stuff like that until next time, video [Music] games",
      "start": 807.16
    }
  ]
}
