{
  "id": 546,
  "video_id": "DmCf8qLSz00",
  "show_name": "Gameplay",
  "hosts": ["Tim Gettys", "Nick Scarpino"],
  "title": "Let's Play Tiny Toon Adventures - Throwback Thursdays",
  "description": "Tim and Nick play Tiny Toon Adventures Buster Busts Loose on the SNES. Is Tim better than he was when he was 10? Find out!\n\nPlease support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino",
  "published_at": 1421956812,
  "duration": 1438,
  "transcript_chunks": [
    {
      "text": "What's up guys? I am Tim Gettys, this is Nick Scarpino. Hello everyone. Today we are playing a game that's very special to me, near and dear to his heart. First off, listen, the beautiful Konami logo. I miss that, I miss that a lot. The chimes just make you feel special. But what I miss more than that is the Tiny Toon Adventures theme song. And today we are playing Tiny Toon Adventures Buster Busts Loose. Yeah , he does. Do you have any memories of Tiny Tunes, Nick? Not well, Tiny Tunes yes, not this particular game though. So this game is something special because it's ridiculous. Is it a good game? I'll give it good. It's good, it's not great, definitely not great. The entire thing, I'm not really exactly sure the story. I always skipped through that. Every world is based on like a different genre of movie. I don't know what, maybe this is like a high school comedy, we'll go with that. I mean, I'm guessing you look like you're in high school. Yes. Um, I know the second world, the second world is uh based on Western movies.",
      "start": 0.12
    },
    {
      "text": "What, maybe this is like a high school comedy, we'll go with that. I mean, I'm guessing you look like you're in high school. Yes. Um, I know the second world, the second world is uh based on Western movies. The third world, I don't know because I never got that far in this game. So how far are we trying to get? We trying to beat it today? So I'm trying to see if I am better than I used to be when I was a little kid. Spoilers, probably not. Yeah, well, I mean here's my CR , here's my, here's my first impression of this game already. Uh-huh. Now Buster, we're looking at right here, mhm, this is Buster, the T character. He's, he can dash, he can slide under that thing which looks great. Yes. He can't jump all that far though. Okay, so here's the deal. Let's, let's do a bunny rabbit with feet roughly the size of his head. Uh, you would expect to, there it is, you're getting a little bit more of a, there you go. So, so here's the thing, you can jump, yeah, then there's a little flip kick jump. It's like his attack which",
      "start": 40.64
    },
    {
      "text": "His head, uh, you would expect to, there it is, you're getting a little bit more of a, there you go. So, so here's the thing, you can jump, yeah, then there's a little flip kick jump. It's like his attack which gives him a little forward momentum and he, he's barely able to get above the rats. Well, the rats, is that other mice, whatever they are? I don't remember their names. What, what do you want to call them? They, we'll call them the mice. No, but what name, give that guy a name. We'll call him Rizzo. Rizzo, I like that. But the biggest mechanic in this game is the dash where he does this football player style thing and you can hit down and like dive underneath and slide. The problem is that frog just went crazy on you. You have a dash meter and it's super hard to control is dash. Like he does this like little dumb animation and when you jump, you're still going super fast, right? So like it's hard . Now I played these introductory levels probably a thousand times so I know this like the back back of my head pretty",
      "start": 82.84
    },
    {
      "text": "Animation and when you jump, you're still going super fast, right? So like it's hard. Now I played these introductory levels probably a thousand times so I know this like the back back of my head pretty much and then I **** it out. But no, it's okay though, it's okay. But see this, see how hard that was for me to just stop? Yeah, it's a whole rig roll as they say. So there's a lot of wall jumping. Oh , I like that mechanic, that's cool. No. Oh, I missed it him. All right, so then we fall down here. There's these stupid Hub bloos. It's the Warner Brothers frog. Oh yeah, it is the Warner Brothers frog. Run and jump. But all right, you nailed it. So the Crux of this Let's Play though is that I never got past the second level. Okay, I got to the end of it, okay, but there's this part where you get on the train and then Max, who's the little like Punk kid that always gives Buster problems, right? He, he's like, I don't remember what happens, but there's like a damn Zone distress and stuff and you have to run across this train.",
      "start": 120.92
    },
    {
      "text": "Who's the little like Punk kid that always gives Buster problems, right? He, he's like, I don't remember what happens, but there's like a damn Zone distress and stuff and you have to run across this train and all of a sudden the dash starts going so fast and the screen starts scrolling with you, right? And if you don't keep up, you just die and it's impossibly hard. So my question, a couple questions for you on the on side on this thing, why is Buster the size of a microb in this cuz those are bookshelves? So for a normal rabbit either that or he's in the Land of the Giants right now. Do they, do they explain that in the story or do you not know because you never listen? No, that's uh there's no Canon to that. There's no Canon to, okay. Um, you fall down the big corn. So the question really is the outstanding question, this my second question is there's a boss fight and this should prob, oh look at that. So this used to be super hard back in the day. He talks like Arnold do, he's like, I'm a dog. Yeah, come on.",
      "start": 168.48
    },
    {
      "text": "Question, this my second question is there's a boss fight and this should prob, oh look at that. So this used to be super hard back in the day. He talks like Arnold do, he's like, I'm a dog. Yeah, come on. Do it then. I realized how easy this boss fight is if you just keep, oh well, hold on, I messed it up. But if you just keep attacking, he just dies. Like you can just keep flip kicking him and he'll just, I that's Point instantly die. So I think this as long as well as all of our Let's Plays really, let's be honest, uh can have the common theme, are we better than when we were six , you know? So yeah, we'll see. There's a secret up there. Let's see if I can get it. All right, hold on. Got to let my dash meter recover that dash meter. Okay, you got to jump over here. Hold on. You what? Yeah, from there. All right, there we go. And then we jump over here. Oh no, go up, go up, go up, go up. I'm so close. Whatever, you know what, it's not worth it. I don't even know what you get. I you walk through the wall and then like it goes that's",
      "start": 214.48
    },
    {
      "text": "And then we jump over here. Oh no, go up, go up, go up, go up. I'm so close. Whatever, you know what, it's not worth it. I don't even know what you get. I you walk through the wall and then like it goes that's the other thing I don't understand what the items do in this game. Some of them, some of them give you, yeah, but there's different colored carrots. Some of them refill your health and some just give you more hearts and then there's stars that you just add up. I guess 100 of them gives you life or something. Yeah, like right there. But yeah, so, so little known fact, this is one of Alexis Kaz's favorite games of all time. Really? Yeah, this and Basem 3000 naturally. If I had to guess two games this wouldn't be on there, but Bas Master, what would you name him? That's Porky, not Hampton. He can be Hampton. Don't Call Him Hampton. All right, so we're about to face boss fight number two. The other one was mini boss. This is the real boss. Okay, you got the Tasmanian Dev, so it's Tasmanian Devil's like little",
      "start": 257.76
    },
    {
      "text": "Don't Call Him Hampton. All right, so we're about to face boss fight number two. The other one was mini boss. This is the real boss. Okay, you got the Tasmanian Dev, so it's Tasmanian Devil's like little cousin or something, Dizzy. Dizzy. Oh yeah. So the thing here, this is kind of, you know, you can go up and like goes to different levels. Eventually if you wait, he starts spinning, he bust through a bunch of the stuff . Now the goal of this is making him fat. So you have to feed him. You have to feed him to death. Yes. How incredibly man morbid, right? Go back, go back, go back. Dam it. All right, get a wait. Oh, he's going to fall. All right, see Dizzy, come on, there you go. He's coming back up, breaking my ball, make me, oh, he has to eat a fair amount. I remember this always took a way too long, really long for a boss fight. All right, there you go, you nailed it. Oh, I like how you can just hide in the corner. Well, that's the thing, I I know the secrets of this. I did it many times. I didn't know you were that big on a Tiny",
      "start": 301.72
    },
    {
      "text": "All right, there you go, you nailed it. Oh, I like how you can just hide in the corner. Well, that's the thing, I I know the secrets of this. I did it many times. I didn't know you were that big on a Tiny Tunes guy. I was say you were more of a Disney kid. Well, I was, but I mean, you know, Tiny Tunes, I'll tell you one thing right now, never got that come upin the Tiny Tunes, you know, they just kind of relegated to history. Oh, there you go, you nailed them. Get in my belly. Oh, we're getting close. We get real. I feel like leave that or he's going to have to take a deuce after a second. Well, eventually you just get so fast, you just passes out and that's how you beat him. I think I think I need to feed him one more time. Okay, get him one of those uh nice little chocolate Sun that he's got there. More. Oh, see this is so ridiculous. Oh my God, there's more. Yeah, okay, I'm done now. So did you get him? Yeah, I got him now. Coming up now, there's mini games. Okay, so after the boss fights, there's like this like Wheel of Fortune",
      "start": 353.84
    },
    {
      "text": "Ridiculous. Oh my God, there's more. Yeah, okay, I'm done now. So did you get him? Yeah, I got him now. Coming up now, there's mini games. Okay, so after the boss fights, there's like this like Wheel of Fortune thing that goes around and eventually you play like a bunch of different themed minii games. Some of them suck. Yeah, like this weight one that like doesn't make Hampton's bag. Um, oh, it is Hampton, that's his real name. It's a pig. Yeah, Hampton the pig. Oh, okay. What was the rat's real name? He was Porky's Offspring. Porky got busy. Porky got busy. Um, damn good for Porky. All right, so this is a mini game. I think her name is B abs. Yeah, Babs Bunny, that sounds right. Yeah, it sounds special. It does. I wonder if Lola was her mom. Remember Lola from Space Jam? Oh yeah, man. Lola was one of the first cartoons that's what we should do is we really should that's nasty. Uh mine was Jessica. Lola is the Jessica rabbit of my generation. Oh his is cool. So he he has this um oh wait no is it it's either him or the cat thing they do",
      "start": 403.28
    },
    {
      "text": "Should do is we really should that's nasty. Uh mine was Jessica. Lola is the Jessica rabbit of my generation. Oh his is cool. So he he has this um oh wait no is it it's either him or the cat thing they do oh yeah Bingo that's dumb Bingo's stupid the cat thing he plays uh bot ball interesting yeah Lawn Bowling mhm very big amongst the community all right here we go Bingo of Brothers lot of [Music] buling so this is um thrilling gameplay right here yeah cuz if there's anything people love it's Bingo it's like power Bingo all right so so what happens if you lose this nothing this is just a mini game just get you extra lives okay which let me tell you Nick I'm going to need for this upcoming yeah this next one's rough no wait are you playing against anyone else no you can't really lose going to keep going until you get as many as you can this is this is that kind of **** we like if kids just play the game they get a trophy makes generation you don't always lose though I mean you don't always",
      "start": 450.12
    },
    {
      "text": "Going to keep going until you get as many as you can this is this is that kind of **** we like if kids just play the game they get a trophy makes generation you don't always lose though I mean you don't always win really yeah someone else wins no you lose how do you lose by just not matching any but like it's a physical impossibility eventually if they keep going you'll eventually match them yeah I know you only get seven oh okay that makes sense oh yeah you're not going to make it all right I think this is my last one I need that I need that duck duck I don't know what her name is I don't know what does her blasty blasty the duck there you got Bingo damn I got bing two oh wow look at you look at the brain on chat all right good job oh I still get more they're just giving it to me at this part give me come on Turtle lucky oh come on turs MTI there's only like two characters left so oh was that yeah well what a shame all right so we're going to the Western World all right cool this is it this is",
      "start": 503.64
    },
    {
      "text": "Me come on Turtle lucky oh come on turs MTI there's only like two characters left so oh was that yeah well what a shame all right so we're going to the Western World all right cool this is it this is where this one you can't get past so the beginning part I got down then there's this part where there's these little quite racist characters if I say so myself um that want you to do some jump rope and I remember that gave me a challenge when I was young there's some buzzards that attack you but the real trouble doesn't start until later when there's the train so you can't step on those uh those Tomatoes I'm assuming that well they're like bomb Tomatoes this isn't Wy coyote but it looks like them this is this whole thing is just a lie yeah it's just a big fat dirty here we got these guys get in there right I remember I was used to like need to you got to move your body to it get into the groove it's like preconnect connect you're doing really well this is like did you practice this before",
      "start": 549.36
    },
    {
      "text": "There right I remember I was used to like need to you got to move your body to it get into the groove it's like preconnect connect you're doing really well this is like did you practice this before I did there we go nailed it so some of these little hores kick you up and there's like these Buzzard that come down try to make your life hard oh God you were like I'm assuming the blue ones kick you up [Music] yeah all right all right all right you nailed it nailed it okay okay so you go in here yeah you got to go scale the building and then at the top of the building is the Train the building's at the top of the train no the Train's at the top of the building the Train's at the top of the building yeah oh man done you really good with that flip kick yeah also whoever structurally engineered this building should be shot barrels falling everywhere every light you go under falls on your head oh God there's nothing but coyotes running around which can't be safe for anyone that has small",
      "start": 596.16
    },
    {
      "text": "This building should be shot barrels falling everywhere every light you go under falls on your head oh God there's nothing but coyotes running around which can't be safe for anyone that has small children small dogs I there's nothing funnier than a coyote boo in fact when you put boots on anything that makes it funny M like true you know like you ever see a little dog in Boots four boots oh they start walking around they can't walk they can't walk any they don't like it but they can't do anything about it they're a dog a Montana Max that's where I got the Montana from I knew there was something there all right by Buster okay so here's where it gets extremely hard all right so this is this is the level are you better than you were at 10 years old let's see here you are now I hear this's is Star Wars level H off that coordination so so far it's not too bad you kind of just got to keep up with it all but eventually the screen just screams at you to dash oh God see like right there if you",
      "start": 646.96
    },
    {
      "text": "Star Wars level H off that coordination so so far it's not too bad you kind of just got to keep up with it all but eventually the screen just screams at you to dash oh God see like right there if you didn't Dash I would have just died and it's scary you're going to be fine this is this induces panic attacks man this does look like a particularly hard level for see like it's the fact that it's so hard to control is what makes it difficult well maybe you just settle down it's hard to settle now see right here it screams at you to Dash and from here on out it's utter hell cuz the screen's scrolling and if I miss the back of the screen I'm dead **** I think I missed it up oh God oh God oh God you nailed it all right I'm doing okay why can't you see your character that's annoy I wish you knew how sweaty I am right now you look like you're I mean I can smell it this is bad why is it bad so now the train starts falling apart okay love oh look at that stay on target coyote start coming",
      "start": 688.2
    },
    {
      "text": "Knew how sweaty I am right now you look like you're I mean I can smell it this is bad why is it bad so now the train starts falling apart okay love oh look at that stay on target coyote start coming you're nailing it all right all right all right all right what the hell are you supposed to do das that's so hard yeah isn't that that's just utterly not okay no kid got that the first time oh God all right all right all right all right my hands are so sweaty right now get there get there get some stop dashing you can do it so many times what the **** oh my god oh you got it did you beat it no look how close no see how fast that was and all all a sudden it's over and guess what you guys start the beginning oh wait no no no I guess I made it past the the point of return oh really wow okay so all you really need to do that was they were like let's give it to the kids have you ever been seen this part before done this part a couple times okay all right these guys are tough ombr you know",
      "start": 740.52
    },
    {
      "text": "So all you really need to do that was they were like let's give it to the kids have you ever been seen this part before done this part a couple times okay all right these guys are tough ombr you know what I mean taking two hits asholes you know ombre is like a really in hairstyle right now ombre yeah do you know what that is is it a hair color it's a it's a color that they do where it's like girls do it yeah and it's like darker on the top and then like Li on the B my wife has ombre hair right now she's got a little uh like a lob is what it's called long bob oh there you go yeah apparently he just make sure uh oh what's this guy's name this is Mr Magic oh wow all right watch out for his telescoping cane get on it stay on his ass there we go what's up Mr Magic Mr Magic now you're all magied out like a chump oh more train like what's oh are you kidding me oh this is so easy to control extraordinarily difficult I do not envy you oh it's the tough guy he's throwing stuff out at you you",
      "start": 802.04
    },
    {
      "text": "Out like a chump oh more train like what's oh are you kidding me oh this is so easy to control extraordinarily difficult I do not envy you oh it's the tough guy he's throwing stuff out at you you got it look you got it I trust you on this how many how many stars do I have Nick you have 60 is that a nine after oh grow upow up him that joke never gets old it's a sex thing it's aexual position I like how this guy has a Yale on his shirt mhm what's funny is the joke is that he went to Har that's crazy he's like I'm actually a Princeton guy wor show this is y and beat people up at it just to be smudge be smirk the good name of Yale all right Mr Magic Mike's coming back Magic Mike what's going on what is he doing there he just ducking can't do anything when you duck though so it's kind of useless well can you do anything when you duck yeah it's I can do a little like turtle walk going duck a bob get it up magic mik yeah buddy strip time oh what that was not okay get those Stars you need an",
      "start": 855.0
    },
    {
      "text": "Well can you do anything when you duck yeah it's I can do a little like turtle walk going duck a bob get it up magic mik yeah buddy strip time oh what that was not okay get those Stars you need an extra life cuz you're not doing well all right so now it's freaking jump on the wood this is some Mega Man **** right now it's this one that comes fast I knew it was coming that time you got it watch out for this he's right there so there's the duck oh what all right he's that let him go let him go yeah he lives a horrible life forever stuck in that wood [Music] Pack Attack Dash up Dash what is that a carrot okay it refilled my whole life I'm feeling really good about this Nick is this I've never got this far wow all right so we do not we literally don't know what to do you have three lives left I'm pretty sure you're going to beat this level all right that's it you're better than you were at 10 oh uhoh no this sounds like a boss battle coming up you got this okay I'm I'm happy I got this",
      "start": 916.92
    },
    {
      "text": "I'm pretty sure you're going to beat this level all right that's it you're better than you were at 10 oh uhoh no this sounds like a boss battle coming up you got this okay I'm I'm happy I got this far though no matter what I'm better than 10-year-old you are better than a 10-year-old Tim always knew he was a punk waa this is seems dangerous all right I don't even know how to begin with this just jump over brother you got it oh you can there you go what wow this game is absurdly hard what's amazing is it's made ever so much harder by the fact that it's endlessly scrolling and you're dead you want to give it another shot I hope I started the boss again do appar the boss is the train you better get on I never thought in all my wildest desires that I would fight the train well you're fight train has given me so many nightmares over the years TR is an analogy for life you're fighting against it so what's my straty you got to just beat those things right now start on them get on them there",
      "start": 979.52
    },
    {
      "text": "Has given me so many nightmares over the years TR is an analogy for life you're fighting against it so what's my straty you got to just beat those things right now start on them get on them there you go I do the same there you go it's the steam is scaring me yeah it's okay you got it okay that just went through me so that didn't make sense all right duck all right hit him you got to hit him can you dash up [Music] okay so you got to get on that thing the second you can but there's Steam and there's fire just get on it man I don't do I have a zero life I don't know that's a good question actually I should probably figure that out all I know is we have one more life left than 80 points I am legitimately swey right now get get in it get it now get a jump on [Music] it go yeah cuz if you destroy that but before the other one comes in you dodge sh Dodge now get on it start [Music] attacking you nailed it okay this is not even this doesn't even look right oh got to go back got to go the",
      "start": 1042.36
    },
    {
      "text": "That but before the other one comes in you dodge sh Dodge now get on it start [Music] attacking you nailed it okay this is not even this doesn't even look right oh got to go back got to go the other way this game is like torture it's like like a cartoon version of hostile at least this part's easier I mean seemingly until dogs start throwing random things at me I'm sure how are you supposed to is this the end of the game you only have one life left no there's like multiple levels left oh my God why are you going that way oh I was like wait what oh man you got this it's easy okay what's that little dude is he alive I think he needs to be saved go get him it was life dope I've never seen that in this game I'm just so scared that fire is going to no like that what get him get him Tim attack Tim attack it's done I think I did it you beat it look he's shaking his little Goose shaking his little gabose I always going to escape though they always Escape yeah I know the train is out of",
      "start": 1110.4
    },
    {
      "text": "Tim attack it's done I think I did it you beat it look he's shaking his little Goose shaking his little gabose I always going to escape though they always Escape yeah I know the train is out of control cuz you did it you inconsiderate little brat you know what you get you reap what you sew in this life so I'm just worried that the level's not over it just seems like it is are you doing this yeah I don't like this thing why is this so scary this is like torture go faster you got this you're 88 miles per hour you can go back in the future I think that's what just happened hilarious that's a hilarious inside joke that's kind of cool yeah all right I'm very happy with myself right now Ladi gentlemen you you beat it can you save the game or does not exist I need here's the thing we're going to stop this Let's Play but I need to see what the next level looks like all right is it the future it's going to be the future cuz if it's the future that that's awesome let's see all right first",
      "start": 1190.0
    },
    {
      "text": "To stop this Let's Play but I need to see what the next level looks like all right is it the future it's going to be the future cuz if it's the future that that's awesome let's see all right first Warner Brothers that was back Warner Brothers right was it Fox I F I don't know no one knows I'm pretty sure it'll remain a mystery forever it shall inde all right so this is the weight game thing oh I like the weight game yeah you have to pick something's weight so you I control this side and then the computer chooses that and then like they choose their order you choose your order got it and it's you have to you know how are you supposed to know what something weights oh 1 2 got it so you got oh that's genius okay so what do we what should go heavy go five they're not going to go five they're not g five all right let's go smallest sure how do we know just look at their size okay uh I'm going to go middle yeah second smallest second biggest all right ready ha boah nailed nailed it of course",
      "start": 1249.72
    },
    {
      "text": "G five all right let's go smallest sure how do we know just look at their size okay uh I'm going to go middle yeah second smallest second biggest all right ready ha boah nailed nailed it of course that was probably their smallest person so we screwed yeah so here I'm screwed yeah what do we name her it was a good name blasters or something blasty blasty blasty MC duck look at I think these are ti oh no I won nailed it suck it opponent I think we're going to win this only well no they still have their heavy yeah you just beat us yeah but we're going to beat this one yeah cuz she's a four yeah and I think the their duck was the blast he wasn't there for oh is it tied damn it no way it's tied draw what kind of hor **** game is [Music] this well there you go Tim there you go there you go everyone oh let's see Montana Always gives me a hard time oh well I guess I'll head home I better get inside so I don't get soaking wet oh it's a rainy level it's going to be slippery and slidy oh it's",
      "start": 1299.16
    },
    {
      "text": "Oh let's see Montana Always gives me a hard time oh well I guess I'll head home I better get inside so I don't get soaking wet oh it's a rainy level it's going to be slippery and slidy oh it's probably I found an old mansion just in time but wait a minute sudden rain uncanny old mansion in the forest no signs of Life dot dot dot this stereotypical situation means the next stage must be spooky Mansion all right spooky Mansion spooky Mansion time well ladies and gentlemen this is a level that I never knew was in this game you didn't know there was a spooky Mansion now you do for all of your Let's Play needs you should stay right here on Kinda Funny games this is Throwback Thursday tomorrow's going to be free play Friday after that multiplayer Monday teach keep getting better Wednesday all sorts of alliteration will we we do another Let's Play where I continue this maybe probably maybe we will maybe we won't until next time I'm Tim Gettys I'm Nick Scarpino and this has been a kind of",
      "start": 1365.24
    },
    {
      "text": "Sorts of alliteration will we we do another Let's Play where I continue this maybe probably maybe we will maybe we won't until next time I'm Tim Gettys I'm Nick Scarpino and this has been a Kinda Funny production [Music]",
      "start": 1421.44
    }
  ]
}
