{
    "id": 554,
    "video_id": "HQtVMLfX684",
    "show_name": "Reactions",
    "hosts": [
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "We Played Witcher 3! - Kinda Funny Reacts",
    "description": "We got the chance to play the Witcher 3: Wild Hunt!\n\nWe quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nFollow us on Twitter!\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1422284410,
    "duration": 468,
    "transcript_chunks": [
        {
            "text": "Hey everyone, I'm Nick Scarpino and this is Colin Moriarty, but you knew that. What you don't know is that we saw the Witcher 3 today, right? It was a lot of fun. It was a lot of fun. Not only do we see, we played it. We played it. It was our first hands on, actually first ever hands on with Witcher 3: Wild Hunt as they call it, and what a wild hunt it was. It was a very wild hunt. Uh, what was, what was your first impression of this game? Well, you know, CD Projekt Red has been taking a long time to make this game and, and, and, you know, the original Witcher came out in 2007 on PC and then Witcher 2 I think was about 2011. It was the first one to come to console and, you know, ever since they've been really kind of working on this game and really trying to visualize a high fantasy sort of open world RPG and the first thing that struck me really was how beautiful the game is. I think the game's gorgeous and, and, and it gives you a landscape to explore that I think is just begging for you to to run out there and not",
            "start": 0.24
        },
        {
            "text": "thing that struck me really was how beautiful the game is. I think the game's gorgeous and, and, and it gives you a landscape to explore that I think is just begging for you to to run out there and not even like just not even pay attention to your quests like any like any good open world you start, you start and you have the tutorial stage of course, but the way the game starts, I don't want to spoil it for anyone. It's probably one of the best openings ever, not, not counting the opening cinematic, I'm talking about the actual opening that leads into a tutorial, which if you think hard, you know what I'm talking about, then you come out onto the the the balcony and it shows you kind of a nice panoramic view of the world you're about to sort of embark upon. Um, so what are your next thoughts? I mean, there's obviously a robust combat system in this. You get a little train go out there. I didn't get as far I think as you in the game cuz I think you played for a little longer than I did. Um, but tell me",
            "start": 33.0
        },
        {
            "text": "obviously a robust combat system in this. You get a little train go out there. I didn't get as far I think as you in the game cuz I think you played for a little longer than I did. Um, but tell me some of the things that you sort of encountered in this bad boy. Yeah, I mean, we were, we were able to play the game for up to three hours . I played it for about an hour, maybe a little bit longer and, and, uh, you know, the tutorial combat kind of opens you up to, you know, the magic system, which is very rudimentary magic system. Um, you know, the sword combat, which is basically the heart of The Witcher. Um, and you know, there were some interesting things. I went to to a bar for instance, got into a fist fight with some dudes. I thought they were tough guys. They weren't very tough at all. You show them what's up. A little bit of Moriarty skin chicken. Yeah, that's I guess so. I guess that's exactly what I gave. Going to call him the Ham Hawk. Give, give him the Old Ham Haw. Give the Old Ham HCK. Give him thunder and lightning.",
            "start": 65.16
        },
        {
            "text": "bit of Moriarty skin chicken. Yeah, that's I guess so. I guess that's exactly what I gave. Going to call him the Ham Hawk. Give, give him the Old Ham Haw. Give the Old Ham HCK. Give him thunder and lightning. But you know, it was cool like the kind of the diverse array of combat and you can kind of see how the game opens up actually when, um, you know, just not only in terms of your sword combat and your spells, but and how you use the items you find in the world to kind of synthesize new things and, um, obviously you can buy items and weapons from merchants and stuff like that. So the things you start out with, the abilities you start out with are very rudimentary and and it's, it's clear the game gets much bigger as again, any good open world RPG would, but what really stood out to me was kind of the variety of enemies that I was encountering just in the brief time that I played the game. Obviously there , uh, are human enemies and humanoid enemies, but they're also ghouls to fight and these like fishmen that",
            "start": 94.28
        },
        {
            "text": "of enemies that I was encountering just in the brief time that I played the game. Obviously there, uh, are human enemies and humanoid enemies, but they're also ghouls to fight and these like fishmen that look like they're straight out of Castlevania and yeah, I saw Griffin steal a dude's horse. Yeah, messed up. Griffin stole a dude's horse while some cowardly merchant hid under his, uh, carriage. I don't really blame my guess. Maybe I would be the Cowardly Merchant in that situ. You never really know. You like to think that you're going to be the hero, but let's be perfectly honest, it's so much easier just to hide under your own cart, watch your horse be eaten. Absolutely. And actually that that particular, that particular situation showed off I think nicely to the the conversation system in Witcher 3 and also, uh, how that affects things. For instance, uh, when you encounter that Griffin eating the dude's horse, you can be nice to him and refuse payment because obviously witchers are basically bounty",
            "start": 132.08
        },
        {
            "text": "3 and also , uh, how that affects things. For instance, uh, when you encounter that Griffin eating the dude's horse, you can be nice to him and refuse payment because obviously witchers are basically bounty hunters, um, and they're always looking for money. They don't do anything without being paid crowns. Um, and, uh, I actually refused to be paid and he was nice to me and immediately offered up, uh, some information about the the woman I was looking for who smells like lilacs and gooseberries as you're reminded literally 15 times in the first five minutes of the game. The first stage is called Lilac and Gooseberries and if it sounds like there's a sexual connotation to it, there is. Yeah. Oh, I can't confirm that actually. May made that. I don't know. We cannot neither confirm. I used to call you back in the day when we both worked at IGN a long time ago, uh, I used to call you my little Lilac and Gooseberry. Yeah, you did. I really, you did call me that and a lot of people know that, but I really, I really enjoyed",
            "start": 163.84
        },
        {
            "text": "when we both worked at IGN a long time ago, uh, I used to call you my little Lilac and Gooseberry. Yeah, you did. I really, you did call me that and a lot of people know that, but I really, I really enjoyed being called that. Like maybe we'll bring it back. Yeah, I mean, we, we can. I what I like better is if I call you my lilac and you call me your Gooseberry. How do we feel about that? This is great. Fantastic. Uh, so I mean, how far did you get? You didn't get too far cuz you said to me you were like, I actually, I'm actually excited about this game. I'm going to stop playing cuz I want to experience this is the way I, this, this world for years of doing preview events at IGN, the the more in-depth preview events actually are, are the worst for me because for games I'm excited about because it's like, oh, play the game for 4 hours and have fun, but it's like, I don't want to do that right now. Setting for that right? I want to cuz then I have to do it all over again. The game comes out May 19th and and obviously the",
            "start": 202.92
        },
        {
            "text": "for 4 hours and have fun, but it's like, I don't want to do that right now. Setting for that right? I want to cuz then I have to do it all over again. The game comes out May 19th and and obviously the game has been kicked back a few times, but, um, you know , they're polishing and and and optimizing the game right now and you know, as soon as I got control after I went to a town and I was looking for a woman who smell like these various flowers, uh, I I basically ignored the quest and ignored the side quest, ignored everyone around me and really just ran into the world just to kind of see how big it was and it was cool. I ran like there's a river, uh, you know, some beautiful sand kind of on the River Bank, some guys just fishing. I run across the river, River basically Ford the river, go into these woods and suddenly I'm shot by an Archer. Like 2 minutes later I come across these Army deserters that are just around a a fire in the woods and I'm just I'm too close to them. They're not comfortable and so I I",
            "start": 237.6
        },
        {
            "text": "suddenly I'm shot by an Archer. Like 2 minutes later I come across these Army deserters that are just around a a fire in the woods and I'm just I'm too close to them. They're not comfortable and so I I fight and kill them. I loot their bodies. I take all their gear. Maybe there's a reason why they weren't comfortable with be calling. Well, I was figured you were going to just fight and Luther. I think they made assumptions. I mean, a like I might have encountered and said hello, have you seen the woman that smelled like lilac and gooseberries, but I wasn't even able to ask them that because they shot an arrow at me and once you shoot an arrow at me, you take the the arrow out of the quiver, well then I'm going to have to slice your head off off and that's exactly what I did. Never shoot Arrow out of Moriarty. No, no, no, definitely. Oh, but but I'm curious how you feel about this cuz you're a man more of cinematic tastes. How did you feel about the presentation of the cut scenes and which seemed in engine and",
            "start": 272.16
        },
        {
            "text": "no, no, no, definitely. Oh, but but I'm curious how you feel about this cuz you're a man more of cinematic tastes. How did you feel about the presentation of the cut scenes and which seemed in engine and the voice acting? I was actually very impressed with both. I was really impressed. I was really impressed and and again, I'll preface with I don't I don't go in for open world RPGs. I don't go in for RPGs or open world experiences mostly at all. I like to be on a linear track. I like to know exactly where I'm going. I don't really want to think. I just want to react. Um, but this should be it and that first opening cinematic which was in game, I believe beautiful. They have the the callbacks to kind of where you are now versus where the because the witchers are tracking this woman at the start of the story. Um, it's told well, it sucked me in. You know, if it weren't for Tim came over and was like, dude, we got to go. I probably would have kept playing for at least a couple more hours. Yeah, definitely and",
            "start": 301.08
        },
        {
            "text": "um, it's told well, it sucked me in. You know, if it weren't for Tim came over and was like, dude, we got to go. I probably would have kept playing for at least a couple more hours. Yeah, definitely and interesting. What was cool too just visually was the way the sun, um, really shone and and illuminated various objects in the sky as the day night cycle kind of took over because the day night cycle seems like it's about a minute every four or 5 seconds. So the days actually go pretty slow and it allows you I think to explore the world in a more meaningful way. So when you start and really gain control outside of the of the opening tutorial at dusk, it really does feel and look like dusk and I think that's really cool and as the day progressed and I went to the the pub to get some information on our lady and then ran into those guys I beat the **** out of, uh, then you know, everything in other words, the world constantly look different, um, based solely on on really basic things like like a really",
            "start": 334.68
        },
        {
            "text": "lady and then ran into those guys I beat the **** out of, uh, then you know, everything in other words, the world constantly look different, um, based solely on on really basic things like like a really nicely done, well executed day night cycle. So I'm super EXC, I'm super excited about this game. I mean, this game has been on my radar for a long time. I think people are eager to play it. I think we expected that it would be out by now, but CD Projekt Red takes their time. They believe in quality like a lot of great developers do and and you know, give them all the time they need. It seems like the game's basically done, um, but that they're polishing and optimizing. So that's really cool. So, um, you know, what's cool too for The Witcher 3 is that you know, the original Witcher was PC only and I think it was on like Linux and Mac and then and then Xbox 360 got Witcher 2 along with PC and other, you know, computer platforms. This time PlayStation Gamers get get it too and I know you played it on PS4. I",
            "start": 368.0
        },
        {
            "text": "was on like Linux and Mac and then and then Xbox 360 got Witcher 2 along with PC and other, you know, computer platforms. This time PlayStation Gamers get get it too and I know you played it on PS4. I played it on Xbox One. It's also going to be available on PC. So it's going to get, it's going to get everyone's going to be able to get involved in cuz candy I never played the other Witcher games. Um, and by all accounts from people that are fans of the series, they're really excited about this one too. Yeah, yeah, I mean, obviously we just scratch the service of The Witcher 3. There's probably many, many, many more hours to come of goodness from that game. Colin, thanks so much for hanging out with me today. Final question for you, do you think we can get these chairs and these furs back to the studio without being noticed ? I think we, well, we can. I'm let me let me answer that question in in two different ways. Can we get the the chairs back to the studio and and the fine pelts here? Uh, yes. Can we do it",
            "start": 404.64
        },
        {
            "text": "being noticed? I think we, well, we can . I'm let me let me answer that question in in two different ways. Can we get the the chairs back to the studio and and the fine pelts here? Uh, yes. Can we do it without being noticed? It's unlikely. The the other question I want to ask you is, uh, do we care if we're seen and you know that that remains up in the air. Colin, it's been a pleasure as always. Everyone out there, stay tuned to Kinda Funny Games. Make sure you subscribe for more goodness.",
            "start": 437.56
        }
    ]
}