{
    "id": 562,
    "video_id": "Kd9FzwaX0mw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Body Switched With Portillo - The GameOverGreggy Show Ep. 60 (Pt. 2)",
    "description": "Nick Scarpino wonders how we would communicate if we body swapped with Portillo.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get you PC here www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1422345602,
    "duration": 954,
    "transcript_chunks": [
        {
            "text": "Nick, yes, what's your topic? My topic today comes from Twitter. If you have a topic for me, please tweet Nick Scarpino with GOG Topic in your Tweet, just like like hash. Every week it changes and I love it. It's fine, just tell me it's a topic for Christ sake or just ask me questions about Taco Bell. Like, uh, Danica Patrick, she's hot off the set of her newest a Patrick one California Patrick who says that Nick Scarpino, guys, what would you do if you woke up one day in Portillo's body? Also, how would you make other people, other people believe that it was you in that body? So we wake up as this wiener, you're just this guy right here. Woke up, oh my God, I'd freak out. I'd freak out. You got you got a floor view of everything. Yeah, is Portillo in our bodies? 'Cause that's the more terrifying. Oh my God. Well, what's crazy about that, Greg, is I don't know that we'd actually notice in your case, but for the rest, just because imagine he would constantly be want to be on your lap. He would never be able to shake that, Greg.",
            "start": 2.92
        },
        {
            "text": "crazy about that, Greg, is I don't know that we'd actually notice in your case, but for the rest, just because imagine he would constantly be want to be on your lap. He would never be able to shake that, Greg, is like two, just run around the house, but he'd be running on all fours, smashing into ****. Yeah, whenever a car goes by. Sorry, what would you do? What would you? I would probably, I would freak out at first. Yeah, of course you would. I would freak out. Uh, I would probably go stir crazy because I wouldn't be able to get out of the room. You always lock him in the room. He's always in there. He can't, he keep his little paw can't get. I would know how the door opens, but I would have to try to figure out some sort of like contraption that could get me up to it so I could grab the little thing with my paws. It's like I Am Bread, open it up. Exactly. Then I would probably, in order to tell everyone who I was, I would take kibble out of my bowl. This is good. And I would spell, 'I am Nick,' and I would just wait for Tim.",
            "start": 83.4
        },
        {
            "text": "like I Am Bread, open it up. Exactly. Then I would probably, in order to tell everyone who I was, I would take kibble out of my bowl. This is good. And I would spell, 'I am Nick,' and I would just wait for Tim. You wouldn't believe it. You would be like, 'I don't know what the hell this thing.' You would, he would just do the like, 'Come on, man.' You kick it back towards the wall, kick, and you get pissed off because, and but you see, really love this dog. I've seen it. I've seen it times when no one's looking. You're like, you, he loves the dog, but you, if it were in front of other people, you would be like, 'No,' and you would kick it aside. You are, you just, you're you're oblivious to it at this point. You're right now, if you're my dog, I'm not going to be able to see something's wrong with Portillo. This dog had a **** lump on his face. I got it immediately. I think that maybe you would, you would, if there was some fluke accident where a Smash controller fell onto the floor and I started playing as Pit, you'd be like, 'It's'",
            "start": 126.56
        },
        {
            "text": "on his face. I got it immediately. I think that maybe you would, you would, if there was some fluke accident where a Smash controller fell onto the floor and I started playing as Pit, you'd be like, 'It's Nick.' I know that's only Nick. Would stand on the corner on the right side of the, just just keeps hitting B. I wonder why. And Nick's been acting so strange. And Nick's just curled up on the floor, squeaking toys. Yeah, I think I would put it together. Uh, I think you see, if I, what you're describing is we wake up and everybody's gone. We're locked in the room. I'm Portillo in the room or whatever. I would freak out. Sure. I would chill for a second, try to talk. I can't. I'm just barking. I assume that's how that goes, you know what I mean? And then, yeah, like you're saying, there's nowhere to go. There's nothing to do. He's not going to be able as a miniature wiener dog. You can't work the door knobs in my room. You can't get into the bed without the stairs. So I would just chill, sleep for a second, see why he's",
            "start": 164.92
        },
        {
            "text": "to do. He's not going to be able as a miniature wiener dog. You can't work the door knobs in my room. You can't get into the bed without the stairs. So I would just chill, sleep for a second, see why he's always so into sleeping like that. But then when people came home, the stairs went back, da da da. Laptops, iPads, iPhones are always around. Run up to one of those, do the old tap-tap-a-roo on them. Start tapping out, start tapping out the message with the paws. You jump up. Those are some fat little, you know, knockers you're hitting. You're hitting two keys on these. These aren't precision. First off, I mean, he has control over his. I know, buddy. I know. I know. No, he looks, he has control. Yep. I mean, everything he's doing, he has control over his paw. He could, he could tap out a message. And but like, you're the kibble is a good move. Kibble is a good move. I, if you start spelling something, people know something's up. People know you're a message boy, Portillo. You're actually secretly brilliant. You know English, maybe.",
            "start": 204.44
        },
        {
            "text": "is a good move. Kibble is a good move. I, if you start spelling something, people know something's up. People know you're a message boy, Portillo. You're actually secretly brilliant. You know English, maybe. And would you, here's the question though. So you start making a lot of money, right? Because people are like, 'This dog is genius.' Now, see, that's the, that's the scary thing. What if they Zuckerman's famous pig, and they don't actually care about what the messages say? They're just like, 'Oh, yeah.' They just want to make you do things so they can make money off this like TV episode. But I mean, that's the thing. So we know at this point, we know it's Nick. You know this. My thing was the keypad. It's us making, it's us making money off of Greg, Portillo. Well, we, we, once you find out, I mean, then you got to go find whatever sorceress I pissed off. Yeah, not like this just happened. I clearly did something. Yeah, that's the thing. It's like, 'Man, what would we do?' It's like instead of them cursing you Thinner, remember?",
            "start": 245.92
        },
        {
            "text": "whatever sorceress I pissed off. Yeah, not like this just happened. I clearly did something. Yeah, that's the thing. It's like, 'Man, what would we do?' It's like instead of them cursing you Thinner, remember the movie Thinner? No, instead of them cursing you Thinner, they'd be like, 'I curse you, Portillo.' I'll be honest with you, no one remembers movie Thinner. A and B, I probably, it's a great movie. The curse in a pie and he thinks his cheating **** wife's going to eat it and she does, but she eats it with the daughter who was cute and I was a kid so I can say that. Okay, so he, he kills his daughter and his cheating **** wife with the Thinner curse. Damn cheating wives, damn. I would probably think heavily about just keeping you as a captive and making money off of you. You would. 'Cause imagine how much bigger to do your bidding though. But no, see, there'd be long, there'd be a long explanation. I could, I mean, like I could see, you know, you're just like, 'So, all right, Nick, we know you, but there's nothing the sorceress has'",
            "start": 281.56
        },
        {
            "text": "bidding though. But no, see, there'd be long, there'd be a long explanation. I could, I mean, like I could see, you know, you're just like, 'So, all right, Nick, we know you, but there's nothing the sorceress has gone into the pie. She's gone.' What do you want to do? And I'd be like, as long, or this is me, I guess, now as the dog. So I'd be flipping, flipping the script. I'd be like, 'As long as you let me eat whatever you want, whatever I want, let's just go make YouTube videos. We can do this as long as you know you treat me like a person, I'll be all right.' So that's all you need, to be treated like a person. I mean, like, I'm going to make the best of a bad situation. Eventually, maybe I'll spell out in kibble, 'Kill me,' or you have at this point given me an iPad. You give me an iPad so I can actually do something, something I'll be able to tap out. So here's what I want to know. Yeah, so even after we find out, you know, that body swap happened, yeah, what do you, what do you do to the original body? So do we like put you a",
            "start": 321.8
        },
        {
            "text": "I'll be able to tap out. So here's what I want to know. Yeah, so even after we find out, you know, that body swap happened, yeah, what do you, what do you do to the original body? So do we like put you a mental, a mental institution or something? That's a really good one. You just kill it. Who? You're killing Portillo, the YouTube business, right? Yeah, so like permanent stream, permanent stream, just Portillo, Nick, human form. Put him in a room, keep a camera on that person. Oh my God, sounds crazy. What's crazy is I feel like, I feel like if we keep going down this rabbit hole, eventually Portillo would start to learn more, right? And then he would eventually, he's got my brain, right? Does he? I don't know. So do I have, do we have the dog's brain then? So we're, I think you got, I think you got to have, we're shorting out there, smoke pouring out of our head as we try to figure things out. But like at some point in in this story, if we were writing this as a movie, he would have to find love like a rich heiress that was like,",
            "start": 359.88
        },
        {
            "text": "there, smoke pouring out of our head as we try to figure things out. But like at some point in in this story, if we were writing this as a movie, he would have to find love like a rich heiress that was like, 'He's so perfect. Like he never talks and he just wants to be by my side all the time and he gives me the love my first husband never gave me.' So I'm just going to marry him and make him like my, and he like can carry stuff 'cause Portillo like rudimentary things, right? And like everything. He can't carry things. He's not a biped. Plus he's **** and pissing all over the place. Yeah, but he'll figure it out. No, he won't. You, I've only seen Portillo figure one thing out in my, like I've known Portillo for a long time, right? There's only one thing I've ever actively seen him learn. He's not learned anything since I've known him over these years except that he now thinks that boxes on this table are Bark Boxes, which proved to me, proved to me beyond a shadow of doubt that he has the capability of learning. He just",
            "start": 407.6
        },
        {
            "text": "known him over these years except that he now thinks that boxes on this table are Bark Boxes, which proved to me, proved to me beyond a shadow of doubt that he has the capability of learning. He just won't learn. He'll bark at that, he'll bark at that buzzer for the rest of his life. Well, the buzzer is terrifying. It comes out of nowhere. Yeah, but eventually he must know that like I yell at him every time he like, and he just doesn't, it just doesn't compute. But that **** Bark Box, that computed. He freaks out when there's a box on this table. Has nothing to do with him. So he, so he has the operant conditioning though, can learn classic conditioning. That's all it is. It, it is conditioned. But, but again, this, it's not because that is, but it's not that he can be conditioned. Yeah, there's no condition, there's no conditioning consistency at all because he literally doesn't learn anything else. He'll bark at that **** door forever. You know, I've said it before, I've lived with dogs that totally didn't freak out when",
            "start": 446.12
        },
        {
            "text": "consistency at all because he literally doesn't learn anything else. He'll bark at that **** door forever. You know, I've said it before, I've lived with dogs that totally didn't freak out when things happened. Like you can teach them. He just won't learn because he's too old and too dumb. Yep. But he's not dumb enough to know that the Bark Box is the thing that comes and he has toys in it. He remembers this. That's what I'm saying. All he thinks about. I'm saying if he knows that, he could, he could evolve to a place or learn to a place where he could carry some rich heiress's bags because if he was in my body, he'd be like, 'I mean, let's be honest.' Maybe just maybe Tim's body, he'd be like, women would be like, 'Let's just keep him around because he's cute,' right? So, and he would just carry stuff and that would be it. I end up with like Paris Hilton. Is that? No, more like a, like an old woman, like 80s. Okay. Oh my God. But she leaves boy toy. Is that what it is? This isn't your body. I mean, you're in that dog.",
            "start": 488.92
        },
        {
            "text": "be it. I end up with like Paris Hilton. Is that? No, more like a, like an old woman, like 80s. Okay. Oh my God. But she leaves boy toy. Is that what it is? This isn't your body. I mean, you're in that dog. You're in a dog's. So here's, here's, so I'm looking for some ladies to my tramps. Yes. Oh, you, I mean, hey, it's going to reach a point where I'm like, you don't have balls though. You don't even have balls. Do you keep your sex drive and testosterone based on what you had here? Yeah. Okay. Definitely. I would just kill myself if that happened to me. I would make, how long, how long do you give it? I would just not eat if I was in Portillo's body. I would just be like, 'No, I'm done.' A hunger strike. Finish hunger strike. Colin would go on a goddamn. I'm saying, how long do you give it before you throw in the towel? It's not immediate, right? You're going to try, be curious. Maybe a little bit. But I don't, I don't know. I mean, it was just like, if I had to be this dog, I would, it would be over. I couldn't, I couldn't do it because of",
            "start": 527.48
        },
        {
            "text": "right? You're going to try, be curious. Maybe a little bit. But I don't, I don't know. I mean, it was just like, if I had to be this dog, I would, it would be over. I couldn't, I couldn't do it because of how much ridicule I placed on the dog. People would now place ridicule on me. Can I, can I just throw a couple things out that are pro being the dog? One, you can go to the bathroom anywhere you want. It's a very liberating thing. It would be, it would be interesting just to stay alive long enough to be able to explore that a little bit. Just go out into that park and just drop a deuce wherever you wanted to, right? Kind of fascinating a little bit. Park. Yeah. Okay. You haven't lived in San Francisco long enough, Nick. You can do that. No, I, bums can do that. If you, if you, if you hit that level of heroin use, you can **** wherever you want. There's a, there's a consistent line on the Y-X axis between uh, heroin use and ****. And there's a correlation, the perfect 45 degree angle. Um, there's that and there's just the",
            "start": 574.96
        },
        {
            "text": "**** wherever you want. There's a, there's a consistent line on the Y-X axis between uh, heroin use and ****. And there's a correlation, the perfect 45 degree angle. Um, there's that and there's just the fact that also everything, everything tastes better. Everything. Like your, your sense of taste is amazing. So imagine what your sauce tastes like. You could make it though, huh? No, I mean, I have opposable thumbs. See, this is, this is, this is the problem. I mean, the one thing that I would love to do if I was Portillo would be, be totally normal. Like everyone thinks, 'Wa, Portillo is just an idiot,' right? So like, he's a lovable doof, but he's just a doof. He just sits on Greg's lap all day. Like he's Mr. Bigglesworth. And he, and and this what I'm telling Greg, it's any lap will do. Like for Portillo, like there's not even like he's most loyal to Greg, but any literally any lap will do happen. Uh, so it's not even like he's that fiercely loyal. What I would love to do is to be just Portillo, but like the door, like the",
            "start": 613.84
        },
        {
            "text": "like he's most loyal to Greg, but any literally any lap will do happen. Uh, so it's not even like he's that fiercely loyal. What I would love to do is to be just Portillo, but like the door, like the buzzer. And you just like, 'Whatever,' you know. Can you imagine calling Portillo? The buzzer goes off and he just looks at you and he just gives you that look like, 'Yeah, Greg, what?' Yeah. And there's actually, there's something in his eyes for the first time ever. Or the, or the like someone comes to the door and I just walk away. You don't care. That's when you would exciting. But then ultimately, pick me for a walk and I would just run into traffic. Oh my God. And that's how that would end. So here's, here's what I'm afraid of in the scenario if that were me. Yeah. Is like, you know how you were saying about like, you know, the having his brain? Like what if I would, I would start losing my like my humanity and I start becoming a dog? Yeah, maybe it might happen. And it's conceivable that might happen. It's also",
            "start": 658.8
        },
        {
            "text": "like, you know, the having his brain? Like what if I would, I would start losing my like my humanity and I start becoming a dog? Yeah, maybe it might happen. And it's conceivable that might happen. It's also conceivable that you might get smarter and then you could take over the world. 'Cause who would suspect a wiener dog? You'd only have two to three years left to, let's see, who would suspect this wiener dog to be able to take over the world? No, no, no, no, no. Look at that thing. Look at him. He just stares. Oh, he's staring at me. His eyes are so, what's funny is he just, he doesn't even look at you most of the time. He just kind of looks a little bit past you. It's because you're not even there in his mind. He's just thinking about the Bark Box. But I, I am an animated human being. I am a life form. And that shoe rack is more, is like way more interesting him than me. He's used to, he doesn't get to see the shoe rack from this perspective. No, it's not the shoe rack. It's that, uh, he way too much credit. Portillo is blind.",
            "start": 700.76
        },
        {
            "text": "is more, is like way more interesting him than me. He's used to, he doesn't get to see the shoe rack from this perspective. No, it's not the shoe rack. It's that, uh, he way too much credit. Portillo is blind as a bat. He's really blind. Is he? Yeah. Oh, yeah. So Nick, I like, I like your idea about the, the kibbles. Yeah, you know, spelling stuff. But like, take that out of it. Like you can't actually like write notes and you can't use all this like technology and stuff. You just need to do something like one of us. Like the, I like the Pit example of you playing as Pit in Smash Bros. That would tell us. What would we do though to be like, 'Yeah, that's definitely these people.' Turn on the Vita. It's one of them. Oh, I, if it was us and there was Portillo, we found him playing a like, 'Okay, it's either Greg or Colin,' right? It can be no one else in the entire world. Test number two is you. After that, you're like, 'It's one of them. Am I playing Minecraft or a crazy JRPG?' I was going to say, put a bottle of bourbon down and a chicken",
            "start": 744.72
        },
        {
            "text": "be no one else in the entire world. Test number two is you. After that, you're like, 'It's one of them. Am I playing Minecraft or a crazy JRPG?' I was going to say, put a bottle of bourbon down and a chicken winged out. Which go, Greg, it is Greg or it is Colin. Yeah, that's pretty good. I think for you, how we can tell it's you. Yeah, I instantly put a Coke. Oh, no, no. Okay. If a girl walks by and that dog just goes like, doesn't walk up to them, but just like double takes like four times, I'm like, 'That's Nick. I know that's Nick.' You got to get the full. No, you, you double take so uniquely. It is just such a, it's unsubtle. Yeah, unsubtle is one way to put it. It's unsubtle. It's a work of God. What about me for you? You'd be watching YouTube. If we came home watching YouTube, if if came home and all a sudden had a YouTube channel that had already subscribed to 15 other channels. I like this. It's got to be you. Can't watch you take a selfie or it's or it's like the camera's up and the iPhone's running and you're like panting.",
            "start": 791.24
        },
        {
            "text": "that had already subscribed to 15 other channels. I like this. It's got to be you. Can't watch you take a selfie or it's or it's like the camera's up and the iPhone's running and you're like panting rap. I like that. Like you're rapping something and we're like, 'Is that the beat from like, you know, some, I don't know, some cool rap?' I, I don't any hip hop songs. You almost had it. I almost had it. But Tim though, you can't watch YouTube though. Why? Because as a dog, I'm a dog. The dogs see so much faster with some with a, I guess, higher frame rate that the lines, it just look, do dogs see a higher frame rate? I don't know. It's not high. It's not, I don't know if it's higher frame rate that explain why Portillo like The Last of Us on running at 60 frames per second. If they were seeing, if they were seeing at a a a monitor, right? They don't see that image, that clear image. They see like a bunch of flashing images that are like really blurry that they can't. Sounds stupid. It's like, do you know, do you know whenever you have like",
            "start": 839.68
        },
        {
            "text": "they don't see that image, that clear image. They see like a bunch of flashing images that are like really blurry that they can't. Sounds stupid. It's like, do you know, do you know whenever you have like a old camera and you're filming CRT TV, it hurts, right? That's what dogs, that's what doggy. I'm going to trust you on this one. All right. Knows a lot about in their. I don't know. Yeah, so that's basically you would be so screwed. Basically, it's like, it's like like a dog. It's like whenever you have like this library, right? It's perfect and it's like you have all this time in the world to read it. But think your glasses break. Twilight. Classic Twilight sound. Yes, that's exactly it. Good topic. No loyalty my ass. Look at him. I pick him up and let him walk over to you. Came right back to me. I'm not saying he's, I said he's most loyal to you, but any lap will do. You know it's true. If you're not around, he falls in love. What would you want him to do if he's, he's a people person? He's, it's not to say there's not an",
            "start": 878.52
        },
        {
            "text": "said he's most loyal to you, but any lap will do. You know it's true. If you're not around, he falls in love. What would you want him to do if he's, he's a people person? He's, it's not to say there's not an order of operation. It's just to say that he'll, he would love anyone on death row, nonetheless, you know, or a corpse if if you can sit on them. Jesus, you sit on them. All right. Wow. Good topic. Yeah, it was a good topic.",
            "start": 920.64
        }
    ]
}