{
  "id": 493,
  "video_id": "ybvPeMo1pII",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Dave Fennoy"
  ],
  "title": "Dave Fennoy (Special Guest) - The GameOverGreggy Show Ep. 56",
  "description": "Special guest Dave Fennoy discusses the Sony Pictures terrorist hack regarding The Interview, Tim Gettys wants to know what really goes into voice acting, Colin Moriarty asks the group what their favorite cold cut meat is, and Greg Miller talks about the power of friendship.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
  "published_at": 1420185605,
  "duration": 6347,
  "transcript_chunks": [
    {
      "text": "What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts Greg Miller alongside the producer slash seducer Nick Scarpino. Hey everyone what's up? How much how are you? This is nice. This is way better than that table we usually podcast around here. Oh yeah I was going to get to that in a second here. If you're listening to the audio podcast things are happening here. If you're watching the video you're already putting it together. Over here in the pot on Long Island Colin Moriarty. No Jets getting that awesome draft pick. 3 and 13 3 and 1 whatever they are. Jesus. That sucks. Over here the PO and Tim Gettys. Let's him host. And then over here the man of the hour. One of my best friends in the world the man of a thousand voices Lee Everett himself Dave Fennoy. Hi kids. Dave we're at your house. This is my house. We're in the backyard. We're at the fire pit that I love to spend time at. And we're we're just talking about whatever we're going to be",
      "start": 0.0
    },
    {
      "text": "Fennoy. Hi kids. Dave we're at your house. This is my house. We're in the backyard. We're at the fire pit that I love to spend time at. And we're we're just talking about whatever we're going to be talking about. Whatever comes up. You're not the show rolls. Yeah. This is a topic by topic day by day show by show. Of course we're drinking out of Dave Fennoy coffee mugs. Not everybody. I've got a game over. GameOverGreggy. Cheated to the camera. I've got my GameOverGreggy cup. You can get those of course at kindafunny.com/store or you can get your Dave Fennoy mug over at DaveFennoy.com. I said it too. I said it together. Oh my God. Of course ladies and gentlemen if you didn't know this is The GameOverGreggy Show. And the idea is simple. Every week four sometimes five best friends gather on this fire pit. Each bring a random topic of discussion for your amusement. If you liked that like the video share it with your friends subscribe to our channel support us on",
      "start": 40.88
    },
    {
      "text": "friends gather on this fire pit. Each bring a random topic of discussion for your amusement. If you liked that like the video share it with your friends subscribe to our channel support us on patreon.com/kindafunny which allows for all these amazing trips like this to happen. This one. Wait wait wait. You said you guys are coming back every week to my fire pit. You did at dinner make the he made the bold claim at dinner. He's like yeah anytime you need to come down here. You can come every week. We appreciate that. I'm that kind of guy. Standup individual. Absolutely. That's why I'm going to sit down. Cause you know mess up the shot. Sure. It's yeah. Nick Scarpino's the producer slash producer. It's been a long time setting this up. It was a while. Yeah but it looks good. No it's not. It wasn't I didn't mean it. That wasn't enough. You did an excellent job. Thank you. You did a wonderful job. Thanks. I'm proud of you. I mean it took a long time to string all",
      "start": 86.72
    },
    {
      "text": "good. No it's not. It wasn't I didn't mean it. That wasn't enough. You did an excellent job. Thank you. You did a wonderful job. Thanks. I'm proud of you. I mean it took a long time to string all these lights back there. Every brick in this fire pit. This is not a real fire pit. This was a DIY show that happened this morning. Then the L.A. types. There's always something happening around here. Dave it's traditional in The GameOverGreggy Show that the guest goes first. What would you topic? Do you want to bring to your fire pit? Wow. You know there's so much uh we have uh cops killing people. We have now people killing cops. Uh we have movies being banned. It looks like Hollywood is now being run by Kim Jong and North Korea. Um uh let's let's start with that one. I mean what do you guys feel about the you know this movie getting banned? I'll get I don't like it. I don't like it. I'm going to say be careful. Great. Yeah I'm on top of this. We got some like rubber near",
      "start": 128.32
    },
    {
      "text": "you guys feel about the you know this movie getting banned? I'll get I don't like it. I don't like it. I'm going to say be careful. Great. Yeah I'm on top of this. We got some like rubber near some fire. This would be great if his feet caught on fire. Brand new Converse from the Converse. Nothing back can happen but uh back back to a serious matters. Right. Uh I'm sorry that Sony canceled the movie. I understand what happened. Uh the the movie theaters got scared. Uh when uh Kim Jong and his hackers uh said if you go into that theater we're going to have a 9/11 kind of situation. Um frankly they don't have planes that can get here. Sure. Uh so they wouldn't be flying but they've been threatening this country with annihilation for years and nobody's paid attention. Why do we pay attention now? Yeah. The movies are brought into it. They're fucking with America. You know that's the reason why it's like everyone knows who James Franco is. So it's like once he's",
      "start": 171.92
    },
    {
      "text": "Why do we pay attention now? Yeah. The movies are brought into it. They're fucking with America. You know that's the reason why it's like everyone knows who James Franco is. So it's like once he's a target of this then all of a sudden everyone's like Oh shit. Right. Well I think this is also the first time we've actually seen them do something right? It's usually been a lot of talk on will annihilate you. We have a bomb. We're going to do this that and the other thing but they actually hacked a major motion picture studio owned by Sony but in America right? It's owned by Japan but it's in America. This is a this is a pretty serious crime when you think about it. It's a huge crime. And uh and talking about that movie getting canceled uh mentioned before Sony isn't an American country uh company. It's a Japanese company. And it's been mentioned that maybe uh one of the reasons the movies were pulled uh was because there could be repercussions in Japan. Yeah. I",
      "start": 225.72
    },
    {
      "text": "country uh company. It's a Japanese company. And it's been mentioned that maybe uh one of the reasons the movies were pulled uh was because there could be repercussions in Japan. Yeah. I mean this is it's a worldwide thing right? And uh it's just interesting. Like let's let's clarify that the movie wasn't pulled per se. It is still an active film. They're still trying to figure out how they're going to distribute it. The theaters are the ones that actually decided we're going to not show it because of there's a threat and we want to be safe. We want to make sure the public the movie goer is safe. Can you imagine the lawsuits? I mean you know and and it sucks because we're coming off of not the heels but we do have it in recent memory of The Dark Knight shootings when that movie came out. And so people do want to feel safe in a movie theater. That is the one place you should be able to along with a lot of other places. You should feel safe as a movie. Walking down the",
      "start": 265.32
    },
    {
      "text": "movie came out. And so people do want to feel safe in a movie theater. That is the one place you should be able to along with a lot of other places. You should feel safe as a movie. Walking down the street walking through Walmart with a toy gun or being a 1 year old kid playing in a playground. I do find it interesting though and this is something we've touched on is that I wasn't aware really what The Interview was until all of this came out. Uh and obviously this movie this this specific topic has wide reaching repercussions right? It's not just about the movie getting pulled. I mean there was a seriously crippling effect that it had on Sony studios. People I was reading an article saying that they had to get handwritten checks to their employees because their entire accounting system was was messed up. Wow. I mean that's a lot a huge loss of revenue. You've got all the leaked emails you've got all the private correspondence that were happening. That really embarrassed",
      "start": 308.28
    },
    {
      "text": "system was was messed up. Wow. I mean that's a lot a huge loss of revenue. You've got all the leaked emails you've got all the private correspondence that were happening. That really embarrassed the hell out of Sony. Um and frankly uh seeing some of the emails and it's all this one was racist. This one's this one you know I think we all sometimes between friends you say things that maybe you wouldn't want the public to know that maybe really isn't that bad. You're joking around. Yeah. You joke around with each other. And um I don't think it's really it's it's it's not good. It makes them look bad. And I don't think they're as bad of people as these emails made them look like. I mean you think of the fucked up thing about all of it right? Is that it's such an invasion of privacy. And like when you can compare this to the Fappening when all the you know the nude selfies of all these celebrities right? Insights were like we won't run them. That's stolen property",
      "start": 350.76
    },
    {
      "text": "privacy. And like when you can compare this to the Fappening when all the you know the nude selfies of all these celebrities right? Insights were like we won't run them. That's stolen property yada yada yada. But now that involves movies and not sex and this that and the other. And there's all these juicy tidbits of them calling people you know Angelina Jolie's she's not that talented. She's a spoiled brat. Exactly. And then okay we now have oh wait a second. There were is not ours. 21 Jump Street might cross over with Men in Black. It's like all those rules fell away. And this is now it's okay to talk about all these different things. Yeah. I mean I feel like that's kind of an interesting issue in and of itself right? Let's unpack that for a second. Colin if you're I mean I prefer that we unpack as much as we can. I we all lead we have high stress lives. Like we're in production. Production comes with a certain amount of anxiety. And I think that sometimes",
      "start": 391.0
    },
    {
      "text": "I mean I prefer that we unpack as much as we can. I we all lead we have high stress lives. Like we're in production. Production comes with a certain amount of anxiety. And I think that sometimes you know you say things or you write things that maybe you don't necessarily mean generally but in the heat of the moment you just need to vent to someone. And so I don't know where everyone comes down on that right? Because there'll be multiple times when I'll pull Colin aside and be like I cannot stand Greg. The ego is too much. He's a prima donna. He screams constantly. It's gonna just blow his vocal cords out one day and then he's going to be useless to us. Just be a giant paperweight. We'll be able to just kind of drive the car like Kevin. Gelatinous paperweight. I don't know how I feel about that. I'm split on an issue because it's hard right? I mean these guys are taught executives at Sony they live a very stressful life. And they and sometimes you say things and then to",
      "start": 428.16
    },
    {
      "text": "I feel about that. I'm split on an issue because it's hard right? I mean these guys are taught executives at Sony they live a very stressful life. And they and sometimes you say things and then to have that what you thought was a private correspondence whether or not your opinion in it was warranted or not or it was crazy. That sucks. I mean that is just a really really damning and it's hard to come back from. I sympathize with these people. Everybody has said things and written things to people that they wouldn't want anybody else to know about. Right. And just imagine when you accidentally send an email or a text to the wrong person. We've all done that and it's like that sucks. But imagine whatever it is that you're saying. Imagine that showing up on Variety the next day. Like four pages of Reddit. It's like damn. I think it's such a complicated issue because like you were saying I think there is some geopolitical issues. Kevin don't take a picture of me when I blow my",
      "start": 467.76
    },
    {
      "text": "four pages of Reddit. It's like damn. I think it's such a complicated issue because like you were saying I think there is some geopolitical issues. Kevin don't take a picture of me when I blow my nose. In the sense that you know Japan and Korea obviously have a very sorted past with each other going back before the World War. Japan occupied Korea. Yeah. I mean Japan and Korea have been quarreling for a long time and obviously it really came to a head before World War II when Japan was occupying Korea for a while and really doing heinous things over there. And I think that generationally there's a lot of strife between those two countries. And for as much as we get threatened by North Korea Japan gets threatened just as much as a lot more and they can do something to them because they're right there. As well as Seoul South Korea being 30 miles from the Demilitarized Zone. So those two places not that Korea has anything you know South Korea has anything to do with Sony but",
      "start": 514.72
    },
    {
      "text": "right there. As well as Seoul South Korea being 30 miles from the Demilitarized Zone. So those two places not that Korea has anything you know South Korea has anything to do with Sony but there's just a lot of things to consider that aren't American or whatever. And you know for you know their weak MiG fighter jets and their Taepodong like missiles that are terrible and their joke nuclear bombs that they basically have can do a lot of damage to them. I'm not worried about California. I don't care. They're never going to get anything here but they can easily sneak a bomb over the border. So do you think a call came from the head of Sony in Japan to the head of Sony in America to look you're going to pull that movie? I think it's possible that even though Sony you know Sony Pictures is an American company that you know presumably their ties to Japan are still intimate. And I think that they just have a lot of things to consider. With that said I still think that it was",
      "start": 556.08
    },
    {
      "text": "is an American company that you know presumably their ties to Japan are still intimate. And I think that they just have a lot of things to consider. With that said I still think that it was the wrong move simply because... Let's clarify though because I think that they it was the studios I'm sorry the theaters that decided not to show the film. Sony was going to put the film out and the theaters all the four or five of the major six or four of the major five theater chains decided against it because of the threats. Sony I still think very much wants to put this movie out especially now. They want to get the movie. They wanted the movie. This is a very expensive film. This movie would probably do better than before all the controversy because now were you going to go see the movie? No I will now though. I'll definitely see it. They said they weren't going to put it out. Then Obama was like put it out. And now they're like oh we're looking into putting it out. So when it",
      "start": 592.68
    },
    {
      "text": "No I will now though. I'll definitely see it. They said they weren't going to put it out. Then Obama was like put it out. And now they're like oh we're looking into putting it out. So when it inevitably comes to on demand yeah I'll buy it for sure. Obama said put it out. Yeah. Obama said that they made a huge... He said they should have called him. And I think that you know I think one of the most prescient like interesting things that was said about the whole thing was from Mitt Romney actually who tweeted that like Sony should actually just put the movie out for free and then just solicit donations to something like Ebola research if you wanted to. Like so basically just put the movie out there and just say like fuck you to the terrorists. He'd be like everyone bought you for free. And then and then like it costs like $64 million to make. Well I was reading something on Grantland. Ebola hasn't been mentioned since the election. Exactly. Because well and it's",
      "start": 641.44
    },
    {
      "text": "you for free. And then and then like it costs like $64 million to make. Well I was reading something on Grantland. Ebola hasn't been mentioned since the election. Exactly. Because well and it's still ravaging you know Western Africa. Yeah. But I actually... It doesn't involve James Franco. But I was reading something really interesting where they were saying that the movie wasn't like they were saying that Sony could easily take a bath on this and be fine. That like for instance like when Disney made The Lone Ranger they took a bath on that that was literally six times more than this movie actually cost to make. So like and they're fine. So like the movie was expensive. I'm sure they want their money back. But they're saying like they can make a point by being like you know what fuck you. Because they need to do that for the actors that are going to work with them the people that still have things in production they need to show some balls. And I think that doing",
      "start": 678.4
    },
    {
      "text": "what fuck you. Because they need to do that for the actors that are going to work with them the people that still have things in production they need to show some balls. And I think that doing something like that would be awesome. We need to get our hackers to out hack their hackers. Yeah right. What's Anonymous doing? Anonymous says that they're going to put the movie out online. They say they've hacked the movie they've got it and they're gonna put it online. God bless the internet. And the cool thing to Obama's credit one of the things he said which is really cool everyone's like well the FBI is the one who figured out that these the hackers ties to North Korea even though they think it might have happened in China and there's all this kind of weird shit going on. Well their stuff has to go through China. Right exactly. So they were like we don't you know they were saying like it has all the signatures of something North Korea would do but that you know I",
      "start": 713.36
    },
    {
      "text": "their stuff has to go through China. Right exactly. So they were like we don't you know they were saying like it has all the signatures of something North Korea would do but that you know I guess they'll try and work on it. But what I liked was Obama was saying in the press conference they were like well how are we going to respond? And I like when we have when we like show our balls in America and he's like we'll respond at the place and time of our choosing you know like how we want to respond. We're not going to worry about that. We're going to send him Dennis Rodman back again. He's going right back to them. Deal with him next. Yeah Dennis Rodman goes to Pyongyang and then they revoke his his passport and he's just stuck there and it's like have fun. Done. That's crazy though. This year. That would be punishment enough for North Korea. Oh you're stuck with him now. I feel like this year there's been more leaked stuff than in the history of ever. It's been",
      "start": 748.44
    },
    {
      "text": "crazy though. This year. That would be punishment enough for North Korea. Oh you're stuck with him now. I feel like this year there's been more leaked stuff than in the history of ever. It's been activities going on. Is that it? There's just that there's so much more on the internet. Yeah. We should be very afraid of like what hackers can do to government infrastructures bank infrastructures and stuff like that. Like I think we've just seen the beginning of like the destruction that can happen digitally. Not to mention the infrastructure of power electricity water. All those things are on computer now. Right. It's scary. We shouldn't talk about it. What's crazy is I've been very well known. I've been catching up on The Walking Dead. Maybe you've heard of that that that small franchise. And I've been having these weird weird dreams about like losing power losing water like civilization breaking down. So like you're hitting you're hitting a nerve here Dave. Well you you",
      "start": 784.16
    },
    {
      "text": "And I've been having these weird weird dreams about like losing power losing water like civilization breaking down. So like you're hitting you're hitting a nerve here Dave. Well you you you missed it. When we when we flipped the calendar over to 2000 you remember that? Oh the Y2K. And the Y2K and everybody was talking about Oh man everything's going to shut down. Planes will fall from the sky. And of course they sold a bunch of books. A lot of people made money and nothing happened. Yeah. I remember I remember waiting. I remember being in my room on my computer my Sony VAIO at the time and like waiting for everything to just be and nothing happened. I remember though when you guys you guys aren't from the East Coast but this is a big story. You might remember it. I think it was summer 2004 when the power went out from like Quebec and Ontario all the way down to like Florida and like the the Gulf Coast. And it was out for like four days. You guys you guys don't",
      "start": 825.92
    },
    {
      "text": "it was summer 2004 when the power went out from like Quebec and Ontario all the way down to like Florida and like the the Gulf Coast. And it was out for like four days. You guys you guys don't remember? It was like a big deal. And like I remember like I remember the iconic shot of New York having no power. Everybody walking across the yeah. Yeah. My brother was working. I remember when that happened 9/11 was still very fresh in our minds and everyone was like Oh shit. Like they hit they somehow hit. Like I think it was like something in the Great Lakes like where we get all our power from in there. They assumed that you know that was just something that happened like a malfunction that took four days for them to repair. Oh you know like like imagine in the middle of the summer it sucked. It was actually a computer for four days man. I was 2001. I was just drunk the entire time basically at my friend's pool but a lot of people were really suffering. I'm telling you",
      "start": 866.28
    },
    {
      "text": "it sucked. It was actually a computer for four days man. I was 2001. I was just drunk the entire time basically at my friend's pool but a lot of people were really suffering. I'm telling you right now that we had Stormpocalypse. What were they called? Apocalypse Stormpocalypse. Oh yeah. The thing that happened just last week. Yeah. The thing they're like we're going to get 3000 inches of rain. And then it was like a light like the rain yesterday. It was a light drizzle at best. It was bad but it was not nearly as well. It depends on where you were because there were places that washed out. There are some houses here that the Hills washed down and those houses are done now. So great. Move your mic. Move your mic more centered. I'm losing you when you go over there. Well I know but I was trying not to do that. So just move it towards the zipper. We'll wait. Thank you. Thanks for reading. My point with that was I know where to place it. And I told him before that's going to happen",
      "start": 901.32
    },
    {
      "text": "trying not to do that. So just move it towards the zipper. We'll wait. Thank you. Thanks for reading. My point with that was I know where to place it. And I told him before that's going to happen he just so lost in the camera and Kevin's good looks. Kevin is a good man. Thank goodness. I'm sitting between you two. We might make out. We're going to kill each other one day. We lost power in my neighborhood for like seven hours. And my wife and I because I was staying home that morning to kind of help out. Cause I was like we don't have power. What are we going to do? Did not know what to do with ourselves. She had it. Luckily she had this thing called a book like paper pages but she was like I have to sit by the window. No power. No she didn't know what to do. She made me stay home for 30 extra minutes the morning to charge our iPad mini in my car. How could you forget to charge your iPad mini? And I was like that's a great point. I don't know. I charged everything the night",
      "start": 940.12
    },
    {
      "text": "for 30 extra minutes the morning to charge our iPad mini in my car. How could you forget to charge your iPad mini? And I was like that's a great point. I don't know. I charged everything the night before. Exactly. When it was coming I was getting ready. I forgot about that trick. You should have been charging her. If you can figure out a way to make that work I'll pay you money. I'll give you a great ROI. I don't like where that's going. That can be so misinterpreted. Already has been. That's very true. No you know the other part of the issue going back to the Sony stuff is is putting out the movies online. I feel like you were asking like how do we stop this? Right? I think same with the Fappening right? Is it you just don't look at the stuff like don't download it. Don't when the movie comes back out and it's available pay for it. If you want to watch it that's just the way it should go. Yeah. I mean I'm going to do a lot of people that worked on that film and it's not",
      "start": 992.52
    },
    {
      "text": "the movie comes back out and it's available pay for it. If you want to watch it that's just the way it should go. Yeah. I mean, I know a lot of people that worked on that film and it's not their fault. Like none of this is their fault. You know, sure. Some of the actors, the leads are catching hell for the people that may have written it or directed or catching hell for it. But what about the guys that, what about the DP? Like, you know, Sean's friend shot it. Yeah. What does he like? He doesn't get to go see his movie in the theater. There was a Reddit post about it where it was a girl who was like, Hey, my brother's big break was playing Kim Jong Un in this movie. And it's like, now that's not even happening. You know what I mean? He'll never work again. I'm guys box office poison. Yeah. It was a crappy situation. I was surprised. I was surprised they pulled it. That was my thing in the beginning. I really thought that people would be like, okay, go fuck yourself. Once",
      "start": 1037.0
    },
    {
      "text": "poison. Yeah. It was a crappy situation. I was surprised. I was surprised they pulled it. That was my thing in the beginning. I really thought that people would be like, okay, go fuck yourself. Once, once the threat was made, I thought about how many lawyers there are in America. And I just knew that it was going to be pulled because can you imagine it wouldn't even have to be something that happened from them. Some other idiot could do something. One person dies and that family owns Sony Studios. So. Tough situation. It's tough. It's a lot of you want to make sense that the thing I think about the most with this is that a we're going to look back on this and be like, remember when that happened? Like this is really one of those things that you're going to remember the rest of your life. Cause it's a pretty big deal. Like a studio got hacked and a movie got pulled. It was a whole geopolitical fucking rigmarole as it were, whole, this whole situation involved governments and things that",
      "start": 1071.4
    },
    {
      "text": "it's a pretty big deal. Like a studio got hacked and a movie got pulled. It was a whole geopolitical fucking rigmarole as it were, whole, this whole situation involved governments and things that shouldn't be involved in something like satire. And the second thing I think about, and I think about it a lot since it happened, is I hope that this doesn't happen to companies that really have shit, you know, because like I think about the amount of cyber technology and cyber defense or whatever that like comp like banks and all of these companies have. And man, like some of these, if one of these guys targets, well, guess what? Banks are being targeted all the time. And one of the problems with Sony is Sony was told months before that their security, their online security was lax and they needed to up their game. And they decided it costs too much money. This may have been preventable. Yeah. It's unfortunate. And it's, it's, it's so ironic, even though they're separate companies under the",
      "start": 1118.68
    },
    {
      "text": "to up their game. And they decided it costs too much money. This may have been preventable. Yeah. It's unfortunate. And it's, it's, it's so ironic, even though they're separate companies under the same umbrella, that happened to PlayStation in 2011. PlayStation got destroyed for like six weeks. They took PlayStation Network down because of what happens. So it's just, it's just, even though they're separate companies, it's just weird that it's the same. You don't hear this happening to other multinational electronics corporations, you know, like you really don't. It's just, it's just weird. It's just, it's a sad and unfortunate situation. I think it's, but I think it's telling that everyone needs to be a little more cognizant of what these guys can do. And I'm not talking only about the North Korean hackers. I'm talking about hackers all over the world. Right. I thought we had, there was a cautionary tale and I believe it was the best Die Hard, but I remember that, I remember a Die Hard",
      "start": 1157.48
    },
    {
      "text": "Korean hackers. I'm talking about hackers all over the world. Right. I thought we had, there was a cautionary tale and I believe it was the best Die Hard, but I remember that, I remember a Die Hard with the fire sale. They, they warned about these hackers coming. They can remember this, this is a dynamite one and it's got Justin Long. Live Free or Die Hard. Justin Long was in it. It is not the best Die Hard. No, that was the second to last one. The last one was the one with Jai Courtney. Oh no, that was the one where he defeated a fighter plane with a truck. Yes. Classic scene. It's that and then the scene where, uh, Rhett Butler says, frankly, my dear, I don't give a damn. Those two scenes, Rosebud, you know, all that stuff. No. Uh, what are you talking about a fire sale for? Cause there was something with the hackers. They were going to fire sale. I thought we should have, from there, it seemed like I watched that movie and I was like, well, don't let that happen. We need to stop that.",
      "start": 1197.32
    },
    {
      "text": "something with the hackers. They were going to fire sale. I thought we should have, from there, it seemed like I watched that movie and I was like, well, don't let that happen. We need to stop that. Haters gotta hate, hackers gotta hack. It's true. It's true. It's very true. Bakers gonna bake. All that stuff. Okay. Yeah. Tracy, you can use that if you want. Tim. Yes. They had a Beyoncé for him. What's your topic? So my topic, it's very appropriate for our guests here, is voice acting. Oh, so Dave from DaveFenoy.com. There you go. There you go. I'm not drinking out of the cup, Dave. Sorry. God damn it, Nick. So I'm really interested in this because it's obviously a really big part of our lives, whether or not people realize it. Like people watch a lot of cartoons, a lot of play a lot of games. Like voice acting is everywhere. Commercials, all this stuff. And I don't think until you understand what goes into it, I don't think anyone knows what goes into it. Cause I feel like most people",
      "start": 1240.12
    },
    {
      "text": "Like voice acting is everywhere. Commercials, all this stuff. And I don't think until you understand what goes into it, I don't think anyone knows what goes into it. Cause I feel like most people would think you just go and you read off of a piece of paper and that's it. And it's like, oh, you're just getting paid to talk. That can't be hard. Oh, my husband does funny voices. He always thinks about doing that. I get that all the time. Uh, at least once a week, somebody, oh, Hey, wow. Oh, voice acting. Well, you know, uh, I can read, I talk every day. How do I get into that? And, uh, one, you're like, for $500 at DaveFenoy.com, I can teach you how to get into it. Actually. I do do some teaching, uh, I guess teach up at Voice Trax San Francisco and I'm going to be teaching for, uh, Terri Berlin, who's a casting director down here and doing some private lessons. Uh, but you really have to be an actor. You really have to have a sense of, uh, taking, I call it taking the words off the",
      "start": 1288.04
    },
    {
      "text": "Terri Berlin, who's a casting director down here and doing some private lessons. Uh, but you really have to be an actor. You really have to have a sense of, uh, taking, I call it taking the words off the page, uh, because there's a thing and you'll notice actors when they're good actors and they pick up a piece of paper on camera and they're supposed to be ready. And it sounds like they're reading it like this because that's how most people read. Most people don't read like I'm just talking to you. Right. And the idea is you're taking somebody else's words. You're filtering them through you and delivering that message as if it were you or the particular character you're playing. That is awesome. So then it's, it's for your, what was your, where did you start on this journey? You said you had to be an actor first. Did you go in thinking I'm going to be just an actor? No, well my journey, my journey was like with most things. Um, my training really started as a child. I didn't know that's",
      "start": 1327.32
    },
    {
      "text": "to be an actor first. Did you go in thinking I'm going to be just an actor? No, well my journey, my journey was like with most things. Um, my training really started as a child. I didn't know that's what I was training for, but, uh, I was a child actor. I grew up in Cleveland, Ohio, and there's a community theater there, Karamu House, and my parents wanted to expose me to many things. So I went to Karamu and I took modern dance and I took music and I took theater, and I acted in a number of plays as a child there. When I went to high school at Hawken School for Boys, hi guys. Shout out Hawken. Um, I was, the fighting hawks. I was, uh, that's what the Hawks, you know, red and gray all the way. Um, I was president of the Theater Society and, you know, we did plays. I directed some plays and whatnot, but I also started playing music at the same time. I went off to college, uh, as a theater major, but I quit after a year and a half, went on the road playing music, man. Um, and then I",
      "start": 1377.64
    },
    {
      "text": "and whatnot, but I also started playing music at the same time. I went off to college, uh, as a theater major, but I quit after a year and a half, went on the road playing music, man. Um, and then I went back to school, uh, for music and I thought I was going to grow up to be a rock and roll star. I was writing songs and singing. Uh, that didn't happen. I wanted to stay close to music, so I went into radio. I became a disc jockey. Uh, you have good radio voice. And I was a disc jockey in San Francisco. I worked under the name Billy David Ocean at, uh, several stations, including, uh, KDIA, The Boss of the Bay, and KSOL 107.7, KSOL, More Music, KSOL. Uh, back up for a second. Why did you go under that pseudonym? Well, when, when, uh, when they hired me at KSOL, that was, I worked there a couple of times when they hired me, um, the day I was going to go on, he said, well, look, you know, we have Dave Padilla, who's still doing news on KCBS in San Francisco and still very good friend of",
      "start": 1426.84
    },
    {
      "text": "of times when they hired me, um, the day I was going to go on, he said, well, look, you know, we have Dave Padilla, who's still doing news on KCBS in San Francisco and still very good friend of mine, and Dave Gilton, who would be a really good friend of mine if I knew where he was and we were in contact. If we hadn't completely lost touch, he'd be a great friend. But Dave Gilton and Dave Padilla were doing news on the station and the program director Marvin Robinson told me, look, the last thing in the world we need is another Dave or David on this station. So, um, I kept coming up with names. He kept shooting them down. And just before I drove to the station to do my very first shift overnight, he said, I got the name for you, Billy Ocean. So I went on this and I'm a 107.7 KSOL. Hi, I'm a, what is it? Oh yeah, Billy Ocean. And, um, that was my first couple of times, uh, with that name. And then a few months later, the singer Billy Ocean came out with Caribbean Queen and I kept getting",
      "start": 1479.88
    },
    {
      "text": "what is it? Oh yeah, Billy Ocean. And, um, that was my first couple of times, uh, with that name. And then a few months later, the singer Billy Ocean came out with Caribbean Queen and I kept getting that call. You got to stop me. Otherwise you get the copyright strike. Another bar, we would have been in trouble, but I would get the call from the, yo dude, uh, you got a hit record out. Why are you still on the radio? And I said, no, no, my name's, it's another guy named Billy Ocean. Right. You guys have the same name. How did that happen? I'm so what's your name? Fred Johnson. Well, Fred, do you think someplace on the planet there might be another Fred Johnson? Um, so to avoid more calls like that, I, uh, added David, Billy David Ocean in there. And for the rest of my career in the Bay Area, I was Billy David Ocean. What names did you want though? Which ones did they say? You know what? I don't even remember the names I wanted, but they were probably equally corny. So was it that, I",
      "start": 1527.0
    },
    {
      "text": "I was Billy David Ocean. What names did you want though? Which ones did they say? You know what? I don't even remember the names I wanted, but they were probably equally corny. So was it that, I mean, so doing that on radio and like doing that so much and talking and talking and talking, is that when you were like, I should do voice acting? Well, you know what? I kind of discovered it was kind of a forest for the trees kind of a thing. Uh, you hear voices all the time and you could actually go through life and never think about being a voice actor because, uh, voice acting is so omnipresent. It doesn't really stand out to you until you're like, oh, wow, I guess everybody that's voicing something on television or radio or on the phone or in my car or on the internet is getting paid to do that. Um, and I knew that at some point I wasn't gonna want to spin hits for teeny boppers anymore. Um, and a friend of mine, uh, he was leaving the radio station one day and he'd go, hey, where are",
      "start": 1587.08
    },
    {
      "text": "that. Um, and I knew that at some point I wasn't gonna want to spin hits for teeny boppers anymore. Um, and a friend of mine, uh, he was leaving the radio station one day and he'd go, hey, where are you going? And he said, well, I'm going over to the city. We were in Berkeley. I'm going over to the city to, uh, you know, do some voiceover. I actually make more money doing that than I do on the radio. And that kind of, you know, that was the light bulb. I didn't do any, and that was early, early in my radio career. I really didn't do anything about it for a couple of years. And, uh, but by the end of the eighties, you were all children, man, uh, by the end of the eighties, uh, the two was coming out. Things were happening, you know, by the end of the eighties, I decided, you know what? Uh, it would be fun to be doing cartoons and TV promos and that kind of stuff. And I started taking some classes and, uh, I made up my mind that as soon as I made as much money in voiceover as I was",
      "start": 1634.44
    },
    {
      "text": "Uh, it would be fun to be doing cartoons and TV promos and that kind of stuff. And I started taking some classes and, uh, I made up my mind that as soon as I made as much money in voiceover as I was making in radio, I was going to dump radio and move into voiceover. Uh, KSOL, however, had another plan for me. Um, in February 1990, uh, they fired the whole staff, which happens a lot in radio. As a matter of fact, if you are in radio and you haven't been fired, you're not really in radio. But I had taken some classes before and, uh, with an agent from down here in LA and she said, look, if you ever want to come to LA, we'd love to represent you. I didn't realize what a blessing that was, uh, at the time, because that's one of the toughest things to do in voiceover is get representation. So I called her up after I'd been fired saying, well, uh, were you serious? She said, sure, uh, put together a new demo tape and come on down. So for almost a year, uh, cause I was married at the time,",
      "start": 1681.48
    },
    {
      "text": "I called her up after I'd been fired saying, well, uh, were you serious? She said, sure, uh, put together a new demo tape and come on down. So for almost a year, uh, cause I was married at the time, uh, had a kid, uh, for almost a year, I would drive down to LA on, you know, a Sunday night or Monday morning, audition and drive back on a Friday evening or Saturday morning. That's hell in your car. Yeah. I stayed a lot of miles. In your relationship. I was just thinking about the car. There's a lot of gas money right there. Priorities. Uh, I stayed for a month on a buddy of mine's couch. I stayed for another month on, uh, my uncle's couch. Uh, finally got a place, uh, with another voice actor from, uh, Northern California. Uh, it was trying to do the same thing. Um, and after about a year, I was able to move my family down and, uh, buy a little house in Pasadena and, um, things, uh, kind of took off. That's awesome. Without giving away, like the tricks, what does a class for voice",
      "start": 1735.4
    },
    {
      "text": "I was able to move my family down and, uh, buy a little house in Pasadena and, um, things, uh, kind of took off. That's awesome. Without giving away, like the tricks, what does a class for voice acting look like and what do you even teach them? Like, how does that happen? Well, what you're trying to teach them is, is, um, how to, how to make the words their own, how to get away from a reedy sound. Uh, most people have a hard time, uh, taking, reading words here, but touching people here and here. Um, a lot of people, uh, having spent a lot of time in radio, you learn a bad habit of making the words sound good by your inflection of voice. So you're doing things like this all the time. What's up everybody? What's up everybody? Welcome to the game. You're, you're, you're reading really bad copy. You got phone numbers and directions to give and price points and so you're, you're doing that kind of thing and, and that's not how people talk. That's not who people believe. So, uh, you want",
      "start": 1787.88
    },
    {
      "text": "copy. You got phone numbers and directions to give and price points and so you're, you're doing that kind of thing and, and that's not how people talk. That's not who people believe. So, uh, you want to pull away from that and get closer to, you know, who are you as a real human being or who, who are you as the character, uh, that you're playing. Is that true for commercial stuff too though? Absolutely. Really? When you think about the commercial voices you hear, you connect with those voices in one way or another. Sometimes even if you don't like them, it's a connection because... Flo from GEICO. You don't like Flo? No, I like Flo. Come on. But it was in the beginning I didn't like Flo. When she first came around, she was a little bit annoying and now I love her. Yeah. Now she's more of a family. I don't like these commercials where she's all in all the different makeup, like she's doing the Eddie Murphy thing. Yeah, a little bit. No, not a fan. And those are not my favorite Flo",
      "start": 1852.52
    },
    {
      "text": "of a family. I don't like these commercials where she's all in all the different makeup, like she's doing the Eddie Murphy thing. Yeah, a little bit. No, not a fan. And those are not my favorite Flo commercials, but I love Flo. And by the way, she is the wealthiest, best paid, uh, commercial spokesperson out there. Yeah. Uh, to the tune of millions and, and because she's very effective. There's something that we relate to with Flo. Um, she's smoking hot. She's smoking hot. Well, that's, that's not one of the things I would say. She's a reasonably attractive lady. Well, that's the thing. Like, I feel like that's, that's good casting, right? That's someone that came in and said, she's the every woman. This person's very relatable. She's cute. And she's funny. And she's funny. Yeah. Yeah. I'm a big fan of the AT&T girl. Oh, she's from YouTube. She's from YouTube and she's, I like her, Milana. Oh yeah. And she's once again, she's just kind of a natural, everyday kind of a person that you",
      "start": 1893.4
    },
    {
      "text": "can relate to. Uh, you know, sometimes being too beautiful isn't what's going to work. I like the guy who plays the football player in every commercial. Um, his name's Peyton Manning. Got him. But he's really good at commercials. Papa John's is not good at commercials. Papa John needs to stop doing commercials. He's awesome with Peyton. So what were some of your earliest gigs? Like what kind of gigs were you getting early? Well, the first gig I got, I was still in San Francisco. I had just gotten an agent and I, uh, auditioned for the California Lottery. And, uh, I got that gig and it was early in the, when, when the California Lottery just began. Uh, so I was very excited about that. I used to be the voice up there of, uh, Marine World Africa USA, every concert in the summer, all their",
      "start": 1935.72
    },
    {
      "text": "in the, when, when the California Lottery just began. Uh, so I was very excited about that. I used to be the voice up there of, uh, Marine World Africa USA, every concert in the summer, all their concerts. Uh, and I did a commercial. I still have, still some of my best work, uh, Marine World Africa USA. Uh, it was, it was just about visiting the place and it was kind of, uh, come to Marine World Africa USA. And it was beautiful spot, beautiful spot. Uh, as a matter of fact, I won a Jumbotron, a Jumbo Prawn Award for that. Well, I forgot about that. What's a Jumbo Prawn Award. I don't know if they still have it, but there used to be an advertising award in San Francisco and the advertising community called the Jumbo Prawn. And, uh, I won a Jumbo Prawn Award for that Marine World Africa USA commercial. Um, and, but it was kind of a, a funny award show because even though you were nominated to one, you had to pay to go and you had to pay for your award. So, uh, I never went to the",
      "start": 1988.6
    },
    {
      "text": "USA commercial. Um, and, but it was kind of a, a funny award show because even though you were nominated to one, you had to pay to go and you had to pay for your award. So, uh, I never went to the award show and I never picked up my Jumbo Prawn Award, but someplace it's out there. So can we start a Kickstarter right now to get him his Jumbo Prawn Award. Definitely. We need to be talking here. What do we need to come up with? And that's from like 1989. Oh man. It's gonna be like interest on that thing. Yeah. It's a lot. So what, what are like, I think I know the answer to at least one of them, I would think, but what, what are some of your like most memorable or your favorite gigs that you've gotten? Like the ones that you really, really stick with being the Hulu Guy for seven years, uh, was a gas and, uh, funny story how the gig got, I got the gig got gotten, um, I have an agent and actually have several agents all over the country, but I was at a party and guy sitting next to me",
      "start": 2046.52
    },
    {
      "text": "was a gas and, uh, funny story how the gig got, I got the gig got gotten, um, I have an agent and actually have several agents all over the country, but I was at a party and guy sitting next to me and, uh, he actually wanted to be talking to this girl who wasn't interested in him. So you're the next best thing. I was the next best. Well, I was right there. So I said, Hey, how are you doing? What's your name? And I said, Oh, Dave, what do you do? I do voiceover for a living. Oh, well, you know, I'm producer and there's this new thing called Hulu and they're looking for a voice. Why don't you give me your email and you know, you never know. And a week later I was a Hulu Guy. That's awesome. That's awesome. Fast that can happen for me. Like you talked to a second ago about, you know, like people taking voiceover for granted. And I remember when Job from Telltale was trying to hook us up and he's like, Oh, he's the voice of Lee Everett. It's going to be this great character. You need to",
      "start": 2089.88
    },
    {
      "text": "people taking voiceover for granted. And I remember when Job from Telltale was trying to hook us up and he's like, Oh, he's the voice of Lee Everett. It's going to be this great character. You need to meet him. He's also the Hulu Guy. And I was like, what the fuck is the Hulu Guy? And he's like, Oh, do you watch Hulu? I'm like, yeah. And he's like, this commercial is brought to you with Hulu. That's the, he's that's him. He does that. And I was like, Oh, it's like it all clicked in a place like that. I guess that is one guy's voice that does that all the time. That is a legendary voice. Never, ever. And like, you know, that was the very start of Up at Noon and everything we were doing on IGN and that, and like, for me, that was when I really for everything started connecting the dots and like, all of a sudden you kept hearing about Nolan North and Troy Baker and all these different people. And it's interesting. I don't know how you feel. I feel like there's been this decided movement",
      "start": 2138.6
    },
    {
      "text": "like all of a sudden you kept hearing about Nolan North and Troy Baker and all these different people. And it's interesting. I don't know how you feel. I feel like there's been this decided movement where like now video games in particular, cause that's what we cover all the time. And even cartoons are celebrating the actors behind that. And I guess it's the fact that the internet gives you guys a platform and an ability. Well, I think it's more than just the internet giving you a platform because you've had cartoon voices have been heroic for a long time and conventions and whatnot. They've been going voice actors in video games are just beginning to get that kind of notoriety partially because the industry is so young. You're really starting. You're really talking about an industry with voice actors that started in the mid-nineties. So that's fairly young, but as and because video game companies used to, you know, ah, we need a male voice. You come here. We need an old guy. Is",
      "start": 2175.88
    },
    {
      "text": "with voice actors that started in the mid-nineties. So that's fairly young but as and because video game companies used to, you know, ah, we need a male voice. You come here. We need an old guy. Is your dad retired? We need a gal. Get the secretary in here. Um, that used to be the way they did it. But as, uh, gamers have become more sophisticated and and in their desires for entertainment, what kind of entertainment they want, they've started hiring better actors. Hence Troy Baker, Nolan North, uh, Jennifer Hale, uh, myself. And and and there's way too many actors. I'm not mentioning it. They're going to be pissed off that I didn't mention their name. Ashley Johnson's punching her hat right now. But, uh, but also just like, just like movie stars and TV stars, the voice actors who portray the characters that you love and hate in video games, uh, you become interested. Well, who is that? Who is it? So, uh, so despite the fact that I think a lot of producers of games never wanted",
      "start": 2218.6
    },
    {
      "text": "the characters that you love and hate in video games, uh, you become interested. Well, who is that? Who is it? So, uh, so despite the fact that I think a lot of producers of games never wanted voice actors to have the notoriety that we're beginning to have, because I really think we're just at the beginning of it. Uh, we are getting that notoriety now and, um, soon, I think we'll have residuals and all those kinds of things. And, uh, I've been, you said something to me the first time we met after the show, you said, well, you know, you can retire now and just do conventions. Well, I can't quite, but it's close, but I've been doing conventions and, uh, hopefully I'll be able to, uh, I don't know if I want to do one a month, but do more and get out and meet the fans. And I'm amazed at the interest fans have in meeting me. Um, Melissa and I, uh, who plays Clem, Melissa Hutchinson, uh, Game Over Show alum. Yeah. We were at a convention and this young lady, she had to be 17, 18 came. She",
      "start": 2270.76
    },
    {
      "text": "interest fans have in meeting me. Um, Melissa and I, uh, who plays Clem, Melissa Hutchinson, uh, Game Over Show alum. Yeah. We were at a convention and this young lady, she had to be 17, 18 came. She wanted to take a picture with us. We get her, sign the autograph and she came around the table and stood between us. I put my hand on her back and she was shivering because to her, we were such celebrities and I'm like, Oh, you know, I put my pants on one leg at a time, just like everybody else. Uh, but it, it lets you know how much, uh, that performance affected her and how much she views us like TV stars, movie stars. Well, that's my favorite part of being in the place we are now where we get to interact with all these different voice actors is like, you're saying it's, it's so new that none of you understand how big of a deal you are. Cause I remember this Rob Paulsen, he sat there. I'll never forget this for Comic-Con two years ago. They're like, Oh, I'm like, they're sitting me",
      "start": 2324.04
    },
    {
      "text": "none of you understand how big of a deal you are. Cause I remember this Rob Paulsen, he sat there. I'll never forget this for Comic-Con two years ago. They're like, Oh, I'm like, they're sitting me there. I did some interview, somebody, they left somebody else, blah, blah, blah. People are coming in all day. And they are next steps, the Ninja Turtles. And I went, what do you mean the Ninja Turtles? And they're like the cartoon cast coming up and we're like, Oh, who's in it. And they were like, Oh, it's, you know, Sean Astin. I'm like, Oh, all right, Rudy. And then it's, it's this girl. Who's that? You remember Bland from Arrested Development? I'm like, Oh yeah. And then like Rob Paulsen. And I'm like, who's Rob Paulsen. And they're like, Oh, he was Donatello in the original, or he was Raphael in the original. And now he's Donatello on this. And I'm like, all right, that's cool. And we're sitting there and we're talking about the job. And in the middle of the interview, Paulsen goes",
      "start": 2376.76
    },
    {
      "text": "in the original. And now he's Donatello on this. And I'm like, all right, that's cool. And we're sitting there and we're talking about the job. And in the middle of the interview, Paulsen goes, yeah, well, we just come off doing Animaniacs. And if you watch the video, you seem to be like, and like all the gears clicking. I'm like, that's fucking Yakko. That's I'm talking to Yakko. This is Yakko. And so like afterwards I had two seconds with them. Like you have to come up and you have to come up and he's like, yeah, sure. And so we brought him up for Up at Noon and his flight got delayed of course, cause of San Francisco being foggy and he got there late, but we had like, I was like, just tell me what we want. We got him food and he's sitting there and he's eating food out of a box. He's like, you guys are treating me like a rock star. This is awesome. I'm like a fucking Yakko. You're a rock star. You know, and Rob is a great, great, great, great guy. And they do Animaniacs shows now",
      "start": 2414.2
    },
    {
      "text": "like, you guys are treating me like a rock star. This is awesome. I'm like a fucking Yakko. You're a rock star. You know, and Rob is a great, great, great, great guy. And they do Animaniacs shows now where they do performances and have orchestras and they're singing and having a great time. And it's very popular. Yeah. And I love and I love that. That's all. I think the fact that we've all, we've all grown up now. You know what I mean? To where we're like, yeah, I will totally, I will pay to meet you. I will pay to go see you guys do this live. Not only that, but like we've grown up with animation and video games is a huge part of our lives and who we are. Right. Yeah. And so there's no reason why we can't sort of demand that higher level of talent and storytelling in both those mediums. Um, largely I think it's almost a shame too, cause I'll watch a lot of anime and stuff and I can't tell you how many times I've watched something and like, Oh shit, that's Troy. That guy, that the",
      "start": 2449.24
    },
    {
      "text": "Um, largely I think it's almost a shame too, cause I'll watch a lot of anime and stuff and I can't tell you how many times I've watched something and like, Oh shit, that's Troy. That guy, that the Joker and you know, everything now is Troy. And I'm like, God, he's so good. But you don't, it sucks a lot, especially for the VO guys. Cause you guys don't get the face associated with the voice. Right. And so there is, that's changing though. I hope so. Because are you going to do anything? I don't do a lot of mocap and I'm not sure that I ever will. I'll tell you why a mocap is changing. It used to be, uh, you know, they put you in this suit and they shoot you and they still do that with most voice actors. But, uh, there's a new trend now where they hired you to do the voice acting and they hire a dancer acrobat to do the mocap, especially on things where they want to have a lot of action. You're jumping off buildings and tumbling and turning and whatnot. Then, uh, they'll just get",
      "start": 2493.4
    },
    {
      "text": "they hire a dancer acrobat to do the mocap, especially on things where they want to have a lot of action. You're jumping off buildings and tumbling and turning and whatnot. Then, uh, they'll just get somebody to, uh, play your character, play the physicality of you. Kind of like a James Earl Jones, uh, as the voice of Darth Vader, but it's some other guy in the suit. That's my childhood. You're messing with me. Uh, you are my son. That was good. You guys didn't hear that in here. Yeah. It's not a good thing that you have a good resonance, resonance. Oh, resonance. Sure. Thank you. It's crazy though. When you find characters like Yakko and then they're also Raphael and you're like, that makes no sense. And you think about it like, Oh wait, don't, I can hear that. That makes sense. And then you think, then you realize that this is a person and this person can do both of these things. It happens to anime a lot. Like there's a lot of anime voice actors, especially when they dub it in English",
      "start": 2534.84
    },
    {
      "text": "think, then you realize that this is a person and this person can do both of these things. It happens to anime a lot. Like there's a lot of anime voice actors, especially when they dub it in English where the leads of many anime are the same guy and then you like listen to it and you're like, Oh man, that's Adam, the Black Ranger. He's actually the dude that like does a lot of the stuff. And it's, it's crazy to me that when you hear that or like Frank Welker, the voice of Megatron is also the voice of Abu from Aladdin. Frank Welker has done more animated voices than almost anybody who's currently working. He's, it's crazy. Like you can hear all of them and you're like, these are all so different. Yeah. It's nuts. You know, it's, it's funny because I do the work, but I'm also a fan of my coworkers and that's, that's one of the best parts, especially when you're working on an animated feature and you're all working together and you just have so much fun. It's so funny because people are",
      "start": 2592.76
    },
    {
      "text": "and that's, that's one of the best parts, especially when you're working on an animated feature and you're all working together and you just have so much fun. It's so funny because people are riffing off each other and the things that, the things that never show up, the things that are said that never show up in the cartoon are some of the funniest. The dirty stuff. It's the real dirty stuff. I love, you know, you mentioned Melissa earlier. She's always my favorites to do panels with or being at a Comic-Con with because Melissa is so not Clem and then she'll always do it just out of the blue in the middle of the panel. She just did it when we were at PlayStation Experience and she'll kick into Clem mode and say something and there's always an audible gasp in the crowd. They put it together of like, who is this woman? Why is she up there? And then she does it. It's like, Oh my God. All the memories of the game come back. Exactly. Exactly. Exactly. So then I guess in terms of voice",
      "start": 2634.12
    },
    {
      "text": "of like, who is this woman? Why is she up there? And then she does it. It's like, Oh my God. All the memories of the game come back. Exactly. Exactly. Exactly. So then I guess in terms of voice acting in your career, what's next for you? Like, do you, I mean, you're still doing games and stuff. Do you want to do more, would you rather do more cartoons? Would you rather do more games? Where does it all fall down? Well, you know, financially cartoon series are better and movies, animated films. Because of these residuals you're talking about. Because they're residuals. Right now, even though the gaming industry is the most lucrative business in entertainment. Because they don't have to pay residuals. That's not why they're the most lucrative. Residuals are. Residuals are, if you're say in a movie, every time that movie plays in different places, you get paid a little more. If you're on a television show, you get residuals for when it runs again. Or if it runs enough and it goes into",
      "start": 2686.68
    },
    {
      "text": "a movie, every time that movie plays in different places, you get paid a little more. If you're on a television show, you get residuals for when it runs again. Or if it runs enough and it goes into syndication, you may be part of the syndication deal and you may get a big payday when the producers get their big payday. Right now, that's not happening in the game world. And why? Well, one, gaming companies just recently have started to become union. And two, it has not been in the agreement and people don't give up money unless there's an agreement. Which is why we need strong unions. I don't care what business you're in because, you know, chambers of commerce are like a union for owners. Unions like SAG-AFTRA are union for actors. And you know, you need to be able to negotiate and bargain. So that's what's on the table now in the gaming world is getting residuals. There's never been a movie that made a billion dollars in a day. You had three games last year that actually was a day and",
      "start": 2725.48
    },
    {
      "text": "So that's what's on the table now in the gaming world is getting residuals. There's never been a movie that made a billion dollars in a day. You had three games last year that actually was a day and a half. But a billion dollars in a day and a half. And not one of the actors made another nickel other than what they made in their session. And they would say, well, what about the guy that draws? What about the programmers? But they're working every day. You as an actor, you go in, you work one day, maybe two days. If you're doing something like The Walking Dead, even though it took a year to do, we're talking about every six weeks or so. So you're really talking about eight or ten sessions. Wow. Maybe 15 with pickups. Sure. So you're not working every day. You're not getting paid every day for that. We do get paid well by the hour or by the project, but you're not going to become a millionaire based on what you're getting paid in a hit video game. Right. Interesting. Yeah, this has been",
      "start": 2780.36
    },
    {
      "text": "that. We do get paid well by the hour or by the project, but you're not going to become a millionaire based on what you're getting paid in a hit video game. Right. Interesting. Yeah, this has been very fascinating. Yeah, I know, right? And educational. Yeah. But then you got that Comic-Con money. You go there, you get your booth, you get all your signings. But the DaveFennoy.com coffee mugs. Comic-Con doesn't pay anything. Oh, I know. Comic-Con is too big now. They're too big. They don't need you. Come to MomoCon this year. Well, you know what? I am willing to go to any con. I have buddies of mine that go to Australia and Europe and whatnot. Fortunately, I've had it because I was nominated for a BAFTA. I am a BAFTA-nominated artist. I got to go to London for the ceremony, which is interesting because in England, the BAFTAs are kind of like the Oscars. They're huge. But they recognize their movies, they recognize their television shows, and they recognize games. Cutting edge. You know",
      "start": 2844.12
    },
    {
      "text": "because in England, the BAFTAs are kind of like the Oscars. They're huge. But they recognize their movies, they recognize their television shows, and they recognize games. Cutting edge. You know, the Academy here does not recognize games now. But soon. Hopefully. Yeah. They're going to be unavailable. They're going to be, as we get older and people that grew up with games understand the narrative resonance of the games and things of this nature, I think it'll be second nature. Just looking at who's in the gaming business these days, kids that at one point went to film school to become, you know, to make music for films or create films or writers for films or directors for films. Now they're directing games and they're making music for games. They're writing scripts for games. You got guys like Gary Whitta who started doing stuff for movies and games. Love Gary. This is what it is. Hey, Gary. And now he's writing Star Wars. Yes. So he's unbelievable. That's believable to me, though",
      "start": 2898.12
    },
    {
      "text": "like Gary Whitta who started doing stuff for movies and games. Love Gary. This is what it is. Hey, Gary. And now he's writing Star Wars. Yes. So he's unbelievable. That's believable to me, though, right? Because he writes a good story. And yes, he does. Yeah. It doesn't matter what the medium is for that. Absolutely. And that's awesome. And I do wonder, though, like, I don't know if it's ever gonna be that big bang moment where everyone goes, ha, we're legit. I think it just is like everything else where as generations go on, you know, the group mentality will pick one form over the other. And that form will be is video games. Now our parents just don't realize that. But as they, you know, start to die off, don't be steal my lines. No, but, you know, but that's the thing. I mean, the crowd, the consumer will pick the medium. The consumer actually is picking the medium. And I actually think there'd be more news about games now if the people who run the news business were younger or",
      "start": 2956.44
    },
    {
      "text": "the consumer will pick the medium. The consumer actually is picking the medium. And I actually think there'd be more news about games now if the people who run the news business were younger or were listening to younger people in their business. Because it is the biggest entertainment business in the world. It's bigger than music and movies combined. This is true. Yep. And that's why people are falling away from traditional news because they're not getting traditional media. Yeah, exactly. Going online, get everything you want. What's happening? A little twig. I just wanted to pick it up. Okay, cool. Just making sure. Good story. Who asked when I told you? I asked you, Colin, you delivered. Let's see if you deliver with your topic. What's your topic, Colin? Well, we'll be quick on this one. It's a silly one. Don't try to shortcut. Don't try to shortchange yourself on this topic. I'm excited. You know, one of the things I get real passionate about, one of the things I get real excited",
      "start": 2998.84
    },
    {
      "text": "It's a silly one. Don't try to shortcut. Don't try to shortchange yourself on this topic. I'm excited. You know, one of the things I get real passionate about, one of the things I get real excited about is cold cuts. And, you know, one of the things that I, you know, when we talk about New York, we talk about New York a lot because I bring it up, you know, every two seconds. Let's hear it for New York. Is that, you know, everyone's like, well, we got great pizza. Of course we got great pizza. We got great bagels. Of course we got great bagels. But what we really have, that's what some people say. That's why they can't be replicated. You know, one of the things we really have that I think we actually take for granted, and I think I certainly took for granted before when I left Long Island, was our cold cut situation. Now, you know, we have one brand of cold cuts on Long Island that means anything at all. Boar's Head. And that's something that is just not found. It's like a treat at",
      "start": 3051.24
    },
    {
      "text": "was our cold cut situation. Now, you know, we have one brand of cold cuts on Long Island that means anything at all. Boar's Head. And that's something that is just not found. It's like a treat at another place. It's like three places in San Francisco that even have it. See, I feel like it's getting more and more popular. It's more popular. I feel like I'm running into more and more places that have it. But here's the thing. This is the thing. I worked in a deli when I was in high school and, you know, we would cut the cold cuts. And it's the cut of the cold cut. We've heard this a million times. You love them thick and you love them laid out on a platter. Oh my God, you're gross. We're talking cold cuts. I like the cold cuts so then you can see through them. I like it, not shaved, but like cut so much like where you can just pick them up and see like light through them and you could fold them on the bread. You put like, you know, quarter pound of meat on there and some cheese. But",
      "start": 3087.56
    },
    {
      "text": "like cut so much like where you can just pick them up and see like light through them and you could fold them on the bread. You put like, you know, quarter pound of meat on there and some cheese. But what I wanted to ask you guys about is not any of that, but what's your favorite cold cut? Because my favorite cold cut is Boar's Head pepper turkey. Oh, pepper turkey. The Boar's Head pepper turkey that's orange on the outside for some reason that's just cratered with peppercorns and it's just really, really good. So I'm just curious, like what do you got? You got like ham, you know, shaved chicken. What do you got? What do you guys feeling? I'm a ham man. Ham? What kind of ham? The honey baked, honey baked ham. Honey baked ham can get the fuck out of it. Does that qualify as a cold cut? I guess if you get it sliced thinly. If it's coming in the loaf. I'm thinking about a honey glazed ham. Yeah, and you could get that as a cold cut for sure. Maybe not from the company. I just like ham",
      "start": 3128.2
    },
    {
      "text": "guess if you get it sliced thinly. If it's coming in the loaf. I'm thinking about a honey glazed ham. Yeah, and you could get that as a cold cut for sure. Maybe not from the company. I just like ham, pretty much any ham. See, I like it when my ham's salty. I don't like it sweet. Like a boiled ham. I like the sweet one. You're like a southern cured ham. Yeah, you know what I'm talking about. I know exactly what you're talking about. Okay. That's why I keep Dave around. And that would that be your choice? No, of course not. See, like I, it's, I feel you on the thin slices. I enjoy a thin slice. When I think of thin slice deli meats, I think of when for lunch I would get roast beef. Yeah. Cold cuts. As a kid, I mean, we'd go out and shopping on Saturday to get food for the week or whatever, and then I would eat half of that bag before it was Monday morning because I would just go through and you take a slice, you take a slice. Your parents pissed off. Of course they were. It's also when",
      "start": 3163.8
    },
    {
      "text": "and then I would eat half of that bag before it was Monday morning because I would just go through and you take a slice, you take a slice. Your parents pissed off. Of course they were. It's also when you realize how expensive meat is coming out of the deli case. And then you have this little fat kid running around eating half of it. However, that's also the cold cut trade. The best part of any funeral sucks when someone you love dies. But holy shit, are you about to get a cold cut. You go, wow, that's really terrible. Do they have the Hellmann's Mayonnaise? Oh yeah. You know, they have them all rolled up. You got to have them all rolled up. Cold cuts are irrelevant without Hellmann's Mayonnaise. That or like Easter. I think on Easter you usually get a cold cut. And spicy mustard. I love honey mustard. Oh, the big like, yeah, the chunky mustard. Good stuff. The neon French. Forget the yellow French. Colin, it's actually, it's interesting and very, very well timed that you bring this",
      "start": 3210.04
    },
    {
      "text": "honey mustard. Oh, the big like, yeah, the chunky mustard. Good stuff. The neon French. Forget the yellow French. Colin, it's actually, it's interesting and very, very well timed that you bring this up. Yeah. My sister-in-law, I'm going up to Tahoe in a couple of days. Spoilers. No, she's good. She died. She actually died in a freak avalanche of cold cuts in the local belt. No. My sister-in-law called me up the other day and she was like, Hey, can you make your dad's antipasto salad? Like when you come up and I was like, Oh God, yeah, I want to make it. But it's, it's a, it's a complex thing. Cause unlike most like antipastos or antipastas, depending on how you went to the word, it's not just a salad with some cold cuts on top of it. My dad just lays down a small bed of mixed greens and then layers cold cuts like six, seven, eight different kinds of cold cuts, two, three different kinds of cheeses. Olives. He has the special marinade that he does with like these mushrooms, olive oil",
      "start": 3252.84
    },
    {
      "text": "then layers cold cuts like six, seven, eight different kinds of cold cuts, two, three different kinds of cheeses. Olives. He has the special marinade that he does with like these mushrooms, olive oil and vinegar. He lets it sit overnight. So they like shrink down. It's a whole process. So he's a cold cut aficionado. It's not mixed together. You lay it out. And then on like three or four big trays, and then you can just go with a fork and you scoop out some. This is something I think you both take for granted being Italian. Yeah. That to the normal people, no one does this. You know, fricking Wonder Bread sandwich America and antipasto salad is all very like, I don't know. I'm getting into it. So it's like you, your Colin the other day made, it made his sauce. He's like, I'm putting on it. I was like, do you need me to get crackers? And you're like, I'm putting out antipasto. I'm like, all right. And then it was peppers and mushrooms. And now you got cold cuts. It's a very different",
      "start": 3290.28
    },
    {
      "text": "I was like, do you need me to get crackers? And you're like, I'm putting out antipasto. I'm like, all right. And then it was peppers and mushrooms. And now you got cold cuts. It's a very different thing, depending on a lot of factors. Yeah. Most, if you go to an Italian restaurant, normally you're going to get antipasto. It's just a salad with some cold cuts on it. Right. On top of it. It's like, it's yeah. They might die. Somebody put it in. My dad's is literally just a tray of cold cuts, but it's laid out. And it's like, it's a very, uh, it's a, it's all about the presentation. He spent all morning, like laying them out and like decorating. And so when you get sprinkles, like fresh Pecorino Parmesan cheese on top, like just chunks of it. So you get a nice little punch of, uh, of salt. So I call him up and I'm like, my dad, how do I make this damn thing? I forget after like, 0 minutes of notes. And I have, I can show you guys the notes on my phone. I'm like, I think I got it. But the",
      "start": 3332.12
    },
    {
      "text": "I call him up and I'm like my dad, how do I make this damn thing? I forget after like 10 minutes of notes. And I have, I can show you guys the notes on my phone. I'm like, I think I got it. But the one thing that he didn't, that my local deli didn't have that I didn't think they had was a hot capicola. Oh, what? Hot capicola. It's a, it's a hot spicy ham. It's like wrapped. Like it actually is. It's got a punch to it. So it's got these little like threads on the outside of like, of spice, like, like, like a chili almost. That sounds good. And I walk in and I'm telling my wife because my wife has to pick up a cold cuts for me. Cause we're here and I want to get them fresh. Cause you got to get them fresh. You can't get, can't let cold cuts sit there for a week. Don't get me started on that. Don't do that. So I walk in and I'm like, and I ask at Luca Delicatessen, which is on Chestnut Street. It's fantastic. And I walk in and I actually luck out and I get the woman that owns the store",
      "start": 3368.76
    },
    {
      "text": "Don't do that. So I walk in and I'm like, and I ask at Luca Delicatessen, which is on Chestnut Street. It's fantastic. And I walk in and I actually luck out and I get the woman that owns the store and I was like, Hey, do you have a capicola? And she became my personal shopper from that point on. She was like, Oh, we got this. Try this. Let me cut you a slice of Pecorino. Try the Romano. Try this. And I'm like, I reminded me of one of my Uncle Danny growing up. I grew up in Riverside. I got Uncle Danny. He was a bookie. Don't think ever went to jail for it, but he had like two, he had like a little, like an array of four, three monitors. Yeah, they probably were actually. Um, he used to cut me slices. I go into his deli, he's like, what do you want? He'd cut me like slices of like a, you know, fresh pastrami or like, you know, Turkey, whatever he had out there. He just cut me a couple of slices on the, the wax paper. I just throw it my way. But he was, it was funny cause he did a lot of",
      "start": 3406.84
    },
    {
      "text": "fresh pastrami or like, you know, Turkey, whatever he had out there. He just cut me a couple of slices on the, the wax paper. I just throw it my way. But he was, it was funny cause he did a lot of weird, you'd walk in and they'd be like one thing of noodles and like a can of tomato sauce. And I'm like, why don't you ever keep these things like your shelves stocked? And he's like, I don't, yeah, I don't really need to be, I didn't get that. That wasn't really his business. Like the business was happening in the back store with the big, you know, he had the big, big freezers. Like you see like, uh, I don't know. I never looked at it, but he had those big. So I'm going to throw a shout out to the capicola. And I'm going to show a shout out to the, uh, some people call it pepperoni, but real Italians, they call it a spicy salami, the red, real red salami that looks like pepperoni, but you get the long slices of it. So if you were going really going for a pizza with that's really Italian",
      "start": 3444.12
    },
    {
      "text": "Italians, they call it a spicy salami, the red, real red salami that looks like pepperoni, but you get the long slices of it. So if you were going really going for a pizza with that's really Italian, you would not ask for pepperoni to ask for normally most Italian pizzas. Don't, don't call it pepperoni. They call it, it's all salami. It's just salami. So there's spicy salami or like a super salad or some, or you know, something that's got a little kick to it. Uh, if you go to Italy, I don't think you're going to get a piece of pepperoni pizza or something. They don't really know what that word means. I don't think they would just think you were American. They would think you're American. Just prosciutto. Oh, that changes everything. Oh, yeah. Yeah. Yeah. Eliminate the L again. I do. I love the prosciutto on pizza. I love you put out a thing of prosciutto on the little wood block. You know, time words end in a vowel, but when you, you like, when your family says them, they wait so long to",
      "start": 3488.12
    },
    {
      "text": "the prosciutto on pizza. I love you put out a thing of prosciutto on the little wood block. You know, time words end in a vowel, but when you, you like, when your family says them, they wait so long to get to the last word that it just never heard the last. So it never comes out. So they go, you want some mozzarella? I'm like mozzarella. Like my mom, I always think about my mom. Cause she's like, Oh yeah, we're cooking on, on, on, we do the seven fishes on new, on Christmas Eve, which is like a nightmare for me. Cause I don't like seafood, but, uh, we grew up, you know, it's a Sicilian, that's a Sicilian tradition. So they make, you know, seven dishes of, of seafood and, uh, my mom just makes me chicken cutlets. That's cause she's awesome. And, uh, and she's like, Oh, we got the, you know, we got, we have the, you know, the, the, the salmon and the lobster and the, and like the calamari. Like why are they leaving it off? Especially if it's a Sicilian thing, they don't, they don't care about",
      "start": 3527.0
    },
    {
      "text": "we have the, you know, the, the, the salmon and the lobster and the, and like the calamari. Like why are they leaving it off? Especially if it's a Sicilian thing, they don't, they don't care about half that word. That dialect in Sicily is just, it's just so funny to like the way I had no, I had no idea what a cannoli was though growing up because my grandmother used to call it ganno. You gotta come get a ganno. And I'm like, what? Then I saw The Godfather and there was that great series. Like, no, I do. I've seen them. I've never missed it out. You got to come to my mom's house for Christmas Eve dinner. You'll love it. Oh, you'll love it. You'll leave five pounds heavier. I just, you know, the reason I was thinking about cold cut culture, let's call it was because cold culture because I went to, I went to Safeway the other day and I just, I just can't with that place. And you know, I go to the, like, we've talked about this before, but like, why are people pre-cutting their cold cuts",
      "start": 3569.8
    },
    {
      "text": "to, I went to Safeway the other day and I just, I just can't with that place. And you know, I go to the, like, we've talked about this before, but like, why are people pre-cutting their cold cuts and why are they, they're so thick. It's disgusting how thick they are. I just can't handle it. They just don't know any better. We got off track when I went into my fat boy roast beef story and how much I did like it thin and I like my roast beef slices thin. I do need to give a shout out to Andronico's dinner roast turkey because that they cut thick and it's like turkey. It's not like a, it's not a, it's not a cold cut turkey. Yeah. It's not, it's not the compressed difference. Just making sure. So you like them thin so you can kind of like fold them. Exactly. You have to do that because I think I personally think it's essential. No, see, my dad was telling me that I was like, how thick, like, cause last year I made, I made this, uh, antipasto like two years ago and it didn't taste right.",
      "start": 3619.08
    },
    {
      "text": "I personally think it's essential. No, see, my dad was telling me that I was like, how thick, like, cause last year I made, I made this, uh, antipasto like two years ago and it didn't taste right. And it clicked on me when my dad said it, he's like, make sure they cut it a little more like a little thin, not sandwich, like don't get a sandwich cut. Ask them to cut a little, a little more thinly. I guess I'm using, if I'm using that word correctly. Um, and it makes sense because he goes, he goes, because you'll taste it better. You'll get the flavors a little bit more of all the meats together. If it's thinner, if it's too thick, it's too overpowered. I agree, man. Like I, I didn't understand the situation outside of like the Tri-State Area until I went to there. It's a cold situation. When I went to Boston to go to Northeastern and I would like go shopping, they, so they were like one step towards Safeway, like up at like Stop & Shop in Boston, where were they? They weren't",
      "start": 3659.16
    },
    {
      "text": "When I went to Boston to go to Northeastern and I would like go shopping, they, so they were like one step towards Safeway, like up at like Stop & Shop in Boston, where were they? They weren't pre-cutting what they didn't have Boar's Head. And I'm like, where's the Boar's Head. And they were like, we have Columbus and store brand. And I'm like, all right, like I'll get, you know, half a pound of the roast beef and some, and then they slice it thick. And I'm like, what is this? And like, what do you want it? You want it thin? And I'm like, yeah. And like, so you want to shave it. And I'm like, no, don't shave it. Cause have you guys had shaved it before? It sucks. Like it's so, do you understand? I have no idea. So then that like, it's just a pile of, she can't like, it's a mess. It's just, it's too thick. And some people in New England, like, especially like I know, cause I, you know, I lived there for a while. Like people like it like that. Cause they, they take Tom Brady probably",
      "start": 3697.8
    },
    {
      "text": "it's too thick. And some people in New England, like, especially like I know, cause I, you know, I lived there for a while. Like people like it like that. Cause they, they take Tom Brady probably it's just, it's like that getting their shaved ham sandwich. And so that was like one step. And then I got here and I'm like, and then it's pre-cut. And then sometimes they give you an attitude when you ask them to cut it. Yeah. And I'm like, I'm sorry. Like I, and I know it's, I know it's a pain in the ass, but like I could sympathize. I worked at a deli. Like it does suck, but just, just, you can skip this whole rigmarole by just not pre-cutting it to begin with. It's such a damn rigmarole. You know, so I'm not well liked at the Safeway, needless to say. No, I wouldn't imagine that. The last time I went to is actually went to a Safeway and it's not because I don't like Safeway, it's just because it's a little farther. I have to drive to it and it's, I would just go, you know, driving's a",
      "start": 3736.84
    },
    {
      "text": "time I went to is actually went to a Safeway and it's not because I don't like Safeway, it's just because it's a little farther. I have to drive to it and it's, I would just go, you know, driving's a pain in the ass. The last time I was there, there's always a bridge to cross. It's close, but I still have to get my car and drive. Like I can't walk over there. The last time was actually at a Safeway. It was my wife's birthday, was last weekend, and she wanted, she has this weird tradition where she wants to just eat cereal all day on her birthday. That is the best birthday. It was pretty amazing. That's pretty much every day. So she got, she got a box of Lucky Charms and I got a box of Golden Grahams and we just kind of went at it. So here's the thing, I feel like you made a weird choice there. Well, it's because. And the cereal or the wife? Good choice. I was going to go Cap'n Crunch with Crunch Berries, but it messes up the roof of your mouth. We had a thing that last Saturday. We",
      "start": 3770.52
    },
    {
      "text": "there. Well, it's because. And the cereal or the wife? Good choice. I was going to go Cap'n Crunch with Crunch Berries, but it messes up the roof of your mouth. We had a thing that last Saturday. We had a thing last Saturday. We went to The Golden Girls live show, which was amazing. Are you a fan of The Golden Girls? I used to love The Golden Girls. So in the mission, there's a group of men. Of course there are. In San Francisco. They put on an amazing drag show of The Golden Girls. They pick two episodes and they just do them. It's so good. It is so San Francisco. I want to see that. Any of you guys ever been to the Exotic Erotic Ball? No, I have not. I used to go every year when I was there. Is that the one in Cow Palace? Yeah. It's crazy. I bet. A lot of weird and crazy kind of stuff happens at Cow Palace now that they don't have it. And somehow, I'm sorry, but we probably shouldn't talk about the Exotic Erotic Ball and cold cuts in the same conversation. It's too late. Someone at",
      "start": 3800.44
    },
    {
      "text": "at Cow Palace now that they don't have it. And somehow, I'm sorry, but we probably shouldn't talk about the Exotic Erotic Ball and cold cuts in the same conversation. It's too late. Someone at that thing is probably covered in cold cuts. Hanging those roast beef. They like the thick meat. Definitely. Um, by the way, I just found out Kevin. I know I wanted to give a shout out to you in this segment. Poor Kev. We're outside at Dave Fennoy's Fire Pit and it's awesome. Kevin is all the way off. Kevin of course has never been photographed. If we took a photo right now, you still wouldn't know what he was like. He looks like Kenny from South Park right now. I just see a little bit of a mouth and a little like Peruvian mustache with a big shit hand grin. It's so beautiful. Look at your beautiful. Yo, Guerrero! And he's got his hoodie all the way off. He does. Don't let a cop see you like that. Oh man. Not in this neighborhood. They'll pull your eyes over fast. Dave, do we talk about your",
      "start": 3852.76
    },
    {
      "text": "Yo, Guerrero! And he's got his hoodie all the way off. He does. Don't let a cop see you like that. Oh man. Not in this neighborhood. They'll pull your eyes over fast. Dave, do we talk about your favorite cold cut? Do you have a favorite cold cut? You know, I really have a favorite. You know, when I was a kid, I ate bologna sandwiches. I love bologna. I love bologna because I'm not a good person. But I haven't really eaten cold cuts and I don't know when. Yeah, I haven't bought any. I'm going to have to go try some now. You gotta, you gotta, you gotta, you gotta get some Boar's Head. You gotta come. I'm telling you, get the Pepper Turkey. It's just sliced. The Boar's Head Pepper Turkey. Slice them. Okay. I think you'll really enjoy it. I really, because I think it's really versatile because you can get on an egg sandwich. A great New York. What kind of bread do you eat with them? It depends. Like my girlfriend likes, you know, she's also, we're from the same town, all around and she likes my",
      "start": 3907.4
    },
    {
      "text": "get on an egg sandwich. A great New York. What kind of bread do you eat with them? It depends. Like my girlfriend likes, you know, she's also, we're from the same town, all around and she likes my girlfriend. Long Island. And she likes like, I kind of like oat bread or rye bread. I mean, our, our shit on Long Island is rye bread. But I like just white bread. Like Wonder Bread, I think is awesome because you just slather it with Hellmann's. Wonder Bread? Yeah. I love Wonder Bread. Really? It's terrible for you. They still make that? They didn't for a while. Hostess crisis. Yeah. Like Hostess. We got out. I was so, I was so like depressed when that happened because I was really like, I knew it would come back. Someone, some entrepreneurs like, Wonder Bread is available. Were you affected by the demise of the Twinkie? No, not so much. I mean, I like a good Twinkie, but we'll host that Hostess meltdown that happened. I was like, well, surely someone will get on the Wonder Bread. Some",
      "start": 3941.0
    },
    {
      "text": "by the demise of the Twinkie? No, not so much. I mean, I like a good Twinkie, but we'll host that Hostess meltdown that happened. I was like, well, surely someone will get on the Wonder Bread. Some entrepreneurs may be like, this is a huge, we can make a ton of money on it. And they did, but it took longer than I thought. When I saw my, my girlfriend makes fun of me. Cause when I saw it, when I saw it come back in the store, I was like, it's back. It's like totally back. I didn't see a new story. I'm actually not sure that Wonder Bread is actually bread. It's enriched flour. That's all I know. That's a great way to put that. It's like the sandwich you ordered today, which what did they call it? Oh no, I didn't order that today. There's we went, we stopped at this bagel place and Kevin pointed out that on the wall of like, you know, number three, and it's an egg and cheese bag or whatever. They had one that just said ham and then it was with bread. But they, the weird thing is that",
      "start": 3980.44
    },
    {
      "text": "pointed out that on the wall of like, you know, number three, and it's an egg and cheese bag or whatever. They had one that just said ham and then it was with bread. But they, the weird thing is that like two spots above there was a ham sandwich. It was like the same photo. It was like, I don't know. Well, this is the goddamn difference. Well, that was a more, that was an invigorating kind of topic. I, I, you know, I was happy. I'm glad. Yeah. Well, you understand. That's me. It's like what I made. It's like when I made sauce for you the other day and it brought you back. Oh my God. Let's talk about that for a second. Colin invites us over for Sunday dinner. Now I haven't been to a Sunday dinner since Gina Marchica's house probably nine years ago before I moved up here. Her dad used to invite me over. I think he, cause he wanted me to date one of his daughters. Didn't end up happening. Lovely women, very good looking. Uh, but they used to have something to do. What happened? I was, I",
      "start": 4016.2
    },
    {
      "text": "me over. I think he, cause he wanted me to date one of his daughters. Didn't end up happening. Lovely women, very good looking. Uh, but they used to have something to do. What happened? I was, I was leaving, I was moving and I was like, I don't want to be, I can't be tethered to anyone. I'm a, I'm a free Wolf, a lone spirit. You don't want to, the Inland Empire wasn't for you anymore. No, this was actually when I was living in Orange County. They live in Downey, but you know, old school, the bubble, old school Italians always loved Sunday dinner. Like it was a time where, you know, Italian families would have everyone come over, all the cousins would come over. You know what? But that's, that's not just an Italian thing. Oh yeah. Oh no. It's I think there are ethnic groups all over the world that Sunday dinner is a big deal. It was a big deal when I was a kid coming out. It should be. It's not a big deal. Unfortunately, the, you know, the sort of demise of the nuclear family has, has",
      "start": 4063.8
    },
    {
      "text": "that Sunday dinner is a big deal. It was a big deal when I was a kid coming out. It should be. It's not a big deal. Unfortunately, the, you know, the sort of demise of the nuclear family has, has destroyed the Sunday dinner, right? Like we're all spread all over the place. We don't grow up five miles from where we die anymore. It's all, it's crazy. But it's really is. It's upsetting too that you don't do that anymore because you get a lot more cold cuts. I would get it. Oh my God. No, if you, let me put it this way. If my mother lived within driving distance, you would come over, she would hook you up. She buys these like sticks of hard pepperoni. They're like this big. She'll get like, she gets some sort of deal on them where she gets like 40 of them. She just sent like, you go home, you open your jacket. Like, where did I get this stick of pepperoni from? I'm just puts. Is that a stick of pepperoni or just because it's usually a little thinner. But yeah, I go over to Colin's house",
      "start": 4097.56
    },
    {
      "text": "open your jacket. Like where did I get this stick of pepperoni from? I'm just puts. Is that a stick of pepperoni or just because it's usually a little thinner. But yeah, I go over to Colin's house the other night and he's, he's making some dinner for some friends and it reminded me of going to my grandma's house because the sauce tastes the same. Because he doesn't use a lot of, he doesn't use a lot of sugar in your sauce. It's a little more savory than I'm used to because my mom puts a lot of sugar in her sauce. So I was like, ah, this tastes exactly like my grandma's sauce. And the meatballs tastes exactly the same. Not a lot of, just enough of everything in it. Not over. My mom just puts tons of shit in it. Her meatballs are mostly cheese. Yeah. Just cheese, breadcrumbs, parsley. I mean, they're amazing. I probably shouldn't be saying this. Yeah. It's I was glad you enjoyed it. It was nice. It was nice. I'm going to do that again. Well, next time we'll do a chicken cutlets, garlic",
      "start": 4141.96
    },
    {
      "text": "they're amazing. I probably shouldn't be saying this. Yeah. It's I was glad you enjoyed it. It was nice. It was nice. I'm going to do that again. Well, next time we'll do a chicken cutlets, garlic mashed potatoes and broccoli rabe. Sounds good. I think so. You're welcome anytime. That sounds good. Anytime. All right. Good topic. Thank you. My topic. Oh, it's your topic. This is something, it's the topic of friendship. Now, of course, by watching this, you're a best friend. You already know that. You guys know, obviously we're all best friends. We are. But I being with Dave and Colin, they're interesting friends because both of them had an instant connection with me. I feel where we knew and then actually spelled it out that we would be friends the rest of our life. Yeah. Because I remember when I first met Dave, he came up, he did Up at Noon. It was my first time hanging out with him. We went to lunch. We did all these different things. We're hanging out, doing all the blah, blah",
      "start": 4180.6
    },
    {
      "text": "when I first met Dave, he came up, he did Up at Noon. It was my first time hanging out with him. We went to lunch. We did all these different things. We're hanging out, doing all the blah, blah, blah. And then Up at Noon ended and you left. And I remember going home and talking to Christine. I just, I love Dave. That was so cool. It was like, it's not like I have that connection with everybody. Like every Up at Noon guest. I'm like, that was weird. I hope we're friends. And then that weekend you texted me out of the blue. It's like, Hey Greg, hanging out in my backyard and thinking about you. I hope we have a friendship that lasts a lifetime. And I was like, no, you get it. You cut over to Dave for no and he's going to the next person. It was awesome talking to you. But you know what I think, you know, the guy friend thing, and I guess women friend thing too. I think in some ways it's very similar to romance. You know how it is. You see a pretty girl and she's just a pretty girl. You",
      "start": 4232.52
    },
    {
      "text": "you know, the guy friend thing, and I guess women friend thing too. I think in some ways it's very similar to romance. You know how it is. You see a pretty girl and she's just a pretty girl. You know, I like to get with that. But then you meet a girl that there's a connection. It's beyond just, she's attractive to you. There's your souls connect in some way. And, you know, this can be a relationship. It might not turn out to be a relationship, but this could be a relationship, especially if you're married. But I don't do that. I know you don't, but I think the same thing happens between men who discover a connection of friendship. That it's, you're connecting on another level that there's just something about this person that you like. You might not be able to know what it is, but there's just something and there was just something about you that a lot. Plus I enjoyed your energy and your talent and I just thought, wow, this guy's brilliant. He's man. I duped you. He's destined for",
      "start": 4278.12
    },
    {
      "text": "just something and there was just something about you that a lot. Plus I enjoyed your energy and your talent and I just thought, wow, this guy's brilliant. He's man. I duped you. He's destined for great things. Now, three years later, I was talking about cold cuts. That was a good topic. But sometimes it's just, you meet somebody and you dig them. And that's, I liked how you equated it to a relationship. You know what I mean? Cause that's what it is. And I, I, I definitely take that for granted all the time, especially with Colin. Like everybody knows Colin and I live together. We work together. We are together a lot. You know what I mean? And first off though, I remember the first, you remember the first time we met, you just move here. We went out to Edna's Ichiban Library, which was the Filipino karaoke in South City that was hosted by transvestites. And Dave, it was amazing. It was amazing. Cause you'd get up to karaoke and they were like the host and they were, they were hilarious",
      "start": 4326.2
    },
    {
      "text": "Filipino karaoke in South City that was hosted by transvestites. And Dave, it was amazing. It was amazing. Cause you'd get up to karaoke and they were like the host and they were, they were hilarious and they'd sit there and they would sing backup on your songs. So like you had like this whole thing and I, Jean used to go there in droves. We'd go there all the time. Cause Hillary and I lived close to it. And I remember when they were like, oh, we're going to hire Colin. And Hillary would be like, oh, Colin sucks. Like he's such a little shit. And so then we went there and you came and we partied and we drank there. And then we went and we closed down Denny's together with Hillary. And I remember being closed down. How did you close down at Denny's? They're open 24/7. We closed it down to where I passed out. Turn the lights off. That was you passing out. You never go there, but you end up. I saved the receipt. I remember, but I remember being at one point when I was so drunk and",
      "start": 4379.64
    },
    {
      "text": "to where I passed out. Turn the lights off. That was you passing out. You never go there but you end up. I saved the receipt. I remember but I remember being at one point when I was so drunk and I'm like oh yeah. And he said he hated you and you suck but you're awesome. And you're in his defense. I did suck. Like you had grown up from when you were an intern. I wasn't nearly as bad as everyone made me out to be but no yeah. Well not everyone but yeah. Cause I was I also let's be honest Hillary hated everyone. Well I was I was you know I'm 30 now and I became a freelance for IGN when I was 18 when I just graduated high school and then through college was freelancing for them. And then they offered me a job when I graduated. But when I was 19 in between I guess my freshmen and sophomore years I was an intern at IGN and I had like a huge Mohawk and I was just like some kind of brash like East Coast kind of kid like loud kid. And I think that just rubbed Hillary the",
      "start": 4422.12
    },
    {
      "text": "and sophomore years I was an intern at IGN and I had like a huge Mohawk and I was just like some kind of brash like East Coast kind of kid like loud kid. And I think that just rubbed Hillary the wrong way. Yeah. Hillary and I actually ended up becoming great friends. But so when I came back I was I hadn't seen anyone for three years and I was like totally I think I'm more of a grownup. I don't think I'm still a grownup but. Sitting here in your video game sweatshirt on your YouTube show. But yeah no I remember I mean I feel the same way about Greg. Like Greg you know there's I have a lot of good friends I think. And I think that the old saying the old adage that you know it's rare to have a good friend. I think that's that's true but I actually feel like I'm blessed because I feel like I have quite a few good friends like people are sitting around this fire. And but when I really think about like the people I'm closest to they all have a common thread. And",
      "start": 4464.44
    },
    {
      "text": "because I feel like I have quite a few good friends like people are sitting around this fire. And but when I really think about like the people I'm closest to they all have a common thread. And what's funny to me what was funny to me with Greg is that my best friend from back home and from college Ramon who was a character on the show that nobody knows yet. Ramon we met we met when we were freshmen in college and we were just and Greg and Ramon love each other. Oh yeah we totally and like that was when I was like there's something there's the same thing about these two guys. I don't know exactly what it is because they're really not the same at all. But you don't mind that they like each other. No I love it. That's the best thing. Because a lot of times with women when they get their friends together if their friends like each other then it's a bad thing. Yeah no I think it was awesome. Like we went to Kentucky to go bourbon tasting like a huge group of us. And",
      "start": 4505.64
    },
    {
      "text": "get their friends together if their friends like each other then it's a bad thing. Yeah no I think it was awesome. Like we went to Kentucky to go bourbon tasting like a huge group of us. And there's a vacation. Yeah it was my 30th birthday and like and they were like inseparable. Yeah. And I was like this is awesome. You know and you know for Greg like from the way I feel about Greg is like and I've told this to people before and Cheryl knows it too is like I'm you know and I've said it before and I'm beyond is that you know we are extensively married to each other. And I really do feel like you know Greg and I have lived together for a long time and have worked together for a long time. He was my boss and we've never we've fought a few times but nothing serious. And like never never gotten tired of it. I really do see a situation like a real a situation where like Greg outlives and out my relationship with Greg at like really outdoes like most of the",
      "start": 4545.48
    },
    {
      "text": "And like never never gotten tired of it. I really do see a situation like a real a situation where like Greg outlives and out my relationship with Greg at like really outdoes like most of the relationships in my life. To the fact where like I would I owe a great deal to Greg and I would do anything for Greg you know literally anything. That's that's I don't feel that way about a lot of people. There's a definitive AIM conversation. Cause I still have archives of every AIM conversation I've ever had. There's a hacker right now. He started that! What do we really think of Sony PR in 007? No there's a definitive part in this one AIM conversation. Like where we were talking about something else. And then I'm just like you know what? I really enjoy your company. We should hang out more. And you're like I agree. We should. And then we went out and that's still your your ringer on my phone is like when we went out and we went to Pachi's for the first time ever just sitting",
      "start": 4585.16
    },
    {
      "text": "more. And you're like I agree. We should. And then we went out and that's still your your ringer on my phone is like when we went out and we went to Pachi's for the first time ever just sitting there chilling out eating pizza or whatever. It's good mandate. But like now you would the evolution of our relationship now right? Like it always you're still the one who when you call me you're the one who can call me all my shit and make me stop what I'm doing immediately. Right? Whenever you come over when he comes over and he'll say something to me and I'm mad at something else. And I give him a really shitty fucking response. He'll just go Oh okay. Well I don't care. Walk off. And I'm like Oh I got to stand up. I apologize. I kind of wish you'd call up at night with me. I'm like okay well Greg's in a bad mood. You're like yeah I'm in a bad mood. Scarpino go fuck off. That's our relationship. Like that. Our relationship said we vented. Borderline abuse. You know we can",
      "start": 4627.72
    },
    {
      "text": "okay well Greg's in a bad mood. You're like yeah I'm in a bad mood. Scarpino go fuck off. That's our relationship. Like that. Our relationship said we vented. Borderline abuse. You know we can make it each other. So let me just get since you're talking about friendship I have friends that I sometimes have not seen friends that I went to college with or high school with that I haven't seen in years. But as soon as I see him it's like a day. Right. Hasn't been. Yeah. I have those too. Like yeah. I w you know over the summer I was one of the best men in my buddy from college's wedding. And that's the same thing. We are not phone talkers and we aren't texters. Like if something big happens like when I got sick right. Or when he got engaged like we talked to each other then. Sure. But like outside of that no it's like this big thing but you drop back in and it's family. And that's it. You and I as friends we're not in touch every day or even every week. Sometimes I'll get",
      "start": 4673.96
    },
    {
      "text": "But like outside of that no it's like this big thing but you drop back in and it's family. And that's it. You and I as friends we're not in touch every day or even every week. Sometimes I'll get to like you know I would talk to Greg. Let me just let him know. Yeah. Hey just thinking about you. How you doing? Hope everything's cool. You type weird. He's going on a water slide. It's a big cell phone. No you know it's it's it's it's but I always feel close to you. Yeah. And you know sometimes friends or people that you think are your friends are trying to use you for something. And I don't have an agenda with you. And at the same time I feel like we're going to do some wonderful projects together at some point. But without I don't feel like you know I need to call Greg and build this foundation. We need to get this thing together. And what can I do? What can I work on and bring Greg in it? Yeah. I don't have that. I just you know I just you know I did Greg Greg",
      "start": 4714.68
    },
    {
      "text": "build this foundation. We need to get this thing together. And what can I do? What can I work on and bring Greg in it? Yeah. I don't have that. I just you know I just you know I did Greg Greg digs me when there's something that's happening that I can help him out. He'll give me a call. If there's something I'm doing I can pitch it. I'll give him a call. I mean that's the thing. And that's that unspoken thing we have of like when we were I mean we're down here I'm sure people know from Twitter and everything else we're down here to film with Kevin Smith tomorrow. And it was like oh man we get a hotel. And I was like wait a second. We don't need a hotel. Dave's there. And they're like is that cool? And I'm like yeah Dave's always like before you commit to that can you please text Dave? Thank you so much again. And you texted me and what did I text right back? It sounds like a great time. Sure. Come on down. That's awesome. Cool. We appreciate that. I feel like it's",
      "start": 4771.8
    },
    {
      "text": "text Dave? Thank you so much again. And you texted me and what did I text right back? It sounds like a great time. Sure. Come on down. That's awesome. Cool. We appreciate that. I feel like it's it's harder to make friends as you get older though. Yes. I feel like I feel like when I was in junior high I would be you had some cold cuts. Every single every single person you met in junior high you were either going to be mortal enemies with or best friends. Like I remember I met my buddy Stu who is still one of my best friends to this day. And we we almost got into a fight over a girl. It's like seventh grade. Of course. And I was dating dating whatever you do. It's just for the sixth grade and the seventh grade this girl named I'm not going to say her name. She still exists. I don't want her to get jealous. I haven't seen her surprised. I imagine so she was quite she was hot but when I can remember it doesn't matter. Follow me on this. So I was dating her and then she",
      "start": 4822.36
    },
    {
      "text": "I don't want her to get jealous. I haven't seen her surprised. I imagine so she was quite she was hot but when I can remember it doesn't matter. Follow me on this. So I was dating her and then she became we went to junior high together and junior high we did summer school together. It was only pre-algebra or whatever smart kid class that that was. And she started liking this guy named Stu. And he was like a scrawny little blonde kid. And I was like I kicked this kid's ass. What the hell? He's still on my girlfriend. None of us wanted to fight. None of us were fighters. I was more of an eater. The bros before hoes. It was definitely a bros before hoes mentality. I didn't know back then but I felt it in my loins. And she had spoken man code. She ended up breaking up with him. And cause we were like you know we would shoot each other dirty looks and like his friends were throwing him to beat me up. And I was like they're not going to beat them up and no one's going to do",
      "start": 4862.12
    },
    {
      "text": "cause we were like you know we would shoot each other dirty looks and like his friends were throwing him to beat me up. And I was like they're not going to beat them up and no one's going to do anything. Cause we were little pussies but yeah. And it was the funniest thing. One day she broke up with him and I found out and I was like Hey dude sorry. You know that sucks. And he's like yeah I'm sorry. That was like kind of shitty to you. And we've been best friends since that moment. Literally just saw him two weeks ago. He came up with his wife the Stu to San Francisco. He's like Hey want to grab dinner? I'll be up there tomorrow. I'm like sure. And that was it. And it's one of those things where you just picked it back up. Hey how's the thing going? Oh it was great. That was good. And your house is done. I'll have flooded again. Great done. It is what it is. But I think the same story with me and Alfredo too. I think I've told it a million times but before that it all",
      "start": 4906.68
    },
    {
      "text": "good. And your house is done. I'll have flooded again. Great done. It is what it is. But I think the same story with me and Alfredo too. I think I've told it a million times but before that it all started with first day of high school we get in and two of us sat diagonally behind the girl. Cause we were like that's the hot girl. Yeah. We want to get we want to know her but we're also like this is my competition. Yeah. This guy. And we just both knew. And neither of us we had the girl. He probably he could have got it. Alfredo probably could have got it later in life. He might have. But yeah like that brought us together so hard. What really actually brought us together besides the Halo stuff was in that same classroom he ended up getting with a different girl and that girl ended up like these they broke up but like he didn't really want to keep broken up with her. He didn't want to he's Alfredo. He's weird. But he then came to me as this like Hey dude you're my",
      "start": 4935.32
    },
    {
      "text": "ended up like these they broke up but like he didn't really want to keep broken up with her. He didn't want to he's Alfredo. He's weird. But he then came to me as this like Hey dude you're my friend. Now it's like can I talk to you? I'm like yeah. And that's like when we really bonded it's crazy girls bring guys together. But it's interesting. Did you ever do that thing where you know you and your buddy go to the same girl's room you know like in college and you try to outwit each other. I wouldn't win that fight. I remember doing that in college. It's interesting that you say that it's harder to meet people as you go on. Cause for me it was kind of the opposite. Like when I was young I didn't I had friends you know little kid friends but the only like real like ride or die friends and then so I kind of grew up with him. And then after that it looks like a little miniature Rocky over there with his hood pulled up. And then you know when you're when you're that",
      "start": 4979.32
    },
    {
      "text": "die friends and then so I kind of grew up with him. And then after that it looks like a little miniature Rocky over there with his hood pulled up. And then you know when you're when you're that young and kind of become it transcends friends and family. So I see Kevin as family more than and then I met my real core group of friends in middle school. And so this day they are my best. That's cause you stayed in San Francisco. Yeah exactly. I stayed from the same place and then going into high school was like Oh I don't need new friends. I have my friends. And then there was like a couple of guys this guy James and Alfredo that kind of broke their way into it. I was like even though I wasn't looking for friends that they came to me you don't have to look for friends. As a matter of fact just like looking for love you know we're looking for love and all the wrong it just happened. You meet somebody when you're least expected and that's the way friends happen. I thought",
      "start": 5021.16
    },
    {
      "text": "of fact just like looking for love you know we're looking for love and all the wrong it just happened. You meet somebody when you're least expected and that's the way friends happen. I thought I'm going to go up and do this thing and leave and you know yeah but we're friends. I just think about to me what I what I what I enjoy about this the the you know the close like friends that I've had like throughout time is that I'm just very different from them you know like in a lot of ways but we all have this thing that binds us to be like the things that Greg and I met about you know or video games and kind of nerd culture. But Greg and I are very different people like extremely different which is I think like why our relationship works and like why it's hard for me to even imagine like when we frankly don't live together then they'll say oh we aren't in each other's lives. Like it's hard for me to believe that that will ever happen to be honest. And but like when",
      "start": 5064.84
    },
    {
      "text": "imagine like when we frankly don't live together then they'll say oh we aren't in each other's lives. Like it's hard for me to believe that that will ever happen to be honest. And but like when I think about like my buddy Ramon like we met because we're both musicians we both like music but we aren't the same at all. Nobody is. Yeah exactly. And have you found that? Cause every one of my friends there is there's something really wonderful about them and there's something that's not so wonderful about it. And you you love them anyway. And you know a lot of times you even with especially with people that aren't necessarily your best friends you kind of weigh well this is the downside. It's the upside. Do I really want this person in my life at all? And maybe that's not even a friend just a coworker. But you know some people you you know you know what it's too much of a downside. I'm out of there. But with those people you really really connect with you know",
      "start": 5106.84
    },
    {
      "text": "even a friend just a coworker. But you know some people you you know you know what it's too much of a downside. I'm out of there. But with those people you really really connect with you know you you take that downside. I got ride or die buddies that you know they're crazy. They're this or that or the other but I know you know yeah they got my back all the way. Yeah. Yeah. That's crazy. Cause like I was saying going through it I felt like I had my friends early on. I didn't meet too many people. And then I got to IGN. It's just like there's so many people that are so like-minded to where I'm at right now. And right now being the last couple of years of my life and foreseeable future of my life. I feel like when you're growing up you kind of go through the phases and all that stuff. You get a point where it's like it doesn't matter that you're 0 and someone else is 30 or that there's someone whatever the ages are. It's like you guys are very similar. You're",
      "start": 5148.36
    },
    {
      "text": "all that stuff. You get a point where it's like it doesn't matter that you're 0 and someone else is 30 or that there's someone whatever the ages are. It's like you guys are very similar. You're friends you know you're doing it. The older you get I think if you keep your mind open you can be friends with a wider variety of people. I have friends that are older than me friends that are a lot younger than me. And I actually cherish both hopefully for the wisdom of those people who are older and the knowledge of what's new and what's happening in those people that are younger. Cause it helps keep me young. Yeah. I think you know yeah I think open mindedness when you meet new people is key. Like as I get older I mean I always think about my buddy Doug who I met when I was in college and we were roommates and I didn't know him at all. And he was probably like the last person I met in college that I was like ended up being really close with because we were only there",
      "start": 5190.68
    },
    {
      "text": "in college and we were roommates and I didn't know him at all. And he was probably like the last person I met in college that I was like ended up being really close with because we were only there together for two years. And I remember walking into the room and we had to share a room together and he had a Red Sox hat on and like a Patriots like poster on the wall. And I was like kidding. I remember like saying my mom my mom like cause I'm a huge Yankee fan and a Jets fan and in Boston like that's really serious with a lot of people you know like I used to get a lot of shit for wearing a Yankee hat. We've had people damn near killed out here. Yeah. Because of the Dodgers and the Giants. It's a it's a regional thing or whatever. And I like and I was just like you gotta be kidding me. Like it's so this sucks you know like and we ended up just connecting in a major way. I was I was one of his groomsmen and his wedding and and it was one of those things where I don't see",
      "start": 5236.68
    },
    {
      "text": "me. Like it's so this sucks you know like and we ended up just connecting in a major way. I was I was one of his groomsmen and his wedding and and it was one of those things where I don't see him anywhere. He lives in Columbus now his wife teaches at Ohio State. And we just were together at a fire pit like just like this in in Maine when he got married and we're just like just like that we turned it back on. And but you know I do have to give a shout out not just because they're here but like you know I I've developed a great affection for Tim and Nick too even though we haven't been as close as I've actually known Nick for a really long time but you know well Nick is hard to like cold cuts. These are really special. These are really special dudes. Like you know that I'm I feel really blessed that I know them you know that like I've gotten to know them and and they've taught me a lot about myself and put me in check when I need to be put in check too",
      "start": 5272.28
    },
    {
      "text": "that I'm I feel really blessed that I know them you know that like I've gotten to know them and and they've taught me a lot about myself and put me in check when I need to be put in check too which is good. And I think I'm developing a very similar relationship to them that I've developed with with people that you know I agree. I would agree. It's hard because it's a really good topic. It's hard for for us though because I think that like so much of our time is spent like as fun as this is this is kind of work right? Like we are we enjoy doing the podcast but it's also there's a lot of setup that goes into this planning all this stuff on Patreon all the stuff that we do. We the Sunday dinner was the first time you and I had actually hung out just to hang out in probably six years. Like not with without another thing that we had to do on top of that. Like we all go hang out and it's fun but then there's also like let's stop the party for a second. We got to talk",
      "start": 5314.28
    },
    {
      "text": "six years. Like not with without another thing that we had to do on top of that. Like we all go hang out and it's fun but then there's also like let's stop the party for a second. We got to talk business for a few minutes. We got to figure out what's going to be show or who's cutting this or who's editing that or Nick one of the t-shirts going on for Tim. When when are we going to get back on iTunes? January January. By the time we should be totally good. I just never thought through how stupid our plan is to spread this information. Cause every day I get texts from people or tweets where are why aren't you on iTunes? And I'm like we just Oh right. You're not watching the YouTube. You're waiting for the iTunes. You have no idea that every episode we're saying it's going to be this giant like deluge of information of like seven episodes that people will forgive and forget. Oh yeah. Very good. It was a good topic. I think that friendships essential. Yeah. It's really",
      "start": 5356.28
    },
    {
      "text": "to be this giant like deluge of information of like seven episodes that people will forgive and forget. Oh yeah. Very good. It was a good topic. I think that friendships essential. Yeah. It's really important. Don't overlook it. And to the advice we always give to the younger people too. Don't like I feel like a lot of that drama you have with your friends when you're a kid are irrelevant. It's the people that are ride or die with you that will you will bring with you throughout your life that are really the ones that matter. Yeah. And and to have a friend be a friend I know it's trite but it is true. You have to be a friend. You have to be willing to give at there are people out there that in the guise of friendship will try to use you and you have to have your friend are up. And that's the thing that happens. I think to a lot of people when they're young you're that roommate that well nowadays it's all cell phones but never paid the phone bill or never did the dishes and",
      "start": 5391.64
    },
    {
      "text": "the thing that happens. I think to a lot of people when they're young you're that roommate that well nowadays it's all cell phones but never paid the phone bill or never did the dishes and and no sense of responsibility to the friendship. There's just I'm going to get as much as I can get from you until you're done. And then I'm done. Yeah. And I think hopefully as you get a little older you recognize those people quicker and eliminate them from your life and find the people that really I dig you because I dig you. And I want to be the kind of friend to you that you need. Cause that's what I need. Yeah. Absolutely. Friends. They're important. Yeah. And we love them. How many of us have them? We love you. We've gone long. Do you want to go to your topic real quick or do you want to sit on it for a minute? I don't think it's going to be a quick topic. That's my only thing. Yeah. Okay. Then it should be saved until we'll save. That was a great topic. That was a great topic. Yeah.",
      "start": 5442.52
    },
    {
      "text": "sit on it for a minute? I don't think it's going to be a quick topic. That's my only thing. Yeah. Okay. Then it should be saved until we'll save. That was a great topic. That was a great topic. Yeah. Let's end up on that one. I do say myself. Well done. Great. For once. For once. Well can I can I say one thing? I am so happy you guys came down. I'm so happy that we reached out and said Hey can we stay down there? This has been great. Thanks for dinner. I'm loving doing this around the fire pit and it's just thumbs up all the way. Always a pleasure. Thanks. Everybody go to DaveFennoy.com order coffee mugs. They're amazing. He sells a full set of them by the way. You don't just have to buy one. You can buy all 18. Can you tease anything you're coming up in that people should people listen for you obviously. Well let's see. Some mix old cartoons are coming up. Didn't have to sign anything for that but I've got a number of other things. Some of the great cartoons coming up. Then",
      "start": 5491.48
    },
    {
      "text": "for you obviously. Well let's see. Some mix old cartoons are coming up. Didn't have to sign anything for that but I've got a number of other things. Some of the great cartoons coming up. Then I'm going to be in some games that I'm going to be in. But no they make you sign your life away. And if I told you what it was they cut my balls off. Okay. What would you do then? That's the old balls off NDA. You don't hear about him enough. I said Dave, it's been a pleasure. Everybody follow Dave. Go to DaveFennoy.com. Dave Fennoy on Twitter and Instagram. He's all over there. Multimedia man. That's what we call Dave Fennoy. You're right on the cutting edge of this internet. Just like The GameOverGreggy Show is of course each and every week for sometimes I have best friends gather on this fire pit to bring a random topic of discussion for your amusement. If you like that head on over to patreon.com/KindaFunny and give us a dollar or something. A little bit of money. Don't have",
      "start": 5541.56
    },
    {
      "text": "pit to bring a random topic of discussion for your amusement. If you like that head on over to patreon.com/KindaFunny and give us a dollar or something. A little bit of money. Don't have any money. No big deal. You can go to youtube.com/KindaFunny Monday through Friday. Each topic is broken out for your amusement until the entire show post for free on YouTube and iTunes. Sorry for all the people. I think there's one kid who's getting like seven reminders that we had been trying to tell him this information and never got there. We apologize. iTunes as well. We'll be back on track in 015. Whole bunch of exciting stuff's happening in 015 including the Kevin Smith Show we're talking about. A whole bunch of other guest stars we keep talking to. So if you're looking for that go buy your GameOverGreggy Show cup at kindafunny.com/store. Follow us all on Twitter. Support your favorite band. Spotify is not giving them any money so just go there. Buy their albums.",
      "start": 5591.56
    },
    {
      "text": "go buy your GameOverGreggy Show cup at kindafunny.com/store. Follow us all on Twitter. Support your favorite band. Spotify is not giving them any money so just go there. Buy their albums. Follow Tone Deaf. Tweet Taylor Swift. Yeah definitely. Oh tweet Robert Kirkman. Say you want Dave Fennoy in The Walking Dead for Ezekiel. Oh yeah. Yes. And uh yeah. So is it time to do the Dave Fennoy fire pit fire walk? Yeah. You're welcome to do it. Who's my friend? Let me get the mic off you before you. Ladies and gentlemen until next time it's been our pleasure to serve you. We're gonna go. That was worth the dollar. That was worth the dollar. That's what Tim used to say every time we'd start.",
      "start": 5633.4
    }
  ]
}
