{
    "id": 124,
    "video_id": "h4sdL3L-FnE",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Walking Dead or Last of Us Zombies? - A Conversation with Colin",
    "description": "In a zombie apocalypse, would you rather fight slow-moving or fast-moving monsters? Greg and Colin discuss their zombie-fighting plans.\n\nToday's topic was submitted by ShutUpBender. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1378818031,
    "duration": 686,
    "transcript_chunks": [
        {
            "text": "Put strap, that's a great idea. Take Portillo's. This is what you're going to do: you're going to make Portillo a suicide vest. What's up everybody? Welcome to A Conversation with Colin. I'm Greg, and this is my roommate Colin. Now sometimes the Pride along Island says crazy stuff. So every Tuesday and Thursday, I reach into my random topic pile, pull one out, toss it at them, and we talk it out for your amusement if you like that. Like the video, subscribe to the channel, share with your friends. Colin, are you ready? Yes. Today's topic of conversation is: in a zombie apocalypse, would you rather fight slow-moving zombies (Cephalopod-style) or Walking Dead-style zombies from The Last of Us? God, there's no first of all... I would much rather be in The Walking Dead than I would be in The Last of Us. If you haven't watched it, the Last of Us zombies are not zombies; they're infected humans - a fungus grows out of their head and then they...",
            "start": 0.08
        },
        {
            "text": "I can't like oh no um The Last of Us if you haven't watched I mean Last of Us zombies are they're not zombies first off they're infected humans the fungus grows out of their head and then they they Sprint and they run and they scream and then zombies and Walking Dead are the slow moving they don't run you know you can you can outsmart them easily yeah like I The Walking Dead is not as scary as The Last of Us in terms of being in that situation sure that's why I think you know Walking Dead whether it be in TV film books or whatever the real threat is the other person right you know how man's in humanity to man kind of thing and granted that's in last of us too but last of us also has monsters that are going to come out and get you yeah so here's the funny thing about you know we were talking about the Second Amendment right yeah oh yeah so all of the all like all of Western Europe Russia a lot of uh you know other countries you know you know Asian countries",
            "start": 42.08
        },
        {
            "text": "about the Second Amendment right, yeah, oh yeah, so all of the all like all of Western Europe, uh, Russia, uh, a lot of, you know other countries, you know, you know Asian countries that don't allow personal handguns and personal firearms. United States we'll be fine, uh, so the thing about you know we're not all going to live right but you better believe that when the world comes back from this if it ever does America will rise again because we're the ones that had guns we're the ones that have weapons and we're the ones that are just a little bit more crazy. That see for me like my zombie apocalypse plan never comes down to getting a gun, it's always like I want to get a bat, I want to get a crowbar, I want to get some kind of blunt force trauma weapon that I can take off a head with you know what I mean really somebody up in the head that's my thing, yeah, you got to get all close to him though and Sh like sure well I mean I'm I've never shot a gun",
            "start": 77.28
        },
        {
            "text": "Take off a head with you know what I mean, really **** somebody up in the head - that's my thing. Yeah, you got to get all close to him though. And like, sure... well, I mean, I've never shot a gun before. It's not like just finding the gun and having unlimited ammo. Well, unlimited would help me, but you know what I mean - like, I'm not going to have unlimited ammo code. Yeah, yeah, unlimited ammo. My little bandana's flowing in the wind. So what's your plan right now? Right now, you know... Outside Lands is going on over there in the park, and a zombie outbreak happens. We hear it on the news, we don't even know - we see like we think it's just normal homeless people walking on the street being **** but turns out to be zombies. Well, for us, I know because [Greg] Portillo is loud, I know... uh, we and we probably eat him too eventually. We save... see that's my whole thing is in the first stage - do we have to do it like when it's just happening? Well, it's either we do it immediately or there's going to be a problem.",
            "start": 123.2
        },
        {
            "text": "we save see that's my whole thing is in the first stage do we have to do it like when it's just happening well it's either we do it immediately or there's going to be a moment where we're going to have to do it in the moment like you're not going to have time I'm just going to stab Portillo see that was like I try to have a plan for everywhere I live and so in my old place when I was in the high-rise right I was just going to ho up in the highrise of course you know you plug your drains you fill them with water before the water gets cut off so you have all this water they're ready to go and then when it was like for sure we're there zombies like it's they're really everywhere and like somehow they're getting in the building at some point that's when I was going to toss over the balcony and I was like 14 floors up I figured that was the easiest way for him to go like that way and then for me to let him go right because",
            "start": 157.24
        },
        {
            "text": "when I was going to toss him over the balcony and I was like 14 floors up I figured that was the easiest way for him, for him to go, like that way, and then for me to let him go right because, like now you're talking about killing him in this place cuz we have to you hear him, you see him in The Walking Dead, you hear the doors outside, you hear somebody walks by starts barking, we can't have them alerting any Walkers or anything like that so I don't but now I got to sit there and figure out how I'm going to kill my own dog I can't throw him out anywhere you know what I mean like it's not as easy it used to be yeah I love that you were going to just toss him off a balcony that's the best, it was like a Band-Aid for me and he would have no idea what was happening and it'd be over like that for him that's so odd I just see it and it's funny um only because you love me so yeah I mean it would be tough I mean we you know first of all I",
            "start": 186.16
        },
        {
            "text": "what was happening and it'd be over like that for him that's that's so odd I just see it and it's funny um only because you love me so yeah I mean it would be tough I mean we you know first of all I wish I would be back in New York um that would much rather be there than here yeah um and you know why what about it well my dad's like really like my dad's a funny dude like you know like so you want comedy in the zombie apocalypse well he's just like he's like really into um like camping and I don't want to say survival because like that's not really what he's into but he's into like outdoorsman kind of things and like kind of likes when the power goes out and kind of like you know like like kind of digs it I remember we lived in New like my dad moved up to New Hampshire for one year um when I was up there in private school playing hockey yeah um and and kind of just living up there with my mom and um I remember we had like a horrible blizzard and the power went out for like",
            "start": 221.28
        },
        {
            "text": "year um when I was up there in private school playing hockey yeah um and and kind of just living up there with my mom and um I remember we had like a horrible blizzard and the power went out for like four days in New Hampshire and we like it was fun it was like fun to be with my dad he had like all this kind of cool camping gear in our house and we were just reading books and kind of anyway like I just feel like he's a good dude to be with sure sure sure like for that kind of thing I think like my dad I always say my dad you know who's like a retired New York City firefighter and and he's like in his early 60s now like will very easily outlive me like no doubt about that he's not eating **** jars in no he's like he's like a he's like a vegetarian and like like exercises a lot every day and like takes good care of himself he's spiritually like very so he's literally the complete opposite of you yeah okay we are very similar politically and then and I I I my dad's actually the person",
            "start": 260.2
        },
        {
            "text": "and like takes good care of himself, he's spiritually very similar to me, yeah okay, we are very similar politically and then I'd like to be like my dad, but um I'm just very far away from being like uh but anyway, being back on Long Island, you know, and then we have to get guns and food and survive, and I feel like Long Island is a fortified position, um so because there's only one way in, um so and I would be across the bridges which the military would probably destroy. So Long Island would be fine, plus we have a heritage of fishing and farming on Eastern Long Island, so we are self-sustaining, um so for here like right it starts off I think we have a good security gate on the front door however the back I don't enjoy that the backyard is so accessible as far as like there's a lot of windows back there",
            "start": 296.4
        },
        {
            "text": "it starts off i think we have a good we have a security gate on the front door however the back i don't enjoy that the backyard is so accessible as far as like there's a lot of windows back there so first thing i would do obviously is block the stairwell here we're on the second floor then go through the back and like i not only board up the windows we have back there we have those sliding doors or whatever somehow like take out the deck so you couldn't even get right up to them cu that's a big problem right now as far as that that's what that would be like step one here i you know i i would hold out to kill portillo here again i'd be plug up the drains try to get a lot of water standing that's that's an old nuclear war um trick yes so that's even in alas babylon which is a really old 50 plus year old book about nuclear war okay um that you should read okay i'll get right on it uh it's very good very very good book about a nuclear war and then the guy in florida",
            "start": 338.68
        },
        {
            "text": "is a really old 50 plus year old book about nuclear war okay um that you should read okay I'll get right on it uh it's very good very very good book about a nuclear war and then the guy in Florida surviving with like his people in his neighborhood now again though if we if we if if the Corps or like even if you want to go 28 Days Later zombie showed up where Sprint and stuff I would kill myself immediately oh I wouldn't kill myself I would I would I'm not going to win I'm not going to win that fight I would try to survive I mean I'm not I'm not one of these I'm not you know I'm not Joel I'm not going to actually live but you know I'm not going down like a **** mean totally I don't there's no way that's happening I'm not going down like a like a **** like cuz like we're never going to beat those zombies that are running and stuff we are never going to beat they're never we can't they never get tired they're never going to get winded you see but that's where like the whole",
            "start": 370.52
        },
        {
            "text": "Going to beat those zombies that are running and stuff. We're never going to beat them; they never get tired, they're never winded. You see, but that's where the whole zombie thing falls apart, and that's why it's boring and stupid. That's why The Last of Us is much more interesting than the zombie stuff, like this. I'm interested in The Walking Dead because of its lore, specifically the parts they never talk about because they have no idea how to explain anything. At what point kinetically does a zombie just not move anymore? It doesn't get sustenance; at some point, they can't biologically survive anymore. You know, it doesn't make any sense. This is what really bothers me about the whole thing, even if you just...",
            "start": 406.68
        },
        {
            "text": "they just biologically cannot survive anymore you know like it doesn't make any sense this is like what this is like what really bothers me about the whole even if the whole even even if you just suspend dis belief and imagine that a zombie outbreak could happen yeah and corpses happens in the insect world so it's not like it's not like that's just about like leaping to humans I mean I don't think that's going to happen but um if you just suspend your disbelief right and then there are runners or you know clickers in in The Last of Us that have been like that for years 10 20 years some of them right the bloaters get really big and they're like they've been like that since the beginning how are they surviving without eating how are they like like it just doesn't make any sense if they're moving and they're using energy and they're spending energy and stuff then they must restore that energy like just biologically it doesn't make any sense you can starve them out yeah to happen in days later",
            "start": 441.48
        },
        {
            "text": "and they're using energy and they're spending energy and stuff then they must restore that energy like just biologically it doesn't make any sense you can starve them out yeah to happen in days later yeah and and and in The Walking Dead like you assume that that has to happen eventually like these guys are just like walking around like you can't survive like this forever it just doesn't make any sense like just because you're a zombie doesn't mean you don't have to eat for 20 years like that doesn't that doesn't yeah well and they eventually rot too there's a chance that's why I'm saying you got a chance with The Walking Dead zombies excepts you're going to lock yourself in but they're still going to be out there everywhere the the the problem is that people are turning constantly it's not like they turned at one time so so like you would assume you're waiting them all out as a group you're waiting them out in waves and some of the clickers well the runners and The Last of Us are",
            "start": 476.76
        },
        {
            "text": "like they turned at one time so so like you would assume you're waiting them all out as a group you're waiting them out in waves and some of the clickers well the runners and the last of us are the most recently infected ones so you assume that happened you know a few years ago at the most yeah and what's most **** up is that they know that they're infected yeah that's it's a living nightmare that I I don't like that world at all that's why I'd kill myself right away my best friend back home always makes the joke that I'm always one power outage away from killing myself that the power would just go out and I'm like this is it I'm just disappointed that you go down like that I I wouldn't go down like that I mean it wouldn't be immediate like I saw it on the thing but I mean like when they're beating down the doors and I'm like well we got nothing like that's when I'd probably be like no I'd let them just take me out no **** no especially you're talking about like the core zombies",
            "start": 508.56
        },
        {
            "text": "beating down the doors and I'm like well we got nothing like that's when I'd probably be like no I'd let them just take me out no **** no especially you're talking about like the core zombies so you're going to you're going to be one of those guys walking around no no no cuz think about this right think about The Walking Dead, I don't remember the guy the big fat guy that got left behind at the Otis right they all in mauled and attacked him like he's not going to turn he's he's done but I'm not like so if they're if they're like we're talking about like you get bit in a casual way right, spoilers and like she gets bit and she turns not like if if the runners attacked her like as a group she wouldn't turn because there wouldn't be any test left but I don't want to go out getting eaten alive well like you could even like they're coming through the door right and you maybe could take a few out and then",
            "start": 543.28
        },
        {
            "text": "because there wouldn't be any test left but I don't want to go out getting eaten alive well like you could even like they're coming through the door right and you maybe could take a few out and then when they're coming just kill yourself oh yeah okay then at least like take some of them out with you see this is what I'm disappointed is at least help like Humanity to like do something right strap strap a bomb to your body and run in the middle of do something and I mean if you're going to kill yourself I mean at least do it for everybody it's a good point me and Portillo out there one final walk we call strap that's the a great idea take Portillo's this is what you're going to do you're going to make Portillo a suicide vest okay you're gonna you're going to put you're going to put frag grenades on Portillo all around like like like the hit movie Swordfish we put ball bearings on them right you're going to take his toy and throw it yeah towards the zombies now he has no idea because he",
            "start": 585.08
        },
        {
            "text": "on Portillo all around like like like the hit movie Swordfish we put ball bearings on them right you're going to take his toy and throw it yeah towards the zombies now he has no idea because he can't see and he's also stupid so he has no idea that these things are are dangerous he's gonna run towards them just to get the toy and then you and he good point actually that that would solve the problem of it being fast for him and everything else that's it all right some might call him a domestic terrorist but I'd call him a hero for doing that for I mean what the terrorist against zombies like okay he did the right thing it's fine so there you go thank you exod zero for figuring out how to kill my dog in the zombie apocalypse in the most beneficial way for everybody that was a good one I like that one L ladies and gentlemen if you have a good topic make sure you leave it in the comments below send it to us on Twitter do something for this human race we keep talking about until then like",
            "start": 620.96
        },
        {
            "text": "that one, ladies and gentlemen, if you have a good topic make sure you leave it in the comments below send it to us on Twitter do something for this human race we keep talking about until then like the video subscribe to our series here on YouTube and then come back every Tuesday and Thursday have a conversational day he's like a mentally disabled like half blind Weiner dog",
            "start": 659.08
        }
    ]
}