{
    "id": 2792,
    "video_id": "taPC2fOx5BY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Nick Scarpino",
        "Kory Stotesbery"
    ],
    "title": "Overcoming Anxiety - The GameOverGreggy Show (Patreon Exclusive May 2017)",
    "description": "Nick sits down with with his cognitive behavioral therapist, Dr. Kory Stotesbery, to talk about the process he's undergone for managing his anxiety and achieve his goals in Jiu-Jitsu, comedy, and life.(Released to Patreon Supporters on 05.28.17) \n\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1499194804,
    "duration": 3740,
    "transcript_chunks": [
        {
            "text": "what is up everybody welcome back to another special episode of The GameOverGreggy Show we're rebranding the show so we're not quite sure what this is going to be I'm joined by a very special guest to me Dr. Kory Stotesbery you are my therapist for one very fascinating we've known each other for that a year I've told the story on the podcast obviously of my claustrophobia my dealing with that and I've told people that I'm going to see I'm seeing somebody to help me through that and you are that somebody yeah so we were talking obviously we talked about the past year but we were talking I'm like what would be the best way to sort of share this experience with people and we came up with the idea of potentially just having you on as a guest and me interviewing you about this process what it's like spending an hour of your week in the insanity of my brain and then just basically you know therapy in general how it's like how people view that if people need help",
            "start": 2.85
        },
        {
            "text": "about this process what it's like spending an hour of your week in the insanity of my brain and then just basically you know therapy in general how it's like how people view that if people need help there's lots of stigma we'll just jump right into how you're doing so far today, doing good man I'm really excited to be here thank you for the opportunity um there's a lot of conversations happening right now about mental health and how to do it better how to help our society and so I think it's a really great opportunity to be able to use your platform to talk about that I think so as well now it might be a bit of an issue with our platform being slightly more professional but you know take it for what it's worth we'll see certain people reading into it how did you why let's go back a little bit let's talk a little about you what are you what are your certifications how did you get into this field sure who you've helped give me the whole yeah spiel um so I'm a psychiatrist which means that I'm",
            "start": 55.59
        },
        {
            "text": "Talk a little about you, what are you, what, what are your certifications? How did you get into this? Sure, who you helped? Give me the whole yeah spiel. Um, so I'm a I'm a psychiatrist, which means that I'm a medical doctor. I'm actually an osteopathic physician, which is just a little bit different school of medicine being that at some point in my life I knew how to treat somebody with my hands and of course as a psychiatrist I never do that anymore right? But every time I walk in, I'm like \"I hurt myself doing jiu-jitsu.\" You're like, \"What do you take?\" And I'm like, \"Yo, this means he likes not a bad thing.\" Right there was there was a moment in my past where I could have treated your back pain with these guys. Awesome. So that's the osteopathic side of things and or just the medical part. And so after you finish medical school we do residency, so we're talking like Grey's Anatomy season one at this point, and you pick what you want to go into, and so I elected psychiatry at that point. And so you do four years.",
            "start": 99.99
        },
        {
            "text": "School we do residency so we're talking like Grey's Anatomy season one at this point and you pick what you want to go into and so I elected psychiatry at that point. And so you do four years of adult psychiatry, and then I did an extra fellowship to learn how to work with kids. So I did that. So at this point, I am a child and adult psychiatrist. And that opens the door to being able to help people through medication management but also psychotherapy, which is kind of where I have leaned in my career and just gotten the expertise and training in that piece. And so at this point, the iteration of how I help people or what my career looks like is really focused on those kinds of opportunities to work with people long-term more in-depth and being kind of the agent of change for their life that they're looking to get to rather than kind of exporting that out to another therapist. I just really like doing that stuff. Interesting okay, and that kind of reminds me so so so then to catch everyone up.",
            "start": 145.6
        },
        {
            "text": "looking to get to rather than kind of exporting that out to another therapist I just really like doing that stuff interesting okay and that kind of reminds me so so so then to catch everyone up out there who may or may not be familiar with like why this relationship's happening right now is about I think year and a half ago and I just think Lee remember this I was in Austin Texas we were visiting Rooster Teeth the partner company that we work with a lot to make some content and I woke up in the middle of the night because my sheets were too tight on me because I was having a class or public panic attack I had to walk into the middle of the room and actually considered walking out of the hotel in my in my underwear cuz I was like I didn't know what was going on and at the time I was thinking about going back to Jiu-Jitsu which is a ground grappling for people who don't know it out there Brazilian Jiu-Jitsu and I was like I was I think because I was thinking about doing that it was giving",
            "start": 195.94
        },
        {
            "text": "about going back to Jiu-Jitsu, which is a ground grappling for people who don't know it out there Brazilian Jiu-Jitsu and I was like I was I think because I was thinking about doing that it was giving me more and more and more anxiety also of course we just saw this business we were you know the business is growing but you know you wrote your own business you know how incredibly fun that can be sometimes an anxiety inducing and so I think my overall level of anxiety was at an all-time high although I wouldn't have said it like that I would have said I'm having I'm claustrophobic that's how I would frame it to myself to my wife and I think largely I would do that because is that seems more like less like I'm in need or have a problem or less that I need to see someone about that like it's just oh it's like like you know people have a fear of spiders like whatever I mean it was about a little bit of a fear of something around but like what they don't tell you is that you're not you know if",
            "start": 235.96
        },
        {
            "text": "oh it's like, like you know people have a fear of spiders, like whatever I mean it was about a little bit of a fear of something around but like what they don't tell you is that you're not you know if you see a spider your head goes dark for a second sure and you know the life starts going out you start going I got to pass out first and that's a serious problem and so I think at that point that's when I decided to potentially find someone and so that process was pretty long but I also I should say have been to a therapist before my wife and I've seen couples therapist just to work on our relationship when we occasionally touch base with them just to check in here and there which I very much recommend to anyone who is getting into a relationship or is currently in a relationship we think there might be some things you want to talk about good or bad never a bad idea to have you know an objective voice in the room like not a subjective so you know I talk to my wife",
            "start": 281.07
        },
        {
            "text": "there might be some things you want to talk about good or bad never a bad idea to have an objective voice in the room like not a subjective one so you know I talked to my wife a little bit she was like we should maybe look to try to find someone and so I google-searched found a bunch of people in the San Francisco Bay Area and you stood out for a couple reasons one you I think there have been two things in your bio that said you worked with athletes or something along those lines which is good I'm like okay this guy's going to understand that I'm trying to be an athlete and I guess there was a third one which is probably the more important which is you take my insurance right and that's and that's something that we should touch on because you know that's it sucks to say but in this day and",
            "start": 319.14
        },
        {
            "text": "Is probably the more important which is you take my insurance right and and that's and that's something that we should touch on because you know that's it sucks to say but in this in this day and age I'm like I can't afford I couldn't at the time so can't afford to pay full price to go see if they are best to deal with this problem sure and so I was confronted with the idea it would that first issue right there which is like how badly do I want this because I might have to shell out hundreds of dollars a week or a month to deal with this problem and I'm like hey not that bad so that was probably two to three months before you got an email from me sure and then eventually it got to a point where I'm like I need to do this like I need to get back in the saddle I need to get back on the mat you deal with this issue that I've never dealt with by the way because every single time I've gone to do Jiu-Jitsu I found another excuse to not deal with these panic attacks I would have in other bad\n\nI corrected spelling errors and phonetic mistakes, capitalized proper nouns like \"Jiu-Jitsu\", and left the original meaning intact.",
            "start": 362.55
        },
        {
            "text": "deal with this issue that I've never dealt with by the way because every single time I've gone to do Jiu-Jitsu I found another excuse to not deal with these panic attacks I would have in other bad positions so I would have like kind of I wouldn't say a situational anxiety but it would be specifically if I'm in mount or if I'm inside control if I'm in these spots where I can't get out that's when boom that panic would kick in back but that has been a long-term experience of those moments in Jiu-Jitsu happening where those things came up yeah that started the first time I recognized that was probably when I was 25 or maybe 24 23 so I had it I have an old roommate of mine that was like hey I'm really into Jiu-Jitsu and he got me to start watching The Ultimate Fighter which is a you know back then was looking season one or two of this cool UFC show or people you know we're getting off real good but he got me into UFC got me in the whole concept of Brazilian jiu-jitsu like what it meant prior",
            "start": 405.92
        },
        {
            "text": "was looking at season one or two of this cool UFC show or people you know were getting off real good but he got me into UFC got me into the whole concept of Brazilian jiu-jitsu like what it meant prior to that of course I had been like I'm a karate man you know or kung fu I understand I lost stand up and one second of rolling with him just obliterated that in my brain all of that ago that I had built up and like this the training that I'd done prior to that in martial arts I was like oh god like this is the humbling part of well it was terrifying actually so this was more like he got me in a spot where I'm like I don't know what to do here right and this is bad and of course you know being not an official trainer and not I mean not communicating to him like this is a this is a bad thing for me that would happen over and over again to the point where I was like you know what I'm just going to come up with a very well I mean I would even go as far as to like if I knew I was gonna roll with him",
            "start": 446.24
        },
        {
            "text": "would happen over and over again to the point where I was like, you know what, I'm just going to come up with a very well, I mean, I would even go as far as to like if I knew I was gonna roll with him the next day, I would get like really drunk the night before, like party the night before. I was too hungover to go and did you realize you were doing it for that reason? No, well me, okay, I don't think I was as quite as in touch with myself as I was back then, yeah, no, I am now, yeah. So so that happened and then flash four or five years later, I'm like, I really want this is when I moved up here for the job at IGN, I'm like, I really want to give us another shot, and there was that we had a free membership over at a Kevin what's that place it's not it didn't used to call up you know that place, like Lowe's, Mattata is that gym we used to go, thank you, yes, that's what it was, was Racket because we I used to love playing racquetball with my friends and one of the one time I walked in and I looked over and one",
            "start": 488.42
        },
        {
            "text": "Is that gym we used to go thank you yes that's what it was was racket because we I used to love playing racquetball with my friends and one of the one time I walked in and I looked over and one of the racquetball courts had been low and behold converted into a Jiu-Jitsu hello Jim yeah it was all matted and they would teach judo and jujutsu and like other things and then the other other side of it was like bag stuff so I think they were trying to integrate a little bit more MMA there and I'm like well like it's literally I'm seeing it every day in the back of my mind I've got to try the neon setup and yeah right I'm like all of a sudden also it just pops out and so I give a shot and the instructor was good but again I think it was one of those instances where I just I wasn't able to I just assumed I would get over it or not have to deal with it and I think in doing so that made it worse and so that was about two months of me figuring out ways to not go right you know get maybe once a week\n\nI corrected the following:\n\n* \"racket\" (phonetic error) → no change, as it's likely referring to the sport\n* \"Jitsu\" (proper noun) → capitalized to \"Jiu-Jitsu\"\n* \"judo and jujutsu\" (proper nouns) → capitalized to \"Judo\" and \"Jujutsu\"\n* \"MMA\" (acronym) → no change, as it's a common abbreviation\n* No other changes were made, as the text appears to be accurate and clear.",
            "start": 526.91
        },
        {
            "text": "I would get over it or not have to deal with it, and I think in doing so that made it worse. So that was about two months of me figuring out ways to not go right, you know, get maybe once a week. And then I remember specifically they started teaching judo; I'm like, \"Oh, perfect,\" because judo is more about takedowns, more about throws. I'm like, \"Great, this is a way for me to stand up and if it goes to the ground, I only have to be there for two seconds before they send us back up.\" Which of course is not the best way to learn jujitsu; it's not by doing judo necessarily, and I wasn't sure how to do jujitsu right. So I think that then flash forward – that must have been when I was 26 or 27 – when flash forward 2017, I'm like, \"This is this problem now.\" I'm starting to get to a point where I can thinking about going back to it was getting me to a point where I was noticing that I was having high levels of anxiety and elevators. Right, I was we talked about this a little bit when I",
            "start": 566.03
        },
        {
            "text": "where I can be thinking about going back to it was getting me to a point where I was noticing that I was having high levels of anxiety and elevators, right? I was talking about this a little bit when I have to go to the front of the elevator and stand by the controls to be able to control something, be able to get out faster. You know, I remember we'd be at Comic-Con and they'd cram all these people into one panel room like it's the worst experience of my life, but I couldn't show this right now because I'm with a bunch of people who are you know, I want to be cool in front of. So there was that, and then the real thing for me was when I would get on airplanes - I've never had a problem flying - and then I finally started noticing it when I'd sit in the window seat and someone sat next to me, I'd freak out",
            "start": 611.66
        },
        {
            "text": "I gotta do like when I would get on airplanes I've never had a problem flying and then I finally started noticing it when I think in the window seat and someone sat next to me I was like I'm right so as you're regressing it was area progressing in a great bad way yeah when I remember there was no cycle stories Oh SoulCycle I let me don't get me wrong I love my wife sure and I want to support her and all her endeavors just like any good husband will yeah your marriage I you would completely understand you could be between the lines on that um I my wife taking the SoulCycle now have you ever been to SoulCycle before no I've done spin classes but not there I've heard there's very different there's is well obviously you know at San Francisco so the bikes are pretty much on top of each other gonna have to maximize those revenue streams right this room is that oh it would be yeah I mean it's probably oh the one in my neighborhoods a little bit bigger than this room but yeah it's",
            "start": 651.71
        },
        {
            "text": "other gonna have to maximize those revenue streams right this room is that oh it would be yeah I mean it's probably oh the one in my neighborhood a little bit bigger than this room but yeah it's like there's like 40 or 50 bikes and yeah I mean you're just there's an ass in front of you and two asses right to the side of you packing away for your colleagues to hear this one it has kind of a psychopath um but yeah I walked in and they you you know you have to squeeze through the bikes to begin with and I done SoulCycle before mm-hmm no problems and there was one moment there where the class started the lights go down it starts getting warm you're literally strapped in so your feet you know that's right move there's people all around you and I started to lose my **** and my wife saw it she looked over she started seeing me pedal and slower and slower and slower and she just looked over and she was like breathe now she knows at this point that this is what Nick does and she's seeing",
            "start": 692.39
        },
        {
            "text": "she looked over she started seeing me pedal and slower and slower and slower and she just looked over and she was like breathe now she knows at this point that this is what Nick does and she's seeing it happen and she has never seen it happen I don't think until that point oh really and then she looked over finally and I think that might have been what breaking point for her or not a breaking point but but a moment of like I need to do something courage him to do something about this and so beyond that point that's when I started actively reaching out to therapists to see if there's some way I could deal with this and that's when I got in contact with Dr. Kory Stotesbery yeah and this was also after the bed sheet story mm-hmm so we have this crescendo building right symptoms getting worse and there being this part for you that was very but you just didn't want this to continue or what do you think was like the moment where you're like that's it I've been doing this for 10 years it's over I think",
            "start": 730.01
        },
        {
            "text": "this part for you that was very but you just didn't want this to continue or what do you think was like the moment where you're like that's it I've been doing this for 10 years it's over I think I think it wasn't any one moment I think it was a progression of you know if I look up therapists or if I look up like you know you do you do what everyone does right how to solve claustrophobia right in Google right and that's how we solve everything these days and you know you'd get it specifically there's a big community in BJJ and everyone's very supportive and so you can actually find threads of this no but you know people talk about breathing they talk about a lot of different techniques but ultimately the through line that I would see when I would Google this is that you have to expose yourself to this and you have to find someone either an instructor or you know someone who's a trained professional who could potentially help with",
            "start": 770.93
        },
        {
            "text": "when I would Google this is that you have to expose yourself to this and you have to find someone either an instructor or you know someone who's a trained professional who could potentially help with the process of that and so I thought to my house like well maybe there's some sort of magic cure to it but in reality as I've discovered is there's no real magic cure it's just really kind of that slow steady progression toward the goal and then once that's that first easy goal to achieve you go toward the next one which is pretty much where you come in at saying that we've worked a lot together yeah and I mean I think that is the magic here the formal version of the therapy is called exposure response prevention and it's an idea that anything you're afraid of you can overcome it some people talk about it as inoculating yourself to it or just creating a tolerance to it by introducing it in small comfortable steps that you have predefined so it's not like hey I'm going to scare you and when",
            "start": 813.33
        },
        {
            "text": "about it as inoculating yourself to it or just creating a tolerance to it by introducing it in small, comfortable steps that you have predefined, so it's not like \"I'm going to scare you\" and when you come into the office, I'm going to... yeah, I probably need to plan it. You have to have given a person permission to exert that controller, that stimulus, into your life, and then you also have to have gone through the process of at least perceiving that you have learned the skills to be able to overcome it. And so that was our conversation when we first started developing your treatment plan. I mean, the first step that you did was to have you lying on the ground right on your back, and how we got there was by breaking down... you know, we could talk about so many different versions of claustrophobia, but the one that you have the most investment in was your tight spots with Jiu-Jitsu, and so we broke it down: what did it look like? Would it feel like? Where were you? I mean, in in the",
            "start": 855.12
        },
        {
            "text": "but the one that you have the most investment in was your tight spots right with jiu-jitsu and so we broke it down what did it look like would it feel like where were you I mean in in the book of psychotherapy no detail is too small right sure we may overdo it a little bit sometimes but if you go looking for things you'll find very writing pieces that's very important all right because that because to meet you would you ask you would sit there and say like what is that what is the kind of success look like for you right I'm like wow success for me is being able to roll for however long I want how and given any position and just be totally fine with my right you're like cool so that's our kind of end point right that might not and I should note that that's we're close to that but that hasn't quite been the case for me I still notice every once in a while I'll get into bad spots and I have to tap or whatever we can get now there um so then breaking it back down there from that",
            "start": 905.67
        },
        {
            "text": "quite been the case for me, I still noticed every once in a while I'll get into bad spots and I have to tap or whatever. We can get now there, um, so then breaking it back down from that you're like okay well then let's go okay, so that's that's cool, that's 10 right there, that's why Kristin says 10, that's success, so what then you would say like what is like scale to 1 to 10? I remember that you were like what what is what is like the worst-case scenario freaking out like how does like and I'm like all right now worst-case scenario would be if I go in there and someone puts me in a bad spot, I will freak out, I'll tap out off the mat outside, you're like cool, that's that's 10. What's a 5? Mmm, what's a 4? What's a 3? What's a 1? And I'm like well one would be me laying on the ground right now by myself and no one's around and I just you know there's a cool breeze on my face and I can imagine an open feeling. Like, let's start there, you know. But that that one still created some degree of",
            "start": 946.23
        },
        {
            "text": "myself and no one's around and I just you know there's a cool breeze on my face and I can imagine an open feeling like cool let's start there you know but that that one still created some degree of discomfort right and because I knew there was a - after that I don't wear my figure and then she know you know yeah absolutely though so there is that that part of your brain that that overprotective part of my brain at least that was always jumping to 2 3 4 5 5 right and I mean that was even the the first stage of the intervention was me needing to tell you that you weren't allowed to do more yeah and then which was fascinating yeah maybe well so this is a fascinating thing right you're I mean maybe I'm self-taught maybe people is just societal or maybe I just been fooling myself but the concept of always needing to achieve more if something that's kind of deeply ingrained in me right and so when you would say to me you know your quote unquote homework or you know the things that I want",
            "start": 986.52
        },
        {
            "text": "of always needing to achieve more if something that's kind of deeply ingrained in me right and so when you would say to me you know your quote unquote homework or you know the things that I want you to go practice today or just literally go home tonight same time every night try to make it try to make it a regiment carve out 5 10 15 minutes however long it is be maybe it's one minute maybe it's just lay down for a second right but do it every night you know lay down you're not allowed to do anything else right you know how to watch videos while you're doing of Jiu-Jitsu while you're doing it you're not allowed to put pressure or weight on you do anything crazy just like that and I'm like I don't understand that sounds silly then that sounds simple to simple right I'm like I need to have like I should immediately jump into like no no no no that's your all your Europe so so there's still even in that that part of my brain that's like I'm still expecting something else I'm still trying",
            "start": 1029.39
        },
        {
            "text": "like I should immediately jump into like no no no no that's your all your Europe so so there's still even in that that part of my brain that's like I'm still expecting something else I'm still trying to arm myself for something else and once I got in the groove of doing that I'm like oh well this is like we we've just eradicated one all right cool well good yeah and I think that's part of the beauty of the method is that you're exposing somebody or offering them space to explore something they've never seen that if all a person does is come in and go through the same motions that they've been through here's what I tried but more I'm going to try it again the same thing is going to continue yeah many people have been giving credit for the quote that the definition of madness is doing the same thing over and over and expecting a different outcome right so that's that's what we do is that conversation your problem-solving mechanism went straight to the idea of laying on the ground well",
            "start": 1069.03
        },
        {
            "text": "same thing over and over and expecting a different outcome right so that's what we do is that conversation your problem-solving mechanism went straight to the idea of laying on the ground well no that's usually let's put some weight on yeah I wanted to pull weight oh yeah yeah and and and so by by restricting that you know there we we created an opportunity that if it worked there would be a WoW moment whereas if you found your gains through your method the same method you'd always done it wouldn't have as much impact and so right that's what we I don't know I guess that's the question as did we we get you up to something you had not experienced yes and I think it was just a different way of thinking which is what I had hoped would happen right I think the whole point of of reaching out to find help is to have someone be able to give you that other perspective and I think that's really important like I can't emphasize that enough because if you are having trouble solving a",
            "start": 1116.55
        },
        {
            "text": "out to find help is to have someone be able to give you that other perspective and I think that's really important like I can't emphasize that enough because if you are having trouble solving a problem and you are trying to do it like any other in your brain you can feel like you're attacking us from many different angles but you might not be right and it's not to say you can't like a person like I could not maybe figure some things out on my own given reading resources things like that I'm not saying you can't do that but what I am saying is sometimes an outside point of view is important because it can help recognize that you're all the paths that you think are pretty much actually on the same highway right you might need to take a different road to find that and sometimes that requires a different driver so yes we do",
            "start": 1159.69
        },
        {
            "text": "eventually I'll do a sports knowledge that's not how baseball works but you know even you might need to take a different Road to find that and sometimes that require a different driver so yes we do that and the next progression was I think if I'm not mistaken it was it was lay down and potentially you should put a pillow on your so like that but I think I skipped at that point I was like I think it would be cool to have like find a way to get someone that could sit on top of me mm-hmm luckily I've married someone who was willing to do that which their area yeah for a number of different reasons that we don't have time today to go into well the quick version is that psychologically you have given her permission to do these things just like I said you gave me permission to give you instructions on things to do she has your permission to poke the bear on your anxiety and called her the Wolverine there you go anxiety tends to hang out in our blind spots in a place we don't want people to",
            "start": 1204.24
        },
        {
            "text": "on things to do she has your permission to poke the bear on your anxiety and called her the Wolverine, there you go; anxiety tends to hang out in our blind spots in a place we don't want people to see that if it were overt anything we we were able to kind of think was a positive qualities I'm going to be proud of people would fix it all the time so that that's a lot of why I think why that worked and why it was so valuable to have her and for anybody that that beat the more you can involve people in the conversation and the process of getting better, that's definitely like the book on how to help people as get as many people in the game and that's that leads us to well so we can talk about that my wife a little bit but I also want to touch on the fact that there was it was big moment for me to be like should I tell the people out there you know our community that this happened to me nicely and I think that was you know that that moment for me I think was it was not necessarily scary",
            "start": 1247.47
        },
        {
            "text": "me to be like should I tell the people out there, you know our community, that this happened to me nicely and I think that was you know that that moment for me. I think was it was not necessarily scary because we have you know the best screaming on the internet; we know that we built that, we're can continue to build that - shameless plug to our community members outside. The Kinda Funny guys are awesome, um but you know sharing that telling the guy is telling the guys like what I was doing because I would come in with like a bashed up fingers when I once I started doing Jiu-Jitsu but I didn't want to share that with them; they'd be like \"what's happening\" when you need help, are you you know someone kicking your ass that we don't know about? But then finally being able to sort of be like hey this is this is where I'm at, I'm working on this issue. I think was was good for not necessarily that but I think it really built into like helping me in other areas of life right so",
            "start": 1295.92
        },
        {
            "text": "of be like hey this is this is where I'm at I'm working on this issue I think was was good for not necessarily that but I think it really built into like helping me in other areas of life right so admitting that hey there's this thing that I am working on right now to everyone was this really kind of relief relieving moment for me or I'm like huh cuz no one was like **** right at least they didn't taste like without your assumption of what it would end yeah I mean cuz I'm a man right I'm a five foot eight man **** up go um you know you well there's a lot of bravado is a lot of ego built up into not ever needing help especially in a physical manner right and especially in a discipline like Brazilian Jujitsu where you walk in the whole point is to be dominant issue submit someone I mean that's literally the vocabulary and the verbage that people use is like I'm going to go in there and you choke this person out or they're going to submit to me right that's an intimidating thing and",
            "start": 1335.6
        },
        {
            "text": "that's literally the vocabulary and the verbiage that people use is like I'm going to go in there and you choke this person out or they're going to submit to me right that's an intimidating thing and to have an issue with that and be able to walk into it you know Squad BJJ school and talk to a guy who's got a black belt around his waist who was clearly not D has never dealt with that issue or so I suppose presupposed right um you know that's that something I'm like well this is that I can't choose people they're going to think I'm weak they're going to think I'm a **** they're going to think you know I'm lesser of a man or maybe I'll think I'm less of a man when I see myself in their eyes so that was a good moment for me because I think they not only do people in the comments were they incredibly supportive but people talk you know it opened up a conversation for people to talk about their own levels of anxiety different things and I think that's important too because once you start",
            "start": 1383.23
        },
        {
            "text": "\"Supportive but people talk you know it opened up a conversation for people to talk about their own levels of anxiety different things and I think that's important too because once you start to realize that everyone has something it's it's sad to say but it's comforting it's comforting to know that member that there's no perfect human beings walking around looking down on us from you know from atop their pillowy cloud um everyone's got something they could either work on or should work on are all currently working on that's good well that's a great thing about sports in general and that's why I've liked using be its sports or just general performance as a medium for helping people find change because the allure of Brazilian Jiu-Jitsu on some level is that every person in that room has overcome something they didn't think they could if it was like come to this studio and do something really easy every day and it's going to be the same every day business models over like it doesn't work\"",
            "start": 1428.15
        },
        {
            "text": "something they didn't think they could, come to this studio and do something really easy every day, it's going to be the same every day. Business models over like it doesn't work now goes to that yeah it's it's and you get even you look at that you look at things like yoga and you think oh yoga's gonna be like that but it's not it's actually structured to the point where you can challenge yourself every day and and grow in that or if you're me you can sit in Child's Pose for 95% of it and just chillax right but but that's even the value of that is probably existing to oppose some degree of stress or something that a person needs in their life, where that's my recovery right right and so when life is all recovery we don't tend to be feeling like we're doing well and that perception that I'm not happy or that I wish things could be better if we feel like the balance is off and we've talked just about the idea that humans tend to operate at their best when we are getting",
            "start": 1472.39
        },
        {
            "text": "that I'm not happy or that I wish things could be better if we feel like the balance is off and we've talked just about the idea that humans tend to operate at their best when they are getting better at something yeah that was interesting oh I know I'm glad you brought that back because I wanted such an attitude was that we talked a little bit about when people start to feel complacent or when they start to feel stagnant in their lives and I think that that that was definitely a portion of what I was feeling at least with dealing with this thing which was things I was getting worse because it wasn't dealing with it right I wasn't nailing myself to do it and on some level it was this point with myself and potentially you know kind of beating down on myself for not being able to you know figure this out right um and I think that well actually I'll let you talk to that so what is the actual like psychology behind that and then how does that play into anxiety and even going as far as I play",
            "start": 1517.21
        },
        {
            "text": "this out right um and I think that well actually I'll let you talk to that so what is the actual like psychology behind that and then how does that play into anxiety and even going as far as I play into depression well that's so I guess there's a couple of different conversations to have there one is about the role of diagnosis and pathology so anxiety and depression being kind of diagnostic categories like we have a book that diagnostic and statistics Manual DSM that says if you have this this and this you meet this criteria and now you have you've met the requirements for this disorder and so there's a version of anxiety and depression that are that but then there's also like I'm sad the Warriors lost a game which doesn't happen very often but I'm sad I'll have to be more eventually that's how sports work right and so that's right now yes absolutely and and so you know those those being run-of-the-mill things but one psychological concept is that so for anxiety is an",
            "start": 1557.47
        },
        {
            "text": "that's how sports work right and so that's right now yes absolutely and and so you know those those being run-of-the-mill things but one psychological concept is that so for anxiety is an overestimation of threat or an underestimation of personal resources to handle a threat so I look at a cat my brain sees a lion turns on my sympathetic nervous system fires up my heart rate gets my pupils dilated it's probably a vestigial reflex from when if you're going to buy into evolution when we were animals yeah or not that we aren't animals but so the Springbok running on the savanna from a lion is engaging the exact same system we are engaging when we're in SoulCycle and it's bothering us interesting and so the people for whom that becomes a problem is really just a place where you haven't learned the tools to manage it and therapy becomes a process of learning that but like you said you can learn that in many different places depression is in you know some schools thought to be",
            "start": 1603.61
        },
        {
            "text": "learned the tools to manage it and therapy becomes a process of learning that but like you said you can learn that in many different places depression is in you know some schools thought to be a state of hopelessness of feeling like this will not get better life will not get better I am not capable of creating betterment can which is hard in reality a can a high level of anxiety or a high level of that of what I was experiencing eventually leads you down that road right so a symptom of depression can be anxiety a symptoms of anxiety can be depression got um and and I guess part of that conversation should involve saying that there is a different version of these where they are very clearly neurochemical things that are you're born with and that they're this unrelenting force that is in life and that tends to be the type of thing that medication works really well for well that was yeah so many different things I'm sorry I'm keeping it right no absolutely that was actually an",
            "start": 1658.84
        },
        {
            "text": "is in life and that tends to be the type of thing that medication works really well for, well, that was yeah, so many different things. I'm sorry, I'm keeping it right, no, absolutely, that was actually an interesting moment too because the first time we did when we sat down to do the initial I forget the terminology for it, the assessment of a friend, right? You asked me or like, \"Do you feel like you know is this something you feel like we explored?\" And if you actually ask me if you want drugs but we explore the concept of going down that road of saying like, \"This medication, something that you're open to, is that you think you want, you like do you think you would need or some like that?\" Camera why you phrased it very doctorly and I was like, \"No, I don't like take I don't want to do that. I want to solve this in a different way.\" Which is, you know, however we need to say I don't know how to do it but I don't like the idea of taking pills because just in general across the board like I took",
            "start": 1702.67
        },
        {
            "text": "to solve this you'll deal with anxiety in a way which is you know however we need to say I don't know how to do it but I don't like the idea of taking pills because just in general across the board like I took a Claritin this morning and I'm disappointed like that next time sure sound sorry yeah but so so like I got off track I forgot where we were I totally interrupted you for the fourth well just I mean that part that there are some situations where I think we need to be able to have a conversation that medication is potentially even the best intervention there's certainly disorders such as schizophrenia ADHD where the data is so clear it's medication like right you could do all the therapy you want with both of those disorders you're not going to ever get another brain chemistry yeah and ADHD can have a conversation about accurate diagnosis but that's a longer discussion but so sure that can be helpful medication can make a difference I have seen it change lives you know night and day kind of",
            "start": 1742.43
        },
        {
            "text": "have a conversation about accurate diagnosis but that's a longer discussion but so sure that can be helpful medication can make a difference I have seen it change lives you know night and day kind of stuff um but one of the underlying factors that seems to be most consistent with people getting better from a mental health standpoint is their desire to get better and so if you come to me and say I'd like to get better and I say medication Prozac here you go take it every day and you're like I don't really want this right the chances of it helping go way down interesting and so that was a lot of our conversation about the chance of helping go way down because eventually I wouldn't take it anymore or do you think that it's just not like it's just not in my brain the thing that's going to help me I think there's a it's a very complex answer that on one in one regard mental health stuff is very hard to accurately study we don't have a lab test that can diagnose it we don't have a brain",
            "start": 1788.84
        },
        {
            "text": "help me I think there's a it's a very complex answer that on one in one regard mental health stuff is very hard to accurately study we don't have a lab test that can diagnose it we don't have a brain scan that can diagnose it we don't have another tricorder and it's coming it I bet comes eventually but no we don't have that so it's the only way I can tell how to help you is to talk to you right even filling out charts or scales or whatever doesn't beat me talking to you and so what inherently happens then is a lot of the research that we do on how to help people is influenced by placebo effects and by the power of suggestion and so in that regard I think there are definitive things like very severe depressions depression that has suicidal thoughts things like that medication beats psychotherapy alone significantly Lisa got not hugely dramatic but um it still comes down to does that person want to and so we don't",
            "start": 1837.86
        },
        {
            "text": "that has suicidal thoughts things like that medication beats psychotherapy alone Signor Lisa got not hugely dramatic but um it still comes down to does that person want to and so we don't we don't have a good answer on it because it's so hard to study that to try to develop a study where we can completely control out and know okay these guys were not at all influenced by suggestion is really hard to do so I think that's why when I'm working with people I really try to develop a plan at all points that gets them excited that if what we say by next week or when we talked about goals if you can say man in a year I could I could have this in my life I could be this way if I can get that emotion that anchor of excitement in somebody their outcomes are going to be much better than that's why involuntary psychotherapy is not a thing yeah I can imagine yeah I mean and you know going back to the old I think Bruce Lee said at once where he's like there's no help but self help yeah you'd have",
            "start": 1890.81
        },
        {
            "text": "involuntary psychotherapy is not a thing yeah I can imagine yeah I mean and you know going back to the old I think Bruce Lee said at once where he's like there's no help but self help yeah you'd have to want first and that's very important I definitely saw that in myself too as I started to progress was that I didn't I wasn't willing to I knew if I wanted to get a blue belt in Jiu-Jitsu that was going to be a bigger like not battle in my life but a lot more effort than it was probably for the normal person wasn't dealing with this issue and I think for a long time for a good period I'd shied away from that just because I knew was going to be but I mean I'm a year in now at this point I think we're you know I can't remember we talked about it before but I think I've almost been training Jiu-Jitsu for a year on hand last week happy anniversary and and been training Jiu-Jitsu I think for a little bit last time mm-hmm and so I mean you're in um and still still noticing that those challenges involved",
            "start": 1946.25
        },
        {
            "text": "a year on hand last week happy anniversary and and been training jiu-jitsu I think for a little bit last time mm-hmm and so I mean you're in um and still still noticing that those challenges involved in that but you know like I've talked about before I've said it before in some hot podcast and we talked about a lot too ice like I can look back now into the progression right was I don't think I could have seen that and that first time I walked in and scheduled that first prior there and we should go back into that and talk to people about that process as well but now looking back you know I'm able to do two to three classes a week and they're still excited I walk so like when I walk in I'm like alright you know today might be a day where I you know I get exacerbated and I have you know my gas tank runs out and I can put in a bad spot and I got a tap and I gotta walk outside or I gotta get some water and what's different about the you that does that now then the you did that well yeah I",
            "start": 1987.05
        },
        {
            "text": "tank runs out and I can put in a bad spot and I got a tap and I gotta walk outside or I gotta get some water and what's different about the you that does that now then the you did that well yeah I think well for one the Eva doesn't mean now that is just it's acceptable to do that right I don't see that necessarily as a weakness I see that as a this is just a part of the process and I think framing it you you mentioned something a little of you seconds ago that I think is important framing it in my mind as a positive thing it's a very very important thing right if I walked by or jujitsu school or I walked into class every day and thought oh **** here we go again even the worst thing I'm at basically the worst thing my heart will immediately start beating faster and guess what that'll become a self-fulfilling prophecy yes the important thing to me now is that I don't look at it as training BJJ I look at it as basically training to get over claustrophobia if that",
            "start": 2028.61
        },
        {
            "text": "\"Guess what, that'll become a self-fulfilling prophecy. Yes, the important thing to me now is that I don't look at it as training BJJ. I look at it as basically training to get over claustrophobia - if that makes sense. So when I do encounter those moments, that's good, that's a good thing right because it gives us... it gives us that useful data to be like, okay, but how far in did you do that? Like I remember the first time I got someone put me inside control and I didn't freak out. Hmm, and I was like, yeah. And I actually had for a good 30 seconds of breathing just relaxing - I'm like, I am not freaking out. An answer for you... um, but I was like, but this isn't an immediate reaction. I got sweats, I got put in side control, I was like, you know, I knew where to put my hands and I knew the proper way to go about trying to get out of it because if someone's got me until you're not getting out... but I also know this - I know these things. So I'm like, I know that I might be here for\"",
            "start": 2073.7
        },
        {
            "text": "to go about trying to get out of it because if someone's got to get my questions like until you're not getting out but I also know this I know these things so I'm like I know that I might be here for a while just breathe relax and just know that if at some point you need to tap tap that's fine right but I was very proud of what we had done at that point because I was because I rec I could literally recognize I was like I have never been able to do this before this is never I've never been in a spot where someone could hold me down and I'd be okay with it and just be comfortable being uncomfortable right and that so that gets into a conversation about flow that we could do if you want but that just whole process of having progress checks seeing improvement I mean and I guess part of the strength in that story as well is that you did not achieve the first goal we said oh what that was wasn't writing the emails no well no you yeah that took a little while to your initial goal today",
            "start": 2113.99
        },
        {
            "text": "\"Strength in that story as well is that you did not achieve the first goal we said, oh what that was wasn't writing the emails no, well no, you yeah that took a little while to your initial goal today we met was to get your which belt so blue belt I think I wanted the blue belt in 90 days it was like 90 120 days I'm like getting with six months we because with our conversation was what is the minimum time it would take to get that right and you said here's how much time it would take didn't happen though, so why didn't you quit uh because at some point being goal-oriented on that level that I think that became sort of the equivalent to people doing stuff for material reasons and I started to recognize that where I'm like well you get to a place where like if you set that level of a goal and you know the belt, a lot of people will tell you that you know it's important to have those milestones in your training but a lot of other people will say it's just a piece of color that you wrap around.\"",
            "start": 2159.0
        },
        {
            "text": "know the belt a lot of people will tell you that you know it's important to have those milestones in your training but a lot of other people will say it's just a piece of color that you wrap around your waist to let everyone know that you didn't just start you know I mean I'm very oversimplifying that people who have trained obviously you know there's a lot that goes into getting a blue belt that's really hard but at the same time I'm noticing now that I'm just I'm having fun just training and understanding the mechanics of it and giving that muscle memory down and learning many techniques and ultimately I mean I will I think I'd still be disappointed if I trained for the next five years never got a blue belt but I'm just kind of enjoying the process right now yeah and that's such a cool place to be and I agree that's what I think we've seen happen for you so we set the kind of the summary of the story from a psychology standpoint we set a goal we created an emotional investment in it",
            "start": 2206.55
        },
        {
            "text": "to be and I agree that's what I think we've seen happen for you, so we set the kind of summary of the story from a psychology standpoint. We set a goal, we created an emotional investment in it, like the idea that day of getting your blue belt in six months - that's going to be great, that creative motivation you started working toward it, and then when you got there to the point where you were like okay I know how to get a blue belt, I don't actually want it. And the like right now, that is not what's motivating right so much as my instructors watching me take one correct motion. But if the motivation was the process, the enjoyment of getting there, and and so to not achieve a goal because I can't is so much more difficult than I don't achieve a goal because I don't want to. And the more things that we can put in our wheelhouse and say today is my choosing and it is on my turn, I think there's just so much strength for wellness in that space as opposed to the stories of",
            "start": 2244.05
        },
        {
            "text": "things that we can put in our wheelhouse and say the way today is is my choosing and it is on my turn I think there's just so much strength for wellness in that space as opposed to the stories of can't and won't yeah well I very much and I think there's this there's just so much to pile onto yourself in that regard if you started working on that right because like I said before my brain immediately goes to to the 18th degree of what this could be right and in reality like in if you're training jiu-jitsu like you know I'm around black belts I'm around guys I would train this for 10 to 12 to 15 years that's how long it can take to get that right so if I'm thinking to myself I gotta deal with this crippling like anxiety that I have for the next 10 years that's probably not you know in order to get in order to achieve this goal of a black belt that might not be enough motivation for me to keep going right whereas if I'm just like today I'm gonna train and I'm going to try to figure",
            "start": 2289.93
        },
        {
            "text": "\"Order to get in order to achieve this goal of a black belt, that might not be enough motivation for me to keep going right. Whereas if I'm just like today, I'm gonna train and I'm going to try to figure out you know, I'm gonna try to work on my triangle technique right or my arm bar from Chomper Card right. I'm just cuz I'm just going to drill that if I get a bad spot whatever. But like today, I'm just gonna focus on this, this is my strategy for training today and enjoying today's you know session then I think that's just so much more enjoyable right, you know it's so much more positive right as opposed to saying I'm trying to take I'm trying to climb Everest right now. It's like well let's just get to this money base camp, this is like let me get to the airport right hang out have a latte but it's interesting that the narrative legendary the narrative of a child development isn't that there are a bunch of seven year olds you know hanging out today saying man I really want to go up and be that\"\n\nI corrected the following errors:\n\n* \"Chomper Card\" ( likely a reference to Chomper, a character from the Pokémon franchise) -> \"Chomper Card\"\n* No other significant changes were made, as the text was already coherent and grammatically correct.",
            "start": 2335.02
        },
        {
            "text": "interesting that the narrative legendary the narrative of a child development isn't that there are a bunch of seven year olds you know hanging out today saying man I really want to go up and be that guy who gets better at things okay you know they were there it's a story of how we develop heroes and the role heroes play in our lives and help us serve as guide points and so that it's a very this story of with the the idea is kind of wrapped up in and the concept of the growth mindset Carol Dweck wrote a book called Mindset: The New Psychology of Success an idea that the fixed mindset says I was born this way I end this way it is immovable people who are great were born that way with a special gift and I was not the growth mindset says life and people are totally plastic and modifiable and that if we want something and are given the method to get there we can get to anything and that really has resonated with me and my work as a therapist just seeing how often and predictably people can",
            "start": 2370.99
        },
        {
            "text": "if we want something and are given the method to get there we can get to anything and that really has resonated with me and my work as a therapist just seeing how often and predictably people can turn their lives into whatever they want when given the right method and and so it would be really great and I think that's what is kind of cool about what we're doing today about offering people an opportunity to hear that there are people out there like that that could be those heroes I know for me that Tim Gettys was an example in that where his career is really built off of innovation and and trying new things in developing and testing and and that's where people who do that like I said I think just really exist in a great space I think that video games offer a great entry point for that because you get a new game you go through learning it I build better skill at it especially now with games with leveling up like it's this planned projects literally strategy that goes into this you have",
            "start": 2420.61
        },
        {
            "text": "you get a new game, you go through learning it, I build better skills at it, especially now with games that have leveling up, like it's this planned progression literally strategy that goes into this, you have to rely on your prior knowledge and be able to see that I am capable of getting better right, and so that's an interesting piece, it'll be interesting to see now that we have moved away from games that weren't that way, yeah Super Mario was not a game where you were better at the end than where you were at the beginning, you potentially got a little bit better, right, right, and so now these people who are kids growing up now with that experience of well I can get better at something it'll be interesting to see what they do, yeah it's actually pretty fascinating too because obviously when we started doing this, I started getting more and more back into gaming and so I shied away from which actually something I've just",
            "start": 2468.73
        },
        {
            "text": "actually pretty fascinating too because, obviously when we started doing this, I started getting more and more back into gaming, and so I shied away from which actually something I've just realized right now - I'd shied away from those levels of experience because it took either too much of me; I would say I would take too much time but it's the time commitment, but it's also the mental commitment of having to learn the intricacies of leveling up in games like you know fixing your weapons letting off your weapons doing side quests to get different resources to make different things like that's a lot of stuff that goes into that and so I would gravitate more toward like platformers or it's like, like I'm Mario, alright we're like yeah you do have to have like the game does progress you in a certain way you do get slightly better at it but you don't necessarily have to worry about leveling up Mario's mushroom it's not going to be there for you it's not converted for you I'm",
            "start": 2508.99
        },
        {
            "text": "you in a certain way you do get slightly better at it but you don't necessarily have to worry about leveling up Mario's mushroom it's not going to be there for you it's not converted for you I'm like I like that there's simplicity that I can understand around my head around there but yeah when you start opening up yourself to those other experiences I think those exactly a lot to be gleaned from that and I'm actually better at playing those games now there's a game that I like to play a lot or I'm making it more unfortunately but it's series called Deus Ex and that I was drawn into it by the style of it but it's actually a fairly complex game with a lot of RPG elements not a ton of strategies to go into it but still you have to there's a lot of problems on it that's wrapped up in that and by the end of it I'm like oh I get this and then I started playing you're familiar with games so I went from that to Bioshock and I had hated Bioshock when I first played I was like a pariah in the",
            "start": 2545.69
        },
        {
            "text": "by the end of it I'm like oh I get this and then I started playing you're familiar with games so I went from that to Bioshock and I had hated Bioshock when I first played I was like a pariah in the office because everyone like you hate Bioshock out of your mind this is like an this is like the game Doug - yeah I mean like Ken Levine, God, like this is a game that you play that that's put on the same level as like you know in movies like Blade Runner or things like that it's a cultural achievement and I'm like - don't get me wrong, it's not cool, shooter, I would make excuses for why I was like I don't want to learn how to play this game went back and play Deus Ex and I'm like oh I get it these skills that I developed over here maybe they don't apply one-to-one but they're applicable I understand now they like the mentality I'm supposed to have in doing this and it started it went from being a short of being like incredibly enjoyable",
            "start": 2583.04
        },
        {
            "text": "apply one-to-one but they're applicable I understand now they like the mentality I'm supposed to have in doing this and it started it went from being a short of being like incredibly enjoyable and low behold of course it was wrong Watch Dogs amazing it was amazing game and I think that's that's something that I've seen mirrored there but I think also the reason why I'm able to recognize that is because we've looked at the progress that I've made achieving the goals of you know in training jiu-jitsu and we've applied that across the board other things were in my life right we apply that to my writing we've applied that to my stand-up comedy things that I'm that I'm trying to achieve that I've always had his goals but I was kept in the back of my mind as saying look that's there you're never going to achieve that that's like that's so many different steps and you don't have what it takes and you're not that guy and like exactly what you're saying which is therapy will that are born to do",
            "start": 2619.85
        },
        {
            "text": "going to achieve that that's like that's so many different steps and you don't have what it takes and you're not that guy and like exactly what you're saying which is therapy will help you do this stuff you're not one of those people right right but if I'm being like if I can toot my own horn for a second looking back on all the things that I've accomplished I I think I am one of those people I don't think I was born as such to do it but I've clearly figured out how to get to this point where we've got this this you know home built studio and we're able to grow our audience that of people who actually care what we have to say so those skills were very very fascinating specifically the breaking it down skill right the what a success looks like okay what can we do right now to start start off my journey and also that mirror it sort of like anxiety scale of like what's your what's the worst thing that could happen right no one laughs",
            "start": 2661.55
        },
        {
            "text": "start off my journey and also that mirror it sort of like anxiety scale of like what's your what's the worst thing that can happen, right? No one laughs, which by the way is way worse than you think. And habits all the time, that's so hard, especially with open mic comedy nights where you're just like everyone's there right just to do their comedy then they want to leave and they don't want you to be better than that point. But so that's like the worst that can happen or the worst actually I think it happens like that gets recorded and was like this guy's an idiot and boom your career is over but that's even then that's not the case. And so you know breaking that down it's like okay what's the first thing you do, like Google open mic night, but that's all I had to do for a week right? And then working from there forward and also what that structure involved was coming up with something that you could guarantee to yourself you would",
            "start": 2701.66
        },
        {
            "text": "that's all I had to do for a week right and then and then working from there forward and also what that structure involved was coming up with something that you could guarantee to yourself you would do right so to come up with plans and say I'm going to do this next week and you know if it's going to be I'm going to go do an open mic night at the most competitive comedy club in San Francisco if you end up doing it great like but the the risk reward ratio is so off right that the in the initial phase of building momentum for goal achievement you don't want to be going high high risk moderate to high reward you want to go low risk moderate to high right it's like it's like the I don't know if you've ever watched How I Met Your Mother I just remember there was a great episode where Barney's like I could run a marathon right he just goes and there was like no you have to train for a marathon and he goes runs the marathon and they get stuck in the subway because this is art",
            "start": 2737.33
        },
        {
            "text": "I could run a marathon right, he just goes and there was like no you have to translate knowledge burning marathon and he goes runs the marathon and they get stuck in the subway because this is art his legs don't work after that right so it's some of that right which like you don't if I could probably try to climb Everest right now right I could probably just if someone putting on a play and I could start but I'd guarantee it would not have right correct effect than I probably ever climb a mountain again well that's where these guys out there like Wim Hof are going to you know show you that I can breathe a special way and I'm going to go climb Everest in just my boxers and not get frostbite and not die right and so it's great to see that that's out there I can do that and achieve that but let's let's make it smaller let's what can we do today right that you will guarantee yourself you will do that one year from now will be 10% 50% on your way to your goal because that's a guaranteed",
            "start": 2781.97
        },
        {
            "text": "let's let's make it smaller let's what can we do today right that you will guarantee yourself you will do that one year from now will be 10% 50% on your way to your goal because that's a guaranteed model that is saying that and that's a sustainable model right that's which is this is very important right if my goal you know in writing for instance was just to open up my laptop mm-hmm well there's no I mean I can do that anyone's run about right and that was one of the things too when I was getting stuck in a rut with a lot of you know I was noticing that like because the the training in Jiu-Jitsu was hard or then I had expected and we were dealing with you know getting me to classes and that was that was having an effect on me emotionally I was like I wasn't writing as much and I was you know that was disappointing too and I would also start that cycle of like **** you know like I'm failing across all boards but even though I wasn't I was progressing nicely but if you can feel like",
            "start": 2816.99
        },
        {
            "text": "know that was disappointing too and I would also start that cycle of like **** you know like I'm failing across all boards but even though I wasn't I was progressing nicely but if you can feel like it's hard to gauge where you're at when you're in the when you're in the the middle of things and so you would you know we would work together and you would say something like we'll just go to your laptop tonight open it up I'd like how do you write I'm like well I use I run our web browser cool open up the web browser right then check your laptop and do else you want to do do that for five days straight right by the third day I was writing right and that's okay I just started putting words on paper I'm like oh I just wrote for an hour and a half right and we and we've talked about that as that's kind of art of war stuff where the indirect techniques the flanking techniques or the way that you want to approach things for the highest yield interventions because you are going you have",
            "start": 2861.48
        },
        {
            "text": "That's kind of an Art of War thing, where the indirect techniques, the flanking techniques, or the way that you want to approach things for the highest yield interventions because you are going - you have a system in place, you have this complex psychological mental structure to keep the status quo going. Your brain thinks that today is the zenith of its ability to protect you and create greatness in your life, and so when you're like, \"Hey, I want to change something,\" that's not however like a rebel decided yes, you've liked trained it to think that way right? Um, and so you have to like avoid those resistances, and that's what we did with Jiu-Jitsu. The first step you needed to do is get set up with a trainer and or your coach Ryan right all right go in add I want to go in all right email them all right I'll email them to Gmail No No so we go by yeah yeah not even what do you need to do to get there that was writing right you're right, your screenplay I didn't write it why didn't you.",
            "start": 2895.08
        },
        {
            "text": "them all right I'll email them to Gmail No No so we go by yeah yeah not even what do you need to do to get there that was writing right you're right your screenplay I didn't write it why didn't you alright well and then was using your wife again right and and and so that's and yeah so I mean to go back to that that was where I think yeah I mean so this is so everyone out there can see so the level of progression is it ain't pretty but it is what it is right and so you know going back to me broaching the topic with my wife and say look I need you to do this of course she was like sure I don't care like spoilers she's late on taught me before one supplies and so she was like that's cool and I'm like be serious about to so you can like get on stuff Greg so I can you bring me a tissue and maybe a sugar-free Red Bull do you want one I'm good think okay so it is that my allergies are just the worst these days and I keep going to different areas so keep going like Austin",
            "start": 2940.65
        },
        {
            "text": "and maybe a sugar-free Red Bull, do you want one? I'm good. Think okay, so it is that my allergies are just the worst these days, and I keep going to different areas, so keep going, like Austin, and then like I like the in Cooper, and every time I get off, and I'm like, oh, good new polyps, yeah, thank you, sir. Oh, good, yeah, just a roll of flypaper, that's how that's have a fresh cycle here, yeah, we go well, yeah, of course, I would be, apologies, so she of course at yes and then it was that was another kind of aha moment to I was like okay what I need you to do is just the whole like sit on me in a certain way um and it's I don't know if it was good or bad but obviously there's there's a connection I had with my wife on a sexual level so I'm like well this is a little bit easier than asking a random dude right to do this because I've obviously been in this position before with my wife and so she did it and we would start talking and I just I then I had that one aha moment like oh I'm not freaking out right",
            "start": 2981.66
        },
        {
            "text": "to do this because I've obviously been in this position before with my wife and so she did it and we would start talking and I just I then I had that one aha moment like oh I'm not freaking out right now this is one I could stay here forever the sun the view is great and and I can breathe and everything's cool thanks her and so that was a good that was a big step for me for cuz I'm like if I could do this here that odds are if I can then I can do it in other situations with people I just need to and a big component that was that initial email that I wrote the reason I had a problem writing it was because I didn't want to admit that I had a problem the whole point of writing the email and reaching out to a coach to begin with was to tell him that I needed to work on this thing right and so I reached out to the head instructor at this gym that I currently go to and he referred me to one of his brown belts and so the next step that was air was just meeting with this person",
            "start": 3030.98
        },
        {
            "text": "so I reached out to the head instructor at this gym that I currently go to and he referred me to one of his brown belts, and so the next step was just meeting with this person and like doing the initial assessment. I should mention, of course, there's a cost associated with this as well, so there was an additional fee for the private session, which got a little expensive. But every time I would go in, I'm like, \"This is totally worth it.\" And again, in my brain, I'm like, \"Oh, I mean obviously, I want to spend a lot of money. Am I really gonna pay this much money to deal with this problem?\" And then eventually the fear that was there was yeah, I'm gonna keep doing this because the first time I went in and did it and was able to sort of start the real process for when my brain was ready, which is like, \"I'm gonna get the brown belt in front of me, and if he doesn't tell him to stop, he'll strangle me.\" Well, granted, I can strangle myself, but you know, I mean like",
            "start": 3073.31
        },
        {
            "text": "when my brain was for real which is like i'm gonna get the brown belt in front of me and if i don't tell him to stop he'll strangle me right well granted i can strangle myself but you know i mean like he'll he'll push me to that limit not knowing and so i have to physically i had to sit him down like this is what i'm not here to study jiu-jitsu i'm here because i'm claustrophobic i've had these panic attacks before and mount and inside controlling into various positions and i need help with this and it was funny because i walked in with it with the the assumption that no one in the history of ground grappling or wrestling has ever had this problem before and i had a weakness that was that i should keep in the dark because shame on me and was exactly and one of the first things he said to me was like oh you know it's funny i just that you just totally reminded me of something when i first started when i was like 15 i would freak the **** out when someone grabbed my legs right so like",
            "start": 3112.79
        },
        {
            "text": "like oh you know it's funny I just that you just totally reminded me of something when I first started when I was like 15 I would freak the **** out when someone grabbed my legs right so like you know a technique obviously is if you're trying to pass someone the legs you grab them when you see this in wrestling to stuff the legs and you kind of climb up a little bit and I never I promise I don't like how people do that it's great but he was like I would freak out and I would have these crazy panic attacks because to him that was that that sort of triggering moment for him was like **** this is this is real um and I'm like huh okay so maybe I'm not crazy here and then obviously I you know I did some research and chose a studio that's or school rather that's very like has really cool people and the head instructor is very very cool there as well and so a little by little it became just kind of okay to tell people like this is what I'm working on",
            "start": 3157.01
        },
        {
            "text": "very like has really cool people and the head instructor is very very cool there as well and so a little by little it became just kind of okay to tell people like this is what I'm working on and so we went I went I think I did a couple months of privates and it was tough like there were moments where like I'm like this is going to be difficult but but you can you can sort of like in the class itself and in those privates that could be whatever you needs to be it could literally be a five minute class it could be a hour-long class of arm bars or it could be you know 20 minutes of on-again-off-again like you know mount escapes things like that well and I think that's that would be my my challenge to our society and the microcosm of what you just laid out is so perfect because somebody that you respected normalized it yes ed I am that way as well and and unfortunately due to the stigma that's associated with it like you had to be in this place of feeling like this was a problem whereas",
            "start": 3193.81
        },
        {
            "text": "you respected normalized it yes ed I am that way as well and and unfortunately due to the stigma that's associated with it like you had to be in this place of feeling like this was a problem whereas if we were able to have open conversations with amongst our people about how you know I'm going to reveal my fear of something and it won't cause ruin or won't make me look weak right that's that's next level development for how we help people move this stuff along it's one thing to say go get help it's another thing to model how to do this well and how to have conversations about it and how to open up that line of discussion that I don't think we will see mental health achieve what it can until that becomes okay to talk about in public space and that's obviously part of the reason why we're doing this right is to is to try to at least on some level as much as best as I can help to break down that wall of it that's stigma that that is surrounding mental health right saying like you know the",
            "start": 3239.63
        },
        {
            "text": "doing this right is to try to at least on some level as much as best as I can help to break down that wall of stigma that surrounds mental health, right? saying like you know the word you mentioned the other day that you think that the word \"crazy\" will be treated in the same way with the same respect that the word \"gay\" is treated now, right so it won't be used as a pejorative anymore people won't say I feel **** crazy right now you're crazy are you crazy right and I never thought about that before similar to how you know when I was fifteen obviously I didn't think twice about calling someone gay or saying something was gay right well now that word my brain has a whole new meaning I'm happy to live in San Francisco having you know being 37 reading a lot you know right being around gay people a lot like obviously you treat that with a little more respect because it's real to you whereas I think that yeah again the notion of seeing someone to help you mentally",
            "start": 3293.93
        },
        {
            "text": "around gay people a lot like obviously you treat that with a little more respect because it's real to you whereas I think that yeah again the the notion of of seeing someone to help you mentally I think is still seen very much as taboo in the dark right and it's unfortunate because you given the nature of your client or your doctor-patient privilege you can't talk about this stuff literally can't remember else I have to imagine you know a group of guys and like white lab coats come take you away I never see you again right I don't know how the Board of Medicine works or not but in the other way we take them away got it but I mean and that's a good point that the power of what we could bring to mankind let's say if I could end a session go Wow here's some great thing that happened or if somebody could leave my office and tweet out just had this realization and now I feel so much better the more that iterations of that occur in the human space of information now it's okay to talk",
            "start": 3336.08
        },
        {
            "text": "if somebody could leave my office and tweet out \"just had this realization and now I feel so much better\" the more that iterations of that occur in the human space of information now it's okay to talk about and now it becomes kind of commonplace and so that that exists in fitness and nutrition where somebody's going to leave their personal trainer today and say something great about what they did they're going to go on a run and hit a personal record and brag about it and I think when we can get to a place where people could brag about getting better with their claustrophobia and that's just how we should talk to each other as people right we eradicate most mental illness I think that I mean again I think as well that is about framing right so I think you know I mean unfortunately maybe this is just a half measure or step that has to be taken not half measures rather but the initial step of saying like look yeah guide people like me like this cemented that is actually",
            "start": 3383.66
        },
        {
            "text": "maybe this is just a half measure or step that has to be taken not half measures rather but but but the initial step of saying like look yeah guide people like me like this cemented that is actually making me stronger versus make me stronger mentally right so I think that obviously the reason people like leaving the gym is because they have something physically to show for it like look at how big my arms look or look at how skinny my waist has got a six pack abs like don't you want to be like me but there are those people that I admire that go out there and like like the one thing I've always wanted to do and never had the balls to do it largely because I didn't work out that much it's like it's do that hey here's a picture with my shirt off I'm going to try this for six months and see if I can get better at this but that requires a level of vulnerability that a lot of people just don't want to they don't want to have don't want to put themselves out there that way but given the",
            "start": 3432.38
        },
        {
            "text": "if I can get better at this, but that requires a level of vulnerability that a lot of people just don't want to - they don't want to have to put themselves out there that way. But given the nature of my career, it's almost counterintuitive not to do that because the whole reason that people like us is because we have these shared experiences with them. Like maybe we don't know it, but I'm sure there are people out there who are going through the same thing I'm going through, that listen to me and might be like, \"Oh, okay, hopefully this helps.\" And I think it's getting there. And I think one of the things that's really important to touch on is that there are a lot of people out there that I look up to who do exactly what I'm trying to do right now - which is share that level of vulnerability and say, \"I do have a problem,\" and this is how I overcome it. Or maybe I failed, and there's value in that - value in saying like, \"I didn't, it didn't work for me.\" Yeah, but I think",
            "start": 3470.24
        },
        {
            "text": "level of vulnerability say I do have a problem and this is how I overcome it or maybe I failed and there's value in that value in saying like I didn't it didn't it didn't work for me yeah but I think that every time we do that it really does break down that barrier of of that priest's presupposition of that person was born that way all right like Arnold Schwarzenegger wasn't born with a you know a record-setting body he had to achieve it somehow well then just listen to interviews with him and consistently people in that that and it's in Fitness it's an investment like invest venture capitalism the hallmark of it is that you're going to strike out 99% of the time so you got to just keep trying until it works right and and when we hear those stories it's germane to us it makes sense but if I say the same thing about overcoming a mental illness like oh but I you can't and and that's just right that's not the actual experience on the treatment provider and but because we have to like you said",
            "start": 3506.45
        },
        {
            "text": "same thing about overcoming mental illnesses like oh but I you can't and and that's just right that's not the actual experience on the treatment provider and but because we have to like you said hide in the shadows a little bit which needs to happen we need to meet no of course I'm ality of it yeah of course it's less about you I'm not saying put a you know go out there and start tweeting about stuff but I am saying for people you know who are out there that may be in a fortunate position to have something like this I do not want to encourage them to share this because the experience isn't always positive for me um it's works and that's important to say you know I said that guy I haven't just seen progression on any progression to the point where I've got my first draft on my white belt I'm on the way to feeling good about being a white belt which is generally when people get a blue belt right right when you start feeling like hey I've got a handle on things",
            "start": 3551.54
        },
        {
            "text": "on my white belt I'm on the way to feeling good about being a white belt which is generally when people get a blue belt, right. Right, when you start feeling like hey I've got a handle on things, that's when they put in the belt on you, can't the whole point of it be right? You're supposed to always be sort of a little off kilter and so you know I think it's important to talk about that and I think there's a 30,000 foot version of what we've done together is that it hasn't just been we improved your jujitsu, your writing, your comedy, your work here. That this has actually been a year-long process of you getting comfortable putting yourself out there definitely, could not have happened the first time I walked in your office right. I could not have said let's explore this oh by the way I do a podcast you want to come on in tonight, not going to happen right all right so if we change the conversation to being about that what we're actually saying is that we're not done that there",
            "start": 3595.88
        },
        {
            "text": "Way I do a podcast, you want to come on tonight? Not going to happen, right. All right, so if we change the conversation to being about that, what we're actually saying is that we're not done, there are going to be more things for us to work on and think about and challenges to create, and that Nick's developing more and more challenges - who knows what's next? And I think that's so exciting to be able to say to every single person if you go to this space, whether it's therapy or something else that offers you that access to improvement, it's guaranteed, and that's so powerful. I agree. Well, unfortunately, think about yeah absolutely. This is good solid power on the topmost we. I would love to keep doing this, and maybe we'll have to do another one. We should actually ask to do another one of these living on the road when we don't have a morning show to do in 15 minutes, yeah Kory. I appreciate come on, yeah absolutely. It's been awesome, thank you so much for all your help obviously over the year.\n\nI corrected phonetic mistakes and spelling errors, capitalized proper nouns like names (Nick Scarpino), and kept the original meaning, slang, and grammar intact.",
            "start": 3635.39
        },
        {
            "text": "living on the road when we don't have a morning show to do in 15 minutes yeah Cory I appreciate come on yeah absolutely it's been awesome thank you so much for all your help obviously over the year yeah and for coming here today and yeah for anyone else out there do you want to give anyone any parting messages or if they I don't know if there are any resources you would like to talk about or if they want to follow you if you want people to follow you sure have a Twitter um you want to be there so my practice is SF Bay Psychiatry that's sfbaypsychiatry.com at SF Bay Psychiatry on Twitter and then we also have a consulting arm that we're working with like Equinox Fitness is one of our customers as it would be and just working on developing that kind of system for people who want to work on predictable improvement and that is optimum performance consulting optimumperformanceconsulting.net or at optimumperforms on Twitter thank you awesome cool well she makes me a convenience",
            "start": 3681.8
        },
        {
            "text": "Nick Scarpino sits down with Dr. Kory Stotesbery to talk about his anxiety management process, which has helped him achieve goals in Jiu-Jitsu, comedy, and life. He mentions working on predictable improvement for optimum performance consulting, noting that it's a convenience he appreciates.",
            "start": 3725.88
        }
    ]
}