{
    "id": 2821,
    "video_id": "Tjja_x2J6mk",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Actors That Turned Down Crazy Roles - The GameOverGreggy Show Ep. 189 (Pt. 3)",
    "description": "Thanks to Blue Apron for sponsoring this episode. Go to BlueApron.com/Greggy and use promo code Greggy\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1500447601,
    "duration": 1584,
    "transcript_chunks": [
        {
            "text": "Sir, stop put down the shoe. I know you're hungry. I know you're busy. I know cooking can be intimidating, but our sponsor Blue Apron makes cooking so easy. You don't have to eat your footwear for less than $10 per person per meal. Blue Apron delivers seasonal recipes along with pre-portioned ingredients to make delicious home-cooked meals. I love cooking, and when I was getting my chef legs, I was all over Blue Apron because it was easy and it was fun, and I knew what I was doing. There were instructions; it was great. So, what's on the new menu? Well, there's seared chicken and creamy pasta salad with summer squash and sweet peppers. Creamy shrimp rolls with quick pickles. I don't know that's... I, I love... I've never heard of a quick pickle, but I'll tell you right now, I'm in 100%. I'm in. Sweet potato wedges and fresh basil fetuccini pasta with sweet corn and Cuban pepper. I see; I cook a lot. I don't even know what Cuban l pepper is, but it sounds good. If you don't like those items, they don't sound good to me.",
            "start": 0.21
        },
        {
            "text": "and fresh basil fettuccini pasta with sweet corn and Cubanelle pepper. I see, I cook a lot. I don't even know what Cubanelle pepper is but it sounds good. If you don't like those items they don't sound good to you, it's no big deal. You get to pick what Blue Apron sends you so don't sweat it. There's tons of options. Check out this week's menu and get your first three meals free with free shipping by going to blueapron.com Greggy. You will love how good it feels and tastes to create incredible home-cooked meals with Blue Apron. So don't wait, that's blueapron.com gregy. Blue Apron, a better way to cook. And you don't have to eat your shoe. Welcome back Andy, yay. I kept trying to make eye contact, I kept trying to make eye contact with you over there. Yeah because I was going to ask you to rub my back while the other topic was going on. You know what I mean for the record Andy, you're my dream Dad. Yeah okay okay so I was thinking about uh dream dads. I just thought of two of them uh on that I would really",
            "start": 47.92
        },
        {
            "text": "the other topic was going on you know what I mean for the record Andy you're my dream Dad yeah okay okay so I was thinking about uh dream dads I just thought of two of them uh on that I would really love to that you date or that you would be uh that I would love to date yeah yeah uh Dennis Quaid yep oh Dennis Quaid is actually a great just like he's just a dad right we haven't started topic three yet we're still yeah this is a great Point actually wait let's talk about Dennis Quaid for a second wait does Dennis Quaid come attached with Randy Quaid like you got see him well I mean maybe you'd see him at like yeah Randy qu has a great Twitter great Twitter um well Randy Quaid's the one who thinks the governments after him right yeah he also yeah he has a giant beard now um I'm down with that he just took yeah he just recently was somewhere where he was near a giant tank and he was like coming after you North Korea or something like very weird very weird quid Dennis Quaid seems like yeah",
            "start": 107.08
        },
        {
            "text": "he just took yeah he just recently was somewhere where he was near a giant tank and he was like coming after you North Korea or something like very weird very weird  Dennis Quaid seems like yeah salt of the earth father he seems like he'd be really good do you remember when they did that course do you remember when they did that fake viral video with him where he he quote unquote lost an on set and it just happened on like a Monday and then on Tuesday they released the rest and it was all  it was all tiean that Monday though I was devastated I remember I did not that was during the Gauntlet Season 2 oh wow yeah I just did not want to believe that Dennis Quaid would be that man and he turned out not to be that man and he raised a fine son of course in Jack Quaid that we know Sasquatch sketch so there you go you can tell that he'd be a good dad because he raised Jack real well and then Denzel Washington I would gladly I would gladly I would gladly I would gladly date Dennis Quaid",
            "start": 147.04
        },
        {
            "text": "So there you go, you can tell that he'd be a good dad because he raised Jack real well and then Denzel Washington. I would gladly date Dennis Quaid and be Jack's stepdad now you can move on and Denzel Washington from Remember The Titans - see I didn't like him in that movie \"What I Like to Remember the Titans\" fine, I like Remember the Titans fine but he was kind of a dick, you know what I mean? He was with his family like he was a great dad dude, but I remember him more as just being a dick coach. You know what I mean? I like his coaching - he had to be a dick because racism was happening and he had to show the people who wanted to be racist, \"Hey, I'm not taking that.\" Alright, sure. No, that was good. I'm here to be a good coach and yeah, he was kind of a dick to the other coach because he got kicked out or whatever but the way he treated uh his",
            "start": 188.24
        },
        {
            "text": "Not taking that **** all right sure no that was a good I'm here to be a good coach and yeah he was kind of a dick to the other coach cuz he got kicked out or whatever but the way he treated uh his his um the other coach's daughter and his own daughter like he just man what a **** solid the other coach's daughter Hayden Panettiere yeah Hayden Pan yeah that's right next time you're thinking about masturbating her remember her from Remember The Titans and you won't will you because that's how it is every every girl's a daughter top three nice Every Girl's a Daughter Dad's back in please don't July 13th okay what's your topic Andy my topic is um you know when I already love it um hold on hold on I gotta find my gotta find my stuff Washington I just saw him in Fences you don't want him to be your dad from that he was very bad dad very intense very angry I like Denzel Washington a lot but I'm struggling right now to think of a heartwarming Denzel Washington role because I'm thinking of Fences",
            "start": 229.0
        },
        {
            "text": "be your dad from that he was very bad dad very intense very angry I like Denzel Washington a lot but I'm struggling right now to think of a heartwarming Denzel Washington role because I'm thinking of Training Day, think oh uh I'm John Q or oh yeah but even then he was very angry Washington is often in Man on Fire **** what was that yeah M what else was he in Philadelphia he was a lawyer good man I'll come back to your topic so Denzel Washington's the topic yeah well no um it's similar to that um so you know when things that could have happened didn't happen and you always think of what could have been yeah I'll never forget her uh so Bubbaloo, recently oh yeah so Bubbaloo uh had there was a ripoff brand called Bubbalicious and they have jelly inside I don't never mind we're not going to do the gum topic we'll do we'll do a different topic um uh movies where actors turn down roles anything you think about what could have been right so some notable ones um uh really interesting",
            "start": 278.48
        },
        {
            "text": "to do the gum topic we'll do we'll do a different topic um uh movies where actors turn down roles anything you think about what could have been right so some notable ones um uh really interesting for Pulp Fiction um where they wanted Michael Madsen to play Vincent Vega right ah um but Travolta took it instead but well he couldn't end up doing it so they were like Travolta a strong second chance or a strong second option right that totally that put his career back on track yeah absolutely yeah absolutely um then we got Broken Arrow one you all probably didn't know this one is really really interesting the way you're delivering it like is like you're going into an Andy joke but I know this is serious like this is your real topic it's very very serious um Bad Boys uhhuh mhm the original options for bad boys were Dana Carvey and John Lithgow whoa yeah in like that before Michael Bay decided that he wanted to make a movie that people would actually want to go see Bad Boys was intended as",
            "start": 336.08
        },
        {
            "text": "for bad boys were Dana Carvey and John Lithgow whoa yeah in like that before Michael Bay decided that he wanted to make a movie that people would actually want to go see Bad Boys was intended as a vehicle for comedy actors Dana Carvey and John Lithgow both of whom were renowned for their work on NBC Saturday Night Live at this point in time the movie was called Bulletproof Hearts Oh I thought it was just going to be bad boys but with an S instead of a Z less less ethnic yeah the movie was called Bulletproof Hearts because for some reason they really really really want to make money at the box office except somebody decided that Bad Boys shouldn't star Carvey and Lithgow at all and Will Smith Martin Lawrence the notable characters were cast as buddy cops Mike and Marcus respectively transforming the series into a far hipper more crass and violent venture than first intended so I guess it was going to be more like high school high yeah yeah man wow yeah my my my love drops are on point",
            "start": 385.12
        },
        {
            "text": "the series into a far hipper more crass and violent Venture than first intended so I guess it was going to be more like High School High yeah yeah man wow yeah my my my love drops are on pointed High School High Holy **** I don't remember I don't remember High School High which High School High where Love It was a teacher right and a part of Dangerous Minds God okay I feel like the last time I was like able to I feel like me and John Lithgow were in at the end of Furious 7 and pulled away right about Rat Race where I was like we got to go our separate **** Rat Race what you talking what are you talking God I'll tell you what don't get me wrong you know we I've learned a lot in my days of course you know what I mean where we talk about this a lot where okay people on the internet just don't like Greg Miller and I'm like oh that kind of sucks I try real hard and I you know I understand I'm might put a cup of tea you shouldn't hate me so I I've gotten over that with other people but let",
            "start": 429.84
        },
        {
            "text": "like Greg Miller and I'm like oh that kind of sucks I try real hard and I you know I understand I'm might put a cup of tea you shouldn't hate me so I I've gotten over that with other people but let me tell you what if I'm lying I'm dying Tim back in the day I **** hated Mr. Bean I **** hated Mr. yeah I did yeah I did see Mr. Bean ruled man yeah I when he'd come on they because he was on Comedy Central every so often with the **** Mr. Bean garbage and you'd watch him I'm like this creepy **** skeleton **** get out of here cuz you ever seen like in the horror cartoons the horror those like dancing skeletons or whatever that's Mr. Bean when he's dead right now he's alive and he's doing the weird Goose stepping stuff going down chimneys and I'm not about that life I don't want I don't I know no I'll tell you where the turning point for Mr. Bean of course Love Actually I was like well this picture is just wonderful and I can put up with your **** here but I think I I matured into not",
            "start": 474.08
        },
        {
            "text": "\"No, I'll tell you where the turning point for Mr. Bean, of course Love Actually. I was like, well this picture is just wonderful and I can put up with your **** here, but I think I matured into not hating him. The scene at the end of Rat Race where they're all crowdsurfing to Smash Mouth's All Star didn't do it for you. It's weird how that like, that's a song that definitely just came around being cool again, yeah, yeah, very very recently, like it's cool to be into Smash Mouth again. Oh sure, sure, sure. From what I think the guy Ferrari has something to do with it, but I don't know, guy, what Ferrar? Fier? That's why I said Ferrari. Okay, um, other roles, uh, let's see here, I'm just scrolling through the internet. Yeah, I was going to say where's this from, where are you pulling this from? Uh, you're just reading articles, those articles I'd heard about on a radio segment a long time ago, but I knew that I wanted to make it into a much bigger topic because there are a lot more roles. So Will Smith was originally set...\"",
            "start": 520.68
        },
        {
            "text": "those articles I'd heard about on a radio segment a long time ago but I knew that I wanted to make this a much bigger topic because there are a lot more roles um so Will Smith was originally set to be Neo in The Matrix yeah they approached him I remember hearing um but he turned it down for Wild Wild West, terrible yes he did I'll say for Wild Wild West at the very least we got the song out of it there was some I remember him getting I seen an interview with him where he gave it and he had like the most honest answer to it where he was like \"I turned it down because like you're in the real world but it's not the real world, the real world's this and I'm balding\" I don't know I was like yeah of course that must have been a weird script to read so could you so could you imagine Will Smith as Neo and the first option for Morpheus Sean Connery oh yeah I can actually picture it I mean it's not too bad I think we're about the right time to reboot it like a gritty reboot sure so around that",
            "start": 563.92
        },
        {
            "text": "as Neo and the first option for Morpheus Sean Connery, oh yeah I can actually that picture I mean it's not too I think we're about the right time to reboot it like gritty reboot sure so around that time he also turned down the role uh not around that time they're saying having apparently not learned anything Sean Connery also turned down the role of Gandalf in Lord of the Rings all right he don't want to work that hard you know what I mean I mean just I mean Sean Connery doesn't need to go out just wants a couple days off to make Entourage with Katherine Zeta Jones hell yeah remember Entourage, no I'm with Kevin on this one cuz that was the trick right where it was like all right James Bond is back in the movie Whatever all right we're all prepubescent maybe right at puberty we're 13 and you see they did the whole thing where they like he's training her to go over lasers whatever and like the trailer was literally just her ass and you're like all right we",
            "start": 604.12
        },
        {
            "text": "at puberty we're 13 and you see they did the whole thing where they like he's training her to go over lasers whatever and like the trailer was literally just her ass and you're like all right we got nothing else to do Saturday afternoon let's go and then 2 and a half hours later like **** beat me to death with this chair I thought you say you were going to beat off in the theater no Jesus okay um two and a half hours later so instead of a uh instead of Steve Carrell as Michael Scott is supposed to be Paul Giamatti that much more serious yeah I mean well I mean have you seen Paul Giamatti as Rhino yeah Spider-Man one of his classic one of one of his best roles by Far defit Mel Gibson was supposed to be Gladiator H all right whatever no what what's your problem with gladiator no no with Gibson I just watched again uh What Women Want",
            "start": 651.88
        },
        {
            "text": "his best roles by far, Mel Gibson was supposed to be in Gladiator. All right, whatever. No, what's your problem with Gladiator? No, no, with Gibson. I just watched \"What Women Want\" again. Uh, it's one of those where I caught the end on TNT and then it rolled over real quick into... actually, I think it might have been the end on HBO, and then Jen turned on HBO Latino or whatever, and it was all like it was in Spanish. Yeah, I watched a bit of that, and it was like, \"Man, I don't miss Mel Gibson being in every movie.\" He was in every movie for a while, that's one of the few movies that I remember, like 'cause that was like mid-90s to late 90s. Yeah, it's one of those. Yeah, that's one of the few movies that I actually remember the trailer for sure. Like I remember him doing his Gibson thing... man, I don't know. It was just very, very weird. That was a weird time. You've got me no Tom Hanks, speaking of Tom Hanks, here we go. He was going to be Superman. No, John Travolta.",
            "start": 698.12
        },
        {
            "text": "doing his Gibson little does man I don't know it was just very very weird that was a weird time you've got male no Tom Hanks speaking of Tom Hanks here we go he was going to be Superman no John Travolta was supposed to be Forrest Gump M man they wanted to put Travolta in every picture for a while well I mean after he turned it around with Pulp Fiction sure and then he why wouldn't you kept going no I know this Tom Hanks was set to play all the Clumsy roles and The Nutty Professor right what yeah just just different Tom Hanks playing the different CLS it's it was remarkable for the time it was yeah they were ahead of their time Michelle Pfeiffer um was supposed to be in Silence of the Lambs that's Clarice yeah I swear the way you're delivering it is so much like the 302 Andy oh Jack Nicholson was supposed to be Corleone in The Godfather really well The Godfather I guess oh he supposed to be Marlon Brando yeah oh no that doesn't time out that time doesn't does work at all no that's not right pastemagazine.com",
            "start": 744.16
        },
        {
            "text": "be Brando in The Godfather really well The Godfather, I guess. Oh, he was supposed to be Marlon Brando, yeah. Oh no, that doesn't time out; that time doesn't work at all. No, that's not right. pastemagazine.com He would have been the Al Pacino character, no. Well, tell the website all right, Greg. Oh, maybe he was going to do the De Niro role in The Godfather. Oh, you know okay. Hold on, hold whoa, whoaa here we go. Hold on, breaking news. He was supposed to replace Al Pacino; he was okay. Thank you, I was right. Yeah, well no, you said Robert De Niro, remember? I started actually with Pacino and then I... and when you're like no, I was trying to get you on the track here. Can you imagine? Here we go. Ferris Bueller's day off with Sir Johnny Depp; is he sir? No, no, he's not sired. Very American is he not? Honestly, I think he could have done it, yeah. Back then like like as Matthew, yeah, as Ferris running through the backyard and all that junk. The thing the thing is this goes back to Game of",
            "start": 798.56
        },
        {
            "text": "Is he not honestly, I think he could have done it, yeah, back then, like, as Matthew, yeah, as Ferris running through the backyard and all that junk. The thing is this goes back to Game Over Greggy Show episode two, oh my God, where we were trying to decide who's cooler Marty McFly or Ferris Bueller. Well, it was a whole discussion; I still stand by because it was Ferris Burrell. Because Marty McFly for some reason thought that uh, that husk in the news was punk rock, yeah, and and also that he just hangs out with old dudes, and he's only cool because he has a time machine like period is the warp T punk rock; he's got skateboard skills. That's a that's a long conversation has it has Punk A.E. in it. Thank you so much; it's not a punk show; it was at one point yes it is, Jeff Ramone agrees with me more punk than all of us put together. Um I don't think that there should be G keeping on punk rock; I think that like more things should be like I I will say that like man be punk.",
            "start": 850.08
        },
        {
            "text": "agrees with me more Punk than all of us put together um I don't think that there should be G keeping on punk rock I think that like more things should be like I I will say that like man be punk punk is whatever you want Punk to be man sure all right the Michelle Branch is punk there you go that's no I CR at the Michelle Branch concert once I **** you not I kid you not my dream Dad yeah no I was at um I was at Sun God Festival at UCSD several years ago um I was I was in the crowd for um for Michelle br I was a little drunk and I said you know what would be funny right now if someone cried surf to Michelle Branch so I picked I looked at the like the biggest guy I could see and I was like bro I'm going up and he's like bro you're going up and then I went up and everybody helped yeah good for c for a certain amount of time we're going we're going to see Michelle Branch a week from Friday double date I just saw that on calendar day and I was like oh **** this is a",
            "start": 895.88
        },
        {
            "text": "\"Helped yeah good for a certain amount of time we're going to see Michelle Branch a week from Friday double date I just saw that on my calendar and I was like oh this is a real thing it's happening oh yeah it's really happening can you imagine can you imagine Dirk Diggler wiggling that big dong in Boogie Nights but it's not Mark Wahlberg it's Leonardo DiCaprio because he admits that his biggest regret in his career is passing on the role of Dirk Diggler in the 1997 film that chronicles the Golden Age of porn, Boogie Nights. Now correct me if I'm wrong - sounds too young then would that have snuffed out Wahlberg's career? Feel like that gave him a big jump right definitely I want to give that one to Wahlberg I feel like he deserved it he worked hard for it I feel like Leo had Titanic around there he didn't need any extra help can you take yourself okay hey movie goers hot tip here transport yourself back to when Casino\"",
            "start": 940.16
        },
        {
            "text": "worked hard for it I feel like Leo had Titanic around there he didn't need any extra help can you take your yourself take yourself okay hey movie goers hot tip here transport yourself to when Casino Royale is coming out and they're bringing back James Bond this James Bond character we all know and love as Hugh Jackman oo that would make Nick's freaking dick melt he wouldn't be able to handle that because he likes Daniel Craig and he likes he though maybe he wouldn't no but he likes James Bond so much that there's there's a lot of Worlds melding he likes Hemsworth more though he doesn't though this is a classic Nick flipflop oh gotcha I see if there's one thing Nick's never consistent on anything he says like he Nick would he had an alter to Hugh Jackman for oh God don't even start he's not gonna answer now he's hey might I think he's blocks out this time he doesn't go anywhere blocks I think he went did he leave or any hello hey Nick it's Greg how are you good how are you Greg good",
            "start": 981.48
        },
        {
            "text": "not gonna answer now he's hey might I think he's blocks out this time he doesn't go anywhere blocks I think he went did he leave or any hello hey Nick it's Greg how are you good how are you Greg good you're on the you're on the GameOverGreggy show uh Andy has a question for you Nick can you imagine transporting yourself what movie were we talking about it's Castino R uh can you imagine take yourself back to when Casino Royale is coming back because is coming out right you love James Bond right instead of Daniel Craig playing the role of Jimmy Bond it is replaced by Hugh Jackman CU Hugh Jackman turned down that role first off Don't Call Him Jim B nobody uh second off that would have been amazing that would have been amazing actually I would support I would still support that actually now need something else to do now he's not the Wolverine anymore so I would I would support that now Tim says that you like Hugh Jackman more than Liam Hemsworth Everyone likes Jack and Liam Hemsworth",
            "start": 1031.64
        },
        {
            "text": "\"Need something else to do now he's not Wolverine anymore, so I would support that. Tim says you like Hugh Jackman more than Liam Hemsworth. Everyone likes Jack and Liam Hemsworth, Chris Hemsworth - the other guy, the other white guy. I like H Jack as an actor. Well, I like them both as actors. Body type wise, I think Chris Hemsworth is better looking with his shirt off than Hugh Jackman because he can pack on more muscle. The bulk look of him really draws the eyes down to the pelvis section - good. I think you should have been on the first two topics probably. I mean, I guarantee I would have done a better job than you know what you're on those topics. Okay guys, one last one here we go. It's like he walked out there and got beat up on the head and he can't turn off the Amy character. Like I feel like there needs to be like glasses as props - hey movie fans inside the actor's guild, um no studio that's what I said. Let him let him go yeah back in the days of In.\"",
            "start": 1085.12
        },
        {
            "text": "the Amy character like I feel like there needs to be like glasses as props like hey movie fans inside the actor's guild um no Studio that's what I said let him let him go yeah back in the days of In Living Color oh yeah this bright star Jim Carrey uhhuh starts coming up right he's doing his Fire Marshal Bill he's doing his uh well give me his other very famous In Living Color character what else was he In Living Color the white guy in every sketch okay yeah yeah so um Tim Burton is like is this what it's like to work with me so Tim Burton says I want to make this Edward Scissorhands movie with one Jim Carrey now how would that have changed that whole path where he wants to be serious he no where no no he wants to not have scissors for him yeah oh there's so much no where where Tim Burton wants Johnny Depp in every movie oh right think about that that would cre like a butterfly effect it's not Helena Bonham Carter it's it's uh it's uh give me give me a joke here who was the",
            "start": 1144.88
        },
        {
            "text": "Burton wants Johnny Depp in every movie, oh right, think about that, that would be like a butterfly effect. It's not Helena Bonham Carter; it's uh, give me a joke here. Who was the girl that uh, that um Jim Carrey was like weirdly obsessed with in real life? He married her, didn't he marry her from Eternal Sunshine of the Spotless Mind? No, well, he made a video about Emma Stone once. That's what it was; it was really weird when they were in the movie I don't know. Yeah, I don't know. There was I this is one of those things I probably should not be saying live on a podcast because no research fact checks totally wrong. Somebody please correct me. I remember the year was 2008. I was sitting back in my old house on my computer; it was probably 3:00 a.m. I was procrastinating doing some college essay or some work and then I saw a trending thing happening of Jim Carrey gets hella weird to Emma Stone, and I'm like, I got to click on this. I started watching the video, and it made",
            "start": 1203.56
        },
        {
            "text": "college essay or some **** MH and then I saw a trending thing happening of Jim Carrey gets hella weird to Emma Stone and I'm like I got to click on this I started watching the video and it made me uncomfortable I feel like she hasn't been out for that long but I mean it was this was like 2008 yeah man it was how young was she like 19 it was creepy the whole thing was very creepy he was very emotional he might have been crying maybe he was in character no dude when he was like crashed award give me your stats again this is 2008 this Happ all right Stone article here from June 19th 2012 where Emma was flattered by the video and then says in late August the 50-year-old funny man posted a video on his website in which he expressed his feelings for The Amazing Spider-Man star yeah 2008 is way too early dude yeah 2011 you know I must be talking about something else then cuz I was at my old house and I moved in 2009 and you were you were creeped out by something on the Internet I was",
            "start": 1255.24
        },
        {
            "text": "too early dude yeah 2011 you know I must be talking about something else then cuz I was at my old house and I moved in 2009 and you were you were creeped out by something on the Internet I was creeped out by Jim Carrey making a video towards some girl it might have been pre Emma Stone oh here's the video it wasn't this 2011 then what are you thinking I don't know if if it's not the video think I'm crossing St is this like The Number 23 where you start seeing the number 23 everywhere no wait Vernon do you think hold on Tim is in got he got it I got I got it I am so wrong about everything that is the video I did not watch it in my old house at 3:00 a.m. to procrastinate I watched The Butterfly Effect movie at my old house morning yeah Jesus fu yeah we got there ladies and gentlemen come back we got there C it's going to be all right we just made a joke I I thought you were stuck in the other timeline the butterfly effect oh in this other alternate timeline where Johnny Depp was not",
            "start": 1301.92
        },
        {
            "text": "back we got there C it's going to be all right we just made a joke I I thought you were stuck in the other timeline the butterfly effect oh in this other alternate timeline where Johnny Depp was not Edward SC see now what I jumped to there as I said he'd be more serious movies you're like no I because like that remember Jim Carrey kept trying to make more serious movies instead of exactly well yeah that and then the Majestic Manic no I think that was still goofy wasn't was bad Majestic yeah but I remember like it was that thing like they weren't performing like his comedies were that his big problem and I think SC Scissor Hands was like such a weird movie right Jonathan Scissorhands yeah yeah well so the other roles that were considered were Robert Downey Jr. and Tom Cruise RDJ RDJ yeah the best well that was when he was in party mode right yeah that was when he was in party mode mode yeah yeah yeah every Tuesday on Patreon every subscribe $1 early you get party mode early it's fun",
            "start": 1363.16
        },
        {
            "text": "Best well, that was when he was in party mode right? Yeah, that was when he was in party mode. Mode yeah yeah yeah every Tuesday on Patreon, every subscriber gets Party Mode early, it's fun. That you brought this up, I like this because I like seeing that and picturing it. And I love, love, love as a Back to the Future fan, when you get to watch that old Eric Stoltz footage, cuz you know how they cast him as Marty McFly and filmed a whole bunch of the movie, but didn't finish it. Just didn't finish it. Oh, you didn't finish it? You're an idiot. We left halfway through. Yeah, so Greg and I went to that viewing at the Balboa theater, and uh, so we go to watch a viewing of Back to the Future, and I had never seen it before cuz it was just always like a movie I'd always miss, and eaten macaroni cheese. He's never eaten a corn dog? What the heck is wrong with you at McDonald's? We were at the",
            "start": 1405.4
        },
        {
            "text": "always like a show that i always miss and  he's never eaten macaroni cheese he's never eaten a corn dog what the **** is wrong with you at McDonald's we were we were at the airport and Tim Gettys was like man I love corn dogs and I was like actually and Tim Gettys was like don't you dare me yeah every every time i come on this podcast like there there's because like last time it was like oh like Tim Gettys' never jerked off lying down that was weird i remember listening changed i remember i remember listening to that was such a weird like Revelation corn dogs let's talk about that never eating the corn dog never eating mac and cheese never eating the Big Mac or Whopper uh but just to finish out my story we went to go watch back to the future and then they had a **** 30 minute intermission and it was like bring on this it was a San Francisco beer event where you were given three free beers to go there so i think it was like hey go buy more beer piss also we",
            "start": 1444.64
        },
        {
            "text": "intermission and it was like bringing speed on this it was a San Francisco Beer Festival event where you were given three free beers to go there so I think it was like hey go buy more beer, piss also we understand that way too long we all went home 30 minutes yeah I've seen Back to the Future I'm I've enjoyed a night out I don't need to be here also Now Kevin real quick before we switch to topic four I want to tell you the corn dog conversation comes because at the Alameda County Fair they had corn dogs that were then covered in crushed up Hot Cheetos excuse me, crushed Hot Cheetos yeah you wait before or after dipping before if you it was the it was the batter yeah yeah yeah it was big that's beautiful that's good that's good for yeah I think what I want to make for you Kevin is I want to make chicken wings and crush up the spicy Cheetos put them into I've seen that a lot on the internet yeah and I I would love to try that I would eat that I'm telling you guys when we made that",
            "start": 1487.16
        },
        {
            "text": "to make chicken wings and crush up the spicy Cheetos put them into I've seen that a lot on the internet yeah and I I would love to try that I would eat that I'm telling you guys when we made that mac and cheese with the like the gourmet mac and cheese with the hot Cheetos it was a game changer sure spicy Cheetos go pretty much with anything don't call them spicy Cheetos G to get you mad I hate you I had another joke I was going to go with but that was good enough I was going to say they go everything red things Cheeto code red they go with everything Cheeto code red urethra thanks for watching Everybody click here to subscribe click down there to go to patreon and support us when we need your help we love you very much click over here you can watch other episodes of the GameOverGreggy Show please go watch the an aale one I did I love it quite a bit and then down there you can click and go see Kinda Funny Games what are they up to party mode you say what's that it's a show we hired",
            "start": 1531.12
        },
        {
            "text": "Please go watch the Annoyed One I did, I love it quite a bit. And then down there you can click and go see Kinda Funny Games. What are they up to? Party Mode, you say? That's a show we hired Andy for. You need to watch or I swear to God I'll kill Andy.",
            "start": 1571.48
        }
    ]
}