{
    "id": 2815,
    "video_id": "YvtWWo8kSP8",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Kevin Coello",
        "Andy Cortez"
    ],
    "title": "Batman Movie Starts Over - Kinda Funny Morning Show 07.13.17",
    "description": "Thanks to Me Undies for sponsoring this episode. Go to MeUndies.com/Morning\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1499976860,
    "duration": 2680,
    "transcript_chunks": [
        {
            "text": "I said just let him do it, what's up everybody Welcome to the Kinda Funny Morning Show Thursday July 13th I'm your host. Thursday the 13th, you can play on Friday the 13th in honor of Thursday the 13th, oh no! I wish did you put did you put a a throwback Thursday picture out on Twitter yet? I don't do that usually, I'm thinking about doing it but I'm thinking about taking a picture every Thursday and just tweeting out that picture from last Thursday. Yeah today here's what I'll say Nick Scarpino is your social media game has been killing it lately, I feel like you you were on the bench for a long time and we all like if you wanted to come off the bench you'd be like a Charles Barkley you know a David Robinson out there and it's one of those things you finally came off the bench and you've been **slaying** as the kids say they slay right cool Greg that's what the kids say they do that his posts have been slapping and Nick be slaying have I been slapping or",
            "start": 1.39
        },
        {
            "text": "off the bench and you've been **slaying** as the kids say they slay right cool Greg that's what the kids say they do that his posts have been **slapping** and Nick be **slaying** have I been **slapping** or **slaying** or Juiced which one have I I'm **Juiced** about how you've been **slaying** while with these **slapping** posts if you're going to put my Instagram posts in one category cool Greg would they be **Juiced** or **Sauced** sa sauc all right I like that which one did we decide what was the difference between juice and SAU again SAU is like more you can't lose the juice is that what it was you can't weeze the juice you can't lose the sauce because the sauce yeah cuz juice goes bad but sauce like hot sauce can stay in your refriger long time barbecue sauce will stay there for years but juice will spoil juice will eventually go bad that was what we decided speaking Greg great yeah if you wanted to play Friday the 13th we're one button away I'm just saying yeah well we got this show we got the game Daily Show",
            "start": 50.88
        },
        {
            "text": "eventually go bad that was what we decided speaking Greg great yeah if you wanted to play Friday the 13th we're one button away I'm just saying yeah well we got this show we got the game Daily Show there a lot of things going on know lot of things happen very easy now I appreciate that I know you've got it all set up over there very proud of your set up I'm very proud of you Kevin big keev dog everybody ow wow wow wow wow wow yeah everybody's been getting rounds of Applause com today great and's got great energy today yeah it's about time it's good I've got bad energy today so I Andy's like balancing me out which is sure we're going to bring you around we're bring I'm feeling good the show always brings me back show brings me back I get to look at people in the chat uh they're always super fun to be around it's going to be good you're always fun to be Greg Miller of course for anyone listening at home who doesn't know who was talking hit him up uh what is the Kinda Funny Morning Show",
            "start": 94.04
        },
        {
            "text": "fun to be around it's going to be good you're always fun to be with Greg Miller of course for anyone listening at home who doesn't know who was talking hit him up uh what is the Kinda Funny Morning Show of course we have to give you the spiel Kinda Funny Morning Show is a show we do every day at 11 o'clock A.M Pacific time here on twitch.tv/ kindafunnygames uh but if you can't watch live that's cool guess what we put it on YouTube also and if like watching stuff's not your thing you want to just listen to stuff because you're like to sit in a dark room and like be mellow by yourself or one of those weird tanks where no outside sources can get in you can listen to this on iTunes or SoundCloud to do all that yeah wherever you're watching it maybe you're watching it live it would mean a lot to us if you went to the other platform subscribed liked and shared there leave review on iTunes and I know you say why but it helps the show get to other people and who would want to miss content",
            "start": 137.08
        },
        {
            "text": "to us if you went to the other platform subscribed liked and shared there leave review on iTunes and I know you say why but it helps the show get to other people and who would want to miss content like this cuz the first thing we need to talk about is is Sky Cam rolling Sky Cam yeah okay give it to me cuz I was going somewhere before we got distracted by clapping for each other which is how it should happen but you were talking about sauces and things being permanent right so go go back to full screen for me all right so a while back I blew holes in both of my blue jeans and started exclusively wearing my black jeans cuz I feel like I could maybe resize my jeans at this point cuz you said I'm wearing too big of jeans you are a little bit and so then I I need to go to Levi's and have a I have a Levis professional jean haven't done that haven't done that but the downside of the black jeans cuz I like to admit my shortcomings right sure the downside black jeans right all right Sky Cam",
            "start": 176.04
        },
        {
            "text": "a Levi's professional, I haven't done that, haven't done that, but the downside of the black jeans, 'cause I like to admit my shortcomings right, sure, the downside, black jeans, right. Alright, Sky came up is that when Portillo puts his face on him, yeah, I got all these white spots here and so and so then Jen's always like, \"Is that ****?\" Do you have **** on your pants? Like no, it's my it's from my other wiener the dog with he falls asleep with the toys in his mouth. Got it now a lot of people have also been asking what color are my MeUndies because you of course know I wear MeUndies exclusively and they happen to be sponsoring this episode. You have to wait till the ad, I'm not going to ruin, I'm not going to give you the goods right now maybe I'll tease it a little bit though alright hold on here we are I'm just gonna just gonna show that's the color of the waistband I'm I'm I'm going to change I'm scared black now here's my question to you Greg 'cause what I thought you were going to do with",
            "start": 214.8
        },
        {
            "text": "we are I'm just gonna show that's the color of the waistband I'm I'm I'm going to change I'm scared black now here's my question to you Greg cuz what I thought you were going to do with this is have Kevin turn the lights off so we can see your GL shirt bngo me just bungle me for a hot second Now give me Sky King Jesus Christ that's so **** horrifying hey what I thought I thought you were going to go and I are musical Brothers man where I thought you were going to go with this you're going to have Kevin turn off the lights so we could see your glow-in-the dark sh I don't know if it'll work new filthy casual shirt it does have a special glow in the TR you want to try it try it try Andy Andy I need you to go pull the blinds there pull the blinds turn off the overhead light there oh even the TVs are going to give me too much light though here Andy turning off the TVs is too much you got it over there it's right there it's too much that's too much work isn't it just do it real",
            "start": 258.64
        },
        {
            "text": "oh even the TVs are going to give me too much light though here Andy turning off the TVs is too much you got it over there it's right there it's too much that's too much work isn't it just do it real quick no man let's do it I just want to see if it works yeah I'm fascinated you want to see if Mike Gabber is full of **** I don't know how to turn these TVs off TV please turn off yeah just that's how they all work these days power button off no no it sure doesn't work it sure doesn't work it says S'Nudes and glow in-the-dark oh I can see it I can see it yeah yeah I can see it oh oh oh when you do that I can kind of see it I wonder okay that's just groping me well that's how you see it oh wait oh oh still nothing I'll go further back into the darkness yeah thank you again for subscribing to iTunes that's so hard to see no you can't see damn it well it's not working I'm sorry guys hold on no yeah it ain't working this shirt sucks everybody tweet at Filthy Casual co yo way to **** up",
            "start": 309.76
        },
        {
            "text": "to iTunes, that's so hard to see. No, you can't see. Damn it, well it's not working. I'm sorry guys, hold on. No, yeah it ain't working. This shirt sucks. Everybody tweet at Filthy Casual Co. Yo, way to **** up the shirt. Mike, I can see it from here though. I can see what it's trying to do. More like stole my shirt. Shell, what instead of dark shell stole my shirt. Shell stole my money. Oh that's right. I guess she gave me the shirt. Yeah, she didn't. She didn't steal the shirt from me. Steal it. She actually gave it to you for free. It's not a big deal. Well no, I bought it like it's they gave me a disc. Did she give it to you or yeah well the shirt I tore off my body. We can workshop this all right. We'll get back to this let's start the news we want to talk about before we do that **** godamn it. I love you Greg. I love you Greg. We have one quick housekeeping announcement. We are delighted to announce uh that we will be returning to the GameStop Expo again this year 2017 Las Vegas Nevada on August 27th Sunday we",
            "start": 355.68
        },
        {
            "text": "\"Love you, Greg. We have one quick housekeeping announcement. We are delighted to announce that we will be returning to the GameStop Expo again this year, 2017, in Las Vegas, Nevada on August 27th, Sunday. We will be there, uh, streaming live from the show floor. Come hang out, get your tickets here at Gamestop.com/Expo. If you're going to be anywhere near the Vegas area or you want to go to Vegas for a weekend, you can come party with us on the show floor of course. While we say 'party', we mean responsibly. We'll be drinking diet sodas and water. No, I don't know if we're going to do that because like we've done the GameStop Expo this will be our third year ever since we left, I think we perfected it last year in LA. Well, if you haven't gone, it's us live streaming video games with the developers all day long right? And we usually...I usually tie it up, put the tie on there, act serious. Do this. I'm going the opposite. We're going the opposite. T-shirts and I'm going to bring some beers and I'm going to be like 'Can'\"",
            "start": 401.52
        },
        {
            "text": "Right and we usually, I usually tie it up, put the tie on there, act serious. Do this, I'm going the opposite. We're going the opposite. T-shirts and I'm going to bring some beers and I'm going to be like, \"Can you beat your game in 15 minutes?\" They'll be like, \"What,\" and I slam the beer and then I'm like, \"You want to fight? Randy, you want to fight me?\" Uh, my favorite thing last year was when I discovered a small game called Star Trek: Bridge Crew. Oh, you did discover that? That nobody... nobody was familiar with that franchise or that game at that point. Yeah, um, and so I'm very glad about that, of course it's one of our most popular party modes we have done so far, so I'm very excited about that. Greg, yeah, that's it for housekeeping. Fine, let's get into the first... Don't mind if I do. I'm sure it'll be great news that are really keep me excited about the DC super great news Batman director this comes from The Hollywood Reporter. Uh, Patrick Shanley says Batman director Matt Reeves has dropped Ben Affleck script.",
            "start": 442.04
        },
        {
            "text": "that are really keeping me excited about the DC super great news Batman director this comes from The Hollywood Reporter uh Patrick Shanley says Batman director Matt Reeves has dropped Ben Affleck's script this is official, the War for the Planet of the Apes helmer is starting again and promising a new story. Matt Reeves revealing more from his plans for his take on The Dark Knight filmmaker who stepped in to replace Ben Affleck after directing on the project, after uh as the director on the project recently revealed on MTV's Happy Sad Confused podcast that he scrapped the earlier script that Affleck uh Chris Terrio and DC's Geoff Johns had worked on. And Geoff John's when asked if he would uh be working with Affleck's script, Reeves said no it's a new story it's just starting again I'm excited about it I think it's going to be really cool. Reeves who uh whose War for the Planet of the Apes hits theaters this weekend has previously said that Affleck will remain as The Dark Knight in the upcoming film that",
            "start": 477.84
        },
        {
            "text": "It's going to be really cool Christian Bale, who uh whose War for the Planet of the Apes hits theaters this weekend has previously said that Ben Affleck will remain as The Dark Knight in the upcoming film that he is planning a Noir take on the character in the original script. This is the interesting part Deathstroke was the villain with Joe Manganiello cast not say if he is planning on using Deathstroke in his script. Affleck is set to appear at ComiCon uh next week during Warner Brothers Hall panel which will feature his Justice League co-stars, he will don the cape and cowl and the superhero team up which is due out in theaters November 17th. Now Greg yeah as we know I mean this is crazy this is the first piece of crazy news about this we've never known this has not got any bad press well this is not based on the news of that Geoff Johns was actually working on the script that that that could be it's it's troubling to me yeah but he's trying to take it in a different direction in mind that Jeff Johns",
            "start": 518.4
        },
        {
            "text": "based on the news of that Jeff Johns was actually working on the script that that that could be it's it's troubling to me yeah but is trying to take it in a different direction in mind that Jeff Johns worked on the Green Lantern script apparently too you know what I mean like how much does he actually get to work on any of this stuff who knows and this granted Green Lanterns before they were like Hey we're **** everything up Jeff coming to help us I imagine Jeff Johns has a giant office that's just an assembly line of scripts that comes in bad and he types them up and they go back out Wonder Woman you know okay okay I don't know um what's what's upsetting about this Batman news isn't even the I you're not going to use the Ben Affleck script I totally get that you've come on you want to make a movie first off everybody loves War the planet of the Apes so good knows what he's doing yeah exactly it's more what's depressing about this news is that again we're back to",
            "start": 560.04
        },
        {
            "text": "to make a movie first off everybody loves War, the planet of the apes so good knows what he's doing yeah exactly it's more what's depressing about this news is that again we're back to what I was talking about in the old days of like everybody ****ing up just making Batman movies all the time like don't why are we still so far away from getting this Batman movie and it's the movie everybody wants yeah Ben Affleck wants to wiggle out of the role and out of the DC universe everything's gone to Hell blow it up blow it up blow up continuity give him Red Son green light my kingdom come movie John Hamm is Superman Michael Keaton is Batman let me do it let I agree with you wholeheartedly I think that uh look if if the Spider-Man Homecoming movie taught me anything is that you can tell a very small story a good story with these characters that we love and it doesn't have to be this giant continuity world Grant it had a lot of references to the other continuity but the core",
            "start": 595.96
        },
        {
            "text": "can tell a very small story a good story with these characters that we love and it doesn't have to be this giant continuity world Grant it had a lot of references to the other continuity but the core story of Spider-Man: Homecoming is really what was touching for me I say take Batman - everything else just make the Batman movies okay okay you want to go back to the Nolan way I just want to go to the Nolan way okay okay CU there's absolutely zero uh compelling about you what if they **** you what if they did it where they blew up continuity you know they let they let Wonder Woman keep going of course everybody's happy there okay there and there is that continuity if you want to play in that continuity sure but then yeah we get the red Sun movie whoever whatever's gonna happen there and then Nolan comes back and does uh another Batman film with JGL I would absolutely love that um I would love to see Nolan return to it I would also love to see them just do different I I don't know",
            "start": 636.16
        },
        {
            "text": "then Nolan comes back and does uh another Batman film with JGL, I would absolutely love that um I would love to see Nolan return to it I would also love to see them just do different I I don't know I kind of want The Dark Knight to be just did a completely totally different direction for this and this is well that's why the Noir one sounds interesting if it was like a True Detective story it could be **** awesome um but you know Nolan's too busy making Dunkirk yeah wow that one's really going to sell War I'm seeing it in 70mm, good old Christian Bale hit me up he's like do you guys want to see this in iMax 7 like I have to yeah because we saw Interstellar together and the **** sound was so loud that it actually gave me a headache which was awesome so we'll see if Dunkirk can uh can can match that when are you going to see it I'm Max downtown right oh probably the max downtown when are you going to see when does he even come out uh the 27th I want to say no he's he's trying to get screening uh",
            "start": 668.16
        },
        {
            "text": "when you going to see it I'm Max downtown right oh probably the max downtown when are you going to see when does he even come out uh the 27th I want to say no he's he's trying to get screening uh tickets for one of those days that week I'll let everyone I'll text him after this and let him know that there's two more in on this oh no I don't want to go yeah you can come you can definitely I mean I don't know it's one of those things I like I like Christopher Nolan I watch that movie trailer I'm like this looks boring but it's supposed to be good and he's get in your microphone get in your microphone it's supposed to be good and he knows what he's doing sure that's what I said when I was like oh man The Dark Knight Rises he knows what he's doing with Batman who come on again I don't know that that was the movie he wanted to make per se it's not his fault it's the old for killing I agree with that of course they need they need to be prosecuted we've talked about this for a long time but I",
            "start": 711.2
        },
        {
            "text": "that was the movie he wanted to make per se it's not his fault it's the old for killing I agree with that of course they need they need to be prosecuted we've talked about this for a long time but I don't I understand that you talk about that as if they were like all right filming in a week you know what like he died before The Dark Knight was out it's true so there you go coming together and make a new one now make it all weird and putting Bane in the middle of a desert on TV that goes from Gotham to the fight and he's going to climb out he fix his own broken back with a goddamn sex Wing we've been in the city for 18 months why do the cops not have me thinking about going on a vacation we've been here so long kill some cops that's what you should have done all right B I'm just saying stop footing around Bane should have taken that it should have been the financial crisis he should have plunged the stock markets could have been cool it could have been cool",
            "start": 744.4
        },
        {
            "text": "just saying stop **** footing around Bane should have taken that it should have been the financial crisis he should have plunged the stock markets could have been cool it could have been cool it was cool he just said it could have been it wasn't so there you go it was cool he doesn't know what see he just flip-flopped it's not cool oh my god well jur still out on uh the new Batman movie we'll see what happens with that Kevin next news story and are out Greg I know this will hit very close to home for you cuz you watch a ton of TV well I mean two of our friends have been nominated for emies which is kind of **** up oh which one of our friends uh Mike Ducker for Bill Nye the Science Guy whatever they call it on Netflix and then uh Scott Bramble and I guess Carboni for the Star Wars show oh wow yeah that's awesome congratulations to our friends I had no idea when I put the story on that we have talented friends we do uh someone say we have cool friends that is cool very cool going",
            "start": 782.48
        },
        {
            "text": "oh wow yeah that's awesome congratulations to our friends I had no idea when I put the story on that we have talented friends we do uh someone say we have cool friends that is cool very cool going off the top of the list though uh from some of the more i guess crazy shows uh let's see here what's been nominated for best drama out of that one I like Westworld and Stranger Things that's awesome Stranger Things has 18 Emmy nominations which is freaking awesome yeah best comedy Silicon Valley has been nominated that's probably going to be my pick there although up against Modern Family Man a lot of people like that Modern Family yeah yeah it's been around a long time people like it Ed O'Neill all right cool best limited series go down one did you watch big little lies hell yeah I did it was **** awesome was it yeah my wife loved it a lot I want it to win I've watched none of those other shows but I don't care about them isn't Fargo ongoing because it has a second season so so they're",
            "start": 824.16
        },
        {
            "text": "awesome was it yeah my wife loved it a lot I want it to win I've watched none of those other shows but I don't care about them isn't Fargo ongoing because it has a second season right so they're cheating as usual yeah that's what I'm thinking don't listen to last I have no idea why that is maybe it's a shortened series or season and then of course uh just going scrolling down a little more and best television movie uh I do not watch Black Mirror but everyone loves that how is that a television movie Black Mirror I have no idea maybe the anthology series because it's an anthology series there's like 12 episodes on a certain episode uh it might be it might be like an hour long it's got well oh it's Netflix so it's season 3 otherwise it would be BBC sure so it might it might be on a certain episode all right smart Andy good job Andy so smart everybody what I need you to do is turn your phone around take a video of you clapping and celebrating",
            "start": 866.0
        },
        {
            "text": "so it might it might be on a certain episode all right smart Andy good job Andy so smart everybody what I need you to do is turn your phone around take a video of you clapping and celebrating Andy Cortez tweeted at @AndyCortez all right um also I watched The Wizard of Lies the other weekend which is the Bernie Madoff story starring Robert De Niro is **** messed up is it good it's good worth watching it's definitely worth watching it's beautifully made the story is just super depressing my problem with I'm a big Robert De Niro fan you like this I liked the intern movie I keep seeing the trailer on my Amazon for The Comedian oh and I can't take the plunge because it doesn't look great but it also does look like Robert De Niro's in a major motion picture which I need to watch well you know we took the plunge with uh a little Hidden Gem called uh Dirty Grandpa Grandpa dirty grandpa dirty grandpa so good and we loved that that is the gift that that is the Daddy's Home",
            "start": 906.88
        },
        {
            "text": "Know we took the plunge with uh a little Hidden Gem called uh Dirty Grandpa. Grandpa dirty grandpa, so good and we loved that. That is the gift that keeps on giving. Daddy's Home, Purple Dr. Purple Drag - are you ****? Are you kidding me? It's so good! It's so good! Uh, congratulations to everyone who's been nominated for an Emmy um like our friend Mike Drucker. Hopey if he doesn't win we'll burn this **** down exactly. He's up against the Beatles, so that's tough. Oh, he's got that okay, good. The Beatles. Check out what he tweeted: \"Ctrl + F in NY\" and it'll... we'll figure it out here we go. NY. Did Bill save the world? What was the show? Did he write for Bill Maher? No, are you sure he didn't get maybe it was for uh I mean I'm sure AD everything or was it for no no it's definitely for Bill N this must be like they're doing like not everybody probably the internet Hollywood's like **** the internet it might be a different category it might be in a reality show.",
            "start": 952.72
        },
        {
            "text": "\"It's definitely for Bill, and this must be like they're doing like not everybody probably has access to the internet. Hollywood's like 'f*** the internet.' It might be a different category; it might be in a reality show. Cowards, they are cowards. If I'll tell you one thing right now, and this is what's shocking about this story - follow-up story, yeah. We have been yet again snubbed for an Emmy. Now granted, we're not on TV, yeah, but this is arguably one of the best 'worst' morning shows ever made. This could go on NBC right now, no further preparation, 100%. Anthony Carboni and Bill Nye are one of a kind - they were on computers, guys, yeah. Anthony Carboni is in the internet; that's where he's at, that's where we're at, that's where he's at. He's 'f***ing' riding those pipes, you know. Everyone says sweet nasty love to Carboni and Bramble and Mike Ducker, and tell congratulations please from us from the Kinda Funny people. Last news story - okay, this is a fun one. Have you been following?\"",
            "start": 1001.32
        },
        {
            "text": "love to Brian and Bryan and uh and Mike Ducker and tell congratulations please for us from us from the Kinda Funny people last news story okay this is a fun one have you been following all of this drama from The Walking Dead the old stuff I read the emails today so Frank Darabont yeah makes this little motion picture called Shawshank Redemption and it's amazing and it's awesome and it's great he does a bunch of other movies I'm not familiar with he then gets to be the showrunner producer whatever the **** director for Walking Dead season 1 and I remember going to the panel now he was one of the people who brought that to TV yeah he made it happen I watched the panel at ComiCon got my Skype out and friends to get me in there when they revealed the cast some more footage talked about it all this cool stuff he was up there talking about how great it's going to be we're shooting on film we're going to have this great look to it and I was like I don't I I only know this man",
            "start": 1045.92
        },
        {
            "text": "about it all this cool stuff he was up there talking about how great it's going to be we're shooting on film we're going to have this great look to it and I was like I don't I I only know this man from The Shawshank Redemption but now I love him even more yeah then he is unceremoniously fired during season 2 and all hell breaks loose yes people start getting mad there's infighting on the show he's screaming about it goes quiet for a while then all of a sudden he sues them yeah because he's like hey I got screwed out of a whole bunch of money because you guys are wrong right and then I think that's been ongoing is that has been ongoing and that and now so new uh the emails there's been a lot of leaks now all these email correspondents back and forth between him and AMC Network Executives um have come to surface now because of this lawsuit and it's very very fascinating um he was up against a lot of pressure apparently yeah which I didn't realize was you know",
            "start": 1088.44
        },
        {
            "text": "\"Um, have come to surface now because of this lawsuit and it's very, very fascinating um he was up against a lot of pressure apparently yeah who would have thought uh which I didn't realize was you know they they apparently The Story Goes is he was hired everyone loved it and then they cut his budget yeah and that's why you get season two in a farmhouse exact we're like get the **** out of the farm we don't care about Sophia so it's an interesting story um I'll read a little bit of it here the reporter uh released admitted a bitter lawsuit with the network that fired him the explosively abusive Miss uh I don't know what that word is reveals a show push to the edge I will start killing people and throwing bodies out the door on which is what something he wrote you got to you know he's got to motivate team he does uh the history of Hollywood is littered with legendary freakouts think David O. Russell's B rating of Lily Tomlin on the set of 2004's I Heart Huckabees or Christian\"",
            "start": 1124.44
        },
        {
            "text": "He's got to motivate his team. He does uh, the history of Hollywood is littered with legendary freakouts - think David O. Russell's B-rated film \"I Heart Huckabees\" or Christian Bale's infamous tantrum in 2009. I'm trying to do my job here. Mighty, you're moving a light over there. You're standing over here looking at me. Mich, now joining the ignominious list is Frank Darabont, who spectacularly abused emails to AMC executives and crews during the production of the first season of The Walking Dead have surfaced amid his $280 million lawsuit against the network. Darabont, who co-created the blockbuster cable hit, was fired as a showrunner from an earlier season in the series, earlier in the second season. He and his team are suing AMC, claiming the network squeezed him out of tens of millions of dollars in profits by negotiating something called a sweetheart licensing deal with itself. I'm not familiar with that.\n\nI corrected phonetic mistakes (e.g., \"litered\" to \"littered\"), spelling errors (e.g., \"iHeart Huck bees\" to \"I Heart Huckabees\"), and added capitalization for proper nouns like names (\"David O. Russell\", \"Christian Bale\", \"Frank Darabont\") and show titles (\"The Walking Dead\"). I also corrected the title of the film \"I Heart Huckabees\".",
            "start": 1165.88
        },
        {
            "text": "\"Team are suing AMC claiming the network squeezed him out of tens of millions of dollars in profits by negotiating something called a sweetheart licensing deal with itself. I'm not familiar with that term, but I'm sure it's probably proper terminology in Hollywood. In his defense, I've never heard of it, but I imagine it's something people talk about. In his defense, AMC has released a cache of cash - I like 'cache,' but I think I've heard it said 'cash' a lot. I think 'cache' is a different word; cash is what it is in this particular context. Cash rules everything, Greg always tells me - cash, cash money does rule everything... in a cash of shocking email sent by the showrunner, Darabont, 54, to an executive creative executive.\"",
            "start": 1212.6
        },
        {
            "text": "so here's let's get into some of them reading through them it's easy to see why and what is arguably most level ahead of his email sent in July 21st 2010 Darabont tells an exec a creative executive AMC whom he considers an ally to stop invoking the writer's room in their exchanges quote there is no writer's room I am the writer room the failings of the show's writing staff and crew and in particular the camera operators are repeated themes of his rants in the same email he singles out one pair of writers as quote lazy and quote overpaid con artist after receiving what he felt was a woefully subpar script from a pair of writers Darabont tells Executives quote if it were up to me I'd have not only fired them I'd have hunted them down and killed them with a brick then gone and burned their houses down quote I told those guys at least half a dozen times D mon continues why don't they listen to me when I tell them what uh the way to do it it's in one ear and out the",
            "start": 1255.2
        },
        {
            "text": "gone and burn their houses down quote I told those guys at least half a dozen times Darnell continues why don't they listen to me when I tell them what uh the way to do it it's in one ear and out the other it's almost as if they're intentionally telling me to **** myself whoa the gets more heated one year later in a series of emails sent to the show's core below the line team one year later as the delivery date rapidly approaches and Darnell is frantic feeling the footage is unusable so there's this goes on for a very long time yeah uh everyone should read through this obviously Frank Darabont was heated uh had a lot to say about this cared very very much about the show that and we all have him to thank for so there's not it's not that this is entirely one-sided I mean obviously like we all were shocked when after the first season Darabont was let go I was like I don't understand what's going on here why would you do this right seems like it might have been hard to work with",
            "start": 1296.8
        },
        {
            "text": "we all were shocked when after the first season Darabont was let go I was like I don't understand what's going on here why would you do this right seems like it might have been hard to work with a little hard maybe he's hard to work with or maybe there was something not jelling with the two the headline you put on the story is the best one of Frank Darabont should stop sending emails yeah that's very like this is like if I can give you one piece of feedback ladies and gentlemen if you want to be a complete **** that's fine if you want to blow things out of proportion okay just don't do it in a printed format that will be saved forever somewhere that can always get linked back you want to be a dick do it behind the scenes quietly whisper things in their ears like I or just yeah show just walk up behind people and choke them don't do that uh end of the story is actually interesting it says Alan Deron defends the email saying they were composed In the Heat of the moment",
            "start": 1336.48
        },
        {
            "text": "yeah show just walk up behind people and choke them don't do that uh end of the story is actually interesting it says David E. Kelley defends the email saying they were composed in the Heat of a deeply troubled production and that his complaints were well founded quote each of these emails must be considered in context he says they were sent during an intense and stressful 2-year period of work during which I was fighting like a mother lion to protect the show from harm not only on my own my own behalf but ironically also on the half behalf of AMC each of these emails was sent because uh a professional showed up showed up whose laziness indifference or incompetence threatened to sink the ship dar my tone was a result of a stress and magnitude of extraordinary crisis the language and hyperbole of these emails were harsh but so were the circumstances so yeah I mean Hollywood Productions are stressful this is stressful what we do is stressful so I can't even imagine throwing 300 more people",
            "start": 1372.48
        },
        {
            "text": "of these emails were harsh but so were the circumstances so yeah I mean Hollywood Productions are stressful this is stressful what we do is stressful so I can't even imagine throwing 300 more people in it in actual actually trying to make something good not just friends no we just sit out here and talk it's pretty it's pretty crazy Nick I added a story from the chat let's do it a friend in there I believe was Mr Yas man 300 was threw out two links the second one I didn't find interesting enough C says new details emerge on Quentin Tarantino's Manson Murders movie Margot Robbie eyed for Sharon Tate word of Quentin Tarantino's next project has already started to leak out which means it's time for another round of new Tarantino movie rumor Saga indeed unlike other filmmakers whose projects have been announced by a press release or our films they've been talking about for doing for years the holy unique sartino tends to put his movies together quietly until someone somewhere lets it slip then the",
            "start": 1411.84
        },
        {
            "text": "announced be a press release or our films they've been talking about for doing for years the holy Quentin Tarantino tends to put his movies together quietly until someone somewhere lets it slip then the floodgates open and we're left trying to put together the pieces each new Tarantino movie is an entity unto itself such is certainly the case with Tarantino's next film which we learned last night will have something to do with the Manson family murders an event that culminated in 1969 and saw followers of cult leader Charles Manson brutally murder actress Sharon Tate in her home as well as four others Tarantino is not officially revealed anything so everything we know thus far comes from the trades but last night's initial reports noted that the filmmaker is working to put his cast together before setting the film up with the studio and he's had discussions with Brad Pitt and Jennifer Lawrence for roles we now have a bit more clarity on who might be playing who and what that tells us",
            "start": 1451.92
        },
        {
            "text": "Setting the film up with the studio, and he's had discussions with Brad Pitt and Jennifer Lawrence for roles. We now have a bit more clarity on who might be playing who, and what that tells us about Tarantino's approach. Deadline notes that Pitt, who worked with among Glorious Bastards is being courted to play the detective investigating the murder, while Variety's Justin Chang instead says he's being eyed to play the prosecutor in the Manson trial. If Chang's correct in this one, it means Tarantino is interested in going through the trial of the Manson family and not just chronicling their cult and violent actions. Uh, he goes through there more of this stuff. Margot Robbie instead dead? This is where we're back to this part now. Tarantino famously considered Lawrence for the Hateful Eight role that eventually went to Jennifer Jason, but last night's reports stress that Lawrence is not in contention to play Sharon Tate. Instead, Deadline says that filmmaker has met with Margot Robbie about potentially",
            "start": 1490.72
        },
        {
            "text": "went to Jennifer Jason Leigh but last night's reports stress that Leonardo is not in contention to play Sharon Tate instead deadline says that filmmaker has met with Margot Robbie about potentially taking that part they also note that Samuel L. Jackson is expected to have a lead role in the film not a surprise but great news nonetheless do you think here's my question to you lay it on me do you think they'll cast Samu L Jackson as Charles Manson hell yeah wow change it up dude yeah ex change it up right change it up uh I don't think they'll do that now what is your thought you're where are you at with Quentin Taran I love Quentin Tarantino okay so where how does this sit with you I'm I it's weird that like I don't growing up cuz he's never done a movie I don't and I don't think he's done somewhere in real life biopic kind of movie yeah yeah that's the thing where it's like for me I like Tarantino movies I know he's not afraid of Blood and Guts and stuff like that and so it's weird to see that taken to a",
            "start": 1526.48
        },
        {
            "text": "biopic kind of movie yeah yeah that's the thing where it's like for me I like Quentin Tarantino movies I know he's not afraid of Blood and Guts and stuff like that and so it's weird to see that taken to a real spot a real place like I'm going to go talk about real murders you know and like I mean wrong I wasn't alive when this was happening but Charles Manson was still something I remember like a boogeyman we talked about when we'd watch Halloween or we watch like Jason or something like that you know what I mean so to see it and it's too early to say right I you I have no idea what the **** he's actually going to do what the movie is or you know what I mean but uh that seems weird that seems a bit weird I like it when he gets into his own universe and plays but I love Quentin Tarantino so I'll wait and see what happens got it what about you um I'm I'm I'm cautiously optimistic obviously Quentin Tarantino makes awesome movies I've Loved pretty much everything he's done yeah since he started making",
            "start": 1564.08
        },
        {
            "text": "wait and see what happens got it what about you um I'm I'm I'm cautiously optimistic obviously Quentin Tarantino makes awesome movies I've Loved pretty much everything he's done yeah since he started making movies since Reservoir Dogs uh my only concern is that we might wind up with something close to like an Oliver Stone movie on this one cuz you know I feel like his approach would be very similar to Oliver Stone's approach where it's kind of all over the map when it goes to it goes into reality so we'll see what he does here okay okay um you know like uh hopefully it'll be somewhere along the lines of you know I mean it's going to be a complete and drastic parture from a drastic parture from Inglourious Basterds so see what happens all right good man that's it for stories great if you didn't know ladies and gentlemen each and every weekday here on twitch.tv/ kindafunnygames we come to you with the nerdy news we want to talk about we also **** around need donuts do we got donuts no we're not any",
            "start": 1604.44
        },
        {
            "text": "\"Gentlemen, each and every weekday here on twitch.tv/kindafunnygames we come to you with the nerdy news. We want to talk about it. We also **** around. Need donuts? Do we got donuts? No, we're not any more. Donuts today! If you like that, you can follow us here on twitch.tv/kindofunngames, but if you really like it, we'd love it if you subscribed. Subscribing, of course, gets you the Kinda Funny logo next to your name, the cool emo. It's private chat time with us. You get to play multiplayer games with me, and you get to show adree unless we bake them in spoilers. We're about to bake one in. Um, however, remember it also more importantly than any of that enters you to win a video game each and every day here. You don't have to be here if you're a subscriber; you can go do whatever you want. If you are here watching live, great – you're entered to win the game no fuss no muss! If you want to amplify your chances, you can also go to patreon.com/kindafunny or patreon.com/kindafunnygames. The $2 level there gets\"",
            "start": 1644.84
        },
        {
            "text": "live great you're entered to win the game no fuss no muss if you want to amplify your chances you can also go to patreon.com kinda funny or patreon.com kinda funny games the $2 level there gets you entered to win each and every giveaway we do and we're going to be doing a lot of giveaways up here in a little bit wink you know tell you about that you know what I mean today we're giving away Shin Megami Tensei: Apocalypse on 3DS I just like saying it I do too I like it Shin Megami Tensei Shin Megami Shin Megami Tensei but first as was teased before you know this episode is sponsored by MeUndies now this is an exciting sponsorship for us of course because I've been wearing MeUndies for years now CU they're super soft and comfortable every day though we reveal what color undies I'm wearing and then have Nick touch them so remember this is not part of the ad they don't",
            "start": 1680.84
        },
        {
            "text": "for years now, they're super soft and comfortable every day though we reveal what color undies I'm wearing and then have Nick touch them so remember this is not part of the ad they don't - they didn't send us any to wear they didn't say hey reveal the colors Kevin do you want to get you you want to how do you want to do this in Sky Cam what do you want to do I don't know how this is probably the best he's going to get right and I'll come here today's color is burgundy burgundy oh **** it is it soft it's not not soft and these aren't new hold on and these aren't new smack it smack it good there you go jeez don't I slapped you you got a bruise well it's cuz you slapped me in the thigh like an idiot I'm an **** um I love these MeUndies I'm happy that they're sponsoring us cuz maybe one day now I will get free MeUndies but it doesn't matter cuz you can get them super cheap you can get 20% off your first pair plus free shipping at MeUndies.com morning that's MeUndies.com morning",
            "start": 1722.8
        },
        {
            "text": "one day now I will get free MeUndies but it doesn't matter cuz you can get them super cheap you can get 20% off your first pair plus free shipping at MeUndies.com Morning that's MeUndies.com Morning remember if you don't want just burgundy there's a bunch of different patterns cool crazy things they add new stuff all the time they're super super comfortable and soft I like them Jen likes them if you know what I'm saying need to order more for her uh or some for her they got limited edition patterns all this cool stuff H you know I like them I was paying too much for underwear I'm not lying this is not part of anything they've ever said I'm just saying I like these undies like them a lot get your unies 20% off your first pair plus free shipping at MeUndies.com Morning I need to use this myself wait my first pair I wonder if I can just register with a different email address yeah just keep going I'll just trick them it's big deal they're not it's the internet more of a good thing",
            "start": 1760.92
        },
        {
            "text": "myself wait my first pair I wonder if I can just register with a different email address yeah just keep going I'll just trick them it's big deal they're not it's the internet more of a good thing always a good thing yeah exactly always uh Shin Megami Tensei IV is going on the 3DS to Patreon supporter Phillip Snellgrove Philip Snellgrove you have won Shin Megami Tensei IV: Apocalypse a fun name 3DS snil grve snil grve snil grve snil grve uh I'm going to email that can you get into the tips and I can indeed can indeed I apologize in one quick text after the tips well hey if I read your tip thank you so much you guys have been awesomely supportive uh like Nick Mets has given us a tip said yesterday in my re-subscription message I talked about how how great Greg was on on the spot at RTX but forgot to mention how Tim absolutely killed it as well consider this tip my formal apology you sir do not need to apologize apology not accept it **** you DJ Kento has given us a tip and says I sent this",
            "start": 1797.88
        },
        {
            "text": "to mention how Tim Gettys absolutely killed it as well consider this tip my formal apology you sir do not need to apologize, apology not accepted **** you DJ Kenta has given us a tip and says I sent this to Big K Dog know if he showed you Mario Kart in VR exists in Japan, Japan trip I saw IGN put up a thing with the rocking chair and all this different stuff they got going on that's awesome yeah we'll take I'm down to go to Japan and remember Kojima invited us me to come play Death Stranding no no no **** you he invited us yeah we're all going we're all just going let's just show up on Kojima's doorstep and see if he lets us in do you have a spare bedroom for seven hey man what's going on we'll see cou how many couch you got there Kevin and I are down to sleep on the couch mm uh Serena has tipped us and says hey Greg I wanted to thank you and say I love you for being a constant stream of positivity in my life since 2009 through the ups and downs of my life you've always been there love",
            "start": 1852.36
        },
        {
            "text": "Thanks for tipping us, Greg. I wanted to thank you and say I love you for being a constant stream of positivity in my life since 2009 through the ups and downs of my life, you've always been there. Love from MTL. We love you too. Thank you for caring. Thanks for being there with us. Couldn't do any of this without you, of course. Indeed. And our final tip for today comes from Charles J. Hello boys! Boys, now that you've all watched Spider-Man, how do you feel about Tom Holland as Nathan Drake? If I remember correctly, you weren't totally convinced before. Did the movie change anything? I was...I told you before at the time. I love Nathan or I love Tom Holland, and I like the fact that if it's a prequel, like they're saying, then we get out of the way of stepping on the games and making everything all **** up. I think it's the smartest way you could go and do it. I love Tom Holland; I thought he was great in Civil War. I...I to be clear, I still don't think we need an Uncharted",
            "start": 1892.96
        },
        {
            "text": "it's the smartest way you could go and do it I love Tom Holland in Holland I thought he was great in Captain America: Civil War I I'm to be clear I still don't think we need an Uncharted movie Uncharted games are great we don't need to take every one of our video games and try to shove them into bad movies but if we have to get one which apparently we do cuz son's never going to let this die Tom Holland in a prequel with him and Nathan Drake all right cool that's fine I'm that could be fun yeah okay fun I'm into it as well that's it for tips let's call those calling tips no more tips we'll still read Subs after this remember if you tip from here on out or sub from here on out well actually when we read Subs I'll read them after Kinda Funny Games Daily so don't go anywhere keep being part of the show of course I got you did we do best friends already no we didn't we did not you go do that while that happens start queing up your questions comments and concerns we'll",
            "start": 1928.88
        },
        {
            "text": "keep being part of the show of course I got you did we do best friends already no we didn't we did not you go do that while that happens start queuing up your questions comments and concerns we'll do the patented More or Less this now is the time on Sprockets when we dance you see what I'm saying MH now is the time on Sprockets then we dance man I haven't thought of that bit in a long time it was it was not a good bit to begin with uh this section is called the show is called PS I love this be best friend xoxo this is your opportunity to give a shout out to someone you think in our community is doing an awesome job um how do you do that you go to kindafunny.com/bestfriend you can nominate him there give us a good reason for why they're doing a great thing and maybe we'll read them on the air just like Evan AKA snave AKA dork New York AKA puppy milk has done for one Kyle Stevenson say the July Kinda Funny what happened the  did it go the July Kinda Funny New York",
            "start": 1965.2
        },
        {
            "text": "on the air just like Evan AKA Snake AKA Dork New York AKA Puppy Milk has done for one Kyle Stevenson, say the July Kinda Funny what happened the **** did it go the July Kinda Funny New York City Meetup just happened and unfortunately I wasn't able to make it but Kyle personally reached out to me to remind me about it a few weeks ago he specifically remembered that I was bummed out about missing the previous one and that **** means a lot to me my IRL friends barely remember stuff I care about but this guy I never met did remember shout out to Kyle Stevenson shout out to Kyle Stevenson Kyle Stevenson is a good guy, he is he just gave was a nice shout out on Twitter for the new party mode that we have up there as well so I retweeted that remember new party mode at youtube.com/ kind of funny games go check it out and works really hard on him he does and he laughs a lot I just yell drunk and stupid yeah it's fine uh jumping into the chat Kevin I pinged you on slack to open up a",
            "start": 2002.24
        },
        {
            "text": "of funny games go check it out and works really hard on him he does and he laughs a lot I just yell drunk and stupid yeah it's fine uh jumping into the chat Kevin I pinged you on slack to open up a graphic for me Ryan DB said look at my Hugh Jackman poster he made a poster here we're going to pull up here where is it where is it it's going to come don't click on it don't let Kevin get it up so you can see it he'll put it on the big screen everybody will see it and enjoy it here we go close your eyes Nick's eyes are wide open yeah happening it's just it's so big it is huge I mean it's a Hugh Jackman off so how's the Hugh Jackman off going the Hugh Jackman off is that you and Darren Brazier are seeing who can get in the best Hugh Jackman shape by the time our next anniversary by our next annary now it's evolved a little bit because we originally were planning on uh betting each other a steak dinner at one Alexander's steak house but we've been going back and forth a little bit that might change I",
            "start": 2041.2
        },
        {
            "text": "it's evolved a little bit because we originally were planning on uh betting each other a steak dinner at one Alexander's Steak House but we've been going back and forth a little bit that might change I don't have anything to announce yet but we might be a little more altruistic about our goals here instead of giving each other money we might push that over to a charitable charitable thing does Hugh Jackman have a charity that's a good question is there a Jackman Foundation for kids off Google can you Google Kevin can you Google the Jackman Foundation and just see what comes up I don't know do me a search on the Jackman Foundation uh I would like this actually I i' actually like this to turn this into more of a charitable thing maybe for uh like kids with diabetes or something like that I don't know we have to find a good charity I think it's Hand in Hand for Kids go Google Hand in Hand for children and uh do it on your phone though so we don't get arrested by the FBI could you please do",
            "start": 2091.28
        },
        {
            "text": "something a Good Charity I think it's Hand Jobs for Kids, hand jobs for kids go Google \"Hand Jobs for Children\" and uh do it on your phone though so we don't get arrested by the FBI could you please do that for me so I got to talk to Darren a little bit about this it's going well for me um Darren has started the psychological warfare I have a lot of friends that work at IGN he's using them to get to me okay it's not working it's not working it's not gonna happen no he was telling him he was telling one Sean Pitts that he doesn't know if he's going to have time to work out because he's a dad y y y which I know is psychological warfare trying to get at my ego and the hair stuff yeah he's trying to get in my head so I'm slowing down uh I've been working out with uh one YF MCU mid youf yeah youf um he works over at Ubisoft he's a good friend of ours he is a mountain of a human being sure um and so he uh me and Sean Pitts have been hitting up the gym a lot putting on that weight it's been going well so far",
            "start": 2132.76
        },
        {
            "text": "over at Ubisoft he's a good friend of ours, he is a mountain of a human being, sure. Um, and so he uh me and Sean Pitts have been hitting up the gym a lot, putting on that weight it's been going well so far, going well so far. I'll keep everyone updated, you guys follow me on Instagram if you want to see are you noticing differences? Been what it's been a week or two of you're really beating the **** out well. There's there's two things that we're angling for right now as far as I'm concerned. One, I actually want functional strength, I want I want to increase my mobility, I want to increase functional strength, I want to strengthen the joints and have just an overall just be overall stronger and healthier, yeah. Two, I want to look a lot like uh Sylvester Stallone did in Rocky III when he came back and he was jacked the **** out with with the six-pack. I remember so we'll see what happens um but yeah I've been noticing I've been noticing some some decent gains in strength and getting a little more",
            "start": 2172.96
        },
        {
            "text": "he was jacked the **** out with with the six-pack I remember so we'll see what happens um but yeah I've been noticing I've been noticing some some decent gains in strength and getting a little more flexible which is good and uh yeah it's all it's all good my asman in the chat of course the one who submitted the Quentin Tarantino story he had a second one that I refuse to read but he's going to keep **** shoving it down our throats he says Nick have you heard that David Ayer exited Scarface reboot because the studio found the movie to be too dark it sounds like the studio wants to make a PG-13 version the **** would you make a PG-13 of scarface scarf that's a really bad idea that's a bad idea yeah don't do it Go Go scarface a remake of a movie already yeah well there was the original Al Pacino Scarface which I assume they're basing this off there's also a movie called Scarface that came out I think in like the 30s yeah but I don't know if that's I don't think they're going off that one I think",
            "start": 2213.96
        },
        {
            "text": "which I assume they're basing this off there's also a movie called Scarface that came out I think in like the 30s yeah but I don't know if that's I don't think they're going off that one I think they're doing the the remake of uh not Frank Darabont the **** the other guy's name Scarface wasn't based off that Scarface movie no those were two different movies oh **** if memory serves correctly one was about a Cuban American immigrant who comes over and starts a Coke Empire the other one I think was just about a gangster called called Tony Montana that was it was more like a a mob story that's who did it thank you in the chat has a question that I'm stealing from my Gog topic no one else can have it he says Hey guys none of you have seen Spider-Man homecoming and loved it I'm wondering if you guys are planning on ranking the MCU movie so far that would be an awesome topic we are now we are now I'll put that on the old topic list I just said I'm doing it I also have another topic that I want to",
            "start": 2251.4
        },
        {
            "text": "Are planning on ranking the MCU movies so far, that would be an awesome topic. We are now, we are now. I'll put that on the old topic list. I just said I'm doing it. I also have another topic that I want to do that revolves around Jimmy John's. Okay, she has a story about Jimmy John's employees being fired for tweeting out a meme about uh how they don't get sick days off and can't call in sick. No, I didn't see this, it's a fascinating story. Okay, I know you like the Jimmy Johns, I do like them too. We'll do that story at some point. Okay, good. Can we eat Jimmy John's while we do it? Oh no, cuz they don't have any here. Yeah, they do downtown. Oh **** should we go right now? Um, no. Okay, I I don't know what the schedule looks like. I would be down for those sandwiches though. IES, IES. We have to probably send something to pick those up. I think. With our schedule. People in the chat are correcting me, they're saying the original Scarface and the Scarface from uh De Palma's Scarface are based",
            "start": 2291.0
        },
        {
            "text": "send something to pick those up I think with our schedule people in the chat are correcting me they're saying the original Scarface and the Scarface from the uh from De Palma's Scarface are based on the same thing Loosely okay I thought so I'm gonna give a young zus here thing God I keep ignoring but he keeps asking Greg are you fan of the Marvel Run of Marvel's Runaways do you think it would be I've never I don't know I don't know The Runaways I don't have any information to give you that so you just stop that um I'm looking for one more before we put it on sub only uh Lakers head 2432 Nick and Greg my boss saw the Bongos part of the show earlier and said he needs to talk to me in his office later do you think I'm fired yeah oh God I really hope I mean what is your job either that or he wants to fire you that's even worse we just let him do it Danger 10 Nick are you going to see War for the Planet of the Apes uh yes I probably will see that at some point yeah yeah depends I got some",
            "start": 2330.24
        },
        {
            "text": "to Bongo, you know that's even worse. We just let him do it. Danger 10, Nick, are you going to see War for the Planet of the Apes? Uh, yes, I probably will see that at some point. Yeah, yeah. Depends. I got some stuff I got to do this weekend like what Jack went no wasn't the aren't you having some sort of housewarming party this week? Oh, I got a housewarming thing. Yeah, so I got to do that. Sorry, that's like two hours of your weekend are I'm excited that I just don't know when that's happening so I got to build Saturday night time. Saturday the night time is the night time. The night time, night time, sevenish, seven or eight, I don't know it's a thing really. She's like a 10 o'clock thing no no please we're old come on. I got a Wiener dog at home to take care of. Um yeah War for the Planet of the Apes I'm torn on because I really liked the James Franco reboot whatever the hell and I like Play of the Apes period. I've actually watched all the AP movies, I like playing of the aps but like the last one I felt was",
            "start": 2380.32
        },
        {
            "text": "I really liked the James Franco reboot whatever the hell, and I like playing of the Apes. Period, I've actually watched all the The Planet of the Apes movies. I like playing of the apes, but like the last one I felt was so like all right, cool. They're just fighting humans, and then this one is hey they're fighting humans again, like come on what's going on? But everybody loves this one. I mean it's got Woody Harrelson, and I love love Woody Harrelson. And I do love Caesar. Did you ever meet with Andy Serkis? Did you see him at RTX? No we didn't see Andy Serkis at RTX. Nick would have killed him so we couldn't do it. We had to keep him away from it, you know what I mean? We saw Andy Serkis at the uh the Funimation panel. Oh I heard about this yeah yeah and he was terrifying. Um looking through this thing Stark my balls really wants you to slow jerk me but I don't know if that's going to happen god um Titan Matrix says how can I suggest books for the book club",
            "start": 2421.32
        },
        {
            "text": "\"Terrifying, um, looking through this thing Stark. My balls really want you to slow jerk me, but I don't know if that's going to happen. God, uh, Titan Matrix says, 'How can I suggest books for the book club, Greg?' You're talking about comic books. Uh, we usually on the Wednesday episode go ahead and shout them out in the chat when we come around. Also, send them in. You could yeah, you could ALS like send us the copies of the book. Yeah, oh you can do that if you really wanted to. We don't go to the PO Box anymore, Zero Cool 1337. We got... we go to the PO Box still, send us stuff for Greg, Nick, and Kevin. If you had a shirt with a hidden glow-in-the-dark message on it, what would the message be? Send NES. This is coming nailed it. Oh God, this has come Jesus. It'd be funny not going to get better than that. Hilarious, yeah it would work. And let's do one more here, uh, Striven says Nick you're going to SDCC to do a set with Mark Ellis. Uh, that was referring to a Twitter exchange I had last night with Miss.\"",
            "start": 2458.88
        },
        {
            "text": "\"Hilarious, yeah it would work and let's do one more here. Uh, Striven says Nick you're going to SDCC to do a set with Mark Wiens. Uh, that was referring to a Twitter exchange I had last night with Miss Movies no, Mark hasn't reached out. I'm sure Mark has lots of people that he can reach out to to open for him but if Mark needs it, number 93 says Greg have you heard about the game Dead Cells? It's an awesome game that's in Early Access, it's basically Rogue Legacy if it was like Castlevania. That sounds **** awesome so there you go, that's it for the chat. All right it's been a great show today, it's been awesome today as a sorry my focus is a little off your focus was great don't worry about it you're dealing with more car issues you're dealing with things more car issues not like in my life the Honda giving you trouble time to get to I'm going to go to probably the next car I think I'm going to get not going to be a Honda I've had a lot of issues with this Honda yeah um I\"",
            "start": 2498.96
        },
        {
            "text": "in my life the Honda was giving me trouble time to get to i'm going to go to probably the next car i think i'm going to get not going to be a Honda i've had a lot of issues with this Honda yeah um i think i'm going to go to a much more reliable um uh car manufacturer like a Ferrari or a Lamborghini at least you're going to be you know you know what I mean I need something that's a little bit more get a Tesla yeah American come on I'll go American yeah I would actually I've been reading a lot about Teslas lately they can have them cheap ones right they well did you see that article that Elon Musk put out that says like there's about the supercharger network no I did not yeah apparently like he was like yeah you can go cross country now on the supercharger network if you if you hit a route and not have to worry about charging your your car it's pretty cool anyway thinking about it all right but I cant afford so ladies and gentlemen this has been the Kinda Funny Morning Show remember",
            "start": 2538.76
        },
        {
            "text": "and not have to worry about charging your car, it's pretty cool anyway, thinking about it all right but I can't afford so ladies and gentlemen this has been the Kinda Funny Morning Show remember each and every weekday here on twitch.tv/KindaFunnyGames we come to you with the nerdy news we want to talk about then we jump to the chat to ask your questions comments and concerns in between those two segments we give away video games you can win by subscribing supporting us on Patreon doing a whole bunch of different stuff if you're watching us on youtube.com/KindaFunny later or listening on podcast services around the globe thank you so very much remember we read tips throughout the show when you sub we don't we read them at the end of the show Nick will read them and then I'll come back with Kinda Funny Games Daily another show you can watch or listen to or whatever on youtube.com/KindaFunnyGames podcast service on the globe and then at the end",
            "start": 2577.32
        },
        {
            "text": "Read them and then I'll come back with Kinda Funny Games Daily, another show you can watch or listen to or whatever on YouTube.com/KindaFunnyGames podcast service online. And then at the end of that one if you subscribe or tip during that, I will read those as well at the end of that show. Nick, yes it's been a pleasure as always, thank you so much. See you in a few hours, my car is in the chat now. Oh good okay do what you got to do. I had I when I was growing up had a neighbor Joe Jackson; Jo bought a pickup yeah Joe and Carol Jackson oh wow but Joe Jackson bought a pickup truck and if I'm lying I'm dying you are not lying and I forget I was just a kid so I don't know bought a pickup truck hated it so much that he had a magnet made that was like this is the worst car I've ever owned and put it on the door and drove around the suburbs of Chicago in this truck like that's that's he's invested in that I mean that's like wow to him wow you know what I mean like that is ballsy Joe awesome until",
            "start": 2612.92
        },
        {
            "text": "the Dorks and drove around the suburbs of Chicago in this truck like that's that's he's invested in that I mean that's like wow to him wow you know what I mean like that is ballsy Joe awesome until next time it's been our pleasure to serve you all right everyone stick around I'll be right back with the subs and Greg will be right back with Kinda Funny Games Daily thank",
            "start": 2653.72
        }
    ]
}