{
  "id": 220,
  "video_id": "7PTsmhkSB28",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "David Ballard"
  ],
  "title": "Naughty Dog's David Ballard (Special Guest) - The GameOverGreggy Show Ep. 10",
  "description": "Naughty Dog's David Ballard comes to the show to discuss the worst hangovers we've ever had, who we would punch in the face, and the boys test some bourbon for Polite Provisions (http://www.twitter.com/politesandiego).\n\nSUBSCRIBE/LIKE/SHARE/BUY T-SHIRTS: http://www.districtlines.com/gameovergreggy\n\nEach and every Monday, Greg, Colin, Nick, and Tim get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy the MP3 version of the show on Band Camp: http://gameovergreggy.bandcamp.com\n\nMerchandise available for you body: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
  "published_at": 1392040806,
  "duration": 6562,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I am one of your hosts, Greg Miller, alongside the producer, Nick Sc arpino. Hi everyone, welcome. The pure one, Tim Gettys. Let Tim host, he's beautiful. The pride of Long Island, K Mor Arti Beyond. Whoa, oh, he hit his face on the mic. It looked like there. My my glasses giggled. That's why you wear him right, for protection. Yeah, and then none other, The Naughty Dog himself, David Ballard. Naughty. Yeah, I feel like your mic might be a little high. Did we not adjust you before this? It's right where we want it. We want it eye level. We want it eye level for D. You can twist. Want to come down a little bit? This mother like like this, like that. Is that better? That's good . Fantastic. You look like you're you're craning your neck. You do you want to get right in front of it? Have bad you know, scoliosis kind of you know, posture and get right into that right with scoliosis. H, what's wrong with scoliosis? I know people scol you know people with scis. Remember game",
      "start": 1.32
    },
    {
      "text": "front of it have bad you know, scoliosis kind of you know, posture and get right into that right with scoliosis. H, what's wrong with scoliosis? I know people scol you know people with scis. Remember game developers remember in school when you have to go do that test they put you in the the gym teacher. God, that was the worst cuz they make you take your shirt off and anytime during school that I had to take my shirt off, I was not happy. I was not a happy camper. Really? Oh yeah, I was junior high. Yeah, I remember. Yeah, they like adult what happened was like they they did the scoliosis test and they were like I was like, oh God, take my shirt off for this. I'm not really happy about that. Then I I had this amazing excitement when I realized that it was behind closed doors. Like you didn't have to do it in front of the entire scho like oh pants off whatever. Oh, then I was like nerd, you're eating a donut while tell you what's me. I remember tell you what Al me. Yeah, nice. Okay, do you remember uh did you guys",
      "start": 43.84
    },
    {
      "text": "front of the entire scho like oh pants off whatever. Oh, then I was like nerd, you're eating a donut while tell you what's me. I remember tell you what Al me. Yeah, nice. Okay, do you remember uh did you guys ever have to climb ropes in gym before? I never did that. They wouldn't let us. I think that was a thing of yester year. Well, yeah, cuz I I was going to say like I remember watching like Wonder Years and it was like a big episode about that, right? And then I was like so horrified going to high school and having to climb the it never happened. Yeah, when I was in grade school, they had the Rope there, but it was like one of those like Choose Your Own Adventure. You want to try the Rope, go try the Rope. Nobody de if you don't they wouldn't let us break a leg. It was a strict no rope rule. Get in there. Everyone's like dipping and dodging with the mics today. I was right here. It was fine when it was over there. Now you moving over here. You always talking right to the Audio Technica. You moved the audio there.",
      "start": 80.28
    },
    {
      "text": "like dipping and dodging with the mics today. I was right here. It was fine when it was over there. Now you moving over here. You always talking right to the Audio Technica. You moved the audio there. It is. Oh, thank you. If you could hold there. If you ever seen the GameOverGreggy Show or listen to it, the idea is simple. Once a week, four best friends, this time five, get together and each of them brings a random topic to the table for discussion. Then we post the high quality MP3 for $1 on Band Camp Friday, then on YouTube for free every Monday. GameOver.com. We call it's easy to get to. Who's goingon to go first this week? I'm going to go first. Go first. Mine, we have a very it's all fun games here. We got the dog, we got Ballard. I guess do we need to let Ballard explain himself who he is, what's he doing? Yeah, we should do that probably. They found me on the street outside their house and like, hey, you want to come up and shoot this podcast? And I was like, I don't know. I'm not sure that's how it was. Yeah, okay.",
      "start": 114.04
    },
    {
      "text": "we should do that probably. They found me on the street outside their house and like, hey, you want to come up and shoot this podcast? And I was like, I don't know. I'm not sure that's how it was. Yeah, okay. You make video games too? I make video games too. That's your job. That's a cool job to have. It is. David Ballard worked on Uncharted 2 Among Thieves, Uncharted 3 Drake's Deception, and The Last of Us. Tim, hand me that m GRE. M Greg, mik is doing something weird. Hold on, my mik's doing something weird. Doing something weird. Like it this m this is Greg's normal. We're vamping doing stuff. The Last of Us was the last of the games I shipped. Yep, for now. Who's the na of the Naughty Dogs Cogburn? Son of a ****. Curn is a naughty naughty na . Yeah, that's sure. And by the way, feel free to help yourself to the liquor oh back here if you'd like. We also have can I have all of it or you have as much as you want? Give me an ice cube before we get started on that. We have a very important job tonight to okay, this is",
      "start": 158.2
    },
    {
      "text": "oh back here if you'd like. We also have can I have all of it or you have as much as you want? Give me an ice cube before we get started on that. We have a very important job tonight to okay, this is we it's all fun and games here. We had Lex Luther on. We had Lex Luther on last time. We got David Ballard on this time. Get more than that. Nick over here shadow boxes. Tim talks about the time he had to poop. The GameOverGreggy Show has been tasked with something incredibly serious tonight. This comes from Eric Castro . He runs a fine establishment in San Diego called Polite Provisions. It is a bar. You should all go there. If you've been to San Francisco, it's like Rick House. It's fancy cocktails, fancy drinks. He turned me on the Eagle Rare. Exactly. He sent that up to us. He's very good about sending us stuff in general much like tonight. Ladies and gentlemen, at Polite Provisions, they serve all manner of fancy drinks. They have private barrels there shipped to them straight from distilleries that are big",
      "start": 202.24
    },
    {
      "text": "in general much like tonight. Ladies and gentlemen, at Polite Provisions, they serve all manner of fancy drinks. They have private barrels there shipped to them straight from distilleries that are big deals. I guess I don't know, probably more expensive than poured myself Knob Creek here. No, it doesn't matter. This is why I had you buy the Solo cups. See what I'm doing here? What is happening is they keep about seven of these at any given moment on tap for their high spenders, their big people who come in and get the fanciest of fancy drinks. He has sent us samples. We are going to pick the next private barrel he has at Polite Provisions in San Diego, 469 6 30th Street on Twitter, Polite San Diego. Here comes his letter. Letter. I've highlighted the good parts because it's he writes too much. Uh, we're going to be drinking Henry McKenna Single Barrel 10year bourbon. That's what we have here. We have several things jent the pride of Kentucky. These samples are uncut barrel strength right now. Oh, you know I love",
      "start": 243.2
    },
    {
      "text": "be drinking Henry McKenna Single Barrel 10year bourbon. That's what we have here. We have several things jent the pride of Kentucky. These samples are uncut barrel strength right now. Oh , you know I love uncut. So the alcohol by volume on them is very high. In fact, they are too strong to get a proper taste of them. So it is recommended that you hit them with some water. Why I brought that jar of water in the room so that they open up a bit. Just don't use ice that inhibits the aroma. It will make it tougher to pick out the one you like. Remember, we are not looking for smooth, we are looking for character. So keep your senses tuned for things that everyone loves about bourbon. These are going to be used for mostly fancy old fashions. It has to be good enough to hold its own though without relying on juice and mixers. So we have a few to try here. How many we got? Okay, and we want to do this first with uncut five. I we have the water. I mean, you want to do you want to drink for a while and then drink these",
      "start": 282.0
    },
    {
      "text": "and mixers. So we have a few to try here. How many we got? Okay, and we want to do this first with uncut five. I we have the water. I mean, you want to do you want to drink for a while and then drink these and see what's the fanc there's no good there's no good way. So here's the water. We'll cut it with. I seriously want this one this podcast in with all of us on the floor and like the video tape is just going for hours before we wake up. That's probably going to happen. I mean, even I should have P myself knob yet. I'm sorry. It's okay. I had no way to break it to you. Port keeps like ducking and diving in between my feet. Portillo go. It's exciting. No, he likes it beone. He's fine him last week where he was go to bed. He's right here. He's here. He's right here ladies and gentlemen right here. All right, so we have oh, they even they look like old timey medicine you see in like the West. Yeah, uh Henry Mckin single bear there's no special names to him. This one is 1292 alcohol by volume. Let me smell this before",
      "start": 320.92
    },
    {
      "text": "oh, they even they look like old timey medicine you see in like the West. Yeah, uh Henry Mckin single bear there's no special names to him. This one is 12 92 alcohol by volume. Let me smell this before I in this one is 15.6. This guy is 160 proof. Now Greg, not that I don't have any faith in you 125 proof. Yeah, it's just that have you checked this out yet? No , so you don't know if this person's real or if they oh no no no no no I'm sorry we know him. Oh, you know him. Okay, that bottle of Eagle Ros poison literally poison. Eric Castro is a fine young gentleman. He worked for a long time in San Francisco, ran Rick House, big IGN fan, sent me all that gin that used to Flo around the office. Then he float he sent up a whiskey package when I got cancer. He's a good dude. Here are polite as **** that is their sticker for Polite Provisions San Diego. Oh yeah, we got a whole bunch of don't worry since 2012. All right, awesome. Put a couple of those up. Yeah, so let's get going. Well, we're how many we got? We got five six",
      "start": 357.64
    },
    {
      "text": "for Polite Provisions San Diego. Oh yeah, we got a whole bunch of don't worry since 2012. All right, awesome. Put a couple of those up. Yeah, so let's get going. Well, we're how many we got? We got five six. All right, I was born in San Diego, so can I be the pride of San Diego the rest of night? Sure. Yeah, absolutely. Can you want to sell the La Hoya kid? Can I call you the La Hoya kid? So what do we want to do? You want to I'll let you handle it from here, Greg. Let's I'm going to take our glasses get him out of here for a minute. Tim, I'm assuming you're the pure one you're not drinking. I'm the pure one. Yeah, all right, you're not going to drink any of this. You know what actually whoa I'm doing it for the for the for the stro as I would call cast. Oh, okay, and I need another one right cuz we got five yeah perfect. There we go. You couldn't really be a part of this conversation if you know so remember we're looking for things that everybody likes in Bourbon. Mhm. Let's if you want to run the first one grab their",
      "start": 411.48
    },
    {
      "text": "there we go. You couldn't really be a part of this conversation if you know so remember we're looking for things that everybody likes in Bourbon. Mhm. Let's if you want to run the first one grab their first one there put a good sip in there we'll put some water in there how much do yeah so so by the way a lot I didn't know this until recently actually that when you drink bourbon it is cut with with water I didn't know that right right right right right and uh so I don't know how much water to put in which serial number are you pouring right right now David uh where are the serial numbers okay here uh 44 7804 all right this one go ahead and pour them you pour a little bit in every cup and then we'll we'll top them off with water I'll give you the rundown here Eric has given us the notes on these all right the nose on this one is butterscotch and spice The Taste is Oak and Cornbread the Finish tobacco and cinnamon overall he says good Rich Aroma but a bit thin on pallet okay let's get some",
      "start": 452.84
    },
    {
      "text": "all right the nose on this one is butterscotch and spice The Taste is Oak and Cornbread the Finish tobacco and cinnamon overall he says good Rich Aroma but a bit thin on pallet okay let's get some little education here first so these words you just said the nose yeah is this a thing nose is going to be the smell of it taste is going to be the way it hits your taste the Finish would be the aftertaste and then overall I think just these his not like in my opinion Knob Creek has a very nutty you pour some water there like aftertaste in here no in that guy you pour him every cup needs to be cut with water uncut mean that's a little well so like I was saying you you make video games I think that's kind of hard it's cut with water what's that mean just there's water diluted it means diluted wow okay so when you have uncut cocaine for instance that means it's pure when you cut it with things it means you you know how much whiskey I drink sir I you know more about it than I do I guess I'm",
      "start": 491.76
    },
    {
      "text": "wow okay so when you have uncut cocaine for instance that means it's pure when you cut it with things it means you you know how much whiskey I drink sir I you know more about it than I do I guess I'm pouring you another one of the other ones here while we get going this is going to turn into a quick is very exciting for like a uh we're big bourbon people we're going to be **** wrecked by the way so I'm going to just sip I'm going to drink all of it I'm going to pour all of it into one cocktail like a really bad but how so are we are you keeping notes about how we feel about all this I think it's where we'll just pick as we go right and then we'll know we have a photographic history of it look at is photograph go every time does it makes me life Greg what are you doing I'm getting the other one going so we don't sit here for nickel back too your wikip look at your iPad freak Wikipedia freaking out did you ever see uh the movie what was the one with that whiteb holiday Tombstone",
      "start": 537.92
    },
    {
      "text": "other one going so we don't sit here for nickel back too your wikip look at your iPad freak Wikipedia freaking out did you ever see uh the movie what was the one with that whiteb holiday Tombstone Tombstone Dynamite movie remember when Maddie kept drinking the stuff yeah and he was like damn it stop drinking all that medicine yeah that's what this reminds me of okay great so here this is serial number 44784 a good smell that does smell good it does it does smell butterscotch and spice get your nose in there don't just I don't know about the butterscotch you don't smell butterscotch spice oh yeah yeah dcta that is tasty yeah that is not bad at all that has a hit to it though it's got he got a kick in the back look at tmy look look at the pure one go the kick the pure one drinking reception **** I really like this one that's really good that one's fantastic well now don't give out your perfect 10 just yet everybody I learned the hard way I feel like we should have spaced this out",
      "start": 583.28
    },
    {
      "text": "**** I really like this one that's really good that one's fantastic well now don't give out your perfect 10 just yet everybody I learned the hard way I feel like we should have spaced this out every episode for the next like four weeks otherwise my li do you want to do that I don't know I mean I don't know when he has to order the barrel that's the other problem here's the thing we can be we can be gentlemen you don't have to drink at all we don't have to drink your whole thing you have there you do okay well col says I'm actually I'm going to go drink with a Russian after this so you're screwed it's over you drinking with some Irish guys and then you're going out with the Russian that's in trouble for you all right so do we want to you want to move to the next one then get the waters going on these guys M I want to keep these like here I um put them in order I'll be right back are you gonna get sharpie yeah there's three Sharpies right there in the little cup on the window sill in",
      "start": 639.6
    },
    {
      "text": "on these guys M I want to keep these like here I um put them in order I'll be right back are you gonna get sharpie yeah there's three Sharpies right there in the little cup on the window sill in the new studio next we are moving ladies and gentlemen to serial number 45 73414 let's see what we got there 4573 they need names for these do they have names for these not any of the notes I have I'm going to call the first one I'm going to call the first one the Screaming Eagle okay how do you feel about that that's a that's a hard hard one to do but that too too harsh is butterscotch is screaming that's thank you thank you I know thank you you don't think an e can have butterscotch I just how dare you sir matter with you all right ladies and gentlemen the next one for this is for 4573 414 the nose brown sugar and molasses I'm going to call this one The Taste can you just let me get through any of the things before you just name it immediately the Boston Terrier taste complex leather and",
      "start": 681.4
    },
    {
      "text": "nose brown sugar and molasses I'm going to call this one The Taste can you just let me get through any of the things before you just name it immediately the Boston Terrier taste complex leather and peppercorns complex leather yeah finished spiky spicy Orange Peel overall excellent very complex I actually love Le leather tastes delicious **** awesome your iPad just opened up Netflix all right iPad we get it you don't want things on you very much where's the button what where's mine thank you this one's the has complex leather it's supposed to smell like the Colin what you write the numbers on one I wrote one I'm going to write the okay that's fine I'm GNA do that too I'm going to do four seven so this will be two now I'm not I'm not a fan of the smell of this one immediately it's a more subdued smell it's not as butterscotchy definitely less butterscotchy did we cut this water yes really as you all know I love butterscotch ooh I like the smell of this one a lot really it's looking",
      "start": 724.56
    },
    {
      "text": "subdued smell it's not as butterscotchy definitely less butterscotchy did we cut this water yes really as you all know I love butterscotch ooh I like the smell of this one a lot really it's looking it's like it's like a man it smells like complex leather oh that's good is complex leather something you'd find like an L skin leather is it like cow leather I mean what kind what kind of car we find now come on Colin I could drink this all day and all night this is **** good all right this is real good that wo that's not as uh harsh as I thought it would be it fills the mouth oh my God yeah that's good oh yeah like smells like a really like it tastes like a really good leather you know what I mean well it's like it's like when I watch that documentary so which I I recommend a lot of people here it's you watch a lot of watches he doesn't like fiction anymore and it's about it's about the test to take the master Samo test there's only 180 of them in the world and a lot of people have been",
      "start": 774.44
    },
    {
      "text": "it's you watch a lot of watches he doesn't like fiction anymore and it's about it's about the test to take the master Samo test there's only 180 of them in the world and a lot of people have been watching and tweeting me saying about the recommendation but there's all of these like things they say like where it tastes like weird things that aren't actually tastes real but like that's what it tastes like you know interesting yeah so it's the same thing I'm sure you're write your numbers down too oh my God there is oh yeah you I have hints of complex leather that one tastes a little bit like a warm ice cream Snickers bar okay I can go with that one I can actually do that brown sugar sugar you know what say ladies and gentlemen remember we are drinking these thanks to Eric Castro from Polite Provisions San Diego on Twitter if you're in San Diego 4696 30th Street you bet your bottom dollar when we go to Comic Con this year we'll be drinking there wait which one did you just put in all one",
      "start": 822.52
    },
    {
      "text": "Provisions San Diego on Twitter if you're in San Diego 4696 30th Street you bet your bottom dollar when we go to Comic Con this year we'll be drinking there wait which one did you just put in all one two three all let me see what three's numbers are you cut them with water not yet I'm about to do right now number three is 458 4420 what do these numbers mean these are their serial numbers like they barrels that have all been aged for 10 and this is like what you get out of the sample this **** was this **** was put in a barrel in 2004 that's what I love so much about 911 hadn't even happened yet exact that's exactly right Greg this is freedom it's only 2008 Freedom bourbon the nose faint butterscotch faint oh man the taste this is for you this is for you the taste sweet corn and cola I'm there the finish the Finish toffee and orange overall note from Eric Castro very good Great Taste but Aroma is a bit light thank you Mr Balor so are you supposed to be just smelling these things",
      "start": 860.56
    },
    {
      "text": "I'm there the finish the Finish toffee and orange overall note from Eric Castro very good Great Taste but Aroma is a bit light thank you Mr Balor so are you supposed to be just smelling these things all the time mhm bourbon yeah it's part of it as part of is part of it is enjoying the aroma of the whiskey just like a cigar bourbon's not something that I mean traditionally when we all go out we just slam alcohol you know to build upage Bourbon and Scotch a good bourbon and good scotch you're not really supposed to do that with it's more of a sipping relaxing you know you don't really want to cut a good bourbon with ice you don't want to cut too much a good scotch with ice you just want to kind of I've learned that word tonight there you go dilute rather I think this is my least favorite so far neat as they say I'll tell you what it's not this it's not Coca-Cola it's not mexic Coke from the corn RCA RC Cola that one's not my favorite no I think this is my least favorite so far okay",
      "start": 909.56
    },
    {
      "text": "so far neat as they say I'll tell you what it's not this it's not Coca-Cola it's not mexic Coke from the corn RCA RC Cola that one's not my favorite no I think this is my least favorite so far okay actually it's still fantastic actually really like this but it's yeah of the three so far yeah these are all better than most of the things we drink here that is a fact oh my gosh I'm I'm going back to all of them though you're going to do another taste around here before you finish it sure you're taking your job seriously and that's why I love you yeah the same I'm going to call that one the Superman the Superman the Superman the one of the we talk about all the time how we we knew we love Nick Scarpino one of the first times I knew I'd love Nick Scarpino is when he would walk around the office going Superman you do that R but I mean like and he it's toned down now Tim no it used to be that it would be four times a day for no reason and then then it be came when somebody would say Superman",
      "start": 951.12
    },
    {
      "text": "going Superman you do that R but I mean like and he it's toned down now Tim no it used to be that it would be four times a day for no reason and then then it be came when somebody would say Superman then if you saw something blue so Al Alexis Alexis uh hit this the nail r on the head uh she said that sometimes I'll watch a movie and then the next day I'll pretend for like an entire week straight like I'm one of the characters from the movie and I watched Superman 2 one time like a long time ago came he shows that you were the girl that you were Ursa that's who you pretended as you walked around you know sometimes you got to go with what you got to go with I'm not knocking it no but she has that one lovely part Superman Superman and that's it so I say that a lot and Greg loves it it made Greg laugh that was the first time I made Greg laugh so I just stick with it that's you're great Ned Love at First laugh Ned I didn't know who he was yet let's call him Ned I like that let's call",
      "start": 994.04
    },
    {
      "text": "Greg laugh that was the first time I made Greg laugh so I just stick with it that's you're great Ned Love at First laugh Ned I didn't know who he was yet let's call him Ned I like that let's call keep call him Scrappy dude know Scrappy Doo is the best name ever he walks into the uh into the lunch place we having lunch today and I was like oh hey look it's Scrappy Doo there you go never before that's a true fan do I wish my nickname was the Terminator yes I do am I probably going to get saddled up with Scrappy Doo that's that such is my life I wish my nickname was Skynet oh I'm G to call you Skynet from now on would that be an awesome nickname yeah that'd be cool cool cool story um uh SpaceX n dog got to go do a tour of SpaceX really cool and they have a server room full of servers and in both sides of the servers one server room is called Skynet and the other one is Cyberdyne systems that's awesome and it's SpaceX I'm like dude we're doomed like yeah but my question is this when you",
      "start": 1037.4
    },
    {
      "text": "both sides of the servers one server room is called Skynet and the other one is Cyberdyne systems that's awesome and it's SpaceX I'm like dude we're doomed like yeah but my question is this when you name an actual Advanced Computer array Skynet are you asking for trouble yes it's a brilliant name like whenever they came up with the idea like what are we going to call the you know the futuristic computer system and they like Skynet which one is this oh it's perfect yeah uh number four I know I need to MERS give you the notes son all right here we go this is 45734 2 in case you want to order it at home the nose is Sweet Caramel The Taste is vanilla and peans the Finish cinnamon and charred Oak overall excellent nice mix of fruit and spice this sounds delicious Colin what's your first don't even drink it Colin what's your first impression of this what notes are you getting Colin smell like Sharpie stop writing on them before you smell them stop licking the Sharpie Ballard it smells sweet",
      "start": 1077.96
    },
    {
      "text": "drink it Colin what's your first impression of this what notes are you getting Colin smell like Sharpie stop writing on them before you smell them stop licking the Sharpie Ballard it smells sweet to me this bad boy boys what was supposed to be the scent the nose on this bad boy was sweet caramel yeah it smells sweet Tom I started for a while I was smelling my microphone I'm like doesn't smell like anything SM the B my this is it this is it that's the jam oh this is my jam oh dear oh dear there was an epiphany to my right just now oh yeah that's like sliding into a bark lounger right there in a good way look an expensive leather bark louer oh yeah like that fine leather see this one didn't tell you about Castro just gave you he's too good to us polite Provisions in San Diego make sure you tweet at him and say uh at polite San Diego you wasted the show watching these guys get wasted do you remember the movie Blow who could forget it starring Johnny Depp and PeeWee Herman I remember I",
      "start": 1124.44
    },
    {
      "text": "tweet at him and say uh at polite San Diego you wasted the show watching these guys get wasted do you remember the movie Blow who could forget it starring Johnny Depp and PeeWee Herman I remember I imagine that's what Eric Castro's life is like right now I don't know Eric Castro but I think that that maybe a lot is he super cool I'm already good like really liking him a lot but I imagine that he's Johnny de's character from blow oh my God the only one the only thing there's only one thing I know for sure right now Nick number three is out yeah number three for me it's down to two and four two and four in the R I would say two and four one's strong I'm one and four right now I think I'm one two and four all in play wait which one did I refer to B in play which one did I refer to as the melted Snickers ice cream bar you said that one for number two okay let me the brown sugar and molasses you said number two is out one two and four are in one two or four two and four play",
      "start": 1174.2
    },
    {
      "text": "to as the melted Snickers ice cream bar you said that one for number two okay let me the brown sugar and molasses you said number two is out one two and four are in one two or four two and four play three is definitely yeah that nose on this one is it just smells it's like all right ladies and gentlemen I guess just gentlemen you're about to enjoy 4582 264 yeah that's good this one this one has a nose of deep cinnamon and brown sugar taste Oak and vanilla finish chewy black pepper whoa that's amazing overall the note says it's great lots of spice and Oak Rye dominates this is the this is an exciting moment for I like the smell of this one Colin I used to go wine tasting mhm which I which by used to I mean I get dragged to a wine tasting every once in a while and depending on the group it can always be really fun but I never really liked tasting one but this is a lot more fun if it had been like this I think I'd go to more tastings I this is why I want to go to Kentucky with all of us",
      "start": 1217.12
    },
    {
      "text": "can always be really fun but I never really liked tasting one but this is a lot more fun if it had been like this I think I'd go to more tastings I this is why I want to go to Kentucky with all of us yeah yeah you talk about I know about that one Greg Miller Greg Miller you know we come off you know we have like oh we don't have any paper I haven't even tasted yet cuz I like this those tissues from Japan I like the smell of this one a lot this one got kick I like that one is the strongest yet well that's got pepper holy **** oh my God this one is theer finish right I can taste it it's got like cayenne pepper on the bottom of it like a look do you see it's got some they've actually added pepper to this could be piece of the barrel right might be might be o could be AIC Caster's finger we don't know we just drink stuff that comes in the mail I like this one this one's strong as **** GRE have you ever thought about that though cuz we get a lot of stuff sent To Us by yes you ever",
      "start": 1266.16
    },
    {
      "text": "we don't know we just drink stuff that comes in the mail I like this one this one's strong as **** GRE have you ever thought about that though cuz we get a lot of stuff sent To Us by yes you ever think about one day just going to poison you well I mean I don't eat food generally I know Eric long enough but maybe that's been his game been maybe this is his game all along think I don't eat food for fans same food General oh Greg eats we all do team fat remember when we went to Underdogs the other day and order two tacos and a thing of wings how could I forget how do we do it Tim is it I don't know TF T right here you push it this you go t and you push it to the F oh TF damn damn it's like Li so we we right now three is out of the running is what we've decided right yeah three's out I'm going I'm going one or two that's man I got to go all the way back through I was going to say you want to Bath rotation again take three out number one hit me with everything again about wait does",
      "start": 1310.92
    },
    {
      "text": "going I'm going one or two that's man I got to go all the way back through I was going to say you want to Bath rotation again take three out number one hit me with everything again about wait does everyone get a veto calling you veto three we'll do a vote there four there's five of us that that that work out at this point all right so Nick to your to your words let's all keep our thoughts secret from now on okay and then we'll vote we'll go we'll go down the table after we tast it again sure and we'll say what win takes now so we're doing all of them again or are we saying three is limited we could do three again but I may you know maybe give it another shot okay okay I don't know all right gentlemen you're going to be drinking number one the nose butterscotch and spice The Taste Oak and Cornbread the Finish tobacco and cinnamon okay the hair Tim Gettys your hair is looking good today how much how much hair spray do you use on that hair I don't use any spray I use this weird product",
      "start": 1354.36
    },
    {
      "text": "Cornbread the Finish tobacco and cinnamon okay the hair Tim Gettys your hair is looking good today how much how much hair spray do you use on that hair I don't use any spray I use this weird product remember we are not look for smooth we are looking for character so keep your senses tuned for things that everyone loves about bourbon oh that's good has to be good enough to hold smooth oh boy one and five have a little bit more bite to them five got the character you think one has more bite to it yeah one definitely from one to two one you're drinking one it has a lot more it has a lot more bit why did I just see you put down a cup mark five then because I put this here I would know the difference and gentlemen we have a hanging chad and I want B from the voting procedures I don't like being called a hanging chad I don't get that reference God really explain it to him in 2000 when Bush ran against Gore Florida was a contested State and they went through and counted all the votes again",
      "start": 1393.08
    },
    {
      "text": "called a hanging chad. I don't get that reference. Greg, really explain it to him. In 2000 when Bush ran against Gore, Florida was a contested state and they went through and counted all the votes again and it was this big thing where there were some ballots with like, you know, when you punch something like do a whole punch, but the paper hangs on to the paper, it's called a hanging chad and they were trying to figure out would that count as a vote or not? That this was a whole, I can't believe you don't remember this, but this is a whole 10. It was a big deal. It was a whole, there he was playing Power Rangers. Yeah, yes. And it took forever. It took forever for uh finally Al Gore came on TV and quit. Yeah, it was Gore. It took forever for him to to like say, you know what, I'm done. We almost got to an inauguration day where everyone was wondering what would happen if you got that far. Awesome. I you know, and I was young too, your age. How old were we when they 2000? I guess is what you 20, 10th grade. So we weren't",
      "start": 1436.08
    },
    {
      "text": "day where everyone was wondering what would happen if you got that far. Awesome. I you know, and I was young too, your age. How old were we when they 2000? I guess is what you 20, 10th grade. So we weren't that super young. I was, I was also, I've also been really into politics since like was my thing was I don't remember you remember you remember the movie one of the and I know stick with me here the Michael Moore movies that the document he did about all this and he had the whole thing on when Fahrenheit 911, that was it right? Yeah, and where when Gore is like in the Senate right? Congress Gore was vice president. Yeah, so what which one did he oversee senate senate Okay and like they come in and they're all like say like all these people are saying it's under protest, you know, that he's lost the election or whatever, but he has to just like say too bad I lost the election or whatever. I never saw that on the news, but then you know, there's a big part of the documentary about him. I thought that was real",
      "start": 1477.24
    },
    {
      "text": "or whatever, but he has to just like say too bad I lost the election or whatever. I never saw that on the news, but then you know, there's a big part of the documentary about him. I thought that was real interesting, sad, real sad. I remember my mom crying when he gave up the election. I was happy. Yeah, well, I'm sure you were, but that look what that got us. Yep, two term president got re-elected, legitimized them. Number two, ladies and gentlemen, number two is a nose brown sugar and molasses taste complex, leather and peppercorns. I smell Lea. It's so fun. **** spicy orange PE. I actually do smell the leather too. Smells like a new car, like a good way a car you want to lick. I'm just like going through now I'm like like just like tossing back like every yeah, I think I missed I messed up the game and I drank the whole thing the first time. Was I supposed to keep more? You drink them all. Yeah, oh my God, you're gonna be **** was I was gonna say look at his look at his eyes start to go actually actually uh I",
      "start": 1513.76
    },
    {
      "text": "the whole thing the first time. Was I supposed to keep more? You drink them all. Yeah, oh my God, you're gonna be **** was I was gonna say look at his look at his eyes start to go actually actually uh I I was worried about the pure one. So actually every one that I poured the one that had the least amount I gave you're good man. He's also the one who's got to edit the podcast tonight for the first time ever. Jim's also wearing a sticker on his arm. That's where he's at right now. I put that on before I even drank. I thought about putting one on the wall. It does have curse word on it if we want to ever get sponsored one day. This is hard not I have to wor about it too hard now. Do you want to go you want to go to order now three? Yeah, yeah, let's do remember we drank okay. I guess three's out. I think, but let's TR let's give it another chance. Number three nose faint butterscotch taste sweet corn and cola finish toffee and orange. It's the lightest one I think. See, I think one's the lightest it's not",
      "start": 1554.36
    },
    {
      "text": "but let's TR let's give it another chance. Number three nose faint butterscotch taste sweet corn and cola finish toffee and orange. It's the lightest one I think. See, I think one's the lightest it's not bad. No, not bad, but but it's not as good as one and two. I actually like it more the second time around, but not enough to Dethrone my favorites. Oh yeah, that's got kick. Every's probably watching this being like why aren't they drinking water and **** too it in between? We're not really doing it right, but no, all I taste now is burn. I'm not going to lie. It doesn't burn me at all cuz this is all I drink. Yeah, me and Colin are men. You're a little boy. We get it. It it it's hard. I like when my girl my girlfriend every once in a while like I'll get a good bourb and she'll like taste it and she like can't even handle it and like I can just drink bourbon. So that's just you know what you do if you drink beer or whatever you drink you know you get used to it. Number four nose sweet caramel taste vanilla",
      "start": 1592.28
    },
    {
      "text": "even handle it and like I can just drink bourbon. So that's just you know what you do if you drink beer or whatever you drink you know you get used to it. Number four nose sweet caramel taste vanilla and peans finish cinnamon and chard Oak. Oh yeah, that's good. I like how you say peans pan. Yeah, some people say pecan. Yeah, you get around makes me happy caramel caramel. Some people say khed some say khed in the in the words of DJ khed. Oh my God, I was like what word are you talking about and then I realized 10 years down and you are talking about the thing I'm thinking about popular rap my entire mouth is on fire in a good way actually was just I was drinking one now I got to drink four you **** man I oh I don't know there is all right are we on to five number five then we'll you know I'm not going to drink five it's too spicy for me it's got too much character nose cinnamon he does remember this I'll read you the rules one more time actually drink one more then we'll read the rules we'll go",
      "start": 1630.88
    },
    {
      "text": "to drink five it's too spicy for me it's got too much character nose cinnamon he does remember this I'll read you the rules one more time actually drink one more then we'll read the rules we'll go from there number five nose deep cinnamon and brown sugar taste Oak and vanilla finish chewy black pepper chewy the black pepper I totally get one I still taste the pepper oh bourbon's so **** good oh my God God bless it that's why they call it I'm actually more of a scotch guy but but we're pretty solid too remember Eric Castro writes we are not looking for smooth we are looking for character so keep your senses tuned for things that everyone loves about bourbon we will be using this bourbon in mostly old Fashions so it has to be good enough to hold its own without relying on juices or MI mixers so people will drink people will drink this neat correct that's how that's how OG Colin drinks OG I like OG Colin so I have to say my vote is for I would say four because that to me was the best but",
      "start": 1683.4
    },
    {
      "text": "so people will drink people will drink this neat correct that's how that's how OG Colin drinks OG I like OG Colin so I have to say my vote is for I would say four because that to me was the best but if we're looking for character if that's what we're judging on I think he wants us to judge it based on what we also like right I don't know yeah don't vote for something you don't like just cuz it tastes like knocks you in the head I mean here's the easiest way right you're not you're not looking for smoothness you're quote looking for character so keep your senses tuned for things that everyone loves about bourbon I I don't know I liked four a lot but five kicked my ass five's too much I think five's too much for me so I'm gonna go four all right Colin where you already oh know yeah I got to go back through David Balor okay I'm going with number two and the reason is it is very it's a very rich and complex flavor uh you get a lot of notes like the definitely sweet uh get that leathery",
      "start": 1737.12
    },
    {
      "text": "to go back through David Balor okay I'm going with number two and the reason is it is very it's a very rich and complex flavor uh you get a lot of notes like the definitely sweet uh get that leathery but also I can imagine this in a oldfashioned or whiskey sour and I just think it would absolutely compliment uh both of those drinks too so excellent yeah Greg Miller is casting his balot for four I enjoyed four quite a bit good choice Nicholas Scarpino the producer I'm taking this real seriously that's why I'm taking swigs of water yeah I know I'm taking swigs of water out of the **** jar I didn't realize that part I'll go with well we don't need it anymore I know and I'm clean you vote for down bro tell you this is your call I love you I had it in my brain and then I totally forgot it I'm going to go with four also four Sor yeah go with four all right call morard you would you like to waste your vote I want to cast an Hest ballot okay so Greg he just did the great Oreo thing yeah",
      "start": 1781.08
    },
    {
      "text": "I'm going to go with four also four Sor yeah go with four all right call morard you would you like to waste your vote I want to cast an Hest ballot okay so Greg he just did the great Oreo thing yeah it's not an interesting MP3 I guess not not not not terribly interesting just when he's doing that part this this has been a fun discussion has and if not you skip ahead big deal screw off hold on a second there any other bars that would like to donate some uh alcohol testing remember when you're in San Diego visit polite Provisions at 4696 30th Street follow polite provisions on Twitter polite San Diego that's Diego I think I think I know where I want to go but hold on they're polite as **** they are polite as **** saying according to the sticker that Tim I actually like that sticker it's awesome yeah it's really cool all right aome okay it's got to be number four yay in a land slide victory that was hardcore David Ballard **** off and diead let's go it was between one and four for",
      "start": 1829.0
    },
    {
      "text": "awesome yeah it's really cool all right aome okay it's got to be number four yay in a land slide victory that was hardcore David Ballard **** off and diead let's go it was between one and four for me what did you B two two two is really good that was had a star for me too two is actually in my opinion a little stronger than four actually too so that was another reason I went for that one I I got to say though five as character five is the character winner see like if I was going to go to the bar I would order five if I was just getting one on the rockster straight yeah totally I like five a lot really Johnny five's alive yeah Johnny I really feel like I could sip on this smoke you know a nice mild cigar number four oh no totally no no that's what I'm saying like but I mean like I'm just looking at different things like I would order four as well so did he say what he's naming the new one no I don't think because it's not I think correct me if I'm wrong a little bit here on Bourbon",
      "start": 1880.96
    },
    {
      "text": "looking at different things like I would order four as well so did he say what he's naming the new one no I don't think because it's not I think correct me if I'm wrong a little bit here on Bourbon it's kind of like wine right you put it in a in a cast iron it comes or iron the oak it comes out a bit different every time so that's all this is is like we're picking the Henry McKenna Single Barrel 10 yearold yeah I think these all winning probably at the same time in 200 so this comes out I think that this gets picked with that name he just picks which kind cuz if we can call it the Johnny Five I'm going to change my five wait a minute wait no nobody has to know that there's a five in it it's sweet caramel so it could be like we can s number we also shouldn't call it Johnny anything oh good because it's that's a scotch can we call Johnny Walker the Henry McKenna Fantastic Four there it is Boom all right the Fantastic fourl polite as **** put it on a bumper sticker there it is Eric",
      "start": 1921.12
    },
    {
      "text": "because it's that's a scotch can we call Johnny Walker the Henry McKenna Fantastic Four there it is Boom all right the Fantastic fourl polite as **** put it on a bumper sticker there it is Eric Castro thank you so much for letting us be a part of your business we hope we pick the right one everyone go to polite Provisions in San Diego follow me on Twitter polite San Diego then go to their location 46 96 3 0th Street San Diego let's keep these bottles too this is a cool momento we would never get something like this like from a like a legit you know um Distillery so that's my topic and now that we're all good and buzzed who wants to go next I'm going to keep the notes out in case we want to so actually my topic would tie in perfectly uh for this go for it oh dear my topic is uh worst hangover experience you've ever had I want to know what how epic your night was that made your hangover that epic as well I have a fun one yeah it was Halloween about I think I was in college might have",
      "start": 1958.52
    },
    {
      "text": "over experience you've ever had I want to know what how epic your night was that made your hangover that epic as well I have a fun one yeah it was Halloween about I think I was in college might have be my senior year in college we're talking 2002 2001 I decided from I don't know why I don't know why I decided to do this but I went as the Incredible Hulk and I painted myself or rather my brother helped me paint myself from head to toe green so I took oh yeah I have them somewhere I I I'll have to find them for you description ladies and gentlemen I'll have my brother uh take pictures and send him up I'll tweet him out he'll take pictures well he's got well this was before digital photography prevalent so these are all actually printed out um he has to take a picture of it but I I got really drunk at um at my friend's party we went back I have no idea how I got home and I woke up and I was like and I looked at myself and I kind of just was a faint green and I'm not sure why and I then I",
      "start": 2002.96
    },
    {
      "text": "drunk at um at my friend's party we went back I have no idea how I got home and I woke up and I was like and I looked at myself and I kind of just was a faint green and I'm not sure why and I then I looked down at my buddy's all white couch and that was the answer and I felt physically and mentally terrible because of that cuz no matter how many times I tried to like flip the cushions that was not that was not happening I thought that was going to end completely differently I thought he was going to puke and it be all green well I no I thought you were just going to be like why the **** am I green oh no that would have been amazing too but yeah that that was that and then we got burritos from Albertos down coost of M it was amazing how's it my I I have two stories that spring to mind I have a defining hangover story from when I first got to college and I was in you know antlers like I always talk about right sporting group yada y y uh I was a freshman trying to make my name in the",
      "start": 2046.08
    },
    {
      "text": "have a defining hangover story from when I first got to college and I was in you know antlers like I always talk about right sporting group yada y y uh I was a freshman trying to make my name in the group uh when Mizzou basketball likes number four four that's the winner yeah there it is let Greg finish yeah we read about you on Twitter all the time cutting people off on this show you better knock it off you better knock it off uh so Mizzou in the olden days and still to this day I believe kicks off their like legit basketball season uh in the this Arch War thing with uh Illinois they go to they play basketball in St. Louis neutral ground play basketball have a big game or whatever and so students had to camp out to get their tickets or whatever you know line up to get their tickets and us the antlers are based around the fact that biggest sports fan at fans at Mizzou they're going to do it so a whole group went out and lined up and they were going to take shifts letting people in I wasn't",
      "start": 2089.36
    },
    {
      "text": "antlers are based around the fact that biggest sports fan at fans at Mizzou they're going to do it so a whole group went out and lined up and they were going to take shifts letting people in I wasn't even going to be in town I'd be back in Chicago for this game so I just went and lined up to hold spots with everybody else so it's me and like two really super senior antlers who I'm trying to impress and do well with and then one of their best friends who's there and a couple of their dudes and the best friend is sitting there he's like hey blue cuz I blue hair he's like hey Blue tonight we're finishing this bottle of Johnny I'm sorry uh Evan Williams the knockoff uh Jack Daniels we're going to finish this bottle of Evan Williams together and I'm like all right and I you know I mean I drank a bit here and there before but like this is like fullon like now I'm drinking for real in college like and I'm not drinking whiskey you know what I mean like this or whatever so me and him pass this",
      "start": 2134.52
    },
    {
      "text": "a bit here and there before but like this is like fullon like now I'm drinking for real in college like and I'm not drinking whiskey you know what I mean like this or whatever so me and him pass this bottle of Evan Williams back all night long and then at some point we're drunk obviously and so we're camped outside of the Hearn Center which is the basketball the old basketball stadium at Mizzou and we start walking around and eventually find an open door so wasted with this bottle of Evan Williams we go into the Hearn Center and like explore around going through all this he's showing me all this cool Mizzou stuff we eventually get back to where all the gymnastics stuff is where they practice and they have like the thing where you know you can pull Vault into it and land on the giant mat and do all these different things and the pom horse and he's doing pom horse stuff and I just ran out into the middle of the giant mat you land in or whatever when you do the pole vault jumped in the",
      "start": 2167.12
    },
    {
      "text": "and do all these different things and the pom horse and he's doing pom horse stuff and I just ran out into the middle of the giant mat you land in or whatever when you do the pole vault jumped in the middle of that and then was so exhausted and drunk that I lit literally couldn't get out of it and I there was like there was a brief real moment of like I'm going to die here cuz it's like I'm I'm flaming around the quicksand and I can't move even when you're not drunk that is horrifying right and So eventually I like army crawl out of it we go out there we drink more we sleep the night away out there with everybody else in the cold on you know concrete of Hearn Center you barely get any sleep I wake up and just like I'm this is like the first like legit super hangover I've had which would go be the first of many but pounding headache I'm dying and I go back to my dorm I change clothes and I go to class and I end up puking in three different toilets on the Mizzou campus none of them at",
      "start": 2204.76
    },
    {
      "text": "go be the first of many but pounding headache I'm dying and I go back to my dorm I change clothes and I go to class and I end up puking in three different toilets on the Mizzou campus none of them at my dorm though which I was always very impressed about but the worst being when I'm I missed like a French test or something so I had to go to that find that French TA or whatever take the test do all this stuff at his office but in the middle of test I'm like I have to go to the bathroom and I just went and he's I'm like is there a bathroom this he's like yeah the TA one's right here I'm like I just go in there and vomit all over this way then back out finish the French exam then go home and die there you go it was horrible David Ballard uh uh okay so mine is actually um okay well mine is is definitely the Uncharted 2 rap party uh uh but there's also I just I just remembered actually my friend's wedding where that's the problem when you I just thought of another one too there's so many",
      "start": 2241.12
    },
    {
      "text": "definitely the Uncharted 2 rap party uh uh but there's also I just I just remembered actually my friend's wedding where that's the problem when you I just thought of another one too there's so many you think of all right well I'll tell the Uncharted 2 okay so uh rap party for Uncharted 2 uh a video game a video game that that we worked on and uh it was my first like big rap party my first rap party and I was super excited and um this restaurant's no longer in in LA but off the marina it's got like beautiful view of the ocean and stuff and all the all the um boats and everything out there and uh so there's dinner and stuff and we're eating and then uh drinks started coming around and we're getting drunk and stuff there's like a band open bar of course is open bar right like every night dark part open bar and then uh and then at one point some guy one of my co-workers comes like dude have you have you been to the Vodka room yet like the the what the the Vodka room he's like yeah follow",
      "start": 2279.84
    },
    {
      "text": "part open bar and then uh and then at one point some guy one of my co-workers comes like dude have you have you been to the Vodka room yet like the the what the the Vodka room he's like yeah follow me and so he takes me and like we go to the back like I'm like we're in the kitchen what are we doing and like um they converted their walk-in freezer and like at some point they're like hey yeah we have all these bottles of vodka in here uh and they just come in and we'll pour you a shot of vodka so periodically throughout the rest of the night what would happen is is like slowly everybody would go and find like a friend like hey have you been to the Vodka room yet and then like you go and then like somebody else would come with you hey have you been to the Vodka room yet like I have well come with me anyways and so you go again and so was one at one point I like we're sitting there we're all like cheersing it and like this room is smaller than this room actually she's like it's like a",
      "start": 2323.8
    },
    {
      "text": "with me anyways and so you go again and so was one at one point I like we're sitting there we're all like cheersing it and like this room is smaller than this room actually she's like it's like a small walking you know I think they make rooms smaller than this room but so like they're uh uh we're all like packed in then we're all like cheers and I'm like there's like 30 people in like we've all been in here like five times like we're g to be so messed up tomorrow and then uh so you know the the Vodka room's kind of Infamous at Naughty Dog actually after that but um Everybody puke room real quick exactly so everybody like super Wast even the waitresses at this restaurant where just wasted everybody was wasted and I've got a a flight to catch at midnight I've got a red eye that night to go back home to Texas and I am wasted and uh for and I so I taxied to the to the restaurant and stored my luggage me and my exgirlfriend at time stored our luggage in a friend's car in the trunk and so then",
      "start": 2358.88
    },
    {
      "text": "home to Texas and I am wasted and uh for and I so I taxied to the to the restaurant and stored my luggage me and my exgirlfriend at time stored our luggage in a friend's car in the trunk and so then like 11 o'comes around like the airport's not too far like all right now I gotta go where's my friend and he had driven somebody who's too drunk took them home so all my luggage is in their car so I had to wait finally gets back there uh taxi drives like a bad out of hell to get us to the airport we still missed the flight so we had to sit there till 5:00 a.m. in the morning and then during that five 5 hour wait of of sitting there the alcohol like there a seat it's it's like yeah the poison spreads and The Fire Rises oh nailed it good show see you guys well I just wanted to make it to our first Bane reference see you later and uh anyway so finally like like I'm like right before right before the plane starts boarding and we're about to leave I'm like you know what I need to puke so I go",
      "start": 2395.64
    },
    {
      "text": "Bane reference see you later and uh anyway so finally like like I'm like right before right before the plane starts boarding and we're about to leave I'm like you know what I need to puke so I go so and I just empty it and that's when the that's when the headache comes the splitting headache and then we get on this plane and my girlfriend's time was puking as well like everywhere and so we get on this plane and uh and I had I sit in the middle seat CU I'm I'm the gentleman I let her have the uh the window seat I should have said **** that but no so she's got she's got the window seat I'm in this middle and there's some random guy next to me and and I'm like cramped like this my body wants to vomit the entire time if I had not vomited I would I would have done it all over that guy prob another girlfriend but like all over the guy and uh and I sat there for three and a half hours and just pure hell of like being tight and then I got a cramp in my leg I always get cramps in legs my",
      "start": 2445.48
    },
    {
      "text": "another girlfriend but like all over the guy and uh and I sat there for three and a half hours and just pure hell of like being tight and then I got a cramp in my leg I always get cramps in legs my flly and I was like I was I was it was the worst it was the worst hangover of my life I was the most miserable three and a half hours straight it was it was yeah it's like watching The Dark Knight Rises for you thank you col Colin before you start before you tell your story what's your favorite hangover food what do you got to have if you're hungover I I mean I love pizza yeah Pizza you go Pizza yeah if I get a burger that's the best oh you need like a like beef grease and stuff if I can take a quick as side one of my other worst hangovers was on spring break at Edisto Beach and that Piggly Wiggly sweatshirt I always wear and I PUK I I did all these shots because I wasn't getting drunk enough off beer fast enough I decided and so I passed out at midnight and then between midnight 9:00 a.m.",
      "start": 2483.12
    },
    {
      "text": "sweatshirt I always wear and I PUK I I did all these shots because I wasn't getting drunk enough off beer fast enough I decided and so I passed out at midnight and then between midnight 9:00 a.m. I puked like nine times I remember and I was just like the next day I I couldn't I was still puking when I woke up friends finally went to this awesome burger place on the like Beach in South Carolina one of two places in my life I've ever been that had freedom fries written on their menu but the burgers were phenomenal and I'll never forgetting I get I got that burger and put it down in front of me and almost broke down in tears cuz I was so terrified I was going to eat it and throw it up you were terrified you almost cry because of that I don't want to I was a good burger I disrespect it I I don't know which story to tell there's a great is there one quential story no okay there's a quintessential story about my first holiday party at IGN but I don't know if I but I don't know if I should",
      "start": 2524.32
    },
    {
      "text": "know which story to tell there's a great is there one quential story no okay there's a quintessential story about my first holiday party at IGN but I don't know if I but I don't know if I should tell that story or not mine just let you know mine is the recent holiday okay I was going and that is that you know the story so is that all right to tell you think yeah well I mean if you want I mean like spade for a spade or whatever like when he started talking about his I remember my real one was IGN holiday party as well that the holiday party where Hilary was making everyone do the shots that was the year before tell both I actually want to kind of really go back to that that friend's wedding story cool we're we'll do another round we'll do another round so the fir so the first one I'll tell is my first summer back home after colle like like you know when you're a freshman you go home and my good friend live you know I I was blessed to live on Street on Long Island where a few of my",
      "start": 2560.0
    },
    {
      "text": "tell is my first summer back home after colle like like you know when you're a freshman you go home and my good friend live you know I I was blessed to live on Street on Long Island where a few of my friends lived on the same street we grew up together and we went back home we haven't seen no one seen each other for a long time so we go to my friend's house his parents are gone for the night or whatever we end up getting like really really drunk and more and more people start coming to the house right like and you're like oh I haven't seen you in a long time let's have a shower you know blah blah blah long story short I I drink I drink we're getting **** up I pass out in the backyard next to his pool in the grass and then I fall asleep and then I wake up the next morning and his mom is like poking me MH yeah as like the sun's Rising be like Colin what are you doing and I'm like oh she's like what did you guys do last night there's beer like and then she and then I like like held she",
      "start": 2597.72
    },
    {
      "text": "poking me MH yeah as like the sun's Rising be like Colin what are you doing and I'm like oh she's like what did you guys do last night there's beer like and then she and then I like like held she I got up she's like a little lady I got up and like held on to her like this and I went into her house and passed out on their couch until like 4 in the afternoon so that was like my first blackout that amazing that is amazing so I passed out my good friend's backyard his mom woke me up the second story is my first IG and holiday party what year is this 2007 okay uh I'm 22 years old I was actually 23 at that point and I just turned 23 and uh that was when we did really big holiday yeah we had a really big holiday party that was when we wor with Myspace and all those guys it was a huge holiday party this is the media one or whatever the Indian food restaurant m m yeah with the two stories and stuff like that oh media is the cool black lady Tyler Per tell story yes it's true I like those movies",
      "start": 2635.48
    },
    {
      "text": "this is the media one or whatever the Indian food restaurant m m yeah with the two stories and stuff like that oh media is the cool black lady Tyler Per tell story yes it's true I like those movies so so I uh you know I go and I'm really excited right I'm fresh I'm six months out of college I have this great job I'm super super excited I'm with my friends with my buddies and with Greg everybody now a guy that we work with named Mark Nicks is getting you know drinking but keeps feeding me shots and pretending that he's doing them with me and I keep doing these shots and before I know it I I am **** bombed and I this is a point where everything kind of shuts off for me so I only know because Greg has pictures and and we have stories keep in mind that like I Colin and I had only had like the one story we told a million times about Denny's and like when did you get here like the summertime right July we hadn't hung out much but I you are D like you at some point you go outside to puke",
      "start": 2678.72
    },
    {
      "text": "the one story we told a million times about Denny's and like when did you get here like the summertime right July we hadn't hung out much but I you are D like you at some point you go outside to puke and when you came back in I am like **** Peter Parker and you I'm just like and you're just like a hysterics and Brun Big's like waving me away but I have like no sympathy yeah so I at some point I go to a bench like you know like where you walk into a door and you walk through another door so there's a bench there you know like as if you're as if you're you know you're like waiting to like get a table or something like that andine and I and I sit there down and I pass out and that's where the first you know group of pictures comes from but then I end up outside puking and then I end up laying on the ground outside of the restaurant on like the concrete sidewalk passed out this is when like there's pictures of me and Bfig you're taking pictures pictures of me and will Tuttle all these",
      "start": 2725.4
    },
    {
      "text": "on the ground outside of the restaurant on like the concrete sidewalk passed out this is when like there's pictures of me and Bfig you're taking pictures pictures of me and will Tuttle all these things so a guy that had just started working with us named Mike Thompson who doesn't work with us anymore he moved back yeah moved back to New York City he lived in the neighborhood put me over his shoulder and walked me to his apartment and then put me into his spare bedroom and then he went back out to party now when he came home I had somehow ended up in his bed I woke up at some point and ended up like going to the bathroom prob and then walking into into his room and going into his bed so he wakes me up and sends me back to the other bedroom and then I wake up like 8 or 9 in the morning and I'm like oh my god what the **** did I do you know and I'm like young and stupid I call Mark Ryan who was my boss at the time try to quit in shame like you know being like I know you're going to",
      "start": 2761.72
    },
    {
      "text": "I'm like oh my god what the **** did I do you know and I'm like young and stupid I call Mark Ryan who was my boss at the time try to quit in shame like you know being like I know you're going to fire me so I offer my resignation and he starts laughing he's like he's like he's like dude that's your story is not even the most embarrassing story of last night and I'm like and I'm like what I'm like what are you talking about he's like I'm not GNA say names but he's like someone couldn't get back into their apartment last night so they slept in the driveway of of another person's apartment until morning came so they can get back into their apartment he's like that's the worst story of of the holiday party and as I look back and like more and more on and I'm like it wasn't that big of a deal but I I I was **** mortified if you want to talk about like the most mortified I've ever been not only one of the most hungover points I've ever been one most that was the most mortifying hour",
      "start": 2801.92
    },
    {
      "text": "deal but I I I was **** mortified if you want to talk about like the most mort ified I've ever been not only one of the most hungover points I've ever been one most that was the most mortifying hour probably in my life when I woke up and I'm like oh my God like oh my God like what the **** did I do last night you know and then I tried to I like tried to resign because I was like like I was embarrassed and ashamed I was like I you guys are gonna fire me so I and everyone thought it was so funny when I I took that day off by the way I came back the office everyone was like that was the **** best oh no the IGN the IGN Christmas parties are Infamous for that and and and it's there there was one year I think it was the year after that we had it well I forget the name of the place but it was the place there was a two-story place where Hillary was actually doing that game where Hillary Golden was in the game where well this is a yeah this is the gold star game this is the gold star game",
      "start": 2840.76
    },
    {
      "text": "the place there was a two-story place where Hillary was actually doing that game where Hillary Golden was in the game where well this is a yeah this is the gold star game this is the gold star game that was 2010 I think no no 2009 I just remember uh and this is a resurrection of a classic IGN game that's like from like the founder days right where it was like Chris Carl doing that to like all the editors and Jeremy Dunham having like a million on him and so we finally psyched Hillary up to do it again for this holiday party it was one of the worst to was horrible and and at the end like you would get you would do a shot you get a gold star and then at the end whoever won that part was never actually worked out you don't know what you got you didn't get anything except for it turns out a wicked hangover maybe getting hit by something I believe Bramley is the one who won he's documented it many times that he puked in that stairwell out there he won but I I remember I didn't get",
      "start": 2879.08
    },
    {
      "text": "out a wicked hangover maybe getting hit by something I believe Bramley is the one who won he's documented it many times that he puked in that stairwell out there he won but I I remember I didn't get particularly drunk at that Christmas party I think I kind of had um that's right I think my wife had like left my then girlfriend at the time had left like on a long trip and I was missing her so I was a little depressed and uh I just remember sitting outside uh I think I was smoking a cigarette and I and and IGN employees one by one would start to walk out very slowly uh like Plants Versus Zombies and just almost get hit by cars and I would pull them back and I would hail a cab and I'd put it in and I'd like level up and then two of them would just kind of keep going back out and it would just be like I mean you know it was it was so funny and I made so many friends that day because like the next I think it was was like on Thursday or Friday and then everyone slept in and then Monday",
      "start": 2916.64
    },
    {
      "text": "just be like I mean you know it was it was so funny and I made so many friends that day because like the next I think it was was like on Thursday or Friday and then everyone slept in and then Monday people would come up to me like dude thank you so much for putting me in the cabin I'm like I don't know what you're talking about like I just remember like there was one I had to yell at a cab driver because they won't take you if you're too drunk but they're supposed to they can't they're not supposed to turn you away and I was like I we me and the guy that worked the place were like screaming at one dude to take this girl home from accounting and she was just like I'm so glad you did that cuz I was going to like I couldn't move yeah my like the wor literally the worst hanger I've ever had that I I blocked out of my memory is another similar it's it's a emerging of all these stories IGN party I think it was the it was the year after that one I believe where we went to what the the",
      "start": 2959.68
    },
    {
      "text": "had that I I blocked out of my memory is another similar it's it's a emerging of all these stories IGN party I think it was the it was the year after that one I believe where we went to what the the nightclub across the street yeah yeah whatever yeah yeah and then we all went to Kate O'Bran's afterward no that was the night that was this that was the star night or whatever because I have photos of me anyways we're getting inside track uh I went there and it's super embarrassing because it was like one of those like moments the next morning where Christine had to be like I'm not signing up for this this is not cool you know what I mean of like would it happen though if you this is another classic IGN Beyond story too I'm not making this up I believe it was a day that some Uncharted 2 News had come out and it was something where we destroyed it it happened in an instant and we had videos up and articles and conversations and all this awesome content up about it and then we had a podcast",
      "start": 2990.12
    },
    {
      "text": "come out and it was something where we destroyed it it happened in an instant and we had videos up and articles and conversations and all this awesome content up about it and then we had a podcast Beyond as well nailed it got it all up and so I was working pretty much right up until the party got it live left for the party got to the party super elated everyone's telling us how what a great job we did I check my phone or Twitter and some kids are like podcast Beyond is a Beastie Boy song and I was like God damn cuz there had been publishing problems and we had up I had to upload a bunch of tests to figure out what was wrong and one of the things I uploaded was and all it took was the Beastie voice but I call engineering they fix it while we're at the party so it was back to everything's great we destroyed it today today's one it was one of those like this is why we do this this is what we're all about this is awesome we did so well so I'm already drinking hard on top of that there was",
      "start": 3029.56
    },
    {
      "text": "we destroyed it today today's one it was one of those like this is why we do this this is what we're all about this is awesome we did so well so I'm already drinking hard on top of that there was an IGNer there who will remain nameless who got as **** up as I did who was drinking for the first time with us for in like ever no one had ever seen this person drink so we're I'm doing shots with this blah BL blah and literally the final memory I have of that party is Craig Baradon at the bar going Craigy no to do these shots of fette with me and then it's all just blackout I don't remember anything there is not one single solitary good next morning that started the night before with no one will do these shots for that's a Baradon and Nate special name oh that's Randy Last Theos special I just wake up and it's just paralyzing headache already the worst blind I try to sleep I usually it's one of those things if I wake up hung over I can go to the bathroom get some water come back sleep",
      "start": 3065.16
    },
    {
      "text": "just wake up and it's just paralyzing headache already the worst blind I try to sleep I usually it's one of those things if I wake up hung over I can go to the bathroom get some water come back sleep another 50 and it's better you know what I mean nothing is working here real quick what what what is fette exactly I I I had it for the first time last night it's sort of like oh you've had it in oil uh it is uh Pure Evil and it's an AER it's a digestive one right like one of those Apper dig yeah thank you that's it was delicious I like it said it it's like a Jager if you you've had Jager it's got simar a little bit there get up all I was with regu tierz and he was like oh you got you got have fette and I was like what's he like it's like San Francisco thing just San Francisco there's a fun music video you watch I didn't see nothing but like videos Billboards all around town so uh wake up blinding headache uh sleep it off doesn't work I'm going to make it to work like I'm I and",
      "start": 3105.44
    },
    {
      "text": "a fun music video you watch I didn't see nothing but like videos Billboards all around town so uh wake up blinding headache uh sleep it off doesn't work I'm going to make it to work like I'm I and Christine's leaving and I'm like I'll see you work she still worked she's like no you won't I'm like no I I'm coming in like could not start it could not get it up could not get going at all and So eventually I woke up and went to the like I limped out into my living room I had like a bar top and I put the computer on it and laid my head next to the computer and like checked emails like IM Amed everybody but and like Christine came back and she was like understandably mad and I'm like I'm sorry like I don't beon for that she's like do you remember anything afterwards I'm like no she's like you were like you were walking into parking meters you you we were going to walk the dog I was going to walk the dog for you and you're like no I'll do it so I took you out there and you were just getting",
      "start": 3145.72
    },
    {
      "text": "like you were walking into parking meters you you we were going to walk the dog I was going to walk the dog for you and you're like no I'll do it so I took you out there and you were just getting pulled you fell you hit the wall like and then eventually I went in the bathroom and at some point lost my balance and tear tore the towel rack off the wall yeah you got to do that and it was just one of those things she told me all this and I'm like this is not who I want to be to this girl like I don't want to be you know what I mean it's like told her like I'm sorry like you know I mean like I **** up I big guy to be stumbling around that's the thing right she's a little girl and like I'm just like some stupid bear that can't stand up yeah no good so going to me that holiday party you're just talking about Infamous I was you're the unnamed person right I was an intern at that point and I'm interning and then I'll never forget this it was the day of the holiday party and then Jessica",
      "start": 3180.28
    },
    {
      "text": "just talking about Infamous I was you're the unnamed person right I was an intern at that point and I'm interning and then I'll never forget this it was the day of the holiday party and then Jessica Chobot came in and was like Hey you're not invited to the the party I'm like cool and I didn't go she was messing with me she was just joking joking with me I didn't go that night because I thought I wasn't invited and I felt bad but no I was actually invited and then the next day she was like dude why weren't you there I was messing with you I'm like oh man and that's when I learned IGN just likes messing with people yeah Jessica Chobot likes messing that too yes but Jess was Master of that two days ago I punched Vince in the arm and then the next day me and Brian Altano flipped Brian Albert's desk so we still like messing with each other I just look over and I see Brian Altano and Greg just in Brian Albert's desk like liing his computer over he tweeted a photo of a burrito at us done that",
      "start": 3216.72
    },
    {
      "text": "desk so we still like messing with each other I just look over and I see Brian Altano and Greg just in Brian Albert's desk like liing his computer over he tweeted a photo of a burrito at us done that was hilarious and you what's funny about that is that had happened moments before I walked up I had no idea this was a thing I had no idea you guys doing that and what was the first thing I said to you this morning why don't you Haze this guy more oh yeah yeah yeah you're like I like why don't you guys give the associate more crap you're like dude you should have been here 5 seconds ago someone told me that like cuz when I started you know people did that **** when I was an intern back like way back in the day 10 years ago they really **** with me you know and they did they did with other they huh they used to Fran still gets mess Fort Fran was Notorious remember Fort Fran oh yeah uh so like when like I remember I sat next to Nick for a long time Nick is our database like our database",
      "start": 3257.24
    },
    {
      "text": "they huh they used to Fran still gets mess Fort Fran was Notorious remember Fort Fran oh yeah uh so like when like I remember I sat next to Nick for a long time Nick is our database like our database editor and I have a good report with him mention yeah he is he's been there forever and like I remember him saying well first you I said to Greg like no one **** with you right he yeah I started and there was one night like three months in where I was working super late with him on some embargo or Metal Gear thing or whatever that was going up crazy Japan time and I'm over his shoulder pointing at stuff like we're working in the D he finally just stops and turns me he's like why did why does nobody **** with you I'm like what do you mean he's like you started here and no one gives you **** we give everybody else **** I'm like oh I guess just because I fit in you know what I mean like for me IGN was a weird thing where I came in and was just like like fit perfectly with everybody it",
      "start": 3296.84
    },
    {
      "text": "we give everybody else **** I'm like oh I guess just because I fit in you know what I mean like for me IGN was a weird thing where I came in and was just like like fit perfectly with everybody it was like I I just got there and I was that that person already see it took me a while but then I got under these two Nick and Greg like I'm you guys'boys so no one will ever you did a really good you did a really like prison rules Lally smart thing when you inter for us the day you were done interning Tim wrote actually each individual letter was was actually handcrafted he typed up nice letters for all of us signed him saying thank you for all the stuff he'd learned and I was like that's a really that's a pro move he remembers that I know you remember that but that's awesome that meant something to me um by the way side note if Mark Nicks ever said why does anyone screw with you I would be terrified Mark Nick has Mark is the king of the long con he time we didn't know what it was for I'm",
      "start": 3334.0
    },
    {
      "text": "to me um by the way side note if Mark Nicks ever said why does anyone screw with you I would be terrified Mark Nick has Mark is the king of the long con he time we didn't know what it was for I'm pretty sure it still hasn't the joke the like the actual punch line hasn't happened yet we walked in remember we used had that cage in the old office I don't think you were there you didn't inter for old office no this cage equipment cage it was actually a physical cage one day we came in after Christmas break and there was a camera pointed at a box so good no one knows where the feed went to no one had the balls the balls to pick up and see what was underneath the Box we all knew that it had something to do with Fran and we did not know but I was like for the longest time and if and I and I I made it my life's like just my goal in life to not get on Mark Nicks's bad side ever terrified I don't I don't see I don't think it's like when I talk about like I'm not terrified and like he's gonna",
      "start": 3372.76
    },
    {
      "text": "made it my life's like just my goal in life to not get on Mark Nicks's bad side ever terrified I don't I don't see I don't think it's like when I talk about like I'm not terrified and like he's gonna kill me I'm like I don't want to be you want to be on the other end of on the other end of that bad guy I don't think I have a good enough one of my favorite Mark Nick stories was uh uh back when I lived out in Burling game like way the hell out there right you live in Burling game yeah I don't know s for a while oh cool we should well yeah we didn't know each other then no you didn't like me no you didn't like me you're loud um I was I'm so quiet now so active um I had a birthday party out there and a bun people were out there and we were eating and drinking and uh we were going to go back to my house and play Mario Kart on Wii because it had just come out I'm Mario Kart fan and uh Nick showed up with like 15 minutes to go in the birthday party like before we were said we were going to",
      "start": 3418.36
    },
    {
      "text": "to my house and play Mario Kart on Wii because it had just come out I'm Mario Kart fan and uh Nick showed up with like 15 minutes to go in the birthday party like before we were said we were going to break down and go somewhere else he shows up in this like flashy shiny blue shirt like collar that Nicks never wear I've never seen him wear it never wore it again never showed up 15 minutes I don't ordered a drink just was like oh hey sat down gave me a card was right next to us like all right now we're going to go play Mario and he's like great and then just never came so he drove all the way out there for like 15 minutes of sitting there I don't understand this guy because I've worked at IGN almost four years now and he's been there the whole time and me and him haven't really I haven't seen any of this in action but then I hear stories of this guy and I'm like you're a legend there was is legendary do you have the do you have the holiday story cuz I don't I can't get that right but",
      "start": 3455.4
    },
    {
      "text": "seen any of this in action but then I hear stories of this guy and I'm like you're a legend there was is legendary do you have the do you have the holiday story cuz I don't I can't get that right but which one the where he showed up in a limo no I don't remember that one I just I remember there was a six-month period where he didn't talk to anyone that was interesting yes and then there was there's an old story that this predates me but there's an old story that it was he didn't like another editor that worked at IGN and he grew out this big beard and apparently this editor couldn't grow a beard I had it was splotchy and always wore like the same thing and for Halloween one year no one knew why niy was growing the beard out for Halloween one year he came as the as the guy and and drove the editor almost to like sheer Madness I mean it was like threats of death threats and things like that because he had shaved blotches into his own beard and dressed exactly like the guy and it wasn't",
      "start": 3493.8
    },
    {
      "text": "editor almost to like sheer Madness I mean it was like threats of death threats and things like that because he had shaved blotches into his own beard and dressed exactly like the guy and it wasn't you never know with Mark Nicks whether it's coming from a place of good or just extraordinary like go and kill yourself right now when we went to go see Rambo in theaters remember we took the day off to go see Rambo he had done something similar where he was like growing out a beard and then he Rambo day we all go to the theater and show up and he shows up cut into a mustache and then he's dressed like Rambo so good but what's amazing is that if I did that I would want accolades I would want Colin to be like Scarpino good job Nix will show up you will laugh at him and he will not acknowledge it at all and then he'll just leave and you're like that was genius the story that I heard and like somebody needs to correct me if I'm wrong in this because it was before my time he showed up to a",
      "start": 3533.72
    },
    {
      "text": "it at all and then he'll just leave and you're like that was genius the story that I heard and like somebody needs to correct me if I'm wrong in this because it was before my time he showed up to a holiday party in a limo with girls like this sounds familiar with his armor there so many so many Legends and it walked and like Craig Baradon was outside smoking because he's still one of the cool kids and then Nick goes in for a second yeah it is looks awesome leaves gets back in the Libo and drives off doesn't even go to the only person that saw him was Craig yeah that was it it it was worth it for for Craig to see him he legendary in another Nick Legends this should just be all the all Mark Nick podcast and another legendary Nick Story when he was an intern there at IGN right that's how he started you know his history too eventually they had to come up to him and be like hey Mark why aren't you cashing your checks cuz I guess he was getting paychecks and not c ashing that he I've never",
      "start": 3579.28
    },
    {
      "text": "started you know his history too eventually they had to come up to him and be like hey Mark why aren't you cashing your checks cuz I guess he was getting paychecks and not cashing that he I've never talked to him about it but that is definitely a legend that was passed down to me I I would not be surprised if he was if he was a billionaire like if he had done if he secretly was doing something that was changing the world I would not be surprised at all what I love about you know I tell people this all the time is that I sat next to ni for years and we built like a really like pretty solid friendship with each other like a good relationship with each other and I love him because I know like ni is like very mysterious might not talk to you for a while whatever but he's always got your back you know yeah and like and that's what I I love that guy like I like get along with him so well we understand each other and he's huge PlayStation fan too he knows there's not many people I would",
      "start": 3622.92
    },
    {
      "text": "you know yeah and like and that's what I I love that guy like I like get along with him so well we understand each other and he's huge PlayStation fan too he knows there's not many people I would admit know more about PlayStation than me or you do he knows more about PlayStation though like he's like real real real into that **** it's one of those weird things like good knowledge Bas when we talk about IGN right you know people talk about like us or Naomi or who all these people who are on camera front facing or Mitch or somebody who's got a lot of by lines and stuff but like Nix is one of those people that is IGN you know what I mean like that place wouldn't be the same without him no he does like he does very thankless work so yeah and also our boss's boss Fran Mirabella or maybe you guys's boss my boss's boss friend Marabella we all like giving him **** because it's the best thing in the world Nick too easy so F the 12 days of Fran Miss there's videos that are still out there",
      "start": 3663.68
    },
    {
      "text": "guys's boss my boss's boss friend Marabella we all like giving him **** because it's the best thing in the world Nick too easy so F the 12 days of Fran Miss there's videos that are still out there for 12 days he pranked Fran in a way that I could never and I will never be the human being that I should be because of that but yeah videos of this of him just pranking friend my favorite one I mean for FR gets a lot Fort Fran gets a lot of kicks but my favorite is when he flew a kite over Fran while from at his desk with a fan Fran's on the phone fr's on his phone doing business and all of a sudden ni just stands up turns the fan and then gets a kite fr's like trying to work and talk on the phone the same time it's so good so brilliant so brilant poor FR is my favorite but so what is Fort Fran Colin I think it actually predates Us Fort Fran no it well it does it was in between my most definitely most defitely it was in between my it's a great story yeah it was we'll go and tell it it was",
      "start": 3698.48
    },
    {
      "text": "Colin I think it actually predates Us Fort Fran no it well it does it was in between my most definitely most defitely it was in between my it's a great story yeah it was we'll go and tell it it was in between my internship and uh when I started so I think it's like what would you say when did you start oh God I started in 05 so it must have been so you I think you were before me yeah I I was an intern 04 but it must have been somewhere in between when I left and went back to college when you started for France was do you ever see pictures of it or anything no I have never I just heard the story I thought it was genius so Fort Fran as I as I recall being told is like Nick's building like like a huge construction around Fran's desk and like it was a build like a building of and and he like of boxes cardboard boxes yeah and Hecate yeah like an intricate and he called it you know I think wrote on it like he had a there was a sign above it Fort Fran and like he built this whole like and",
      "start": 3746.4
    },
    {
      "text": "of boxes cardboard boxes yeah and Hecate yeah like an intricate and he called it you know I think wrote on it like he had a there was a sign above it Fort Fran and like he built this whole like and that's when we had huge you didn't ever go to the old office but the old office we had massive desks because even when we moved to the new office we had our old desk but they actually cut them down so he had like these huge desks and he built this whole huge construction around his desk and then like where he sat and like where his shelf was and stuff like that and it was this huge but there's a pictures of it and Fran being Fran didn't tear it down for years of course and you had to get in order to get to your desk you had to crawl like a lemur like just burrow down through all the things and come back up so that's why needless to say I never wanted to get on Mark next's bad side cuz the man is too he's too smart and he's too patient yeah he is and I loved I loved this year I had seen",
      "start": 3795.32
    },
    {
      "text": "and come back up so that's why needless to say I never wanted to get on Mark next's bad side cuz the man is too he's too smart and he's too patient yeah he is and I loved I loved this year I had seen anything out of him a while and then in the when we did the the um white elephant gift exchange whatever his present was a pillow that he got made yeah he got specially made with Fran's face on it what it Fran getting like blasted with like a Nerf gun or something he's like what's amazing about that is Darren Brazil who sits right next to me won that pillow yeah and now I get to look at it every day while Darren's gone on maternity the other one great remember is when just out of the blue it was coming up on Christmas but out of the blue Ryan Clement got a package and he opened it up and it was a porcelain statue of two like Greco Roman wrestlers naked wrestling one of them like hand on another the other guy's junk and they're like it's like mid suplex but like one's like all up on his",
      "start": 3830.56
    },
    {
      "text": "was a porcelain statue of two like Greco Roman wrestlers naked wrestling one of them like hand on another the other guy's junk and they're like it's like mid suplex but like one's like all up on his junk and there's no note no nothing and cl's opened it up and he's like what and it took a long time for us to figure out it was ni I think we all thought but finally Nick admitted it was him of course that's remember that one that's genius dude he's amazing M so before we wrap up uh ballot had one last story right the story of the engagement or the engagement party WD yeah yeah if we don't want to no no think it's good you're the guest get on the mic all right well uh this is a very embarrassing story okay all right um so I was at a a friend's uh wedding um two months ago in uh December diet be Charles in the bathroom good get it for me any uh make this quick um so my buddy was like hey uh listen the one the one thing I want I want from you for my for my wedding is I want stories and I'm",
      "start": 3872.84
    },
    {
      "text": "be Charles in the bathroom good get it for me any uh make this quick um so my buddy was like hey uh listen the one the one thing I want I want from you for my for my wedding is I want stories and I'm kind I've kind of got this kind of reputation of uh giving stories of you know yeah debar and shenanigans so um he's like I want stories I was like okay I'll get you stories and so at the wedding uh dinner the rehearsal dinner uh I was like okay how can I get this guy stories and I like looked down and St I was like okay I'm going to have one of every beer like that was like my thing right so I did I I was going one one for one with my buddy Micah and uh finally at the end of it like it's about 30 minutes before we're going to leave all of a sudden I'm like oh oh it's it's this is happening I got I I got to go puke so I was like I was like you know like dinner like excuse me I'll be right back and I'm like it's building I'm like I got to go I gota go and the bathroom is upstairs so get",
      "start": 3920.16
    },
    {
      "text": "I got I I got to go puke so I was like I was like you know like dinner like excuse me I'll be right back and I'm like it's building I'm like I got to go I gota go and the bathroom is upstairs so get upstairs I'm about to run up and I look up and here's this like old man with his little like three-year-old son like walking him down one step at a time down standing and I'm like oh no so I'm like s like hurry up hurry up hurry up hurry up and then they they they finally get down like third to the last step and I just can't hold anym I just go like like right over the kid like right past the adult like just all over the stairs and then K like the dad like picks his kid up and like runs him off and I'm like okay let's go I run up the stairs and like I get up and I'm about to push the door open I puke more and like onto the door I like push it open and I go in and I start like into a urinal and I'm like why am I supp the urinal so I turn around to the S I start puking in the sink I mean",
      "start": 3968.08
    },
    {
      "text": "I puke more and like onto the door I like push it open and I go in and I start like into a urinal and I'm like why am I supp the urinal so I turn around to the S I start puking in the sink I mean there's like there's like literally a trail and then like it's looks like a horror scene they'll never know it was me so then so my buddy my buddy Eric was getting married uh somebody saw all this kind of go down so he like runs up trying to figure you know you see what's going on and he walks he's like Ballard and I'm like I'm like I'm sorry dude and he like looks at he's like like assessing the situation he's like where's where's Micah and like you know bud he was going one one for one with me and all a sudden from the stall we hear I'm in I'm in here guys yeah my my story's not that bad for me it was it was the worst hangover I ever had was recently this year's holiday party we go and it was one of those things where we're like oh you know what I don't think anyone's going to go to this",
      "start": 4005.92
    },
    {
      "text": "me it was it was the worst hangover I ever had was recently this year's holiday party we go and it was one of those things where we're like oh you know what I don't think anyone's going to go to this year's I didn't go I didn't go either I didn't go either so nobody important went well so I I was like I was with Alexis I'm like yo yeah we're going to this thing and she's like hell yeah so we go to this thing and U there there was a couple people there you guys weren't there it was fun but I was there it was fun it was it was very fun it was it was very fun so all the uh the big guys the topnotch homies of the IGN's they're like yo you guys are cool and we're like yeah we're pretty cool yeah we're cool and so they just kept getting us drinks and me and Alexis are like we're stupid and we're young and we're dumb and young yeah not that young not that young anymore huh he's 24 get old son anyway bad news it was all bad news and we're just like stupid and loving it we're like hey you guys",
      "start": 4045.48
    },
    {
      "text": "young and we're dumb and young yeah not that young not that young anymore huh he's 24 get old son anyway bad news it was all bad news and we're just like stupid and loving it we're like hey you guys are talking to us so I drank way too much now let it be known I've never thrown up from drinking you used to not drink wow that's crazy yeah I used to there was a while where you were like Nick I'm I you know you're super cool I look up to you you're probably the coolest person I know you might be the coolest person on the planet maybe the universe but I'm never going to drink with you bro it was something like that but yeah it took a while anyway I drink I drink I don't drink often now but but when I do drink I do drink a lot and but that night I drank more than that and I was like oh man and I live far away from here so I had to take BART I had to get home and it was like from Bart to my house was like an hour walk uphill Jesus it was a struggle it was the biggest struggle of my life and",
      "start": 4095.8
    },
    {
      "text": "I live far away from here so I had to take BART I had to get home and it was like from Bart to my house was like an hour walk uphill Jesus it was a struggle it was the biggest struggle of my life and I'll never forget the next morning getting up and being like I want to call out so bad but it was like Game of the Year time and at IGN that's a big deal and I'm like I'm responsible for things I'm a big boy now and I got to go so I went to work I stumbled there and I had to stand in a room with Fran for hours screening videos pretending I was not about to die and it was it was the worst day of my life just staying there just like I'm good guys I'm good I'm good Tim by the way for those of you who don't know is he will he's the kind of guy that if he's bleeding out but you still need him to be there he won't say anything about it you know he's got a gut W I'll complain about it but I'll be there you've got a little bit more complaining like sometimes like that happens when you get be more",
      "start": 4138.36
    },
    {
      "text": "there he won't say anything about it you know he's got a gut W I'll complain about it but I'll be there you've got a little bit more complaining like sometimes like that happens when you get be more comfortable yeah like before I used to be like hey Tim can you do this for me and without question You'go do it and now you're like wait why yeah do I have to I can do that well because I learned you Nick I learned your games there's no games you sol your sometimes I just want you to go do that like the other day you literally were like this I was like hey can you grab me some uh clear plastic cups he's like we don't have any of those and then you just left and I was like I'm so confused by that statement I don't that is not true at all he said hey the clups you got aren't good enough I want ones with handles and I'm like okay so I instantly run back and then you no you went like this no you're wrong no I didn't say you're wrong I was like I don't I I'm pretty sure so I go I go back and I",
      "start": 4185.8
    },
    {
      "text": "With handles and I'm like okay so I instantly run back and then you no you went like this no you're wrong no I didn't say you're wrong I was like I don't I I'm pretty sure so I go I go back and I I was I confirmed that you were right I watched the video I was like oh Nick Nick is right you were gone for 20 minutes I knew you were going back and watching that video but before I did that I ran to the kitchen and I could not find the cups you're talking about so I ran and watched the video just to confirm and I was like oh crap he's right so then then I went around the office finding dirty cups with hand to go wash them and by the time I got back you already did that yeah yeah I love you Nick I'll do anything for you damn I'm feeling that real **** right there my topic is fast okay okay and Furious Fast no oh maybe depending on depending on how you go with it Steve Funkhouser good friend of mine on Twitter here asks the question he's at ronck designs for those of you who want to tweet on",
      "start": 4223.08
    },
    {
      "text": "Fast no oh maybe depending on depending on how you go with it Steve Funkhouser good friend of mine on Twitter here asks the question he's at ronck designs for those of you who want to tweet on him oh what's he design I don't know I haven't quite looked that up yet we're not we're not actually that close yet in my mind he designs sweet like prefabs like prefab homes prefab oh okay you know when they like like the Dutch designed these cool homes where you just like they're built off site and they come and they erect them and then they're just awesome I don't know if Steve does that or not um but his question is I of him like doing like you know like you you have a nice like Bush outside and he makes it look like a swan yes oh that's pretty cool Bush designers bu landscape artists I they're called uh designers Steve asks if you could punch a famous person in the face who would that be and why wow I don't want to punch anybody you don't you don't want to punch anyone no I don't like why",
      "start": 4264.6
    },
    {
      "text": "called uh designers Steve asks if you could punch a famous person in the face who would that be and why wow I don't want to punch anybody you don't you don't want to punch anyone no I don't like why would I want to punch anybody you wouldn't want to punch like Hogan just to see what would happen no he's already Cho me I already know what happens it hurts had a one up me on that one here we go mhm just in case you were curious I had a great video at E3 a few years ago with Hulk Hogan it was really funny it was awesome you know people were really into it and then Greg had to go and one up the video by doing a video that he thought was better and you know CRA resigned to go talk to Hulk Hogan again because clearly Colin couldn't get the job done just like most things around here and you know I had to go in there and be you know what I'm talking about you know what it's like am I in that bucket I'm just saying you get me you know what I'm talking about so we're cool but he can't do",
      "start": 4307.6
    },
    {
      "text": "know I had to go in there and be you know what I'm talking about you know what it's like am I in that bucket I'm just saying you get me you know what I'm talking about so we're cool but he can't do anything but I can do stuff I get stuff done whatever okay cool whatever I don't anybody what's your what's your answer who do you want I'm go Madonna I don't like Madonna like her something about her pisses me off punch just going to step up to her and try to her her face it was it was when she came out with that song with the clocks yeah I don't know four hang up hold up die of day it had a really annoying beat no no no it was it was a give me some give me some lyrics I I don't know the ly hung up I'm hung up on you I don't I don't know something like that but the beat was like is the one from Austin Powers no it was some maybe a James Bond thing no that was the day that was I liked that one that was cool that was cool the one she had after that at the VMAs they did a match up with the",
      "start": 4344.08
    },
    {
      "text": "Austin Powers no it was some maybe a James Bond thing no that was the day that was I liked that one that was cool that was cool the one she had after that at the VMAs they did a match up with the Gorillas I liked the Gorillas and I did not like her at all she needed to leave right that was her coming back and I remember her doing the interviews and I was pissed and I was like I want to punch you so that's my answer that's yours wow okay MH I'm not down with this hold on hold on keep it going we're going to probably we're get we're for this oh I'm wrong we're going to get F now mind you I don't think any none of us punch people in the face anymore yeah this is just a purely theoretical see I'm a total **** about it I don't want to do no I don't want to do it because I just don't like that cuz this is people want to punch me in the face all the time in the everyone wants to punch you in the face I'd you know what I'd probably punch you in the face I don't know why I'd like to see that",
      "start": 4394.52
    },
    {
      "text": "cuz this is people want to punch me in the face all the time in the everyone wants to punch you in the face I'd you know what I'd probably punch you in the face I don't know why I'd like to see that fight it would be awesome I'm sure it's coming you tear me apart here's why I am out of shape I got shoulder problems I got knee problems but you strike me as you here's how you I would say something to finally push you over the edge I would it probably you'd be I never I would never hate you you'd be fired up about something punch a wall I would throw something through a window but I Pro I would never hit another Well's good I've been Shadow Boxing out back lately have you mastered the move never mind anyways I think I'd push you over the edge finally with a little joke I was doing some little joke and then you'd come at me but you'd be coming from at me from a place of anger I so that's what a low place no you you'd have the center of gravity on me come up on him yeah I don't like it I",
      "start": 4440.36
    },
    {
      "text": "joke and then you'd come at me but you'd be coming from at me from a place of anger I so that's what a low place no you you'd have the center of gravity on me come up on him yeah I don't like it I get I get snippy sometimes with people but you know when to not well actually that's not true at all Greg has this this fun thing he does does where he knows you're pissed off and he just pushes that button over and over I don't I don't when you're pissed off and I know you're pissed off I quiet yeah or I try to alleviate it with a compliment today you were mad during Up At Noon so when you came out I pointed out to the audience how good you look this is a fine Ensemble yeah you do look good thank you you look really good today yeah thank you know you'd look a little bit better if you smoked I'm really atted to you right now I was I was noticing you looking at me today and I want you to know I was looking at YouTube is a Ballard a type of bird that's aard Mard there you go close enough it's",
      "start": 4473.32
    },
    {
      "text": "really atted to you right now I was I was noticing you looking at me today and I want you to know I was looking at YouTube is a Ballard a type of bird that's aard Mard there you go close enough it's a duck male duck Bard is there someone you would you would punch in the face David I'm still thinking Neil Degrassi Tyson I think for fun just Neil Degrassi Tyson just take him out you got to if you want to be the best you got to take down the best I uh Neil will kick my ass actually I think Neil Neil looks fry uh it looks like yeah you it seems like you know you look at Neil Degrassi Tyson you're like I can break this guy in half but it would be like one of those movie things where you hit him and he just goes he looks he just comes back pushes his hair back he's like he's unassuming right he's very unassuming but like I think Neil he's got that he's really fighting him he's I'm going to I'm going to pick Collins for him I'm just gonna see I'm just gonna throw it out there and you tell me if this I'm right or wrong okay",
      "start": 4513.72
    },
    {
      "text": "Neil he's got that he's really fighting him he's I'm going to I'm going to pick Collins for him I'm just gonna see I'm just gonna throw it out there and you tell me if this I'm right or wrong okay sh no no no no I have no beef with him I actually kind of like Greg's answer you have no boof with him I have no yeah it's oh oh dear um I I like Greg's answer in the sense that you know there's a lot of internet tough guys that are you know talk **** about us you know from time to time and well you know none of them ever do it in person cuz they're cowards but oh you're just throwing the gloves down but but the intent is there we talk about that all the time yeah I've said that a million times they're cowards the intent is there right and I've done a like Greg's talked about this before in the past like I've tried and I think I've done a really nice job taking Greg's lead of just cleaning it up in the sense of like you know I used to during Jets games be like Mark Sanchez you **** suck",
      "start": 4557.16
    },
    {
      "text": "past like I've tried and I think I've done a really nice job taking Greg's lead of just cleaning it up in the sense of like you know I used to during Jets games be like Mark Sanchez you **** suck you know I would tweet it like every week you suck you suck why you know but but like but like you know but like Mark Sanchez is just a dude yeah he gets paid a lot of money he deserves ridicule but do I really need to put that out there into the universe the story I always telling I know it's it's a for a lot of fans out there they've heard it right is that I was once watching an episode of The Office and this is not their final season the season before that and I turned to Chris I'm like this is terrible this is so bad and I whipped out the phone and started writing a tweet that was something along lines of NBC needs to take at The Office out back and shoot it and Christine's like yeah she saw me typee it and then she saw me start deleting she's like why are you deleting it like that's",
      "start": 4600.4
    },
    {
      "text": "along lines of NBC needs to take at The Office out back and shoot it and Christine's like yeah she saw me typee it and then she saw me start deleting she's like why are you deleting it like that's and I'm like this is exactly what people do to me we think because they're on TV that they don't have feelings they didn't try hard and yeah somebody tried really hard to make The Office that season and I didn't like it and maybe I'm right maybe I'm wrong you know Different Strokes yada y y that doesn't mean I have to be such a dick about it you know what I mean like some and that's what the same thing that always happens with us right where people talk **** on the internet and this is what we talked about on the right over here right is like I will tweet I'll do Twitter searches for my name and quotes cuz now everybody's too big of a coward to tweet at you right and say they don't like something about you because it's never constructive criticism it's just that you suck and then you find",
      "start": 4637.32
    },
    {
      "text": "quotes cuz now everybody's too big of a coward to tweet at you right and say they don't like something about you because it's never constructive criticism it's just that you suck and then you find that person I say something to them and they're nine times out of 10 their response is like I'm so sorry man I didn't know you'd ever see it oh my God blah blah blah you know what I mean like they don't get the fact that you're a normal person who lives with his girlfriend and his roommate and her his we're barely making it we got a dog and we're doing all this YouTube stuff on our own time for f you know what I mean like you don't think through those steps so even if I was going to sit here and be like I'd punch Bill Murray which I never would you know what I mean like is gonna see it one day and be like a I honestly I take that back Madonna Like I want to let you know that was 2004 Tim I'm a different man that was 10 years ago really what I want one day is like 10 episodes from now we're",
      "start": 4671.48
    },
    {
      "text": "and be like a I honestly I take that back Madonna Like I want to let you know that was 2004 Tim I'm a different man that was 10 years ago really what I want one day is like 10 episodes from now we're just in here and the door swings open Madonna comes in she like it's on no Ser seriously though I did come to a moment where I realized like me cuz I did really dislike her for a bit Yeah and then I I did come to a point I don't remember when it was when I was like she's not that bad and like now now what's she doing performing at the Grammys with who Macklemore Macklemore there you go you know what's funny about Macklemore Brian Stewart is it m is that what they call her no what M they call her Madonna I don't know they call her Madonna no she has a name Guy Richie's wife they still together no Guy Richie's ex-wife so so we're all basically gonna whuss out on this question it's not out about I'm not a mean person got an answer well no my answer is wussy out my answer is I'm way too nice of a person to air",
      "start": 4702.56
    },
    {
      "text": "so so we're all basically gonna whuss out on this question it's not out about I'm not a mean person got an answer well no my answer is wussy out my answer is I'm way too nice of a person to air punch anybody famous or not famous in the face I just no one should punch people all right I would I would punch Greg in the face to make for a video because I think that might be the first million view video on game Miller gets punched in the just in just knock just knock the **** out just right in that cherry pie of yours you know what I mean yeah yeah right in the peon pie no I wouldn't do it I wouldn't do it and here's why two reasons CU you're coward one I don't believe in violence Steve Funk Hower great question but I don't believe in violence two you have abnormal strength I've said this before so punching you would probably break every bone of my hand whoa that's legit actually yeah he's like a bear so I would be terrified that I'd hurt myself St kill Greg oh yeah yeah yeah you've",
      "start": 4743.52
    },
    {
      "text": "before so punching you would probably break every bone of my hand whoa that's legit actually yeah he's like a bear so I would be terrified that I'd hurt myself St kill Greg oh yeah yeah yeah you've already we've gone through this on a conversation with Colin this is the story from the other day when I jokingly punched Vince in the arm and everyone freaked out and I was like oh I guess it's harder than I thought I was like I couldn't believe that I was like that was like a real part that would have knocked me out what did you you you come back and just put all your weight in I said it was like 10 to 20% and I still think I still think that's correct in the amount of percentage you punch right through his **** body if that was 10% of your punch bre I know you like Superman but let's tone it down a little Vince said and Vince said it wasn't it wasn't it wasn't painful it was just shocking it was I was shocked I was standing right there I think it made a cool noise it hurt like it",
      "start": 4789.84
    },
    {
      "text": "tone it down a little Vince said and Vince said it wasn't it wasn't it wasn't painful it was just shocking it was I was shocked I was standing right there I think it made a cool noise it hurt like it sounded like it hurt I think I think Vince took like a **** man yeah well he he's a big man I like him Vince theal kid that would I would have probably cried if you hit me that AR now I've told you before before and we there's a conversation with KH about it so we won't go too deep into it but that I have a chance to just get you if I if the fight goes the right way you know I have a chance to get you and it's just it's just swinging I'm stronger than I look you knowy hockey player fight and stuff in you you know if I can get one of those swings in you know before you you can land it yeah yeah cuz I'm going to go for the ground I want the ground game on the ground here's my issue with it though yeah I think that because you two have known each other for so long there's so much between",
      "start": 4835.48
    },
    {
      "text": "yeah cuz I'm going to go for the ground I want the ground game on the ground here's my issue with it though yeah I think that because you two have known each other for so long there's so much between you so much tension maybe that you would both most of it's sexual most of it is sexual let's be honest you're two very good-look men that's why it's really weird say between them I know you can feel heat right it's like two magnet sucking together um they generate heat I don't know I don't know anything about science uh that I think you'd both be on pure adrenaline so Colin I don't know that you'd be able to like even if you put everything behind that and you landed at Square in the jaw Greg might just push right through that I'd be I'd be I'd be thinking Plan B plan B is the turtle cuz if because that Turtle because if that one punch doesn't work GRE if Greg I can easily if I do the Neil Duckman where you hit me and I go that's now called the ne dman ne dman I I picture Greg being like",
      "start": 4871.68
    },
    {
      "text": "that Turtle because if that one punch doesn't work GRE if Greg I can easily if I do the Neil Duckman where you hit me and I go that's now called the ne dman ne dman I I picture Greg being like you know like Jason or Freddy where it's like he walks just really slowly and deliberately and there's really nowhere you can go Michael Myers yeah like he's just very like like frustratingly slowly like you see in the movies like why are you going so slow you really want it just go get it you know but you know just running away but you can't really ever get away if you really want it then go get it right col Mor already right had no taxation all right awesome what do you two guys all right well you guys are all very nice people yeah so no one's getting punched in the face sorry great yeah so in the coming days the the Sochi Olympics begin in Russia in South Western Russia on the Black Sea yeah yeah and I'm curious what you think about so in 1980 you know anything about the 1980 Moscow Olympics",
      "start": 4913.12
    },
    {
      "text": "coming days the the Sochi Olympics begin in Russia in South Western Russia on the Black Sea yeah yeah and I'm curious what you think about so in 1980 you know anything about the 1980 Moscow Olympics by that's the one we won the hockey game that was in the lake plin mirac Clan ice yeah that yeah that was the miracon ice that was that year but in Moscow there was Olympics that year sure and but they were boycotted by a lot of countries because of the Soviet invasion of Afghanistan Carter boycott those or was that yeah it was yeah so it was right before Reagan got elected and I'm wondering so there's big controversy about the games this year because Russia has strict anti-homosexuality laws and it's creating a bit of a a rift or whatever with the International Community especially with the West because we have a much more uh accepting view of homosexuality Mo most people do United States you know has a lot of people that are anti-homosexual marriage and stuff like that but I genuine",
      "start": 4956.88
    },
    {
      "text": "West because we have a much more uh accepting view of homosexuality Mo most people do United States you know has a lot of people that are anti-homosexual marriage and stuff like that but I genuine accepting you know that you can be it's not illegal to be gay right and uh I'm wondering if you guys think that it would have been appropriate for the United States to boycott the Olympics based on Russia's treatment of homosexuals and let me give you an example you can't necessarily go to prison for being a homosexual in Russia right now but you get fined for it pretty significant fines newspaper writers are getting fined like thousands of dollars for writing pieces about homosexual activists for instance activist sorry real quick uh local press or the people who are over there for the Olympics the local Press thank you there's no way that they would do that to the well I mean you've seen the whole thing now about like how they're all live tweeting how terrible their hotels are and well",
      "start": 5009.4
    },
    {
      "text": "the local Press thank you there's no way that they would do that to the well I mean you've seen the whole thing now about like how they're all live tweeting how terrible their hotels are and well it's not it's not really shocking you know it's like anyways beside the point sorry so I'm curious if like you think that it would have been appropriate for us to boycott the Olympics based on that because I actually do um I think that the Olympics are are are supposed to be conducted in the spirit of like friendly competition between countries and we always win right because we just we have just we have and it's not because we're necessarily better at everything it's because we just have the most people doing the most **** we just put so many people into the well it's not even that we have more people it's just that we have we do everything there's like we don't skip any event like there's countries that won't do this or they won't do that you want curlers we got curlers yeah we we have",
      "start": 5053.72
    },
    {
      "text": "people it's just that we have we do everything there's like we don't skip any event like there's countries that won't do this or they won't do that you want curlers we got curlers yeah we we have like we have a great hockey we have great curlers we have Bob slers and skiers and snowboarders and ice skaters and figure skate you know like there's nothing we skip that's why we win I would say no and here's why because I think my my spirit like the spirit of America and the spirit of that winning spirit I want to go forward anywhere we can you know I want to spread the word of America anywhere we can I want our athletes the good people that are going to go compete for our country to be able to go and do that and win and bring pride and and show the world kind of what we're all about and I think that that's the way you overcome that sort of prejudice is by just basically steamrolling it you know um that and I love the **** out of curling I just want to watch as much of that as humanly",
      "start": 5087.8
    },
    {
      "text": "that that's the way you overcome that sort of prejudice is by just basically steamrolling it you know um that and I love the **** out of curling I just want to watch as much of that as humanly possible awesome is it it's awesome if I'm not actually kidding like it is an amazing an amazing is that the one with the brooms where it's like shuffle board but on ice but like with big big big stones and you kind of just kind of yeah they slide with them oh man it is talk about a finesse sport you know you wear like the bowling pants you go and you got the form as you let go of the thing it an Excell it's gorgeous that's gorgeous that's my answer okay I wish we would have I wish we could have but I think it's I mean we're to as a country we're to divided over that right if I was the president which I never would be allowed to be but if I was I'd be I would be a ballsy to or divisive President right where I would say I'm doing this and I'm the president because you elected me and this is",
      "start": 5130.12
    },
    {
      "text": "which I never would be allowed to be but if I was I'd be I would be a ballsy to or divisive President right where I would say I'm doing this and I'm the president because you elected me and this is what this is I'm setting the tone for our country and none of our political leaders do that it's all infighting and being stupid and so it would have been awesome but there's a large portion of the country that doesn't want to do that I would love to seen it open to a vote right but that's a pain in the ass obviously and costs thousands of billions of dollars and all this other horrible stuff but if I was in a place of power where I could have made that decision I would have said yes we boycott it and I and I would have said like I but I I want us to I'm I and I think we at this table and you know San Francisco and Yetta are in a different place than the rest of the country right I do think we're not more advanced that that sounds really bad when you say that but we're definitely further",
      "start": 5178.36
    },
    {
      "text": "know San Francisco and Yetta are in a different place than the rest of the country right I do think we're not more advanced that that sounds really bad when you say that but we're definitely further along in some timeline everyone will catch up to us eventually but like I totally you're saying we're better than everyone else no not you're saying we're decidedly more advanced human beings than the rest of the world F you Columbia Missouri I would I would say that in ter and this on this issue yeah I mean it's I mean I would love to seen us do that I would love to see us take us stand on more stuff like this you know what I mean like we're we how much of America do you think agrees with that though not I think it's I think like every other issue you know their issues 6040 or 40 60 or 5050 issues those they say that no matter the weakness of a president for instance right like the weakest of the weak presidents will never lose by more than 20 15 points I mean that never happens you know",
      "start": 5213.52
    },
    {
      "text": "those they say that no matter the weakness of a president for instance right like the weakest of the weak presidents will never lose by more than 20 15 points I mean that never happens you know when when Obama beat McCain by like six and a half or seven points that was considered a landslide Victor you know yeah and that's not like a a spread that means like 53 to 40 6 or 47 that's not like a spread of seven where it's it seems more significant than on both sides like it's small because there you there's like 40% of people are always going to vote Republican 40% they're always going to vote Democrat therefore if you go party line I'm a republican but I don't I I believe in gay marriage and gay rights and there are a lot of people like us but just assuming that's like 40% of the people that are always going to be against gay rights and there 40% that are always going to be for gay rights I yeah I mean I I like the idea of doing it too well tell me this like col uh I have a I have a",
      "start": 5251.88
    },
    {
      "text": "that are always going to be against gay rights and there 40% that are always going to be for gay rights I yeah I mean I I like the idea of doing it too well tell me this like col uh I have a I have a theory it's my personal uh thing is that uh had uh the Republicans and I think they kind of took a stance after this kind of realization after the election um if the Republicans are a little bit more Progressive socially they would they would just steal it in my opinion yeah they do hands down this what we're talking about with the conversation with Colin where he talks about changing Republican party right like Colin's Republican party I would back not across the board I would wait on issue by issue y y y candid by candidate but the majority of the time let's not spend more than we make let's not give away all our money let's not get in people business about God abortions and gay marriage and fine totally I'm on board with that platform that's a logical platform and this is one of the",
      "start": 5290.88
    },
    {
      "text": "not give away all our money let's not get in people business about God abortions and gay marriage and fine totally I'm on board with that platform that's a logical platform and this is one of the things that I always go back to that politics are illogical right like it just doesn't make sense everybody argues nothing gets done they're all a bunch of children and I have no faith in the system or them but if this was what we're talking about right if it was educated people making educated decisions compromising it'be a different story yeah I so um so my my answer to this this question is uh you know the Olympics are about uh competitive uh nature and and showing athletic capabilities and and progressing you know in that so that's actually I think very good and um if we were to remove uh ourselves from this competition for these reasons I we're obviously we're sending a message about that but we're also like taking away from you know a huge part you know so I like my initial thought was",
      "start": 5328.2
    },
    {
      "text": "from this competition for these reasons I we're obviously we're sending a message about that but we're also like taking away from you know a huge part you know so I like my initial thought was no like you know we're going to tell them what's up like no like we need to be more Progressive you guys need to be more Progressive you need to be more accepting um but at the same time I don't want you know you don't want to take away from you know people who uh especially you know um homosexual athletes who want to compete and who want to you know uh show pride and and like show hey look I am the best I think what we should do is actually uh train our athletes and also like give money to other countries to help train their athletes so it's be like the point being let's just **** beat the Russians like like everybody like I don't care what country but we make sure we beat Russia and every that also brings up another good point though because there's there are people from Russia competing",
      "start": 5369.6
    },
    {
      "text": "like like everybody like I don't care what country but we make sure we beat Russia and every that also brings up another good point though because there's there are people from Russia competing yeah and that kind of puts a little bit of a Dark Cloud on what they're doing right because and that would suck right if America came out and said something St like that which we never would there would never be a policy set like that and we would never be uh that that crazy about anything but um that's not true but uh it does suck because you want to go in the spirit of the spirit of the Olympics is that everyone comes together in this great grand pure Sport and you know no matter what the country is we all send people to compete and it's it's it's actually a really cool thing could have a bob slit team they can have a bob they did in Calgary in 1988 true um never saw that movie it's an amazing movie good movie what yeah Cool Runnings man excellent film don't like Olympics so I just did not",
      "start": 5411.72
    },
    {
      "text": "team they can have a bob they did in Calgary in 1988 true um never saw that movie it's an amazing movie good movie what yeah Cool Runnings man excellent film don't like Olympics so I just did not have any interest I don't either um so I mean it sucks right it sucks especially imagine put yourself in this place like Russia you're you're going You're competing for the first time and this is this is what everyone chooses to focus on and it's I mean people they train so hard in these events hard than anything I've ever done in my entire life hard people who spend their lives you know I mean American athletes who spent you know the last you know two decades getting ready to go to this and then we have to flip a switch and be like we're not going like that sucks for that I think it's horrible maybe that's who I let vote yeah I mean I'm getting like winded holding this dog it's like this is stressing all my biceps here like I can't imagine what the other one's going with yeah I mean I don't",
      "start": 5452.92
    },
    {
      "text": "that's who I let vote yeah I mean I'm getting like winded holding this dog it's like this is stressing all my biceps here like I can't imagine what the other one's going with yeah I mean I don't know I mean like I like the idea of do like standing together and be like this is wrong right yeah I agree with what I agree with what you're saying in the sense that these people train really hard we do have gay athletes we have people that don't agree with you you know the fact that we wouldn't go because of that policy Etc and so on my the main thing that troubles me is that we can't you know the IOC the International Olympic Committee like precludes you from being political at the Olympics right like you can't like if I won the Olympics I would want to like actually hold it don't shred on me flag not even an American flag that would be considered a a sign of a political sign even though it's not it's just our original flag and that that's like a loaded thing now what were we going to say I",
      "start": 5491.56
    },
    {
      "text": "not even an American flag that would be considered a a sign of a political sign even though it's not it's just our original flag and that that's like a loaded thing now what were we going to say I was going to say this kind of goes back to what I believe it was the German Olympics right where when the the black athletes won they did they did the black power yeah so so I mean that could be the thing here right as far as if you're winning especially if we can have homosexual athletes winning well I'd love for us to be like you know what go **** yourselves you know you know IOC and and like we have like you know when you like drape yourself in the flag like maybe you put the flag down have like you know a gay pride flag no what we do is make can you imagine how crazy the world how America would go no could you imagine if someone made the Gay Pride flag used in no that'd be amazing too parachute pants should come back back uh no take the American flag and just do it with the colors of",
      "start": 5527.6
    },
    {
      "text": "would go no could you imagine if someone made the Gay Pride flag used in no that'd be amazing too parachute pants should come back back uh no take the American flag and just do it with the colors of the gay of the rainbow for Gay Pride yeah I love it what are they going to do I mean like what is the do we fun most of their operation we have the most gold and silver and bronze medalists you know we we reg host like what are you going to do about it see that would be the thing for me is like Yeah by showing you by not going to it you're doing so much more as far as than just pulling out athletes you're pulling out I'm sure like coverage like why would anybody wa you know nobody in America's going to watch it and I have to imagine we're one of the biggest people watching this right like you get all excited for it I I love the Winter Olympics I love like I don't know if NBC wouldn't pull out but their numbers would drop there'd be all there'be turmoil just a based on the amount of money",
      "start": 5562.04
    },
    {
      "text": "get all excited for it. I I love the Winter Olympics. I love like I don't know if NBC wouldn't pull out but their numbers would drop, there'd be all there'd be turmoil just based on the amount of money. It would be such a great way to make a statement that we don't take this but of course we can't make that statement in our own country so why try. Yeah it's true. I just you know like things aren't going well in SOI like you hear everything that's going well. I was reading a piece in the AP today about how like no one is going like like there are no foreigners there at all like out like I I was really surprised to read that like there were people saying like there's no one here. Michael Rosenbaum's going. Yeah Rosenbaum's going to see hockey and I wish I can do that too but like I don't like like we go to this place and it's like don't you know don't act like you're an American don't wear any American you know like you don't want it's like what the **** is going on here like this is it's an",
      "start": 5601.8
    },
    {
      "text": "we go to this place and it's like don't you know don't act like you're an American don't wear any American you know like you don't want it's like what the **** is going on here like this is it's an embarrassment like like their whole operation over there is **** embarrassing yeah and it's like Bush League **** like we should we should have just got the Olympics you know like like we murdered it when we get when we get the Winter Olympics or the Summer Olympics and so I I just feel like it's going to fall apart anyway and SOI is going to be looked back upon as like this embarrassment for Putin which is awesome he's an **** but like you know I I still feel like there's something to be said about these archaic things that are going on hurting people yeah we have like anti-gay marriage laws in some states and stuff but it's not illegal illegal to be gay and when they say things to us and they say things to gay athletes and they said this which is you're welcome here as long as you",
      "start": 5635.28
    },
    {
      "text": "laws in some states and stuff but it's not illegal illegal to be gay and when they say things to us and they say things to gay athletes and they said this which is you're welcome here as long as you leave the kids alone that's what they **** said multiple times and it's like what does that mean what the **** does that mean you know like isn't that weird that you would say something like that everyone's like all right well let's go play hockey you know so I agree I hope I hope we draw Russia the United States hockey team they will **** murder that team you know and mean we can take pride in that kind of thing about beating those teams but again it's against you know maybe the Russian athletes don't agree with it either and so like it becomes this whole you know a lot of those Russian hockey players play in the United States and live here yeah you know so it's like it's that's what's so funny about hockey specifically is that every one of those players plays in the NHL and they're",
      "start": 5670.08
    },
    {
      "text": "hockey players play in the United States and live here yeah you know so it's like it's that's what's so funny about hockey specifically is that every one of those players plays in the NHL and they're just going over to Russia to play for their their home country then they all live here for the rest of their lives but nonetheless you know I I think it's a complicated issue yeah indeed Tim close out this episode of the GameOverGreggy Show what was Nick's punching in the face oh okay yeah I like that my went fast yeah the pure one's gone downhill no him he's drunk he's taking swings at the I'm going to go with what words don't you like oo and I'm not I'm not talking you know racist words or like bad bad words booger I like the word booger there we go it's a gross word yeah snot I like that word wait you like it that's not the you call it a little snot it's messed up I don't think there's a word in the English language I don't like really well everything has its place of course not the",
      "start": 5709.24
    },
    {
      "text": "word wait you like it that's not the you call it a little snot it's messed up I don't think there's a word in the English language I don't like really well everything has its place of course not the not the ones that are a little more taboo or racist I don't particularly care to use any of those but I think a good booger joke yeah Greg I'm not like gross I'm like a lot of a lot of people don't like the word moist yeah I was going to say I was word I was going to Mo I say at the show all the time cuz it **** freaks her out moist I'm like it's the air is very moist today when you say it like that it's disgusting you should have heard that in my ears it was say it's you guys don't hear what I hear it's moist that just kind of almost knocked Portillo off my lap you know what I'm talking about see I I don't like the words I don't like the words ointment ointment you don't like wait minut or frog frog frog bothers me but with what is wrong with frog both of those words are the only words",
      "start": 5757.88
    },
    {
      "text": "see I I don't like the words I don't like the words ointment ointment you don't like wait minut or frog frog frog bothers me but with what is wrong with frog both of those words are the only words you can call those things like a frog a to that little **** a frog yeah not the same thing like a frog looks like a frog you know yeah but I don't like how they look they bother me awesome drink some more bourbon real quick what about moist is it is it the what it stands for what it the meaning behind it or it just the way S A lot of it has to do with the a specific connotation of the word so women don't like that they don't like think going on that there is no word I like for a woman's nether regions really none they're all Horrible no I'll give you that yeah horrible I don't think but there's some of the meaner ones that like we're not even going to talk about cuz those are bad but even vagin is conversome and scientific I don't like that and then like there's one that's like I've heard",
      "start": 5800.72
    },
    {
      "text": "some of the meaner ones that like we're not even going to talk about cuz those are bad but even vagin is conversome and scientific I don't like that and then like there's one that's like I've heard some middle ground on because some people are like oh it's totally cool and I'm like no that's not cool and there's some people that are whatever an S okay yeah what what you guys think about that no I don't like that word that word that n that word's no good s yeah it was a movie to oh I see I'm not going to go from that but not so that's not okay right yeah I don't think so neither the S one is like kind of also kind of kind of a there a couple s ones one yeah I guess kind of a derogatory well it's like the there yeah like a lot of them have that negative like vagina is not not like actually I don't have a problem with like vagina at all exactly it's clinical conation that we have sorry continue horny is another one that I just think stupid it sounds childish it's 80s so it's like well",
      "start": 5852.36
    },
    {
      "text": "I don't have a problem with like vagina at all exactly it's clinical conation that we have sorry continue horny is another one that I just think stupid it sounds childish it's 80s so it's like well I'm sexually aroused like no that doesn't work either yeah let me ask you this do you this is this is prying feel free not to go too far into this but like do you ever make reference of that to your significant other and if so does it feel awkward like do you ever talk when you when you start getting into the more dirty talk when I'm eating wings out there is that how is that how you talk about it he's rubbing he rubbing barbecue sauce on his nipples and eat some of those honey wings some honey barbecue wings I don't do I don't know what the hell I'm talking about anymore uh no Tim I like the word frog and I'll tell you why because without the word frog you wouldn't have the word frog man and frog man is badass I don't even know what you're talking Frogman is the original Navy SEAL that's",
      "start": 5894.4
    },
    {
      "text": "word frog and I'll tell you why because without the word frog you wouldn't have the word frog man and frog man is badass I don't even know what you're talking Frogman is the original Navy SEAL that's what they used to call Navy Seals before they had the word Navy SEAL back in the day and I think we're talking World War II. They when the dive when diving became a thing scientifically possible they would have these rebreathers and and guys would go and they specifically had develop longer fins and longer breathing bigger breathing apparatus they could dive in and syn synchronized swim up to a boat bomb it get out they were called frog men because they look like frogs so how'they go from frog to seals and why wouldn't they go to stands is an acronym for what oh this is going be good one uh like should know it's all the things they do it's like uh explo is it explosives I don't know I'll look it up look it up it's an acronym I know that cuz when they spell it they spell like s e little a",
      "start": 5938.2
    },
    {
      "text": "should know it's all the things they do it's like uh explo is it explosives I don't know I'll look it up look it up it's an acronym I know that cuz when they spell it they spell like s e little a something that thanks to Family Ties I know scuba self-contained underwater brething a great episode awesome that's a great episode so yeah so I love I love and there used to be a GI Joe toy called the Frog man the Frog man he was a gr he he wore a gray wet suit with a red chest piece with a Cobra logo on it he came with flippers and like a Harpoon Gun he was the bomb yeah he was awesome I know exactly what you're talking about I just read about I I read all about this because I I'm just fascinated by Navy Seals I watch a lot of different documentaries about them they there was a great C A in land it means there it is see air in land so SEAL excuse me so the C AirLand see so yeah they're badasses but they used to be called Frogman that was before they had there was a while where they",
      "start": 5982.56
    },
    {
      "text": "C A in land it means there it is see air in land so SEAL excuse me so the C AirLand see so yeah they're badasses but they used to be called Frogman that was before they had there was a while where they didn't even you know they didn't tell you that Navy Seals were real so this is blowing my mind right now yeah so there's a show on Nickelodeon in the 90s called Navy Seals no it's called and Michael Bean great film oh man this is so bad I did like that movie Kablam it was called Kablam yeah and there was a short in it where there was action figures and one was super strong and super naked and one was a meltman meltman was his name and he was one of those frog guys but he was melted he was one of the GI Joe frog dudes I'm I'm trying to bring up a picture of him so Frogman was was bad they said about Frogman and it was a joke and everyone laughed and I didn't get it because I was Dumb and little but now wow this makes so much sense but he was melted meltman yeah yeah one of the uh one of the",
      "start": 6023.32
    },
    {
      "text": "Frogman and it was a joke and everyone laughed and I didn't get it because I was Dumb and little but now wow this makes so much sense but he was melted meltman yeah yeah one of the uh one of the reasons why we have waterproof watches was because of because of bro frog no Frogman they they needed something to time their uh Maneuvers together so they needed to be precise so that you know they'd go if they were bombing a ship or something they know when the hell to swim away and so that's why we have a lot of Technology from them what do you guys feel about HOA haha another dumb one for the it just sounds dumb yeah it is dumb I don't really know I'll tell you I'm I'm actually probably the worst of talking dirty to anyone because I would use that word and it would just kill the mood wait wait who we're even talking to dirty though this is just talking how do you talk I'm going to come I'm going to go over there and touch your ho no do you think it's something because I mean does penis",
      "start": 6067.24
    },
    {
      "text": "who we're even talking to dirty though this is just talking how do you talk I'm going to come I'm going to go over there and touch your ho no do you think it's something because I mean does penis sound better to us just cuz we've grown up with penises and deal with that life words for that that are okay and is just funny the more innocent one weener it still sounds weird to say schlong schlong dong even dick I feel like dick is the easy way to go like that's not nasty and that's not like super scientific how do you what you word do you use to refer to it women yes when you're talking to women wait wait to women to my own thing it's a wiener I got a wiener say hey I would like you to engage in some sort of activity with my wiener that's what you say how do you approach women I don't I don't know how to do it no one ever taught me this I'm really awkward when it comes to dirty talk I mostly just kind of like you know move like an amoeba you know I kind of come up on him and then just",
      "start": 6107.68
    },
    {
      "text": "know how to do it no one ever taught me this I'm really awkward when it comes to dirty talk I mostly just kind of like you know move like an amo eba you know I kind of come up on him and then just what is what is amoeba sex like it's really organic it's sort of like uh that Matt Dillon movie The Blob back in the day I don't know if you ever saw a remake of the or it was a remake of that one I just try to work that into every conversation okay there's so many awesome GI Jo's that's what he's looking okay I like what's doing over there any other words yeah so actually I don't it's not really a word as it is an ending of a word okay needle dirigible flaf that the at the end of words that like it bothers me when B your mouth well B saying it and then like whenever I hear it it just doesn't like I just but I love the word dirigible the derable word d spectacle I like spectacle testicle another scientific one these are all good words I like all these words it's that oh at the end Colin while",
      "start": 6147.28
    },
    {
      "text": "I just but I love the word dirigible the derable word d spectacle I like spectacle testicle another scientific one these are all good words I like all these words it's that oh at the end Colin while you're going down that hole right now who was your favorite GI Joe character quick oh man Firefly whoa no W Channing Tatum who played in the movie did not like GI Joe really okay yeah I hated GI Joe because it ruined transform Flint in the movie Flint yeah he was we're looking at picture who you thinking of oh yeah that's him that's one of the Frogman yeah cool great how you didn't like GI Joe that's Storm Shadow incred anytime there was a guy thinking from Storm Shadow it was but any Snake Eyes Storm Shadow or Snake Eyes Snake Eyes was a badass gu that's so trite though man you know that that's TR everyone loves Snake Eyes and Storm Shadow because Storm Shadow was the best dude he was the he was he was the bad guy you loved to love you know what I mean mhm what's B show Y no one liked Flint",
      "start": 6196.48
    },
    {
      "text": "TR everyone loves Snake Eyes and Storm Shadow because Storm Shadow was the best dude he was the he was he was the bad guy you loved to love you know what I mean mhm what's B show Y no one liked Flint no one liked Hawkeye Hawk excuse me General Hawk General Hawk No One liked those guys I can't believe you wait so Greg you didn't like GI Joe when you were a kid that's unbelievable to me I was **** obsessed with GI Joe for years army stuff never did it for me it wasn't even the Army because it's so **** campy and weird like like you ever you you remember GI Joe the movie like the C the intro to that when they're when they're fighting around the Statue of Liberty is like one of the **** coolest things when I was a kid ever I was obsessed with that and I remember saying when I saw the GI Joe movie the first one which was you know the new one which is **** terrible uh yeah they made made two of those bad boys I remember I saw with Hillary and I was like wouldn't it have been funnier",
      "start": 6257.2
    },
    {
      "text": "Joe movie the first one which was you know the new one which is **** terrible uh yeah they made made two of those bad boys I remember I saw with Hillary and I was like wouldn't it have been funnier and cooler if they just if they just accepted what GI Joe was which was kind of like outrageous and recreated that scene with like like CG and real you know the thing I'm talking about do you know what I'm talking about Greg I'll have to show you this this is like an this is like very famous like 80s cartoon intro like where the GI Jo's are fighting Cobra like on and around the Statue of Liberty it's like it's like **** so good and I was like wouldn't that have been awesome if they just open the movie with that with like the Joe's fighting cobra in New York City like and like just realistic serious tweet that at whoever's directing the third one cuz I'm sure they need some help right now but like GI Joe was just so good like so colorful and so amazing the good guys were cool the bad",
      "start": 6299.56
    },
    {
      "text": "serious tweet that at whoever's directing the third one cuz I'm sure they need some help right now but like GI Joe was just so good like so colorful and so amazing the good guys were cool the bad guys were cool but Firefly was my dude and and that was and I really got that from my brother Firefly was the was Cobra's explosives expert yeah he he dressed like a ninja and like gray like gray and black I don't know if I remember Firefly hold on let me look him up yeah that's that I I just remember that he wasn't as cool as Snake Eyes and I remember he didn't come with much he came with like a briefcase like with his explosives and like a pistol I thought firef was one of the dreadnots No No not a dreadn is is anybody else here like an expert in how GI Joe's like can be like how with the rubber band Center yeah what are youing CH figures back in the day used to be held together by a rubber band through their core and a rubber band would eventually dry out and snap so youd playing with them",
      "start": 6337.08
    },
    {
      "text": "band Center yeah what are youing CH figures back in the day used to be held together by a rubber band through their core and a rubber band would eventually dry out and snap so youd playing with them and they'd snap and it would hit your hand and then they come yeah you'd have a dude in two pieces and so every kid every kid when he was when you were a kid if you had GI Jo's Master art Spiderman these two of going back in and you'd wrap around these little hooks that held it all together you'd like Loop it through and wrap it wrap it wrap it wrap it wrap it and then you'd stretch and wrap that final one and boom you had a brand new toy you could twist their torsos yeah a lot too and then that way yeah you could buy like the replacement ones I a little known fact about me is that Greg knows this a little bit is like I'm a huge GI Joe nerd and I have like 300 and something GI Jo's I have like like from 1982 to 1994 like about about 3 00 of them and I was collecting them like into college",
      "start": 6378.4
    },
    {
      "text": "this a little bit is like I'm a huge GI Joe nerd and I have like 300 and something GI Jo's I have like like from 1982 to 1994 like about about 30 0 of them and I was collecting them like into college like I'd go back on eBay every once in a while and be like I'm missing this dude from the 1984 collection yeah I have them in we're definitely playing with those I have I have my Long Island I should bring I should bring them back here every time I go home I go through them oh yeah yeah yeah wow what an obscure character to love is that no that's a newer one yeah let me see let me look back we don't have to do this on the air but all right any other War people hate was it this guy no you got you got nothing else man find him David Ballard thanks for joining us thank you for having me it's our pleasure we love you guys are amazing you should move up on the show come back come back soon yeah Okay ladies and gentlemen this has been another episode of the GameOverGreggy Show thank you so",
      "start": 6416.6
    },
    {
      "text": "pleasure we love you guys are amazing you should move up on the show come back come back soon yeah Okay ladies and gentlemen this has been another episode of the GameOverGreggy Show thank you so much for listening and or watching Remember once a week four sometimes five best friends get in a room and go through random topics then Friday we post the highquality MP3 on gameovergreggy.bandcamp.com for $1 then Monday you can get the whole episode as a video for free on youtube.com/gameovergreggy gameovergreggy.com for short it's been a pleasure serving you tonight until next time keep on drinking bourbon oh yeah and go follow Polite San Diego on Twitter then make sure you go to see Eric Caster at Polite Provisions 46 96 30th Street in San Diego let us know what your favorite GI Jo's are in the comments below like subscribe share what what don't you like about this I don't remember him at all he looks awesome I don't remember Destro another bad remember you're like 20 years older than",
      "start": 6457.68
    },
    {
      "text": "the comments below like subscribe share what what don't you like about this I don't remember him at all he looks awesome I don't remember Destro another bad remember you're like 20 years older than Colin prob different GI Jo I had them all even that's so my my brother's 11 years older than me and I inherited his GI Jo's when I was younger from like 82 to 86 and then I started collecting them 87 888 and we put our collections together remember the 82 gios had straight arms they didn't their arms didn't curb like this and so those are actually really valuable really I only remember the ones I had just everything was kind of twistable yeah yeah that only started happening in 1983 points of articulation Greg were you trying to close it out I think we totally closed it out and then it just kept goinging is better than GI Joe goodby Ghostbusters is better than Transformers and GI Joe see you bye",
      "start": 6505.68
    }
  ]
}
