{
  "id": 215,
  "video_id": "CJ8f5Wa0DLo",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Michael Rosenbaum"
  ],
  "title": "Michael Rosenbaum (Special Guest) - The GameOverGreggy Show Ep. 9",
  "description": "Smallville's Lex Luthor -- Michael Rosenbaum -- comes to the show to discuss the sexiest comic book characters, movies, and Nick's beard. \n\nSUBSCRIBE/LIKE/SHARE/BUY T-SHIRTS: http://www.districtlines.com/gameovergreggy\n\nEach and every Monday, Greg, Colin, Nick, and Tim get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nBuy the MP3 version of the show on Band Camp: http://gameovergreggy.bandcamp.com\n\nMerchandise available for you body: http://www.districtlines.com/gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\nNick - http://www.twitter.com/nick_scarpino\nTim - http://www.twitter.com/timgettys",
  "published_at": 1391436004,
  "duration": 6768,
  "transcript_chunks": [
    {
      "text": "[ Music] what's up everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, Nick Scarpino . Hey everyone. Hey, how are you? Thanks for watching. Yeah, thanks for being the pure one. Tim Gettys, Tim host, the pride of Long Island, Colum Mor Arti, go Islanders. And for the first time ever, a guest, Michael Rosenbaum. There he is, actor, actor extraordinaire, Back in the Day, out right now, select theaters, go get it on iTunes. Also, Smallville, Lex Luther on Smallville, remember that was kind of fun? What happened? No big deal. Oh, you're putting on my shirt. Oh yeah, you're wearing your Superman shirt, nerd. Actually, nerd, I'm wearing a Super Boy shirt. What's the difference? I guess they'll just give a job to anybody in the DC Universe . You go to prison for wearing one of them. Uh, Michael Rosenbaum, you're here on the GameOverGreggy Show, our first guest of all time. You're in town, of course, you came up to do Up at Noon. You're pretty promoting this Back in the Day film. Yes, sir, people.",
      "start": 0.78
    },
    {
      "text": "Michael Rosenbaum, you're here on the GameOverGreggy Show, our first guest of all time. You're in town, of course, you came up to do Up at Noon. You're pretty promoting this Back in the Day film. Yes, sir, people. People can go buy it right now. It's a comedy. It's a low-budget comedy. Low budget, let me tell you something. Wait, now let's go back to when you say low budget because we're used to internet terms here. Well, people, we're used to these kind of walls. Low budget, that real? Oh my God, M fall on Greg by Fall. I thought that was real stone there. Like thought it was castania. You laugh until one of them falls on our head. That's all right. That would be, that's comedy. We want that . It kind of be like in Smallville when the Fortress of Solitude collapsed on you and we thought you were dead, but then there were all the clones and then you came back at the end of the, oh yeah, that's just bad writing. We got to get rid of Rosenbaum. How we going to do ? Have **** fallowing him? We'll figure it out. Back so back in the",
      "start": 47.24
    },
    {
      "text": "the clones and then you came back at the end of the, oh yeah, that's just bad writing. We got to get rid of Rosenbaum. How we going to do? Have **** fallowing him? We'll figure it out. Back so back in the day, right, right. Back in the day when I say low budget, let me tell you something. I didn't mean low budget. These studio movies are made guys for $50 million, right? This movie was made as a passion project . It was made pretty much in my backyard where I grew up in Indiana for under a million bucks. Bunch of my friends dragged them all out from LA and it was like a big party pretty much and we shot this. Yeah, so you wrote, you wrote and directed this movie and starting it and starting it. Well , that was that too ego trip that for you is easy. We can see that. That's just like, you know, you just kind of get on camera and that's easy, right? But the writing and directing part of it. So you had this idea, so walk us through this a little bit. I don't want to get too much into the, you know, I wrote it years ago.",
      "start": 93.6
    },
    {
      "text": "on camera and that's easy, right? But the writing and directing part of it. So you had this idea, so walk us through this a little bit. I don't want to get too much into the, you know, I wrote it years ago and the true story is I was going to direct another film, this movie called Sorry is for Sissies and I was in Pittsburgh, Pennsylvania and SW son and my buddy John Heer and Colin Hanks and a bunch of guys, Seth, we're all going to go and film this movie in in uh Pittsburgh and then two weeks into prep, this is independent movies, oh watch the movie, you'll learn how to do that. They just said uh pre says we lost the money, we lost half the money. So I went into a, you know, fit, not a fit, but I was just emotionally a mess because I don't like to let people down was on my watch and I was getting all these friends and they kind of dropped the ball ball. So we tried to get the money, tried to figure that it was just too much to get that much money. MH. So my my DP, Bradley ston Cipher who shot the movie Hit",
      "start": 131.04
    },
    {
      "text": "friends and they kind of dropped the ball ball. So we tried to get the money, tried to figure that it was just too much to get that much money. MH. So my my DP, Bradley ston Cipher who shot the movie Hit and Run with Bradley Cooper that I did, I don't know if you saw that one sounds familiar. Which one? Hit and Run. Hit and Run was Bradley Cooper and Dak Shepard, Kristen B. Oh, D sheer, no thank you. How dare you? My buddies, I'm **** around. Did you ever see Limitless ? Oh, Bradley Cooper was good in that. Yeah, I like that. I didn't see that, but I will good. There's drugs and stuff involved. Bradley, so there you go. Yeah, and then anyway, so I my DP goes, didn't you ever write something that we could shoot like in your hometown of Indiana? And I swear to God, he legitimately said those words. He said those words as we're smoking a cigarette and I'm like and I go yes and I as much as I was trying to still Salvage that film, I knew it was hard to get three million a couple million dollars. Sure. So I I had this",
      "start": 178.0
    },
    {
      "text": "as we're smoking a cigarette and I'm like and I go yes and I as much as I was trying to still Salvage that film, I knew it was hard to get three million a couple million dollars. Sure. So I I had this script that I'd written years years ago and I gave it to the producer of Hit and Run who was a friend of mine and I go Kim what do you think of that? She goes I love it let's make it I go what and honestly I put some of my money into it and she got an investor and we were we changed directions and in two months I was prepping the movie in Indiana I mean unbelievable think about that I mean we were ready to film one movie it gets just we lose all the funding and then we switch gears I get money for another one that's 1/4 the budget and we go to Indiana where I grew up and I'm shooting in front of my hometown the small town in Indiana it it was insane Town what town in Indiana is it I grew up in a small town called Newberg, Indiana right next to Evansville, Indiana now if you've read anything in",
      "start": 219.0
    },
    {
      "text": "my hometown the small town in Indiana it it was insane Town what town in Indiana is it I grew up in a small town called Newberg, Indiana right next to Evansville, Indiana now if you've read anything in the news it might say things like number eight in most depressed cities in the country number two I was G to say when I news it's well I talked to you about this before but it was just like I'm not going to go back home and make fun of I actually love where I grew up I I think it's beautiful and I wanted to show people that so you know I just got a crew and we got some funny actors like Nick Schwartzen Harle, William funny Marina B yeah the cast of it's awesome yeah they got the Old Spice Guy I Mustafa who's really funny who you asked to gain weight well I have a friend tush your career away hey those cool ABS that you spent all that time that's true I I I never really thought about that but we were sitting in a restaurant in in LA and I go would you gain some weight for this he goes yeah",
      "start": 259.48
    },
    {
      "text": "those cool ABS that you spent all that time that's true I I I never really thought about that but we were sitting in a restaurant in in LA and I go would you gain some weight for this he goes yeah man sure would you wear glasses okay but go tea sure because my friend Matt Taylor te who I grew up with I wanted him to look a little more like him because you couldn't have the Old Spice guy sitting Indiana yeah he just didn't belong no one's that ripped anywhere it's kind of like a goal in my in life for me now to have someone ask me to gain weight to do something can you gain some weight I'll for this show I'd like you to gain weight for this show i'like you also to start smoking again for this show I will not start smoking again for you I don't care how cool you were you a smoker SM you smoking do you smoke no I don't but I learned half of my life's like Journeys Tim learn how to use I learned half of my life's journey I don't Journey many places he he took me places smoke bre joury we",
      "start": 305.8
    },
    {
      "text": "do you smoke no I don't but I learned half of my life's like Journeys Tim learn how to use I learned half of my life's journey I don't Journey many places he he took me places smoke bre joury we used to go we used to go on smoke breaks and those would be the times that I would pull Tim started with us at IGN as an intern and so he would pull me a little wet behind the ears he'd come in and i'I'd take him outside we'd smoke we'd talk about life you know it's where he used learn things like condoms proper lubrication use how to get a raise you were learning all this from him from him yeah what's the best rubber you can get out there in the market whatever Nick gives me I don't actually give him the rub it's like an allowance yeah all right you've done good work today go have some fun tonight yeah so which actually made me we were talking about Greg's cancer earlier so I always feel like the biggest heal now it's time cue the music the sad music so here's Greg going through",
      "start": 348.88
    },
    {
      "text": "fun tonight yeah so which actually made me we were talking about Greg's cancer earlier so I always feel like the biggest heal now it's time cue the music the sad music so here's Greg going through chemotherapy and I'm being there to console him with like my 15th camel light of the day and I was like Greg you're looking good you're doing you're doing well you're doing well Greg did he really do that no no actually smoke a lot he smoke L A Lot do you miss it oh I miss it all time every time I I smoke intermittently you know when someone has a cigarette I go can I have one of those it's not the you're a social smoker yeah social my okay it's not great when both grandmas died of empyema I mean probably not something I should partake in yeah it's not I don't think you know it's not good for anyone don't smoke but um it's occasionally or if you can just do it every once in a while and not don't have a dick to personality don't do it by the way I'm a little intimidated that there's someone",
      "start": 390.12
    },
    {
      "text": "don't smoke but um it's occasionally or if you can just do it every once in a while and not don't have a dick to personality don't do it by the way I'm a little intimidated that there's someone with on the show now that has a better beard than me cuz my beard has a following on Twitter you're clean you're clean this is really messy look at this it's good though Mitch can we zoom in oh there's no one there right we hit the camera and come walk over here Zoom that would be cool oh Christ there's a million dollar app right there if you're joining us for the first time ladies and gentlemen the game over gregy show the concept is simple four best friends now five get together every week each brings one topic of conversation to the table then we talk about it for your leure Jesus do that no you do that it'll be good we don't you're an Islander fan again we don't have anyone to turn the cam zoom in on the camera no one's editing this piece of garbage whatever happens between now and the time",
      "start": 429.36
    },
    {
      "text": "do that it'll be good we don't you're an Islander fan again we don't have anyone to turn the cam zoom in on the camera no one's editing this piece of garbage whatever happens between now and the time to sign off it's over all right good uh if you want to download the show of course what happens is on Friday it goes up as a high quality MP3 on Band Camp for a dollar but then on Monday we post the video version on YouTube for free so enjoy it however you want to enjoy it just stop just stop complaining about it yeah stop complaining about it that's yeah yeah that's good by the way uh just a quick down cuz Michael Michael Michael told me you know was insinuating you know the Islanders fandom and stuff like that and I wanted to start the show with it to kind of bust his balls a little bit uh he's a big hockey fan I didn't know I didn't know this about about Michael yeah and uh so I I asked him you know you know I grew up playing hockey and loving hockey and all that stuff and he did too",
      "start": 474.52
    },
    {
      "text": "he's a big hockey fan I didn't know I didn't know this about about Michael yeah and uh so I I asked him you know you know I grew up playing hockey and loving hockey and all that stuff and he did too so I was I asked him you know oh what what's your team and I expected you know you live down south now right in C right yeah but you you're from like you know so I was like oh maybe he's a King's fan May duck fan or something Sports we will edit this part in sport yeah Sports isn't too high but he was I'm like Al and he's like I'm a Rangers you know Rangers I was like yeah I was like and he walks out with an Islander Jersey cuz I was born in New York even though I grew up in Indiana I still had the the sports come from the north for the most part but yeah you walk out with an funny I it was funny I like that you jump you being a Rangers Fan jumped to like actual Rivals of the Rangers yeah I was like oh he either Devils or flyers and it was the Islanders the island as much because they suck",
      "start": 518.96
    },
    {
      "text": "I like that you jump you being a Rangers Fan jumped to like actual Rivals of the Rangers yeah I was like oh he either Devils or flyers and it was the Islanders the island as much because they suck he just said like the annoying little brother who's got a grudge with you and you have no grudge with him you're like it's a very one-sided thing when I I went home for a wedding last weekend so I me and my dad went to the old barn uh to see the the Islanders play the blues was random match up and uh you know you've been Islanders games before and they do the if you know the Rangers suck chant you know if you're happy and you know it but they do like the whole crowd does it and that was like the highlight of my day because the Islanders were losing they look **** terrible but you hear the organ like start the music and you're like all right here we go here we go and and the whole reason we came seeing the Billy Joel Banner yeah at least we don't have to hear 1940 anymore **** fans all",
      "start": 555.88
    },
    {
      "text": "like start the music and you're like all right here we go here we go and and the whole reason we came seeing the Billy Joel Banner yeah at least we don't have to hear 1940 anymore **** fans all right even if you're not a sports fan whenever the Rangers played cuz they hadn't won a cup since 1940 so for the next 53 years these **** and everybody ran the leag would go 1940 19 and it was just brutal to hear that as as a ranger fan finally won the cup in 94 94 they bought half the Edington Oilers and they won the Stanley Cup and then and that's not true hardly but then yes so then we were like we didn't you know the Islanders were terrible and then we had to make this the the if you know the Rangers suck chant and that was that's all we have now yeah four staning cups from before I was born that we always talk about and that's it they Haven want to want they wanton a playoff series since I was eight years old so that's and they won't till you 80 anyway let's talk about things the the",
      "start": 595.12
    },
    {
      "text": "that we always talk about and that's it they Haven want to want they wanton a playoff series since I was eight years old so that's and they won't till you 80 anyway let's talk about things the the fans the Canadian fans appreciated that I was going to say we watch the the drop off on that one we have a lot of Canadian fans that's right all right who wants to go first to the topic I do definitely let's go sexiest comic book characters sexiest comic book characters of all time I can answer got that one track you want take this one one track com character Lex Luther man **** the nice freaking suits just with the lives in castles got a nice slick shiny so which one are we going you're going with the you're going not with the so we're going there's lots of Lex Luthers here well I'm not a as big of a nerd as you that's the whole thing you know I am though with when it comes to horror mov and things like that figure you know even post crisis will'll go if we just go with that generation",
      "start": 640.88
    },
    {
      "text": "big of a nerd as you that's the whole thing you know I am though with when it comes to horror mov and things like that figure you know even post crisis will'll go if we just go with that generation right there there was fat Lex right then he faked his own death and they saved his brain and put it in a sexy Australian with flowing red hair ter then that all fell out and then he went to being regular Lex where he was in charge he was a president for a while like yourself in in the series continuity how you looked down looked **** good that's where we're going that one all right that's the one there you go power sexy I'll give you that power well you know there's nothing sexier than power cuz powder was sexy too I was going to say I was going to say were you upset when you lost out on that role when you went out to be powder oh I didn't audition for you son of a **** you could have been easily you know those that it's funny cuz when I was L she'd hear some of those things it's like",
      "start": 685.24
    },
    {
      "text": "role when you went out to be powder oh I didn't audition for you son of a **** you could have been easily you know those that it's funny cuz when I was L she'd hear some of those things it's like Hey look it's powder that's all you got I just walked down I was like oh great I got seven more years of this coming to me is that what happened they sign you for a seven-year deal is that yeah it's like a six-year deal I think it's a six year and then I ended up signing up for one more year after that so they so they they you're like you knew you were auditioning for Lex obviously there was yes but I said No at first cuz I thought it was going to be this caricature and they were going to like you know the twirling of the mustache and and I was like more of a jeck it's the WB when they made anything that it's really good so that was that was honest saying good I'm saying with real substance and then I talk to some of the producers and I found out that this was the real deal that they cared",
      "start": 722.44
    },
    {
      "text": "that it's really good so that was that was honest saying good I'm saying with real substance and then I talk to some of the producers and I found out that this was the real deal that they cared about this they wanted this it was something that was very well that was always that was one of the things that Drew me to it right was that Lex at first he's he's in he's I'm helping I'm trying to do what you do to me I'm trying to help I just s of stuff I'm just going to be a pretty face it is the power of Christ who compels you it is he who compels you Maron from The Exorcist go ahead uh next question no that's that's what I like that's what I think that the that's why Smallville was so good right because Lex wasn't just that onedimensional character and I don't know whether that was you ringing probably not it was mostly the writers I would imagine but everything none of it was me but they had that that that friend ofy Vibe the whole time it was a friends and enemies and you didn't know",
      "start": 762.2
    },
    {
      "text": "probably not it was mostly the writers I would imagine but everything none of it was me but they had that that that friend of y Vibe the whole time it was a friends and enemies and you didn't know what was going on it's added a great dimension of that show I mean the story before the story how cool was that when these two used to be friends yeah and what breaks their friendship up ultimately it's really cool that's a great story right there it really is and I thought it could have been wrapped up in six or seven years four so they say to you they say now if you take out the Witch season you're pretty much there you know what I mean that's when we really got off track but it was you know but there was some of those Seasons like sh uh season 3 when I was starting to go crazy the episode shattered do you remember when I when he hit he gets hit by the car and I look at him I'm like what the fu did you just do so there were some episodes where it was like these little moments that you know",
      "start": 808.12
    },
    {
      "text": "do you remember when I when he hit he gets hit by the car and I look at him I'm like what the fu did you just do so there were some episodes where it was like these little moments that you know of course he loses his memory and every episode and did he ever have a security team at the Mansion yeah they weren't good and then he could never figure out how Clark got past them was like at super speed yeah I always went to the bar for a drink another drink I can't figure out why my security sucks did they was there ever talk of them using a prosthetic for the head instead of having to shave it no but you know I started thinking about that I was like man I wish I brought that one up but you know what the final episode season 10 I wore a piece it looked shitty no I don't think it look **** did you think it looked shitty it was obvious well I I was upset as a fan it was 10 years spoil a Spanish man would say yo I have a huge head already okay I have a you have a big head it's beautiful so",
      "start": 846.96
    },
    {
      "text": "you think it looked shitty it was obvious well I I was upset as a fan it was 10 years spoil a Spanish man would say yo I have a huge head already okay I have a you have a big head it's beautiful so imagine now you add a few inches and now I have this cone head I'm like Dan arroy that's awesome so but I wasn't going to shave my head for one episode you I came in for one day I go you got me for a day let's do this you say yeah dedication to the show that made your career hang on Snapper John MD let me tell you something I a lot of people say some people look all the F most of the fans are cool I'm just giving you a hard time but a lot of some fans not a lot some fans he left the show like did I did I Really Leave the show cuz I thought I did six years that was my contract then I think I signed up for another year yeah so did I Really Leave the show was I supposed to do wasn't I a little old to be playing this character at this point wasn't Tom a little bit too old I just felt like this",
      "start": 890.64
    },
    {
      "text": "up for another year yeah so did I Really Leave the show was I supposed to do wasn't I a little old to be playing this character at this point wasn't Tom a little bit too old I just felt like this was the time let's wrap it up nicely and then they went on for three years I didn't know that would happen I was gonna say do you if you had known it was going to be 10 would you have suck it out three more years no no no no no no they asked me to come back for uh two years but I I really look a lot of people don't know this but I you know I started out in comedy and that's what I wanted to do in fact when I got the role of Lex Luther my friends were all making fun of me I remember walking out into my house and my friend had Lex Luther action figure shoved up his ass Jesus you awesome friend he goes hey look I'm Lex Luther I'm Lex Luther and I'm like was it Adam Sandler was Adam Sandler and it was like it was just trying my friends I've known for a long time they try to keep me down or not",
      "start": 937.08
    },
    {
      "text": "goes hey look I'm Lex Luther I'm Lex Luther and I'm like was it Adam Sandler was Adam Sandler and it was like it was just trying my friends I've known for a long time they try to keep me down or not they need to but they they were just saying hey screw you I know this is a big time for you but they were just saying hey we're your buddies don't get you know and so where was I with that story what's in this whiskey everything it's a really strong really strong whiskey no uh you were talking about the 10 season so you were would you stuck no no I just was I mean for me that that was it and you know I I felt like uh I wanted to go do comedy I want to go direct my own movie I wanted to write I wanted to do other things and explore and by the way when you're away in Vancouver shaving your head for seven years you're not available now in La auditions for the most part and on top of that you're forgotten about he's not available so imagine seven years you're bald you're not available for",
      "start": 976.76
    },
    {
      "text": "for seven years you're not available now in La auditions for the most part and on top of that you're forgotten about he's not available so imagine seven years you're bald you're not available for anything unless you wear a wig and sorority boys I wear this horrible wig and a few other movies and I was like I'm not going to do that anymore so then you have to come back and take General meetings with all these cast directors and say hey I'm Michael Rosenbaum I'm back remember me or your or their new casting directors that never so you had to sell yourself all again it's like coming out to LA again so I knew I had to lay groundwork to get started again and like and really build relationships which I've done and and now it's been fantastic but it was it was certainly it was a transition but um the great thing is Greg baman who's the executive producer who we've written so much stuff together he produced executive he also wrote licens the drive back in the 80s he directed most of the great",
      "start": 1020.8
    },
    {
      "text": "the great thing is Greg baman who's the executive producer who we've written so much stuff together he produced executive he also wrote licens the drive back in the 80s he directed most of the great episodes of Smallville he directs the Spielberg series called if you want to borrow my Smallville complete series there's a whole bunch of great behind the scenes stuff with beatman yeah it's unsigned I won't sign it wait what's Spiel what Spielberg spiel Series right now in Canada boom blocks no that's a video game he did anyway what do you mean what's the series is he's doing a series a series series and so anyway Greg works on that and so Greg once came up to me and said you know what the good thing about this oh turn no no I need you to go **** yourself done with this topic jeez no no no no what I'm saying is what I'm saying is no I know I love you it's a lot of love it's all lot of love ice cube I have an ice cube so you want one I want an ice cube thought we were I thought we were",
      "start": 1058.24
    },
    {
      "text": "no what I'm saying is what I'm saying is no I know I love you it's a lot of love it's all lot of love ice cube I have an ice cube so you want one I want an ice cube thought we were I thought we were offing ice cubes no but uh Greg said you know what's great is you're the only character that when you grow your hair out you're going to look completely different everybody else is going to look the same that's kind of cool right cuz you have now it was and look like it was it was I don't think how could I ever play a better character than that that is probably one of the most iconic characters you could play and I got the player for seven years I just felt like that was enough 160 episodes but I I loved every minute of it new is I love a lot of it you're you're a phenomenal director you you look younger than I do which is not saying much well maybe when I shave but you look young you still got your hair which is great so you got I think you got a good career ahead are you hitting on me I",
      "start": 1100.2
    },
    {
      "text": "younger than I do which is not saying much well maybe when I shave but you look young you still got your hair which is great so you got I think you got a good career ahead are you hitting on me I might be if you feel something under the table see it's my hand I have but I can see both of your hands it wasn't stroke you know what thank I'm thank you very much for saying that but you know there are people who think like for instance my stepmom who's Filipino M and I love Filipinos uh but she's like well you know you're 41 you are single you know are you gay what are you doing with your life are you going to have a family and then I just straight forward like that oh my God watch my fart movie yeah wait I was uh on a badass TV show for like seven years so everyone can go after themselves yeah that was pretty cool you know that's what I always say no matter what if I never worked again if that was the only thing I ever did I think people get caught up in like the perception of what",
      "start": 1143.72
    },
    {
      "text": "yeah that was pretty cool you know that's what I always say no matter what if I never worked again if that was the only thing I ever did I think people get caught up in like the perception of what everybody else thinks like look everybody I should be what has he done lately what is he what the **** have you done lately the reality is the reality is this is us this Empire let me ask you something yeah the reality do you love doing this of that's it that's that's You've Won you've won the fact that I did that I was that role that that's enough isn't that enough if I never did anything else it's more you're not other shows whatever but you're a part of a Canon now you're a part of a bigger thing the DC Universe you guys are actually I don't know if Smallville is considered official it's got to be I mean what do you mean yeah but it's amazing and it was a phenomenal show there are some other shows that they've made that are around superhero characters that I'm not a huge fan of but that",
      "start": 1187.04
    },
    {
      "text": "to be I mean what do you mean yeah but it's amazing and it was a phenomenal show there are some other shows that they've made that are around superhero characters that I'm not a huge fan of but that one was one that everyone loved it you watch it you're going to love it but but I had no idea I swear to God I had no idea the impact it was huge I didn't know those people out there the fans yeah what an impact they'd have on my life in every way I I just I thought okay I'm going to play this character and I just didn't realize how many fans I guess I grew up with not a lot of instant gratification not typing on and saying how many people are following so and so Twitter I I didn't know I didn't really follow comic books I was following I was reading Fangoria magazines and watching horror movies but I didn't know that being on the show there's millions and millions of Superman fans yeah oh yeah and it's extraordinary then all I'm doing the voice of The Flash I was telling you in the car",
      "start": 1227.52
    },
    {
      "text": "but I didn't know that being on the show there's millions and millions of Superman fans yeah oh yeah and it's extraordinary then all I'm doing the voice of The Flash I was telling you in the car and the cab here the the Justice League it's like people going you're the voice of The Flash I'm like it's amazing I'm shocked by it it's awesome that was one of the things that blew my mind too I I knew that and then Greg brought it up again and I was like oh my God cuz I just went back and watched this is embarrassing not really f it I I just went back and watched all the Justice Leagues cuz they're on Netflix I haven't even seen them all since I recorded them 90% of them I've never seen the coolest part about the is that he gets all the good dialogue CU oh yeah he he fun that's what always was fun about that character people like what's the best part of playing flash and it really was that everybody's so serious and Batman's like Batman's like and I'm like n come on it's not that bad come",
      "start": 1271.52
    },
    {
      "text": "fun about that character people like what's the best part of playing flash and it really was that everybody's so serious and Batman's like Batman's like and I'm like n come on it's not that bad come on guys seriously and it was like vibrate through it was that kind of fun love viting I stole that whole conversation was yours I stole that whole thing but it was a treat it was a treat to do those things and have you know and not to get sappy but like when you find out the impact the show had on people's lives like soldiers when they're in Iraq and they come back and go that show save I'm like well stop it that show saved you come on I can't they're like that this is what we used to watch it took our mind off the war took our mind and I just I I tear up I didn't know what to say and it was just like the people you affect and that's what it really makes you appreciate you you don't realize the impact I mean you get paid you hit your mark you do this and then you realize and that that's",
      "start": 1309.52
    },
    {
      "text": "just like the people you affect and that's what it really makes you appreciate you you don't realize the impact I mean you get paid you hit your mark you do this and then you realize and that that's the best part about it really that you know for me anyway and the paycheck's pretty good the paycheck I'm not going to lie final security for the rest of your life is amazing not for the rest of your life I didn't get Tom Welling money oh jeez I mean look you mean t well who be can we call him T well yeah I do it all timeing bee Wellington I like that one until he shows up to stop me I'll call whatever the **** I want sorry Tim to get back to your original I'm going to go with I'm going to go I'm not ready for that yet you're not ready for that I I didn't get a chance on upo because we ran out of time to get all sappy Smallville and I've said it before on this show or these these shows here on game of mreg which I'm sure you haven't watched the best live action interpretation of Superman",
      "start": 1353.64
    },
    {
      "text": "of time to get all sappy Smallville and I've said it before on this show or these these shows here on game of mreg which I'm sure you haven't watched the best live action interpretation of Superman ever in my lifetime ever period end of story Smallville really a lot of **** episodes don't get me wrong but I mean like when you're talking about like I know oh I mean like I don't I mean I don't even think that's a knock right like you're you know everyone knows come freak of the wig th her she's gonna suck the life out of you she ate a deer that was awesome Amy Adams I know Amy Adams but then on top of that like yeah but I mean like there is so like season one and two I think are so **** amazing there's a handful there's probably 15 20 episodes that you watch and go this is a but you got to remember if you're doing 2 2 Episodes a year if you have five good ones that's pretty amazing you guys week in week out but you know but how did Breaking Bad do it cuz they only shot half as many",
      "start": 1392.72
    },
    {
      "text": "to remember if you're doing 22 Episodes a year if you have five good ones that's pretty amazing you guys week in week out but you know but how did Breaking Bad do it cuz they only shot half as many that's why the episodes were so amazing it was I mean total control probably right and the fact that they get to break their seasons and giant halves and all this other stuff that I don't understand because I'm just some kid on the outside but it's true I was I was a little kid when I was when say that I I was really how old are you how old are you when I was watching Smallville I was like 10 now how old are you now 24 okay yeah 30 hang on I could be your father that's fun I am are you his father excuse me I am your father I was going to say with the number of burps You'burped in your hand and thrown in his face I would love it if you were his I want you to do me a favor for the rest of this interview or what hanging out with us I want you to call me dad I'll call you Dad that that works",
      "start": 1431.64
    },
    {
      "text": "thrown in his face I would love it if you were his I want you to do me a favor for the rest of this interview or what hanging out with us I want you to call me dad I'll call you Dad that that works for me is that okay with you guys that's awesome I support but yeah watch and I want you to call him Uncle Stubing I'll be Captain Stubing uncle uncle uncle Ste not Captain I want to be the captain Smallville was the first show that I remember seeing being like how do they make this every week and that blew my l oh I used to ask myself the same question it was like it was it was like this every week would start and you watch that first scene and then you'd hear that the song somebody and I would just like I would be alone in my apartment and I had a Remy Zero love it no it was a great song You Know What I was actually which the other song that I like too I can't stand that was a good song I before I ever watched an episode of Arrow my friends were telling me you got to watch Arrow and I was",
      "start": 1472.76
    },
    {
      "text": "What I was actually which the other song that I like too I can't stand that was a good song I before I ever watched an episode of Arrow my friends were telling me you got to watch Arrow and I was like is it like great CW and they're like what does that mean I'm like is it like the Smallville formula where it like every episode winds down with some awesome currently yeah some awesome pop thing they're like yes well they still do that right they still go like music get the original song for Arrow knows Arrow's hardcore Arrow's Arrow's good have you seen do you watch Arrow I have not watched Arrow yet it's actually it's really good it's good really this came out of nowhere last year every and now this year like yo you got to watch you want to know what changed it came to Netflix it came to Netflix you could watch it all in bolk when I watched one episode of era I was like I don't know how how I feel about this and I deleted him all from my DVR who's delet guy a blonde guy a blonde guy",
      "start": 1521.0
    },
    {
      "text": "Netflix you could watch it all in bolk when I watched one episode of era I was like I don't know how how I feel about this and I deleted him all from my DVR who's delet guy a blonde guy a blonde guy there you go he's he's got really good so they didn't pick just spit on your mind no about Justin Hartley no he not a different Universe they're redoing it I would and this is one of the reasons you were asking me if I how much I knew I was telling I was watching I didn't start because first off I had Smallville I was still you know hung up on Smallville let alone the fact that Justin is Green Arrow to me and I didn't want to give that character up to somebody else and so yeah I didn't watch it in the beginning because I was like I'm I'm over this I don't need and I'm totally invested but funny story about all this I got to go to the Superman 75th anniversary party at Comic-Con last year and so I'm up there hob noin with all these stars and Jim Lee and all these people comic creators I've",
      "start": 1562.08
    },
    {
      "text": "story about all this I got to go to the Superman 75th anniversary party at Comic-Con last year and so I'm up there hob noin with all these stars and Jim Lee and all these people comic creators I've grown up with and love so much and this all of a sudden I the blue this kid runs up to he's like Greg Miller I love everything you do I'm like oh man thank you so much that means world and then I'm talking to him and his I think girlfriend and I'm like oh yeah it was it and his girlfriend I'm like well and I'm like wa s like cuz it's where IGN throws their party every year too and so I'm used to being there meeting speaking are you going to ComiCon I've never been year Comic Con I've never been you're on the you come down and you on the IGN show you are a correspondent with us really Nick I I don't think I have the power to make that but I I have the power to make that happen but you don't have to do the whole show it's like a 36 hour show is it amazing oh it's you got so much fun people",
      "start": 1596.12
    },
    {
      "text": "don't think I have the power to make that but I I have the power to make that happen but you don't have to do the whole show it's like a 36 hour show is it amazing oh it's you got so much fun people would flip their lid if they saw you at ComiCon you'd be like you'd be like I go to these conventions I've just never gone to ComiCon cuz it was always down our thrat and I just never like when people you you're going here and you're doing this and I was like a rebel yeah well I just was like I I don't you know I just I never went but I go to all the other ones I go to Dragon Con I go to you go to Dragon Con so I keep hearing about Dragon Con Dragon con's the so I'm at the 75th anniversary party this kid freaking out finally Dawns me I'm like wait how are how are you in here like do you know DC you're like oh my sister's my sister's brother does does does one of the shows and I'm like oh cool what is he what is he a PA he's like no he's arrow and I'm like you're wait he's the guy in Arrow",
      "start": 1632.12
    },
    {
      "text": "you're like oh my sister's my sister's brother does does does one of the shows and I'm like oh cool what is he what is he a PA he's like no he's arrow and I'm like you're wait he's the guy in Arrow he's like yeah he's right there and like I turn around arrows next to me like oh cool I've never watched that show and now I'm all like damn it why did I take that moment all right so can I can I can I tell you my what what yeah go ahead who sexy superer superhero or heroin I'm going to put the Marvel we're going to go DC Mar good good good I'm going Marvel 100% you're going to go Marvel 100 all right I'm going to go with Wonder Woman I got to go Wonder Woman here's why she's got a little bit of a dominatrix vibe to her with the tying up it adds that extra dimension of hotness plus Batman and her had a thing Justice League yeah there was that going on I was I was wanted to see Batman Gatorade Gatorade can't say it there's a call back to a Gatorade segment when we weren't we not recording",
      "start": 1671.44
    },
    {
      "text": "her had a thing Justice League yeah there was that going on I was I was wanted to see Batman Gatorade Gatorade can't say it there's a call back to a Gatorade segment when we weren't we not recording know that guy anyway but yeah you you like Wonder Woman oh I I like that that for a little for a little moment Batman had a little reprieve from Catwoman cuz he always had that dysfunctional relationship with Catwoman every comic I thought that was really nice reinvention for the and they were like they were hting off and she was like yeah you know you're pretty cool and he's like you're pretty cool too we should hang out sometime and it never really went anywhere cuz I think it got canceled after now to the dominatrix Vibe and getting tied up and all that stuff did you have you ever done any this is going to sound stupid but stick with me have you ever looked at like Wonder Woman's like when she first came out on the scene did you ever have you ever looked at books about that or read",
      "start": 1711.52
    },
    {
      "text": "any this is going to sound stupid but stick with me have you ever looked at like Wonder Woman's like when she first came out on the scene did you ever have you ever looked at books about that or read about the history of DC Comics or anything no there was a whole bunch of stuff that she got tied up like every issue I remember so flip the script and tie her up and then it was like a lot of dominat Vibes in the comics well you remember Linda Linda Carter's Wonder Woman again yeah she was also on Smallville she did an episode did she by the way sexiest character guest star on Smallville see if you can guess who I'm thinking Terry Hatcher Lois's mom neg atory I think she's sexy that I'm not going to go with that sure did she say Sher Shar wasn't on small he said share I said sure I did not say share I say share was so sexy do you believe in super [Applause] powers nope nice woman nice lady is it a girl or a guy it is a woman okay well I mean not that I wouldn't say a man but I would that",
      "start": 1746.64
    },
    {
      "text": "I say sh share was so sexy do you believe in super [Applause] powers nope nice woman nice lady is it a girl or a guy it is a woman okay well I mean not that I wouldn't say a man but I would that was that was yeah I wasn't that wasn't uh I I I'm trying to remember her name I know her the character's name but if you said the name I'd know it wait so it's a guest star character it's a guest star character came in for more than one episode and I just thought she was the hottest charact thought I was always like offscreen and onc Screen I was like this she is absolutely hot married woman not like that but just always thought this woman was smoking it's while you were on the show yes no okay so I'm trying to trying to narrow it down a little bit come on were you on the show when Lois was on cuz she was hot yeah I don't know who that act is but ER Durant not yes yeah she's hot but I'm not I'm talking about guest stars yeah I don't know I'll give you a hint she wore all black wow somebody's",
      "start": 1787.72
    },
    {
      "text": "she was hot yeah I don't know who that act is but ER Durant not yes yeah she's hot but I'm not I'm talking about guest stars yeah I don't know I'll give you a hint she wore all black wow somebody's vibrating that was really well times all black were all black oh no she was a guest star she was was she on a lot of shows um she was on a few there's like Dr Quinn Medicine Woman what's her name no no no Jane Seymour Jane Seymour's attracted you there's like by the way this is going to kill the people that are listening to the show there's like 300 people listening to the show right now and going oh you guys are **** idiots wait he said all dressed in black that he thinks the sexiest we're not in trouble for that yet you guys should know that you want me to say we should know yes tell us the Black Canary you were on the show when she was on the show yeah see I always think when we get to that part of like the Justice League assembly let me tell you go back and watch those episodes of small no she's",
      "start": 1834.92
    },
    {
      "text": "you were on the show when she was on the show yeah see I always think when we get to that part of like the Justice League assembly let me tell you go back and watch those episodes of small no she's doing me wrong and it's super what was her name Elena we going to oh in real life yeah I don't know but she was great she she I'll describe her and you tell me she had her hair cut really short blonde and then she had this awesome thing where she wore instead of wearing like a a domino mask she wore black uh paint over her eyes oh that's hot she was really oh yeah yes now don't get crazy here Dina no not Dina Dina who names her kid Dina no it's like a 1960s name sorry if you're any Dinas out there like a 13-year-old Diner just soing at it says and this I might be wrong because I don't know how to use the internet that well but it says her name is that her yeah yeah but that's a terrible picture she looks like ion Drago in that picture find another one yeah that's that's more like it yeah",
      "start": 1881.84
    },
    {
      "text": "to use the internet that well but it says her name is that her yeah yeah but that's a terrible picture she looks like ion Drago in that picture find another one yeah that's that's more like it yeah she's gorgeous yeah she's beautiful but I'm just saying that's a good trivia question yeah there you go who was the hottest guest star in the history of I don't think that's trivia I don't know if that count trivia that's my freaking it can be Michael Rosen mom says the I can't find a real name her character's name is is Black Canary but Din Din Lance is the main is the character's name is it no it is Dina is that how you pronounce that word hold on I amdb anyway that's that's you in farts you like these farts well I'm a child still uh you know in the movie we we talked about that you know in the Midwest we used to I had a friend I can't really do it but it was called the Garvin and he used to catch his own fart and he'd be able to run a mile down the street and then go and you go oh my God",
      "start": 1928.12
    },
    {
      "text": "Midwest we used to I had a friend I can't really do it but it was called the Garvin and he used to catch his own fart and he'd be able to run a mile down the street and then go and you go oh my God what what was that he's like that was my ass and I don't know how he did it but it was called the Garin so you know was so in the movie we incorporated the Garin a yeah because there's a lot of fart jokes in the movie you keep doing the fart noise which you're really good at right let's get one he's good at Impressions such as a but well I should have been a a rich little that's what I should have been should have you missed your calling miss my calling but I always the thing was it was sad because I was always the shortest kid in my high school I was complete in nerd and my parents used to maybe make me babysitting my brother on Saturday nights Friday and Saturday nights when they go out and got chit faced so I would watch SNL while my brother slept on the couch and they'd come home they",
      "start": 1978.56
    },
    {
      "text": "make me babysitting my brother on Saturday nights Friday and Saturday nights when they go out and got chit faced so I would watch SNL while my brother slept on the couch and they'd come home they go tell us what happened and I would do all the Impressions and that's how I started to learn Impressions because I was always home I never was able to go out with my friends didn't have many friends then but um so I started doing impressions and now I do tons of Impressions so that's how it starts when you have a lot of time on your hands he asked me why do you remember that whole speech by uh Hannibal Lector because you watched that movie I all it I know yes so many lines see I had a lot of friends growing up I just really preferred watching TV and eating that was that was my preferred Pastime my friend Shadow Boxing no that's when when when Nick decided to lose weight what he'd go do is Shadow I was I was huge back yeah oh yeah super white like I would my my normal day would be come home",
      "start": 2015.16
    },
    {
      "text": "my friend Shadow Boxing no that's when when when Nick decided to lose weight what he'd go do is Shadow I was I was huge back yeah oh yeah super white like I would my my normal day would be come home from school eat Twinkie eat Twinkie have a couple Cokes then have dinner how old were you I you're talking like 13 the AG is from the age of 13 to maybe 20 and that's a cruel age that's a cruel age for I was the short just being short I got made fun of I was the shortest kid no girls you know so being heavy is probably you know wor worse absolutely although the fat kid could always beat the short kid up no cuz I was like a gentle giant I wasn't much of a giant though I was short also so I was short and chubby and and unlike you're likeo you're like 6'4 now so I guess you had a growth spurt somewhere around College I was 51 or 5'2 as a senior graduating senior I grew 10 inches in the next year and half Jesus yeah when you was there a girl that was like grew one inch no way no I'm hung like",
      "start": 2055.6
    },
    {
      "text": "around College I was 51 or 5'2 as a senior graduating senior I grew 10 inches in the next year and half Jesus yeah when you was there a girl that was like grew one inch no way no I'm hung like a large kitchen match that that's not very big I'm fine I don't yeah show us to the audience no they want to see it stay tuned YouTube can zoom Hey listen they're going to watch it then if one of us whipped it out then they're going to listen to your Islander story my all right sexiest superhero is gonna be one you'll have to probably Google if you're not into Comics Adam Eve from invincible so when I did the Invincible cast thing I mentioned her you cig can't you go with some more mainstream no cuz I'm not going to bend your whims you all want your views but let me tell you I can I can sum up how sexy she is in one scene from the comic all right she finally hits it off with inin spoilers you're welcome to I mean picture you know this really attractive redhead her costume is just a unitard with",
      "start": 2100.84
    },
    {
      "text": "she is in one scene from the comic all right she finally hits it off with inin spoilers you're welcome to I mean picture you know this really attractive redhead her costume is just a unitard with no legs so she's just flying around this one piece thing yep hot okay yeah of course her powers are the ability to you know manipulate molecules change them around do whatever sure that's not so sexy but stick it's about to get super sexy stick with me right manipulate the molecules to have like a bed what happens is they come home one night to Mark's room Mark being Invincible they've just started dating they've gone on a date they come back say Michael say Michael the Invincible Michael R he's like oh he's he comes home he's like all right yeah BL he's like you know oh you know my mom isn't here she's doing something and she goes laundry laundry no she's she's he goes Michael goes double the diner Michael says to Adam Eve he goes I'm sorry you know mom's gone and",
      "start": 2143.08
    },
    {
      "text": "you know my mom isn't here she's doing something and she goes laundry laundry no she's she's he goes Michael goes double the diner Michael says to Adam Eve he goes I'm sorry you know mom's gone and Adam Eve goes that's so cute and he goes what and like you bring me back here when your parents aren't here into your bedroom he's like no no I didn't mean it like that and she goes be quiet snaps her fingers and takes off all of their clothes both of them at the same time that would intimidate me see at that point I would I would be like I can't do this wait a minute when she does that am I already boned up cuz that's embarrassing I don't think is it nicely tucked away it's yeah it's in your downward dog it's downward dog I mean you've been put on your back foot already right because she's like oh no no I wasn't trying to have sex with you and then she's like we are wow boom then they fall into bed together amazing not quite as sexy as I became a man that was that was the first time",
      "start": 2180.24
    },
    {
      "text": "like oh no no I wasn't trying to have sex with you and then she's like we are wow boom then they fall into bed together amazing not quite as sexy as I became a man that was that was the first time you realized that women were more than just knock around Pals y that was it for you knock around P like five years ago it was a little bit longer it's 100 issues in now invincible so fair enough Colin oh God I want call who's your who's your sexiest comic I want you to picture this there's an airplane yeah it is is **** bin flying oh you're going to go in the sky okay going and there's a guy with a hood on over his head you don't know who he is no you don't know you know who he is there's a guy for some reason there's another guy in there threatening this other guy with a gun maybe he's going to throw out he's going to throw out the plane but then the guy under the hood is like why are you doing that why would you throw a man out of the plane after you've just shot him was that what he say",
      "start": 2218.64
    },
    {
      "text": "throw out he's going to throw out the plane but then the guy under the hood is like why are you doing that why would you throw a man out of the plane after you've just shot him was that what he say something like that yeah yeah what was it it's logic he's wondering why you throw like maybe he's wondering why you would shoot a man throw out of a blade in this sexy scene we're picturing is one of them way more Audible and clear than the rest of the entire scene also does he have a sleeveless shirt on can we just always see his arms Hees he does okay and uh the thing about you know the thing about why he's so audible is because he has this mask on his name is Bane and I'm specifically talking about the Bane and the Christopher Nolan in the movie The Third film not the one that was a Spanish wrestler assassin you're talking about just the mercenary right right right right the Luchador you don't that ban right sure then he there's not con Brad Bane no not different strok father Brad Bane I",
      "start": 2260.76
    },
    {
      "text": "assassin you're talking about just the mercenary right right right right the Luchador you don't that ban right sure then he there's not con Brad Bane no not different strok father Brad Bane I heard that here's what we call that that is a reach and a pull you just pulled that one out of nowhere by the way the joke is that Greg hates how much I hate Bane or love Bane Greg Greg hat absolutely **** hates watch Chanel you're you just love that Bane I love that Bane I don't like the Bane in like the animated series or I don't know was an amazing amazing Bane that was B in the in the Christopher movie is **** spot on top KN spot yeah so he is definitely the sexiest of all of those two cuz he's I have no real plan I just want to do things I'm gregy has a plan The Fire Rises Greg he tells the guy in the plane The Fire Rises doesn't he that's the beginning of the plane shut the **** up that is like the most good fell he has a plan doesn't he says it in the plan get the **** out of here",
      "start": 2299.04
    },
    {
      "text": "guy in the plane The Fire Rises doesn't he that's the beginning of the plane shut the **** up that is like the most good fell he has a plan doesn't he says it in the plan get the **** out of here so that's that's where we're going to leave that that's where we're going I like that Kitty Pride is my answer I got a thing for Kitty Pride Ellen Paige version no all new X-Men version yeah I like KY I I had a bit of a crush on on the LM page version I know she was a little bit young that's a cool one too she was in a terrible movie sadly but yeah but I mean she still X3 had a lot of problems it wasn't terrible though it was a terrible movie had a lot of bad things had the Juggernaut **** I'm the Juggernaut **** that was in there just the satisfy thing I know right and it satisfied and it ruined it for everybody else it gave me that gave the YouTube generation like that was the beginning of the end and we're going to the end ladies mmore saw that and he's like I'm going to be a",
      "start": 2349.28
    },
    {
      "text": "and it ruined it for everybody else it gave me that gave the YouTube generation like that was the beginning of the end and we're going to the end ladies mmore saw that and he's like I'm going to be a rapper now yeah exactly it was great hey Ryan lewi come hang out with me let's rap and then boom a year later that's all took a year one year and and they ruin the Grammys and they ruin ruin the gramms he shouldn't have won any of them who watches the grams I know there was when you're married you watch the Grammys when you're married you also watch the Emmys the Academy Awards the Golden Globes uh the SAG Awards man you're really smoke during this and act cool no I'm not allowed to smoke anymore guys it's not it's not so you don't have a dart on you right now I don't no but if you want we won't go out and get a pack later and share one I didn't say that we're not going to do it Tim won't let me Tim won't let me because he's my conscience Greg is it's like platoon oh I wouldn't let you do",
      "start": 2393.32
    },
    {
      "text": "go out and get a pack later and share one I didn't say that we're not going to do it Tim won't let me Tim won't let me because he's my conscience Greg is it's like platoon oh I wouldn't let you do it you w one yeah he's like the Willam def Foe and he's the Tom baringer GRE Tom baringer went to missou Star Wars or Empire Strikes Back which one's a better movie 3 seconds go Empire Strikes Back Empire empire Empire empire what do you say movie guy listen I love them both but there the first was Star Wars and that was the most incredible thing I'd ever seen at the time is it a better movie empire is the an amazing conclusion to that M Empire regular Empire you go Empire that's go he pyed himself out he psyched himself Raiders Temple of Doom now oh my God not even it's Raiders just say Doom Raiders Raiders that's the one where they step where they step on the bugs right yeah Temple of Doom dude Temple of Doom's intro is **** bomb Temple of Doom's intro no no yes it is when they're in the",
      "start": 2431.24
    },
    {
      "text": "Raiders that's the one where they step where they step on the bugs right yeah Temple of Doom dude Temple of Doom's intro is **** bomb Temple of Doom's intro no no yes it is when they're in the club and like that that's an awesome intro okay Dr Jones dude Temple I got I the or whatever he say got dude Temple of Doom is underrated underrated no it was only underrated because it was bookended by one of the most amazing films ever made and another one of the most amazing films ever made wait so you think the Last Crusade is better than Temple of it's got Conor in it you think the Last Crusade I'm ask this one more time who here you think the Last Crusade is better than the Temple of Doom yes a lot of people do 100% a lot of people do story they start Nazis better acting better characters got to go we name the dog Indiana can you do a better conry give me a con I don't do a con you can't do a I do like a little malovich and some other things but I don't do you do malovich but you don't",
      "start": 2481.8
    },
    {
      "text": "to go we name the dog Indiana can you do a better conry give me a con I don't do a con you can't do a I do like a little malovich and some other things but I don't do you do mal ovich but you don't do well do the Gatorade guy one more time brought to you by Gatorade you guys I sit on that **** elliptical I watch sports center in the morning we're going to get a copyright strike from ESPN I'm telling you though I want I want the Dirt Devil guys's voice over career what's amazing is you guys aren't hearing that in your ears it's so good really like the audience is going to love that brought to you by gor it's getting better the whis helping here you know I think the Dirt Devil guy yeah what about Smuckers can you do a good Smuckers Smuckers I don't know I have no idea what is SM it's jelly jelly right name like I don't do a good one with a name like Smucker I don't know never done that but I did a malovich remember malovich give me a malovich I want to hear do this one it's it's uh in",
      "start": 2528.28
    },
    {
      "text": "jelly right name like I don't do a good one with a name like Smucker I don't know never done that but I did a malovich remember malovich give me a malovich I want to hear do this one it's it's uh in the line of fire and Clint that's where he's the okay that's on the phone and he says you have a Vendo with my **** **** and malovich say now what you couldn't possibly know Frank is that they sent my friend my comrade in arms to my house to kill me I never lied to you Frank and I never will that you are Nick's favorite person of all time because of this because why did you kill the why did you kill that bird **** we spent we spent numerous hours now together countless one would say and you never cease to astonish me who does a John Mal I know I I Tred to on I used to like I I'm telling you I was doing walking before but he was doing walking back I don't want to do walk but I used to do that before you launch into the walking thing we're we're walking to the IGN bathroom and he's",
      "start": 2573.24
    },
    {
      "text": "you I was doing walking before but he was doing walking back I don't want to do walk but I used to do that before you launch into the walking thing we're we're walking to the IGN bathroom and he's commenting on the pictures on the wall and you know that really awkward one of the woman with the lobster hander hand yeah he's like why is this Christopher walking have a lobster hand I'm like well that's a girl and then he just launched this into a walking wow got a lobster hand oh my God it's he close your eyes it's unbelievable I worked with him nice guy he's very gentle he would do these things this is the best episod subtle off you know a lot of people go this this this that's not what he does he actually talks like a the levels of going just you said it you know shoot him up he used to do these weird things he used to I I did a movie called po Hall junkies with him and there's a line where he goes you said it Joe bet it all does he's really weird you know when he your son **** that",
      "start": 2634.52
    },
    {
      "text": "these weird things he used to I I did a movie called po Hall junk ies with him and there's a line where he goes you said it Joe bet it all does he's really weird you know when he your son **** that he is and that **** who a girlfriend they took my narcotics now I know you know where they are so tell me before I do damage you walk away from I want you to do this I want you do that whole monologue I want you do the whole monologue for the audience I like the weird ones though I like like the Ted the true romances that that one is just from Silence to the Lambs remember that one yeah but everybody does that but I mean if you really listen to him he like are you m at size 14 you're really he does that thing with his you don't know what pain is screaming at him watch it again I just saw that movie I haven't watched in a while so you are you TOR goat he's got to be one of the most impersonated human beings on the planet let me tell you something maybe not even in voice but in the tuck do",
      "start": 2684.36
    },
    {
      "text": "movie I haven't watched in a while so you are you TOR goat he's got to be one of the most impersonated human beings on the planet let me tell you something maybe not even in voice but in the tuck do you do the tuck when you do it I my friends I go go I want to **** me one of his friends had his action figure up his ass you have to ask if he's done the Le Luther doll and just the head portion cuz that would have that a big big Lex Luther I'm Lex Luther look at me in the WB I have a I have an action figure in my butt I don't know thankfully it's bald you get me like it was wasn't my um that is that is that is amazing is is Christopher Walken like that offset too does he sound's weird he's a weird guy I remember I go hey I don't know my name is Michael Ros I'm doing a movie with you should I call you Chris should I call you Mr Walker he goes I don't know call me flash that's cool that's what he said what did you this was before I did the flash this was completely non seor so the next",
      "start": 2741.28
    },
    {
      "text": "I call you Chris should I call you Mr Walker he goes I don't know call me flash that's cool that's what he said what did you this was before I did the flash this was completely non se or so the next day I was talking to Anon Mount Hell on Wheels who was in the movie with me and Anon I say egg I got it in with walk and let me introduce you to him I go hey it's a Chris Mr talking no I go hey flash he wouldn't even look at me flash an's like yeah you **** know him he's not even paying any attention you I go hey flash finally talk turns around goes what who are you talking to I don't acted like he didn't even know me and walked away so baller I was you're there with me right this is insane you are the second actor who's told us this story no NOP NOP nope that actor whoever told you lied it's my story on set and they I've heard that somebody else told the same story that was me on set of Pall junk or maybe he's just telling I was say you don't think no but there was one actor who said it",
      "start": 2793.08
    },
    {
      "text": "my story on set and they I've heard that somebody else told the same story that was me on set of Pall junk or maybe he's just telling I was say you don't think no but there was one actor who said it happened to him and I like I don't think this is the same act I hope not because I heard that no I wouldn't remember unless you said it I don't want to I don't want to Dime him out on now said now it's a fight I don't want it's not a fight let's not start some sort of East Coast West Coast rap rival tell Ashley Johnson but maybe there's a possibly the only thing I can think of is maybe he's done it before maybe he's said flash maybe that's the thing he does got to believe that walk weird crocodile thing afterwards thank you no okay oh that was in the water right where he wouldn't get out of the water he said it's lunch I don't do I'm not going to do it it was lunch for lunch I'm going to be a crocodile and he took all all his clothes and walked in the water and hung out the entire lunch",
      "start": 2843.24
    },
    {
      "text": "the water he said it's lunch I don't do I'm not going to do it it was lunch for lunch I'm going to be a crocodile and he took all all his clothes and walked in the water and hung out the entire lunch break in the water with the water right below his eyes and he just stayed there for like an hour and then he came out and then put his clothes back on and went to and he he goes for lunch I was a cocodile I can't do the accent you you see it's one of those things you start to try to do it and you're like I'm not even going to do it well you want you want to embarrass yourself you don't you get bar I can't do I can't do walk I thought my walking was good your walking blows it out of the **** water but I always do weird **** like you know the kid from Pet Cemetery no one but no one would exactly nobody know child got I want he I don't have I don't have a life let me hear the tell you got to hang out with us will you please move to Fred Gwyn remember Fred Gwyn he was like uh must he was",
      "start": 2882.52
    },
    {
      "text": "nobody know child got I want he I don't have I don't have a life let me hear the tell you got to hang out with us will you please move to Fred Gwyn remember Fred Gwyn he was like uh must he was the guy I can't really do impression he's like Pet Cemetery no something like he goes where the dad speak she goes he's like well not ride out loud and the little boy remember the little boy Gage close your eyes mhm first I play with Mommy didn't I play with J now I want to play with you remember that fing weird kid Gage 19 no one saw that I just remember no I just remember in that movie what is what is the gentleman's name that played that older the older guy Herman Monster what's his name yeah he gets his Achilles T and that I was like I'm done I'm not watching anymore Stephen King movies this is he's going up he's going up the stairs and a little kid you fam with pet cut cuts it with the the kid he cuts it with like a scalp it's like oh God back it's like Steen King's awesome it's like a",
      "start": 2917.72
    },
    {
      "text": "is he's going up he's going up the stairs and a little kid you fam with pet cut cuts it with the the kid he cuts it with like a scalp it's like oh God back it's like Steen King's awesome it's like a misery moment right yeah that like legs God like the horror movies what horror movies are you I mean I love The Shining obviously who doesn't love The Shining you know uh how do you feel about Rosemary's Baby how do you feel about that Mr. Grady you were what does he say go you chopped your daughters up with an ax and then you blew your brains out you were the caretaker Mr. Grady weren't you you remember that scene I remember it Wendy it's a fantastic darling light of my life that was one of my favorites Exorcist the original Exorcist Exorcist 3 by the way even quoting Exorcist all night even though Pizza it was a little awkward even over randomly is like a second P of pizza Pachi he's like do you remember when he says to him he says he goes you speak Latin and he says say something and he",
      "start": 2976.52
    },
    {
      "text": "Pizza it was a little awkward even over randomly is like a second P of pizza Pachi he's like do you remember when he says to him he says he goes you speak Latin and he says say something and he says he says quad miest he quad miest quad Mi and he says plume remember that yeah weirdest the only reason we're not reacting is we're all got a little freaked out you remember when see how far the got like the movie he say he says like something with the drawer remember he's like he's like the Geor just go opens he goes do that again in time no do it now in time oh that that so is is Exorcist favorite horror movie of all time Exorcist can you pick one Exorcist amazing The Omen Gregory pack is fantastic they don't make stories like that anymore well they remade that movie I didn't see it it's good The Shining uh paranormal glad you think aliens are hor Alien is just one of the best horror movies of all time so say someone comes to you and says hey we want you to direct a remake of The Shining what",
      "start": 3025.04
    },
    {
      "text": "Shining uh paranormal glad you think aliens are hor Alien is just one of the best horror movies of all time so say someone comes to you and says hey we want you to direct a remake of The Shining what do you say if I had aren they redoing it if they said Michael you're doing it you're oh yeah yeah you get in there I would do it because I would really would you put your Le I would be I would do I would that's see that's something you don't mess with but I think oh man that could be I I I'm saying it should not be remade but they're gonna probably do I thought for sure that they are I thought they are doing it I could be wrong but they were going to redo the Warriors I thought and that was a travesty because that's one my no you got to leave some **** alone I was even mad that they redid RoboCop I got be perfect honest I'm going to go see it here's what I want to put out there on this topic which is not really a topic but we're just all talking because that's how the game of great ****",
      "start": 3087.6
    },
    {
      "text": "I got be perfect honest I'm going to go see it here's what I want to put out there on this topic which is not really a topic but we're just all talking because that's how the game of great **** works every Friday and Monday who rules What If instead of remaking all these movies they just put them back out released them they do that they do that right yeah but they do it in shitty ways like Ghostbusters came out for one night like you know what I mean like one exactly what if you get gave you know Rosemary's Baby the Omen The Shining anything a full run again and said here it is let's go would that I mean this is slightly different but they've done that for L rease Yeah well yeah when took the shotguns out and put in walkie talkies the problem with the problem with that is you just yeah ET you never saw that see when they take off over the cop the cop cars and the FBI guys are there they originally had shotguns cuz they're **** fighting an alien and then in the re the re-released",
      "start": 3132.84
    },
    {
      "text": "ET you never saw that see when they take off over the cop the cop cars and the FBI guys are there they originally had shotguns cuz they're **** fighting an alien and then in the re the re-released redubbed version with computer they put talk back in the day when it was only like PG and R there was no PG-13 so like you know when they they had to go back in but the best was like Lis black did a bit on The Daily Show about it when it happened and he goes he was ranting because you know how he Rants and he goes what do you think they're saying those walkie-talkies give us some shotguns there's a **** alien this is brilliant I have I have a I'm curious what you guys think about this I have a theory about horror films just the way I feel about just things that make things automatically scarier right space which is why Alien so good no matter what Woods Woods makes it scarier children that's why Children of the Corn is my favorite horror movie hor because I love that **** movie and",
      "start": 3174.32
    },
    {
      "text": "right space which is why Alien so good no matter what Woods Woods makes it scarier children that's why Children of the Corn is my favorite horror movie hor because I love that **** movie and religion which is why something like the Exorcist is so scary just just the image of an upside down cross whatever is very scary that's why Rosemary's Baby's really good all that's kind like all that kind of stuff so I just feel like movies that touch on those little things are some of the best horror movies you know what I will say about that is that the reason so many horror movies and so many good horror movies were made in the 70s and 80s is because no cell phones right like you didn't have a chance to call the police right away you couldn't do all these things so even now they're doing like The Conjuring it's back in you know it's right back in time and things like that so it's harder so it's it's harder to become more unique I think and tot CU really all you had to do was screw someone",
      "start": 3214.84
    },
    {
      "text": "The Conjuring it's back in you know it's right back in time and things like that so it's harder so it's it's harder to become more unique I think and tot CU really all you had to do was screw someone over was just cut the phone line to their house and they were just **** you yeah no I'm not hey Mom they're tweeting someone's following me someone's following me well JK hash killer yeah it's true it's got to be hard to write a horror movie now because you have to find a way for your characters not to have any of these modern marel I did it you wrote a horror movie yeah I wrote a horror movie which horror movie did you write I'm not going to tell you it's not coming out yet oh well we're we're trying to get funding right now it's uh it's called the site my friend Kyle Newman and my friend Adam F Goldberg we wrote it together and how many action figures have been up there are you allowed are you allowed to give me the I can't really can't do it but it is an alien type of movie that's",
      "start": 3256.72
    },
    {
      "text": "Adam F Goldberg we wrote it together and how many action figures have been up there are you allowed are you allowed to give me the I can't really can't do it but it is an alien type of movie that's fun uh awesome does aliens eat their cell phones is that how they yes they eat the cell phones the we trying to get that we made like a little scissor whe and wrote the script it's really hard to me but you know horror movies are becoming obviously oversaturated it's like because everyone's like make money off a horror movies so let's make a harm they always come back so shitty though there's never like it's so rare that they really good that's I mean like think about like Cabin in the Woods like and I know it's not hor I no I love Cabin in the Woods I'm saying it was able to stand out because it did something different right you know what else is good you're next I thought yeah I just watched I thought it was enjoyable which one's your next your next it came out of last year and it was uh",
      "start": 3293.92
    },
    {
      "text": "it did something different right you know what else is good you're next I thought yeah I just watched I thought it was enjoyable which one's your next your next it came out of last year and it was uh this whole fames in a house and then they get like hunted almost like strangers strangers I thought it fell apart as it went on though it did but it still was it entertained me surprisingly entertain and you don't need to make a $50 million horror movie it shows you all the movies now the it's you have to make for half a million to to three or I made a joke about paranormal activity four being awesome but one and two I thought were great I really loved one and two three fell part at the end with the I don't know I don't even know what's happening exact mov Monsters uh no you should see that it's on wait a minute I think I did the on a train there's a part on a train this is a this is a you should see this because it's it's a very very lowbudget indie film that they shot basically it was like",
      "start": 3331.12
    },
    {
      "text": "on wait a minute I think I did the on a train there's a part on a train this is a this is a you should see this because it's it's a very very lowbudget indie film that they shot basically it was like seeven man seven man crew they went down shot on all locations found actors really really good not so much a horror movie it's more of just a do you see Troll Hunter no one with aome right Troll Hunter is amazing it's a Norwegian great it's great go watch uh Troll Hunter and back in the day when you're bored um any back in the by the way there's lots of penises in back in the day no there's one there's just one like what you fil that at small dick he a small baby dick it's not his dick it's a stunt dick it's my fault I I should have gotten a bigger penis for the movie you can hear about it on up at unless Nick it it out when no we're going to keep the penis part in but you were you were saying off camera that you wanted to film that at 1,200 frames per second 120 was enough trust me it's",
      "start": 3370.24
    },
    {
      "text": "up at unless Nick it it out when no we're going to keep the penis part in but you were you were saying off camera that you wanted to film that at 1,200 frames per second 120 was enough trust me it's like it's like literally like this imagine seeing my finger this so you said it was small but it was it was girthy the was it was a little girthy well now we know it's in his pants I was going to say here's the thing about this conversation up at noon Monday I guess if you're watching anyways um do you worry about how the feelings you are hurting of the poor person in Indiana whose dick that was no because talking about we used Oscar we us we didn't use a real name it was uh it's a stunt dick Oscar yeah but he still knows that we're all talking about how small well you know maybe here's what I have to say about that I have to say that it was a little chilly and God knows we know when there is a crispy cold not an accurate representation yeah it's not but it was just I actually asked him",
      "start": 3414.64
    },
    {
      "text": "I have to say about that I have to say that it was a little chilly and God knows we know when there is a crispy cold not an accurate representation yeah it's not but it was just I actually asked him that's why I'm a little upset I said do you have a big penis he's like yeah **** you see it beforehand or were you just like I'm audition penises cuz really either way you're you're golden right if it's super small it's funny if it's huge no but you know what Harlen goes Buddy you should have got a big one Harlen's the guy from Dumb and Dumber are you drinking at some of Greg's Grandpa's cough medicine on you buddy anyway we were hoping I told you this in the show yeah watch up at noon that the I wanted it to be a he says it'd be funny if it was like this big flappy floppy dick going across the camera this guy says he's got a big one don't worry but I mean this is a really small wiener so it's not it's not too offensive but uh it's uh I love it I love you know people it's offensive only are",
      "start": 3463.08
    },
    {
      "text": "camera this guy says he's got a big one don't worry but I mean this is a really small wiener so it's not it's not too offensive but uh it's uh I love it I love you know people it's offensive only are offended by small dicks ultimately you know you could go make a movie that you think everybody wants and try to please everyone but there's certain things in the M about the movie like there was certain things I was like I'm keeping this I'm pretty sure you keeping the dick shot I'm pretty sure you did not set out to make a movie that was not going to be offensive to like a mass audience oh no I I honestly said I remember my DP he said do you think the critics are going to like this movie and I go **** no no are you kidding me I go this is for my boys this is for the people my the people that grew up in the Midwest who play whiffle ball who go to reunions who this kind of Lifestyle it just makes sense people in the Midwest flip out over it sure it's not really meant for like someone",
      "start": 3507.6
    },
    {
      "text": "that grew up in the Midwest who play whiffle ball who go to reunions who this kind of Lifestyle it just makes sense people in the Midwest flip out over it sure it's not really meant for like someone some guy who's going like this from the LA critics Association Going H that Dallas Buyers Club really blew me away way and then they've put in my movie with a fart thrower it wasn't it was it was never designed for that I I remember Sandler who's one of my heroes said um once he said to my editor who's the editor of my movie said Sandy Sandy right Sandy the editor who's amazing I love him you know I love you Sandy if you're watching you're probably still up looking for porn I was gonna say he talked a lot of **** about you on up new I talked so much **** about you but uh he said Sandy the critics hated the movie means we're gonna make millions because it's a fan movies right it's for the boys it's not for you know it's not for CR it's as if I mean there there are quite a few things in",
      "start": 3547.36
    },
    {
      "text": "critics hated the movie means we're gonna make millions because it's a fan movies right it's for the boys it's not for you know it's not for CR it's as if I mean there there are quite a few things in there that you're like if this didn't get them the 120 fres CR P oh we wanted to talk about this we got to bring that what the dominatrix outfit Tim's only critique on the dominatrix part when she comes out Harlem Williams's wife in the movie he goes this should have been crot panties I think and I said I don't think I don't think you can show that many Vagas um by the way it was that it was Sarah's first day of filming she was a little that you th is it do you subscribe to the old notion like get him to do the hor the horrible scene first that way it's it's behind uh I felt like she just has to dive in she just has to the de oh yeah she was really nervous she was but let me tell you she's a standup comedian she's brilliant she's written books she's I was watching her and I'm like I know",
      "start": 3596.6
    },
    {
      "text": "to dive in she just has to the de oh yeah she was really nervous she was but let me tell you she's a standup comedian she's brilliant she's written books she's I was watching her and I'm like I know her where do I know her fromel lately Chelsea lately she's all over she's genius Sarah Cola but yeah and that in that scene there's a scene where she comes in she's really shy throughout the movie and she comes out and she has this dominat afteron and she's got this Whip and she starts going you know to to her husband Stuart where are you are you at the **** Dairy Queen and **** and she's whipping and she starts beating herself but she doesn't realize that I'm behind her watching this whole thing go down so she had to come out that was the first time she'd filmed and she's like I don't is it we were trying to find an accent for I told her to come with three different accents you know let's do a a French **** let's you know do whatever so she has some German she was like what is this",
      "start": 3642.48
    },
    {
      "text": "it we were trying to find an accent for I told her to come with three different accents you know let's do a a French **** let's you know do whatever so she has some German she was like what is this I go nah it's a little harsh I don't feel comfortable I'm Jewish um and then she's like St and she starts to do this thing and I was like yeah that's something like that and then I told her to scream and there's one point I she's like her face goes completely red and she's like she screams and I thought she was going to pass out and later on she goes I almost completely passed out right in front of everybody and she was really nervous but I said listen I promise you I will cut this if it's not funny you have to go balls out you have to scream you have to be and that what kind of went for everybody I mean there was like the puking scene when where normally when you when you throw up if you saw someone else throw up you might I I have a weak stomach I don't throw up there's a scene in the",
      "start": 3683.28
    },
    {
      "text": "I mean there was like the puking scene when where normally when you when you throw up if you saw someone else throw up you might I I have a weak stomach I don't throw up there's a scene in the movie where one guy's throwing up and the other guy's like and he's not supposed to know where he's in the shower hiding and they have this and I'm telling you I watched it with an audience it was just it just the laugh and it just kept and it was the best thing ever I'm like yes they get it they get it once again and when that that scene's about to start and Nick Scarpino opens two things of tuna fish into a bowl and walks out I chose to eat tuna fish while we why did you do that I don't know seemed like a good idea I was like made a movie this will be high quality 40 minutes before that he walks in it's a 120 frames he walks back eating oh it's puking so what's even worse is I had mixed in like like it was like brown mustard tuna and pickles like cut up into this thing with a little bit of oil",
      "start": 3729.88
    },
    {
      "text": "it's a 120 frames he walks back eating oh it's puking so what's even worse is I had mixed in like like it was like brown mustard tuna and pickles like cut up into this thing with a little bit of oil salt and pepper and I'm halfway through this g i see Jesus God Almighty I see I see I see this the first SE the guy starts throwing up I was like they're not going to show it and then they just keep cutting back to like Frank and again I I Nick turns to me and I go it's going to get worse before it gets better he turns back and it's just more but it's only one real shot of the ACT you can see a little your editor maybe you didn't watch that thatal with him maybe you haven't seen this movie no he told me he's like I think we might have to cut it it's not working and then I got we got in there together and I said no no no and we we messed around with it and we never touched it again and we reedited in like an hour and then the we played it in front of Studio A or audiences and they I I I",
      "start": 3768.4
    },
    {
      "text": "together and I said no no no and we we messed around with it and we never touched it again and we reedited in like an hour and then the we played it in front of Studio A or audiences and they I I I loved it I love that people could appreciate a good puke scene that'll be indelibly placed on my brainish anytime I can of alvor tuna I'm going to think up soup from your how does that process go when you you have your movie like done or whatever and then you bring it to like you show it in front of an audience and you get the feedback you see what laughs you get and what you don't yeah you did a SC for this how much changing is there oh my god when my editor editor's job is after the fir after you're done filming he takes two weeks off and he gives you what's called an assembly and this assembly is from beginning to end everything's nothing's cut it's the scenes are in their order of what you've said and what's been written written improv right sure 2 hours and 21 minutes I would have",
      "start": 3814.92
    },
    {
      "text": "is from beginning to end everything's nothing's cut it's the scenes are in their order of what you've said and what's been written written improv right sure 2 hours and 21 minutes I would have watched that cut and I almost like vomited in fact my friends were directors Jason Wightman Juno and all these they go hey you're going to want to kill yourself after the first one there's no there's no music really there's no the the moments aren't timed out for comedy and then it's an independent film you we have eight weeks to cut this thing and I'm sitting in front of 10 hours a day with him and we're recutting the entire movie so you went from filming like eight pages a day to then going like 2 hour and 22 minutes we're just going to Hole up in this room and cut it to an hour and a half I want it to be 9 0 minutes you wanted an 80s audience goes in there and I look I love Jud Apatow but I think his movies are too long I think he's wonderful I'd be in any of them I'm just saying I go into see comedy",
      "start": 3859.32
    },
    {
      "text": "90 minutes you wanted an 80s audience goes in there and I look I love Jud Apatow but I think his movies are too long I think he's wonderful I'd be in any of them I'm just saying I go into see comedy Now now I won't like he's watching this but I don't want to go in and watch he's a huge fan definely not watch I don't want to see a two-hour comedy I I don't care I want to see an hour and a half movie and go God I wanted to see more I'm going to buy the DVD I just felt like the audience is in they want to have some laughs and say oh there's some heart there's some we get some good laughs and we're out and we can still **** go out tonight we don't have to be home you know I just feel like comedy should never be that long so I just made sure and my editor said ah it could be an hour and 45 no I don't want it to be hour like 1 hour 30 yeah I still thought it could be even shorter I honestly that's what you loved right about like you brought up movies like license to drive and and the old",
      "start": 3902.48
    },
    {
      "text": "I don't want it to be hour like 1 hour 30 yeah I still thought it could be even shorter I honestly that's what you loved right about like you brought up movies like license to drive and and the old 80s Classics and those were like 90 minutes max maybe 80 you wanting more yeah you were like I want to see where he's going with Heather Graham right now and that and that rabbit absolutely God it was so good but it's hard the process of like cutting all that stuff down and then getting the then you have to show it to an first you show it to your producer and your producer goes yeah I go well let's let's let a test audience and then she gets hands out flyers at Universal CityWalk and nobody knows I'm there and I'm sitting in the back and it looks like **** because it hasn't been color timed no color time the sound the music everything's distorted it's not your it's like it's 60% done 50% done and this audience you don't know is watching it and you video tape them and they're",
      "start": 3937.56
    },
    {
      "text": "color timed no color time the sound the music everything's distorted it's not your it's like it's 60% done 50% done and this audience you don't know is watching it and you video tape them and they're laughing and then there some things that are not laughing at and you take notes and you say this works this didn't right and ultimately it's just like over and over it's like you're just trying to figure out what is working and then the things that are working that people laugh you never touch if they're laughing don't touch it and so and then after that don't look at me no one ever laughs at our **** I was going to say I've and you did it but it's like it was it's a process and then I mean by the way for an independent movie to get like a distributor or any sort of get get out there is just it's brutal you don't have any money these Studios I told you had they have 20 million of PNA in a movie there's Billboards and there's trailers independent movie relies on social media so if our",
      "start": 3973.84
    },
    {
      "text": "it's brutal you don't have any money these Studios I told you had they have 2 0 million of PNA in a movie there's Billboards and there's trailers independent movie relies on social media so if our friends and your friends and you know my family and their they without that that chain reaction of people going to see it how is anyone going to ever find out it exists so it's it's and without VOD and without iTunes and things thank God for iTunes thank God an independent movie could be made and maybe get its money back here's my question about that ask me do you think that's how how much longer are we from that being the standard see Greg I don't want to go I would see more movies if I could I want to see her but I don't want to see her bad enough to be like honey tonight you go home walk the dog meet me at the Metreon then we'll go do it then difference difference is between me and you is I love the idea of getting my friends together and going to an event in a movie and getting some",
      "start": 4014.24
    },
    {
      "text": "the dog meet me at the Metreon then we'll go do it then difference difference is between me and you is I love the idea of getting my friends together and going to an event in a movie and getting some popcorn and candy and sharing with a bunch of other people and the laughs are better they're different it's like you're you're experiencing a whole thing to me it will never you'll never the theaters will never not have m i I agree with you I I there are movies I like that for I go see every superhero movie at midnight because I love that energy but for like a movie a Million other movies I don't and that keeps me from seeing them in the theater which then for some reason keeps me from seeing when they come out right because there's no more Buzz around but you can still see a lot of these movies what they do now is they do a pre theatrical in fact you could see rent it now for 1999 before it comes in theaters in fact back in the day you could have rent it for like 10 bucks or five bucks",
      "start": 4056.04
    },
    {
      "text": "what they do now is they do a pre theatrical in fact you could see rent it now for 1999 before it comes in theaters in fact back in the day you could have rent it for like 10 bucks or five bucks whatever now you can $3.99 or four paid it's nothing I thought I paid five you paid five for the HD version good for you I think I'll give you another before you leave for me Greg I appreciate that but the my favorite part of the movie is not the actual movie it's going to see it with a bunch of friends and then what happens after jerking off in the back of the the yeah you just kind of beat that thing to death yeah um putting your penis in the popcorn and let your friend John go oh what are you doing that's the 19 19th time you've done that John name that movie name that movie My Life Diner sing with all I know beating that thing to death I know I know the theatrical experience will die one day I know that one day we'll just we'll never leave our houses they can coexist there can still they",
      "start": 4096.92
    },
    {
      "text": "with all I know beating that thing to death I know I know the theatrical experience will die one day I know that one day we'll just we'll never leave our houses they can coexist there can still they can they can't eventually whatever's easiest will win that's just our soci there's always going to be movies you want to go see and there's do you think so no I don't I think they can coexist to a certain degree but at the end of the day as human beings especially Americans we just choose to pick the thing that's easiest the path of least resistance right and so it is hard and it costs more money and when you're talking about buying a movie for $20 you can have 10 of your friends over buy the movie for $20 it's $2 a piece what you don't get though is that walk out of the exper the theater experience right and then you start to sort of digest the movie and you start to talk to each other and you start to just kind of like maybe you didn't know if you liked it or not until your one friend",
      "start": 4139.48
    },
    {
      "text": "right and then you start to sort of digest the movie and you start to talk to each other and you start to just kind of like maybe you didn't know if you liked it or not until your one friend makes that one good point that's great but see we get that home like the next day yeah you when we're in the office we're all talking about like what we saw this weekend we didn't have the same theater experiences but we all saw Frozen the Disney movie that's amazing and then we're just like talking about it isn't that the same thing well there's there's just an energy when you see a film with 500 other people versus two people on your couch or your wife who's like I'm not into this I'm going to go read the US Weekly in my in my room and feeling the chain reaction of a laugh you start to laugh they start to laugh everybody starts to laugh and it's un it's it's one of the few times in life where strangers you and strangers actually connect for a for a brief moment in the theat 90 minutes as",
      "start": 4176.6
    },
    {
      "text": "start to laugh everybody starts to laugh and it's un it's it's one of the few times in life where strangers you and strangers actually connect for a for a brief moment in the theat 90 minutes as you're going to see your movie mie what's that two 4 hours if you see a normal movie 90 minutes if you see back in the day that's true just a brief 90 minutes and and you're in you're back in the day I mean you could honestly it's you know it's good for Indie movies it's good for you know I when I shot this was good for what did you community what did you shoot back in the day on was that digital what's up did you shoot it on red no I shot it on an ay and Alexa Alexa camera they're very very durable they're very and they have the most film like you know uh red gets all the buzz but Alexa Red's kind of break down a little bit we're not going to talk **** they deci to sponsor the show one day no I'm not the only camera area is pretty much you can just take a **** on it **** I was I",
      "start": 4211.88
    },
    {
      "text": "kind of break down a little bit we're not going to talk **** they deci to sponsor the show one day no I'm not the only camera area is pretty much you can just take a **** on it **** I was I was fortunate to work with an AR one time the Alexa just come out it's awesome it's so good yeah it feels it's it's sturdy it's easy to set up and it's just ready to rock it guys are beautiful a lot what I work with an Alexis oh yeah Alexis I loved Alexis where is she I thought they were all coming out to hang out they're coming out later they're going to come and I'm around dudes sorry you're loving it you're having a great time you're over here talking hockey with this sorry I don't know you want me to talk I understand it a shot real quick right you want to do a shot uh I only have a little bit I'm like want me to get shot I already have have alcohol what do you mean what are what are you freaking out about com out the in my face hey Craig leave me alone my dad was an alcoholic all right",
      "start": 4252.88
    },
    {
      "text": "I'm like want me to get shot I already have have alcohol what do you mean what are what are you freaking out about come out the in my face hey Craig leave me alone my dad was an alcoholic all right you my favorite it's so good I just want to close my eyes and just listen to a half an hour of it pretend he's still with us Ry oh man I loved him didn't you oh God yes cheers there hey here's here's here's to uh whoever's watching first of all cheers here's to the fans the friends the uh the camaraderie my mom your mom your mom mhm Jamie Kennedy yeah is it Jamie Kennedy Jamie Kennedy is his mom's name not the not the Jamie Kennedy experienced guy he's awesome not Scream Jamie Kennedy no he was great in Scream let's not lie was he in that yes I never saw Fast they're trying to get me to watch Fast and the Furious **** I don't think he was the first one I don't think he was no damn am I really Beast Master Beast Master or Sword and the Sorcerer or Conan the O'Brien con con the obri no right",
      "start": 4291.56
    },
    {
      "text": "and the Furious **** I don't think he was the first one I don't think he was no damn am I really Beast Master Beast Master or Sword and the Sorcerer or Conan the O'Brien con con the obri no right mind is picking Beast Master over Conan the Barbarian no will Beast Master Don Costarelli right here not going to happen is going to be Conan the the wasn't wasn't con con do deor was it a De Laurentiis film y absolutely oh you can't beat Tegger and Conan the Barbarian he was as jacked as humanly possible mie yeah I'm the Beast Master uh sing singer Mark Singer that movie gave me by the way the king and queen are having she's pregnant and the witch kind of sneaks in and puts that stuff on their neck that paralyzes him nightmares for like how about those things in the Beast Master that you and then they strain you all youru dude the 80s was just a **** up time you're talking about turn offs and stuff like for me like there's a there's a realm of fantasy I just can't get into Breakfast Club I love",
      "start": 4343.36
    },
    {
      "text": "strain you all youru dude the 80s was just a **** up time you're talking about turn offs and stuff like for me like there's a there's a realm of fantasy I just can't get into Breakfast Club I love Breakfast Club or 16 Candles Breakfast Club Every Time Breakfast Club make choose my two children both excellent Breakfast Club all sexy girlfriend I don't know where is my automobile automobile if you're if you're asking which movie do I like which movie is a better movie Breakfast Club which one do I want to watch right now 16 Candles you got everyone in that movie you got both you got like nine q saacks in that movie you got Anthony Michael Hall you got Molly Ringwald before he got jacked you got Jake Ryan who didn't really do too much after that but he was he was so awesome it's like how did they get him into that thing no one knows it's one of the movie marvels of the my boy God it was so you never bag the B look I appreciate not laughing that's one of the best movies ever it really is",
      "start": 4398.44
    },
    {
      "text": "they get him into that thing no one knows it's one of the movie marvels of the my boy God it was so you never bag the B look I appreciate not laughing that's one of the best movies ever it really is hey it was your sister's birthday we all forgot classic that was a kid from Kramer versus Kramer Kramer EXC versus Kramer God love that movie 80s movies favorite 80s movie of all time go Ghostbusters well you know my favorite movie of all time is Arthur with Dudley Moore who by the way none of us got the reference except for Colin's girlfriend who came out of the bathroom to yell yeah I told you that's one of her favorite like when I first started dating her five years not the not the new one the old one more old I I had never seen that movie when I when I had first started dating her she's like we have to watch Arthur and I'm like what she's like Arthur's one of my favorite movies we have to watch Arthur I and she she did she came **** running out of the bathroom like a bad out of hell",
      "start": 4446.68
    },
    {
      "text": "we have to watch Arthur and I'm like what she's like Arthur's one of my favorite movies we have to watch Arthur I and she she did she came **** running out of the bathroom like a bad out of hell movie so good remember when he says he says so tell me about yourself she says well when I was six my my mother left us oh no when I was six my mother died oh God damn it they know that does the children I mean she died and when I was 12 my father left so you had six relatively good years do you know do you know when I was a child there was a time when I confused Arthur with the toy do you remember that movie oh I like that movie you remember that movie Jackie where they hire him to be the toy and he's racist though that very racist it it was purposely racist they they they addressed that in the film he's like this is completely ridiculous and but I loved that movie too God I love the 80s I miss favorite Dudley Moore movie is when he ate the candy canes it was a Christmas movie remember this",
      "start": 4485.88
    },
    {
      "text": "film he's like this is completely ridiculous and but I loved that movie too God I love the 80s I miss favorite Dudley Moore movie is when he ate the candy canes it was a Christmas movie remember this there was candy canes that made you fly you made this this is all I know about Dudley Moore thank you that's what Chate good vacation or Christmas [Music] vacation I'm going to get crucified for this but I'm going Christmas Vacation yeah I got to give it up for say so too yeah Christmas Vacation I can watch it a million times that's why that it's one of the I I don't like Christmas movies but like I don't for some reason that one doesn't feel like a Christmas movie if that makes sense it comes on it's like I just love that family and that Dynamic Clark mom I can't feel my legs mom I can't feel my feet Clark Audrey's Frozen from the waist down go oh Beverly D so hot they're doing another one right they're doing another one best Christmas movie I love the Old Navy commercials I pitched one",
      "start": 4537.92
    },
    {
      "text": "my feet Clark Audrey's Frozen from the waist down go oh Beverly D so hot they're doing another one right they're doing another one best Christmas movie I love the Old Navy commercials I pitched one the new line they're goingon to steal it I know it bastards best Christmas movie A Christmas Story or Die Hard Die Hard's not a **** Christmas movie Just it happens during Christmas they play it during Christmas I watch it every Christmas you know what Bad Santa's pretty **** good Bad Santa's amazing Bad Santa is amazing best Adam Sandler film go now Happy Gilmore Happy Gilmore now Billy Madison you go Billy Madison Wedding Singer happy oh that's a good one that's a good one Wedding Singer I would have to say underrated uh Darkhorse here uh Mr. Deeds I think is a really fantastic sneak sne I think I think that was really and I didn't I I think I was in maybe early college late high school when I saw when I first saw that I didn't realize it was like a that was a movie already and stuff like that",
      "start": 4580.2
    },
    {
      "text": "think that was really and I didn't I I think I was in maybe early college late high school when I saw when I first saw that I didn't realize it was like a that was a movie already and stuff like that but I saw it and I was like this is a great this is a really funny film and a lot of people don't talk about that as one of his great films I think it's I think it's up there so Michael less than the others you been fortunate enough to hang out with Adam Sandler here and there I'm so I'm so **** jealous I'm not like best buddies with yes we know each other we're Mutual we're friends how much fun is it to be in that guy's crew do you think I mean look I you know um I the best look he's he's the nicest guy in out there him and Tom Hanks are probably the nicest people we need Tom Hanks well but let me tell you Adam Sandler I remember I just in the movie Sorority Boys I don't know if anybody who saw that but everybody saw I love the movie had a great stop it's not a big deal it was a deal",
      "start": 4627.92
    },
    {
      "text": "let me tell you Adam Sandler I remember I just in the movie Sorority Boys I don't know if anybody who saw that but everybody saw I love the movie had a great stop it's not a big deal it was a deal but it didn't do well in the box office and it was like two nights later DVDs out there it is somewhere no I mean I mean out there in the living room we're going to watch it later Christine's favorite we're going to get Alexis back over we're going to watch it don't worry we won't take your face we're hoping you never leave they're going to wear my skin help me the camera's not even on Sandler Sandler comes up to me and I was at some party he was having a one of his parties and I had never met him and he tapped in my shoulder and goes hey you were really funny in that movie and I go what what and he goes you're were really funny in that movie you guys were really funny I really I enjoyed your character and everything and I go it made my life and he sat there and talked to me and I could tell",
      "start": 4666.92
    },
    {
      "text": "he goes you're were really funny in that movie you guys were really funny I really I enjoyed your character and everything and I go it made my life and he sat there and talked to me and I could tell he was like doesn't matter it didn't do good there's people out there is going to freaking laugh at it people are going to like it doesn't matter what everybody else says were you like please put me in Grownups 3 I mean well that time this was years ago and then throughout the years we started talking when I see him places we'go that and then I did a show for him called Breaking In which didn't last very long for Happy Madison and then after this last movie I got a call and goes hey I'm Adam Sandler he's like hey buddy I just saw a freaking trailer for your movie Back in the Day man it's funny stuff man can you get me the movie get me a copy you're like yes you can have a copy and I brought one to the office hung out with him for a while saw the movie called me the next day him and his",
      "start": 4707.12
    },
    {
      "text": "stuff man can you get me the movie get me a copy you're like yes you can have a copy and I brought one to the office hung out with him for a while saw the movie called me the next day him and his wife watched it and he talked about the movie and the scenes and the characters and made my life that is awesome honestly if you ever hear anything don't ever talk **** about s nicest guy talk next time you see next time you see him you want to win more points with him you show him a episode of a conversation with Colin where Colin defends the hell out Adam s oh he's my's yeah that that's what we had a conversation about this and I I **** I think Adam Sandler is like an American **** treasure like like really like I'm not even being like fous like really one of the great comedians in film like he made a movie called 51st Dates yes I saw it I saw I thought was going to be stupid I'll be honest with you it's going to be another I cried I cried at the end of that film it was so good that's",
      "start": 4745.36
    },
    {
      "text": "he made a movie called 51st Dates yes I saw it I saw I thought was going to be stupid I'll be honest with you it's going to be another I cried I cried at the end of that film it was so good that's what's so great about Adam Sandler is he just kind of gets you you're like this guy's so has he made some of the sometimes people say some not all his movies are going to be the look there A lot of times they're family oriented they're not for everybody you know like my movie Back in the Day isn't for everybody it's for certain people it's for 13-year-old boys that's and 18-year-old boys and 40y old guys like us but it's for it's for women there's some some romance but yeah it's for a certain no women and no women watch this show it's okay you got the target no there's like according to the YouTube demographics we have 5% women watching this users but Colin I'm sorry I interrupted you no it's okay that's what you do all the time I don't really care I never noticed that people tweet you that",
      "start": 4783.92
    },
    {
      "text": "demographics we have 5% women watching this users but Colin I'm sorry I interrupted you no it's okay that's what you do all the time I don't really care I never noticed that people tweet you that but I really don't see it uh but uh I really I think Adam like yeah like you're right because he set such a a strong Cadence for himself on SNL and then with his first movies that were really strong and that you can't it's hard to you know for him probably to surpass that that the success he had suain yeah and but I think but like you know we was remember That's My Boy or whatever what are you doing I heard by the way I haven't seen it I'm just cleaning up the spill I had I'm but let me tell you something you're naked uh do you know that naked I'm just sure that's my boy I haven't seen yet but my brother swears by it he goes watch it the first time you're like ah the second time he goes it's hilarious you want to hear a story about That's My Boy I was going to say do you want to hear Colin",
      "start": 4826.92
    },
    {
      "text": "my brother swears by it he goes watch it the first time you're like ah the second time he goes it's hilarious you want to hear a story about That's My Boy I was going to say do you want to hear Colin story I want hear a story about That's My Boy no cuz Greg had some buddies over from when he went to college in Missouri whatever and we we were on you know I don't know what the **** we were watching something on PlayStation where we can you know buy our movies and that was on there and I like which I watch store we watch we watched the trailer I didn't know if it was like Voodoo or something we watched the trailer and I was laughing I'm like this looks really funny and everyone's like oh we don't want to watch it what did you end up watching instead Greg Rock of Ages he watched Rock of **** Ages instead of Adam Sandler movie The Singing movie you made a bad mistake I it was majority rule I want that on I want that on my I on the record I still want to see that movie cuz I think it",
      "start": 4864.96
    },
    {
      "text": "ages instead of Adam Sandler movie The Singing movie you made a bad mistake I it was majority rule I want that on I want that on my I on the record I still want to see that movie cuz I think it looks really fun we should watch it tonight we'll keep drinking majority I'm going to bed what about did you guys see the film Little Nicky not one of his best there who I was like eight when I saw that funny when he gets hit in the face with the shovel oh my God here's what I want to put out there I I don't think Click gets enough credit Click was go walking there you go yeah walking was in it and great you're talking be you're talking about tearing up and stuff when he tear up when he dies at the end and stuff or he's about to die was good he has such an unassuming really die he has such an unassuming way about him and that's what that's what's so powerful about translates he's just a good guy he aweet sweethe and it comes through comes through every time yeah Ag and he's he gets a lot of",
      "start": 4898.04
    },
    {
      "text": "way about him and that's what that's what's so powerful about translates he's just a good guy he aweet sweethe and it comes through comes through every time yeah Ag and he's he gets a lot of **** from people lately people think he's falling off I think he's **** awesome and he's he's like he's up there he's really up there with like people like Rodney Dangerfield for me like just dudes that are like **** funny when you think about Back to School or Catty Shack like those are iconic movies and yeah he did something maybe like like Ladybugs later on that movie is funny too Ladybug's funny too yeah I've never seen it I should Ladybugs is a great you probably get some new impr ladys yeah with riding vfi yeah and Jonathan Brandis yeah so manytimes my favorite line though from uh Rodney danger FS K Shack hey Wang it's a parking lot what are you taking pictures for my my favorite somebody stepping a duck my favorite my favorite uh line for you could you could do about me like you know",
      "start": 4939.28
    },
    {
      "text": "FS K Shack hey Wang it's a parking lot what are you taking pictures for my my favorite somebody stepping a duck my favorite my favorite uh line for you could you could do about me like you know it's my friend Wang no offense whatever my friend Wang no offense hey I'll take some of the lady T's six of those 12 of these oh my God it's so good is Dangerfield's best film looks good on you though uh yeah I love Back to School too huge back back school is great trip dad you got to be careful she'll flunk you flunk me flunk her Sam that was like Sam Kennedy's last movie too right who's Sam Kennedy the the oh yeah God he was so good who's the who's the young the uh Kennison is that his name that Sam Kenn I was gonna say then he went to work at IGN Sam K he when he gives the Vietnam War speech in this class pulls the **** desk out and throws it hor so good it's so good when she say you want open the window crack that D Tim get over there come on Tim Chop Chop remember when danger says hey I",
      "start": 4976.88
    },
    {
      "text": "this class pulls the **** desk out and throws it hor so good it's so good when she say you want open the window crack that D Tim get over there come on Tim Chop Chop remember when danger says hey I was wondering if you like to go on a date she says uh I have class how about tomorrow I have class why don't you call me when you have no class it's so good he's so good he's so good it's old school humor I like you know for the longest time I didn't get the joke where he's like an hour ago I'm sweating my dick off you don't even look sweaty though he looks at the picture and he goes here's you here's him what's with the **** and I didn't get that joke for the longest time hey what's with the **** god dude the impression is perfect oh God CH everybody gives Chevy **** especially now who gives chvy **** the cast of Community community he's a racist he's **** comedian is what he is it got awkward no no no he's not a racist my top like five on my top but I I honestly think he's one",
      "start": 5029.48
    },
    {
      "text": "gives chvy **** the cast of Community community he's a racist he's **** comedian is what he is it got awkward no no no he's not a racist my top like five on my top but I I honestly think he's one of the great look Catty Shack flesh lean into that seems like all times I mean this guy is this guyy is one of the to me he's one of the best he was an inspiration for me chy I know he gets a hard time but he's look he's probably not an easy guy these old the guys get older whatever I love him I still love Bill Murray and I know that's not like a a minority opinion but I just we're not talking about him we're talking about com watch oh my God great how great is he in Zombie talk about a movie where I never knew Bill Murray was going to know right right BM they show up at the BM and I'm like **** you whoever wrote that genius genius but by the way best zombie movie ever let's go right now oh **** now now you in my wheelhouse okay let's go bab I'm going to go Sha of the Dead love great",
      "start": 5075.96
    },
    {
      "text": "you whoever wrote that genius genius but by the way best zombie movie ever let's go right now oh **** now now you in my wheelhouse okay let's go bab I'm going to go Shaun of the Dead love great choice great choice not mine not yours okay all right I'm going to go Dawn of the Dead the Original even though I do I do I do love the Sarah SN one yeah every time that comes on I Sarah I James Gunn I'm like this is so this is so good he did such a good job with this go ahead no let's go around Tim zombie movies I think Shaun of the Dead it has to be I don't know I'm thinking like would you count something like I Am Legend or something as a zombie movie I've really enjoyed that movie very much a great movie what are you gonna give me I'm gonna give you a hint Dan O'Bannon is that an actor he he co- wrote or wrote Alien oh and then his next movie was a little movie Evil Dead no called Return of the Living Dead do you want a party let me tell you something God that such a fantastic mov funny and",
      "start": 5127.04
    },
    {
      "text": "wrote or wrote Alien oh and then his next movie was a little movie Evil Dead no called Return of the Living Dead do you want a party let me tell you something God that such a fantastic mov funny and creepy and cool and it's like yeah the Mor's open Ernie's there in 25 years I couldn't you Trust the B I I was in this movie IR Legend years ago yes you were that and I stole a the Cadence from the guy in there he goes well typical Army **** they brought the bodies here you want to see him want to see him and the phone rings and I did like something when I'm telling the story anyway they knocked on the door in urban legend no one ever knew that but the director goes are you like there's something about when you say that it reminds me of something I go return to the living he goes no he goes do it you got to do we were the only ones that cared but Return of the Living Dead if you've never seen it's such a fun phenomenal movie it's a great I own that DVD I love check out urban legends that",
      "start": 5174.84
    },
    {
      "text": "it you got to do we were the only ones that cared but Return of the Living Dead if you've never seen it's such a fun phenomenal movie it's a great I own that DVD I love check out urban legends that movie was actually really no not Legends Legend urban legend the first one however I was in there you go that was fun Jared Leto and who was the who was the I don't want to spoil it for anyone but the um what was her name Rebecca Gayheart God so hot she was hot yeah she was hot still marri still married to Mr M what's his name g ad I don't know I haven't talked to her in a long time oh man she was gorgeous she was yeah she was she was I haven't seen her in a long time she was in some TV show for like that only last a season I can't think of it oh yeah she looked like she she was just look great I was in college has anyone else here seen Return Of Living Dead no no I know well a bunch of people at work hadn't either and I a bunch of horror fans and I brought it in one time and showed them and",
      "start": 5236.12
    },
    {
      "text": "was in college has anyone else here seen Return Of Living Dead no no I know well a bunch of people at work hadn't either and I a bunch of horror fans and I brought it in one time and showed them and it's like that you know it's like so campy but awesome and scary at the same time all you need to know about returning to Living Dead is that there's one character who is naked it's a girl naked the entire time so they have to put a pasty over her vagina cuz it wouldn't couldn't show in as a child go is that what I think I've never SE seen what that might be is remember when they're like on the radio he's like wait a second something's coming and it's just a wave of them and like she you remember she's like you know my bigest fear is a bunch of old men and they're eating me aever she I have this is the one movie I've never seen oh my God we got to watch tonight doesn't make any sense it's like you you have no pulse you have no uh you mean the movie aren't but yet you're talking what are",
      "start": 5276.72
    },
    {
      "text": "this is the one movie I've never seen oh my God we got to watch tonight doesn't make any sense it's like you you have no pulse you have no uh you mean the movie aren't but yet you're talking what are you trying to say man that we're dead well you're obviously not dead but oh man you got itend more paramics send more paramedics great movie oh it's a good movie so **** good last comparison Alien or Aliens Al Alien somebody today on we were doing we recorded a Games Scoop today and I've never heard this cuz I'm I like the Alien movies fine I haven't watched them recently they were talking about the fact the original movie is a horror movie and the other one is an army movie no they're both horror movies I think they're both horror movies I from what I remember sure Alien is scarier and better Aliens is kind of fun it's definitely like a com more of a comedy horror but even back when I saw for the first time as a kid Al the in scared the **** out of me too",
      "start": 5321.44
    },
    {
      "text": "alien is scarier and better Aliens is kind of fun it's definitely like a com more of a comedy horror but even back when I saw for the first time as a kid Al the in scared the **** out of me too both them I mean and I heard that this this could be you know like kind of like you know thank you for throwing it back that way sorry okay this could be a myth but when James Cameron pitched a sequel to Alien he went up in a chalkboard in front of the studio supposedly there's the heart of ocean it said alien and he just went over and went and put an S like I hope that that's true they're like genius is the movie he's a genius Aliens St aliens I mean I heard that that was uh that was true but I'll tell you what that alien the first mov I mean oh let's let if we're going are we ending this a little bit but anyway let's let's best taglines in the history of Cinema good Lord whatever you can remember Aliens tagline was it Aliens that was no in space no one can hear you scream that's one of the",
      "start": 5376.52
    },
    {
      "text": "bit but anyway let's let's best taglines in the history of Cinema good Lord whatever you can remember Aliens tagline was it Aliens that was no in space no one can hear you scream that's one of the best ones ever one of the best ever made but I think Nightmare on Elm Street is better which one was that if Nancy doesn't wake up screaming she won't wake up at all that is good also an excellent movie Jaws see it before you go brle guidance who suggested don't see that's the thing they don't they don't say the taglines anymore they should I know right what do you think of this whole thing where they're they're doing they they've petitioned now to shorten trailers and take out so much plot elements did you see this story this week There's a week there was a story this week cuz tril trailers are ruining **** movies so where you watching like I feel like I've seen everything I don't want to see that they're trying to scale them back make him shorter show less how about this I'm going to",
      "start": 5426.56
    },
    {
      "text": "are ruining **** movies so where you watching like I feel like I've seen everything I don't want to see that they're trying to scale them back make him shorter show less how about this I'm going to give you a movie you have to give me the tagline it's not no it's going to be you're going to make you're going to make it up go to Nick first Nick be fun so here's where we're going to go first we're going to go Mr. Deeds good Lord is that it no no no Mr. Deeds good lord well go for it that was going to say Mr. Deeds oper man gets Rich wasn't that his name on Saturday Night Live did he do the oper boy oper was pizza man would have been a better one for that one the pizza shop m these is tough isn't it is good what about want to do horror movies instead yeah let's do horror movies let's do horror movies uh Strangers The Strangers what we're all good now all of us have to do it we have to top it see get the best I have no idea so hard on the spot just just anything that comes to mind",
      "start": 5468.88
    },
    {
      "text": "do horror movies uh Strangers The Strangers what we're all good now all of us have to do it we have to top it see get the best I have no idea so hard on the spot just just anything that comes to mind you have you know you won't know who hit you okay that's it I mean he had to do something off the top of his head be careful who you meet strangers you won't know where they come from or where they are but they'll find you in your own home The Strangers your parents are next door can I change mine no you can change yours go ahead just I want to change it to mom always said not to get in their car that's it I want to change mine too if you sit on your hand that you usually jerk off for five minutes and then jerk off with it the strangers The Strangers that's how that is yeah both both hands since is it's plural this is a stranger since it's plural it's both what you got from strangers what do you English strangers strangers the strange that's all I got had the most time to think okay I got",
      "start": 5518.16
    },
    {
      "text": "is it's plural this is a stranger since it's plural it's both what you got from strangers what do you English strangers strangers the strange that's all I got had the most time to think okay I got nothing I he he's got like a **** paragraph for his tag I'm making it up give you throw out a movie now and he has to we have to start over all right let's do this one ready you like this game this is fun yeah Big Trouble in Little China this is so hard to you that's really hard because I don't think I've ever seen it you've never seen Big Little China go home right now and watch that I mean when you get back to LA it's on Netflix Big Trouble in Little China a head explodes in this movie true true story marketing it's all marketing Big Trouble in Little China they should have made a sequel in the 80s because they should have made a sequel Big Trouble in Little China who says your title can't be long there you go so stupid give put out throw out a horror movie Nick throw out a horror movie",
      "start": 5583.48
    },
    {
      "text": "the 80s because they should have made a sequel Big Trouble in Little China who says your title can't be long there you go so stupid give put out throw out a horror movie Nick throw out a horror movie Evil Dead all right go ahead col Evil Dead as did you see the Remake that one's kind of tough he doesn't do remakes Nick you see REM no I didn't actually see we saw we we interviewed the director Alvarez and I got him to watch Nashville a great ABC Drama he ad that was good and we interviewed the woman and that they made me want to watch that movie and I was so motivated I still haven't watched it almost a year later oh good good but I watched Back in the Day cuz I love you last night take off Jack H it's real hot get why we can wrap it up if we want we should wrap it up wrap it up it's getting hot as hell few more minutes a long time oh wow we have gone over five more minutes when it's 1:40 we're done we'll go five minutes let's go we never col what was your topic do you have a quick",
      "start": 5639.12
    },
    {
      "text": "hot as hell few more minutes a long time oh wow we have gone over five more minutes when it's 1:40 we're done we'll go five minutes let's go we never col what was your topic do you have a quick topic you want to go I the topic I thought about I don't know if you guys want to talk about this is if it's just real simple it's real simple out if you have five senses you had to just cut one out oh **** what would it be smell give give me all the senses real quick well touch taste smell sight and hearing right smells stupid no but smell is most of the way you taste food see my my my then that's not okay my answer is super boring I'm going to say smell cuz I already have a hard time smelling touch taste sight hearing and touch what the other one true story when you when you touch taste sight hearing smell smell you already cut one out you didn't even know I'm going to go with question I'm going to go with smell also because as a for a long time I smoked cigarettes and a little known fact",
      "start": 5693.88
    },
    {
      "text": "hearing smell smell you already cut one out you didn't even know I'm going to go with question I'm going to go with smell also because as a for a long time I smoked cigarettes and a little known fact about smoking cigarettes it makes you look really Co it does maybe to some circles it is that but actually hurts your sense of smell might be your sense of smell I want to be touched yeah I want to see you want see you want hear I want to feel I want to hear but I don't necessarily need to smell you smell stank ass breath you need that now oh you stank ass smell you don't need it the thing about smell yeah is like first off I already have a trouble smelling that's why like hot foods I think and then if I couldn't smell at all I couldn't taste that much wouldn't I just eat healthier maybe everything tastes like Mo balls anyway might as well eat carrots and I love broccoli already come on you're tell if I can't smell things just don't taste good think about when think about when you're",
      "start": 5735.52
    },
    {
      "text": "everything tastes like Mo balls anyway might as well eat carrots and I love broccoli already come on you're tell if I can't smell things just don't taste good think about when think about when you're stuffed up does your when you're sick does food taste as good you taste like the core things you taste like sweetness and saltiness and stuff like that but you don't taste like the Nuance of the food next time you go to eat something plug you but it's got to be smell right if simple as that yeah wow if I wasn't Lex Luthor in the new movie who should be the next Lex Luther Brian Cranston no that's too easy well here's why it shouldn't be cuz I think he's a genius I **** love him he's badass he's already bald so everybody sees him and they're going to so there's Breaking Bad as that guy if he had hair it'd be different he was really good in the new the the remake of Total Recall listen I think he's a genius I'm never going I'm saying that you I thought about he'd be great but then I was",
      "start": 5775.24
    },
    {
      "text": "had hair it'd be different he was really good in the new the the remake of Total Recall listen I think he's a genius I'm never going I'm saying that you I thought about he'd be great but then I was like no it's too easy it's too easy I thought and now you've kicked off a conversation I'd love to have with you for the next eight years but I thought Kevin Spacey was a great pick is Lex right I have a lot of problems with Superman Returns it mainly boils down to being way too much super you were you were when that movie came out right or was that that's 100% there was a great story where you came up to him in one and he's like oh my younger Dumber self or something and you're like oh the old are fatter me yeah or something like that I said I read about them and I also said something I go I go I said ah there he is hey if you need to ask me any questions on how to do it like joking because we've worked together he's like oh **** you Rosen bomb",
      "start": 5819.44
    },
    {
      "text": "he was being interviewed by a bunch I go I go I said ah there he is hey if you need to ask me any questions on how to do it like joking because we've worked together he's like oh **** you Rosenbaum you dick I can play this **** character I'm an actor damn it he does this whole **** thing with this why do you why do you specialize in the most obscure types of impr I remember I worked with him once give me House of Cards I haven't really seen oh my God you have to watch it so good he goes down on girls he does once there's one scene where he do that True Detective also really really good haven't watched it yet McConaughey and uh Woody Harrelson on doing TV yeah that's a pretty awesome group right there so good who would be a good Lex Luther Chandler as Lex Luther full circle there you go how about Don Cheeto as Lex Luther I have down no but I will take Idris Elba's Bond any day are you familiar with Idris Elba I know yes love him I would do I would do him as Bond that sounded bad because",
      "start": 5857.16
    },
    {
      "text": "about Don Cheeto as Lex Luther I have down no but I will take Idris Elba's Bond any day are you familiar with Idris Elba I know yes love him I would do I would do him as Bond that sounded bad because your wife really likes him my wife loves him who'be a good Le I think the Lex Luther whoever it is has to have an intensity that is just I want to see him just explode with real unadulterated Just Jared Leto Insanity no oh I love Jared let let me tell you though every actor that comes the actor that keeps coming to mind with that ferocity Michael Rosen no is I mean they've been talking about him is it's probably Walken Phoenix wow I love Phoenix I could be intense but I have to say he's already done Batman but Christian Bale's so good he's so intense that guy that'be crazy be crazy if they did Christian Bale be cool that'be it'be amazing why can't see people don't think outside the box oh he play we can't cross pawate yeah you're right 100% we can't do that this is the whole problem with",
      "start": 5908.04
    },
    {
      "text": "Christian Bale be cool that'be it'be amazing why can't see people don't think outside the box oh he play we can't cross pawate yeah you're right 100% we can't do that this is the whole problem with comic book movies in general why why we get into a big problem right comic book fans like myself are used to a million different story lines I can totally you can give me Kingdom Come on I'm like I understand this is a universe all to its own it doesn't matter but you give somebody a new Spider-Man movie like how does this tie into the Toby Maguire it's like no it's not it's different it's not the **** same you know what I mean and you have to spell that out how about get the best guy for the job right no 10 0% yeah that's it period period I like that who else though I can't think of anybody else I'd pick I really can't be fun how did how did you feel about the Affleck news a being Batman look I mean here's the reality every he's baffled everybody I mean everybody could sit there and say oh",
      "start": 5958.4
    },
    {
      "text": "I'd pick I really can't be fun how did how did you feel about the Affleck news a being Batman look I mean here's the reality every he's baffled everybody I mean everybody could sit there and say oh he sucks he does IT guy is amazing he's super talented great actor he's a great director he can do it all he's got great hair listen he's got something down there that's going to like make everybody go wow Watch What Happens because he's going to surprise everybody everybody's going to go is he Oscar huh was he Oscar Oscar little Pinky the dick oh he Oscar the dick is he's got a lot down there he could do it all he can play a small penis no I'm I'm interested to see how that's going to play out I I want he has my vote of confidence I want to see him succeed in that there was rumors **** there was rumors last week that he might have been bailing out of it those never saw that he that'd be the stupidest thing in the world but I think the people would love that if he did I mean I I I have no",
      "start": 5995.4
    },
    {
      "text": "was rumors last week that he might have been bailing out of it those never saw that he that'd be the stupidest thing in the world but I think the people would love that if he did I mean I I I have no problem I have no problem with but I think I think people are really upset about it's one of those things where I was so young and there was no internet and there was no Twitter anything like that but like I remember when Michael Keaton got cast as Batman and my mom and like people on like what like Mr Mom is going to be Batman **** awesome when he shows up and delivers it doesn't matter you know what I mean it's like when for me when I when I think of what I'm excited to see is Ben Affleck in the cow cuz Ben got such a great **** chin and to see that wrapped with the it's going to bew he wasn't the best Bruce way I think Bale was the best Bruce Wayne but when it came to actually being I don't know I think Christian Bale is phenomenal those movies were awesome yeah especially the",
      "start": 6040.56
    },
    {
      "text": "he wasn't the best Bruce way I think Bale was the best Bruce Wayne but when it came to actually being I don't know I think Christian Bale is phenomenal those movies were awesome yeah especially the third one Michael Keaton I would choose him as the best Batman of all time really if I could trade places with three people in the world number one Michael Rosenbaum just he's kind of a badass Keaton Barack Obama no way I love Barack's about he's coming under a lot of fire these days you know who I would be le of Shriver I would have been I changed position wat do you watch his new show on Naomi Watts is beautiful oh yeah they've been married for a while you know him I'm sure do play sabertooth in the bad guy in Scream the guy prison oh right cotton cotton yes yes he was Big Scream fan he's awesome very tall guy I think I don't know I've never met him creepiest character in the history of Cinema Ted LaVine on the top of that list number one got to be Ted LaVine is so awesome too in uh iny by",
      "start": 6079.64
    },
    {
      "text": "very tall guy I think I don't know I've never met him creepiest character in the history of Cinema Ted LaVine on the top of that list number one got to be Ted LaVine is so awesome too in uh iny by the way that lady the truck tell him the large Mar sh you God you just a wealth the movie knowledge it's all right there you pull that out they used to scare they used to scare the **** out of me when I was a kid yeah I'm trying to think creepy creepy I mean PeeWee was definitely up there Poltergeist 2 you're all going to die in here oh big teeth the guy you know it's a good example of this you'll appreciate this cuz I was thinking about this when you were talking about The Exorcist is that is the **** the I guess Satan or whatever that they just clip in right right right movie like for one frame like here and there you know what I'm talking about oh yeah that **** used to scare the **** **** out of me when I was a kid by the way and I used to like have the tape and I'd be like like",
      "start": 6129.2
    },
    {
      "text": "like here and there you know what I'm talking about oh yeah that **** used to scare the **** **** out of me when I was a kid by the way and I used to like have the tape and I'd be like like did I see that right and then you go back and it's just a f it's like the **** demon for like one frame yeah like it's **** horri Pet Cemetery Zelda when she remember the the real she had spin aif she's like rer you don't remember that she's in the room all locked up the real skinny one Rachel why won't you help me you don't remember Rachel watch I watched the USA version the cut USA Network yeah probably didn't see that part also Isaac and Children of the Corn I'm gonna put out this is something I put out end did an article right scariest movies and all this crap the what my contribution was Michael Jackson Thriller cuz I used to watch the VHS at my uncle's house that had all the behind the scenes stuff on it so it was like it was like a featurelength film but like that whole movie",
      "start": 6173.72
    },
    {
      "text": "was Michael Jackson Thriller cuz I used to watch the VHS at my uncle's house that had all the behind the scenes stuff on it so it was like it was like a featurelength film but like that whole movie creeped me out in the really creepy was the zombie who comes out of the **** uh manhole cover and he's all fat he's like yeah no that didn't I could not do that the Siamese cats and Lady in the **** they were creepy as **** Shining twins oh yeah God those are iconic actually Jack Nicholson in The Shining was pretty damn creepy too but how about all right and here's the last question sure I'm glad you're hosting the show best Cameo in a movie with three lines or less **** me dude oh that's hard I can only think of recent ones uh X-Men First Class you had you Jackman so **** awesome is **** off and then they walk out of the bar not a great Cameo but for fan service are you kidding me how about 30 nights of of 30 Days of Night when the guy goes she goes oh God oh God remember",
      "start": 6216.6
    },
    {
      "text": "is **** off and then they walk out of the bar not a great Cameo but for fan service are you kidding me how about 30 nights of of 30 Days of Night when the guy goes she goes oh God oh God remember the guy has one line I think I saw that was that how about Christmas Vacation package for Clar w Christmas who was the actor Merry Christmas the guy is a delivery SP he he gives him the you know but who was it was who was the ACT what what kind of Cameo is that just a shitty part people are going to hate me best Cameo is Oscar and back in the day then that's in the people are going to hate me for this but I love I love them Shaman and SS loved that Cameo always in always in his own movies with Hitchcock kind of way but but I love that he was actually the guy who who killed Mel Gibson's wife I thought that that was a nice give an I you like Signs say I I I brought that up earlier when talk my horror movies you like The Village say I I that's the best one that's the best one the best one",
      "start": 6262.4
    },
    {
      "text": "I thought that that was a nice give an I you like Signs say I I I brought that up earlier when talk my horror movies you like The Village say I I that's the best one that's the best one the best one that's his best movie that's his best movie one of the reasons the only reason I didn't like The Village because someone actually spoiled the end of that for oh that dude so I was in Philadelphia with my brother seeing it with him and his wife when I was in college and she came at we were like were're watching whatever and she leans over and she's like it's present day what a **** **** she just spoiled it for everyone no no I'm like no it's not it was like 10 minutes in I'm like **** she know that did she spoil oh she just guessed yeah yeah this is my problem watching my movies or in TV shows with my mom when I was a kid she was an adult so she was able she was able to figure out like we'd watch like murder mysteries or whatever and she'd figured out way before me like Damn it Mom",
      "start": 6317.28
    },
    {
      "text": "shows with my mom when I was a kid she was an adult so she was able she was able to figure out like we'd watch like murder mysteries or whatever and she'd figured out way before me like Damn it Mom Indiana Jones or Han Solo Han Indiana Jones in Crystal Skull that's tough any Indiana Jones I am to Empire the I love you I know it's just the best that that was improvised I know and that makes it even then he blew then he blew Darth but that was cut out yeah I saw that special I saw that on on YouTube Just Google blowing Darth Vader tweet dude Indie is so badass though like like Han Solo is **** badass don't get me wrong but Indie is just Next Level well see that's the reason why Indy I would argue that Indy's not badass he did cool stuff but it was always sort of a comedy erors with him like he would always kind of screw something up always screw something up too that was like that was the power of those characters they were soaw who was telling the story though about Indiana Jones right",
      "start": 6363.36
    },
    {
      "text": "he would always kind of screw something up always screw something up too that was like that was the power of those characters they were soaw who was telling the story though about Indiana Jones right w we talking about this recently where like he doesn't change anything in the in the movie he's in what weren't we talking about this where like who was I talking to about this where they were like in in Raiders of the Lost Arc if he wasn't there like nothing would have changed that someone had like brought wasn't I saw The Last Arc if nothing happened if they had have just opened the ark they all would have died no matter what must what he did in that film right it must have been with you I we weren't talking about someone someone was saying something like it doesn't matter and nothing that happens in and Raiders of the Lost Arc matters because nothing changes based on what has one of the most iconic scenes in film history well two the running from the ball and then the diving off oh the",
      "start": 6413.48
    },
    {
      "text": "in and Raiders of the Lost Arc matters because nothing changes based on what has one of the most iconic scenes in film history well two the running from the ball and then the diving off oh the ball the big the big ball then jumping up jumping off the boulder giant rock thing and then he jumps off the ship and he winds up on the submarine and you get that awesome John Williams theme and he's just like look what up and everyone else in the ship's like what up no idea what he's talking about that's how iconic it is yeah that's really you that brought you by G do you you you watch a lot of ESPN then I I assume because you you you do this this Gatorade impersonation do you know never seen it what is Espen no I'm saying I'm saying there's also a female voice that my girlfriend hates where she like it's during PTI and like around the horn where she like sounds so perverted when she's doing have you ever seen wait whoa whoa whoa give me an impression I I can't do it she's you know she's like",
      "start": 6450.04
    },
    {
      "text": "it's during PTI and like around the horn where she like sounds so perverted when she's doing have you ever seen wait whoa whoa whoa give me an impression I I can't do it she's you know she's like brought to you by Guinness Black Logger like she like like it's like all like hyper sexualized and weird and every time my girlfriend she's like what the **** is this woman doing if you ever if you're ever in your house in the afternoon you're watching those show in your house in your house and in your house watch that and and I'm sure you can make an impression out of that I'll be just as good as the Gatorade impression Greg can I come back whenever I want anytime you literally next week or tomorrow I still think you should move here all his PA if I if I quit everything I'm doing and just said I'm moving to San Francisco to do this with you guys this night every day we would do it yeah every day really how much does it pay no zero money oh I'm totally in no we don't have that small money",
      "start": 6494.8
    },
    {
      "text": "I'm moving to San Francisco to do this with you guys this night every day we would do it yeah every day really how much does it pay no zero money oh I'm totally in no we don't have that small money TR no no this is a thank you so much for joining us by the way this has been awesome yeah we're glad you had fun I really like oh yeah you you didn't how many times you use dad you didn't use dad enough they didn't address each other really like with with a need for that you don't want to force it yeah exactly want to you were to do in a world with this show and introducing all of us how would you do it oh Tim looking to you for this one anybody go for give the GameOverGreggy Show the tagline we don't have a tagl lead to this wow that's actually a really good tagline for the show that's perfect it's very dramatic in a world where four friends talk around four mics all roads lead to this and Star Wars and and Indiana Jones I'm going I'm going with Raiders of the Lost Arc Indiana Jones for",
      "start": 6535.96
    },
    {
      "text": "it's very dramatic in a world where four friends talk around four mics all roads lead to this and Star Wars and and Indiana Jones I'm going I'm going with Raiders of the Lost Arc Indiana Jones for this one I got to go with Indie on this one he's the OG no he wasn't the OG he was the the R2 or C 3 you know I'm reading a book rubbish I'm reading those book I'm reading those book he was the **** of the whole series Uncle Owen or a baru Uncle Owen had the your topic from now on because I believe you will do the show with us again it's got to be the either or you just keep going with the either you pick one of the other and that's going to be your thing by the way just as a real quick as S Marino's JW Rler book about the making of Star Wars The Empire and Jedi whatever three books Anthony Daniels apparently was like a big complainer about being C 3PO he was always complaining about hard to Obi-Wan or Yoda oh that's tough Yoda I like how you comment in on what we're talking about just to",
      "start": 6579.32
    },
    {
      "text": "Daniels apparently was like a big complainer about being C3PO he was always complaining about hard to Obi-Wan or Yoda oh that's tough Yoda I like how you comment in on what we're talking about just to derail it Yoda Yoda Yoda Yoda oh you want to be a huge **** oh almost had Emperor right d now I go to Exile kill whole galaxy **** yeah at least OB go live on SW play eat poop Nei neither one went out very well I'll be honest with you I don't want to pick between those no but we just pretend the prequels don't exist and if you don't know that they don't you know that they don't exist name Jar Jar Binks or an Ewok ew ew Gatorade hands down Gatorade I take a **** all right everybody that's another episode of the GameOverGreggy Show remember once a week four to five friends get together each with a topic we celebrate with you Friday you can get the MP3 at gameover grey.bandcamp.com then Monday over on gameover gy.com you can get the YouTube video for free brought to you by not nobody",
      "start": 6625.8
    },
    {
      "text": "with a topic we celebrate with you Friday you can get the MP3 at gameover grey.bandcamp.com then Monday over on gameover gy.com you can get the YouTube video for free brought to you by not nobody don't don't help them nobody has brought game over want you email em me what's your email and I'm not giving my email I'm not giving my EMA so close so close tweet at me Jack Daniels or any bourbon make bourbon tweet at Nick Nick Scarpino you can sponsor the show for $5 ladies and gentlemen thank you so much for joining us follow us all on Twitter buy our t-shirts go by back in the day it's available everywhere right now on all your streaming services Michael we love you a lot I love you a lot and tweet me and tweet all of us we'll tweet you back what's your what's your Twitter what's my twatter what's your **** are you TW M Rosenb 7-Eleven what is 7-Eleven all about cuz 7-Eleven is awesome it's my birthday is it really 7-Eleven I used true St I used to hang out in college at 7-Eleven and smoke",
      "start": 6676.12
    },
    {
      "text": "your **** are you TW M Rosenb 7-Eleven what is 7-Eleven all about cuz 7-Eleven is awesome it's my birthday is it really 7-Eleven I used true St I used to hang out in college at 7-Eleven and smoke cigarettes outside and make fun of people as they walked in you're like stand outside the 7-Eleven that's what I came to realize so I stopped do that well it's like a people aquarium judge terrible oh my God I'm got to stretch hey look here's Oh I thought that was Han Solo it's not no that's a gift from the Skybound Entertainment thank you so much for sending that Walking Dead go by oh my God yes all right I think we're cut I I decided when we're cut [Music]",
      "start": 6727.08
    }
  ]
}
