{
    "id": 216,
    "video_id": "ERDqKW-fyTo",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "The Seinfeld Reunion - A Conversation with Colin",
    "description": "Rumors are swirling about a Seinfeld Reunion. Here's what it should be.\n\nToday's topic was submitted by @_Irish95. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1391522403,
    "duration": 406,
    "transcript_chunks": [
        {
            "text": "Hey , I don't think Seinfeld gracefully bowed out. I think that last episode sucks. What's up, everybody? Welcome to A Conversation With Colin. I'm Greg, and this is my roommate, Colin. Now, sometimes Colin says crazy stuff, so every Tuesday and Thursday, I reach to my random topic pile, pull it out, toss it at him, and we talk it out for your amusement. Fastest intro ever. If you like that, like the video, subscribe to us on YouTube, share us with your friends. Colin, are you ready? Yes. Today's topic of conversation is rumors of a new Seinfeld reunion show. At Irish 995 submitted this. This has been going around . I got to get this up quick cuz I'm I'm going to get it up right away next week cuz the the original rumor was that they were doing something for the Super Bowl, a reunion episode or whatever, because Jerry Seinfeld and George Costanza, AKA Jason Alexander, were spotted at Monk's or whatever diner in New York. Now, I had sent you that link, but I had seen no cameras. However, they were George was dressed like",
            "start": 0.16
        },
        {
            "text": "Seinfeld and George Costanza, AKA Jason Alexander, were spotted at Monk's or whatever diner in New York. Now, I had sent you that link, but I had seen no cameras. However, they were George was dressed like George. Then though this rumor came out that they were filming something there. Then Seinfeld got interviewed, said that, oh, well, it's not it's not going to be a show or what. And then he then it's going to be like a short. And then people were like a Super Bowl. And he's like, it's not the Super Bowl ad. So something is coming. What do you think it is? I'd love to think that it's one episode of the show. Yeah. Uh, you know, we got a taste of this in Curb Your Enthusiasm. That whole season was about the Seinfeld reunion, and I loved it. I **** loved it because I really I really do believe and I I really believe it that I appreciate that they went out on top after like what season nine, yeah, in 97, 98, and that that might have been a smart move for them. But I feel like I feel like they could do it again. I feel",
            "start": 41.8
        },
        {
            "text": "it that I appreciate that they went out on top after like what season nine, yeah, in 97, 98, and that that might have been a smart move for them. But I feel like I feel like they could do it again. I feel like I feel I feel like they can bring that show back for five more seasons and it would be awesome and contemporary and just like those episodes never age, like so too will these episodes never age too. I think that they still have it in them. And I think maybe doing Curb, uh, gave, you know, and we got like kind of an episode in there, um, kind of gave them a little taste of like, well, maybe we can continue to do this and like why if people want it and we feel confident that we can do it, why not just do it, you know? And so I hope that it's like an episode that will appear on, you know, a 22-minute episode that will appear on on the internet or so see that's what he's talking about being a short. And he said like a one-off thing at one point, like if they what I'd love to see them do, he does, you know, the",
            "start": 83.8
        },
        {
            "text": "that will appear on on the internet or so see that's what he's talking about being a short. And he said like a one-off thing at one point, like if they what I'd love to see them do, he does, you know, the Comedians With Coffee thing that's his YouTube show. What if he was just, yeah, just put up a new YouTube channel out of the blue and put up one 22 minute Seinfeld thing or whatever. I don't think it'll be that long. I think we'll get maybe 10 minutes out of it. But and then that thing will explode, right? And show that there's a demand for it. And then maybe we don't get Seinfeld episodes much anymore as if just little, you know, little bits, right, of them at the coffee shop talking about something that'd be awesome. Yeah, I'd love that because I I think, you know, especially, um, you know , Julia Louis-Dreyfus, uh, has really exploded again and like is winning Emmys and stuff for like, yeah, like she she's like doing other things and she's kind of moved on and avoided the type cast, obviously, you know, Michael",
            "start": 126.28
        },
        {
            "text": "uh, has really exploded again and like is winning Emmys and stuff for like, yeah, like she she's like doing other things and she's kind of moved on and avoided the type cast, obviously, you know, Michael Richards had his like racist tirade and, you know, disappeared. I don't know where he is. Jason Alexander has done this. He has a show now with Christy Ali on something. Oh, oh, uh, we saw this billboard for it is on like Style Network or something buried somewhere. And then, um, uh, yeah, like Jason Alexander donees this out the other thing. Jerry Seinfeld did like a few things and he does yet he doesn't none of them need to do anything like the but I I just I would love, you know, I I know that we should be wary of like bringing things back that are awesome, yeah, but that have like gone away and like have gracefully bowed out like that. But I don't think Seinfeld gracefully bowed out. I think that last episode sucks and, um, I think that they could do better and I was in denial for years about that episode.",
            "start": 167.8
        },
        {
            "text": "bowed out like that. But I don't think Seinfeld gracefully bowed out. I think that last episode sucks and, um , I think that they could do better and I was in denial for years about that episode. I'm like, I understand what they tried to do and I liked it, but it was too much. It was silly. Bring it back, you know, put on NBC Thursday nights, Jesus Christ. Can you imagine, you know, and like just jump back in, yeah, exactly where they are like right now, you know, like I would **** love that, man, because I really think that with Curb Your Enthusiasm, they captured the essence of the show. Like they could do it. Like that's an example of, you know, Cheers went away. They can't do Cheers anymore, right? Frasier and all those kinds of things. All in the Family couldn't have been done again. I Love Lucy went away, although they brought Lucy back in different ways. Like when your show is about nothing, it's kind of easy to put it in and when your show is that good, when your show is that much better than everything else and",
            "start": 207.6
        },
        {
            "text": "brought Lucy back in different ways. Like when your show is about nothing, it's kind of easy to put it in and when your show is that good, when your show is that much better than everything else and that show is that much better than everything else, you know, that it's it's so far like it really is in an echelon with like four or five other shows that have ever ever ever aired, you know, sitcoms like in the I Love Lucy and All in the Family and Cosby Show and all that kind of stuff like and it's the top of that heap, you know, that you could do it. Like I want them to do it. I want them to come back, you know, me too. And, uh, I hope that I hope that they do. I hope that this isn't one time. I hope they finally realize that people want this and like an entire new generation of people can come in and appreciate. Well, I mean with with reruns, right? So many people know Seinfeld. I know Tim Gettys always says he's too stupid to understand it that he he misses all the cultural relevance of it, but he's stupid",
            "start": 249.28
        },
        {
            "text": "well, I mean with with reruns, right? So many people know Seinfeld. I know Tim Gettys always says he's too stupid to understand it that he he misses all the cultural relevance of it, but he's stupid. But I don't think there is anything like it's like I really think it's Timeless in the way that I Love Lucy was Timeless. Like I think I Love Lucy's **** like laugh out loud hysterical still. That movie that show was in the 50. That show was over 50 years old, right? And I don't feel like anything in that show wouldn't fit today. Yeah, they don't have cell phones and computers and, you know, it's a little cuter and quainter, but like that show is **** awesome and like they could have, you know, if you could somehow get, you know, you know, Lucille Ball died 30 years ago and and Desi Arnez, whatever, but like if you could have gotten them to do it again in the 60s, like it probably would have worked. They Luc they did they did talking about they changed it's kind of like how the Cosby Show ended, but then they",
            "start": 290.0
        },
        {
            "text": "you could have gotten them to do it again in the 60s, like it probably would have worked. They Luc they did they did talking about they changed it's kind of like how the Cosby Show ended, but then they did Cosby, but it was different. It wasn't yeah, the format was different. Like when they brought when Lucy went to color and they like lived in the house and they had a kid, well, the kid was in, you know, but like it was it was different. It was different. Yeah, Little Ricky and like they could the format was different. They didn't capture the essence of it. I want them to do Seinfeld again where they're all single still and like Kramer still lives across the way and George is still having his issues and Elaine's still crazy. Somebody be married. I I think wasn't someone married in in Curb? Yeah, in Curb I think George might have been married. Well, no, wasn't that the whole thing that I thought George was after his trying to get his wife back like Larry was. Oh, yeah, maybe that's what it was. Yeah, so I",
            "start": 326.0
        },
        {
            "text": "I think George might have been married. Well, no, wasn't that the whole thing that I thought George was after his trying to get his wife back like Larry was. Oh, yeah, maybe that's what it was. Yeah, so I don't know, but I don't know. I I I love the idea of them just long and short of it is that we love the rumors. We want it to be a real show and be back forever. So thank you Irish 95 for your topic of conversation. Ladies and gentlemen, what do you want to see as future topics of conversation? Let us know the comments then make sure you like this video, share it with your friends, and subscribe to us on YouTube. Colin, thank you for your time and your good looks. Ladies and gentlemen, have a conversational day.",
            "start": 368.28
        }
    ]
}