{
    "id": 232,
    "video_id": "HT-GBO0CVQk",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Golden Oreo Fudge Creme Review - Oreo Oration",
    "description": "Are Golden Oreo Fudge Creme cookies the GOLD standard? Eh? Eh? Oreo Oration. Right here.\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/gameovergreggy\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1393423204,
    "duration": 236,
    "transcript_chunks": [
        {
            "text": "[ Music] [Applause] [Music] What's up, everybody? Welcome to another Oreo Oration. I'm Greg Miller, and while you're out living your life and swimming in swimming pools and ponds and whatnot, the fine people at Oreo were making endless variations to Milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video and then subscribe to my channel. Today we're reviewing Golden Oreo Fudge Creme. Now it's still fudge creme week here. We needed to, we putting out some bad review scores. We've brought in some more fudge cremes here, golden fudge cremes. Let's see what we were doing last time around. We got, we got our list here. The Golden Oreo itself scored an 8.5. Now the last fudge creme we did did an 8.5. Uh, Mint Oreo Fudge Crem es before then, we had peanut butter and coconut, both those getting nine. Uh, it seems that fudge cremes are the way to go, but I never can taste the thing, the actual cookies, so let's see if this",
            "start": 0.59
        },
        {
            "text": "cremes before then, we had peanut butter and coconut, both those getting nine. Uh, it seems that fudge cremes are the way to go, but I never can taste the thing, the actual cookies, so let's see if this matters at all. Uh, every Oreo be Oreo Oration begins with the first look. They're open the Visos patented seal packaging. There you go. That's another good, another good presentation, I'd say, right? Don't you think? They're, they're all uniform. None are on top of each other. They're intact. The smell, that's weird. Now we've talked many a time on this show about the fudge condom, the fudge Independence Day 4 alien force field, and I can somehow smell the shortbread cookie inside there. Let's get a look at it. You, you can see it's totally intact. No reason I should be smelling shortbread. I should smell fudge, but there it is. Let's go to part two of the review process, the taste. Okay, I'm tasting it and the sweetness is just climbing. It's going, you know, I can feel the sugar enveloping my tongue. It just broke weird",
            "start": 43.96
        },
        {
            "text": "it is. Let's go to part two of the review process, the taste . Okay, I'm tasting it and the sweetness is just climbing. It's going, you know, I can feel the sugar enveloping my tongue. It just broke weird when I put it down, which is funny. I don't know why I would do that if let's break it in half so you can see what you're getting into. You know, when you're talking about a peanut butter one, you know what you're getting into. Here you have the regular old cream, the shortbread cookie, then the barrier of fudge around it or fudge chocolate around it. Um, taste it again here. Yeah, it's really sweet, a really sweetness overload. Let's see how it pairs with milk. Again, it's a fudge creme. We all know how that's going to go, right? Ladies and gentlemen, you've watched this show before. One, two, three. Yep, nothing, nothing is getting through that shell. That is a shell of pure chaos that won't be stopped. Um, so yeah, don't dunk them in milk. We talked about it before, nothing to twist. Can't do the twist test on them, but as",
            "start": 87.08
        },
        {
            "text": "is getting through that shell. That is a shell of pure chaos that won't be stopped. Um, so yeah, don't dunk them in milk. We talked about it before, nothing to twist. Can't do the twist test on them, but as far as the cookie itself, the final review, it's, it's sweet, it's really sweet, 6.0. Okay, you know what I mean? Like, I don't, I know who this appeals to. I've talked to you, I've talked to you out there before. You know, you golden cookie fans, like this isn't anything special for you and there's no real reason to go out of your way to get it, but if you're looking for a super sweet cookie, it's here for you. Super sweet, 6.0. A little bit sad, the first fudge creme ever to really fall short of where we thought it was going to go, but that's the way the cookie crumbles for the Golden Oreo Fudge Creme. But what do you think? I'm sure you've tried it at home. You've seen it in your stores. Leave your review as a video response below, then like the video , subscribe to my channel. Now here's the big thing, are there",
            "start": 152.56
        },
        {
            "text": "do you think? I'm sure you've tried it at home. You've seen it in your stores. Leave your review as a video response below, then like the video, subscribe to my channel. Now here's the big thing, are there other Oreos out there I haven't reviewed on the show? In the comments below, make sure you tell me what they are, where I can get them so the show can continue, then share the video with your friends. I'll be back every Wednesday and Friday until I run out of cookies to review, but until then, keep on dunking. [Applause] [Music]",
            "start": 199.96
        }
    ]
}