{
    "id": 217,
    "video_id": "PEHxyv358NI",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "Lemon Twist Oreo Cookie Review - Oreo Oration",
    "description": "Is it lemony enough?\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/gameovergreggy\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1391608806,
    "duration": 316,
    "transcript_chunks": [
        {
            "text": "[ Music] [Applause] [Music] What's up, everybody? Welcome to Oreo Oration. I'm Greg, and while you are out trying to decide if you needed snow tires this year, the fine people at Oreo are making endless variations of Milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, please like this video, subscribe to me on YouTube, then share my channel with your friends. Today we're reviewing Lemon Twist Oreos. I'm incredibly excited about these as I love lemon flavor, especially I should I love you know, artificial lemon. Who the who the whoever walks around and saying I love lemon. Let's eat a lemon. Nobody, but the flavor, sure. We begin every Oreo Oration with the patented first look. Oh yeah. Oh yeah. Oh my gosh. Now again, not much diversity. I I said this earlier about gingerbread Oreo in another episode or maybe a future episode depending I want to edit these. Oh, look here. Yeah, a lot of coloring here looks all the same. Let's",
            "start": 0.59
        },
        {
            "text": "much diversity. I I said this earlier about gingerbread Oreo in another episode or maybe a future episode depending I want to edit these. Oh, look here. Yeah, a lot of coloring here looks all the same. Let's get the smell in here, the bouquet. Oh no, I don't smell any lemon. That's what I wanted it to smell all like lemon meringue and stuff, and I did not get that. I'm getting the shortbread cookie. I'm already crestfallen. You can hear it in my voice. That's how it looks. First look continues a cookie that looks just you know, it looks like the shortbread coloring got into the cookie color or the cream coloring. Now we're going to jump right to taste. I'm excited, but I'm already scared. Damn it. I was really oh man, I was really looking forward to these. There's lemon flavor. I wanted it to be like lemon meringue, like I said, I wanted to be very pronounced, but it's almost and this is a Greg Miller problem, maybe not a problem for everybody. You ever get that like lemon medicine your mom would give you like you get",
            "start": 48.72
        },
        {
            "text": "I said I wanted to be very pronounced, but it's almost and this is a Greg Miller problem, maybe not a problem for everybody. You ever get that like lemon medicine your mom would give you like you get like the medicine from the doctor and have some dumb flavor in it and you take the lemon like a pill or something and it it didn't taste like lemon meringue for sure. It didn't taste like lemons, but it was somewhere in between. That's where we're at right now. See how they pair with milk? One, two, three. You know, the cookie softer. That's not a big change. What's weird is that when I was getting ready to dunk the cookie, the the taste of from the initial cookie softened a bit and I actually like the aftertaste better than I liked the actual cookie, which is weird. That's a weird thing to say about a cookie. Let's see how it goes with the twist test here on Oreo Oration. Boom. All right, got kind of screwed up, but not terrible. I mean, it doesn't even matter, right at this point. You can clearly see I don't give a",
            "start": 104.12
        },
        {
            "text": "see how it goes with the twist test here on Oreo Oration. Boom. All right, got kind of screwed up, but not terrible. I mean, it doesn't even matter, right at this point. You can clearly see I don't give a about these cookies and neither should you. So we're done. Final score, 55. I mean, there's mediocre like what I just told you before this like I am totally into fake lemon flavor. I should have been like, but I had them and it's like like and I you can't sell me a lemon cookie cuz again, the Girl Scout make lemon cookies, right? And they're good. They're really good. You got to go back to the drawing board in this Oreo. Again, not bad. That's you know, obviously I don't like it. I would I'm telling you not to buy it, but the cookie's not bad. I'm not like but again, it's just when when do I eat this? When would I be like, oh yeah, that's what I want. I love lemon flavor, but I don't. So that's the way the cookie crumbles for Lemon Twist Oreo like the one we it's like you know, you sign the number one draft pick you",
            "start": 181.44
        },
        {
            "text": "be like, oh yeah, that's what I want. I love lemon flavor, but I don't. So that's the way the cookie crumbles for Lemon Twist Oreo like the one we it's like you know, you sign the number one draft pick you think it's gonna be awesome you put him on the field and he just breaks his leg right away and he's terrible. Uh, but what do you think? Have you had a Lemon Twist Oreo? Let me know. Leave a video responses your video review. I'll talk about it here on the show eventually you'll get to share some YouTube videos with me. Views is what I probably meant, but whatever, I don't even care about this episode anymore. Seriously, it's like man, I'm going to meet say you like Bill Murray a lot, all right? You're like I can't meet oh man, I'm going to meet Bill Murray today and you had to go through a bunch of other people that are similar to Bill Murray to get to him and then you get to Bill Murray and Bill Murray tastes like a lemon pill you had once and you're like no, that's not what I want. Uh, please like this",
            "start": 232.56
        },
        {
            "text": "that are similar to Bill Murray to get to him and then you get to Bill Murray and Bill Murray tastes like a lemon pill you had once and you're like no, that's not what I want. Uh, please like this video, share it with your friends, subscribe to me here on the YouTubes, then let me know in the comments what Oreos I'm missing. I'm sure there's other flavors out here that I need to try. You leave them, I find them, I make a video, you watch it, everybody's happy. I post a new video, a new Oreo review every Wednesday and Friday, so please come back, but until then keep on dunking. [Music] [Applause] [Music] [Appl ause]",
            "start": 274.28
        }
    ]
}