{
    "id": 223,
    "video_id": "PNfvNnWcrHE",
    "show_name": "A Conversation With Colin",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty",
        "Portillo"
    ],
    "title": "Why Valentine's Day Sucks - A Conversation with Colin",
    "description": "Cupid must of shot Colin with the wrong arrow.\n\nToday's topics were submitted by @BrettKock1. Leave your suggestions for future conversations in the comments below.\n\nSUBSCRIBE/LIKE/SHARE\n\nEvery Tuesday and Thursday, roommates Greg and Colin sit down, and Greg throws a random conversation topic at Colin. In return, Colin usually says something crazy and you get a chuckle. Subscribe so you don't miss the madness.\n\nSubscribe to our channel: http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nFollow us on Twitter\nGreg - http://www.twitter.com/gameovergreggy\nColin - http://www.twitter.com/notaxation\n\n#AConversationWithColin Playlist: http://www.youtube.com/playlist?list=PL85130F65C312F61E&feature=plcp\n\nHuge thanks to Nick and Tim for filming.",
    "published_at": 1392300004,
    "duration": 332,
    "transcript_chunks": [
        {
            "text": "I don't care about that. What's up everybody? Welcome to A Conversation With Colin. I'm Greg and this is my roommate, Colin. Now sometimes Colin says crazy stuff, so every Tuesday and Thursday I reach to my random topic pile, pulling out, toss it at him and we talk it out for your amusement . If you like that, like the video, subscribe to us on YouTube and share us with your friends. Colin, you ready? Yes. Today's topic of conversation is Valentine's Day, submitted by Brett One. What do you think? Valentine's is the worst. It's the worst. Why is it the worst? It's this manufactured holiday. Most Arbor Day, Arbor, are you buying presents and like feeling guilty because you didn't do the right thing on Arbor Day? Well, I feel guilty. I'm not, you know, like driving my Prius or whatever probably, but I don't care about that. But okay, go ahead rant a little bit more of Valentine's Day. I'm just saying it's it's a totally manufactured holiday where guys have to feel guilty uh in two different ways, right? Like either you",
            "start": 0.04
        },
        {
            "text": "bit more of Valentine's Day. I'm just saying it's it's a totally manufactured holiday where guys have to feel guilty uh in two different ways, right? Like either you feel guilty because you don't have like a a person to love, whatever, or you know, or like you're single and you kind of feel bad because your friends are doing something about or you have a girlfriend or a wife or fiance or whatever that like you know you have to you know it's just a forced day, right? It's a forced day like to go you have to buy jewelry or go out to dinner and get cards . What are you do for Valentine's Day? I would prefer to do nothing, but like the what are you going to do on Valentine's Day year? Probably bring Steyer to dinner or something like that. Okay, so I mean like you're not buying jewelry, you're not doing any yeah, but like if you don't do it like there's always a guilt trip about Valentine's Day. Yes, yes. I think you get in the right relationship you're fine. Steyer and I are",
            "start": 46.2
        },
        {
            "text": "it like there's always a guilt trip about Valentine's Day. Yes, yes. I think you get in the right relationship you're fine. Steyer and I are. Steyer's going to New York and I'm going to play Titanfall beta. Is that out? No, that's the one that's not confirmed. If Titanfall beta is happening, we're playing the Titanfall beta. I did a conversation about this with McCaffrey and if that isn't out then I'm playing Last of Us which is out on the 14th. Gotcha. Okay, playing video games . Yeah, I just I just feel like you know I like doing nice things for my girlfriend randomly, you know, like I don't like you know I like just little things like meeting for dinner and like going out and you know going hiking or you know like we went to Tahoe that time and you know I like just doing things spontaneously or for no reason and I don't like I don't like birthdays and Christmas is different like Christmas is about family and togetherness and stuff. I totally get",
            "start": 83.56
        },
        {
            "text": "Christmas is about family and togetherness and stuff. I totally get that and like your birthday is an important day you got to celebrate that but I don't like the arbitrary like February 14th you know got to do it February 14th it's like off like this is like such a manufactured Hallmark holiday but what about so I mean but I'm saying if you're in a relationship and you're hopefully finding someone who's with you on points and issues like this then the day doesn't really matter. Yeah, but like but you know my girlfriend and I you know line up on a lot of things and agree on a lot of things we do not agree on Valentine's Day. Oh really? I did not know that. Okay, and I think this getting close to home. Yeah, and I think that Valentine's Day is destructive in a lot of ways. It's like why why do you have to set this expectation for this day? Here's what I think about",
            "start": 121.68
        },
        {
            "text": "think about it. I don't personally care that much about it. I think it's a fine holiday or whatever manufactured 120% but I think that I I I am bad at managing my time. If it's not on the calendar I'm not good about it. This in 2 014 what I'm trying to be better about is managing time and making time for both hobbies that I enjoy but then also oh I should probably have quality time with Christine, right? Where it's not just I'm going to come home and edit YouTube videos all night and come to bed at 1 : in the morning. You know what I mean? Like try to make that not be the case and so for I'm sure there's thousands of people like me, right? Where Valentine's Day isn't so much hey buy something as much hey this is a day where you need to you know take someone to dinner be like hey thank you so much for being my partner",
            "start": 160.24
        },
        {
            "text": "of thing I guess like I I and I understand that but if your girlfriend's all like bring me the Dozen Roses and the giant thing of heart this teddy bear isn't big enough well her but you know yeah no my girlfriend would never do that but like the the the she likes big teddy bears she does she she's a huge teddy bear fan but she you know I don't I I I feel like we do nice things for each other randomly like I do like a lot of nice things for her and she does a lot of nice things for me and she I feel like with her I have like a real part you know like it's like it's not all about her and it's not all about me and it's like not all about the things we do together and like we could always spend more time together she understands that I have hobbies and that we have this side business",
            "start": 202.48
        },
        {
            "text": "s like not all about the things we do together and like we could always spend more time together she understands that I have hobbies and that we have this side business and that like we you know do all these things and you know that I have a lot on my plate and we try to spend you know as much quality time as we can together whether that's just watching a television show or a movie or a documentary or going to a dinner or like doing all those kinds of things and I just don't like that febru you know no matter all these things that we do for each other the time we enjoy each other there's these expect on February 14th and it just doesn't make any sense to me like yeah maybe that's good for bad boyfriends but I'm not a bad boyfriend you know like and she's not a bad girlfriend but like it's all the impetus is on is on me to do the things these things on this holiday and I just don't like it you know like I just I wish that we would all just protest",
            "start": 241.52
        },
        {
            "text": "I just I wish that we would all just protest Valentine's Day and be like this like we're not doing this you know like it's stupid. Well again, I'm shipping Christine New York you could do that. Yeah, play Last of Us or Titanfall if that comes up. Titanfall is going to be good. Yeah, I'm sure it will be six on six multiplayer. Yeah, really worked for Mag having 200. All right, thank you so much Brett number one ladies and gentlemen what do you do for Valentine's Day? Let us know in the comments then make sure you let us know if you liked this conversation then make sure you let us know what future conversations you want Colin to conversate about. Colin, thank you for your time ladies and gentlemen have a conversational day.",
            "start": 277.36
        }
    ]
}