{
    "id": 498,
    "video_id": "rlakjnrpOW8",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Why We Quit IGN - The GameOverGreggy Show Ep. 57 (Pt. 1)",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1420477600,
    "duration": 2487,
    "transcript_chunks": [
        {
            "text": "[Music] What's up everybody? Welcome to the Game Over Gregy Show. I'm one of your hosts, Greg Miller, alongside the producer/seducer, Nick Scarpina. I I'm pissed that you did the head thing cuz I normally do the head thing. What head thing? What did he do? I I always do it, too, but then I forgot. I was smiling cuz this is like a special episode in front of me. And then you do the thing and and then you always nail the the table thing. You never get the table thing. We're bad at it. Hey guys, how's it going? It's a young man's game. The table thing over here. The pride of Long Island. Colin Morardi. It's good to be here. It's good to be here. Go Jets. Yeah, go Jets. I think by this point everyone's listening to this, Rex Ryan is would have been fired. Oh my god, I can't believe it. Over there, the pier one, Tim Yetis. Let him host. Let him host. Godamn. Let him host. Indeed. Um, a lot of things to talk about. Yeah. First and foremost, we don't have jobs anymore. We don't. Did you",
            "start": 1.34
        },
        {
            "text": "there, the pier one, Tim Yetis. Let him host. Let him host. Godamn. Let him host. Indeed. Um, a lot of things to talk about. Yeah. First and foremost, we don't have jobs anymore. We don't. Did you introduce him? Yeah. He's the first one I introduced and then he did the whole thing about 57 episodes, everybody. Time to start drinking. Yeah. Please pour me some of that. Yeah. Now, if there were any ever a time to start drinking, now would be that time. We should all develop an alcohol as a problem right now. Uh ladies and gentlemen, you know, there's a usual rigma roll to how the show opens here. You know, four, sometimes five. We'll get to all that in a second. But I thought, well, maybe we should just do it now. I don't Let's do it now. Let's You didn't know this is the game over Greg show. The idea is simple. Every week, four, sometimes five best friends gather on this table. Each bring a random topic of discussion. No, I didn't get it still. I still didn't get it. Nope. You were",
            "start": 36.0
        },
        {
            "text": "show. The idea is simple. Every week, four, sometimes five best friends gather on this table. Each bring a random topic of discussion. No, I didn't get it still. I still didn't get it. Nope. You were really off on a random topic of discussion for your amusement. If you like that, you should throw us a few bucks over on patreon.com/kindfunn where we put up the episode early and sh talk to you and do all these exclusive things with you. If you don't think we're worth the money or you don't have it, it's no big deal. You can wait and go to youtube.com/kindfunny Monday through Friday to get breakouts until the entire show is posted on YouTube and iTunes. Mhm. There's also a store. Go there kind of funny.com store. We quit our jobs. We don't work at IGN anymore. We did. We did quit our jobs. We're crazy. We're insane. Why were we No, we had great jobs. Yeah, great benefit. We could have been there our entire lives. Uh h we were happy fall. Definitely. Uh and everyone was cool there. And",
            "start": 71.36
        },
        {
            "text": "We're crazy. We're insane. Why were we No, we had great jobs. Yeah, great benefit. We could have been there our entire lives. Uh h we were happy fall. Definitely. Uh and everyone was cool there. And they had not one but two coffee machines. And you know I drank my weight in coffee. They had three. They had three. They had like five coffee machines. I only used one of them. I never used. Yeah. They had the two futuristic spaceman ones and the little Those are my favorite. One of the buttons fell off so I had to actually push the button. Gross. That's really I was like I don't know if I want to do this cuz I press electric but it never did. I just like the sticky feeling inside. Um yeah. So there's, you know, this is going up on the 5th. There's a million other videos we've posted today. We've launched a new channel called Kind of Funny Games. You can go there. We'll be doing all sorts of video game content. There's a new Patreon for that at patreon.com/kind of funny games. Um, it's",
            "start": 105.6
        },
        {
            "text": "We've launched a new channel called Kind of Funny Games. You can go there. We'll be doing all sorts of video game content. There's a new Patreon for that at patreon.com/kind of funny games. Um, it's it's it's such a huge topic. This is your topic. Yeah, this is going to be my topic this week. Normally, jumping on it. Somebody's got to do it. I'll I'll take this one. Normally, my topics, as you guys all know, are from Twitter. Please uh keep tweeting at me, Nick_pino, if you have topic suggestions. But this one's kind of an important thing. So, I thought maybe we would unpack this a little bit. Let's unpack to unpack it. So, from from the start, if for some reason you're running into this, maybe you just downloaded the MP3, you didn't know what was happening, we've all quit IGN. We're sticking with Kindfunn and expanding it to kind of funny games as well. First and foremost, that means that if you're a Kind of funny fan here on kind of funny.com, YouTube.com/kindfunn. However,",
            "start": 143.36
        },
        {
            "text": "sticking with Kindfunn and expanding it to kind of funny games as well. First and foremost, that means that if you're a Kind of funny fan here on kind of funny.com, YouTube.com/kindfunn. However, nothing's changing there. Game over show is way more way more content. Yeah. Get ready to have your brains blown. We had talked about on our initial Patreon that I don't know having your brains blown good. Is that a good thing? That is a great thing. I guess having anything blown getting blown is always good. I'm down. I'm into it. Tim knows. He's young. He's probably gets that every When we did the Patreon, the initial one we talked about if we hit this, we'll introduce a third new show, right? Cuz the first one or second one, right? Jeez, now they all remember it's been a while. We're going to do another new show after follow the leader. And so we didn't say what it was. Nobody ever really asked. They just knew we're good for it. It's a big It's a lot. Now there's a whole bunch of stuff,",
            "start": 178.8
        },
        {
            "text": "do another new show after follow the leader. And so we didn't say what it was. Nobody ever really asked. They just knew we're good for it. It's a big It's a lot. Now there's a whole bunch of stuff, right? So like we're not even really advertising it, but like because there's so many new shows that are titled, but on kind of funny that the site you already know you're getting. Well, here's here's the biggest thing is that we do not work at IGN anymore. So all the things that we're known for at IGN, we can't do there anymore. Yeah. So now we're going to do them here. Yeah. Our way. Yeah. Little lots of little differences. Sure. We encourage them. Exactly. Yeah. That's not That's [ __ ] Um, it pretty much just means more sex jokes, which I'm really happy about. We just did an unboxing today and in it Tim mentioned that that was for sex and I was like, \"What? Oh, we can say that now.\" All right, we can So, yeah. So, things like unboxings. We're going to do a show called Kind of Funny",
            "start": 217.36
        },
        {
            "text": "and in it Tim mentioned that that was for sex and I was like, \"What? Oh, we can say that now.\" All right, we can So, yeah. So, things like unboxings. We're going to do a show called Kind of Funny Unboxings where we unbox things. Yeah. By the way, I This was my first unboxings that I shot with you guys. It was entertaining. Good. Yeah. You know, mostly because you guys are just so much fun. You're having fun doing it. That's the most important thing. I was not having fun doing it. No, your job sucks. No, my job when when you're behind the camera, it's just also your hands are really dry today. I was up in the mountains and I had to put chains on my car for the first time and it was not pleasantly Kevin do me a favor. Go into the bathroom and on the right side of the medicine cabinet. Grab the lubber. Oh, you got some What? What? This is why we're the best. Thank you. So, on top of on top of the kind of funny unboxings, Kind of funny reacts is a thing now. So, okay. Kind of funny reacts",
            "start": 257.52
        },
        {
            "text": "lubber. Oh, you got some What? What? This is why we're the best. Thank you. So, on top of on top of the kind of funny unboxings, Kind of funny reacts is a thing now. So, okay. Kind of funny reacts is essentially So, here's the deal. We got the podcast. comes out every Friday, which kind of ties us down um to being timely. Thank you. Right. So, we want these people whenever there's breaking news and stuff happens, we want to talk about it right when it happens. Hold on. Let's take a second. Kevin, when you're back on the mic, can you hear this? Oh, it didn't see. No, it's not making any Well, now I got too much. Do you want some? Yeah. Oh my. Thanks. Thank you. Don't waste a little bit of expensive. That's what I thought it was going to sound like. I'm going to put this right behind right behind Superman. Superman right by his right by his kind of funny react. Kind of funny reacts. So, what it's going to be is essentially each topic that we do on the show, it's just going to be one",
            "start": 295.44
        },
        {
            "text": "behind Superman. Superman right by his right by his kind of funny react. Kind of funny reacts. So, what it's going to be is essentially each topic that we do on the show, it's just going to be one topic, but it's not going to be part of a bigger show and it'll just go up whenever it makes the most sense. So, if Marvel announces they're making a Marvel versus DC movie and it's coming out next week, we're going to talk about it right when that news drops. Can I tweet that? Is that a thing? No, that's not an official thing. Other thing is like Game of Thrones like when it comes back in April I think probably you know most likely every either Sunday night or Monday or something we're going to have our reaction to that show as it like right when everyone's talking about it. We just filmed the final season of conversation with Colin and so many people were like why are you ending conversation with Colin? Part of that on top of the fact that the game over Greg show is just a conversation",
            "start": 336.4
        },
        {
            "text": "final season of conversation with Colin and so many people were like why are you ending conversation with Colin? Part of that on top of the fact that the game over Greg show is just a conversation with Colin extra people is the fact we knew we were moving towards kind of funny reacts in which like everybody tweets or was wrote in one of the conversation with Colin for the final season is what did you think of the Star Wars trailer right well it's like we wouldn't have to wait for that show to get filmed to have this day to do that today you can just have that as soon as the trailer drops 30 minutes later you can have a conversation with Colin about it that's where we thought that would fit we can call it a conversation with Colin makes him feel better yeah we'll do whatever we'll call him everything everything's conversation with Colin those things start go back and reame the 100 Pence video conversation with Colin Colin. Well, we also said in our in the uh the Patreon kind of Q&A",
            "start": 373.04
        },
        {
            "text": "him everything everything's conversation with Colin those things start go back and reame the 100 Pence video conversation with Colin Colin. Well, we also said in our in the uh the Patreon kind of Q&A live stream thing that we did last week when we were all delirious and it wasn't very good. Uh was that uh really upselling them on subscribing to Patreon? Well, no, it was really good. I'm just being honest. I feel like we were really tired. I wanted to almost do it again for them. So, I do apologize. Yeah, I was so tired. We were so tired after that that I didn't even come. I couldn't We couldn't even make it. That's what I'm saying. I'm just being we're just, you know, I'm not I'm not trying to sell a false false, you know, Bill outcast song. You're just being honest. Sure. Yes. But there was a good reason why we were all tired, by the way. Oh, no. We had we had a we had a lot to do. But nonetheless, during that stream, I said that it's entirely possible that, you know, I was really",
            "start": 403.84
        },
        {
            "text": "was a good reason why we were all tired, by the way. Oh, no. We had we had a we had a lot to do. But nonetheless, during that stream, I said that it's entirely possible that, you know, I was really surprised by why everyone like people like when you when you tweeted that we were getting topics for the final season of Conversation with Colin, most of the tweets were like, why is it the final season of Conversation with Col, not actual topics? So, I said like we're not going to do it anytime soon, but I'm sure that that show will come back at some point. If we really if you if that's what you really want in a couple years, I I hope that's not what you want in a couple years. I hope that we're doing better things and that we can use our production time to make you better shows and that. But since you like it, you know, nothing's off the table. Like Barack Obama says all, you know, all trust and verify. Trust me. And that's the other thing. Conversations with calling it's coming now.",
            "start": 438.72
        },
        {
            "text": "But since you like it, you know, nothing's off the table. Like Barack Obama says all, you know, all trust and verify. Trust me. And that's the other thing. Conversations with calling it's coming now. Yeah. As if we're doing this that means episode one is this week, right? Fingers crossed. That's if I did all my job correctly. I'm sure you did. There's a problem with this bourbon. Pretty good. You a problem with it? Yeah. It's because I broke the So I I don't know if you taste it. I would not drink anything that has a scotch tape for Well, I did I did this cuz I broke I broke the cap when I opened it the first time. But you But the bourbon tastes like scotch tape. You don't You don't You don't taste that. I don't I don't taste the scotch tape. It does like scotch. Taste it. Do you see what he did? Yeah, I see. No, I'm not. Oh, yeah. It does taste like scotch drink. Yeah. Do we want to keep drinking? No, you probably don't want to keep drinking. Stop there. Okay, let's uh we'll get",
            "start": 472.96
        },
        {
            "text": "what he did? Yeah, I see. No, I'm not. Oh, yeah. It does taste like scotch drink. Yeah. Do we want to keep drinking? No, you probably don't want to keep drinking. Stop there. Okay, let's uh we'll get another Kevin. Get the ice bucket in another bottle of bourbon. Yeah, get get another get another of these Buffalo Trace bottles, please. Anyone? Thanks, Kev. Thanks, Kevin. Give yourself a little something good out there, too. Little something. Kevin, the producer, as always, audience, I love the fact that this is our episode saying that we quit our job, do this full time, and this this is this is it. It's chaos. I could not ask for anything. Maybe this is You knew you were getting into this. Oh, oh, yeah. Here's a question. We've gone over this a few times now. I can't remember how all the podcast podcasts are rolling out. Sure. But I'm sure people are wondering why we decided to quit. Well, sure. All right. So, here's what we've done so far to recap everybody here. We've yelled at",
            "start": 508.4
        },
        {
            "text": "the podcast podcasts are rolling out. Sure. But I'm sure people are wondering why we decided to quit. Well, sure. All right. So, here's what we've done so far to recap everybody here. We've yelled at Kevin a lot. We've lubed up Nick's hands. We mentioned how we're changing the current channel. We haven't talked about the new channel. Yes. So, the other big part of January 5th and the relaunch and quitting our jobs is that we've launched kind of funny games, which is where we will actually talk about video games. Like, and this parlays into your question, too. So, why why did we quit? We're doing all these things because we want to continue to have the conversation and relationship we started with you guys, the viewer/listister. And the fact is not many of you, and this isn't to offend you, I've put it together, that when we worked at IGN, we could not talk about video games. We couldn't talk about current movies or TV. Comics was iffy. So like that's why you were getting is is a hot",
            "start": 545.12
        },
        {
            "text": "I've put it together, that when we worked at IGN, we could not talk about video games. We couldn't talk about current movies or TV. Comics was iffy. So like that's why you were getting is is a hot dog a sandwich? No, don't don't you disparage. Is a hot dog a sandwich? We're still giving him that. One of the best podcasts anyone's ever recorded. Uh, but no, that's true. And and let me let's back up for a second. It wasn't that we necessarily couldn't talk about those things. It was just that we we were uh asked not to, right? I mean, that was kind of ID's domain. Yeah. That's another way of saying we couldn't do it. Yeah. Well, you could you could kill Greg right now. No, it's it's out of there. What you're saying No, no. What you're saying is perfectly legit and I' I've always thought totally within IG is right is the fact that you can come over. We'll put a blur up so no one will ever know. You're like, \"Oh, there it If you're a new viewer, first off, this is a [ __ ] show and I",
            "start": 582.08
        },
        {
            "text": "totally within IG is right is the fact that you can come over. We'll put a blur up so no one will ever know. You're like, \"Oh, there it If you're a new viewer, first off, this is a [ __ ] show and I apologize, but also we don't ever show Kevin. What do we need? You didn't. I just wanted the bucket. I mis I misconstrued my point to Kevin, apparently. I want to give that one. It's no big deal. We can make What? What? We We don't want the ice. We want to dump. I wanted the bucket to dump the here for I want the ice. He's got to get up again now. How did you How does How is this so off track? How does this not even Can you pour these into the sink? The It's perfectly good ice. I don't want to waste the ice. What are we going to use the ice for? It just feels like a Patreon exclusive episode. I like that. Yeah. Well, this is what people want. The more laid-back thing. Um, reach, Kevin. You're not They're not going to get the shot. You got plenty. You're Look how mad Greg is right now. If I",
            "start": 621.44
        },
        {
            "text": "like that. Yeah. Well, this is what people want. The more laid-back thing. Um, reach, Kevin. You're not They're not going to get the shot. You got plenty. You're Look how mad Greg is right now. If I go any further, it's going to slip out of my hands cuz I'm lubber dermed up. It's You're going to hand the glass over and then squeeze it. It just shoots out right through your eye. No. To IGN's credit, I agreed with them in their point of why we shouldn't talk about games and stuff over here. We have a job where we get to do that all day long. Why should we go home and do that stuff at a cool company that has a lot of Thanksg The reason the motivation to leave right was the relationship we've generated with you, the kind of funny audience is the fact that we want to have those conversations with you on our own time in our own way. We want to be able to react immediately and not be held to some schedule or be moved around here. And so the fact is that we couldn't talk about games before.",
            "start": 664.32
        },
        {
            "text": "with you on our own time in our own way. We want to be able to react immediately and not be held to some schedule or be moved around here. And so the fact is that we couldn't talk about games before. So we started kind of funny games where we will now be putting up uh let's plays every day. There's you know uh the new podcast that's like the game over Guggy show called the kind of funny We're working on the name. Yeah, I know. We're I think it's going to be called the kind of funny game show. Unless somebody bites me on that. Are you Are you pretty confident? I like Gamecast, too. All right, we we can talk. Game show just seems so game showy. Like whoa. Tell her what she's won. It's a car. It's a Buick. We'll see. Skyllock. It's going to be really good. And it's going to be us talking about video games. I mean, you guys know that a lot. It's what we do. It's what we've done for years. Many, many years is us talking about video games and our thoughts on those video games. And we're",
            "start": 704.16
        },
        {
            "text": "about video games. I mean, you guys know that a lot. It's what we do. It's what we've done for years. Many, many years is us talking about video games and our thoughts on those video games. And we're going to do that every day. Yeah. Every day. I mean, I I I want to say, you know, let me There's something I want to unpack. Wait, before you do that, flip your mic up just to also promote the Twitch thing. The Twitch thing. It's just falling into your neck. It's falling into your neck right here like this. Here. Come to me. Come to Nick. Can I talk amongst yourself? I [ __ ] hate everything that's happening. I can't believe I quit my job for this. Where's We don't even know what we're doing. We got new fancy mics and we don't know how to use them. There's all this room in the table. I can do this now. So, you know, I uh you know, I've been we've been with IGN for a long time and you know, four of us in various ways. Uh and you know, IGN found me as a freelancer when I was 18 and I'm 30",
            "start": 746.72
        },
        {
            "text": "this now. So, you know, I uh you know, I've been we've been with IGN for a long time and you know, four of us in various ways. Uh and you know, IGN found me as a freelancer when I was 18 and I'm 30 now. And so it's been, you know, I was an editor when I was 22 and it's been a long long road, right? And uh I'm very thankful for everything they did for us and very thankful all the doors they opened for us and all the things they taught us and they didn't have to, you know, I wrote a letter to some of the guys where I was just like, you know, you didn't have to do this stuff for me and I'll never forget that you did it for me. You didn't have to open a door for me. You didn't have to give me a couch to sleep on. You didn't have to give me a paycheck. You didn't have to do any of those things. And so I'm very thankful for that. But at age 30 now, I'm not 18 anymore. I'm not 22 anymore. I just don't really want to I don't want to keep doing the same thing over and over again, right? I want",
            "start": 783.6
        },
        {
            "text": "And so I'm very thankful for that. But at age 30 now, I'm not 18 anymore. I'm not 22 anymore. I just don't really want to I don't want to keep doing the same thing over and over again, right? I want to I want to I want to like connect directly to the people that want our content and and and enjoy us and we can do it without the middleman and we can do it in our the way we want to do it and stuff. So there's no we left IGN on the best of terms. Yeah. Totally. And it was a long process. I mean candidly since we're going to let you guys in the event we we made this decision a while ago. Yeah. And uh we just had to keep it a secret from you because we wanted to make sure everything was good and we wanted to leave IGN on the best possible terms and we did that and we wanted to launch with a really tight episode of the game over show that got right to the heart of the matter. Well now I'm getting to the heart of the matter right now. So So we'll we'll forever be indebted and associated with",
            "start": 818.56
        },
        {
            "text": "tight episode of the game over show that got right to the heart of the matter. Well now I'm getting to the heart of the matter right now. So So we'll we'll forever be indebted and associated with IGN and I don't think we would ever have it any other way. Um you know that you know our loyalty to the site is is never ending. We want you to keep going there and enjoying that content whatever. But we think that we can do what we do better on our own. And I think that that's that is why we made this decision. It's a bold decision. We all had totally secure jobs with great salaries and benefits. Like Nick was saying, we had, you know, high stature at IGM. We were we were, you know, pretty well known there. And we we you know, you have to take a risk every once in a while. The more I talk to people about this over since October, the more I'm totally confident that I think we're going to be fine actually because even if even if it doesn't work out, like you would have never known. It's better",
            "start": 854.08
        },
        {
            "text": "about this over since October, the more I'm totally confident that I think we're going to be fine actually because even if even if it doesn't work out, like you would have never known. It's better to know that we're going to fail. comes down uh for me as well, which is, you know, I I loved the job at IGN. I love the people at IGN. I don't think I'll ever not consider that place a home away from home. But when you think about the excitement level of kind of what we were doing there and now what we're potentially going to be able to do, it's just off the charts. It doesn't compare, right? We talked about it 6 months ago. We're like, wouldn't remember that conversation we had like what what would it take for all of us to leave, right? Like let's let's figure out how much we're all making and like let's let's figure out our minimum numbers to walk away. Um, and then we launched a Patreon and saw that there were actually people out there that that would give a [ __ ] if we left. And that",
            "start": 892.8
        },
        {
            "text": "like let's let's figure out our minimum numbers to walk away. Um, and then we launched a Patreon and saw that there were actually people out there that that would give a [ __ ] if we left. And that all that numbers and all that conversation about money just went out the window. And that's the weirdest thing is like we didn't that conversation never finished. It was never like, \"Oh, here's the number.\" We were just kind of like, \"Ah, we're this isn't a thing.\" Like that's not going to happen in a year. I remember saying we're like a year. We'll see where we're at. And then all like I don't even know the exact moment like cuz I feel like it was a little before the Patreon even like that to it for me. I mean like like It for me it was the 100 pound shoot when we I remember I I texted you guys as soon as it was over because it was all you guys who did the hard work on it and like when I walked into that shoot and it was a full functioning production with lights and craft services and like",
            "start": 926.72
        },
        {
            "text": "as soon as it was over because it was all you guys who did the hard work on it and like when I walked into that shoot and it was a full functioning production with lights and craft services and like there was stuff and there it was a set I was on. You know what I mean? And it was like oh my god like this is what I want to do every day. I want to do this and I want to do like how much fun we talk about how much fun we have doing the game over Guggy show to do the game. Like again nobody [ __ ] plugged it like I asked twitch.tv/kindfunnygames. you need to go subscribe to. Every day now, Colin and I are doing a morning show called Colin and Greg Live and it's, you know, at least an hour, if not probably two, cuz we talk a lot. It's us talking about video games and comics and what the news of the day while interacting with chat, while facing off in a game every so often, while having on developer guests like the sitting down and talking about like that is an awesome idea that the Colin",
            "start": 961.84
        },
        {
            "text": "of the day while interacting with chat, while facing off in a game every so often, while having on developer guests like the sitting down and talking about like that is an awesome idea that the Colin came up with that is works so well for sports news that we've never seen for gaming, right? At least not on the level I'd like to think we're on. You know what I mean? In terms of our profile and personality. There are, don't me wrong, what up radio PlayStation. There are people who do live streams like this to talk about it, but like we're going to come at it in a different level, I think, of what we're doing. And the excitement behind that idea behind doing something. I mean, honestly, for all intents and purposes, doing Podcast Beyond every day. We're going to do Podcast Beyond every [ __ ] day. That's exciting. You know what I mean? Yeah. I'm excited about that, too. And and to speak, I know there are people of concern out there. There's so many things we we asked of you already and",
            "start": 1000.4
        },
        {
            "text": "day. That's exciting. You know what I mean? Yeah. I'm excited about that, too. And and to speak, I know there are people of concern out there. There's so many things we we asked of you already and that we we're sending you in all these different directions because we have YouTube.com/kind of funny and then kind of funny games. You go to kind of funny and get all that kind of stuff, you know, Patreon issues and all the kind of things. We have a lot to talk about, but I know a lot of you out there started watching this channel and started watching conversation with Colin and Orioation and Game Over Greggy Show and all these things we've done through podcast beyond and that was that was how we connected with so many of you over many many many years, many episodes. Greg, since episode one, me since episode 98, we just did 376 or something like that. So, God, you guys are crazy. Um, crazy. I'm leaving this show after episode 100. So, wow. Well, you gota we might have overstaid our welcome,",
            "start": 1038.08
        },
        {
            "text": "since episode 98, we just did 376 or something like that. So, God, you guys are crazy. Um, crazy. I'm leaving this show after episode 100. So, wow. Well, you gota we might have overstaid our welcome, but the point is that Greg and I have agreed to do Podcast Beyond indefinitely. Um, and we don't know when that ends. We don't know how how long that goes, but we're going to continue to do Podcast Beyond is kind of freelancers. And it might go on forever and it might not. I don't know, you know, but we we have to figure that out where So, for for now, the podcast exists as it does. So don't don't fear too much there. We've worked that out. But we know that a lot of you are have a great attachment to that show. Arguably a greater attachment to that show than even this show. And and we understand that and we're we don't want to make it seem like we're just like, you know, goodbye podcast beyond because Podcast Beyond is always going to be a part of us no matter what. Yeah. What happens. So",
            "start": 1071.04
        },
        {
            "text": "that and we're we don't want to make it seem like we're just like, you know, goodbye podcast beyond because Podcast Beyond is always going to be a part of us no matter what. Yeah. What happens. So I want to say that as well. The agreement is yeah, we're doing Podcast Beyond and when it's over for us there, we'll give you heads up so you'll know the final episode's coming. So it won't just hit you out of the blue one day that we're not done. Yeah. But I mean, you know, I haven't been in any of those discussions, but from what you guys have said, it's all been pretty, you know, amicable, and everyone's kind of trying to figure out the best possible way that that's going to continue, right? That's good. And that's and that's kind of been awesome, right? Um, you know, big shout out to IGN for being supportive of us. Um, understanding sort of that we need to spread our wings, I guess, is a way to say it. Yeah. By going way smaller, by having way less resources. Um, it's the dream though. I",
            "start": 1107.2
        },
        {
            "text": "being supportive of us. Um, understanding sort of that we need to spread our wings, I guess, is a way to say it. Yeah. By going way smaller, by having way less resources. Um, it's the dream though. I mean, it's the thing. It's like this is what specifically the four of us want. Yes. And it's what we want is to be able to connect with them and in in ways that IGN helped us learn to do, but eventually we just it both of those things can't exist at once. It's either Yeah. And that's true. And we it we did get to a point where, you know, there's just stuff we want to talk about and there's stuff we want to talk about in this format to this audience. Um, and it's just once you you hit that level where you I don't know, you we kind of hit a breaking point where we're like, well, let's just see what we can do. Let's just go take the step, take the leap, see if the fans, you know, or see if the audience, the best friends out there will actually help support us and will be there for us when we",
            "start": 1139.76
        },
        {
            "text": "we can do. Let's just go take the step, take the leap, see if the fans, you know, or see if the audience, the best friends out there will actually help support us and will be there for us when we fall or I guess when we fly. I'm mixing my analogies here or my metaphors. Um, it's what you do. Yeah, I do. God, I'm If you're a new viewer, you get used to it. Uh, and just see how it all works, I guess. You know, that's the thing. It's just exciting and weird. IGN, great place. I've been there. I was there for nine years. I know exactly what every day is going to be. I don't know what tomorrow's going to be like with this group. And that's very exciting. And it's going to be fun. That's the thing. I can tell you it's going to be at least kind of fun. Um, like this weekend, we just went went down to LA. We did a road trip down to LA. We did all this [ __ ] awesome cool [ __ ] We did a Patreon exclusive podcast in the car where we miked ourselves up. And then how much fun was that? That was",
            "start": 1184.32
        },
        {
            "text": "to LA. We did a road trip down to LA. We did all this [ __ ] awesome cool [ __ ] We did a Patreon exclusive podcast in the car where we miked ourselves up. And then how much fun was that? That was awesome. That was a great episode. Up on patreon.com/kindfunn. We just threw a little GoPro. And for the record, everybody asks me this all the time. If you if you subscribe to Patreon at any time, all the old exclusive episodes are there for your watching. And like that, I had so much fun doing that. And then we go and we do one with Dave Fenoy in his backyard. That was awesome. That was Daveoy. And that was just so much fun. And then we do a podcast with Kevin Smith, too. Two his and ours. And like if you're watching this on Monday the 5th, Kevin Smith's episode of the Game Over Gregy Show posts one giant video and audio file tomorrow on the 6th. Then we are on this podcast on Friday, which was ridiculous, by the way, cuz 9th. Yeah. Yeah. Cuz we we came in there originally thinking that it",
            "start": 1218.56
        },
        {
            "text": "one giant video and audio file tomorrow on the 6th. Then we are on this podcast on Friday, which was ridiculous, by the way, cuz 9th. Yeah. Yeah. Cuz we we came in there originally thinking that it was going to be Kevin and Greg were going to talk for a little bit, I guess, on Fat Man on Batman, which weasled your way in. Well, we came in all all charming and good-looking and you were like and Kevin's like, \"What's going on?\" And Greg's like, \"Oh, we're quitting our jobs.\" And Kevin's like, \"What?\" And yeah, he's like, \"Yeah, I want to talk to you about we're quitting our jobs and going out independently.\" Obviously Kevin is has a thing or two to say about doing stuff all on his own uh very successfully. And then he just kind of hit us with why don't you guys that sounds more like a Smodcast thing. Why don't you guys all come on Smodcast? So, we sat around Kevin Smith's like badass Colombian drug lord like layer that he has and talked to him for 4 hours. Yeah. At the end of which",
            "start": 1257.12
        },
        {
            "text": "thing. Why don't you guys all come on Smodcast? So, we sat around Kevin Smith's like badass Colombian drug lord like layer that he has and talked to him for 4 hours. Yeah. At the end of which Colin leans over and goes, \"The entire time I was leaning on a second draft of Clerks that had handwritten notes from Scott Moer on it and there was a picture of Kevin Smith drawn on it from Scott Mo.\" It was unbelievable. I can't believe I ridiculous. When I looked down, yeah, there was this dated January 1st, 1993, clerk second draft. We flipped through and there's just notes and he's like, \"Yeah, that was the one we worked off of whatever.\" Isn't that I'm like this belongs in a museum. Um it belongs in a museum. Hi. But that thing's crazy cuz for me for the longest time people have asked me like what what do I want to do? Like what's the goal? What's my the point of what I'm doing? And I'm always just like I just want to be me. Like I hope that one day my job can be being me. And then Kevin",
            "start": 1292.72
        },
        {
            "text": "what what do I want to do? Like what's the goal? What's my the point of what I'm doing? And I'm always just like I just want to be me. Like I hope that one day my job can be being me. And then Kevin Smith was like dude my job is to be Kevin Smith whatever. And he he did it. He did it. He did what I want to do. He did it. He did it very well. And then like that's what we want to do. And we've been on the path to that for a long time. And that's the thing of at IGN. I will always be a video producer at IGN. I was never going to be Tim Getty's. And also there's just a difference between the the two methodologies, right? Like IGN is a hardcore kind of resource site. Like you go there when you really want to know what's what. We are a little bit less actually I don't even know what we would even consider ourselves, but we're more just like entertainment. I guess it's just entertainment, right? And and that to me is a really really important distinction to make where I felt like there was a",
            "start": 1332.0
        },
        {
            "text": "consider ourselves, but we're more just like entertainment. I guess it's just entertainment, right? And and that to me is a really really important distinction to make where I felt like there was a there's a specific kind of wall that I hit a while back with talking about the things that other people were doing. And now I get to talk about the things that we're doing, right? We're still going to talk about the things that other people are doing as well. But I just feel like now we are creators whereas you know there we were producers and there's a very critics or critics got such a negative connotation. I don't want to use that word, but but yeah, to a certain degree, like we can come here and there's there's that there's that there's not that weight of uh I guess it's credibility that we have to worry about anymore. Um I guess we could just come on and talk and create and have fun. Well, I mean like it's it all goes back to what I always used to talk about when I talk about how I",
            "start": 1368.4
        },
        {
            "text": "we have to worry about anymore. Um I guess we could just come on and talk and create and have fun. Well, I mean like it's it all goes back to what I always used to talk about when I talk about how I wrote reviews at IGN that I wrote reviews in the same way I sat around and talked to my friends about games on the couch where back in Chicago in the basement, somebody would come in, I'd be playing Spider-Man on PlayStation, they'd ask what it was like and I'd tell them all about it. And that's how I wrote reviews for the longest time. And then that's how I went to videos. And then this show is the same or this everything we do, YouTube, podcast, Twitch, whatever. The You're doing a lot of this. You're doing a lot of There's a lot of things happening in the cloud. I don't know if you're aware of the cloud happening right here. I am aware of the cloud. It that's what we do here and we will continue to do, right? Is the fact that we're not breaking the news to you. We're interpreting it",
            "start": 1401.84
        },
        {
            "text": "of the cloud happening right here. I am aware of the cloud. It that's what we do here and we will continue to do, right? Is the fact that we're not breaking the news to you. We're interpreting it with you. And that's the other thing, too. We're not interpreting it in front of you and then doing it out. That's the whole point of the Colin and Greg live show, right? Is the fact that no, we sit there and you we react as it happens. This happens. Kind of funny reacts. to react with you and then we're since we don't have another job, we get to sit in the comments and talk to you about it. That's the craziest thing is forever kind of funny has been our side thing. Like even even like after the Patreon, after all that, it was still our side thing. We'd go to IGN, work our asses off and then come home and work our asses off here and honestly not do it as well as we should have. Yeah, exactly. Now we get to do whatever we want, be exhausted for the game over Greg show. I wouldn't get to",
            "start": 1435.44
        },
        {
            "text": "come home and work our asses off here and honestly not do it as well as we should have. Yeah, exactly. Now we get to do whatever we want, be exhausted for the game over Greg show. I wouldn't get to respond to Patreon messages until Saturday or something. You know what I mean? Like that was a shitty way to be. And that's the other thing of it. You know what I I always talk about it that people used to ask me all the time like, \"Oh man, when do you don't ever leave Ian or when do you think you leave Ian?\" You know, and I I'd always say like, \"I'll leave when I can't give them 120% anymore.\" You know what I mean? Like when I used to sit there and do wrestling videos in the middle of the night, like 2:00 in the morning or whatever. Yeah. And then when I got sick, it gave me a different outlook on like how much work you should be doing. Of course, that outlook came right as I started a second job with this, right? And the more and more we got serious about this, the more and more I could",
            "start": 1466.48
        },
        {
            "text": "on like how much work you should be doing. Of course, that outlook came right as I started a second job with this, right? And the more and more we got serious about this, the more and more I could see that I wasn't treating the kind of funny arm as well as I was treating IGN. You know what I mean? I wasn't putting as much into kind of funny as I wanted to. Yeah. Something has to break down there. You're not going to Yeah. And that was And you know, I think to your credit, to all of our credits, like we weren't willing to sacrifice the IGN gig for this, so this suffered. Um, we would record at 7:00 or 8:00 at night sometimes. Poor Cheryl. Colin's girlfriend would be studying for like to become a doctor and we'd be like screaming about hot dogs and sandwiches and stuff. It's the only podcast we did. It really just a hot dog sandwich. It was a very polarizing topic. Um and yeah, it it it sucks because at the same time too there's so much more creativity that we can put into this thing if",
            "start": 1499.44
        },
        {
            "text": "we did. It really just a hot dog sandwich. It was a very polarizing topic. Um and yeah, it it it sucks because at the same time too there's so much more creativity that we can put into this thing if you just got sleep, you know, and you just had the energy to do it. And and that's the other thing too, you know, I talk about, you know, in the in the olden days when it was just me editing or doing whatever, right? And how much that was killing me or whatever. Then you see it now switched off to where we're all like that where like you're doing follow the leader and follow the leader are these amazing edits that are way like are such a high bar for this channel, but it's also that you're not seeing your wife and you're not getting to go on trips. You're not I'm okay with both those things. No, but yeah, we'll see how all 12 episodes of the conversation with Colin go. But yeah, I mean that's to me it's it's it's hard because I don't think we'll ever uh not work that hard. Yeah. Just now",
            "start": 1534.48
        },
        {
            "text": "No, but yeah, we'll see how all 12 episodes of the conversation with Colin go. But yeah, I mean that's to me it's it's it's hard because I don't think we'll ever uh not work that hard. Yeah. Just now it's nice to be focused on that. Like I I I said this on the Kevin Smith podcast and I'll say it again. If you want to be in production, even online media production, you just got to get used to the fact that you're always working, right? And if you love it, then it's not work. You're just always got something cool to do, right? Like today is Saturday. Like let's be 100% transparent on that. I just drove back from Tahoe this morning after Christmas and I was telling my wife, \"God, I can't believe I have to go to work.\" But then I'm like, \"Wait, this isn't work. This is something I get to do.\" Like, I get to go hang out with three really cool guys and Kevin. Uh, burn. Sick burn, Kevin. I love you, man. You look good today. Look great today. Uh, I get to go do this and I get to go build",
            "start": 1575.36
        },
        {
            "text": "Like, I get to go hang out with three really cool guys and Kevin. Uh, burn. Sick burn, Kevin. I love you, man. You look good today. Look great today. Uh, I get to go do this and I get to go build this thing. And that's that's the other thing we haven't even touched on is like we we helped build IGN for the last nine years. It's good. Like that IGN is a powerhouse. I don't think it's ever going away. Run by great people. Now we're starting from scratch almost all intents and purposes. We're building another brand and that's that to me is just it's ours. Ours cool and it's rad and it's all these people that we that have been with us since the beginning can come with us now to see where maybe I mean we're got to do a live show. We got to do all this stuff. We're on track or on on this amazing path to just do really cool [ __ ] Yeah. It's crazy like I feel like the best advice anyone can ever give and it's like the simplest thing is just do it. It's like how can I start doing this thing?",
            "start": 1613.76
        },
        {
            "text": "path to just do really cool [ __ ] Yeah. It's crazy like I feel like the best advice anyone can ever give and it's like the simplest thing is just do it. It's like how can I start doing this thing? Just do it. just go and try. And that's what we're doing. But even crazier than that for me is the next level of that advice is like whenever you look at someone and go like, I could do that better than you. Instead of just saying that, do it. You need to prove it instead of just saying it cuz that does nothing. And I feel like I've spent a lot of time cuz I I've known for a long time what I want to do. I know I want to be in front of the camera. Behind the camera's cool and I like thinking about all this stuff, but it's like I want to do this. And I remember just sitting there thinking like, \"God, I could do that better. Why is that guy doing this? like I should be doing this and all that stuff. And you know, then it took a while. Then I got the opportunities and I was like, \"Oh [ __ ]",
            "start": 1652.64
        },
        {
            "text": "\"God, I could do that better. Why is that guy doing this? like I should be doing this and all that stuff. And you know, then it took a while. Then I got the opportunities and I was like, \"Oh [ __ ] maybe I'm not that good at it.\" Then you learn a bit, then you get better, then you get better. And now I'm just like, I'm doing what I should be doing right now. This is what I should be doing. This is what we all should be doing. And this is awesome because nobody can tell me no. And that is one of the great things. I know we can vote. Yeah. But we we very seldom tell tell Tim no on anything or or any of us no for that matter, which is good. Uh yeah, man. I mean, that's just the way it goes. Like, it's just way it is. I don't know how much more I want to unpack on this subject. I could talk. You want to start packing it back together? Do you want to put it back together? Well, I I'll say that, you know. Yeah. I'll say that kind of funny is going to be better now. You're going to get much",
            "start": 1689.04
        },
        {
            "text": "You want to start packing it back together? Do you want to put it back together? Well, I I'll say that, you know. Yeah. I'll say that kind of funny is going to be better now. You're going to get much more of it on kind of funny and kind of funny games is a new thing. You're going to get way more of it on that. You're basically going to get podcast Beyond Every Day. Yeah. Uh Game of Gregy show is now going to be better because we're not going to be [ __ ] tired all the time. We're going to have better ideas for new, you know, new shows. What were you going to say? What I was going to say is like Game of Gray Show is going to be better because now we can talk about movies and comics and TV shows whenever the hell we want that too. Like the thing is like what you guys don't know is that we've been so limited just on on this channel. Um because we couldn't talk about those things. So there was so many times we'd be sitting there like what are we talking about tonight? It's like oh I I",
            "start": 1724.96
        },
        {
            "text": "been so limited just on on this channel. Um because we couldn't talk about those things. So there was so many times we'd be sitting there like what are we talking about tonight? It's like oh I I want to talk about this. The new Star Wars trailer just dropped and it's like we can't talk about that or it's like oh this should we let's talk about whatever it is in video games. It's like m it's close. I don't think we should do it. So, we just don't do it. So, instead, we talk about other stuff, which is great, but it's like now we get to talk about what we want to talk about at that moment. Not that we still don't want to talk about Disney princesses. You want to have sex. No, we're always going to do that. But that's the thing is though, we couldn't really talk about the new Disney movies. You know what I mean? like we couldn't it's this goes back to what I was telling the Patreon people in the Patreon hangout is like if you were first off one of the 80,000 subs to kind of funny or if",
            "start": 1758.8
        },
        {
            "text": "You know what I mean? like we couldn't it's this goes back to what I was telling the Patreon people in the Patreon hangout is like if you were first off one of the 80,000 subs to kind of funny or if you're one of the people on the you know Patreon beforehand we thank you the most cuz you were the ride or die [ __ ] who are like oh yeah what what princess do they want to have sex with I'd love to know you know what I mean like that so many people I'm sure drop in on the the shows and looking like oh it's not games or whatever and they bounce and it's like that's totally understandable I'm not knocking that but I'm saying the people who have been here forever for us you are the best friends and we'll continue to add best friends now, but at no point are we going to take for granted the people who have been here forever. It's because of you guys that we're doing this. Like we're literally leaving our jobs because you guys are allowing us to do that. That's the crazy part is that it is",
            "start": 1792.88
        },
        {
            "text": "who have been here forever. It's because of you guys that we're doing this. Like we're literally leaving our jobs because you guys are allowing us to do that. That's the crazy part is that it is because of them. Without them, we can't do this. Yeah, I agree. And I I think what's most exciting about it is, you know, IGN has this huge reach and we've always been honored and and thankful for that. But we don't need that kind of reach to to do what's satisfying for us and to satisfy the smaller group of people that want to kind of ride or die with us, which is yeah, they care about what we say, which is which is I think what's so exciting. Like that's what's really in invigorating to me is like I actually want to talk to a smaller group of people that like really that really care and really like that aren't there just because just because of a snazzy headline or just there because it's the news of the day, but because they want to know what we think about X, Y, and Z. And that's a smaller",
            "start": 1828.32
        },
        {
            "text": "that aren't there just because just because of a snazzy headline or just there because it's the news of the day, but because they want to know what we think about X, Y, and Z. And that's a smaller group of people than the millions and millions of people that read IGN. But that's fine because you know the way I've always put it to people when they're explain, you know, asking, well, explain why you wanted to leave IGN and and all those kinds of things. Well, IGN was a great place to spend my 20s and now and that's I was there my entire 20s and that's awesome. Um, and now we're going to do something else. So, you know, we have to we have all these new properties. We own it. Podcast Beyond will live on without Greg and I one day and that's and that's fine. and we don't own that podcast, but we're going to do our best uh our best interpretation of what a podcast with Greg and I is together on something that we own now and that's exciting us. We're going to keep doing Game of Greg show.",
            "start": 1867.28
        },
        {
            "text": "we're going to do our best uh our best interpretation of what a podcast with Greg and I is together on something that we own now and that's exciting us. We're going to keep doing Game of Greg show. We're going to do let's plays. We're going to do it's it's going to be it's going to be nimble and quick and and cool and we're not going to give you a deluge of [ __ ] because you can't watch it all at one time and there's no reason to do that. like we're g we're giving out so much content and this is such a a work in progress where we want to work with you guys see what you guys want when you guys want it and it's like right now we're we're going to start with all this. We want your feedback as always and then we're going to work from there and we're going to see what works best for you guys. That's fun. Yeah. I mean just going off that just ripping off that message for a second. I'm just going to riff. Yeah. Riff. I knew you wanted to make a joke about riff the way you said it and then",
            "start": 1905.12
        },
        {
            "text": "That's fun. Yeah. I mean just going off that just ripping off that message for a second. I'm just going to riff. Yeah. Riff. I knew you wanted to make a joke about riff the way you said it and then know when no one helped you like I want to just riff. I just need calling like rip off of it, Nick. Rip off of it. I'm like riff. Please rip off. I'd love to hear Christopher Walking riff off it. It's fine. Kind of funny. Could be funnier. Why did you call your channel kind of funny when you're clearly not funny at all? Wow. Greg, not as funny as a heart attack. Uh I that's a that's a that's a great way to start a a call is that we have a hopefully a group of people out there that want to be a part of something. Um, with IGN it was very hard to feel that until you saw, you know, I'd go to like podcast like beyond 300,000. I was like, how long? Uh, and see it, right? But I I never really felt it at IGN until like like like we feel it here, right? Like we have a group of people out there that",
            "start": 1939.52
        },
        {
            "text": "like beyond 300,000. I was like, how long? Uh, and see it, right? But I I never really felt it at IGN until like like like we feel it here, right? Like we have a group of people out there that want to be a part of something from its inception and watch it grow. And like that's something that I consider as blessed to have for one blessed # blessed. Uh, and it's awesome and I and I think the onus is on us now to deliver. Yeah, 100%. Yes. And we're and we're going to deliver. I I like I'm I'm totally confident in that. Tim's right in the sense that we got to get your feedback on what we're doing right, what we're doing wrong, what you want to see more of and what you want to see less of. There's only four of us. And like I said, we don't want to give you we're not going to give you 10 videos a day. Like that's that doesn't make any sense. You're at work, you're with your family, you're playing games, you want just like kind of some content to keep you company in the car. You want some",
            "start": 1985.92
        },
        {
            "text": "a day. Like that's that doesn't make any sense. You're at work, you're with your family, you're playing games, you want just like kind of some content to keep you company in the car. You want some content to to keep you company when you're eating dinner or something like that. We're going to give you those videos and and those great podcasts and stuff like that. What's exciting about it is I it's just going to multiply and and and there's going to be more good stuff for you to enjoy. And so you can support kind of funny and you can support kind of funny games. You can support both. You can support neither because everything will be available eventually. Yeah. Uh for free. So it's the same kind of rigomearroll that we have right now. Rigomear roll. We need that on a shirt. I don't know if now's the time, but at some point we'll get it on a shirt. Roll. Just rig them. Just rigor. Um and and I don't know, man. Like I I'm I remember, you know, let's give everyone a peak behind the the",
            "start": 2027.68
        },
        {
            "text": "if now's the time, but at some point we'll get it on a shirt. Roll. Just rig them. Just rigor. Um and and I don't know, man. Like I I'm I remember, you know, let's give everyone a peak behind the the curtain because I know they like that. I remember I'll never forget like, you know, when we decided we were going to do this, it was in October before Comic- Con and I was on the Long Island already and I remember spending Yeah, New York Comic- Con. I remember spending several days um in these guys were still together in San Francisco dealing with everything and I was in Long Island and I was just getting phone updates from them and I just remember sitting in my dad's garage in his workshop like like Indian style on top of his bench like his work bench or whatever just like talking and figuring it out and being really scared and I remember having conversations with my dad you know he would smoke his cigarette and I conversation with Colin that needs to happen GJM you know and uh I was",
            "start": 2057.52
        },
        {
            "text": "it out and being really scared and I remember having conversations with my dad you know he would smoke his cigarette and I conversation with Colin that needs to happen GJM you know and uh I was like I was chain smoking cigarettes I don't even smoke cigarettes with him in the garage just talking till like late And he was just saying like, you know, he's like, \"You're going to be fine. Like, what are you worried about?\" You know, he's like, I always need to bounce things off him where I'm like, \"Can I come back home if I run out of money?\" And he's like, \"Yes.\" Um, and then and then as time went on and I started to we started to expound on this and like talk to different people and and what you were hearing from very honest people that would be very candid with us typically is that I heard very little naysaying of any being like, \"You're making a mistake.\" No one said that. people that I trust, people aren't just blowing smoke up our asses, you know, some people definitely are, but some",
            "start": 2098.08
        },
        {
            "text": "little naysaying of any being like, \"You're making a mistake.\" No one said that. people that I trust, people aren't just blowing smoke up our asses, you know, some people definitely are, but some people definitely aren't. And they were like, this is a no. People, you know, people we know, you know, in the industry, developers, all these kind of guys were like, I'd say for the last year and a half, people when I go to events, people come up to me and ask me when I'm leaving. And I don't I don't know if they do it in thinking kind of funny, but they thinking that I'm getting to a point where the next thing's coming for me. And that's what it is for me, right? Is and I've talked about it a lot in the same way everybody else talk about. I was at IGN for eight years. They gave me the world. They let me step up, be the face of the site for the longest time and I'll never be able to repay them for that. Um, but it was I felt we how long can you sit there and do that? I always talked about",
            "start": 2134.56
        },
        {
            "text": "They let me step up, be the face of the site for the longest time and I'll never be able to repay them for that. Um, but it was I felt we how long can you sit there and do that? I always talked about the fact of people would sit there and talk to me like oh in seven years we'll say at the time, right? Like oh my god, I can't believe it. And I always tell the story of like well you know I came in right as the old guard burned out, right? Right as like the founders of the site were going away. And then in that time how many editors have Colin and I see come and go that just do it forever and burn out on reviews. And I always say that like if I was still the PlayStation editor, if I was still an editor on the PlayStation team, I would have burned out a long time ago, too. But IGN let me grow and change paths so many times to the point of when I finally switched to being full-time host or whatever, which really began with Up at Noon start. Like, you know, I mean, granted, my title didn't",
            "start": 2166.24
        },
        {
            "text": "and change paths so many times to the point of when I finally switched to being full-time host or whatever, which really began with Up at Noon start. Like, you know, I mean, granted, my title didn't change for like another year and a half after that, but really that would be like three years ago, two and a half years ago. When that happened, I moved into the space of like cool and then you do it for that long. It's like where does it go next? You know what I mean? there was no promotion to be a higher host at IGN or something like that, right? I was already the host. No offense to anybody there of IGN. So then it just became of like, well now I want to go try to be a host somewhere else. I want to take these independent opportunities. I want to go try to be out in the world and do that while doing my own stuff. And that's when it understandably got weird with IGN of like, well, it's weird if you go somewhere else and you're hosting their thing, but you're not mentioning IGN, but you",
            "start": 2200.96
        },
        {
            "text": "doing my own stuff. And that's when it understandably got weird with IGN of like, well, it's weird if you go somewhere else and you're hosting their thing, but you're not mentioning IGN, but you go around and around like that. And so like the easiest way I felt for me personally was the next step of my career is being independent. And then once we solidified this table, it was easy to know that this would be the next real part of it. This is my full-time job. And if I get approached by company X or industry event Y to go do something there. More power to him. Business at kind of funny.com. But you know what I mean? Like I'd be a part of that and do something with it. But I don't that's a real thing. Business is kind of what it is. How ridiculous is this? We live in business kind of.com. If you have a product you'd like us to be sponsored shipping with or if you want me to go host business. Yes. It's been since we launched. Kind of funny. No. You're so stupid. You were just the",
            "start": 2235.84
        },
        {
            "text": "If you have a product you'd like us to be sponsored shipping with or if you want me to go host business. Yes. It's been since we launched. Kind of funny. No. You're so stupid. You were just the stupidest. You're the stupidest man I've ever We'll figure this out. Kevin, time stamp this. No, I know that I'm correct. Business atindofunn.com. Aren't you glad we quit our jobs? All right. So, let's let's put it all back in the [ __ ] cardboard box. Yes. Real quick. I know everybody hates the plugs. People get mad at the plugs. First off, Matt, the plugs are my only [ __ ] force of income now. So, we're going to be part of it. Force of income. No, that doesn't make any sense. That sounds like a source of income. So, now we're going to do a one giant plug session here. The easiest thing, and I'm trying to train myself to say it on this show, is kind of funny.com. Theoretically, the site is easier and looks better, and every video we do from either kind of funny or kind of funny games gets",
            "start": 2272.8
        },
        {
            "text": "trying to train myself to say it on this show, is kind of funny.com. Theoretically, the site is easier and looks better, and every video we do from either kind of funny or kind of funny games gets embedded there. It's all right there. Synthesized. Yes. To kind of funny.com. And there's links to go to each individual Patreon. There are two Patreons. Why two Patreons? We put up a video about this before, but we look at Patreon like a subscription method. We It's an easy way to get exclusive access, get the shows early, to get prizes. Now, we're going to start giving away and doing that. Uh, that's why it's easier that way. Kind of funny. Patreon was already getting a little hard to manage in terms of like what you're getting on what tier and this that, and the other. People were confused why they weren't. It's a long story. So, then kind of funny games is the same thing. It's pretty much the mirror image of getting that content early. So, if you have the 10 bucks to give us, you can get",
            "start": 2314.32
        },
        {
            "text": "they weren't. It's a long story. So, then kind of funny games is the same thing. It's pretty much the mirror image of getting that content early. So, if you have the 10 bucks to give us, you can get on each one of them for five bucks. the MP3 early, you can go up. If you can only afford one, great. Only do one. If you can't afford either, again, everything we do will eventually be free with the exclusive exception of the exclusive content. So, that's easy. Kind of funny.com is the easiest way to do it. But, please come. If you're a YouTube person, subscribe to kind of funny. Then, go subscribe to kind of funny games, all one word. Go to twitch.tv/kindfunname. Subscribe to that. Uh, again, Colin and I will be doing a live show every day. We're doing it 11:00 a.m. 11 a.m. Pacific time. So, if you're watching this on the morning of the 5th, yes, there's about to be a live show with Greg and Colin hashing all this out again, I'm sure. Then, when we finish that, we're going to take a",
            "start": 2349.36
        },
        {
            "text": "So, if you're watching this on the morning of the 5th, yes, there's about to be a live show with Greg and Colin hashing all this out again, I'm sure. Then, when we finish that, we're going to take a break. We're going to go do just live streaming all day. Smash Brothers and playing games with each other. Please hang out. Just have it on the background. We're going to play so much Smash. There's going to be a lot of Smash. There's Yeah, there's Let's Play serieses every day on Kind of funny games. There's the breakout of the kind of funny game show, kind of funny games cast, whatever we end up calling it. It's the Game Over Gregy show about video games on kind of funny games. That's happening every day, too. So really we've just it's imagine kind of funny is a Mwai and it's gotten wet and we have one ball that's popped off to be kind of funny games. It's very similar. Is this before they got fed after midnight? So we're not gremlins yet. We're just got wet. Yeah. Yeah. Or some except",
            "start": 2382.72
        },
        {
            "text": "we have one ball that's popped off to be kind of funny games. It's very similar. Is this before they got fed after midnight? So we're not gremlins yet. We're just got wet. Yeah. Yeah. Or some except for that one that was like kind of wicked twisted and then he kind of wicked twisted is the next channel. Spike. You don't want Spike. Was Spike the one too? Well no Brain was in Gremlins 2. He talked remember God. Gremlins is I can't wait. Now we can talk about gremlins. And I don't think anyone cared if we talked about gremlin. And and I want to I want to re more time before we go to the next the next topic, whatever that topic might be, is is uh you know, we appreciate everything I has done for us. Keep going there to read your reviews and your news and all that kind of stuff. We're always going to be part of that family. We're always going to appreciate them. And big shout outs to the guys that helped us kind of segue out and were very graceful and very patient with us and were very",
            "start": 2418.72
        },
        {
            "text": "going to be part of that family. We're always going to appreciate them. And big shout outs to the guys that helped us kind of segue out and were very graceful and very patient with us and were very kind to us uh for letting us leave, including P and Fran and Tal and all those guys. So, um, they were nothing but nice to us. We'll always be part of that family. Uh, IGN's still there for you to consume. We hope you still consume it. We hope you just come and follow us here as well. Yeah. [Music]",
            "start": 2457.2
        }
    ]
}