{
    "id": 495,
    "video_id": "t3arIIbN7F0",
    "show_name": "Announcements",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Colin Moriarty"
    ],
    "title": "Greg and Colin Leave IGN to Form Kinda Funny Games",
    "description": "We quit our jobs, please support us here: http://www.patreon.com/kindafunnygames\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1420477215,
    "duration": 102,
    "transcript_chunks": [
        {
            "text": "What's up everybody? I'm Greg Miller and I just quit my job at IGN. So did I. Me too. I didn't. Just kidding. I did. Yep. All the kind of funny guys had quit IGN to focus on creating content for you. You supported us up until this point and now we're putting our livelihoods in your hands. You built this with us and now it's time to take it even further. That's why we're starting Kind of Funny Games, the only place to get our opinions on gaming. This is your one-stop shop for commentary on what's happening in video games today. We don't report the news, we interpret it with you. We're doing let's play series, daily Twitch streams, and the kind of funny games cast, which is the game of a Greggy show, but about video games. But the most exciting part of all this is Colin and Greg Live, a daily morning show on Twitch all about the nerdy stuff we love and live stream to you. It's Greg and I podcasting each and every day alongside you, developers, actors, you name it. It's like Podcast",
            "start": 0.72
        },
        {
            "text": "daily morning show on Twitch all about the nerdy stuff we love and live stream to you. It's Greg and I podcasting each and every day alongside you, developers, actors, you name it. It's like Podcast Beyond, but more than just PlayStation each and every day. Okay, why do another Patreon? Well, we see Patreon as a subscription service. It gets you our content early and it gets you more involved with it. Adding another set of shows to our existing Patreon would make it even harder to understand what you're getting. Want to support the Game Over Gregy Show and all the comics and movies content we do on Kind of Funny? Support that Patreon. Want to support Kind of funny games and all the video game based content we're going to do there? Support that one. As always, everything we do will eventually be free on YouTube and podcast services like iTunes and Soundcloud. This is just a way to get early access, exclusive content, and even play games with us. Kind of funny. Games is the next step",
            "start": 39.44
        },
        {
            "text": "be free on YouTube and podcast services like iTunes and Soundcloud. This is just a way to get early access, exclusive content, and even play games with us. Kind of funny. Games is the next step for us and we hope you'll come along for the ride. Whether it's supporting us on Patreon, watching us on YouTube, or just tweeting about us with your friends, every little bit helps. But money would be nice. Yeah, we don't have jobs anymore.",
            "start": 76.48
        }
    ]
}