{
    "id": 1837,
    "video_id": "mJFWBTXKVp4",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "Behind Closed Doors Batman VR and Mafia 3! - Kinda Funny Gamescast E3 2016",
    "description": "All the games we played and saw day 1 of E3!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1466006405,
    "duration": 1962,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening Kinda Funny is going all out with Let's Plays and reaction videos all week long subscribe now at youtube.com/kindafunnygames to not miss a thing what's up guys welcome to the first ever E3 2016 day one Kinda Funny Gamescast wrapup as always I'm Tim Gettys joined by the coolest dudes in video games Colin Moriarty and Greg Miller Professor Greg Miller Adjunct professor Greg Miller let me tell you about particle physics oh my God it's weird cuz that feels really right I don't like it Greg I don't like them particle purp crew purple crew purple crew pink brown crew over there oh the brown I'll give you the brown thanks I'll give you the Browner oh actually you'll give it to me in the brown I mean I can give you the brown I can give it to you if you want God this sounds nasty figure out is anyways I'm sitting here because I'm lazy and didn't want to get up and sit there so Colin where I normally sit but the more important information is that this is E3 we got",
            "start": 0.12
        },
        {
            "text": "Sounds nasty, figuring out is anyways I'm sitting here because I'm lazy and didn't want to get up and sit there so Colin, where I normally sit. But the more important information is that this is E3; we got to play a bunch of games. E3 here by that I mean I played one game. I was going to say we did play, so yeah, a single game today. We of course worked out of the GameSpot booth today doing the Kinda Funny business that'll be up on youtube.com/kindafunnygames isn't that right, Greg? Yeah, thank you. And uh, while we were doing that, we didn't... we saw we talked to a lot of people about their games, David Cage's Detroit: Become Human (I think his name is), no I heard K heard \"Kag\" I think he meant David Kagame, but I believe the correct name is David Cage. We talked about a lot of games and then we ended... we had 2 hours to go run around and play things so we all ran around for 2 hours and played stuff tomorrow, Millie (I assume you mean Mike \"Milli\" Miller), and the next day we're playing a whole bunch of stuff; we're seeing a whole bunch of behind-closed-doors stuff; we're going to tell you all about.",
            "start": 53.0
        },
        {
            "text": "2 hours and played stuff tomorrow. We're seeing a whole bunch of behind closed doors stuff, and we're going to tell you all about that. We're going to tell you what happened behind those closed doors. Did you guys see any behind closed doors stuff today? Yeah, I did too. Well, let's start with you Colin because you're going to be leaving pretty soon for meetings - business meetings and stuff. By business meetings, I mean the yearly Big E3 Jeremy Dunham Morton Steakhouse Extravaganza round-up that's where you get some scoops, you can't talk about but you'll talk about, and then you'll also get us those sweet Rocket League exclusives, which isn't a joke - they're coming. By to let's play tomorrow with some of the exclusives. Well, as you know, Rocket League was one of the ultimate E3 moments, and so we get basically first word of refusal on everything Rocket League. It's true, true. Uh, so uh I saw two games went to",
            "start": 94.52
        },
        {
            "text": "well as you know Rocket League was one of the ultimate columbus moments and so we got basically first WR of refusal on everything Rocket League it's true, true uh so uh I saw two games went to 2K in South Hall which I don't think I went to once last year actually no I did I went right there for YouTube but other than that this I didn't even take an appointment last year other than like some Sony behind closed doors things so it's the first time I even went to a third party publisher at E3 since we were at IGN um and I saw Mafia III and I saw Civilization VI okay now the most important thing to tell you about Mafia III is I had a pee really badly throughout the entire demo but I still I still paid as close attention as I possibly could sure uh it is an open world, is exactly what you think it is, it is an open-world uh sandbox action shooter third person uh it takes place in a version of New Orleans I don't remember the name of it it's not New Orleans kind of like number two um",
            "start": 125.76
        },
        {
            "text": "think it is it is an open world uh sandbox action shooter third person uh it takes place in a version of New Orleans I don't remember the name of it it's not New Orleans kind of like numb3r5 too um and uh it's actually quite Dynamic it reminded me in some small way of Grand Theft Auto IV, which was kind of like the underplayed EA published open World sandbox game that came out in like 2009 maybe it's the game we got like six months before it came out I'll never forget that as long as I live we had to put in that long key to play it I remember yeah it was like it was we I don't know why the **** that game was done so early and then it's never released anyway uh it's cool thematically it's really interesting looks a little bit old a little bit dated I mean obviously there's a marquee titles in this particular genre the most Marquee title of all actually is in the genre Grand Theft Auto 5 and so you have to really do a lot to beat it and I don't think this game is even trying to do that but",
            "start": 163.72
        },
        {
            "text": "this particular genre the most marquee title of all actually is in the genre Grand Theft Auto V and so you have to really do a lot to beat it and I don't think this game is even trying to do that but there's cool systems and mechanics in the game that I really thought were interesting um and uh the one cool thing I like is that so basically you're playing as a black Vietnam War veteran in 1968 um a great time to be a minority exactly and that that plays a lot into the the southern setting yeah basically uh there's a like an Italian white mob and a black mob in the city and the Italian mob uh basically all but uh eviscerates the black mob leaving some sort of revenge story to be taken on um and so you play as this uh Vietnam vet Vietnam War veteran he looks like he's in his mid to late 20s um and what's cool about it is that he has like uh three lieutenants basically that he can take over parts of the city and then give them the parts of the city to take care of but depending on the",
            "start": 201.8
        },
        {
            "text": "\"and what's cool about it is that he has like three lieutenants basically that he can take over parts of the city and then give them the parts of the city to take care of but depending on the decisions you make they showed a part of the game where it's like you kind of **** one of your lieutenants over so he actually turns on you completely and you have to you have to kill him um and so there's all these like branching PS in the game that are pretty interesting in that respect that sounds cool um and you like sit you have a sit down with them after you take over part of the city and like they make a pitch as to why like you you get like you give them the city or whatever so one of them is like a black woman who's like a native I think of the city one of them is like a like an Irish dude who's like a mobster and one of them is an Italian mobster who is like betraying um uh I I was I was hands off gotcha they CH they chose the Italian dude and then the Irish guy actually turned\"",
            "start": 243.72
        },
        {
            "text": "dude who's like a mobster and one of them is an Italian mobster who is like betraying uh I was hands off gotcha they chose the Italian dude and then the Irish guy actually turned on us and showed it showed us like he's like not everyone's going to see this but you you go to his like compound which is like a steel mill or something and you like kill all his men and stuff like that so there's like it is super rife with things to do um and that sounds great I I like that about Mafia too I like and I like the little parts you're talking about I can deal with it not being on Grand Theft Auto's level it's definitely not but I mean maybe it is I mean I haven't played it but I mean just aesthetically and stuff like that but there's a ton of **** to do one of the cool things I like and this reminded me a lot of Godfather 2 in some sense as well was um your the entire idea of a lot of the things you're doing in the",
            "start": 278.28
        },
        {
            "text": "but there's a ton of work to do, one of the cool things I like, and this reminded me a lot of The Godfather II in some sense as well. Was um, you're the entire idea of a lot of the things you're doing in the game is to whittle down the resources of your rivals you have in the city, and there's like a bunch of them kind of... um so like it shows you how much money they're making and everything you do in the game whittles down the amount of money they're making until it's down to zero. So like you can go after like their drug runner, you can go after like the guy who like launders their money or you can like go burn down like their facility where they make drugs or whatever and then that money totally whittles down to zero and once it's whittled down to zero, looks like you take over that part of the city. Then you give it to one of your people and then you go about your business. So it is very, it is very step by step in that respect and there's a whole story throughout it as well.",
            "start": 312.04
        },
        {
            "text": "of the city, then you give it to one of your people, and then you go about your business. So it is very step by step in that respect, and there's a whole story throughout it as well. As for the three - the Italian, the Irish, and the other one, the black woman - they're the ones that are like with you, and then there are like rival gangs or different gangs that you're trying to kind of screw around. So they show you going into a brothel, and this guy is getting a uh laugh dance by this woman. You kind of stealth in and shoot him in the head, and it says like $10,000 whatever on the thing or whatever, and you get money. And then it whitts down the money, and then you get out of there. Um, and so it's kind of cool - I can see myself getting into",
            "start": 344.16
        },
        {
            "text": "on the thing or whatever and you like get money and then like it whittles down the money and then you get out of there um and so it's kind of cool like I I can see myself kind of kind of getting into that seems like there's a lot of collectibles and stuff like that I mean it looks interesting um I'm definitely going to play it October 7th I think that comes out awesome and then Civilization VI, Civilization VI uh you know so Civilization V I am not by any respect an OG Civ fan I didn't get into Civilization at all until V um and I really loved V I still think Civilization V is probably one of the games I played the most of in my entire life and by hours played I played that game for **** ever um or what felt like forever I mean who the **** knows you were playing on a PC so it could have been 15 minutes it always I just remember I just remember for I remember what seems like I I've gone back to it many times in the past or several times in the past but I remember what feels like like several months",
            "start": 377.72
        },
        {
            "text": "it always I just remember I just remember for I remember what seems like several months of me just sitting on the couch with the mouse on my laptop on the armrest just playing it while I was watching TV I don't think I played anything else when that game came out for a while on like multiple accounts I think because I just I think I downloaded it like multiple times too I think I just bought it again like last year um so um because I have no idea how to use Steam so um that's how it works anytime you want to play a PC game you buy it again buy it again so there are little tweaks I don't I don't know that I even recognize all of them being not an OG Civ fan but there like you can like layer troops on top of each other now on tiles which is pretty cool you can start to make like settlements around your cities so like it's basically",
            "start": 412.32
        },
        {
            "text": "not an OG's uh Civ fan but there like you can like layer troops on top of each other now on tiles which is pretty cool you can start to make like settlements around your cities so like it's basically spreading the game out a little bit which is pretty cool the entire video they show which is like 15 or 20 minutes which is basically someone playing and narrating showing you like how your civilization obviously grows from like the embryonic animal husbandry and agriculture stage to like space um which is the entire idea of the game and that's one of the ways you can obviously win in Civilization so um it looks cool Enhanced Graphics battles are cool what's great about Civilization is the asymmetric way that you and other civilizations around you grow and so at the end they showed um Egypt invading your country and your China and this and obviously people that know Civilization know you can pick your leader and then you get like all these benefits and perks um they",
            "start": 447.8
        },
        {
            "text": "they showed um Egypt invading your country and your China and this and obviously people that know civilization know you can pick your leader and then you get like all these benefits and perks um they invade uh Egypt invades China but China's like way more technologically advanced than them so they Counterattack and so it's basically like tanks and airplanes fighting against like people on Horseback so these are the kinds of things so these are the kinds of things that you can get I mean like you can reach as people know and like you can get reach the Renaissance in like 1100 and you can reach like the space a like, 1600 if you really play it really well you know like so it doesn't necessarily have to make any sense um so a lot of that seems to be intact it looks **** awesome also comes out in October super excited about it um met someone from the developer for the first time too and and chatted just for a brief moment with him um so both games look cool 2K has got a lot of cool",
            "start": 483.96
        },
        {
            "text": "Out in October, super excited about it. Um, met someone from the developer for the first time too and chatted just for a brief moment with him. Um, so both games look cool. 2K has got a lot of cool stuff. One of the cool things that I was going on with the Mafia 3 man - they had a booth; they had a live band playing as well, which I thought was pretty cool, kind of getting that New Orleans flair, New Orleans flavor so cool. It didn't get in the way of the game; they didn't have Jumanji, which was unzipped; they didn't have Zatanna. So yeah, those are the two games I saw and then tomorrow, obviously we're going to see a bunch of first-party stuff or something - those will be broken out throughout the day. Now what time is it? I'm sorry to have to run; I got to go. That's fun; I can talk to Greg about the games he saw all right cool.",
            "start": 516.48
        },
        {
            "text": "first party stuff or something those will be broken out throughout the day now what time is it I'm sorry to have to run I got to go that's fun I can talk to Greg about the games he saw all right cool bye I love you bye love you too now Greg yeah you had a whole Adventure today I had many I had many games I saw today yes you went to w I did there's lot of great things at the WB remember the Frogger yeah remember the Frog do I remember that just making sure now Kevin don't sit down you got to I know you've slacked off all day long it's time for you to work all right you ready to earn your keep work sh sh we have it ladies and gentlemen oh my God what we've been waiting for for so long Lego Dimensions limited edition Green Arrow Nick are you seeing this he's halfway there ladies if you want to take flash photography I will if you now don't touch it I didn't say I didn't say you could touch it Nick you're going to throw it or something mean I know I know you all see well here it is",
            "start": 552.12
        },
        {
            "text": "\"Want to take flash photography? I will if you now don't touch it. I didn't say I didn't say you could touch it, Nick. You're going to throw it or something mean. I know, I know. You all see well here it is the gold base we got to go over there. You going let's what's up everybody? Welcome to a Kinda Funny unboxing. I'm Tim Gettys, this is Greg Miller, and this is Lego Dimensions green AR limited edition - the first thing from year two, cuz it's got the gold base of course. Year 2 we know based on the gold base of don't we know that Kevin blue? Year one gold, year two no no. This is still the game C. I'm just making it into an unboxing real quick while I build. Little Ollie is that okay? He asked stupid reasonable questions you know. I hate it when he asks questions that like he's afraid of doing his job wrong now what I want you to choose. I didn't say sit down, do you? I want you to choose. Do you want him to be frowny Ollie like that? He has two faces is Lego no all Legos do that not most Legos do that you got\"",
            "start": 597.56
        },
        {
            "text": "what I want you to choose I didn't say sit down do you I want you to choose do you want him to be frowny Ollie like that he has two faces is Lego no all Legos do that not most Legos do that you got frowny Al done you any time on that one Kevin we got barely we got frowny well imagine a frowny face people this is also great for the people on iTunes or do you want angry face Oli Tim I'm leaving up to you frowny frowny face or angry oh man his beard looks better angry all keep him angry want to pop his hair on and we got a little green AR guy oh man how happy are you I'm super happy where's your Supergirl no Supergirl there at all no not there not at all not no Supergirl all tomorrow not there was no no there is no Supergirl there there I they're probably wait till year three no I'm probably have to go to Comic-Con now go to ComiCon to take Lego cool so Warner Brothers went to Warner Brothers uh now here's what I want to do we did a video I don't think it I think this video might actually",
            "start": 638.44
        },
        {
            "text": "to go to Comic-Con now go to Comic-Con to take Lego cool so Warner Brothers went to Warner Bros. now here's what I want to do we did a video I don't think it I think this video might actually beat it can I talk about seeing Batman's Telltale The Walking Dead game or should I not talk about that because this is a game I saw today technically I saw it this morning the people out there, the Hillers, talk about this all the time it's great they want different perspectives but I don't think they're going to see perspective basically there's going to be a long interview with Joe from Telltale Games about Batman and about The Walking Dead that'll go up here on YouTube.com/games so yeah you should wait on that one, you can talk about the other Batman stuff okay so that's his own thing happening go check it out it's over there on youtube.com/ up yet I don't think this is going to beat it but tomorrow it'll be up real question I liked it I liked it a lot you get to choose you get to be",
            "start": 689.56
        },
        {
            "text": "Behind Closed Doors Batman VR and Mafia 3! - Kinda Funny Gamescast E3 2016\nAll the games we played and saw day 1 of E3!\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\nCheck out our store! http://www.kindafunny.com/store\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.\nthing happening go check it out it's over there youtube.com/ up yet I don't this is going to beat it but tomorrow it'll be up real question I liked it I liked it a lot you get to choose you get to be how you what kind of Batman you be what kind of Bruce Wayne you gonna be it's cool it looks really good I was dodging around so Tim couldn't stop me all right I'll just tell you about my WB appointment then okay go for it WB how many games did you see I saw saw Injustice 2 I saw Lego Dimensions year 2 I saw Lego worlds and I saw Batman Arkham VR all right we're going to start with the biggest one Lego Worlds how is it it's you know not bad it's you know Lego worlds has been out for a while now for the record I only got to play this for like five minutes it was real quick it was something that was like oh do this oh we can get you into see VR I was like oh I was joking I want to hear about Batman VR great tell me about that I thought you wanted want to get the appetizers out of the way you",
            "start": 728.56
        },
        {
            "text": "was like oh do this oh we can get you into see VR I was like oh I was joking I want to hear about Batman VR great tell me about that I thought you wanted want to get the appetizers out of the way you want to get the appetizers I want to hear about Batman VR Batman VR blew my mind I think it's one of those where I my bar is so low for VR right now not that I think VR is bad you know that I'm interested in VR you know that I enjoy VR the problem is like when they announced this remember during live reaction everybody shut up what no what what no and then I was like okay cool and it was like well I bet this is going to be a 10-minute experience and what is it Batman: Arkham it's Rocksteady is it going to be phoned in is it going to be somehow dropped in the world is it was none of the things I thought it was going to be uh the deal is that this is going to be a 60-minute experience so an hour-long experience when you replay it you'll find new things in it there'll be new things to go out",
            "start": 768.04
        },
        {
            "text": "I thought it was going to be uh the deal is that this is going to be a 60-minute experience so an hour-long experience when you replay it you'll find new things in it there'll be new things to go out and see and experience because again it's going to this is like every other for every other first year PlayStation VR game is going to be an experience right where it's not going to be super deep I don't think in terms of like all this uh uh length but like this is this is the game that that I saw today that I'm trying to get you all appointments for now okay cuz as soon as I like 10 minutes in I was like I'm going to give this my one of my faces my one of your Game of the Show, you only get three of those, Greg, and it didn't dawn on me till I was walking home that I've now given two of my three to Batman games, I mean whatever they're s quality now here's here's the thing Greg we each have our three faces right to give away and there's also the Kinda Funny award that we all need to kind of",
            "start": 810.48
        },
        {
            "text": "To Batman games, I mean whatever they're s quality now. Here's here's the thing Greg, we each have our three faces right to give away, and there's also the Kinda Funny award that we all need to kind of agree upon as a group on where to give it. Would you make an argument for why I'm trying to get you appointments? I'm trying to get you appointments because putting I mean I couldn't stop smiling using it, and again my bar was low, but you put it on like I got there, and like this is weird. First off, I wasn't expecting to be here; I was I I had no idea that they were taking Batman Arkham VR appointments, and so when I was there, like oh there is, I'm like yeah let me get them. They fit me in, and I go in there, and it's Dax and it's Sefton, it's the Rocksteady guys, and they're there as excited about this as they're excited about when they showed me Arkham Asylum the first time or when they showed me Arkham Knight the last time. Like they are all in on this, and I was like, they hand it to me and I",
            "start": 851.68
        },
        {
            "text": "they're excited about when they showed me Batman: Arkham Asylum the first time or when they showed me Batman: Arkham Knight the last time like they are all in on this and I was like they handed it to me and I said does it suck he's like what no does it and like I put it on and like dude as soon as you put it on you have both your hands you have to either pick if you're going to do so what what do you got going on in your hands they are your hands but I mean move oh I have to move on yeah yeah sorry sorry sorry this is a PlayStation VR exclusive it uses the Move wands I have two Move wands in each of my hands so I put on the headset and I'm on the roof of GCPD just as the menu and like I I I have to choose if I want to do this one or the other one there's two little demo missions or whatever but if you turn around the Bat uh signal is right behind you it is up there it's fully explorable you look around like you are inside the Batman games and then you start the first part of the demo which is",
            "start": 890.12
        },
        {
            "text": "you turn around the bat uh signal is right behind you it is up there it's fully exposed you look around like you are inside the Arkham games and then you start the started first part of the demo which is basically suiting up which will be the intro of the game and you come to or whatever and you're at the piano in Wayne Manor and you look around and you can look around there's the obviously the portrait of your parents there's all the stuff behind you and then Alfred walks in eventually and like says some stuff you he's talking to you about you know being Batman or whatever and like that there's something going on you need to he'll meet you in the cave he goes I believe this is what you're looking for and reaches out his hand and he's got a key in it and it's all second nature it all makes perfect sense I reached over with the move one grabbed with the trigger picked up the key moved it to the piano unlocked the piano thing put it up hit three keys and then the piano shifts back in like",
            "start": 928.64
        },
        {
            "text": "Sense I reached over with the move, one grabbed with the trigger, picked up the key, moved it to the piano, unlocked the piano thing, put it up, hit three keys, and then the piano shifts back in like the floor kind of expands when you hit three keys. Did you just kind of...like, like it? Okay, cool. You could you couldn't play \"The Ukrainian Bell Carol.\" No, I mean if you knew how to use a piano, I assume you could. Greg Miller can't, but I like he reached out and my hand went from like the the...I think it might have been the open-handed it went to a finger so it's like you can hit every the keys you want to hit. You totally could hit what you want, I assume. Imagine sure, but it expands out and then like I'm standing on the elevator and we just start descending into the Way Manor, and I...if you haven't used VR, it's hard to explain, but the coolest thing about VR is when it tricks your mind and it totally is like...like I'm in the elevator. You know what I mean, and I'm going down, and as you go, you know",
            "start": 965.76
        },
        {
            "text": "to explain but the coolest thing about VR is when it tricks your mind and it totally is like, like I'm in the elevator you know what I mean and I'm going down and as you go you know like you get to the first level in like this you know basically Metal Gear Solid comes up and opens up and it's the suit right and it's got the glowing bat symbol and I reach out and I grab it and I put it to my chest and like all this he's not telling me what to do it's just that obvious reach out put it to my chest and like boom I'm in the Bat-suit or whatever and then and I look down you don't see it you see it's not like I'm looking down but I know that's what's happened right uh the cow comes down you reach out with both hands grab it turn it put it on and then they bring in a mirror so you can like adjust it and you're moving your head perfectly and it's one of those things again with VR where I know how VR works I **** it up all the time though where I'm moving my head I start moving my mouth",
            "start": 1002.8
        },
        {
            "text": "it and you're moving your head perfectly and it's one of those things again with VR where I know how VR works I **** it up all the time though where I'm moving my head I start moving my mouth and like oh wait no can't read that but like you know what I mean and then the grappling gun comes and I have to put it on my utility belt and then the uh the crime scene investigator gun he uses and then the batarangs come and like you get to try them out and throw them out and shoot the grappling hook and do this and then you go all the way down and you're in the cave and you turn around there's the giant Penny and there's the the T-Rex and it's beautiful and like they give you a long time coming down to really take in the fact that you're in the Batcave you're entering the Batcave God this is awesome and like it's it's surreal and it's fun and it's it's it tricks your mind and I like I had a huge grin on my face I afterwards when it was done I walked back with uh SEF and Dax to give them the",
            "start": 1041.8
        },
        {
            "text": "and like it's it's surreal and it's fun and it's it's it tricks your mind and I like I had a huge grin on my face I afterwards when it was done I walked back with uh Sef and Dax to give them the award and I would couldn't stop grinning it was and that was like all day people would ask me what's the best thing you seen what was the biggest surprise you had seen this is now my answer because totally like I as soon as they announced I'm like this is going to be a 10-minute experience and whatever like no I'm shooting the grapple and do this but then they're like you want to see the second part and it's like **** yes I want to see the second part and you click over and it's a crime scene investigation right and like this is the all part of the game that'll stitch together this story that is involved or wherever and so spoilers for this little bit of story that's not a real story obviously you'll see why in a second but the deal is that uh you know I basically drop in uh and like pick up",
            "start": 1075.6
        },
        {
            "text": "Behind Closed Doors Batman VR and Mafia 3! - Kinda Funny Gamescast E3 2016\ninvolved or wherever and so spoilers for this little bit of story that's not a real story obviously you'll see why in a second but the deal is that uh you know I basically drop in uh and like pick up in an alleyway right or I'm on the uh the catwalk fire escape above an alleyway and I'm there to investigate a distress signal from Nightwing and so this is interesting now because I'm like well how am I going to move around what does this do and the way it works is you look around and you see the bat symbol and you hit the PlayStation Move button and it warps you to that point like you're jumping to that point or whatever so I jump down and I jump down and again like I'm on the fire escape I'm doing that thing where I'm walking around the move wands and I walk to like the edge of the fire escape and like lean over the railing even though there's nothing there and all this dumb stuff hop down and I you get there and it's Kevin Conroy of course I should have said this earlier doing the",
            "start": 1110.56
        },
        {
            "text": "escape and like lean over the railing even though there's nothing there and all this dumb stuff hop down and I you get there and it's Kevin Conroy, of course I should have said this earlier doing the voice acting it's all new voice acting and it's uh Dick Grayson dead it's Nightwing dead holy **** and and like you so he does like a whole thing of like oh my God how did this happen you know blah blah you scan his body with the thing you find his neck's been broken and it's one of those okay I gotta let's figure out how we do this I download you know his suit's recorder or whatever and start reconstructing the crime scene but I'm reconstructing the crime scene in you know three dimensions all around me and there's three different places I I can hop to to put it all together and so you start going through and all right cool you've played you've played Batman: Arkham Knight right or any of the Batman games oh I'm familiar with the rewind like AR I'm sitting that that doesn't matter too",
            "start": 1147.4
        },
        {
            "text": "\"Start going through and all right cool, you've played Batman: Arkham Knight right or any of the Batman games? Oh, I'm familiar with the rewind like AR. I'm sitting that that doesn't matter too much, so I'm in the crime scene and I can hop around different places and eventually the you know the criminals are there and I see them brawling or whatever and I'm using the Bat-grappling hook and I have it in my hand but like in my hand obviously it looks like some of Batman's gadgets or whatever and it's like I can move the grappling hook as a control so I can fast forward, I can rewind, I can pause with it and so I'm just like doing everything you've done in Arkham Knight but I'm doing it and like at points I'm dodging 'cause it's like it's not that I'm from the other side of the screen watching like they are brawling in front of me and like I can get as close as I want to Nightwing while this is happening or to the you know the outline of the Catwoman. Can you smell them, Greg? No, I couldn't smell them but you know Kevin.\"",
            "start": 1184.36
        },
        {
            "text": "in front of me and like I can get as close as I want to Nightwing while this is happening or to the you know the outline of the Batcave can you smell them Greg no I couldn't smell them but you know Kevin was there trying hard enough yeah I know uh but they're and it looks awesome and you have to find the moments of impact like when he actually like oh here's where he broke his jaw and like it's brutal like here BR job sounds you scan it and like that and you're putting it all together and like it was just awesome and it was it's not what you think of as The Rocksteady Batman game obviously it's not fighting it won't be fighting it's not going to be that kind of fast-paced action it's going to be I'm standing here I warp there I do this I put together this crime scene but it was awesome and it was something that like this is totally the game that yeah when people come over and they want to try VR it's like you're like Batman right **be** Batman cuz just descending in an elevator",
            "start": 1218.48
        },
        {
            "text": "it was something that, like, this is totally the game that yeah, when people come over and they want to try VR, it's like you're like Batman right, be Batman, cuz just descending in an elevator, putting cuz it's you put on the cowl, you reach into these things and you put on the gloves, and that was the other cool thing I didn't mention, like when you're at the piano, your normal hands but your knuckles are all cut up and bruised and **** up, and you put on the gauntlets and you look at the gauntlets and like it's just it was so totally totally rad one fun experience during uh one of the the press conferences this week I tweeted out I was just like every single VR trailer always has just footage of people telling you how mind-blowing VR is but it's one of those things where what blew my mind is when I tweeted that Mark Ryan from IGN responding to me and he was just like I just ran a poll to people who have even tried VR",
            "start": 1255.2
        },
        {
            "text": "Behind Closed Doors Batman VR and Mafia 3! - Kinda Funny Gamescast E3 2016\nVR is but it's one of those things where what blew my mind is when I tweeted that Mark Hamill from IGN responding to me and he was just like \"I just ran a poll to people who have even tried VR, and it's shocking - it was like 90% of the people who responded to his poll had never even tried it.\" And there were like a thousand votes or whatever. Um, have never even tried it, and it's like that's why you need to keep telling these people that it's worth it, you know? And I guess that's the best way of putting it, I think. When we were watching the PlayStation conference and we were like \"Oh man, Resident Evil! Oh man, Batman!\" It was like awesome, but it was also... marked with that tinge of well, we've seen a lot of demos so far, and how many of those would I recommend you go out of your way to play? Even like the Getaway, which we liked. The strings were showing a lot, kitchen... even yeah, exactly! This is the first demo where I'm like \"I'm going out of my way to try to get\"",
            "start": 1292.04
        },
        {
            "text": "play even like the get the getaway which we liked the strings were showing a lot kitchen even yeah exactly exactly this is the first demo where I'm like this I I'm going out of my way to try to get you guys demos I want everyone to play this experience it that's that's really awesome and you know when we we sorry when we played those things like it it is that mind-blowing moment where you're like wo this is crazy and then you kind of think about it more after and you're like a I can't play a full game like this whatever but I think that we're we're a step beyond the people that haven't used VR yet you know so then when we get opportunities to play games like Batman or I'm assuming the Star Wars game we're kind of already primed and ready to be not disappointed but we we know what to expect our expectations are low our minds were already blown so it's kind of hard to do that again so then I I think that's when when people like Rockstar Games, that obviously care about what they're doing",
            "start": 1330.4
        },
        {
            "text": "our expectations are low our minds were already blown so it's kind of hard to do that again so then i i think that's when when people like Rocksteady that obviously care about what they're doing make a product i think that that's when we're really going to start being wow and you sound like you were really wow and that's the thing and i guess yeah that's the point is like is as much rock as much love as Rocksteady seems to put into or has put into the Batman Trilogy they seem to have put into this that's great and that's the thing if that's an hour of awesome I'm in Gotham I'm looking around Wayne Manor I'm going to the Iceberg Lounge and seeing what's up yeah that's only an hour but that's that's an awesome awesome experience no very very cool so moving on from Batman The Lego things Lego Dimensions yeah no yeah well that was funny i ran into Nate Aher our friend right and he was like oh what' you see today i was like oh man well we on the thing all day and then of then we",
            "start": 1372.88
        },
        {
            "text": "things Lego Dimensions yeah no yeah well that was funny I ran into Nate Aher our friend right and he was like oh what' you see today I was like oh man well we on the thing all day and then of course I ran to Lego dimensions and he started laughing and then I pulled this out and he's like oh my God you did he thought I was kidding from the top of it jokes aside yeah went saw Lego Dimensions nothing really to report like I mean it's exactly what we've talked about we have our trailer breakdown already up I got to play uh one of the battle arenas which is the new thing with the gold guys this time around you can use blue guys but The Gold Guys from year 2 will be the ones who have their own Arenas and stuff it was fine uh it's it's you know competitive Lego game which isn't something that's really happened for which is cool that they're trying uh I'm not going to go out of my way to make you do a let's play with me or hang out with it I it's going to be local so if you",
            "start": 1413.52
        },
        {
            "text": "Behind Closed Doors Batman VR and Mafia 3! - Kinda Funny Gamescast E3 2016\n\nsomething that's really happened for which is cool that they're trying uh I'm not going to go out of my way to make you do a let's play with me or hang out with it I it's going to be local so if you have a bunch of kids it'll be great yeah you have a bunch of kids yeah but I you know I took uh so many photos of all the new year two toys and I I sat down and I made Arthur Parrish laugh cuz who's like you know our boy or whatever from TT Games but we sat down and uh I'm sitting there playing and they had the new Ghostbusters Story pack uh uh on the the portal cuz if you you only need the one portal from the original story pack which you need to play the game you don't need a new disc you don't need a new portal for this at all but if you buy the Ghostbusters Story pack you basically get a new decoration for the portal and I'm sitting there and it's the Ghostbusters uh uh Chinese thing from the new theater or whatever I was like oh and I'm just like playing I looked down and then I like went",
            "start": 1447.88
        },
        {
            "text": "for the Portal and I'm sitting there and it's the Ghostbusters uh uh Chinese thing from the new theater or whatever I was like oh and I'm just like playing I looked down and then I like went and I moved the doors and pushed them back in and he just started chuckling he's like yeah that works like that's how much we care about this I'm like yeah I know oh that's cool man yeah but that was it uh the you know Gizmo from the Gremlins he runs on all fours that was cute that was fun Gizmo right not not Stripe anybody can I get a fact check on that any big Gremlins one fans in here because somebody somebody in a video yeah but somebody in a video from what the games industry called him Stripe and I was like that doesn't sound right **** that guy yeah okay anyways saw that that was fine Lego Worlds played for two seconds it's Minecraft with Lego but it's been out for a while you you had your chance to get that and Injustice I am not you know a fighting game dude at all I played through the",
            "start": 1482.92
        },
        {
            "text": "played for two seconds it's Minecraft with Lego but it's been out for a while you you had your chance to get that and Injustice I am not you know a fighting game dude at all I played through the original Justice I'm a big DC dude right similar thing here where this was very much in the minutia of how they're fighting and it's like cool like yeah gorilla GROD got the telekinesis and this is great awesome and they went through you know getting the new armor and changing the character basically everything we've talked about before and that you saw in the trailer looks awesome if you liked Injustice one you'll like this one still to did we ever put that up did we put that up I this one of the videos we K Justice uh trailer yeah yeah it's up there I got to see on like a giant wall those statues in the background I'm not doubting myself but I it seems like I might still be in the Injustice One World cuz the statues in the back seem to be telling the same story of Lois is dead Superman does this",
            "start": 1520.08
        },
        {
            "text": "the background I'm not doubting myself but I it seems like I might still be in the Injustice 1 World cuz the statues in the back seem to be telling the same story of Lois is dead Superman does this then this happens but then it showed on the other side like Lex rebelling and taking over I don't know what's happening I was wrong about something you asked me what something said and I thought it said \"is crisis\" but it says crime I know yeah yeah they were ate you live on the internet for that didn't they yeah things happened I don't know I saw it today though that's the first thing I thought I'm like I can't trust him anymore yeah you can't trust me at all you know what you can't trust me about The Legend of Zelda I said I wasn't going to talk about it on this Gamescast but I'm too excited so I want to at least give a little bit of a a a tad what Kevin like keep there okay do you want me to go beat him to death yes I would like that he looks intimidating when he stands up so got to play",
            "start": 1555.84
        },
        {
            "text": "I want to at least give a little bit of an idea of what Kevin likes, keep there okay. Do you want me to go beat him to death? Yes, I would like that. He looks intimidating when he stands up. So, got to play Zelda today, yeah, all your dreams are that's pretty cool. You're going to give it a face, uh, what's up? Are you going to give it a face? Give it a face, you're going to give it one of our Kinda Funny games. Oh, oh yeah. So the big question going in, um, this is kind of weird because we're posting a lot of content that we recorded out of order, so I'm sorry if this doesn't necessarily make sense. But earlier, earlier we right now driving recorded uh on the GameSpot set, our game of the show thing, and which was very different than last year's game of the show. Last year immediately our first segment out of the gate was Game of the Show. We gave away all of our stuff; we all knew exactly what it was. This year jokingly we're like let's do that again, and it totally didn't work, which I thought is pretty cool because this year no I",
            "start": 1589.6
        },
        {
            "text": "show we gave away all of our stuff we all knew exactly what it was this year jokingly we're like let's do that again and it totally didn't work which I thought's pretty cool because this year no I don't I think that it has more to do with the showing of games um I think that there's is there's a lot more to think about this year in terms of e3 and I think there's a lot more games that are not so much at the here's a trailer it's more here is a demo here is gameplay here is enough to think about and to consider as a game of the show potential face winner you know and uh I I'm very excited about that because we we're going to have to make another game of the show thing probably later in the week after we play a bit more of the games because like Colin needs to play Zelda like this I cannot wait to hear what he has to say about it cuz I definitely think it's right up his alley um it's simultaneously not what I expected um and exactly what we thought it was going to be",
            "start": 1631.92
        },
        {
            "text": "like this I cannot wait to hear what he has to say about it cuz I definitely think it's right up my alley um it's simultaneously not what I expected um and exactly what we thought it was going to be interesting yeah it's like it's it's an open world Zelda you know the Skyrim Zelda that we've we've been talking about but it doesn't have at least from what we've seen like the I we saw like a 40 minute thing it was me and this guy playing and um there's not like towns and stuff it's not like at least in what I saw and that's the thing is like the the demo he was telling me that what we were playing is 1% of the game and it was a big giant map this game is huge huge huge okay and I was shocked because I was like all right cool this area is the grassy part then there's a snow part whatever whatever he showed the map and kind of zoomed out and I was giving him **** and I'm like what that mountain over there we can see in the distance show me where that is on the map and then he",
            "start": 1670.0
        },
        {
            "text": "whatever he showed the map and kind of zoomed out and I was giving him **** and I'm like what that mountain over there we can see in the distance show me where that is on the map and then he like he's like oh you can actually put like a waypoint thing on it and go to the map and look and it's like it was so far away and I was just like damn like that that's really really crazy that there is the sense of scale is there and it's it's very it's beautiful it's very Grand when you look at the the whole thing but I was shocked that like the the snowy section and stuff it's not as uh compartmentalized as as worlds tend to be where it's like well here's the Rocky Mountain and here's the grassy null and here's the snowy thing right it it was more go under water exactly it was like there's a lake obviously that's going to feature the the water Stu but it's like but uh there was more um kind of fluidity between it's not just one snowy area the snowy areas wherever it's cold and like",
            "start": 1712.24
        },
        {
            "text": "a lake obviously that's going to feature the water, but it's like, but uh, there was more um kind of fluidity between it's not just one snowy area, the snowy areas wherever it's cold and like the there's a temperature system now there's a lot of new systems in this game, it's very unsold I think that's the thing that I didn't expect that surprised me um even though we all kind of going into what we were saying oh yeah we want Skyrim Zelda or we want Witcher Zelda or whatever it's like seeing this now I'm like oh my God Nintendo did something different okay like it's it's the most un-Zelda Zelda game and that's saying something cuz Zelda's kind of been all over the place with the experimental stuff but this one it's it's really different and this all feels good though it all feels right it oh it feels right it feels really right um I'm a little bit worried about how big it is cuz I'm not such a uh you know gamer a gamer that likes to play these like giant 120 hour quests like I I",
            "start": 1752.84
        },
        {
            "text": "it oh it feels right it feels really right um I'm a little bit worried about how big it is cuz I'm not such a uh you know gamer a gamer that likes to play these like giant 120 hour quests like I I don't want to do that I I definitely like the more tightly nit Focus things but it won me over like I want to play this and going into it what I was talking about in the the game of the show thing um I was saying that I was thinking I was going to give my my game of the show nod to Horizon yeah having just seen the Zelda trailer I wasn't that impressed by it I was like this looks great it's The Legend of Zelda obviously we all know it's going to be good but it didn't wow me in the same way that Horizon I gave it my game of the show last year to Horizon and this time I was like they wowed me again like it looks awesome this looks like a game that I really want to play and honestly I wish Zelda looked like that like they have very similar Aesthetics and especially after playing it now and then seeing it",
            "start": 1795.36
        },
        {
            "text": "awesome this looks like a game that I really want to play and honestly I wish The Legend of Zelda looked like that like they have very similar Aesthetics and especially after playing it now and then seeing it more I I I really really believe that where the color scheme's very similar the the focus on these animals and just kind of like these animals with glowing blue things it's like there's a there's lot of similarities there and man Horizon Zero Dawn is just so gorgeous because it's gorgeous whereas Zelda is gorgeous because of its design and I just can oh man n x you got to give it to us X is going to give it to you don't worry about it but anyways for more The Legend of Zelda we're going to we're going to put up a a let's play commentary thing where me and you are going to go through it don't know when that's going to happen but keep your your eyes peeled Keepers to Kinda Funny.com um anything else Telltale Batman was really good too yeah so I'm Batman kick no you us talk about The Legend of Zelda all the time I can't talk about",
            "start": 1835.8
        },
        {
            "text": "but keep your eyes peeled Keepers to kinda funny.com um anything else Telltale Batman was really good too yeah so I'm Batman kick no you us talk about Zelda all the time I can't talk about Batman that's no big deal do you want to talk about it more I just said it was really good voice acting is good you already had your moment earlier talking about it yeah but I you it was you forced me through it like I let you talk about all I remember how I did like the com you talked about Lego forever forever God everybody hates me Colin was here he was here that all these are just facts we're in a room ladies and gentlemen this has been I don't remember the first ever something Day One E3 2016 Gamescast we're going to be doing a whole bunch more of these probably one for day two probably one for day three day three including special guest test should we announce this you can try I'm going to try things might change but we're trying to get Xavier Woods a up up down down gaming he says",
            "start": 1876.92
        },
        {
            "text": "day three day three including special guest test should we announce this you can try I'm going to try things might change but we're trying to get Xavier Woods up up down down gaming he says he's coming Murph says he's coming Ms. Murf oh no Murph we can get Ms. probably too if you want Ms. we have videos with MS and Logic going up too that was cool and money you should just stay tuned youtube.com/ of funny games subscribe there for all of your needs we're on our way to 200,000 subscribers thank you very much for that um until next time thank you Greg I'm done he saw Zelda he saw it's all he wanted now he's going to fade away break up into little pieces of paper and go off in the remember when that happened with The Sandman at the end of Spider-Man 3 that was a bad movie",
            "start": 1915.0
        }
    ]
}