{
    "id": 1794,
    "video_id": "o95xttjBs9k",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "PlayStation E3 2016 Predictions - Kinda Funny Gamescast Ep. 73 (Pt. 4)",
    "description": "We predict Sony's E3 2016!\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1465477203,
    "duration": 1249,
    "transcript_chunks": [
        {
            "text": "Ladies and gentlemen, it's time for Greg to take it away... Dots, dots, dots, dots. That's right, everybody, dots. It's time for the first ever PS I Love You XOXO crossover with the Kinda Funny Gamescast! Hi Tim, hi! Thanks for coming to join us. You're welcome, Tim. Are you aware of what we do every E3 con? And I... I've heard a bit, you know, especially from Colin. What we like to do is we like to predict what will happen at the PlayStation press conference. We make five predictions each; one of us will make five predictions each prediction needs to be different, so we can't both say they're going to cancel the PlayStation 4. That's why we asked you to make backup predictions just in case. You get there now, of course. There's five predictions. Colin Moriarty will find a way to break his into seventeen parts that way he can eek out tth of points to beat you and then make a big deal about it but then tell you you have the ego that's how he'll do this that's how this happens every year so Tim yes.",
            "start": 0.31
        },
        {
            "text": "We predict Sony's E3 2016! Tim, are you prepared? Oh my God, yes. Would you like to lead off? I would like to lead off. I'm going to lead off with Final Fantasy XV. I think it will be at the Sony conference. I think that they will announce a PS4 Bundle okay with Final Fantasy XV and the kicker to all of this is the Final Fantasy VII demo, with the Final Fantasy XV remake exclusive to PS - no, not exclusive. The demo will be with everything, but the bundle is the cool exclusive thing. But I think the big news is that the Final Fantasy VII remake demo will be with 15. Okay? Are you going to buy the bundle? No, I have a PS4. I know, but you're a big fan. Didn't know just check okay never mind. I will buy the game. Oh good, I'm glad thank you for doing that and I will play the remake.",
            "start": 48.44
        },
        {
            "text": "you going to buy the bundle no I have a PS4 I know but you're a big fan I didn't know just check okay never I will buy the game oh good I'm glad thank you for doing that and I will play the Horizon Remake Demo First Colin what's your first PlayStation prediction for E3 2016 where do I want to begin Horizon Zero Dawn will be shown it will be delayed they'll announce a game or they'll announce a release date of February 2017 so a specific date will be announced for February Horizon Zero Dawn will come out they'll apologize there'll be a new trailer new gameplay Hermen or Angie will come on stage he's my boy be like you know we're sorry we need a little bit more time um but to get you guys excited here the systems and mechanics of the game they show it it's probably going to be the biggest game that they show there um and but I don't think it comes out this year I think they dated for February 2017 nice TRC that was one of my backups you don't get to steal this from me I'm swinging for the fences right",
            "start": 99.92
        },
        {
            "text": "there um and but I don't think it comes out this year I think they dated for February 2017 nice TRC that was one of my backups you don't get to steal this from me I'm swinging for the fences right away ladies and gentlemen the conference ends with a Naughty Dog teaser trailer it's The Last of Us brand Ashley Johnson's Ellie is not present those my three parts to get some **** points out of this thing CU I think I think they're going to do it crazy person dude Uncharted three and then a month later we had the last of us teaser trailer that's all I'm saying it's not crazy it's Uncharted for it you've had three months now two months now to make a **** teaser trailer it's not that hard I had that I had that as well last of was two teaser trailer but see I I got I danced around there so I get more points if was not a Last of Us teer trailer you I said naughty dog teaser trailer conference ends with it too see I did that you'll learn you peppered these in there you get these little",
            "start": 149.0
        },
        {
            "text": "I get more points if this wasn't a Last of Us teaser trailer, you said Naughty Dog teaser trailer. Conference ends with it too see I did that, you'll learn. You peppered these in there, you get these little things gotcha. So I get something out of it. I had another slash, but I'll say in Cas you guys say some stuff don't get me wrong. I know it's wishful thinking on a lot of fronts, but I do think that they seem to have this cadence now of \"that's man, you got to keep going.\" And I think that is also a big way to end that. I think cuz I think Sony's going to have a very solid concrete thing of like here's this game and here's this when it's coming, here's this game and it got delayed but it's still coming. Here's this game and I think you need something that's looking far forward because I think that's what it is. I don't think it's going to be we're showing The Last of Us two teaser trailer or whatever to then lead you into thinking it's out next year, yeah no way Tim, what's your second",
            "start": 188.92
        },
        {
            "text": "think that's what it is I don't think it's going to be we're showing The Last of Us Part II teaser trailer or whatever to then lead you into thinking it's out next year yeah no way Tim what's your second prediction gonna jump around here you know what **** it I'm going I'm going in order of how I had it the Neo yeah will be shown it will be officially called the PS4K okay 399 price tag November 2016 release with a PS4 price drop down to 300 now here's the thing I was talking about the **Year of Dreams** we're getting the Tezura your dreams Sony's trying to make fans happy here this is doubtful but I don't give a **** I want it to happen some type of trade in service we can yeah this is wishful thinking totally I know you're the King of Wishful Thinking but Sony Sony's been been trying to make the people happy yeah so I I I think that it you know from a business perspective I can't wrap my head around how this would happen especially",
            "start": 224.92
        },
        {
            "text": "Thinking but Sony's been trying to make the people happy, yeah. So I think that it you know from a business perspective I can't wrap my head around how this would happen, especially because they aren't GameStop, they aren't you know doing this type of stuff, but they are also the company that made the video about how to play your old games and like talking **** to Microsoft. So I do think that they understand the feedback they've gotten from all of this. And I wouldn't be surprised if even if this like the trading thing could just be some form of discount on the new one if you have an old one or something, but it's some way to appease people that already have a PlayStation 4 and either like enticing them to upgrade or letting them know that they're being thought about. The thought I'm of two minds on it, on the one hand they've had time to see this reaction, see how mad people got get and try to they definitely have to figure out all of their phrasing marketing how",
            "start": 276.08
        },
        {
            "text": "the thought I'm of two minds on it on the one hand they've had time to see this reaction see how mad people got get and try to they definitely have to figure out all of their phrasing marketing how they're going to tell you that this is a good thing but not something you desperately need the other hand of course is that I am part of the crew that was like convinced that oh they're launching the PS Vita they'll have some kind of system for me to get my UMDs onto this device I'll go and do a GameStop and put it in a thing and get a little no **** you got none of that **** all right well I agree with you on the on the PS4.5 in terms of the price I will say I say I will say and this is not part of my prediction that it's going to come out alongside VR October is what I said so um but I will say that they'll also announce three different things about Hardware there'll be a PS4 slim model announced and will come out the summer we'll cost $249.99 real quick I'm sorry is this predictions",
            "start": 316.6
        },
        {
            "text": "Say that they'll also announce three different things about hardware. There'll be a PS4 Slim model announced and will come out this summer, we'll cost $249.99. Real quick, I'm sorry, is this prediction okay? Prediction $249, yeah. And they'll drop PS3 and Vita both to $99.99 each. Um, I think they'll announce all of those things so the that... I'm sorry, run me through your prediction, the so the prediction proper is PS4 Slim not the PS4K, $249.99 out this summer, PS Vita, $99, PS3, $99. Okay, gotcha man. And for the record, you agree with Tim's $399 price point? You just left it off. Yep, gotcha okay cool. My my Neo prediction was it's coming out in October, $399, it's awesome, no one's mad anymore, that's so funny. My second prediction is October makes a lot more sense, I'm sticking with my November just for the sake of this, but you say you guys are over on the October number two. For me, Hideo Kojima is in the building, he takes the stage, he gives more details on his game with concept art behind him maybe.",
            "start": 356.92
        },
        {
            "text": "The sake of this but you say you guys were on the Octo number two for me Hideo Kojima is in the building he takes the stage he gives more details on his game with concept art behind him maybe there's a video teaser maybe but I don't believe it I had that down as well I had Konami on stage you **** now I believe I'm glad you believe in me thank you I guarantee he does something there you can't you can't have the one and only Hideo Kojima and not have him come out on stage do stuff yeah good way to end it too just have him come out and you know just it's just a team rallying thing his name is one of the few names that has that power I mean if you so here's all right so we're setting up a conference now now we're doing the fun thing where we get to build a fake conference if if using what you're talking about and what I'm talking about where at best a teaser trailer probably concept art you lead off with it **** crazy ass Montage you know PlayStation is the best place to play",
            "start": 410.88
        },
        {
            "text": "what you're talking about and what I'm talking about where at best a teaser trailer probably concept art you lead off with it **** crazy ass Montage you know PlayStation the best place to play greatness waste darkness and then just over ladies and Gentlemen please welcome Hideo Kojima and like that place goes nuts and he comes out and he gives his translated speech about how why he came to PlayStation what he's hoping to accomplish here's how my game looks you know concept art and D the **** stick figures yeah here's my redesigned Mega Man you're not making Mega Man could you son I'll do whatever the **** I want blof I'm not to be trifled with all right so we're on three now yeah number Tim oh Destiny 2 teaser at Sony's conference okay you and you you're saying from what we were talking about earlier you're tacking that on what we're talking about earlier on the Gamescast available at patreon.com/games uh you're talking about tacking that on So You Think I I believe if I don't know",
            "start": 455.24
        },
        {
            "text": "about earlier you're talking about tacking that on So You Think I believe if I don't know if they're in Destiny 2 but I do think it makes sense to be like here's the next giant piece of Destiny DLC yeah and all one more thing kind of thing and they just do it's all like yep I I think it'll be just a teaser but I do think it'll be mentioned at the Sony conference okay Mortal God of War will be revealed uh will not be called God of War 4 it'll be called God of War: Something it will be Norse related uh Sony Santa Monica creating it 2017 release window um and it's going to be the Showcase game for Neo ah so you think they they introduce Neo explain to you what it is and like let's look at a game on Neo it's got of War we'll get into that oh my apologies I'm sorry I'm sorry didn't realize your three was bleeding into and they're four they may or may not number three Ed",
            "start": 503.96
        },
        {
            "text": "let's look at a game on Neo it's got of War we'll get into that oh my apologies I'm sorry I'm sorry didn't realize your three was bleeding into and they're four they may or may not number three Ed Boon gives us an Injustice 2 demo PlayStation gets some exclusive character for the hell of it I'll say Guy Gardner who do guy who the **** is guy he's a Green Lantern he was a hothead though man you'd like him Colin you'd like him he he was fiery got punched out by Batman once no it was a big moment because that Justice League sucked Guy Gardner kind of sucks but he's one of those guys that sucks so we all kind of like him you know what I mean he's bad he's so bad he's good one time he turned into two a guy called himself the Warrior this is after he gave up the Green Lantern ring he would like morph into this really muscular guy with tattoos really dumb really dumb next prediction Tim my boy Crashy B he's coming out Crash Bandicoot will be announced crash here's my thing something crash",
            "start": 548.04
        },
        {
            "text": "morph into this really muscular guy with tattoos really dumb really dumb next prediction Tim my boy Crash Bandicoot he's coming out will be announced on PS4 or some form of Crash collection okay I'm hoping for Crash they know people do is it too early yeah is there a ridiculous amount of things saying it's not happening yeah and I'm standing with them in a perfect dream this isn't prediction this is dream time not prediction time dude comes out in the costume with the megaphone what if Shawn Layden's in the costume in the megaphone hell of a hell of a **** if you got Sony if you're watching and you need a Crash Bandicoot Jesus Christ can you imagine how can you imagine that would be the best what if we just got you the suit in the megaphone and then",
            "start": 588.56
        },
        {
            "text": "if you got Sony if you're watching and you need a Crash Bandicoot Jesus Christ can you imagine how can you imagine that would be the best what if we just got you the suit in the megaphone and then just like we have to get him backstage and then you just come out Shuhei Yoshida's out there talking about VR you just come out I'm not going to leave you hanging dead don't ride announced Sony Ben's new game fall 2016 PS4 exclusive ready to go looks great Detroit: Become Human we'll get a huge spot at the conference then it's revealed that it's coming this fall wow yep quick that quick huh 2012 they showed the PS3 tech demo 2013 they said they were in pre-production they revealed it in 2015 like it's been cooking it's not I mean that would be pretty cool that and that's the thing is like and they've been re-releasing their old games on PS4 get everyone ready okay I like where your head there's something there I think there's something there and that that is definitely me hoping but I feel like that is",
            "start": 645.08
        },
        {
            "text": "their old games on PS4 get everyone ready okay I like where your head is there's something there I think there's something there and that that is definitely me hoping but I feel like that is the kind of game that it's not like it's going to get a million TV commercials you don't need to invest all the stuff for the people who care they're going to totally get that and everybody will care that would be exciting that'd be awesome so is it my last one yeah number five okay how do we play this then if I if we have more predictions we'll go through them we can go through them so this is my last final one that counts towards the game okay all right all right I got an easy one but I'm going to go for the the more points one if Persona 5 release date announced for America day and date with Japan September 15th yeah you Final Fantasy XV I think I think I think you're right I mean I don't know that it's going to be there but I do think the game's coming out in",
            "start": 693.64
        },
        {
            "text": "America day and date with Japan September 15th **** you Final Fantasy XV I think I think I think you're right I mean I don't know that it's going to be there but I do think the game's coming out in September same day the awesome God damn I hope so I think a lot of the delay has to do with localization the only thing that I'm I'm feeling iffy about is I don't know if Sony will have them do that and Final Fantasy XV do the console good point conference but whatever double or nothing here last one that counts I think that all so this is gonna be a vague one I don't know if you're going to allow it but we're going to try it anyway all first party games they're going to come out in the beginning and they're going to announce the Neo right 4K whatever all games that were announced for first party will be shown running on Neo this will cause massive controversy about what games are shown running how and how the games look on Old PS4s um and Sony is gonna have their hands full in a PR in a",
            "start": 732.52
        },
        {
            "text": "will be shown running on Neo this will cause massive controversy about what games are shown running how and how the games look on Old PS4s um and Sony is gonna have their hands full in a PR in a PR respect is this going to be traditional uh PlayStation **** up at a press conference where they don't announce that they don't say that everything's running on NE I think I think they might say like everything you see today will be running on Neo but they're never going to show the way the games look on the old consoles and that's going to cause a lot of problems for them that's my pred that's my prediction there so like Horizon God of War Detroit: Become Human all these games Crash Bandicoot that's my prediction is that they show everything running on on the new hardware not on the old hardware and this causes some sort of controversy because we do not know how the games are going to look for the other consoles and this is where things get start to get a little muddy for them that's",
            "start": 778.2
        },
        {
            "text": "and this causes some sort of controversy because we do not know how the games are going to look for the other consoles and this is where things get start to get a little muddy for them that's that's my final prediction all right my final prediction the word Vita gets said no more than three times and I'm including anybody who comes out and it's like and it's crossplay on PlayStation 4, 3 in Vita that's one that's that counts as one I like it cuz that's that is all they're going to **** say said the word said I don't know why it's some Montage behind them some other dumb thing they show the Vita no said a human being says VITA no more than three times that's excellent so what you have left over left over I had Last Guardian gameplay demo obviously but I think release date at the end of it m m m one that is it's a crazy pie in the sky but I've been saying it so much Last Guardian is out now on PS they finished the demo and they're like and it's available tonight on PlayStation Network",
            "start": 818.68
        },
        {
            "text": "Mmm, one that's it's a crazy pie in the sky but I've been saying it so much The Last Guardian is out now on PS; they finished the demo and they're like, \"And it's available tonight on PlayStation Network,\" and people go crazy. I think that's suicidal for them. I do too. I know, but I... And then it's available in a week or whatever two weeks in stores. I agree that it's messed up, but I also think it could be an awesome move. And my last one was either Last of Us 2 teaser or Uncharted 4 single-player DLC, which would have you play as Sam. Oh yeah, yeah, interesting. Interesting that'd be cool. I don't think it'll be both though. Sure, no, I don't think so either. Call... Uh, I predicted one; I only had two leftovers. One was because there were a few that people had used the mine or the ones that I came up with too. Uh, one was that uh multiple first-party games will be showing PSVR as support. I was thinking games like Detroit: Become Human and God of War. So you mean like full immersion? Okay... And the...",
            "start": 862.96
        },
        {
            "text": "up with too uh one was that uh multiple first-party games will be showing PSVR as support I was thinking games like Detroit: Become Human, and God of War so you mean like full immersion okay um and the the one that I wanted to use but I didn't was that I think the conference will end with Bloodborne 2 ah uh revealed and teased so like just a logo uh they'll come out and say like FromSoftware in Japan Studio collaborating on it we'll have more information in the future on it that's a good one the one that almost made it but didn't make it but I want to make it because I want to make it is that the Spider-Man game gets a teaser trailer it is PlayStation exclusive that rumor has been kicked around forever and ever and ever that Sucker Punch is working on it I feel I feel good about it I feel good about Spider-Man in some for the thing is Marvel needs to have some big game and I feel like that there's been so many rumors seems like the one that's been exactly so",
            "start": 905.72
        },
        {
            "text": "I feel good about Spider-Man in some form. The thing is, Marvel needs to have a big game, and I feel like that there's been so many rumors, seems like one that's been exactly so many Spider-Man rumors, this is the one that seems to make sense that they've been working on, and again I want it to be Sucker Punch, and I wanted... and I just like when I looked at the uh Gaff thread that day and I saw the infamous collection with the demo for it, it was like Jesus Christ, please be true. Jesus Christ, please be true. All right, all right, cool, cool. So now twisting it back towards the Gamescast, what else you want to talk about? I'm trying to see what else we got uh that Sony could talk about Horizon delay. I agree, I think that'll occur uh no man's Sky. What do they do if they're smart? It's a teaser, it's in the teaser Sizzle reel. Like let's not kick the Hornets' Nest get the internet up again, it let's not for like the E3 show you this game and",
            "start": 944.56
        },
        {
            "text": "what do they do if they're smart it's a teaser it's in the teaser Sizzle reel like let's not kick the Hornets Nest get the internet R up again it let's not for like the E3 show you this game and make you try to understand what it is it's coming you know it's coming there was an Uncharted it's been all over the place it'll be there um Shenmue any mention at all no I can see a mention somewhere but I don't think it's like it's Prime Time placement or anything No Man's Sky to I wish but no uh Persona 5 I I mentioned it in my think I think it's I think it's there yeah I do and I do agree with you I think it's coming out in September so in in terms of that like with the JRPG kind of battle going on do you think Final Fantasy is that their event no not at all no what do you think they do show up what Square yeah uh nothing I think that like you know they I think Persona is going to be the main JRPG at this show I think it's time for Atlus to take the stage and get that kind of",
            "start": 985.72
        },
        {
            "text": "They do show up, what Square Enix, yeah, uh, nothing. I think that like you know they I think Persona is going to be the main event at this show. I think it's time for Atlus to take the stage and get that kind of stuff. I think that I think I like the idea of a PS4 Bundle for Final Fantasy XV. I just don't know that that's in the cards. Um, I think we've seen enough there's bad mojo with Final Fantasy XV at Sony conferences. Let's just say that. I think it's time you move on and uh Square Enix just is weird with these conferences and stuff like that. I think I would love to see Atlus have their spotlight with Persona. I don't think you do both, so see. I don't know. I mean I feel like they killed it a couple years ago at Sony's conference when they gave the the trailer that announced it was Final Fantasy XV and the Kingdom Hearts III trailer. Yeah, but Kingdom Hearts III is nowhere to be found. You know, like like this is what I'm talking about the Final Fantasy VII thing where they were like we're working on Final",
            "start": 1033.32
        },
        {
            "text": "the Kingdom Hearts 3 trailer yeah but Kingdom Hearts 3 is nowhere to be found you know like like this is what I'm talking about the Final Fantasy VII thing where they were like we're working on Final Fantasy VII and then like later on like Square Enix even knows he's producing it and yeah it's three it's three Square Enix parts and we're never going to see it it's three games Final Fantasy VII apparently too big to be one game even though it was one game in 1997 I feel good I feel good about the Final Fantasy VII thing because we saw it last year E3 when it was first announced and there was that whole trailer or whatever and then we saw it at PSX and that was the thing to me where I'm like what the heck I didn't think we were going to see this thing for ever I don't think you're going to see it forever I I think that a lot of that Team is all hands on deck for Final Fantasy XV I don't think anyone's even working on it that's that's my prediction like I lit don't think anyone's even working on",
            "start": 1075.56
        },
        {
            "text": "I think that a lot of that Team All Hands on Deck for Final Fantasy XV. I don't think anyone's even working on it, that's my prediction. Like I lit don't think anyone's even **** working on that game. I don't, I refuse to believe it. Infamous Collection has been thrown around a bit; no, it's that is wishful thinking that was that Reddit thing that was too good to be true that was the one that made me cry in the bath that' be great but can you imagine **** playing uh and then yeah VR how much do you think's given to VR? Think a lot of time that was one of my ones where I almost doubled back to last year prediction of at least at you know minimum 20 minutes of VR talk, but it is so hard to show it is a big deal. I think you do do a giant segment on it being I think it's probably what 10-15 of you talking about it here it is probably 10 this is the unit remember here's the price we're going to I wouldn't be surprised if uh tomorrow we're putting out more pre-orders that was such a big",
            "start": 1108.84
        },
        {
            "text": "Of you talking about it here it is probably 10 this is the unit remember here's the price we're going to I wouldn't be surprised if uh tomorrow we're putting out more pre-orders that was such a big deal they went so fast we've got another allotment coming for you to get it on the day first day here's where you can get that thing uh there's ways to do it but then yeah like we even saw it you know it was PSX right the Richard Marks demo with the disc that failed or whatever like they want to take that chance again I would I would be one of the big things I think you'll see is here's the PlayStation VR again these are some of the 90 whatever they said how many games was it that was going to be available by the end of the year like 76 or what I don't know just a bunch of numbers we want to show you a new one and I I think it'll be a AAA game it'll be like a a game name you know it'll be like not Bioshock but Bioshock right it'll",
            "start": 1149.48
        },
        {
            "text": "We predict Sony's E3 2016! We want to show you a new one, and I think it'll be a AAA game. It'll be like a game name, you know - it'll be like Bioshock, but Bioshock right? It'll be something where it has resonance to PaRappa the Rapper. PlayStation All-Stars Battle Royale is back in a first-person fighter; you use the Move stick, but you can only play as Toro. Oh my God, yes! Yes, ladies and gentlemen, this has been the first ever episode 73 of the Kinda Funny Gamescast E3 predictions. I thought this was a damn good episode - told y'all it was worth a dollar. And if you're watching this over on PS I Love You... I already cut it out; I already cut it off. D, you're not... I guess till next week. I love you.",
            "start": 1190.48
        }
    ]
}