{
    "id": 1850,
    "video_id": "OP9RN5JeTvM",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Detroit: Become Human Behind Closed Doors E3 2016 - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\nGreg got to see Detroit: Become Human behind closed doors at E3 2016!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation",
    "published_at": 1466033430,
    "duration": 334,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening Kinda Funny is going all out with Let's Plays and reaction videos all week long subscribe now at youtube.com/kindafunnygames to not miss a thing what's up everybody I'm Greg Miller and this is the pride of Long Island Colin Moriarty, it's good to be here with you Colin we're behind closed doors at the PlayStation Booth you know this is it this is the whole booth this is the whole booth you got to just go see Detroit: Become Human behind closed doors tell me everything you know how excited I am it's awesome it's really cool I think this is going to be well indicative of what we've seen so far I don't want to state much but Beyond Two Souls was a big disappointment I think for a lot of people for me and you yeah just speaking personally it previewed fine but I had my reservations about it even before it came out um and then when it came out it just wasn't up to Heavy Rain standard right Sucker Punch Productions obviously made Heavy Rain one of the great PS3 exclusives",
            "start": 0.16
        },
        {
            "text": "reservations about it even before it came out um and then when it came out it just wasn't up to Heavy Rain standard right Quantic Dream obviously made Heavy Rain one of the great PS3 exclusives one of the really great games on that console this game seems like a return to form and is really really really cool and I really think you're going to dig it so what what's happening what did you see what made it cool so we saw the same thing that we saw in the trailer uh the android they played it twice and both times they played it actually different things happen and so basically what they were trying to show was how little things in the environment and little things you do can can affect the outcome okay so by the way Shu she's right scene hey sh you want to come here come get a hug on camera come here Shu it's fine we're talking about we're talking about the uh the their uh the David Cage game you know David Cage game oh yeah yeah did you see he did he likes it a lot he says oh it's it's",
            "start": 37.08
        },
        {
            "text": "Here Shu it's fine we're talking about we're talking about the uh the their uh the David Cage game you noce - David Cage game oh yeah yeah did you see the he did he likes it a lot he says oh it's it's excellent it's excellent so far it's about Detroit right it's about Detroit yeah no no it's not about Detroit it's about I'm sorry I didn't actually see it they didn't give you they didn't give us an interview slot with you this year and I just wanted to express great disappointment in that in the entire - Jenine, Jenine do you want to come on camera get yelled at? That don't she came real quick though on camera okay okay go go go do your job we'll do ours all right these fans they just come out of the woodwork these PS I love you XOXO fans so one of the cool things that appears so you're playing as Connor the Android first of all they confirm that there's going to be more than two playable characters so we we know we're going to play Conor con but we don't know anything El",
            "start": 74.96
        },
        {
            "text": "So you're playing as Connor, the android first of all. They confirm that there's going to be more than two playable characters, so we know we're going to play as Conor, but we don't know anything about Conor's an android. He's called in, as we saw in the trailer, to deal with a hostage situation. Um, what you learn is that quickly is that Connor has this power of perception using his mechanical mind, I guess, or his AI or software, um, to figure out his exact like exactly his chance of success of his mission and you can... and so this thing is ticking down from like 47% to 46% based on how quickly you're going through it or because time is of the essence here. But you stop and analyze different things and your success goes up or down depending on like the things you do. So he finds like a guard that Daniel, the android, had shot and killed and he figures out how that all happened and his percentage goes up a little bit. And then he finds the little girl's dad that the Android killed and finds",
            "start": 113.36
        },
        {
            "text": "Daniel the Android had shot and killed, and he figures out how that all happened, and his percentage goes up a little bit. Then he finds the little girl's dad, who the Android killed, and finds the tablet that the dad was looking at. It looks like they're looking to replace Daniel, so that's why Daniel goes crazy. So the chance of success goes way up. But as time goes on, success drops down, down, down, down, down. So when he walks out, he sees an injured police officer that Daniel also shot, and he gets a tourniquet on him, but that time taken and the trust loss between him and Daniel brings the P percentage back down. So the first time they played, we go through all these choices, and ultimately Connor saves the little girl, but gets shot and killed, and Daniel's killed as well. Okay, so you succeed because the success is uh keeping the girl alive, which is keeping her alive. But you lose Conor for the rest of the game. Gotta um... oh, so it's just like Heavy Rain, where if somebody dies, the game keeps moving.",
            "start": 153.12
        },
        {
            "text": "because the success is uh keeping the girl alive is keeping her alive but you lose Connor for the rest of the game gotta um oh so it's just like Heavy Rain where if somebody dies the game keeps moving it's not every they said every main character can die um and so they play it again uh Daniel does all these things to to heighten the success way high ends up using a gun which he's not supposed to under the Android Act as they call it shoots the guy in the head the little girl is saved he's fine takes the cartridge out of the gun gives it to a police officer and moves on but what's really cool is all the environmental storytelling and the things that you can do basically like you have to move quickly but you can also base the time spent uh like the danger of spending too much time with the benefit of finding things that increase your your possibility of succeeding okay okay um so sounds complicated but it's actually super straightforward and it's like really cool you know like",
            "start": 190.84
        },
        {
            "text": "the benefit of finding things that increase your possibility of succeeding okay okay um so sounds complicated but it's actually super straightforward and it's like really cool you know like I'm I'm super about it it's really it's really like kind of a relief actually because we know we know what Detroit: Become Human was capable of Quantic Dream was capable of Beyoncé Souls so then my questions for you were I'm sure David Cage was in there talking any hints at a release date and any hints of are we always playing as Androids are we going to have some human characters in there how are we getting the story no so no talk on if we're only going to play as Androids or not okay the thing that he wants to stress with the story which I think is really cool is you know kind of alluding to not necessarily specifically but like something like Battlestar Galactica where the Androids or the are the bad guys which where the AI is the bad guy sure uh in this game it's very",
            "start": 228.12
        },
        {
            "text": "alluding to not necessarily specifically but like something like Battlestar Galactica where the Androids or the Cylons are the bad guys which was a show where the AI is the bad guy, sure uh in this game it's very much that the humans are the bad guys and the Androids are the good guys and he stresses that um most of the Androids, the millions of Androids in the United States almost all of them are fine it's just that like a few of them are up and just like starts to cause like a lot of panic but you can see with someone like David, the AI is that he's not up at all he's actually just feeling emotions based on being he's jealous and this is and this is something he's not programmed for sure sure sure it's then becoming real it's the Johnny 5 principle I think we all learned about in college you might say it's them becoming human oh ladies and gentlemen what do you think of Detroit: Become Human let us know in the comments share the video with your friends and of course keep coming back here to youtube.com/",
            "start": 265.6
        },
        {
            "text": "them becoming human oh ladies and gentlemen what do you think of Detroit: Become Human let us know in the comments share the video with your friends and of course keep coming back here to youtube.com/ kinda funny games subscribe because we're going to be at E3 for at least another day but we're not leaving this room this PlayStation Booth we're just going to sit here we're going to go play Gravity Rush 2 we're going to play The Last Guardian we're going to film those we're not going to wait in line I'll say that right now we'll put those up eventually for more reactions keep it here",
            "start": 300.0
        }
    ]
}