{
    "id": 1834,
    "video_id": "VERIL52Lf8k",
    "show_name": "Reactions",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Spider-Man PS4 E3 2016 Trailer - Kinda Funny Reacts",
    "description": "Subscribe for all your E3 2016 updates! https://www.youtube.com/c/kindafunnygames?sub_confirmation=1\n\n_______________________________________________\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino",
    "published_at": 1465927200,
    "duration": 255,
    "transcript_chunks": [
        {
            "text": "E3 2016 is happening Kinda Funny is going all out with Let's Plays and reaction videos all week long subscribe now at youtube.com/kindafunnygames to not miss a thing what's up guys I'm Tim Gettys this is Greg Miller now before we even get into this let's start off with a little little you right here bam only on PlayStation that's right Spider-Man PS4 exclusive how your ass PC players finally we got something on you you have your exclusives like Solitaire of Spider-Man not sure how exclusive that is but uh oh man this trailer this trailer is different this conference is insane there's so many good there's the big part Insomniac Games doing but yeah look at how good this looks right here look at how New York they're working in right now so awesome to have uh this is what I was talking about early on the PS I Love You the fact that Marvel is taking their properties and giving it to developers right and's saying all right you're we not a developer we own we didn't partner with one",
            "start": 0.16
        },
        {
            "text": "about early on the PS I Love You the fact that Marvel is taking their properties and giving it to developers right and saying all right, you're we not a developer, we own, we didn't partner with one publisher like Activision, this shot are you kidding me right here of him hopping through that cafe and hopping out the window see my thing there's though like gameplay how is that how is that gameplay or is that just like one of those like kind of guided thing cuz this this is what dreams were made of back in the Spider-Man two days oh yeah there you go U but this looks great I can't wait to fly through this city oh yeah but going through that it's like I don't know that seems a little too that might be just a cut scene thing of jumping through and then here's more gameplay of throwing this guy around or whatever but I mean just having a Spider-Man game that is being treated like you assume if it's Insomniac if it's exclusive is being treated like a Rocksteady Batman game but listen",
            "start": 47.6
        },
        {
            "text": "guy around or whatever but I mean just having a Spider-Man game that is being treated like you assume if it's Insomniac if it's exclusive is being treated like a Rocksteady Batman game but listen the score like I think this alone kind of sets the standard for this is epic this is a real Spider-Man thing this isn't just like a license they're not cashing in they're not cashing in at all not tied into the movie apparently not the same suit as what I'm basing that on I don't know for sure uh not tied in to the movie looks like it's Standalone property it's Marvel in their new games initiative of going to developers that are good at something and saying all right cool make a game like this and I like how they don't even have a name for really just Spider-Man PS4 is all it's called Spider-Man PS4 and also I look at it seems like it's grabbing a lot of Inspirations from a lot of stuff like so this right here is the longer kind of Amazing Spider-Man movie the most recent Sony",
            "start": 83.48
        },
        {
            "text": "Spider-Man PS4 and also I look at it seems like it's grabbing a lot of inspirations from a lot of stuff, like so this right here is the longer kind of Amazing Spider-Man movie, the most recent Sony reboot movie kind of logo, but then when you go a little bit further, this is not exactly, but it's more reminiscent of the Sam Raimi Spider-Man font. Sure, going on even I mean the big white thing on him, I was asking you with it, you're I'm of course a DC fanboy, you're more than a Marvel guy, I like I love Spider-Man as everybody does know I do review Spider-Man games historically, but and like a lot of people I was like is this anything we should call out to and you were like no it looks like it's an original suit. Kids in the chat were saying it's original, somebody hit me up saying as big as the suit is it looks like it might be Ben Riley, I'm like I know Ben Reilly, I'm not prepared to make that leap maybe it's an inspired suit yeah no I think that uh this suit is new and I also think that it is very",
            "start": 121.08
        },
        {
            "text": "It looks like it might be Ben Reilly. I'm like, I know Ben Reilly. I'm not prepared to make that leap. Maybe it's an inspired suit. Yeah, no, I think that uh this suit is new and I also think that it is very very intentional. I think that they were trying to mimic the Civil War suit but they needed to make it clear this is not a movie and I think white kind of does that where it's just like they took the hit of like all right it looks kind of stupid but whatever, this at least makes it clear everybody that this is a different Spider-Man, different Universe. It's not the comics, it's not the like it's not Ultimate Spider-Man, right? This is very clearly not Miles Morales. Yeah, this is very clearly he mentions being from Queens and everything else, right? He's nailing all the Peter Parker beats. You exactly but I mean even the the suit like it's not even the Peter Parker from The Ultimate Universe it's not even the like the Peter Parker from The the normal comic going on right now like Amazing Spider-Man",
            "start": 155.04
        },
        {
            "text": "I mean even the suit, like it's not even the Peter Parker from The Ultimate Universe; it's not even the like the Peter Parker from The normal comic going on right now, like Amazing Spider-Man. This is a new Spider-Man, its own separate thing, and that really really excites me. I also like that we don't really see any like Spider-Man villains in this trailer, yeah, and it still looks awesome, yeah. You know, there's I mean I think it's pretty clear from the way the trailer plays out it's a very early tease, and the fact that they don't have a name, they don't have like a logo; they want to show you it's just like hey we are doing the Spider-Man game, this is where it is. I assume next year at E3 we get a real blowout demo here's what it is, yeah. Color me excited. I will let us know what you think in the comments below and stay tuned to youtube.com/games for all of your E3 2016 updates also let me know if I'm slouching if I look fat Kevin, I right you look great, I looked at one of them where I was",
            "start": 193.2
        },
        {
            "text": "in the comments below and stay tuned to youtube.com/games for all of your E3 2016 updates also let me know if I'm slouching if I look fat Greg, I right you look great I looked at one of them where I was doing this and I was like oh I got some warts got some warts going on oh you look good no I'm cing all right",
            "start": 234.24
        }
    ]
}