{
  "id": 1955,
  "video_id": "d27iSbgI3gQ",
  "show_name": "PS I Love You XOXO",
  "hosts": ["Greg Miller", "Marty Sliva"],
  "title": "Do Video Game Stories Suck? - PS I Love You XOXO Ep. 46 (Guest Starring Marty Sliva)",
  "description": "Thanks to LootCrate for sponsoring this episode!\nGo to http://lootcrate.com/ps  and use promo code: ps\n\nIGN's Marty Sliva joins Greg to talk about Abzu, the good 15, and if video game stories suck. (Released 08.02.16)\n\nSubscribe! https://www.youtube.com/user/kindafun...\n\nGet you PS I Love You XOXO shirts and posters: http://www.kindafunny.com/store\n\nListen to today's artist here: www.facebook.com/goodtalkrva\n\nSubmit questions for the show here: http://www.kindafunny.com/psq\n\nGreg and Colin are back with a weekly PlayStation podcast. Catch it on YouTube and podcast services each and every Tuesday at 9 a.m. PT!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/kindafunnyvids\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1470153602,
  "duration": 6830,
  "transcript_chunks": [
    {
      "text": "What's up everybody and welcome to PS I Love You XOXO Episode 46. I'm one of your hosts Greg Miller alongside the best beer in the business Marty Sliva. Greg, it is an honor to be here. It's an honor to be here with you, good sir. This is our first handshake. I'm a little clammy. I was just I squeaked my fist. You're the Uber to see me. I can't believe I'm going to go on this show. No, thank you so much for having me. Thank you. Of course, Marty. You're from IGN.com. Podcast Beyond. Yeah. Yeah. We worked together for many years. We did. You and Colin graciously bequeathed Beyond to myself and our weird ragtag. Yep. Bunch of fools. Brian O'Connell was on here two weeks ago. Yeah. Yeah. Yeah. But now we brought you on because we're bequeathing this show to you. Yeah. We're fading back in. You can start bringing in your ragtag to run the show as well. I love this. I love this. No, of course. Call Moriarty in Massachusetts. Yeah. Real America, quote unquote, as he says. That's",
      "start": 0.0
    },
    {
      "text": "back in. You can start bringing in your ragtag to run the show as well. I love this. I love this. No, of course. Call Moriarty in Massachusetts. Yeah. Real America, quote unquote, as he says. That's real America? According to you. Well, Colin likes to be I don't know. Have you ever I don't know if you know this, the new thing is that we've finally uncovered Colin's power and it's the power of lies where he just lies about everything and people rarely question him on it or whatever. Cause he's like a man of like of ethics and morals and like you, you imagine that he's like he's like I think he's that those things. Sure. But I mean really, you know, he sits around and talks about how great New York is and how much Boston sucked or whatever. And then he lived in Boston. He was already I have to live there. You can't love those two things. Exactly. But now it's now he's now it's one of those things. He talks all this, you know, shit about San Francisco. And so he just calls",
      "start": 59.68
    },
    {
      "text": "I have to live there. You can't love those two things. Exactly. But now it's now he's now it's one of those things. He talks all this, you know, shit about San Francisco. And so he just calls everything back there. The real America, the East Coast is real America. And so now he just conveniently puts Boston into that even though he had no love for Boston. Also like real America is the Midwest. That's the heartland. Exactly. That's where real Americans. Abe Lincoln. Come on now. Yeah, exactly. Yeah. Chop salt to the earth people. We call chopped on the chestnut tree. No, no, no, no. Oh, sweet chestnut. That was George Washington. Yeah. All right. Well, remember you couldn't tell a lie and then he was wise. Yeah, I know. He told immediately. Yeah. Right. She was dead. He's like, I'm sorry dad. I chopped down the cherry tree. Oh, that was back then. That would probably was like the cash crop of his dad's thing. Yeah. Do you imagine Colin's gonna listen to this and just literally be dying",
      "start": 90.6
    },
    {
      "text": "I chopped down the cherry tree. Oh, that was back then. That would probably was like the cash crop of his dad's thing. Yeah. Do you imagine Colin's gonna listen to this and just literally be dying on the inside of our bastardization of imagine just like when I speak, Colin doesn't listen. So I can't imagine he's going out of his way to go watch these episodes. But really what happens is that one of these kids out there rats us out when we said something and tells Colin and then Colin just reads about it in a Twitter form and thinks he knows everything. Yeah. He reads he doesn't like listening or watching podcasts, but he does read the transcripts. Exactly. I think that's on the list of Colin weirdness. I don't know if that's even the top 0. That's how I a Serial Season 1 I read as a screenplay. Oh, very interesting. That's a smart way to do it. Turns out Adnan might have done it. What did you call it when you were reading it? Did you get it? His name was Adnan. Adnan. Adnan Syed. Oh",
      "start": 129.2
    },
    {
      "text": "Oh, very interesting. That's a smart way to do it. Turns out Adnan might have done it. What did you call it when you were reading it? Did you get it? His name was Adnan. Adnan. Hae Min Lee. This is a PlayStation podcast. We don't. Don't trust me. Colin, you know, last week opened up talking about poops again. So we're back to the classic Beyond. I took a real good dunk. Yeah. Yeah. I'm proud of that boy. Yeah, he did. Yeah, he did. And I was surprised by the number of you podcast listeners who hit us up to say, yes, they were also taking a poop when Colin was talking about it. That's that's the perception of poop. Yeah. I get I get worried. I'll probably listen to a podcast and I'll run into the person from the podcast. I mean, granted, it's like The Comedy Button. While you're listening to like listen to it and I'll run to Max on the train. I'm like, that's weird. I don't like that. Yeah. I like how I was like saying a podcast, like it'd be really weird to",
      "start": 165.92
    },
    {
      "text": "While you're listening to like listen to it and I'll run to Max on the train. I'm like, that's weird. I don't like that. Yeah. I like how I was like saying a podcast, like it'd be really weird to be listening to Serial and run into Sarah Koenig. Exactly. I don't know what she looks like. No, that's the trouble. But if she started talking, you'd know. Yeah. It's like Anna Sale with Death, Sex & Money. I'd lose my mind if I ran into her, but I only have a vague recollection of what she looks like. I don't know if she's got three forms, the death form, the sex form, the money form. I like the money form. You're talking about that two stories that we've never talked about in person. I don't think the time I was in LA doing a shoot and I got an I went to a comic shop and then an Uber pulled up and I got in the back and the guy turned around and looked at me and then said something and I was like, what? And then he turned up the radio and he was listening to the GameOverGreggy Show. That",
      "start": 205.2
    },
    {
      "text": "and I got in the back and the guy turned around and looked at me and then said something and I was like, what? And then he turned up the radio and he was listening to the GameOverGreggy Show. That is so weird. I was like, that's insane what he's talking about. Also, it would be so weird to get into someone's Uber and hear like a podcast. Yeah, exactly. I think that's why he turned it down, right? He was picking people up. He didn't want to worry about it or whatever. That's fucked up. And then the other one was last night. I went to the a Weezer show with Panic! At The Disco as well. And I saw it didn't so wasn't someone sitting right next to you. I walked my best friend Po walked down the line, turned into our row and literally the guy next to me is wearing the exact same Kinda Funny shirt and he just lost his mind. Josh. Josh was a bunch of kids. They were really cool. Yeah. Big fans. Uh, Marty, when we're not BS in having the fun here, when we start a PS I Love You XOXO, we like",
      "start": 236.72
    },
    {
      "text": "funny shirt and he just lost his mind. Josh. Josh was a bunch of kids. They were really cool. Yeah. Big fans. Uh, Marty, when we're not BS in having the fun here, when we start a PS I Love You XOXO, we like to talk about what we're playing. Yeah. You and I hit it off on the text thread today. Yes. We've both been playing different games. What have you been playing? I've been playing this goes up tomorrow morning at nine. Right. So I've been playing Abzû, which is out today. Yeah. Yeah. Embargo's up. Abzû is the game by Giant Squid, which are Matt Nava, who was former Thatgamecompany worked on Flower and Journey. Very much feels like a spiritual successor to Flower, especially. You are this underwater diver and it's the the the the sea is filled with all types of like actual real marine life, like squids and fish, eels, sharks. The swimming mechanic is beautiful. It's probably my favorite swimming mechanic, maybe in a game ever. Oh wow. It really has that Flower feel and even Journey",
      "start": 269.32
    },
    {
      "text": "like squids and fish, eels, sharks. The swimming mechanic is beautiful. It's probably my favorite swimming mechanic, maybe in a game ever. Oh wow. It really has that Flower feel and even Journey to an extent to where you play it with headphones and incredible score and and it just sort of is this like meditative experience. Yeah. Therapeutic. Yeah. Yeah. Short game, like two and a half hours or so. But really, really fantastic. And that's one of the summer summer play games. Is that what this thing's called? So that's the this is the second. Right. Which was Headlander, this brutal and then Bound. Okay. Bound is also cool. I can't talk too much about that, but that's very cool. Yeah. Abzû is really good. Yeah. Anyone, if if if Flower or Journey are your things, you should play this game. Incredible little two and a half hours. That's one of my favorite experiences of the year. It's been a real good year for games. Oh yeah. It's been a great year so far. It's been good for like",
      "start": 310.68
    },
    {
      "text": "game. Incredible little two and a half hours. That's one of my favorite experiences of the year. It's been a real good year for games. Oh yeah. It's been a great year so far. It's been good for like it's been amazing for indies with like The Witness and Oxenfree and Firewatch, but it's also been I mean, we had Uncharted and Quantum Break and Dark Souls and Ratchet & Clank. Yeah. We there's been a lot of triple A stuff. There's been a balance this year between the indies and the triple A's. No good Nintendo things and Pokémon Go with that as a real count. No, that doesn't count. What I should say, but I was going to say, what do you think about this NX? But let me tell you, these people are excited about an NX. They're writing into this show about it. They got a bunch of PlayStation ties. So I'm like, yeah, I'm not for these conversations. I've been playing Overcooked. Overcooked. We read the trophies not too long ago here and then we knew it was coming up. It's out this week as well.",
      "start": 351.56
    },
    {
      "text": "So I'm like, yeah, I'm not for these conversations. I've been playing Overcooked. Overcooked. We read the trophies not too long ago here and then we knew it was coming up. It's out this week as well. Another downloadable game. Uh, it's a co-op or competitive cooking game and it's totally awesome. It's and it's like it's cooking game. I it's a it's a it's similar to a Taco Master or a Diner Dash or one of those games where you're working against the clock. How many times can you get these orders? Right? Can you do all this different stuff? But you're working with your I played a co-operative. I was working with Po, my friend, local co-op running around. It's up to four players. Uh, where, yeah, you know, like the orders are up here. There's little timers running down on them and it's, you know, you have to make onion soup. So you have to run over there and get the onion and put it in the but you have to worry about them burning. And then if it's like hamburgers, you have to get",
      "start": 387.8
    },
    {
      "text": "you know, you have to make onion soup. So you have to run over there and get the onion and put it in the but you have to worry about them burning. And then if it's like hamburgers, you have to get the steak and you let you like pound it out and then out into the Patty and then get it on the grill and you have to worry about it burning and do all this different stuff. What does it look like? Like I'm really cartoony. Okay. Is it like top down? Uh, I mean like, like isometric. Yeah, exactly. Like that's that's like, okay. Gotcha. Gotcha. Right. So yeah, I said .5 whatever you call there's depth, but you know, it's not that, but what's interesting about it and what puts a different spin on it is the fact that like, cause it'd be fun no matter what of like, or not fun no matter what, but it would be interesting no matter what if they just changed like the layout of the level. So like you start off and it's okay, you got to wash the dishes before you can put the dishes back out. So",
      "start": 425.52
    },
    {
      "text": "it would be interesting no matter what if they just changed like the layout of the level. So like you start off and it's okay, you got to wash the dishes before you can put the dishes back out. So you need to do that and you're running around doing all this stuff, but then they start doing things where it's like, okay, now everything's there's just like a one square path around this square and you can't and you can't run through each other. You bounce off. So you have to be communicating about where you're going, what's going and I'm going to I'm going to work counterclockwise. You do this. Yeah. Although the game's obviously cartoony and cute, it's really interesting because that's how actual kitchens work. Like anytime you go into someone else's kitchen, whether it's in a restaurant or whether it's in someone's house, like you need to acclimate yourself a little bit like nothing feels as familiar as your own kitchen. So I really liked that idea of taking that sort of abstract",
      "start": 457.84
    },
    {
      "text": "or whether it's in someone's house, like you need to acclimate yourself a little bit like nothing feels as familiar as your own kitchen. So I really liked that idea of taking that sort of abstract sensation and putting it into a game and it's it's it then it starts getting I feel into like a Gang Beasts territory where like there's like levels where you're on a food truck or two food trucks and they separate so you have to like hop between different trucks because you can cook over here, you can fry over here, but you're like, you can only get orders out over there. So you're running around trying to do all these different things. Video games are weird, very weird, but it's like it's super arcadey. It's super fun, simple, you know star system. You know where you screwed up and it's that thing of like when Po and I got our first two stars on a level. It was like all right, let's not advance. Let's go back. We're going to start like here's what you weren't. I should be. I was like I",
      "start": 488.94
    },
    {
      "text": "thing of like when Po and I got our first two stars on a level. It was like all right, let's not advance. Let's go back. We're going to start like here's what you weren't. I should be. I was like I should be pounding meat the entire time. You know you worry about cooking. That's a Greg Miller. Exactly. That's just great. My general pound in the meat every fucking day. Yeah, even the Sabbath office, the Sabbath, the best day for pounding me. You kidding me. That's what it's all about. If you didn't know, ladies and gentlemen, this is PS I Love You XOXO. It is KindaFunny.com PlayStation podcast, so go there. Subscribe to the YouTube channels. Listen to the podcast. Have a great time. It is the number one PlayStation podcast on the Internet. It is posted every Tuesday at 9 a.m. Pacific Time. Have you ever missed that? No, not yet. And it's been fucking close. Let me tell you, cause like we'll do the whole, you know, it's a this is a my operation, my show. So I'll go back there and",
      "start": 522.16
    },
    {
      "text": "Have you ever missed that? No, not yet. And it's been fucking close. Let me tell you, cause like we'll do the whole, you know, it's a this is a my operation, my show. So I'll go back there and start processing it. And it's like, like when Colin was going to San Diego all the time and we do those shows that became like, all right, cool. Like I put it into process. It says it's gonna take an hour and a half. So that'll really take two hours. Go to sleep, wake up, go over there. Blurry-eyed it's failed. Jesus. Why I want to do it again. Wake up, put it up. You upload. There was like a bunch. We were uploading and like they just weren't taking the YouTube and there was like one day where I finally got it. I like posted it like 8:50. It was like, all right, I'm processed. And I was like, ah, that's huge. That's huge. You're upset. Upset 50 50 episodes without a without fail. That's impressive. Yeah. Especially for this fucking place. We're doing live Friday. Just all of a sudden",
      "start": 559.92
    },
    {
      "text": "ah, that's huge. That's huge. You're upset. Upset 50 50 episodes without a without fail. That's impressive. Yeah. Especially for this fucking place. We're doing live Friday. Just all of a sudden the Internet doesn't work. Well, it's not great. Well, Periscope the prize box. Let's go to lunch. I don't know what to do. Yeah. Do all that. Subscribe to show. Blah, blah, blah. Nine Aims on Tuesdays. Marty. Yes. Let's begin the show with what is and forever will be Roper's Report. Time for some singular possessive news. There are no calling. I got to do it all. Nine items. A baker's dozen. Nailed it. You destroyed it. Yeah. Thank you. You can go home now. Shit. What's this blue paper? What's going on there? We are out of normal paper and for Kinda Funny Live to yeah. Tim bought blue paper to make Tim Bucks to shoot out of his money guns. And so I didn't realize why I was like, why is this all of this blue paper? Where is white paper? And Kevin's like, I didn't order anymore. We're going",
      "start": 596.0
    },
    {
      "text": "make Tim Bucks to shoot out of his money guns. And so I didn't realize why I was like, why is this all of this blue paper? Where is white paper? And Kevin's like, I didn't order anymore. We're going to have to use blue for a while. All right. We don't do any real professional. It kind of looks like I'm on like The Daily Show or something. They use funny paper colors. This is like your brand's shade of blue. So it's good point. I didn't think that's really a point. That's probably why the money was blue when he did this. That makes a lot of sense. I didn't. There's so many things going on in my life and on this Kinda Funny train that when Tim shows up with the blue money, I'm just like, whatever, whatever. That's what Tim's doing. He's a weirdo. First story. Marty. Yes. PlayStation Plus games have been revealed for August. As you hear this, it'll be the first Tuesday of the month. You can get all of these. I want your rundown on them as we go. Right. Yeah. Tricky Towers on",
      "start": 643.0
    },
    {
      "text": "PlayStation Plus games have been revealed for August. As you hear this, it'll be the first Tuesday of the month. You can get all of these. I want your rundown on them as we go. Right. Yeah. Tricky Towers on PlayStation 4. That's a brand new game. It comes out Tuesday. Today is the day we post this. It looks like a lot of fun. Looks like a lot of fun. We're excited for when we do get a new game. Yeah, exactly. That's a cooler. That's the excitement about that. Right. I'm jumping in and actually having something on the first day and always wondering like, could one of these games become the next Rocket League? Exactly. I don't know if that's ever literally going to happen in this generation. That's how Rocket League became what it was. Yeah. I think I think for a game like Tricky Towers, it'll help. We've had I've had Tricky Towers on my PS4 for a while. Competitive local, you know, local competitive play of, you know, it looks like you're using Tetris pieces, but I believe you're building up a",
      "start": 679.02
    },
    {
      "text": "had I've had Tricky Towers on my PS4 for a while. Competitive local, you know, local competitive play of, you know, it looks like you're using Tetris pieces, but I believe you're building up a tower trying not to have it fall over or whatever and get the highest or something like that. It's like fun in that this seems like the ground. I don't know how many people would rush out to buy Tricky Towers. Just like, yeah, I'm making a physics puzzler competitive. That's Tuesday morning. You turn on your PS4 and you don't for free. That's exactly Rebel Galaxy for PlayStation 4. I didn't. I remember not getting into this. I jumped in. It was way too deep. I was just like an option and which is cool. It's sort of it's it's scratching an itch that isn't really there on PS4 and you're in a big old space sim. Yeah. Yeah. Yakuza 5's coming to PS3 for free. More Yakuza. Yeah. I'm a big Yakuza fan. Yakuza 5. I'm like, this is just the same game. I don't want to do this.",
      "start": 712.84
    },
    {
      "text": "in a big old space sim. Yeah. Yeah. Yakuza 5's coming to PS3 for free. More Yakuza. Yeah. I'm a big Yakuza fan. Yakuza 5. I'm like, this is just the same game. I don't want to do this. I need a longer break. Yeah. Yeah. Well I'm looking forward to Yakuza 0 on PlayStation 4 just because it's different. It'll be a little bit and it'll be very much similar, but it'll be at least a little bit different in not just cause has got to get the goddamn orphanage out of hock again. Like whatever. Jeez. Why is that what the stories of the game? Oh yeah, totally. And this is I think when he's still in the Yakuza before he leaves the Yakuza, but keeps getting pulled back in by Yakuza lore. I reviewed three of them for IGN back in the day. I enjoyed them quite a bit. They're fun Retro/Grade for PS3 as well. I like our target added to it. I remember it didn't get enough buzz or pop. I thought at the time the idea is that you start the game and you start at",
      "start": 745.56
    },
    {
      "text": "They're fun Retro/Grade for PS3 as well. I like our target added to it. I remember it didn't get enough buzz or pop. I thought at the time the idea is that you start the game and you start at the very end as credits roll and then there's like a time vortex that pulls you back and so you are now you're the spaceship and you're flying into the shots you shot and dodging the things you already theoretically dodge. It's on lanes like you can play with the guitar, but you play with the controller as well, but it's like it's got a really good soundtrack. It's like one of the music games, but game playing story there. Patapon 3 for PlayStation Vita. Where does this rank in the Patapon hierarchy for you? This is the best one for sure. This is the one that was the simplest to get into the most clear and easy understand it had online multiplayer, which was huge. Got to play with a whole bunch of Beyond fans back in the day. It sucks that it's just the PSP game on the PS Vita. I love trophies for a fucking Patapon. Yeah, that'd be really nice. Could this be like a litmus test like this does well. You'd like to think so, but I mean like I don't know anymore of the I think with the way they've been rolling out PlayStation Vita games for PlayStation Plus, it's totally just like just keep giving them stuff, whatever. Cause like that was like when they were like Freedom Wars in December. I was like, Oh my God, everyone please get this game and tell them how much you want it. And I don't I don't I mean a lot of people downloaded it. A lot of people did play it, but I don't think it was like it wasn't a real test. Yeah, exactly. Yeah. I'm sort of I'm nervous about the time when I imagine this time next year PS3 games will not be free and that it will be",
      "start": 783.96
    },
    {
      "text": "I don't think it was like it wasn't a real test. Yeah, exactly. Yeah. I'm sort of I'm nervous about the time when I imagine this time next year PS3 games will not be free and that it will be PS VR. PS VR thing. I think it's super smart to do it in October and be like, Hey, here we go. We're going to give you two experiences a month on PlayStation VR. Then it becomes the whole built in thing of what theoretically should have worked with Vita and did. I know for some of you out there of like, well shit, I have eight PlayStation Vita games in my name right now. Why not get the system? When I eventually get the system like, Oh, I actually have like a solid library and that'd be the same thing hopefully with VR where you have to give you enough cool experiences in there. Yeah. Yeah. Cause the one of the things I like about granted like generally I think the PS Plus games are better lineups than Games with Gold, but one of the things I like about Games with Gold is that all of",
      "start": 820.42
    },
    {
      "text": "Yeah. Cause the one of the things I like about granted like generally I think the PS Plus games are better lineups than Games with Gold, but one of the things I like about Games with Gold is that all of the 360 games are backwards compatible. Yeah, of course. That's that's a huge benefit right now for why that works and why that makes so much sense. Yeah. Yeah. This lineups fine. Final one is Ultra Tron or no Ultra Tron. Sorry. Ultra Tron. I don't even know what the hell that is. Do you know what it is? PlayStation Vita, PS3 and PS4. Let's look. This happened. This popped up on Colin & Greg Live too. And I was just like, what? Yeah. I don't know what Ultra Tron is. Is that that weird mad that we're Japanese man who fights the monsters? That's a Power Ranger. No, that's a what's. Voltron. No. Voltron was an engine. I'm thinking of Ultraman. Oh no, it's not that. That'd be dope. I now I remember this one cause we clicked on the launch trailer and the launch trailer showed you",
      "start": 854.32
    },
    {
      "text": "Ultra Tron. I don't even know what the hell that is. Do you know what it is? PlayStation Vita, PS3 and PS4. Let's look. This happened. This popped up on Colin & Greg Live too. And I was just like, what? Yeah. I don't know what Ultra Tron is. Is that that weird mad that we're Japanese man who fights the monsters? That's a Power Ranger. No, that's a what's. Voltron. No. Voltron was an engine. I'm thinking of Ultraman. Oh no, it's not that. That'd be dope. I now I remember this one cause we clicked on the launch trailer and the launch trailer showed you",
      "start": 895.4
    },
    {
      "text": "Voltron. No. Voltron was an engine. I'm thinking of Ultraman. Oh no it's not that. That'd be dope. I now I remember this one cause we clicked on the launch trailer and the launch trailer showed you nothing. Oh it was just like and I was like this is terrible. Why would I? Oh God. A Rooster Teeth ad for Tide. Oh there we go. I don't want to look at these tied like like the detergent. Weird. Hey man when you're out there on your own you'll take it. I'll take an ad for anything. They're like Oh okay. So there we go. Arcade shooter deal. Okay. Yeah. Yeah. Kind of looks like Robotron top down twin stick. Got some fruit going across there. Maybe you put that one with those those weird. I'm interested. I'll take that one for free. I'm a veto one up. Oh and those are the games. Yeah. But it's a fine lineup. This is there's always this debate on our show and I'm sure there isn't yours too. Between it is like is PS Plus doing well lately in terms of games? I think it's doing",
      "start": 929.58
    },
    {
      "text": "But it's a fine lineup. This is there's always this debate on our show and I'm sure there isn't yours too. Between it is like is PS Plus doing well lately in terms of games? I think it's doing fine. I think it's doing good to an extent. I don't think it's doing as well as it was originally when it was giving you really great stuff. But it is also thinking of like for Vita like honestly what can they do anymore? Like there's not enough games coming for them to really be out here and doing all this stuff. Yeah honestly. Yeah. I was kind of hoping that they would go back like go back into for PS4 some of like year one year two games that people have sort of forgotten about by now. Something that Killzone. Right. I don't think they've done Knack and granted Knack isn't all that great but still like getting a sort of meaty first party game. Right. Cool. That'd be nice. What do you think? Second story? This comes from VG247. They're saying that Inside the second title from",
      "start": 972.98
    },
    {
      "text": "but still like getting a sort of meaty first party game. Right. Cool. That'd be nice. What do you think? Second story? This comes from VG247. They're saying that Inside the second title from Playdead the studio behind Limbo is coming to PlayStation 4 at the end of the month. Plus the trophies have popped on Exophase. That was like the first red flag and then the VG247 had a source and they said trusted sources saying that'll be out by the quote end of August which is great Inside. One of the best gets when I was mentioning those games earlier. I can't play that in mention Inside in terms of IGN's best games and it's cool. Yeah. I think it's a real interesting litmus test too of where we are this generation and the fact that you know Limbo came out on 360 and was there forever exclusively and then it finally came to PS3 and Vita and all that stuff. I was shocked when this story came out because I was like well eventually this game's going to come to",
      "start": 1006.14
    },
    {
      "text": "was there forever exclusively and then it finally came to PS3 and Vita and all that stuff. I was shocked when this story came out because I was like well eventually this game's going to come to PS4. I thought it'd be a year. I thought it would definitely be 2017 but uh yeah genuinely surprised that it could be what? Less than two months. Yeah. Yeah. Two seconds ago. Which is awesome. Um this game's yeah absolutely fantastic. If you'd like Limbo I think I described the game as super Limbo in the way that stuff like Mario World and match the Super Metroid felt like you took what was amazing the first time around in the NES and then you just perfected it in every way. A hundred percent. Yeah. Really. My only thing was that I didn't like the ending and that that soured me going into the review discussion and then the review discussion with Tim was like well this was great and that was great and this is great and that was great but I didn't like this. I was like ah I",
      "start": 1051.06
    },
    {
      "text": "into the review discussion and then the review discussion with Tim was like well this was great and that was great and this is great and that was great but I didn't like this. I was like ah I guess I didn't really like this game a lot. I'm just pissed off that I wanted. 40 seconds. Exactly. I was like what? All right. Yeah. No but Inside. Great. Let me check it out. Uh so a lot of there's a lot of I think uh Brandon Tyrrell at IGN tweeted uh I finished Inside and loved it and just by tweeting I finished Inside and loved it. That sounds very sexual. I didn't even think about that. Yeah. Yeah. You can't talk about it's tough to talk about that game. No I do love finishing Inside and I'll probably do it on a PS4 again. Don't come on your PS4. Number three. Uh this one is one I'm picking up from a Kotaku's Jason Schreier. He says reporting of course that three days after releasing the new Ghostbusters game development studio Fireforge Games filed chapter seven",
      "start": 1088.74
    },
    {
      "text": "one is one I'm picking up from a Kotaku's Jason Schreier. He says reporting of course that three days after releasing the new Ghostbusters game development studio Fireforge Games filed chapter seven bankruptcy. Kotaku has learned the company has been liquidating assets throughout July and an attempt to pay off a debt of at least $1 million according to bankruptcy filings received terribly when it was released alongside the movie on July 1st one possible explanation. Of course the game was developed in just eight months. According to one person who worked on it on July 15th the company filed for bankruptcy. It's not directly when you read the articles not directly tied to Ghostbusters. It's a whole bunch of other deals they have and that's the hangover but it's like man it's like I'm not happy for anyone losing their job or the bankruptcy or whatever. But like that game was not good. And then of course this is my problem though. Is this falling on Activision? Yes. A hundred",
      "start": 1127.86
    },
    {
      "text": "I'm not happy for anyone losing their job or the bankruptcy or whatever. But like that game was not good. And then of course this is my problem though. Is this falling on Activision? Yes. A hundred percent. You know and that's what I'm talking about. Eight months to make this game. Yeah. I don't understand how it is 2016 and Activision is continuing to make all the mistakes that theoretically and I'm not I'm a fly on the wall. I'm an industry observer. Theoretically is one of the reasons they lost all of their Marvel licenses because it became put out a fucking Spider-Man game every nine months and it got worse and worse and worse and worse. Everybody just hated them. Whereas you look at MCU and like Disney and Marvel have been like so tame with releasing products. I'm sort of shocked that there was never like a traditional Avengers game. There was that first person game that got canceled that they had footage of. And that was through Activision right? Like when they were looking",
      "start": 1165.4
    },
    {
      "text": "that there was never like a traditional Avengers game. That was that first person game that got canceled that they had footage of. And that was through Activision right? Like when they were looking at people and that was the whole thing. But then you see the footage of what the Spider-Man game for PS4 looks like and you're like oh this is fucking incredible. And it's by one of the best devs out there right now. So you're like this is what you do. This is how you cherish your property. This isn't how you tarnish a brand. And it's that whole thing of just I thought that like I mean I remember when Activision or no that was when what was it? It was when Sierra let go of Ghostbusters right? Yeah. No that's what it was. I'm sorry. So Sierra folds they were working on the Ghostbusters game. Activision picks up a bunch of games from Sierra. They don't pick up Ghostbusters and they say it's because we don't we want franchises that are annualizable. And it was like are you",
      "start": 1201.42
    },
    {
      "text": "game. Activision picks up a bunch of games from Sierra. They don't pick up Ghostbusters and they say it's because we don't we want franchises that are annualizable. And it was like are you fucking kidding me right now? You know what I mean? Then Atari put out Ghostbusters then Activision gets this one and it's just like on paper that should have been a fun game. Then you play it and you're like man this is not a fun game. Totally. Yeah. And it's such a God like Ghostbusters is so rife for like an amazing fun couch co-op game. You don't need to have it be this triple A $60 you know summer blockbuster game. But like this is it's the fact that that we don't have more good Ghostbusters games. Yeah. Well what's crazy about it. I'm really thinking I mean I know I'm a sucker for it but like you know I love the Master System Ghostbusters game. That's what got me into it. Right. And if you took that and I hate to say it but it could be a Vita game but it could be a great",
      "start": 1233.74
    },
    {
      "text": "it but like you know I love the Master System Ghostbusters game. That's what got me into it. Right. And if you took that and I hate to say it but it could be a Vita game but it could be a great mobile game of like updating the graphics too. But a great idea still of like you run your Ghostbusters business and you got to drive to your things you got to do this you're getting money. Do you want to spend it on better equipment to get better this to do better than that. And it's like that seems like a no brainer that we're going to take a license and do that and you're building up the fight Zuul or whoever the hell you needed to be. Yeah. It seems like you could take those like like you said mobile Vita tenants of like like a Game Dev Story or like any of those games where like over time you're accruing resources that you're using even like Simpsons: Tapped Out and shit. Yeah exactly. Yeah. And it just yeah it just sucks. Like nothing good is going to happen in eight",
      "start": 1271.3
    },
    {
      "text": "over time you're accruing resources that you're using even like Simpsons: Tapped Out and shit. Yeah exactly. Yeah. And it just yeah it just sucks. Like nothing good is going to happen in eight months. Now if you this is going to sound like one of those I haven't had an idea before anybody else and it's not that great. But the the the moment there's a one of those moments in my life and it's early on at IGN where I stuck with IGN but in reality Chris Roper and I could have quit. IGN and gone and made the game we wanted to make because we started actually talking to artists about it. But what the idea I had was it's a very basic Pokémon Go for Ghostbusters and what I told him I wanted it to be it would be a ghost on your cause when iPhones came out Roper got into it development on him. And the idea was that on your phone you'd have this app right? And like one would be a P.K.E. Meter and so you turn it on and it would tell you if there's ghosts in your area or whatever and",
      "start": 1303.26
    },
    {
      "text": "on him. And the idea was that on your phone you'd have this app right? And like one would be a P.K.E. Meter and so you turn it on and it would tell you if there's ghosts in your area or whatever and you'd walk around and when you got close you'd see it and you're you could you click on the thing to turn your phone into a trap and then you'd slide it out like that and then it would open up and maybe catch it maybe not maybe the other way. And you look at it and like you fill out your Tobin's Spirit Guide. Yeah. You have it all there. And the whole thing we were talking about like yeah and we have we'd have one you know like some GPS based on the Eiffel Tower. Like you'd only be able to get this one surveyor and do that. And then Pokémon Go came out and you just started slamming. Came out like well yeah 10 years later. I guess what happens when you just actually do something? I remember we hit up a Hobby Rodriguez who designed the Beyond logo. I remember hitting him up and be",
      "start": 1342.58
    },
    {
      "text": "out like well yeah 10 years later. I guess what happens when you just actually do something? I remember we hit up a Hobby Rodriguez who designed the Beyond logo. I remember hitting him up and be like would you want to do this? And like design goes and he gave some really rough sketches and but then it was like this is a lot of work. Yeah this is going to be tough and we don't have the Ghostbusters license. Yeah. Also trouble. It'll be pretty obvious if we're like Oh take your P.K.E. Meter out there and throw out your spirit trap. Yeah. The Geistbusters. Yeah exactly. Exactly. Yeah. I'm imagining we're going to see a lot of Pokémon Go knock off. I I'm very interested to see if the rumors of an NX are true and it's this handheld hybrid thing of a jig what that means for a Pokémon game. Cause even if it is like okay cool you can only do it through wifi or whatever you want these different locations. It seems like a no brainer. You want some kind of connectivity. I mean I",
      "start": 1378.74
    },
    {
      "text": "game. Cause even if it is like okay cool you can only do it through wifi or whatever you want these different locations. It seems like a no brainer. You want some kind of connectivity. I mean I think it'd be really cool if it allowed you sort of a like Pokémon Go Plus where your your your NX tablet or your controller thing you take it out and you're playing Pokémon Go regularly. And then when you dock it and they're playing it at home you're able to do some sort of a Pokémon Stadium ask. Sure. That'd be awesome. That'd be cool. Next story. Now again you're you'll be surprised by the amount of things. Usually you know Colin comes in he rewrites all the news. I am going to read you the Eurogamer story by Richard Leadbetter because this is a little too high functioning for me to go through and try to read. But basically the PlayStation Vita has been hacked. Oh no. Ever since it's 2011 launch PlayStation Vita the security has remained relatively intact. We've seen a bunch of",
      "start": 1415.36
    },
    {
      "text": "me to go through and try to read. But basically the PlayStation Vita has been hacked. Oh no. Ever since it's 2011 launch PlayStation Vita the security has remained relatively intact. We've seen a bunch of PSP emulator exploits and around a year ago and native Vita exploit was released with for an older firmware that required the unit tethered to a PC. Now hacking collective Team Molecule has released a new exploit that fully unlocks the full power of the Vita hardware for homebrew developers dubbed Henkaku. That's definitely a Henkaku. Okay. That's a weird Japanese sex thing as well. Oh they all are. The exploit is preposterously simple to install. Just ensure that you are running the latest firmware 3.60 then visit a special especially prepared website to activate the activate the exploit. I'm struggling. The injected core removes the Vita file system from its sandbox and allows users to access it via FTP. From there homebrew packages can be transferred across to run",
      "start": 1451.56
    },
    {
      "text": "the exploit. I'm struggling. The injected core removes the Vita file system from its sandbox and allows users to access it via FTP. From there homebrew packages can be transferred across to run across and run on the unit. The exploit also works for PlayStation TV / Vita TV micro console and the open access to the file system means that the ability to whitelist all titles has now returned meaning that games which were bizarrely locked out including Sony's own some of which worked great can now run again. So that's fascinating that you have this TV you can do this and then play all the Vita games on it. I love that. Other applications include the ability of developers to create homebrew apps that overclock elements of the Vita to a level that's inaccessible to game developers. Right now there isn't much to do homebrew wise aside from the Vita version of Doom and a smattering of emulators but it's expected the release of Henkaku will see this situation change rapidly. Any such",
      "start": 1490.92
    },
    {
      "text": "now there isn't much to do homebrew wise aside from the Vita version of Doom and a smattering of emulators but it's expected the release of Henkaku will see this situation change rapidly. Any such exploit opens the door to piracy and while there are no anti-DRM measures in the package Team Molecule accepts the possibility that pirated commercial games may well happen. Quote it does not let you install or run Vita backups wares or any pirated content says the developer. It does not disable DRM features. It does not let you decrypt encrypted games. Here's my stance on this. I do not care one way or the other about piracy. I do not judge people who do pirate. I will not act as the police for pirates. However I will personally not write any tools that aid in piracy. It is my choice just as it's the pirate's choice to steal a content. That's huge. Very huge. Cause you remember the PSP. PSP sold so well because everybody was getting it and putting every game ever on it. That's how",
      "start": 1531.04
    },
    {
      "text": "it's the pirate's choice to steal a content. That's huge. Very huge. Cause you remember the PSP. PSP sold so well because everybody was getting it and putting every game ever on it. That's how I played through Mother 3 in English. Yep. Yep. So he uses PSP with them on planes to go play all these different Crash games. Yeah. I mean that's huge. Like I don't uh I don't know. I'm not I'm not I'm sure Sony's pissed about this. Um I don't know if this is going to really negatively impact sales. If anything it could positively exactly. Exactly. Like obviously it would if it turns out it's super easy to pirate software then like yeah that does suck. Sure. Especially for indies. But that's the thing though is I just think it's such a small market that would do it in a way. You know what I mean? Like a lot of people had PSPs and did it but I don't think it really hampered the sales of Mother 3 or what you know what I mean? Like that's the whole problem is people were",
      "start": 1571.36
    },
    {
      "text": "know what I mean? Like a lot of people had PSPs and did it but I don't think it really hampered the sales of Mother 3 or what you know what I mean? Like that's the whole problem is people were doing it cause it was so hard to get these games any other way. Sure sure. And if it's like I'm doing this so that I can have an NES emulator on the go like yeah exactly. I don't know. It's not Nintendo's fucking up by by not letting me have a Nintendo ID where I have Mario just downloaded forever because I've bought it 15 times. And that's why an NX is going to give it to you. He was a state of our hotel at a Comic-Con. Did you see him? DMX. Yeah. Wow. Did you talk to him? Yeah. No way. Yeah. What do you say to him? We took Max and I talked to him Darren and I talked to him. They got pictures. I don't know. I wasn't going to be asked if he was like the dog. He's like yeah. And then at one part he was doing karaoke in the restaurant. He had just a bunch of money. He asked he said he",
      "start": 1615.48
    },
    {
      "text": "I don't know. I wasn't going to be asked if he was like the dog. He's like yeah. And then at one part he was doing karaoke in the restaurant. He had just a bunch of money. He asked he said he said he asked he was asking about Comic-Con cause he wasn't there for Comic-Con. Okay. And the Ruff Ryders are in town. He said oh the bitches at Comic-Con. I'm like yeah I mean there's plenty of nice ladies. He said when the dog goes to a concert he gets the bitches. If I go to Comic-Con am I going to get the bitches? And we're like yeah. I mean if they consent sure. You can get all the bitches. I don't know if you ever ended up going to Comic-Con. I doubt it. What if he was like waiting like in Hall H line for like a day? He's like I can't believe Pokémon Go to release the legendary. Why'd you lie to me Phil DeFranco? Story number five. Yeah. This is one that's been making the rounds. No spoilers in it. So everybody stick with it. Did you see this guy over the weekend who spent",
      "start": 1655.4
    },
    {
      "text": "Why'd you lie to me Phil DeFranco? Story number five. Yeah. This is one that's been making the rounds. No spoilers in it. So everybody stick with it. Did you see this guy over the weekend who spent $1,300 to get No Man's Sky going. He's a kook. He put up his videos. People DailyMotion took him down. They started going to YouTube. Then he stopped making videos because Sean Murray tweet that was like don't do this. Hey don't do this. Everybody's worked on this game forever and dah dah dah dah. What's interesting about it though is then the reaction the reaction of like oh God don't ruin it or people running out to watch it. And then now the reaction to his comments about the game because Sony hasn't put it out there. No reviews are up. So we have this one guy talking. He's like he is the lone critic of this game. I saw a lot of fun. I saw a lot of bugs and I finished it in 30 hours. I got to the center of the universe in 30 hours which of course is what they've been teasing",
      "start": 1692.76
    },
    {
      "text": "is the lone critic of this game. I saw a lot of fun. I saw a lot of bugs and I finished it in 30 hours. I got to the center of the universe in 30 hours which of course is what they've been teasing forever. Like when I remember that's sort of the quote unquote end game. The fact that it's an infinite game. Exactly exactly exactly. Now what I liked I picked it up and was talking about on Colin & Greg Live today and then one of the other articles I was reading before this one right is the fact that it's not exactly that right. GameSpot had it as in addition he explained that while he didn't use exploits do you get to the center? He did deliberately cut down his time to get there by continually acquiring and selling an in game item that gave him large profit. This allowed him to very quickly upgrade his warp drive faster than most players would otherwise be able to do it. To a certain extent he quote unquote mainline the game although he states that he spent some time off the",
      "start": 1730.24
    },
    {
      "text": "quickly upgrade his warp drive faster than most players would otherwise be able to do it. To a certain extent he quote unquote mainline the game although he states that he spent some time off the direct path towards the center. So it's interesting that it's like I don't I'm sure if that like obviously for any game like this where you can get resources and sell them there's going to be one exploitable one or something like that. It's funny that one guy can find the exploit though because usually exploits you got to go online and share it. It's part of why I'm sure it's gonna be like that. One of those super obvious you'll make the pearls in a witch or whatever. Wait a second. Yeah. These are like getting picked up for dirt and I'm selling for a hundred bucks or whatever. Yeah. It's funny seeing the reaction to this online of people sort of the the the hype and behind this game is sort of terrifying. It's sort of singular in a way that I've never seen in a game. Like I'm",
      "start": 1766.2
    },
    {
      "text": "It's funny seeing the reaction to this online of people sort of the the the hype and behind this game is sort of terrifying. It's sort of singular in a way that I've never seen in a game. Like I'm excited for the game but the number of comments I've seen of like this is it this is the end all be all. Like this is the video game. I'm like well no game is that. But I feel and I it sucks but I do feel like Sony did that. Yeah. The E3 presentations and the way they got to talk about it. I kept saying like I didn't understand the game till two E3s ago. Yeah. Our first E3 is Kinda Funny. Going to the offsite and sitting there and playing it with Sean and Kevin playing it and then Kevin getting going to the event and play it again. And like we keep talking about it on the Colin & Greg Live every morning when it's because me and Kevin are so excited about it. I'm like we're excited because our expectations are set based on gameplay. We've played it. It's simple but",
      "start": 1798.24
    },
    {
      "text": "Colin & Greg Live every morning when it's because me and Kevin are so excited about it. I'm like we're excited because our expectations are set based on gameplay. We've played it. It's simple but it's fun. It's totally me. I'm going to you know if it's 30 hours my whole plan with it is like I see this being a game that I I tinker with for 30 or 45 minutes before bed. So it's going to take me forever to get to the center of the universe if I even make it. And that's fine. But it is the fact that so many other people are I'm going to get out there and do this. And like people people talk about like it's like Second Life. Like I'm going to have this fucking outpost where I'm selling all this shit. Everyone's going to visit me. I'm like no you're probably literally never going to see another player. Exactly. The universe is too expansive. Yeah. And of the time thing that always baffles me. Like if I get 30 hours out of this game awesome. Yeah. Exactly. Exactly. I regularly",
      "start": 1835.0
    },
    {
      "text": "see another player. Exactly. The universe is too expensive. Yeah. And of the time thing that always baffles me. Like if I get 30 hours out of this game awesome. Yeah. Exactly. Exactly. I regularly pay $18, $20 to go see a two hour movie. I'm fine with that. Yeah. Most of them are terrible. Yeah. I'm very dumb. You make bad decisions. I make very bad decisions when I drink. Yeah. Yeah. I'm I'm still super stoked. Can't believe it's our next week. We're right. Yeah we're getting built soon. Yeah exactly. I know. He keeps looking at the email. I'm like this guy is playing on a server. Like I can't tell me servers aren't alive because he's already at the center of the galaxy. It's funny because they're they're uh like we're having big meetings at IGN about wikis and wikis keep the lights on at IGN and uh about like how do we cover this game? What are the big things? And I'm like if this game is as like random and procedurally generated I don't know if wikis are going to help with",
      "start": 1866.04
    },
    {
      "text": "on at IGN and uh about like how do we cover this game? What are the big things? And I'm like if this game is as like random and procedurally generated I don't know if wikis are going to help with this. Uh sometimes there's this thing that looks like this. Just a dinosaur with a dick. If you had the dick off you can sell it for a warp drive. Dinosaur dicks are where warp drives came from. Oh nice. Okay. Hyperspace. Watto's trading nice for them. Honey. Honey. Number six all Disney Infinity online services and multiplayer will be taken down by March 3rd, 2017. Boo. Boo. It's not surprising though. It's interesting that it's just like happening so quickly that it's ending. Not so much. I didn't think I didn't even think about all that. There's that much online to Disney Infinity. Yeah I would never really fuck with it online. Exactly. But yeah Disney Infinity games on consoles and handheld devices will continue to function as normally indefinitely. I'll be without online support.",
      "start": 1903.56
    },
    {
      "text": "I would never really fuck with it online. Exactly. But yeah Disney Infinity games on consoles and handheld devices will continue to function as normally indefinitely. I'll be without online support. This means that if you play Disney Infinity on any of the things you'll only have to worry about the online services which still so you still play your your packs and all this different stuff. Yeah. I mean I think the the home servers just go down the PlayStation Home. I mean not like just like yesterday but in recent memory. Yeah. Yeah. So it does suck. But I mean there's literally no team anymore. Like Avalanche has shut down. Nobody's there to take care of this. Yeah. Yeah. Yeah. And it sucks. Like I really hope that the silver lining out of this is a it's one of those studio closures there. The studio has so many talented folks where they are spread out over the course of the industry. That's sort of what happened with Irrational. Yeah. I mean I think the former BioShock",
      "start": 1943.44
    },
    {
      "text": "there. The studio has so many talented folks where they are spread out over the course of the industry. That's sort of what happened with Irrational. Yeah. I mean I think the former BioShock Infinite, BioShock 1 folks are now making incredible indie projects incredible triple A projects. But I also hope this frees up the Disney licenses and stuff like Marvel and Pixar to Lego Dimensions. Like how cool would it be? And I know where if Colin wants that like he absolutely wants to be able to. Of course. And I and I I mean I don't think that's a long shot anymore which is crazy. You know what I mean? Because but I but I mean like the Lego love for them continues where I remember when you know Avengers was coming up. I was like Oh that was at you know what are these games that are after you got announced but we're probably talks before we got there. Like well now that Disney's there it's going to be a different story. And then Force Awakens comes out and you're",
      "start": 1980.84
    },
    {
      "text": "that are after you got announced but we're probably talks before we got there. Like well now that Disney's there it's going to be a different story. And then Force Awakens comes out and you're like Oh this is all okay. No this is still happening. Incredible. Yeah. Yeah. So you I do totally expect that year two has been announced and that's what it is. And I think that you're three when they announced that probably around the three of next year. Yeah. Something with Star Wars, Star Wars and Marvel and this must be yeah the people you expect you not expect but like you expect based on what's happening. I still also hope. There's weird shit out of left field like A-Team and Adventure Time. Oh that's totally. Yeah. Yeah. I want to get Short Circuit. I want to get Short Circuit in there because that's a good one. That is a good one. You know you look at their lineup and it's things kids today like and it's things their parents were kids like things like we've got goodies. Yeah. We",
      "start": 2014.88
    },
    {
      "text": "because that's a good one. That is a good one. You know you look at their lineup and it's things kids today like and it's things their parents were kids like things like we've got goodies. Yeah. We got Back to the Future. Gremlins. Yeah exactly. Let's go some Short Circuit up in here. Some Johnny Five. Is that they fuck that robot in the thing right? No they didn't fuck the robot. He was solid gold at the end. He became the first ever robot citizen of America. He probably had sex after that. I Need a Hero. Oscar. Such a great movie. That's really I mean terrible Short Circuit. I haven't watched any of them as an adult in a long time but man as a kid I love Short Circuit 2. And I can't imagine that it's good at all. No. Michael McKeon that white guy pretending to be Indian which totally. Yeah. That's not going to work in. Oh yikes. I know there's so many things you look back at. Huh? Huh? That was a decision. That was a decision. It was the comedy. I can't remember the",
      "start": 2048.84
    },
    {
      "text": "totally. Yeah. That's not going to work in. Oh yikes. I know there's so many things you look back at. Huh? Huh? That was a decision. That was a decision. It was the comedy. I can't remember the name of it right now. I got the guy who just goes into blackface to get a scholarship for college. Yeah. Oh that was just a total plot point that everyone's fine with. Yeah. All right. Yeah. We just had different times. Yeah. Revenge of the Nerds. Yeah. Number seven. Sony is wait. Do you say Revenge of the Nerds where he raps? Yep. Just like you watch these movies. Like I remember watching Revenge of the Nerds on Saturday morning like whatever like as a kid and it was like oh yeah sure. He just pretended to be her boyfriend and slept with her in the moon bounce house. And he was so good at sex that she didn't care. And they're like selling fucking pies with the nude photos of her. And you're like they have cameras hidden in their house to monitor these naked women. And people are",
      "start": 2088.92
    },
    {
      "text": "at sex that she didn't care. And they're like selling fucking pies with the nude photos of her. And you're like they have cameras hidden in their house to monitor these naked women. And people are going to the movie theaters and watching this. And you're like awesome. This is quality entertainment. What would a date night have been like if you took it? Like is it just you looking over at your date and just apologizing? Like I am so sorry. That would be us doing that now. But like in that day and age everyone's just laughing along. Reaganomics. Yeah exactly. That was what I was. Also if you were dating in the 1990s Marty and I need to know what it was like to go to a bar and how you met people. Yeah. Cause this was an all night debate at Jackalope the other night. I really don't understand what were bars like. Like did you bring a newspaper? I think you yeah I think you did. And then you sat but like you were saying like you were sitting there waiting for us to get there.",
      "start": 2129.76
    },
    {
      "text": "what were bars like. Like did you bring a newspaper? I think you yeah I think you did. And then you sat but like you were saying like you were sitting there waiting for us to get there. And so you were on your phone and if you weren't you would have just been I think you would have talked to the bartender. You would have talked to other people. I think it would have just been a more social thing. Yeah I guess so. Do you like some like we live in houses with with other people. Right. And so you imagine you would have one phone per house. So the phone rings it's a girl and Colin answers like that. And then the girl has to be like is Greg there? Like and he has to be like no Greg's not here. See I call her house and then her room. I got that at the tail end in college. We still have that. I went to college right. And I didn't get my own cell phone until June. Okay. So you got to go through. I did do the whole thing of like calling a girl's a house or whatever. She had",
      "start": 2170.8
    },
    {
      "text": "have that. I went to college right. And I didn't get my own cell phone until June. Okay. So you got to go through. I did do the whole thing of like calling a girl's a house or whatever. She had exactly not dorm but yeah. Or I did the dorm too. And somebody else answers. You have to leave a weird ass voicemail on the community machine. You're like man I feel like an idiot. Yeah. Yeah. I remember we the dorms in Milwaukee these little suites where it was like four of us to his suite and one phone in the hallway and the three of us had cell phones and just use them. And then the one guy of course didn't. And so he'd be out in the hallway like talking to his girlfriend like you know fight with her and I'm like get our cell phone. Go fight in private. Yeah. I remember you know I the Antlers were a big part of my Mizzou career or whatever. And when they called me to tell me that they liked my application I should come out for tryouts or whatever. The first guy called and he",
      "start": 2204.2
    },
    {
      "text": "the Antlers were a big part of my Mizzou career or whatever. And when they called me to tell me that they liked my application I should come out for tryouts or whatever. The first guy called and he was like I had a funny answer machine. Like I forget what it was. I think it was just like it was something that was like you know typical Greg was like ah Hey I don't know where I'd be. I don't have any friends. I got here. I don't know anybody. You should you know whatever. Leave message G. And so like the guy's like ah that's a funny message. Anyways call us back at four four and he hung up and I was like there's no caller ID. And I got the message and I'm like I don't know what the last four numbers he said was but my answering machine was so funny. Then another guy Hayes he's like one of my best friends now forever called back. He's like Oh Hey Goose said your message was funny. So I heard it and he was called back and he did the he you know audibly said what",
      "start": 2242.68
    },
    {
      "text": "he's like one of my best friends now forever called back. He's like Oh Hey Goose said your message was funny. So I heard it and he was called back and he did the he you know audibly said what the fucking phone number was. That's so amazing. I love that. That's what you get. You could do a hot goof of a voicemail. I saw him and set up my voicemail on my phone. Well nowadays we don't need it. No stop calling me. I have nothing to say to you. Just text me. Yes. You know what I mean? Yeah. I'm going to text for my mom because she knows I will never fucking call her because I'm a bad son but I love her. Just text me whatever's happening. Yeah. Yeah. Listen to your episode of Pockets Full of Soup where you said if the only reason you used your phone was for terrible news. Oh yeah. Yeah. Exactly. Yeah. Calling you out of a thing. And that's even to this day I call mom's like what's wrong? I'm like nothing. I just know I need to call you. Yeah. What's going on? Yeah. How's are the",
      "start": 2275.36
    },
    {
      "text": "horses? Number seven. Sony has announced Driveclub VR will be available for the launch of its PlayStation VR headset in Japan. Further details aren't available in English as of yet. A post on the Japanese PlayStation Blog states there will be a cockpit view in realistic 3D audio. That's cool. Yeah. Is this do we know if there's going to be like a free update with if you own Driveclub? That'd be nice. I don't know if we do know that yet. I'm not sure where we are since the information keeps moving around. It's just off the Japanese Blog. I don't know if this is a separate game because I do know for stuff like uh they had talked about it before so I'm looking into it for you for Bound that game that's coming out in two weeks from Plastic where the folks behind Datura. Oh yeah. Real",
      "start": 2313.08
    },
    {
      "text": "know for stuff like uh they had talked about it before so I'm looking into it for you for Bound that game that's coming out in two weeks from Plastic where the folks behind Datura. Oh yeah. Real weird move game. You're going to be able to the day October 13th when PlayStation VR launches you'll be able to do a free update that will let you play the entire game. That's the way. I mean that's what's so interesting and you'll it'll be interesting to see how many games get legs again because of it. Cause even like Volume Coda right? Yeah totally. Just like Hey here's a Volume experience for PlayStation VR. And that's you know we have a question coming up. I guess I can just jump to it right now. You read this and see if you find out if you can get your answer out of that. I think I was that Engadget article. You do that. Oh no it's actually a different game. It sounds like it'll feature new tracks including a city a city one pictured above can confirm. It looks like",
      "start": 2344.92
    },
    {
      "text": "Engadget article. You do that. Oh no it's actually a different game. It sounds like it'll feature new tracks including a city a city one pictured above can confirm. It looks like a city and then yeah different vehicles. So it's its own thing. It seems like its own thing. I imagine this is going to cost money. Dean wrote in KindaFunny.com/PSQ. I wish just like you can. Well then he's also like super radical Republican though. Oh no. So it's like all right Dean I don't know how much I want to do. And I cause I don't mind you being a Republican but I mean like when you're like the you know the radical the one where I'm just like why are you saying these things? Fighting these people. I was going to be like Dean says Hey Greg and Colin it's Marty with the upcoming release of PlayStation VR. I was wondering what franchises you guys would like to see make the jump over to VR. Love you guys. Keep up the amazing work greeting from the Netherlands.",
      "start": 2383.12
    },
    {
      "text": "the upcoming release of PlayStation VR. I was wondering what franchises you guys would like to see make the jump over to VR. Love you guys. Keep up the amazing work greeting from the Netherlands. Thanks Dean. My whole thing is I want it. I don't want franchises we know and love forced into it. I don't want it to be BioShock. Even it's move integration. You know what I mean? I want it to be like Oh my God I forgot. Hey we believe in this. We want to do something with I want it to be Volume Coda. That is like Oh we have a cool Volume game and now we're going to do something different for VR or like how Rise of the Tomb Raider is going to have the mode where you can go around Lara's mansion. Like I think it'd be cool if Naughty Dog released the thing where you could go through the I'm without spoilers the the very calm parts near the beginning and near the end of Uncharted 4 where you're wandering around the house. Yeah. Like I think that'd be awesome in VR and first person",
      "start": 2421.2
    },
    {
      "text": "without spoilers the the very calm parts near the beginning and near the end of Uncharted 4 where you're wandering around the house. Yeah. Like I think that'd be awesome in VR and first person VR. But there's like I don't I don't need Last Guardian VR just for the sake of Last Guardian VR. Exactly. Yeah. You know that just don't make sense shoved in there. Absolutely. Yeah. I'm not I'm really curious because it is weird. We're at this point where everyone has to learn the rules again. Yeah. Like in 2D games Mario taught you the rules in 3D games. Mario 64 taught you the rules. Whereas with this like I talked to developers of third person games that are in PlayStation VR and I'm like so how are you dealing with the camera? And they're like we don't know. Like we are trying 10 different things and five of them make people dizzy and one of them is broken and one of them we really want to lean heavily into. But developers are super excited about that cause it's like the wild west once",
      "start": 2458.14
    },
    {
      "text": "things and five of them make people dizzy and one of them is broken and one of them we really want to lean heavily into. But developers are super excited about that cause it's like the wild west once again. Right? Yeah. It's exciting to get in there and do it. You just hope that there'll the market supports it. And that's what I think. I think PlayStation has their expectations set correctly when she talks about it being a launch of a PlayStation again. And I think our audience your audience the hardcore PlayStation audience understands that as well. Where I think you're I think we all know for buying it on if we're buying PlayStation VR on day one we are signing up for a year of spaghetti at the wall. What works and what doesn't work. And that's why honestly I'm not excited for Resident Evil 7 with it. Yeah. Cause I've heard so much about people who have gotten sick or this has happened or whatever. It was nauseating. And it's like I don't know if we're ready for that yet.",
      "start": 2496.46
    },
    {
      "text": "Evil 7 with it. Yeah. Cause I've heard so much about people who have gotten sick or this has happened or whatever. It was nauseating. And it's like I don't know if we're ready for that yet. I think we have to go through and do all right we hear a bunch of 30 minute experiences and people really like this but they hated this in a year in maybe a year and a half and we start getting experiences and games that are like Oh here's something awesome. Yeah. Really can't be here's the triple A game that was in development plus VR. Like the things that work like you played Arkham VR right? Arkham VR I thought was awesome because it's very restrained. It's not Arkham Knight VR. It is its own little experience where movement is much more confined but it works really well. I think that sort of node based movement where you have seven points in the environment that you can go to. Yeah. Really works out. But yeah I don't I do agree. I mean it's sort of that way if you're an early",
      "start": 2531.06
    },
    {
      "text": "sort of node based movement where you have seven points in the environment that you can go to. Yeah. Really works out. But yeah I don't I do agree. I mean it's sort of that way if you're an early adopter to any piece of technology if you bought a PS4 year one or Xbox One in year one like yeah you get you get Killzone and Knack and Resogun but like the good the really good stuff didn't come for a little bit. But I think it's it's it's so easy to know that is coming. Whereas like you'll get PlayStation Vita right? And it has a launch lineup that is good but has so much stuff in there. Like we're trying the touchscreen the back the gyro and everyone's like that sucks. Nobody wants that. And then the story gets written that this sucks and it's not going to work. And this is why developers start running away from it. Yeah. I guess. Yeah. Consoles a little bit different because it's a it's an assumption. You're going to get awesome games a year or two down the road. Yeah.",
      "start": 2567.34
    },
    {
      "text": "developers start running away from it. Yeah. I guess. Yeah. Consoles a little bit different because it's a it's an assumption. You're going to get awesome games a year or two down the road. Yeah. Whereas with this you're like well I hope we're going to get awesome games a year or two down the road. And from what I've seen like the launch lineup actually is pretty solid with smaller things like Thumper and Rez and Rez Infinite. I can't wait. Yeah. I'm so excited. There's going to be a new level in Rez. Yeah. I have a door to Rez for the past decade. Yeah. I don't know. I'm I'm really wrapping my head. Developers that at you know folks at Santa Monica Studio and the folks that Naughty Dog and Japan Studio are geniuses. So I have no doubt we're going to get these amazing first party experiences one way or another. I don't know if they're going to be tethered to franchises. I don't know if they're going to be singular things. I think at the onset they won't be. I don't think there'll",
      "start": 2602.66
    },
    {
      "text": "one way or another. I don't know if they're going to be tethered to franchises. I don't know if they're going to be singular things. I think at the onset they won't be. I don't think there'll be tech cause you don't want to burn that when it is just like we're figuring this out. Yeah. Yeah. Cause a lot of people I didn't get to play the Final Fantasy XV VR thing at E3 but I had a pretty negative reception which is you know shitty for a game that's relatively demoed super well and shown super well throughout the past three years since it relaunched. So yeah I feel like you don't want to just do a quick cobbled together VR thing for the sake of it because I don't know brand quality is important. Especially a lot of those Sony first party things which have just like Uncharted has just such undisputed quality. Yeah. That's the least one Uncharted that shitty all of a sudden it's not that franchise anymore. Right. Yeah. And it's forgotten about and it's not put onto the Nathan Drake",
      "start": 2637.54
    },
    {
      "text": "such undisputed quality. Yeah. That's the least one Uncharted that shitty all of a sudden it's not that franchise anymore. Right. Yeah. And it's forgotten about and it's not put onto the Nathan Drake Collection. No even though it was good. I liked the Golden Abyss. A lot of monsters didn't like it. Yeah. It was terrible. People are bad. It was you know it was probably a a murderer. So it's in Lincoln. What? Murderers didn't like Golden Abyss. Oh sure. Yeah. Murders don't like it. Right. PlayStation accounted for 78% of Sony's profits. April 1st to June 30th accredited PlayStation. This was all accredited. The PlayStation 4 software sales and PS4 hardware costs reduction. However they are forecasting quote lower than may forecast. Do the impact of the foreign exchange rates going forward. Overall Sony corporate is down year over year. Yeah. But no surprise there. That's what it always is. Yeah. That's that number is insane. Right to me. Yeah exactly.",
      "start": 2678.56
    },
    {
      "text": "exchange rates going forward. Overall Sony corporate is down year over year. Yeah. But no surprise there. That's what it always is. Yeah. That's that number is insane. Right to me. Yeah exactly. That's just so sort of the importance of the PlayStation to Sony as a company. Which is such a giant I mean I guess it still is was such a giant innovative leader in all facets of technology. Now how important PlayStation is to it. And it's almost interesting to me that they are willing to take this giant risk with PlayStation VR. Yeah. Like this is an all in risk. This is a we are funding this ourselves kind of thing. And so like I think they do see like Sony sees VR as the future of not just games but entertainment and communication and and travel and health. And that's the fun interesting thing about it. Colin's always talking about the fact that yeah you know for him he doesn't care about the games. It's what VR is going to be or whatever. And I'm always like well that's fine and good",
      "start": 2717.64
    },
    {
      "text": "it. Colin's always talking about the fact that yeah you know for him he doesn't care about the games. It's what VR is going to be or whatever. And I'm always like well that's fine and good but that if it comes out in the game suck then it dies. You know what I mean? But if it can come out and Sony is committed as a company then again they're at the cutting edge on something that maybe people care about. Yeah. And they try to do that 3D TVs and we're all like no stop. Yep. Yep. Yep. But you see like a company like Facebook that invested $ million or $ billion on Oculus. They wouldn't do that unless they were confident that this is going to sort of revolutionize pop culture and society. Yeah that was a little bit hyperbolic. Probably no revolutionize society. No I think you nailed it. You fucking crushed it. Number nine is the wrap up. Metrico+ hits on August 3rd. Oh really? Yeah. Okay. This might be the time to jump in with the plus. It never worked for me. I never",
      "start": 2763.44
    },
    {
      "text": "it. You fucking crushed it. Number nine is the wrap up. Metrico+ hits on August 3rd. Oh really? Yeah. Okay. This might be the time to jump in with the Plus. It never worked for me. I never really it never clicked for me. I'm not going to tell you that Final Station comes to PlayStation 4 August 30th. Rollercoaster Dreams and World War Toons come to PlayStation VR on October 13th, the release date. And of course, Yakuza 0 comes exclusively to PlayStation 4 on January 4th. That's next year. 2017 future. I know. Has anyone called it the Yakuza? No, I don't think so. Yeah. I'm starting with that. I like that. Yeah. I'm behind you on that one. Okay. Uh, Marty. Yeah. I'm excited for the Yakuza. Yeah. But it's so far out. It was really far out. If I wanted to know what came to the mom and pop and digital shops, where would I go? Is this still called the Andrew Goldfarb? No, this is the uh, Colin always says it and he just stumbles through it too. Don't worry. It's the",
      "start": 2798.28
    },
    {
      "text": "the mom and pop and digital shops, where would I go? Is this still called the Andrew Goldfarb? No, this is the uh, Colin always says it and he just stumbles through it too. Don't worry. It's the shoe something. No, no, no, no, no. This is the upcoming. This is the list of upcoming software on PlayStation 4, PlayStation 3, PlayStation Vita, sometimes PSP, brought to you by the Kinda Funny co-founders. That was really good. Just like Colin. I just opened up the PlayStation Blog. Your new releases for August 2, 2016 include Abzû from the artistic mind behind Journey. Abzû is a beautiful underwater adventure that evokes the dream of diving. Immerse yourself in vibrant, hidden world bursting with color and life as you descend into the heart of the ocean. It's real good. That's a really good write up too. We make fun of the write ups a lot here because usually it's poetic. Well, he didn't write. No, no. These are like Ryan's poetry comes to the top. You want to hear some",
      "start": 2840.84
    },
    {
      "text": "a really good write up too. We make fun of the write ups a lot here because usually it's poetic. Well, he didn't write. No, no. These are like Ryan's poetry comes to the top. You want to hear some here? Here. You know this is some Ryan Clements shit right here. All right. A lone diver plunges into the dark reaches of the ocean in search of answers with untold beauty and terrible danger drifting through the waters. The diver will uncover the truth of the world. Abzû launches this week on PlayStation 4. Fucking nailed it. Ryan, you kidding me? I like how everything was like poetic and then it was just like a shit. I have to do the actual. I have to tell you that one video game that's coming out now. Batman: The Telltale Series - Episode 1: Realm of Shadows comes out on PlayStation 4. Enter the fractured psyche of Bruce Wayne and discover the powerful and far reaching consequences of your choices as the Dark Knight in this gritty and violent new story. You will make discoveries that",
      "start": 2889.72
    },
    {
      "text": "the fractured psyche of Bruce Wayne and discover the powerful and far reaching consequences of your choices as the Dark Knight in this gritty and violent new story. You will make discoveries that will shatter Bruce Wayne's world and the already fragile stability of a corrupt Gotham City. Very excited for this. Yes, I played Episode One. We talked about it. Yeah, spoiler free, spoiler free here. Really had a great time with it. I was going to play through tonight, but we're going to stream a crowd play. Oh nice. Are you going to try to use the thing? So we're going to use the three of us. Okay, okay, we're not going to like open up the masses like this could break. Well, the whole thing is like, yeah, like so if you're having following, you know, at the Comic-Con crowd play that I did in front of everybody, they announced that there's this multiplayer feature where people can vote via this app and their your phone. It's like Jackbox or whatever. You go there and you can do it. It's",
      "start": 2925.88
    },
    {
      "text": "of everybody, they announced that there's this multiplayer feature where people can vote via this app and their your phone. It's like Jackbox or whatever. You go there and you can do it. It's up to 1,000 people can play on it. That's crazy, but not. They said it won't work with Twitch because of the latency, but that doesn't make sense to me because what I would do is, all right, cool. Here's my thing. Get on it everybody. It's a choice for everybody to vote on. You see the choices and just as we get down to almost being done, hit pause and then let everything catch up and I don't know, but I don't know if maybe it won't work that way. Oh, interesting. Like you hit pause. I hit the PlayStation home button to let it all catch up. I talked to the chat for a second and then I come back and see if that actually worked. If I don't know where you see that at every decision, do you only do that? Like major forks in the road? I guess major forks in the road. Yeah. Yeah. I'm excited. Like",
      "start": 2959.88
    },
    {
      "text": "see if that actually worked. If I don't know where you see that at every decision, do you only do that? Like major forks in the road? I guess major forks in the road. Yeah. Yeah. I'm excited. Like I think crowd play is really interesting. This is coming to every Telltale game now going forward. So good. Good. Good. Good. I'll tell Scooby-Doo to be clear. This is PlayStation 4 digital. Remember, you can buy it on a disc, but not until September. Yes. That's very good. Breach & Clear: Deadline comes to PlayStation 4. A deadly new breed of human monsters on the rise and it's up to players to stop the infestation before it spreads. Breach & Clear: Deadline is the all new followup to Breach & Clear, the critically acclaimed hybrid tactical strategy game. Real quick. I remember playing Breach & Clear on the Vita. Don't remember the critical acclaim. Just putting that out there. Maybe I'm wrong. It was probably a good review. Somebody said something. The game's got human monsters.",
      "start": 2994.46
    },
    {
      "text": "Breach & Clear on the Vita. Don't remember the critical acclaim. Just putting that out there. Maybe I'm wrong. It was probably a good review. Somebody said something. The game's got human monsters. What's what's what are those? A new breed of human monster. Is those just regular humans? Yeah. It's really racist. I can totally get behind a game where you just kill a bunch of races. Sure. Yeah. Cannon Brawl comes to PlayStation 4 digital. Pilot an airship, command powerful weapon emplacements like cannons, giant flamethrowers and high powered lasers. Destroy the very earth from under your enemy's feet. Cannon Brawl is an exciting mix of RTS and artillery gameplay. It's a whole new genre and strategy games. It sounds like Worms. Yeah. It also, yeah, it's a whole new genre in strategy games. Well, it sounds like it's a strategy game. I don't know. We're getting all these subclasses. Here comes a game you're all very excited for. Gal*Gun: Double Peace comes to PS4 and PlayStation",
      "start": 3032.88
    },
    {
      "text": "Well, it sounds like it's a strategy game. I don't know. We're getting all these subclasses. Here comes a game you're all very excited for. Gal*Gun: Double Peace comes to PS4 and PlayStation Vita digital and retail. When Houdai is shot by Cupid Angel Ekoro, he becomes immensely popular and suddenly every girl at the academy becomes hot for him. But being irresistible is hardly a dream come true. Every love letter, shout of adulation and advancing kisses drains his energy and worse. If he doesn't find his one true love by the end of the day, he will become cursed and forever alone. That sucks. It does. I'm playing it right now. Is this the game that's rated E, but it's for like books. If you didn't see this new story, so this is great. The Vita physical release comes and it says on the front rated M for Mature for sexual content and you flip over the back and it says rated E for Everyone. Sexual content. Yeah, you, yeah, I'm playing it. It's exact. My Gal*Gun exposure is",
      "start": 3076.52
    },
    {
      "text": "says on the front rated M for Mature for sexual content and you flip over the back and it says rated E for Everyone. Sexual content. Yeah, you, yeah, I'm playing it. It's exact. My Gal*Gun exposure is when Tina Sanchez invited me to a 4-hour 1UP live stream and I went over there and me, her and Jeremy Parish played the import of Gal*Gun and I was like, so what are we doing? She's like, you're making these girls come. I was like, okay, great. And that's what you do. You shoot them with your love arrows and then now with the Double Peace, you rub them. They're in very suggested positions. You rub their tissues and faces and faces and vaginas and all these things and it's just for everyone. I like how you got like touches like as a cute word for a button and you're just like a fucking vagina. That's a cute word for a vagina. Okay. Yeah, sure. Yeah. I don't know if I'm gonna play this game. I still want, I'm doing my first play through and I'm still like, man, it'd be funny to have the",
      "start": 3118.36
    },
    {
      "text": "That's a cute word for a vagina. Okay. Yeah, sure. Yeah. I don't know if I'm gonna play this game. I still want, I'm doing my first play through and I'm still like, man, it'd be funny to have the platinum in Gal*Gun, but it's like, do I really want to get the platinum in Gal*Gun because they have to play it like a bunch of different times. I'm going to be rubbing things left and right. Yeah. There's two. Yeah. There's the majority. I got a lot of flights, so I got plenty of time to be rubbing it out. You cannot be playing this game on flights. Greg, you're talking to a guy who played, what was the other one? Shit. The dungeon crawler where you rub the girls. Oh, of course. A.J.'s favorite game. Oh, no. Is it the game where you fuck a pigeon? Phil, Phil. Talk about Podcast Beyond while I look it up. Oh, Phil. I thought you were like referring to me as Phil. Yeah. Podcast Beyond is going well. We're streaming now. Oh, are you? Turns out IGN streaming. Wait, you see stream recording",
      "start": 3167.36
    },
    {
      "text": "it up. Oh, Phil. I thought you were like referring to me as Phil. Yeah. Podcast Beyond is going well. We're streaming now. Oh, are you? Turns out IGN streaming. Wait, you see stream recording of it. No, no, no. We're streaming like every week we're going to do a two hour live stream of just a game. Not of the show. Oh, okay. Okay. Yeah. I'm Brandon one. That's what tomorrow's Telltale Batman. Oh, here we go. I like, I put in Kinda Funny Perverts right there. That's the one I want to thank you. Is there a video called Kinda Funny Perverts? I remember I called it the most perverted game or something. Criminal Girls: Invite Only. I'm so sorry. I can't remember Criminal Girls. Yeah. Or yeah, you got to rub them. Those girls need to get rubbed and spanked and stuff. Speaking of rubbing, I got played them in a plane. I've been, don't do that. I did. I just don't care. Okay. That's almost going to wear the Gal*Gun panties on my head that I got my little speaker screen cleaner. Yikes.",
      "start": 3213.0
    },
    {
      "text": "I got played them in a plane. I've been, don't do that. I did. I just don't care. Okay. That's almost going to wear the Gal*Gun panties on my head that I got my little speaker screen cleaner. Yikes. I got something you're gonna like run for public office. No, you're gonna have all, trust me. You're gonna have all Hardwick's jobs and it's gonna be like, what's that, the dude who played that porn game on the plane? It's going to be, there's no way like, there's, it's either I'd run for it and like my, my, my, the opposition be like, he said he confesses everything he's ever done wrong. He's infallible. There's no way to stop him. We got no ammunition. He turned, he literally turns his skeletons in the closet into content. How can we, there's no shame. What do we say? I don't know how to stop him. I know I got a lot of, I've got to, there's one man on the internet who's very angry at me because we were talking about those Sonic games. Oh yeah. Sanic. Yeah. And I said, I do, I like Sonic 2",
      "start": 3250.28
    },
    {
      "text": "I know I got a lot of, I've got to, there's one man on the internet who's very angry at me because we were talking about those Sonic games. Oh yeah. Sanic. Yeah. And I said, I do, I like Sonic 2 and 3 and I like Sonic Adventure a little bit. I think like, is one of those like, Mario is better in every way, shape or form. Of course. But I said that the only people who still like Sonic are people who just want to fuck Big the Cat. And I doubled down on it on two different shows. Yeah. And now third. Yeah. Now third. That man's very angry with me. Yeah. Yeah. I saw, I saw it. It was on Twitter. Yeah. Yeah. I saw, I saw the guy fleek on it. I just muted him immediately. Yeah. But it was really funny because he, he's looped into a thread. It's like, I think it's Damon, Alana. It's me too. Yes. But then there's one random IGN fan in it and he's continually like, please stop. Please remove me. Just mute them. Yeah. Laser Disco Defenders comes to PlayStation Vita digital. I know nothing",
      "start": 3290.44
    },
    {
      "text": "Yes. But then there's one random IGN fan in it and he's continually like, please stop. Please remove me. Just mute them. Yeah. Laser Disco Defenders comes to PlayStation Vita digital. I know nothing about it, but I like how the, I just like the little art and I like this on Vita. Let's read about it. Join the Laser Disco Defenders on their quest to defeat the evil Lord Monotone and prevent him from using the coveted Mirror Moon to force the galaxy into dancing along to his and only his tune in this self-inflicted bull in hell. You must stay on your toes as laser being fired ricochets off the walls and hit you too. Oh yikes. It sounded like it was going to be like, I thought it was gonna be like a rhythm game. Yeah. It's like terrifying Ikaruga. Yeah. All right. I'm still into it though. Yeah. All right. Nightmares from the Deep: The Cursed Heart comes to PlayStation 4. Uh, look digital. It looks like a Goosebumps cover. Totally looks like a Goosebumps cover. Nightmares from the Deep is",
      "start": 3329.88
    },
    {
      "text": "All right. Nightmares from the Deep: The Cursed Heart comes to PlayStation 4. Uh, look digital. It looks like a Goosebumps cover. Totally looks like a Goosebumps cover. Nightmares from the Deep is a classic adventure game that tells a gripping tale of undying love. Assume the role of museum curator, Sarah Black, and take control of your destiny to stop the undead Captain Remington and save your daughter's life. See when they say classic adventure game, I'm like, is this a game that already existed? Cause I have never heard of it and I love it from the Deep: The Cursed Heart. Yeah. A lot of these also sound like weird sex things. Of course. Speaking of weird sex things, Overcooked, PS4 digital. Overcooked is a chaotic couch co-op cooking game for one to four players. Working as a team, you and your fellow chefs must prepare, cook, and serve up a variety of tasty orders before bang customers storm out in a huff. Ooh, I'm excited. Now you, do you play as animals in this game? You can. Yeah. I",
      "start": 3372.2
    },
    {
      "text": "your fellow chefs must prepare, cook, and serve up a variety of tasty orders before bang customers storm out in a huff. Ooh, I'm excited. Now you, do you play as animals in this game? You can. Yeah. I started, you get to, you unlock characters as you play a new competitive thing. I started as just a normal white dude and then switched over to a raccoon in a wheelchair. Yeah. I mean, that's sort of been your life. Yeah. You know, if there's one metaphor for Greg's life, now you're a normal white guy. Now raccoon in a wheelchair, garbage night possum. Exactly. Yeah. Wheeling around the town like Drake in the wheelchair. I didn't, I haven't tried it, but for the competitive and because you know how it's, it's cooperative, right? So you have the two characters and you got to do everything. It looks like for the competitive mode, if you and I were to play it, our controller gets broken into two characters. So you have the, you grab and a dropper, a grab and chop. I should say when with the",
      "start": 3411.24
    },
    {
      "text": "looks like for the competitive mode, if you and I were to play it, our controller gets broken into two characters. So you have the, you grab and a dropper, a grab and chop. I should say when with the trigger and then move with the stick and then you have another character that you do the exact same thing with. So it's like brothers and it seems like totally rubbing your head, patting your stomach, doing all this stuff, trying to figure it out. RISK Urban Assault comes to PS4 and PS3 digital. Lead your troops to victory with RISK Urban Assault in a post apocalyptic world. Rally your armies and March across some of the most famous cities around the globe from Shanghai to New York. Be cunning and play strategically to defend your opponents. Repeat your opponents. Don't offend your opponents. My, don't do that. Yeah, just Risk the board game apparently, but it looks all fancy. Like it's got a guy with one eye and he's got some stuff. There's nothing fancier than a man who only has",
      "start": 3450.84
    },
    {
      "text": "My, don't do that. Yeah, just Risk the board game apparently, but it looks all fancy. Like it's got a guy with one eye and he's got some stuff. There's nothing fancier than a man who only has one eye. He's got, but it's got all the thin numbers on it. So yeah, it's urban this time. I guess just Urban Assault. Mark echoes Risk. Get up, get up. And then our final game of the week, Tricky Towers, PlayStation 4 digital. Remember that this is a PlayStation Plus game with your brilliant robe and magic powers. I didn't say that wrong. Robe and magic powers. It's time to build some Tricky Towers. Stack your bricks to create a stable tower and try to topple those of your opponents. Cast magic to support your structure and fend off the dark spells of your rivals in this frantic physics party game. Let me try it out. I try not to everything. If I get some for free, I'm gonna try it out. Yeah. Yeah. Okay. But I call it a given it to Good 15. But 15 minutes and I don't like it. I stopped. Okay.",
      "start": 3492.28
    },
    {
      "text": "Let me try it out. I try not to everything. If I get some for free, I'm gonna try it out. Yeah. Yeah. Okay. But I call it a given it to Good 15. But 15 minutes and I don't like it. I stopped. Okay. Yeah. I appreciate that. Yeah. I thought that you're the Good 15. That sounded like it was gonna be something else. Oh, so I was like, what was Meat Beaters or whatever you're talking about? The old Meat Beaters. Greg and Marty's new show, Meat Beaters. That's our next segment. The Good 15. Next segment is Topic Of The Show. We say TOTS now. No, TITS. TOTS. Tada, TOTS, tidy, tidy shots. This one comes from Hamood07. He says, hello, Marty and Greg. He didn't say that. No, my question or maybe topic of the show, are story focused games overrated? In the past year, so I played The Walking Dead Season One, Tales from the Borderlands, Game of Thrones, Life Is Strange, Limbo, Journey, and watched a full let's play of Firewatch. For years, I heard about how great games like Journey and Limbo or how",
      "start": 3530.44
    },
    {
      "text": "Season One, Tales from the Borderlands, Game of Thrones, Life Is Strange, Limbo, Journey, and watched a full let's play of Firewatch. For years, I heard about how great games like Journey and Limbo or how good the right. Now that's what he says, or how good the writing is in The Walking Dead. But all I could think after playing each one of those games was meh. Sure, Journey was relaxing and Tales had some funny moments, but I could have watched a movie or a TV show for a couple of hours and that would have been much more fun with much better writing. So my real question is, are we as gamers not used to good writing in games so that we then we overhype any game with just okay writing? Now don't get me wrong. Some of my favorite games of all time are story driven like Uncharted, Mass Effect, or the Arkham games, or even The Last of Us, or even The Last, he says, The Last of Us. This kid doesn't know nothing, but unlike the other games I mentioned earlier, all of those games had solid gameplay mechanics",
      "start": 3577.4
    },
    {
      "text": "games or even The Last of Us, or even The Last, he says, The Last of Us. This kid doesn't know nothing, but unlike the other games I mentioned earlier, all of those games had solid gameplay mechanics to simply make the experience much better and overshadow a lot of the problems with the writing itself. Anyway, just want to hear your thoughts. Love you guys. Marty, are we overrating story focused games? So, um, no. First off, no, it's interesting. I agree. I disagree with a lot of what he says, but I agree that by and large, our industry tends is very insular and if you only play games and you don't read or you don't see movies or you're not caught up on TV and music, you have a hard time sort of critiquing what, I guess, good writing is objective. What like is a new story beat or what's a new story idea or how this narrative is coming together? Yeah, but at the same time, the things he's mentioning are some of the best our medium has. Like the stuff like Firewatch and Gone Home and the",
      "start": 3621.08
    },
    {
      "text": "story idea or how this narrative is coming together? Yeah, but at the same time, the things he's mentioning are some of the best our medium has. Like the stuff like Firewatch and Gone Home and the Telltale games, especially Tales from the Borderlands and The Walking Dead Season One, Journey, which I mean, I don't know, Jeremy, it's kind of weird that Journey's lumped in here because I think it tells a story in a way that is so is purely a video game or gives an experience that is like, I would say as much a video game as anything because it's something that like, if you're just watching it, you're sort of not really getting the whole thing. And I know, I know you love The Walking Dead. Oh no. I mean, that's the thing. I love most of these games he has on here. We're not Game of Thrones. I didn't. I don't like Game of Thrones either. Yeah. Yeah. It's strange though. I mean, come on. Yeah. I mean, I think part of, and I'm maybe I'm, I'm reading in here, Hamood07, about your",
      "start": 3667.64
    },
    {
      "text": "I didn't. I don't like Game of Thrones either. Yeah. Yeah. It's strange though. I mean, come on. Yeah. I mean, I think part of, and I'm maybe I'm, I'm reading in here, Hamood07, about your experience with it, but I think a lot of it could just be the fact that it sounds like some of these games you're late to and then there's the hype train that catches up, which I, for me, ruins games all the time. It got me with, we're just talking about it. We didn't bring it up here. Jon was at it. Oxenfree. You and Mitch were, if this would have come out, this would have been game. I was like, oh shit. And I left the bar that day and went and played it. I was like, oh, like this was good, but it wasn't what I was expecting. But that's on me. Right. That I was sitting there. So like, if you're sitting around hearing me talk about crying at the end of The Walking Dead and then Season Two of The Walking Dead, when I start talking about Lee breaking down into yours again, and I can understand where",
      "start": 3708.44
    },
    {
      "text": "sitting around hearing me talk about crying at the end of The Walking Dead and then Season Two of The Walking Dead, when I start talking about Lee breaking down into yours again, and I can understand where you're like, well, this isn't even that good or whatever, but yeah. I remember when you finished a Season One of The Walking Dead, like you pulling Mitch into a room and being like, we need to talk about this. Like it being lost a member of your, and that was the thing of like, I mean, I, I, I, you know, played that in the demo room at IGN with Casey Lynch and Job from Telltale or whatever. And Job was behind it. We're all friends. That's what he was. There. It wasn't like a weird thing. He brought us a build. Yeah. It's like when we got to the end, like I remember like, I'm spoilers for Season One of The Walking Dead, like for real, for real, guys, like seriously. But the whole thing, when you started teaching Clem, I remember getting choked up and having one tear. And then I remember like",
      "start": 3743.24
    },
    {
      "text": "one of The Walking Dead, like for real, for real, guys, like seriously. But the whole thing, when you started teaching Clem, I remember getting choked up and having one tear. And then I remember like Job with the back just going like, he's like, he was like trying to hold in crying and he started crying. And it was just like, that's how much these characters meant to us. And that's the other thing too, is like, I can, you can read a book or watch a movie or do whatever and be like, this thing touched and changed my life and I get into it and I don't have the same hook. So I don't get the same thing out of it. It's all games stories in general. I feel as like what you put into it and then it matters so much more to it. And that matters so much into, especially like a Telltale game, like, yeah, like generally The Walking Dead will end at the same place that it ends for everyone. Yeah. But the ownership you get over the story and the sort of person Lee is and the sort of person he's going to",
      "start": 3774.2
    },
    {
      "text": "like generally The Walking Dead will end at the same place that it ends for everyone. Yeah. But the ownership you get over the story and the sort of person Lee is and the sort of person he's going to help make Clementine be. Same thing with a recent Fiona in Tales from the Borderlands or Bigby in Wolf Among Us. And that's one of the reasons I'm really excited about Batman is just because for the first time if I feel like I can be the author of my Batman is the Batman who sticks to his morals and will never kill. Or if my Batman can be closer to what Snyder's envisioning as Batman. And I really liked the idea that yeah it's probably going to season one of Telltale Batman is probably gonna end in the same place for everyone but my road through it is going to be very different than your road through it. Right. And I feel like it won't be I feel like we're both going to do the altruistic. Of course. I've played the evil Batman or not the evil Batman but like the blood that",
      "start": 3809.56
    },
    {
      "text": "your road through it. Right. And I feel like it won't be I feel like we're both going to do the altruistic. Of course. I've played the evil Batman or not the evil Batman but like the blood that everybody wanted blood that Crowd Play. And I was like damn I was like I would not be this Batman at all. But it's fine. This isn't my exactly. Exactly. I don't have to worry about it. My save file will be intact when I get it. Yeah. I think the other thing too is like I mean I disagree. Like I've seen so many bad movies so much bad TV. That's just not there. Especially like when it's for TV let's get to episodes. So like even a show that I love like Flash right. Has like filler episodes in there where it's like all right why are we doing this? And The Flash actually kind of good about it. Like Smallville we'll throw out there. Right. Like the majority of Smallville is fucking garbage but there are then these episodes like fucking Red that are amazing or whatever. Rosetta",
      "start": 3850.2
    },
    {
      "text": "about it. Like Smallville we'll throw out there. Right. Like the majority of Smallville is fucking garbage but there are then these episodes like fucking Red that are amazing or whatever. Rosetta, Rosetta Stone. The other thing too is like it kind of sucks to compare mediums. You know what I mean? Because games are trying to achieve something different and they have to achieve something in a different way. And recently we went and saw Batman: The Killing Joke in theaters and I'm sitting there and I'm watching it. And I remember you know when I read The Killing Joke enjoying it and like man this is really good. And when I'm watching it on screen and now it's suddenly a motion picture it's moving. It's all these different things. I was like huh there are a lot of leaps in logic that I didn't pay any fucking attention to when I read it. Cause I'm just reading. Oh yeah. Cool. Cool. Cool. I mean comics are all about you filling in the blanks. Yep. Exactly. Movies aren't that.",
      "start": 3883.72
    },
    {
      "text": "that I didn't pay any fucking attention to when I read it. Cause I'm just reading. Oh yeah. Cool. Cool. Cool. I mean comics are all about you filling in the blanks. Yep. Exactly. Movies aren't that. Yeah. And so you're still watching like well I'm a Joker. Get all these guys. And like yeah. Why doesn't Batman beat the fuck out of him right now? Are you kidding me? Like okay whatever. Yeah. But at the time I was like whatever. So why is Batman having sex with Barbara Gordon? That I know probably that I liked fine. I mean that's Batman Beyond whatever you know what I mean? But like then we're spoiling The Killing Joke. Now one of the things that was interesting for me about The Killing Joke right. It's like we left and we're talking about it and I'm like yeah you know I never I'm like this is such a weird double standard thing. And Tim's like what? I'm like so Batman has this sexual relationship with Barbara. There's some kind of there's there's chemistry there. And",
      "start": 3917.08
    },
    {
      "text": "I'm like this is such a weird double standard thing. And Tim's like what? I'm like so Batman has this sexual relationship with Barbara. There's some kind of there's there's chemistry there. And so then when he gets to the end with the Joker and like tries to help him out or whatever and he doesn't and then Joker tells the joke I would have I'm like even that shoes if somebody did that to a woman that I loved I would have beat you up just without mercy. And then it was like but dialing it back to The Killing Joke. You've paralyzed just my partner and taken my best friend and put him through all this stuff. And when I got to that final page I was like wow that's a really powerful ending. Not if somebody shoots Colin tortures Tim I'm not going to get there and share a laugh at the end. I'm going to beat you to death with a two by four and I understand Batman is reserved but to not do anything. I like that. Tim is the Barbara Gordon in this scenario. You and Tim had sex",
      "start": 3951.48
    },
    {
      "text": "at the end. I'm going to beat you to death with a two by four and I understand Batman is reserved but to not do anything. I like that. Tim is the Barbara Gordon in this scenario. You and Tim had sex on a roof. No no he shot. I said that this is Killing Joke. Oh yeah. He shot. Maybe torture Tim. Nobody says no. Colin. I have sex a lot of times. Don't worry about that. Please. The Good 15. We call it the Good 15. Yeah. It's interesting to me because you like people tend to forget like there are masterpieces on TV like The Wire and like Deadwood and Breaking Bad and Mad Men. I can name mass 0 masterpieces. There's also 10,000 other TV shows that are complete fucking trash. Yeah. Yeah. And it's the same thing with games. It's like yeah by and large most games have bad stories and bad writing because by and large most movies have bad stories and bad writing. Most books have bad stories and bad writing. But I think the games he mentioned are some of the cream of the crop and then",
      "start": 3997.4
    },
    {
      "text": "writing because by and large most movies have bad stories and bad writing. Most books have bad stories and bad writing. But I think the games he mentioned are some of the cream of the crop and then stuff like there are a handful of just expert storytellers regardless of the medium that we have. I'd love to know why he's falling out of some of these stories and that it's not clicking for him. Right? I mean Tales has some funny moments. I mean I think Tales is way funnier than most comedy movies. I see. You know what I mean? I I and the the every one of the intros details were so well those amazing music scenes Loader Bot. And I'm also not like I'm not a huge Borderlands fan but I fucking totally this to me was this awesome like space cowboy like Western. No I was talking about it. Like you know for me it was that I I this is the first Telltale game in a while that's come out and I'm just like not for me. Like I don't care about Borderlands. I don't want to be a part",
      "start": 4038.2
    },
    {
      "text": "it. Like you know for me it was that I I this is the first Telltale game in a while that's come out and I'm just like not for me. Like I don't care about Borderlands. I don't want to be a part of this but I had it on my XMB or whatever. And I was or you know whatever you want to call it LiveArea. And I was playing I was one of those nights where I was in a bad mood and I jumped into like three or four games and nothing felt right. And I'm like fine I'll do this. And like literally it turned my mood around where I was laughing within the first 15 minutes and then like into it. And then every episode continued to do that. And like Loader Bot's evolution. And then Ashley Johnson's character glad glad glad. And that's not no Gortys. Thank you very much. Like how great she was in this thing. It's like fuck this is awesome. It was that whole thing of like I like playing Borderlands. I like playing but I play Borderlands with other people with the sound and you turn. I",
      "start": 4079.96
    },
    {
      "text": "in this thing. It's like fuck this is awesome. It was that whole thing of like I like playing Borderlands. I like playing but I play Borderlands with other people with the sound and you turn. I don't know what the fuck's happening. You know what I mean? Like tiny teen is funny. Okay sure. Whatever. But to get into the teens Tiny Toons is really that's a real that's a real that's another great that's a great piece of television. Yeah. It was really weird when Buster and Babs had sex on that roof. It was yeah yeah that's the that's the one they double. So they restarted their new 5 years. Exactly. Exactly. Yeah. Yeah. I mean I think yeah the the Naughty Dog Double Fine Telltale obviously Fullbright with Gone Home Campo Santo with Firewatch. I think those are some of the best stories that our medium has told and yeah there's no that to me is a masterpiece of a game as well as a Mario game or a Zelda game that really isn't about the story of the characters. Of course. I",
      "start": 4111.4
    },
    {
      "text": "stories that our medium has told and yeah there's no that to me is a masterpiece of a game as well as a Mario game or a Zelda game that really isn't about the story of the characters. Of course. I really don't care about those stories. You want to shine in that? Yeah exactly. Like I love Sound Shapes and I love Thomas Was Alone for very different reasons. Yeah. Yeah. And I think part of it you know I mean is you talking about okay. Storytelling. I do think for some of the games you know one game one stories fall apart. Even like he mentions Uncharted and enjoying that right? There's parts of Uncharted every Uncharted and it's because you're trying to get an experience to feel like an epic 1 hour thing and movies don't have to do that. Sure. Don't have to be. And I feel that The Last of Us is one of my favorite games of the last decade and I feel like by the time that third pallet moment came around I'm like just fucking teach us girl. And that was the thing. I was just",
      "start": 4151.72
    },
    {
      "text": "The Last of Us is one of my favorite games of the last decade and I feel like by the time that third pallet moment came around I'm like just fucking teach us girl. And that was the thing. I was just talking to somebody about that. Like yeah I remember when we got to winter and she's like all right go get me something like we've been together three seasons. I would have totally taught you to swim. And what great what a great moment that would have been if I jumped in the water went and got it. She's like oh I got this. Yes. Yes. Oh my God. Yeah. Awesome. Thank you. I forgot that I taught you that. Yeah. Jerks. That's top of the show. Tots tots tots tots tots tots. We got a Trophy Time segment here. This is where we talk about new trophies. We talk about we answer questions about trophies. It's been a good week believe it or not. Marty in the trophy world. Yeah. There we got the No Man's Sky. Trophies are up. I have not looked at No Man's Sky. Trophies. Have you No",
      "start": 4186.92
    },
    {
      "text": "about trophies. It's been a good week believe it or not. Marty in the trophy world. Yeah. There we got the No Man's Sky. Trophies are up. I have not looked at No Man's Sky. Trophies. Have you No Man's Sky? No I looked at some of the leak stuff because I hate myself. Oh you actually watched the videos and stuff. I know I didn't. I just browse Reddit and saw a bunch of stuff. Okay. I know it's at center of the universe which probably isn't great. Probably shouldn't probably shouldn't have known that 0 feet. You know what's the at the center. I feel I had I had it for work. I'm not going to do that. Don't run it for me. So No Man's Sky. I'm looking over here on Exophase 3 total trophies. It has a Platinum which is super excited. Yeah. That's going to be hard to get. You think so? You don't know. I don't know. Yeah. What to yeah. What if on the trophies just like find another person eight Gold trophies here attain adventure status in on foot exploration everlasting",
      "start": 4223.0
    },
    {
      "text": "so? You don't know. I don't know. Yeah. What to yeah. What if on the trophies just like find another person eight Gold trophies here attain adventure status in on foot exploration everlasting status and longest lifespan. These things like you know things that are building over time. You soon. Yeah. Legend status and ships destroyed. Yeah. So I imagine everything sort of has tiered metals and yeah. Once you hit a certain tier on each of these things we're here to Silvers now. Yeah. Attain nomad status and on foot exploration. Yeah. Yeah. So it looks like it's on foot exploration a long lifespan ships destroyed alien colonists encounters. The ships destroyed ones. Interesting because I feel like a lot of people I've talked to want to play this game sort of as like an archeologist like a pacifist. Yeah. Yeah. You got the pacifist got to destroy some ships. Yeah but you don't have to. If you want the trophy you know what I mean and if you're one of those people attain confused",
      "start": 4257.56
    },
    {
      "text": "a pacifist. Yeah. Yeah. You got the pacifist got to destroy some ships. Yeah but you don't have to. If you want the trophy you know what I mean and if you're one of those people attain confused status and worlds collected that's not good but it's all based on that uploaded discoveries space declaration. I'm down for that. That's all stuff I want to do in the game and it's cool. I do like that. It's going to make you. I like trophies that make you think about a game in a different way that you may not have like get you out of your place. Exactly. Exactly. I never really try to see how long I could survive so maybe I should do that. That's how I'll spend the Saturday afternoon. It's trying to get this trophy. Fourteen trophies for Inside. Ooh no Platinum. No one Gold. The rest Bronze some of that garbage. Imagine all that. Not getting the getting the if they're anything like the achievements. Yeah it's all about there's there's much collectible scattered throughout and each one",
      "start": 4299.0
    },
    {
      "text": "some of that garbage. Imagine all that. Not getting the getting the if they're anything like the achievements. Yeah it's all about there's there's much collectible scattered throughout and each one is assigned to an achievement and I don't. It's one of those I'm looking for trying to remember which ones I got. Yeah but I'm not seeing because I thought they said find this thing right and then they I think most of them had like cute names and sort of like a quick piece of pros like room for reflection. It just says hanging up clockwork shadows at noon so I think each each of the collectibles are these little or you disconnect them. You turn the power off. I think each one has is one of those so I think that's I think you can get. I guess you said there's no plat. Yeah you can get all the trophies by just finding all the collectibles which is definitely doable. Okay and then the Batman trophies are up. It does have a Platinum. It's back to what traditionally Telltale has been in",
      "start": 4338.28
    },
    {
      "text": "the trophies by just finding all the collectibles which is definitely doable. Okay and then the Batman trophies are up. It does have a Platinum. It's back to what traditionally Telltale has been in this thing where finish this chapter finish this chapter finish the chapter counts up until he gives you the Gold or whatever. Yeah so I'm happy about that. I know sometimes Telltale started doing this thing where they were experimenting around and giving you like actually try to do this or you know dark rock paper scissors for my you know for whatever and then no Platinums. Now they've got Platinums back so I'm happy about that and it's one of those like with a lot of Telltale games like I do want just one canonical playthrough. Yeah I want my one playthrough of The Walking Dead Season One to be like to stick with me for and that's the whole thing of like why I like just I don't mind the chapter things. I know people like their cheap trophies or whatever. I don't care. I like I",
      "start": 4382.44
    },
    {
      "text": "one to be like to stick with me for and that's the whole thing of like why I like just I don't mind the chapter things. I know people like their cheap trophies or whatever. I don't care. I like I like that and I just because it works for that game. Yeah the one they started doing the thing I want to say Minecraft but there's what's what's the most recent one I've played from Telltale. There was something else in Thrones. No I don't play Game of Thrones. I played episode one but there's another recent Telltale game that was like gotcha do this and do that like I don't want to. I don't want to do this. Why would I do this and then Abzû? Yeah you want to tell me we have you got a lot of trophies. No I was actually playing on someone else's account who had already finished the game. Oh it was Jose who's reviewing the game for us and so I played through on that and so we'd already popped a bunch of them. Gotcha. Twelve trophies no plat three Silvers one Gold. Okay I released",
      "start": 4419.24
    },
    {
      "text": "Oh it was Jose who's reviewing the game for us and so I played through on that and so we'd already popped a bunch of them. Gotcha. Twelve trophies no plat three Silvers one Gold. Okay I released fish from the hidden pools. Discover the polar region. It seems like you're running into a lot of these. Some of you have to that ballet perform a flip while riding a creature. I've done that. Yeah you do a cool flip. You hit circle to do that. Project. There you go. That's the trophy trophy tip. You're right there here on Trophy Time. I've got a question from Kevin Smith. I doubt it's the Kevin Smith though. Last I heard he didn't. He didn't play that much stuff. Okay. Hey Greg and Marty. Oh Kevin Smith knows I'm here. Long time listener. A long time. First time. Actually I have a question for Trophy Time. Last year I decided to make an attempt at getting the Fallout 4 Platinum. I don't have many Platinums because I just don't have the time or will but certain games draw me in",
      "start": 4452.68
    },
    {
      "text": "for Trophy Time. Last year I decided to make an attempt at getting the Fallout 4 Platinum. I don't have many Platinums because I just don't have the time or will but certain games draw me in enough to invest in them. And I love Bethesda Game Studios games. Skyrim was actually my first Platinum. I got all the ancillary trophies including the legendary Benevolent Leader trophy which fucking sucks. God that trophy is bad. What was that? Do you remember? That's the one get a settlements happiness in 99. Oh yeah. And like we were I have the Platinum too. And it was like the last thing I did. And it was just like hands in your hair of like what the fuck? And like you're I nobody knew at the time exactly what to do. So I was just piling carpets and putting statues all over the place. And then it's like you're setting up a million fucking med booths. And then you have to try to assign everybody to him because settlements are stupid and the whole thing's broken. Like it's",
      "start": 4487.88
    },
    {
      "text": "place. And then it's like you're setting up a million fucking med booths. And then you have to try to assign everybody to him because settlements are stupid and the whole thing's broken. Like it's God. And it's just like I'd leave it on for like 1 hours at a time and come back and go up %. And he's like what the fuck is going on? Yeah I got it. The hand the but we'll stop to my tracks by a glitch in the final quest for the Railroad where a key NPC became unresponsive and the quest became impossible to complete. But that's it was aware of the glitch and even issued a patch in the early goings that addressed it but it did not help my broken save. My only recourse was spending another 40 hours with the game to complete my entire main quest again which I still have not done. In fact I've barely played the game since burnout by the grind as I was. I know in my heart that by all accounts I should have these trophies but that near complete percentage bothers me to no end. Have",
      "start": 4524.68
    },
    {
      "text": "I've barely played the game since burnout by the grind as I was. I know in my heart that by all accounts I should have these trophies but that near complete percentage bothers me to no end. Have you ever dedicated yourself to getting a Platinum only to have it halted at the finish line by forces outside of your control? It sounds like you almost did with that same game. There were with the settlements. Yeah that was the thing. But it was like I thought it was still attainable. And I then it was like me I was like maybe I'll wait for a patch. I'm like they'll never patch this. This is never gonna get fixed or anything else. That's really weird too. I just noticed. I started reading the question off of this thing when I have all the questions for that. I only had this here for the links for the trophies. Yeah that was a test testing my patience for sure. The one that infamously did this to me was Dead Island: Riptide right? Or that's the Dead Island. Oh yes. Thank you. Dead",
      "start": 4558.12
    },
    {
      "text": "for the trophies. Yeah that was a test testing my patience for sure. The one that infamously did this to me was Dead Island: Riptide right? Or that's the Dead Island. Oh yes. Thank you. Dead Island: Riptide. Cause that's how it went right? It was Dead Island, Dead Island: Riptide. Then the weird ass other Dead Island like storybook game Dead Island 2 got canceled. There's a Dead Island Collection now. Right. Yeah. Dead Island: Riptide. I liked it. Island 1 a lot and I but it was like okay whatever. And Dead Island: Riptide came out and I think I was reviewing it and it was the perfect time where there's like nothing else going on. And so yeah I did. I got I was just knocking these trophies out having a gay old time. It was before it was out. I was like I'm gonna be the first person to Platinum that. So it was like a fun thing to do. And I was getting so close to getting so close. Then it got down to I needed the tape recorders of like the things or whatever. Yeah. And",
      "start": 4593.64
    },
    {
      "text": "person to Platinum that. So it was like a fun thing to do. And I was getting so close to getting so close. Then it got down to I needed the tape recorders of like the things or whatever. Yeah. And like I'm running around and I forget I can't remember from the game. It tells it does tell it shows you anything on your map like where it should be or something like that or where the thing or where it's going to be. And I had it down to one and I could not find this thing. And I'm running around checking all these things and I called GameStop and I was like Hey do you have the Dead Island: Riptide? You got it. It comes out on Tuesday. He's like yeah we have the guy. And I got an Uber went down to Market Street came back out here to the Sunset and came down and took a Sharpie to it. And I was crossing crossing crossing and finally I get to the last one. I'm like here we go. And I walk into the room and it's not there. And it's that I'd already picked that one up. So it was",
      "start": 4631.56
    },
    {
      "text": "And I was crossing crossing crossing and finally I get to the last one. I'm like here we go. And I walk into the room and it's not there. And it's that I'd already picked that one up. So it was that I picked it up in like maybe there was a day one patch or something and like it didn't I didn't it wasn't where it was supposed to be. It just this tape recorder didn't exist. And so like there I I emailed Deep Silver. I'm like Hey what the fuck? You know what I mean? And like I think it was like months later I think I like we patched it. It should work now. And it's just like that thing of just like I'm so out of that mindset that I'm not going to jump in and like look through the whole thing again and try to figure out where it is. And especially the like the reason you want to do this is because you get that cool satisfaction of I was the first person to do this. Yeah exactly. That is fucking awful. Yeah. That that one that one was really depressing but it was like",
      "start": 4668.12
    },
    {
      "text": "to do this is because you get that cool satisfaction of I was the first person to do this. Yeah exactly. That is fucking awful. Yeah. That that one that one was really depressing but it was like I was lucky enough that it was to the point where it was like I maybe spent four hours three hours you know what I mean? Doing that thing. But then I discovered it was broken. It wasn't like I had spent 0 hours or something and I had enjoyed I had gotten trophies the whole way and I'd enjoyed my ride up until that point but it was still like fuck. So this was going to be a thing. And so that and then now it's always my fear with the Lego games. Oh yeah. I'm such a big I love the Lego games for the ones I really enjoy. And I remember Lego Batman 3 it came down to just needed Catwoman or Killer Croc. I forget which it was. And they had a spawn or whatever in a certain spot and they would not spawn. And it's like that thing of like it's like the last one of the last",
      "start": 4703.8
    },
    {
      "text": "or Catwoman or Killer Croc. I forget which it was. And they had a spawn or whatever in a certain spot and they would not spawn. And it's like that thing of like it's like the last one of the last trophies. I just waste 8 fucking hours. Cause that's like Lego is not rewarding like that island was where it's like oh I'm knocking this out as I go. It's like they all come at the very end when you've done everything. So when it's like holy fucking shit is this not going to do what it's supposed to do? Did it finally? It finally yeah it finally did. Yeah. I just had to keep restarting. That's terrifying. I feel like that's I I I the games I've platinum recently are ones that are relatively short. Oh sure. Stuff like Firewatch and Oxenfree. I know like I think go for platinum The Witness. And I'm like I'm never going to do that. Absolutely. I'm going to do that. Yeah. Yeah. I would I would probably cry if I had a moment like that. Yeah. Real cry. All tears. Sure. I",
      "start": 4742.92
    },
    {
      "text": "The Witness. And I'm like I'm never going to do that. Absolutely. I'm going to do that. Yeah. Yeah. I would I would probably cry if I had a moment like that. Yeah. Real cry. All tears. Sure. I understand. Like Killer Croc tears, Killer Croc tears, Suicide Squad at theaters. This Friday, Suicide Squad. When are you going on Friday? Thursday. Thursday night. Yeah. Going on Saturday morning. Nice. Yeah. You guys do the Saturday morning moves a lot. Yeah. Yeah. Good for you. Thanks. Let me sign up. No we're going to do it and then run right back here. Do our reacts. It'll be a late Thursday, early Friday. I'm KindaFunny.com unless Kevin doesn't put it up. Well you know he he's got a sleep too. He's a busy man. Yeah. He's busy. Yeah. He has a busy B for sure. Uh Marty. Yeah. It's time for reader mail. Ooh I like reading them. Uh we're gonna talk about the NX. We have a few good different questions here out of this. Um let's start with CD99. He see",
      "start": 4780.52
    },
    {
      "text": "Uh Marty. Yeah. It's time for reader mail. Ooh I like reading them. Uh we're gonna talk about the NX. We have a few good different questions here out of this. Um let's start with CD99. He see here she says hello Greg and Marty. I just had to bring up this topic even because you two are fans of both Nintendo and the PlayStation Vita. That's right. Let's talk about the NX and he throws up the X going to give it to you. Of course you can get your question read by going to KindaFunny.com/PSQ and submitting it there. You've probably already seen the recent reports about the Nintendo NX being a portable console that can be docked to your television running games on cartridges. Sure these reports are still not confirmed but they seem pretty reliable from a source like Eurogamer but you know what this hardware design sounds like. That's right. The PlayStation motherfucking Vita. Sad sad enough. This Nintendo NX directly sounds like what the Vita was",
      "start": 4813.4
    },
    {
      "text": "like Eurogamer but you know what this hardware design sounds like. That's right. The PlayStation motherfucking Vita. Sad sad enough. This Nintendo NX directly sounds like what the Vita was intended to be but failed to do so. Think about it. It'll be a console quality experience on the go but it also connects to your television. Remember that strange port on the Vita 1000 models that were rumored to be a TV out cable which might've been canned and led to the PS TV. My question is simple. Will the Nintendo NX finally nail in the coffin on the PlayStation Vita? What are your thoughts comparing the two? Thanks guys. Don't worry. I've been a citizen of the islands since June 2013. Still supporting it but wanted your thoughts CD99. That's a real good question. Yes there's absolutely similarities between what the rumored NX is compared to what the Vita was going to be and then sort of is with a PS TV. That said I don't think the Vita or the NX is success or failure is",
      "start": 4852.36
    },
    {
      "text": "similarities between what the rumored NX is compared to what the Vita was going to be and then sort of is with a PS TV. That said I don't think the Vita or the NX is success or failure is really going to impact Vita at all. I think Vita is where it is right now. Honestly it's a weird thing to say but I think it will eat into my Vita time. If I can take it on a plane and play Zelda like Oh yeah great. Okay cool. Like I won't be playing as much down well or letter. Yeah totally. Yeah. And I do love the idea of not having to choose of even developers not having to choose like Oh do we make this for the 3DS? Do we make this for the Wii U? It's like no you just make it for the thing. That's what's brilliant and why I believe in what they're pitching right now for NX and why the Vita is such a hard sell is the fact that it's like no you have no choice. This is the Nintendo platform. I'm sure this is the Nintendo platform. You're in there in or out. We",
      "start": 4891.24
    },
    {
      "text": "why the Vita is such a hard sell is the fact that it's like no you have no choice. This is the Nintendo platform. I'm sure this is the Nintendo platform. You're in there in or out. We don't mind either way but this is where we're going. Yeah. And that that's super exciting to me. I you know I talk about all the time on our shows this week of just like the idea that it's going to the NX comes out it's what we're talking about. And Tim and I go on all these flights to you know RTX or NYCC and I can just put it on the table and we can play Double Dash or whatever. A Mario Kart the entire way. Are you kidding me? How awesome is that? Oh my God. I know that's the whole thing is I don't care if it looks like the Wii because I might on what I assume is going to be a smaller tablet size thing. Awesome. Yeah. That sounds rad. Yes. I mean honestly that that does sound and I feel like it does appeal to people like us who do travel a lot for work and for the fact",
      "start": 4929.08
    },
    {
      "text": "smaller tablet size thing. Awesome. Yeah. That sounds rad. Yes. I mean honestly that that does sound and I feel like it does appeal to people like us who do travel a lot for work and for the fact that our families in the Midwest and everything we have friends everywhere. And I mean that's always been the interesting thing about about us and then IGN people I think is that we all gravitate to handhelds in a way. I don't think maybe the rest of the country does because they don't ride trains and do like we do. We have a very Japanese lifestyle. We're talking to Jared about this on the Gamescast. That's why it is exciting to us. And I imagine it would be exciting to the Japanese audience. If this is smaller than an iPad I assume it's going to be this powerful gaming system that has all these Nintendo games. And like you were talking earlier if you know I was talking about it as an outsider if I can play Super Mario World on that thing if I can if it's going to be dialed",
      "start": 4967.72
    },
    {
      "text": "all these Nintendo games. And like you were talking earlier if you know I was talking about it as an outsider if I can play Super Mario World on that thing if I can if it's going to be dialed into the Virtual Console and maybe cool games they're finally going to get that right. If they're going to get it right like how cross-play, cross-buy. And that's the weird part right? That it's that's the thing I'm more concerned about. The hardware sounds great. The idea sounds great. The power level sounds great. Like I'm worried about the battery. Oh you know what I mean? I'm worried about these detachable controllers and then it's like oh well you can pair it maybe with the Pro Controller. I'm like yes I'm sure on a plane four of us playing Smash Pro Controller. No that's going to last 30 minutes. You still have those weird Japanese panties on your head right? I only wear those for Vita games such as Gal Gun. I'm sure there's going to be an NX game that comes with panties.",
      "start": 5003.08
    },
    {
      "text": "last 30 minutes. You still have those weird Japanese panties on your head right? I only wear those for Vita games such as Gal Gun. I'm sure there's going to be an NX game that comes with panties. Okay good. That's what I want to get on that. Please. Yeah I it's interesting. It it is. It's if Nintendo is committed to it it's going to be fine and that's the whole problem. You know Sony was always half in half out with Vita and didn't push it the right way. Yeah. I'm really curious also to see like how long the commitment to the 3DS and to the New 3DS which has one retail game that really works for it. And then for some reason can only play Super Nintendo games like my regular 3DS can't. I don't understand why. But oh yeah those nodes. Yeah. I'm really curious to see if Nintendo was just like all right fuck this. We are going all in on this one device. This is our handheld future. This is our portable future. This is our console future. I kind of like that.",
      "start": 5036.12
    },
    {
      "text": "see if Nintendo was just like all right fuck this. We are going all in on this one device. This is our handheld future. This is our portable future. This is our console future. I kind of like that. And I told I man I I would dig that and respect that so much if at this NX event they're like cool this is what it is. We are we are winding down 3DS. We are winding down this. This is what we're putting out games for from here on out. Cause you talk about you know the fact of like well the Wii U only gets so many good games a year or whatever. It's like sure. But then if you got all the 3DS games as well you suddenly have this lineup. That's awesome. And then if they get Virtual Console right then you have this 30 year legacy of amazing. Yeah. And it's me walking around playing this thing and I'm playing Zelda and I'm playing Mario and I'm I have an Animal Crossing and I'm doing this stuff around and it's like yeah this is awesome. And it is the promise of",
      "start": 5072.2
    },
    {
      "text": "around playing this thing and I'm playing Zelda and I'm playing Mario and I'm I have an Animal Crossing and I'm doing this stuff around and it's like yeah this is awesome. And it is the promise of why I loved my Vita. And I and I when I think about this thing of course I'm thinking about it at NX I should say I'm thinking about it. Like I always talk about none of this touch shit games. It's games for gamers. You hope that Nintendo is wise enough to come out and capitalize on what Sony did so right with PlayStation 4. Yes. Come out. This is a games machine. It's not I'm sure it'll be touch screen but it's not gimmicky. We're giving you real buttons on it. Like we want you to play this. It comes to two breakaway controllers or whatever the hell it's going to be. I'm super excited about the rumored NX what it's actually going to be and how it'll actually go and what the library and all this other stuff will be different story with the price points going to be battery",
      "start": 5108.84
    },
    {
      "text": "excited about the rumored NX what it's actually going to be and how it'll actually go and what the library and all this other stuff will be different story with the price points going to be battery life. But like as a concept it sounds awesome. Completely agree. Yeah. Price point and battery life are both big question marks and also when they're going to reveal this thing because it's really close to March. Right. Yeah. You gotta imagine September seems the rumor. Yeah. Yeah. We had a we had a February reveal for the November release PlayStation. Yeah. We had this argument on the Gamescast before this rumor came around. The rumor now is saying there's a September event. They were even to one of the articles not all of them were toying around with it being at TGS but I think it'll be its own thing. It'll be its own standalone thing. Yeah. I imagine in New York. Yeah. Or I hope it's going to be some sort of a global event. Sure. The EA conferences. One more an X-Ray question",
      "start": 5140.28
    },
    {
      "text": "its own thing. It'll be its own standalone thing. Yeah. I imagine in New York. Yeah. Or I hope it's going to be some sort of a global event. Sure. The EA conferences. One more an X-Ray question right? It comes from Chaz the Human. Hey Marty and Greg with information on Nintendo's NX being a home console that can be portable to take games on the road. Do you think Sony would ever consider adapting a similar idea for the PlayStation 5? The mobile market is big in Japan and I'm sure Sony would like to tap into it more with our own proprietary hardware. Interested to hear your thoughts. Well they tried with the Vita and they're like Vita is selling well in Japan right now but no I don't think so. I think this is Nintendo doubling down on what works for them. Their franchises their hardware. Cool. This is what we want to be. And I think Sony's the opposite now of like Oh Hey PlayStation 4 is awesome. We have this core group of gamers that love stuff. If E3 is",
      "start": 5176.36
    },
    {
      "text": "their hardware. Cool. This is what we want to be. And I think Sony's the opposite now of like Oh Hey PlayStation 4 is awesome. We have this core group of gamers that love AAA stuff. Let's go out and do that. Yeah absolutely. And I think yeah I think Sony's for whatever a PS5 is if it's Neo if it's after Neo I think the two big things it's going to be is a very very powerful box which obviously there's an arms race between Microsoft and Sony right now. And then I think doubling down into VR. Yeah. 100%. That's that's going to be their real skew going. Their second skew. Yeah. You don't know like I don't know if VR five years from now is going to be a portable thing. Is that gonna be something where I could bring my my PS VR onto a plane? Is that weird? So I'm gonna do weird things to me when I put it in there. It's weird right now to see people doing it. You know what I mean? That's like the",
      "start": 5213.16
    },
    {
      "text": "I could bring my my PS VR onto a plane? Is that weird? So I'm gonna do weird things to me when I put it in there. It's weird right now to see people doing it. You know what I mean? That's like the most bizarre thing of like Oh my God like what do I can't it's like I can't I'm not making fun of you. It's just like I didn't think we were here. Everyone's why I'll be at a bar and like someone will be like playing with your VR and looking around. I'm like God you're like you're just going to get robbed. Yeah exactly. Exactly. Like you weren't today but like in an airplane that you can kind of get away from it because I'm the guy rubbing the panties on the game adding on the vaginas the vaginas MonkeyPoo1080 writes in and says Hey guys long time listener. First time writing in. My question is on the topic of PS VR. Will the PS VR work with the YouTube app? So we the PS VR user can view those awesome 360 videos. I love first person horror ones where you feel like",
      "start": 5252.44
    },
    {
      "text": "in. My question is on the topic of PS VR. Will the PS VR work with the YouTube app? So we the PS VR user can view those awesome 360 videos. I love first person horror ones where you feel like you just can't go and run away while everything's going crazy and you're screaming for your mama much like the underwater shark demo from PS Worlds. Thanks guys. You rock. Andy he says Andy Nava AKA The Great Andini from PA but then his handle on the forums is MonkeyPoo. He's got a lot of names. He does. It's a very he's a very you can have a lot of names and KindaFunny.com/PSQ as well. Can you change your name? I don't know. Probably not. You're pitching about not being able to change your PSN. You're like Oh you can't do that. Kinda Funny either. You know what we've warned you do as I say not as I do. Exactly. Exactly. You had plenty of time. It won't not launch. No fucking way down the road. Marry me. But I doubt it. Like it's because that's going to take you even",
      "start": 5281.0
    },
    {
      "text": "you do as I say not as I do. Exactly. Exactly. You had plenty of time. It won't not launch. No fucking way down the road. Marry me. But I doubt it. Like it's because that's going to take you even more commitment from YouTube. Like there's so much as we get into this people aren't ready. I don't think to hold hands and be like we're all in this together. It's going to be very much Sony's building up their own thing. I'm more terrified of like is Sony going to have up and running for PSX a dial into the conference PlayStation VR has experience. That is a brilliant idea that is a great that sells it. It gives you such a reason if you have it to use it and be excited about it or something different in the audience at the conference you're backstage. Exactly. And that's what you're talking. Hold on piggybacking off that. The YouTube app. I don't think so. Do you think so? No definitely not. Also that gets into like the weird like porn territory where like all right if if you",
      "start": 5327.24
    },
    {
      "text": "Hold on piggybacking off that. The YouTube app. I don't think so. Do you think so? No definitely not. Also that gets into like the weird like porn territory where like all right if if you support YouTube I'm going to be able to go to the YouPorn, YouPorn. Sam writes into PSQ KindaFunny.com/PSQ and says Hey Marty and Greg last week you spoke about the potential for PlayStation VR to transport users to live events such as sporting events concerts and PSX. I'm having trouble working on how this technology would work in practice specifically how users would be able to control what they're looking at. I am thinking of the experience to be truly immersive. Wouldn't I'm sorry. I'm thinking that for the experience to be truly immersive. Wouldn't each user need to have their own dedicated VR camera at the event. For example let's say I'm tuned into an NHL game say the Flyers versus the Islanders. And so is Colin. Colin wants to turn his head left to watch the puck",
      "start": 5365.16
    },
    {
      "text": "own dedicated VR camera at the event. For example let's say I'm tuned into an NHL game say the Flyers versus the Islanders. And so is Colin. Colin wants to turn his head left to watch the puck but I want to turn my head right to see where the crowd is doing. I can't understand how VR camera would accommodate this. Whoa Sam. We already fixed this. You're thinking you're thinking yes it's very much like The Martian where you're controlling the camera. You have a 360 camera that's beamed out and then you as the user through the interface get to look wherever you want with the camera. One camera can hold a million viewers and anyone can be looking wherever they want. You don't have to worry about that at all. But to go then to what I was excited about a PSX conference right? You have the camera front and center. You turn and you're sitting next to Shu. You turn and you're sitting next to Shawn Layden or whatever right? You up there. And then I think the coolest one would be",
      "start": 5403.96
    },
    {
      "text": "have the camera front and center. You turn and you're sitting next to Shu. You turn and you're sitting next to Shawn Layden or whatever right? You up there. And then I think the coolest one would be you're using a controller to switch between positions. You go backstage you go off to the side you go to the way back. It's not like you're not moving around a 3D space. This is like like cameras. Yeah exactly. There's seven or eight 360 cameras in this auditorium. But to give you a 360 camera on stage like you know what I mean? Like you've been on these stages. You know what it's like to be in front of those people. It's insane. Normal people don't understand it. So many people don't get the opportunity to do what we do. So to get to be up there and be like have somebody come out and the place goes nuts you know Naughty Dog finishes a demo and you get to watch the I mean that would be that's amazing. That'd be awesome. And that's really a cool future for it. And that's why I'm",
      "start": 5441.64
    },
    {
      "text": "place goes nuts you know Naughty Dog finishes a demo and you get to watch the I mean that would be that's amazing. That'd be awesome. And that's really a cool future for it. And that's why I'm like please have this up and running. Yes I would fucking a dog. October 13th is PS VR. You assume PSX is going to be December like make your live from PlayStation app and get going. Yeah I played a there was a Rock Band VR. I don't think it was on it was it was on Oculus but it was a Rock Band where you're standing on the stage and looking at it. It was like a small crowd of probably like a hundred people which we've spoken many times more. But standing in there and like looking down at the crowd and seeing them all look up at me I was like Oh this is like intimidating. Yeah. Like this is very weird. This is making me feel a way of video games never made me feel before. And so being able to like bring that sensation to sporting events what it's like on the 50 yard line of the",
      "start": 5476.44
    },
    {
      "text": "this is very weird. This is making me feel a way of video games never made me feel before. And so being able to like bring that sensation to sporting events what it's like on the 50 yard line of the Super Bowl what it's like half court of a of the NBA All-Star Game what it's like you know front row at a concert. Like that's awesome. Yeah. Next question comes from Ashinzle over at KindaFunny.com/PSQ. Real birth name. That's it. Nailed it. Hey Marty and Greg amazing show. Okay. Do you guys ever get sick of gaming? I mean totally. I know that you actually play them for a living but have you ever just stopped for a period of time? Merci beaucoup from Quebec City. Oh shit. I've been to Quebec. We we we I had poutine there. Was it good? Yeah. It was fucking bomb. It was amazing. Where do you want to go dinner tonight? Ooh what are my options? Have you been to the Richmond, the Richmond Republic Draft House? I don't know what that is. They have a poutine there. Okay. Let's",
      "start": 5516.68
    },
    {
      "text": "Where do you want to go dinner tonight? Ooh what are my options? Have you been to the Richmond, the Richmond Republic Draft House? I don't know what that is. They have a poutine there. Okay. Let's go. All right. Good. I love this place. It's my new favorite place. I'm so into it. That's perfect. Greg have you fallen out of love of games? Yeah. I mean like I don't he's like sick of gaming totally. Like you know like I don't know I don't know if I've ever been like cold turkey. I'm not playing it. Like I'm so sick of games. I'm not playing stuff. I've noticed recently we've been so busy and there's finally not a million new games coming out that I'm like I'm going to play Gal Gun when I play it. And I'm and I saw Abzû I'm still like I'm going to play 30 minutes of this and then get back to it later. And then it's like you know what? I want to watch a West Wing episode or I want to go to the movies or I want to just go out drinking and stuff. Like I'm noticed that I'm",
      "start": 5557.48
    },
    {
      "text": "then get back to it later. And then it's like you know what? I want to watch a West Wing episode or I want to go to the movies or I want to just go out drinking and stuff. Like I'm noticed that I'm not for it seemed like for a lot of months and weeks there it was like new game new game crazy game. I gotta be on top of everything. And it's like now we're to a point where it's like cool. There's stuff coming out like Overcooked that I got to play. But like that's not a 30 hour. What am I going to play Overcooked again now? You know what I mean? Yeah exactly. Co-op and stuff like that. You? Yeah. I had a there's an ebb and flow of like you know review season is busy and and sort of you know but there are games that we do have to play in order to be able to be on Uncharted spoiler casts and and for reviews and for impressions especially with you guys like there you and Colin are expected to keep up with the big place for the show. Yeah I had a I had an actual period",
      "start": 5598.76
    },
    {
      "text": "casts and and for reviews and for impressions especially with you guys like there you and Colin are expected to keep up with the big place for the show. Yeah I had a I had an actual period in I had an actual period. Oh my God. I think it was 2009, 2010 bleeding into 2011 where I moved. I didn't need to do that. I legitimately did not need to do that. It was after I moved out here in San Francisco in 2008 wanting to get a job in the games industry. I'd interviewed at 1Up, Wired, and GameSpot and didn't get any of them. And I got a little burnt out. Like I got a little bit jaded and I was like all right I'm going to I'm going to back burner video games. And I still played things that came out. I feel like Braid came out in that period. And I still played that. I think I got my PS3 in that period and played a Guns of the Patriots. But then it wasn't until early 2011 when I was dating my ex Jen at the time and she started to get into games. And so we'd start to play the Lego",
      "start": 5628.36
    },
    {
      "text": "PS3 in that period and played a Guns of the Patriots. But then it wasn't until early 2011 when I was dating my ex Jen at the time and she started to get into games. And so we'd start to play the Lego games together. We played the Lego Harry Potter and we played Lego Indiana Jones. And then I remember the day I got like officially back into gaming was a Portal, Mortal Kombat day. Yeah. And so she got me I came home from work and she got me Portal 2 and Mortal Kombat and which was Mortal Kombat 9 I think. And we played the fuck out of those. And then luckily a month later I ran into Jeremy Parish at my coffee shop and I applied and he's like Oh apply at 1Up. And I applied. And when I got into the interview they're like so what have you been playing lately? And I'm like Oh Lego games, Portal and Mortal Kombat. And they're like Oh those are three of the biggest things on the site right now. Great. You're hired. And if it wasn't for those I totally I would have went in",
      "start": 5678.2
    },
    {
      "text": "games, Portal and Mortal Kombat. And they're like Oh those are three of the biggest things on the site right now. Great. You're hired. And if it wasn't for those I totally I would have went in there and they'd be like what have you been playing? I'm like yeah Chrono Trigger's really good. Yeah. Yeah. Yeah. And so yeah and it got me back in the game and then of course it was like getting back in the industry. Like I I I was working in guides at the time and so it was like having to keep up to date on whatever the current project was. But it's perfectly normal and perfectly healthy to talk about it. Oh yeah. Yeah. Colin for sure. He sort of tuned out last year. He didn't play a lot of games. He didn't finish a lot of games. He didn't play a lot of stuff. Yeah. And I I it's like that with me with a lot of mediums too. Like there'll be years where like I am going off the beaten path and trying to find the weirdest music like new rap, new you know, you know, no. And then",
      "start": 5723.48
    },
    {
      "text": "that with me with a lot of mediums too. Like there'll be years where like I am going off the beaten path and trying to find the weirdest music like new rap, new you know, you know, no. And then there'll be other years where it's just like now I'm gonna listen to Kanye and Taylor all year and that's all totally fine. It's the same thing with TV. Same thing with movies. Don't feel like you I don't know don't feel like there's a pressure. There's no quote. I mean that's the thing about our industry in particular is that it's so and I mean you know our industry pointing to you the listener and viewer as well as like it's so diverse that no matter what I feel like you can never feel like you're up on everything now. And so like when you listen to a show like this and we're talking about a million different games and we played this, we had access to this and now we're going to go we're going on this trip to play you know you do all these different things and then you go to",
      "start": 5756.68
    },
    {
      "text": "about a million different games and we played this, we had access to this and now we're going to go we're going on this trip to play you know you do all these different things and then you go to the forums or the comments or wherever you want to go. And people are talking about the million different games they're playing. It can be overwhelming to the point where you feel like I'm not a real gamer because I only play what I want to I only play these three games or something. That's not what it is about. Just because you didn't see all 10 best picture nominees. It doesn't mean you're not a movie. Well that means you shouldn't have an opinion on the Oscars though. I'll tell you what Sam Wan wrote into KindaFunny.com/PSQ and has the honor of being the final question. Hello there. I've heard you guys talk about review scores on the show before and how you're not a fan of them. Are you a fan of review scores? No. Okay. As for myself I feel that they have been ingrained in my",
      "start": 5790.28
    },
    {
      "text": "I've heard you guys talk about review scores on the show before and how you're not a fan of them. Are you a fan of review scores? No. Okay. As for myself I feel that they have been ingrained in my head since I was a kid starting out reading GamePro and PSM. Now as an adult I find myself reading almost no reviews and instantly jumping to the score. What's even worse is that I've conditioned myself to only play games that are roughly an 8.5 or above. With so many games out there I slowly decided this was the best route to take. Piggybacking off what you just talked about. I started thinking more about this when I was watching a video review for Song of the Deep and Greg said he would probably put it in the same, the high sevens right after, probably put it in the high sevens right after talking about how great it is. Because of the review I now want to play it and I now want to play it and give lower score games a chance that I never would have in the past simply due to Greg's",
      "start": 5819.56
    },
    {
      "text": "talking about how great it is. Because of the review I now want to play it and I now want to play it and give lower score games a chance that I never would have in the past simply due to Greg's enthusiasm for it. My question to you is what are some of your favorite games that don't have great review scores and aren't universally acclaimed? Thanks for all the content. Sam Wan. First off, Sam, good call. The thing that you're talking about watching this video and how it changed your opinion. When we say we don't like review scores that's what we always mean from the written perspective of if you read a review you get such a great comprehensive look at what I liked and what I didn't like and how I got to this score. And when you just jumped to a score and it's not an 8.5 and you bounced, you miss the fact that like yeah, Song of the Deep isn't that deep. But fuck do I think it's charming and did I enjoy myself? Totally close with you on a personal level and you're like I am so",
      "start": 5853.0
    },
    {
      "text": "you miss the fact that like yeah, Song of the Deep isn't that deep. But fuck do I think it's charming and did I enjoy myself? Totally close with you on a personal level and you're like I am so ingrained in the story and this Celtic world. Yeah exactly. Exactly. And I think review scores are tricky because you guys got rid of review scores. You don't do numbers anymore. You just talk about things. As much as I would like to I totally understand their sort of I think necessity currently in places like IGN especially. I'm not a fan of a super granular scale. I think a hundred point scale is sort of silly. I would like it. When we went to 0 I liked 0. Yeah I'd like a 0. I could totally handle a 10. But yeah I mean one of the big changes we just made at IGN is we got rid of pros and cons. Oh really? I didn't know that. Yeah. So that was just a couple of weeks ago. I think Overwatch might've been the first game or Battleborn might've been the first game that didn't have them",
      "start": 5893.32
    },
    {
      "text": "and cons. Oh really? I didn't know that. Yeah. So that was just a couple of weeks ago. I think Overwatch might've been the first game or Battleborn might've been the first game that didn't have them because those were things you're taking a very brief word or two. You're taking them out of context. And the context is in the 100 words of the review. It totally makes sense. But taking it out of context if you just latch onto that that's kind of dumb. Like scores yeah I guess that's a thing you can latch onto and it makes a little bit more sense because scores especially at IGN and eight is great. Nine is amazing. But that said yeah don't reviews is someone's opinion. Right. And yeah like you you can value one person's opinion over another's and be like oh I generally agree with Greg on games. Greg's back in it. I'm going to play it. I'm probably gonna like that kind of thing. Or like I totally disagree with Greg on most games. So if he's crazy about something maybe I'm",
      "start": 5933.16
    },
    {
      "text": "Greg on games. Greg's back in it. I'm going to play it. I'm probably gonna like that kind of thing. Or like I totally disagree with Greg on most games. So if he's crazy about something maybe I'm gonna shy away. And if he's negative on something maybe I'll give it a second. Look that's what I always talk about where for me you know being as busy as we are when review bar goes lift I like to pop on and look at the scores just cause I don't have time to read all the reviews. And then it is that thing of like oh this per IGN said this who reviewed it. And then I start immediately knowing well I don't agree with Dan on most games but I agree with this. And that's why I always say it's the best time to be a consumer of games right now because it is so easy. It's just like your old video store back in the day of like Paul's picks. Paul's got the same taste as me. So he's putting this movie out. Of course. And then not only do you have them on you know giant outlets like IGN",
      "start": 5974.52
    },
    {
      "text": "video store back in the day of like Paul's picks. Paul's got the same taste as me. So he's putting this movie out. Of course. And then not only do you have them on you know giant outlets like IGN but then you have things like Kinda Funny or you can find someone who has 10,000 subscribers on YouTube but you watch her videos and you're like oh I'm like we're totally on the same page with this. So I'm going to listen to what she's saying about that. Yeah. And it's really I don't know. It's really interesting to me then. So piggybacking not piggybacking I guess answering the second part of the question. Sure. Games that generally scored low that you like. Yeah. Yeah. I'm trying to think of a couple that are coming. I mean for me it was my example always was at launch DC Universe Online right? Of like I was so into that game. And then I think IGN initially gave it a seven maybe they gave it an no I think it got re-reviewed and got an eight. I think it was initially a",
      "start": 6012.52
    },
    {
      "text": "online right? Of like I was so into that game. And then I think IGN initially gave it a seven maybe they gave it an no I think it got re-reviewed and got an eight. I think it was initially a seven and I was like totally understand it's broken as fuck but God is it good? Yeah. Speaking to the DC fan. And then it's one of those things where it's like if you don't have the same love of DC as you do you're not going to feel the same way. Exactly. Exactly. And like the Pokémon Go right now right? Of all these scores that are super low whatever it's like the games are amazing. Yeah. I'm so glad I didn't have to review it. Cause I'm like yeah technically this game is broken and shitty but like it's one of the most memorable experiences I've ever had. Felt that way about the tour brought up earlier. I think it was one of the most interesting move games that said sort of weird and broken. Yeah. Papo & Yo got some some a wide swath of scores. And that was a game that yes it had a",
      "start": 6044.36
    },
    {
      "text": "up earlier. I think it was one of the most interesting move games that said sort of weird and broken. Yeah. Papo & Yo got some some a wide swath of scores. And that was a game that yes it had a ton of problems but it just hit me emotionally. And so totally worth the ride. Exactly. It hit you right where it needed to go. Yeah. Yeah. But yeah you're doing the right thing. I you know we're lucky enough now to be able to see games at a glance and be like okay cool. That looks like it's something I would like. And I like the context and the story of it. So I don't need to get hung up on what it is. And like Song of the Deep was one of those games of like I like everything that seems to be happening and I got I was like Oh yeah. Okay. Yeah. All right. I'm in. And it's coming from like folks like it's appeals you on an aesthetic level you know Insomniac generally makes super rad games. Yep. Yeah. Sunset Overdrive. That was a real good game. It was Marty. Yes. Would you like to",
      "start": 6080.28
    },
    {
      "text": "folks like it's appeals you on an aesthetic level you know Insomniac generally makes super rad games. Yep. Yeah. Sunset Overdrive. That was a real good game. It was Marty. Yes. Would you like to meet PS I Love You's Best Friend of the Week? Ooh who is it? This is going to be Twisted_B_Dead. If you didn't know ladies and gentlemen you write in the KindaFunny.com/forums go to the PS I Love You XOXO board and you can put in your PSN name. So you get all sorts of friend requests. You get people to play games with. You get nice messages. This one comes from a man named Aaron but he's not writing in for himself. I like this. Hello best friends. I'm writing it for my nephew Patrick. His PSN is Twisted_B_Dead. Just the letter B Twisted_B_Dead. He is legally blind but does very well by sitting very close to the TV. He beat Bloodborne before me. He has been playing video games since he was three years old. He would watch me play Super Mario Bros. and tell me beat",
      "start": 6113.08
    },
    {
      "text": "very well by sitting very close to the TV. He beat Bloodborne before me. He has been playing video games since he was three years old. He would watch me play Super Mario Bros. and tell me beat it uncle Aaron. I would say I can I can only get to the last boss until I told him to beat it. And he did years later. Now he loves playing online multiplayer but doesn't have a lot of friends on PlayStation. He lost his first PlayStation account after losing access to the original email address. He plays a lot on Xbox 360 right now. We are playing Plants vs. Zombies: Garden Warfare 2. He has listened to Beyond! and likes it and likes it and Kinda Funny. All right great. He's listening to Beyond! and likes it and Kinda Funny although he plays more games than game content. Don't know what the hell that means anyways. Thanks for such a great community. So everybody hit up Twisted_B_Dead on PlayStation. That's incredible. This is Patrick. His uncle is Aaron and he needs",
      "start": 6154.52
    },
    {
      "text": "know what the hell that means anyways. Thanks for such a great community. So everybody hit up Twisted_B_Dead on PlayStation. That's incredible. This is Patrick. His uncle is Aaron and he needs friends to play with. Yeah so go talk to Bloodborne. So he knows what's going on. He knows a lot of real cool stuff. Yeah. Now we're going to go do this week's Forgotten PlayStation Game. This is where somebody nominates a classic. I like this. You get to judge if you did all right. All right. Okay. This comes from Chavo Sore. It's like Chavo Guerrero dinosaur pass away. No Eddie did. Okay. I don't think it's just Chavo Chavo still. All right. I would have known I'm not up to date on Chavo. I know that. Hey Marty and Greg for this week's Forgotten PlayStation Game. I wanted to bring up a special little game for anyone seeking grand adventure and storytelling known as Alundra. Oh I like Alundra made by Matrix Software and published by one of my favorite publishers in the PlayStation One era.",
      "start": 6191.16
    },
    {
      "text": "little game for anyone seeking grand adventure and storytelling known as Alundra. Oh I like Alundra made by Matrix Software and published by one of my favorite publishers in the PlayStation One era. Working Designs. Alundra is a game that any fan of A Link to the Past could find themselves lost in for hours and hours top down perspective, dungeons, puzzles, action, spells, and an incredibly dark and twisted story that only gets better as the game goes on. Alundra is a timeless adventure and is absolutely is absolutely worth worth everyone's time. It's available on PSN for download on PSP, PS3, and that gorgeous little beast known as the Vita. Keep being awesome guys. PS stay away from the sequel. They blew that shit up. They blew that shit up with bad design. It was a really good PSA. Chavo Sore. One of the I really dug Alundra. One of the things I like most about the PS One is that of course you have the top tier of all games but especially of RPGs with stuff like Xenogears and",
      "start": 6232.52
    },
    {
      "text": "Chavo Sore. One of the I really dug Alundra. One of the things I like most about the PS One is that of course you have the top tier of all games but especially of RPGs with stuff like Xenogears and Final Fantasy games, Chrono Cross, Parasite Eve Tactics. But then you have this B tier of RPGs that wasn't Square. Wasn't making them but you have stuff like that. And you have Wild Arms and and you have these really incredible games that like I look back and remember so fondly. And I don't know if I went back and played it. I don't know if I'd still like it but at the time it totally totally totally clicked with me. Yeah. Yeah. PlayStation One was an awesome era for that stuff. Seriously. Yeah. It was also it was that weird era where it was like the wild West for developers and was like fuck it. We can do Intelligent Cube. We can do Vib-Ribbon and we could do CD like the investments. So low. Go ahead. Yeah. That was cool. Now it's time for PSN's Worst Name of the Week. This one is",
      "start": 6274.28
    },
    {
      "text": "submitted by NotTheWorstPS. This is his username not his worst name. All right. Okay. Jack Nicholson not his worst PSN name but now you have an idea of where Jack is. He says Hey guys I was 15 years old when I got my PlayStation 3 as you can imagine being 15 years old I was the seediest guy around. I took any chance I could to have a laugh with my friends and be edgy. And what can only be described as one of the single worst moments of my life. 15 year old knee signed up to the PlayStation Network as BukkakeWarrior. Yikes. Yes. You heard that correctly. I was running around playing online games for about two years before that name was reported. And I was just told I needed to contact PlayStation. I called them up to see what happened and to console me. The woman on the other",
      "start": 6311.4
    },
    {
      "text": "online games for about two years before that name was reported. And I was just told I needed to contact PlayStation. I called them up to see what happened and to console me. The woman on the other end of the phone said that it wasn't even the worst name she'd heard that day. Apparently earlier that day someone with the name AuschwitzQuickScope called up for the same reason. I am thankful that at this time I did not care about trophies and that I have now moved on to greater names but the name still haunts me. Love you guys. Jack Nicholson. Well that was a journey. Jack was incredible. I feel comes to the conclusion of maybe still not the best choices in names. Jack really loved the idea. You mentioned Journey of like you get that moment at the end of Journey where it's like these are the travelers you met along the way and it's BukkakeWarrior and AuschwitzQuickScope or whatever. We had all these amazing moments together and we were chirping trying to get up this thing and like",
      "start": 6354.92
    },
    {
      "text": "travelers you met along the way and it's BukkakeWarrior and AuschwitzQuickScope or whatever. We had all these amazing moments together and we were chirping trying to get up this thing and like Oh man. And then you get there like BukkakeWarrior. That's how it was. Remember you can get your horror your personal bad PSN name read by going to KindaFunny.com/forums and putting it in there just like Jack Nicholson did. What's his actual name and that over and over again. What a poor I come from the Virginia Nipples. We're a respectable taffy factory. Marty, PSN's Worst Name of the Week was brought to you by Loot Crate. Loot Crate is a monthly subscription box service for Epic geek and gamer items and pop culture gear for less than $0 a month. You get four to eight items that include licensed gear, apparel, collectibles, unique, one of a kind items in more. Make sure you head to LootCrate.com/PS and enter the code PS to save $3 on a new subscription. Loot Crate is more",
      "start": 6397.32
    },
    {
      "text": "licensed gear, apparel, collectibles, unique, one of a kind items in more. Make sure you head to LootCrate.com/PS and enter the code PS to save $3 on a new subscription. Loot Crate is more than just a subscription service. It's an entire community of fans that share their experience and interact with each other around the unboxing of each month's crate and they guarantee more than $40 in value in every crate. Sometimes it's a lot more every month. There's a different theme and all the themes and items are curated around that theme. I added a theme in that sentence. Can you guess where I put it in? Good luck. I think I nailed it and perfectly hit it in there. No one will know. Previous crates have included items from franchises like Star Wars, Marvel, The Walking Dead, The Legend of Zelda and many more from bad guys doing good things for the wrong reason to good guys with questionable tactics. August is the perfect time to explore the Anti-Hero Anti-Hero Season Squad. Yeah",
      "start": 6438.76
    },
    {
      "text": "of Zelda and many more from bad guys doing good things for the wrong reason to good guys with questionable tactics. August is the perfect time to explore the Anti-Hero Anti-Hero Season Squad. Yeah exactly. I think that's why it's around. Walk the hero villain line with this 100% exclusive collection of items from DC Comics, Archer, Dark Horse and Kill Bill. That includes two great collectibles, a wearable, and of course our monthly tee. Don't forget the pin. Remember you only have until the 19th at 9 PM Pacific to subscribe and receive that month's crate. And when the cutoff happens Jackie T that's it. It's over. So go to LootCrate.com/PS and then the code PS to save $3 on your new subscription today. You said Archer for a second. I thought you said Archie. And I was like I don't think those are the antihero. Him and Jughead up to no good. Yeah. I mean we're being honest about antiheroes. Yeah. I feel like Archie just plays Betty and Veronica against them each other the",
      "start": 6475.96
    },
    {
      "text": "think those are the antihero. Him and Jughead up to no good. Yeah. I mean we're being honest about antiheroes. Yeah. I feel like Archie just plays Betty and Veronica against them each other the whole time. Yeah. Like I mean it's don't get me wrong. There's like a thing there but it's like just pick one. Like you know what I mean? But I do appreciate that the Archie series has like the they had the ongoing thing where he was dead. Yeah. They had the ongoing thing where he was one reality where he was with Betty. One when he's with Veronica. Yeah. That's a fascinating thing. They do. Yeah. The Archie versus a deeper than most people think. I know it's hard to believe. Yeah. I'm excited for this Loot Crate for the Suicide Squad stuff. Anytime they put DC stuff in there I'm excited to see what's going to be one. It will be Killer Croc scale. Just like you know what I I subscribe to Loot Crate Pets and I get a box for Porty. I really hope there's some good Suicide Squad stuff in",
      "start": 6518.2
    },
    {
      "text": "see what's going to be one. It will be Killer Croc scale. Just like you know what I I subscribe to Loot Crate Pets and I get a box for Porty. I really hope there's some good Suicide Squad stuff in there. Oh they send T shirts. They send you a T shirt and they send the dog a T shirt and they matching T shirts. I like that. Oh it's really cute. I like that. Porty's a good dog. Ladies and gentlemen thank you so much for watching this episode of PS I Love You XOXO. Remember PS I Love You XOXO is KindaFunny.com PlayStation podcast. So go to KindaFunny.com subscribe to the other YouTube channels. Go there. You leave the comments, you share it with your friends. You watch love and sex stuff. You follow us all on Twitter. You go to the Instagrams, you go to the Facebooks, you do all that stuff. Remember that Marty Sliva is the best beer in the business and he's from IGN.com. So make sure you support podcasts Beyond! and podcasts Unfiltered & Unlocked in a what you're on every show.",
      "start": 6551.24
    },
    {
      "text": "stuff. Remember that Marty Sliva is the best beer in the business and he's from IGN.com. So make sure you support podcasts Beyond! and podcasts Unfiltered & Unlocked in a what you're on every show. Yeah. I'm on Game Scoop! a lot. Yeah. Yeah. Yeah. Does Damon ever talk about me? Uh we miss you. Yeah. And Damon doesn't fucking miss me. You still do a podcast with him once a month. And remember PS I Love You XOXO posts every Tuesday at 9am rain or shine until I fuck that up and it's going to happen one day. Look at my Twitter when you figure out why it's not there. So subscribe to us on iTunes, leave reviews, do all that jazz. It goes up on YouTube.com/KindaFunnyGames. Of course as well every episode of PS I Love You XOXO ends in a song and a segment we call Singing a Shoe. Hey this is where one of you talented motherfuckers go to KindaFunny.com/PSM. The M is for music and it gives me a song. I need an MP3 download and I need a YouTube video. I play the MP3",
      "start": 6586.12
    },
    {
      "text": "is where one of you talented motherfuckers go to kindafunny.com/PSM. The M is for music and it gives me a song. I need an MP3 download and I need a YouTube video. I play the MP3 at the end of our MP3 and I link annotate. They call it to your YouTube video at the end of our YouTube video. This one comes from Jared. Jared says hey Greg I'm the guy who gave everyone a Kinda Funny signing. No let me do it again. I'm the guy who gave everyone at Kinda Funny signing at RTX the EP slash T shirt that I made. You told me to email you here to get it on PS I Love You and after finally having a bit of downtime after getting back from my Texas trip I'm doing just that. I don't really have a preference on what song you use and so I chose Hotel John Marshall. Don't do that. Don't make me pick. I hate it when you make me pick so just send. Just tell me what song. Here's his write up on the project. I started. Now here's the problem I'm having right now.",
      "start": 6629.0
    },
    {
      "text": "Don't do that. Don't make me pick. I hate it when you make me pick so just send. Just tell me what song. Here's his write up on the project. I started. Now here's the problem I'm having right now. Jared you didn't even mention what this is. You want to go to Facebook.com slash Good Talk RVA. That's Good Talk RVA. I believe the band is called Good Talk RVA. Just a heads up. Yeah it's band. Can't is it Good Talk RVA. Jared continues. I started this band during my sophomore year of college in 2014 with a few friends of mine. We ended up writing one of the songs on this EP but then sort of fizzled out after we played a couple of shows since we all got busy balancing jobs in school. The band sat on the back burner for all of us but I always wanted to give the one song we wrote some sort of final release. After discovering Beyond! and eventually hearing you guys leaving IGN to create Kinda Funny I was inspired and decided I would flesh out these songs. It took a while but after",
      "start": 6671.32
    },
    {
      "text": "of final release. After discovering Beyond! and eventually hearing you guys leaving IGN to create Kinda Funny I was inspired and decided I would flesh out these songs. It took a while but after some further convincing from my friends the EP was finally recorded this year. I wrote sang and played everything besides the drum on these four songs and recorded everything in my friend's bedroom down in Richmond. 50 minutes of good time. Now that I'm graduating and soon moving to Texas I'm not sure what else is in store for this project but I'm always writing songs and who knows what could be next. Hopefully you guys and the listeners of PS I Love You XOXO can find something to enjoy from these four songs. So again this is Jared. Good Talk RVA. I'm going to play the song Hotel John Marshall John Marshall and you can go to the links anywhere around here to hear the rest of it. Who do you think John Marshall is? Sarah Marshall's grandfather. Oh and he had a hotel. Sure. And that was",
      "start": 6712.44
    },
    {
      "text": "John Marshall and you can go to the links anywhere around here to hear the rest of it. Who do you think John Marshall is? Sarah Marshall's grandfather. Oh and he had a hotel. Sure. And that was the hotel in Forgetting Sarah Marshall right? The Hawaiian resort. Right. Right. Right. Fascinating with Mila Kunis. Yeah. She was she's an adorable lady. Isn't she? I liked her and everything she's in. I didn't watch that one where she had magic powers and Channing Tatum had a ponytail but I everything else. Oh yeah. That was the Wachowski movie right? Do you want to know something funny about Mila Kunis is that she gets together with the Ashton Kutcher guy right? I totally had fucking forgot that they spent like a decade on the same show. You're like how did they meet each other? Like oh wait they made out for 10 years on the goddamn That '70s Show. Like huh? I'm dumb. Yeah. But you know who isn't Jared. Here it is. Good Talk RVA Hotel John Marshall until next time. It's been our",
      "start": 6751.16
    },
    {
      "text": "wait they made out for 10 years on the goddamn That '70s Show. Like huh? I'm dumb. Yeah. But you know who isn't Jared. Here it is. Good Talk RVA Hotel John Marshall until next time. It's been our pleasure to serve you.",
      "start": 6791.16
    }
  ]
}
