{
  "id": 1985,
  "video_id": "HBkgLxbzLjY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [],
  "title": "Jetpacks - The GameOvergreggy Show Ep. 141 (Pt. 2)",
  "description": "Thanks to Casper for sponsoring this video!\nGo to http://www.casper.com/gameovergreggy and use promo code: gameovergreggy\n\nNick wants to talk about jetpacks for some reason.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1471330800,
  "duration": 1977,
  "transcript_chunks": [
    {
      "text": "This episode of The GameOverGreggy Show is brought to you by Casper. Casper is an online retailer of Premium mattresses for a fraction of the cost. Casper is revolutionizing the mattress industry by cutting the cost of dealing with resellers and showrooms and passing the savings directly onto you the consumer. Get a Casper mattress for $500 for a twin or $950 for a king-size mattress. Comparing this to Industry averages that's an outstanding price point. Don't even, you just don't, it's great. Don't worry about it and you can save an additional $50 towards your mattress purchase by going to casper.com/gameovergreggy and entering the code gameovergreggy. Again casper.com/gameovergreggy enter the promo code GameOverGreggy terms and conditions apply. Nick, you're in rare form today what's your topic? Jetpacks. It's like it's like a seven-year-old like G dinosaurs and jetpacks. Jetpacks so I saw this story is it really? Oh yeah it's jeex. I saw this story like a half a month ago and I was like",
      "start": 0.2
    },
    {
      "text": "topic? Jetpacks. It's like it's like a seven-year-old like G dinosaurs and jetpacks. Jetpacks so I saw this story is it really? Oh yeah it's jeex. I saw this story like a half a month ago and I was like oh holy **** I want one of these. Um, golfer named Bubba Watson, are you guys all familiar with him? No, but I like I like I like the name. Um, is part of this uh is is helping to prototype this. It's made by Oakley. The **** it is a portable jetpack golf carts. Do we have videos of it? Yo yeah do you want to read the article so everybody gets brought then we can watch the video. Kevin can do the thing like long can you guys watch it muted? Sure. The humble golf cart is now very Sleek is is not very slick but it gets the job done so is there a better way to get from T to Green in 2013 pro golf for Bubba Watson along with Oakley and neoteric hovercraft posted that question with the golf cart hovercraft which is also awesome but that's what we're talking about what that's a golf cart hovercraft that",
      "start": 55.56
    },
    {
      "text": "Watson along with Oakley and neoteric hovercraft posted that question with the golf cart hovercraft which is also awesome but that's what we're talking about what that's a golf cart hovercraft that they made first now with the help of Martin aircraft the team has taken to the skies with the golf cart jetpack okay based on Martin's current pre-production prototypes the golf cart jetpack can fly as high as 3000 ft what the **** and as fast as 46 mph thanks to a 210 horsepower engine powering two duct fans so basically it's standard J with extra space for clubs and sand bottles as fun as it would be to get a bird eye view of the chorus and watch watch your uh watch your golf buddies shoot from on high uh practical considerations must keep this concept on the ground Bub insists the jetpack will speed up play but in the time it takes to strap it fly down the Fairway land and take your shots your friends who can't join you in the single pilot craft uh could well be holes ahead of",
      "start": 110.6
    },
    {
      "text": "jetpack will speed up play but in the time it takes to strap it fly down the Fairway land and take your shots your friends who can't join you in the single pilot craft uh could well be holes ahead of you yada yada yada uh basically the long short of this is they're prototyping this he's kind of the figurehead for it each one of them costs $200,000 okay okay which might sound steep until you see this damn thing in action all right just it's muted it's okay bud we like you looking out for the show thank you here we go and you're Kevin's gonna put this in here so it's down here somewhere go suck a dick regular golf cart why does it need to go why does it need to go to 3000 ft though go 3000 ft you're going to break the switch and just keep going Bubba you don't need to go 3000 ft Bubba has a pink driver but he can do what hell he wants true uh so he's talk here let me there you go now I should also say you need a pilot's license for this and you have to be trained on it because it is",
      "start": 160.72
    },
    {
      "text": "a pink driver but he can do what hell he wants true uh so he's talk here let me there you go now I should also say you need a pilot's license for this and you have to be trained on it because it is actually like it's a space vehicle a space vehicle space it is actual place you have we have to be able to have so he's the only person I can pilot right now that's pilot Mike Reed Bubba can't actually pilot yet but he's taking courses apparently is dope as **** isn't that amazing I just want it so pretty much has just drone technology got to the point where they're like all right when we were little kids we dreamt of being able to fly things and that actually be cool now we hit that point and they like what if we put ourselves on that thing I mean I that's my question to you guys is looking at this and then not obviously for long rides but like to get around San Francisco would you get one of these 100% I mean like the problem is that once it became it I mean we'd have the same",
      "start": 215.36
    },
    {
      "text": "looking at this and then not obviously for long rides but like to get around San Francisco would you get one of these 100% I mean like the problem is that once it became it I mean we'd have the same congestion in the air and then I'd be worried about other jetpack Riders Now Kevin shaking his head well you have a um you just put that chip that you have in cars that like Auto Steers for you so like it'll ping theirs and then it pings you and you got to stay away from each other okay that's fine of course granted if your car breaks down you're not going to fall from 3000 ft yeah I don't that's the thing I would never get up to you don't have to go that high either you go like 15t above the air 20 just above the cars we got but even above the cars there's so many wires across the streets in San Francisco you got 30 40 ft then and then you're so close to the face of God why not Reach Out And Touch it get as high as you can ter drink a bit get a little higher um dude 3000 feet is high is",
      "start": 255.84
    },
    {
      "text": "San Francisco you got 30 40 ft then and then you're so close to the face of God why not Reach Out And Touch it get as high as you can ter drink a bit get a little higher um dude 3000 feet is high is twice as high as the Freedom Tower in New York City look how **** cool how high you can go in that thing why would you ever go that high I would be fine with it because I would be like okay here's the deal fantas uh go that High make people go that high and then if a malfunction happens everything has parachutes you just kind of strap off parachute it parachutes you're good it's fine it parachutes the fiery wreckage why is it fiery did a missile hit I mean what how else is it going to break one of the turbines go turb just goes down and you go in a circle all the way down to the ground it's like a helicop so so what I'm really intrigued by this so why are they like golf carts that's the one place that we have all the **** room in the world to drive around we already have a vehicle",
      "start": 292.28
    },
    {
      "text": "like a helicop so so what I'm really intrigued by this so why are they like golf carts that's the one place that we have all the **** room in the world to drive around we already have a vehicle made just for this m you want to know why inconspicuous this seems like a luxury item for old rich white guys clearly the military is behind this clearly this has got nefarious purposes and they're like we'll just put it there and we'll put a guy named **** Bubba in it and every's going be like what a cute thing next thing you know **** Vita and the secret police here Lola coming in they're getting here they're coming in in jetpacks yeah man that sounds cuz no I feel like this is a huge step forward for jet packs because the last we last we saw a jetpack was the water the water jetp pack oh those are sweet that but that's does that even count as a jet pack I don't know it's gotten some real good videos no the jet I'm can you find me that video the water jetpack thingamajig is fine I mean",
      "start": 337.24
    },
    {
      "text": "are sweet that but that's does that even count as a jet pack I don't know it's gotten some real good videos no the jet I'm can you find me that video the water jetpack thingamajig is fine I mean I don't think that's an actual jetpack that doesn't use Jets right are turbines right what what you were saying the first version was called a hovercraft it wasn't the same version as this so here's a picture of that um golf jet that's the a land speeder so it is yeah but it can go over water it can go over sand dunes things like that so so the virtue of this of course is that the golf cart obviously can only do so much can't go over water can't go over sand really well cuz it just goes up and then goes and it starts falling down even like water water the only cool thing about the golf cart is that you can reenact the scene from Navy Seals where they're playing Polo in the golf carts really drunk oh yeah remember that remember that golf cart jetpack gives new meaning to a birdie y it's well",
      "start": 379.28
    },
    {
      "text": "you can reenact the scene from Navy Seals where they're playing Polo in the golf carts really drunk oh yeah remember that remember that golf cart jetpack gives new meaning to a birdie y it's well done it's well done um I have to imagine that you know Oakley is just kind of like throwing some money toward this cuz it's a fun sort of R&D project that they probably won't ever realize but I don't know maybe I mean maybe they're going to try to go to Consumer with with this it doesn't it's like every other technology it gets smaller simpler I think so yeah but I mean I'm pretty impressed by small and simple looking it is have you actually ever heard a jetpack like seeing anyone land on a jetpack no so I think it was five or six years ago real yeah there they're real things they're loud as **** they're so **** loud Kevin wanted it muted remember and now he's getting now wor just at least we got a 3 second I think it was like maybe it was like six seven years ago at E3 I think I went to",
      "start": 423.28
    },
    {
      "text": "they're so **** loud Kevin wanted it muted remember and now he's getting now wor just at least we got a 3 second I think it was like maybe it was like six seven years ago at E3 I think I went to an event where they had someone land Like a Storm Trooper land a jetpack and it was so **** loud that like you couldn't hear anything it was ridiculous what's going he's now this guy's jetp packing by the Statue of Liberty M but like that's a jetpack it's a little nice Sho **** Jets of H so it yeah so is it fire so what's the water jetpack that shoots water you know I understand that but is that a jetpack by definition Ian water jets maybe right I'm not I'm not no's I mean it's kind of terrifying to see this jet pack man fly past has no one dressed as Boba Fett yet and done one of these oh no that's all I every water one I see I swear one out of every three of them they're in a I was thinking those little personal pods they used the cobras used to have yeah of course from the GI Joe movie",
      "start": 467.56
    },
    {
      "text": "that's all I every water one I see I swear one out of every three of them they're in a I was thinking those little personal pods they used the cobras used to have yeah of course from the GI Joe movie yeah that reminds me of the GI Joe movie opening jet packing upou the water ones are great cuz there was this video we were watching recently of this this guy a newscaster when things are on the news you know it's about to be bad he's like we're here and we're talking about the new water jetpacks come see what it's all about next he takes off and it goes right into the water it's just like so good why do they air this **** when this embarrassing **** has the classic the classic footage of the woman stomping grapes and Falls it's like why is this on TV it's too late they do all live was like pre pre pre YouTube too that one was making the rounds oh my God God it's good like e bomb's world so what do we think the future of jetpacks are Nick I think I mean I'm not I'm usually a late",
      "start": 522.08
    },
    {
      "text": "like pre pre pre YouTube too that one was making the rounds oh my God God it's good like e bomb's world so what do we think the future of jetpacks are Nick I think I mean I'm not I'm usually a late adopter and I think I probably would be for this as well yeah I don't think I'd get the first one off the production line by any stretch of the imagination but for City living if you could land like land on the top of buildings sure that'd be pretty cool I mean it would definitely solve look at your parking would be the entire city looking at the wet the wet CH guy that's awesome that's awesome God bless people that are like that's awesome I got to get that on the internet ASAP yeah I know the people who are just watching their local news and they're just like ready to capture anything or put it up or record it get it out love it oh my God it jet dog the local new news local news is kind of an absurd thing is it sucks I hate kind of weird where they try to make this like local",
      "start": 570.56
    },
    {
      "text": "or put it up or record it get it out love it oh my God it jet dog the local new news local news is kind of an absurd thing is it sucks I hate kind of weird where they try to make this like local like of culture we Kevin and I were driving the other day and they were talk they were introducing the new local newscaster for Kon or Kon or whatever the hell cron 4 they're like he's a San Francisco native he grew up here and then they cut to a sound bite of him he's like I grew up right there and then it cuts back and it's like I'm like this is what what is the point of this are we trying so you know him so you feel like a local one of your boys's maid and he knows the city he's going to report on who the **** is watching the local news like someone is cuz I watch the local news every once a while when it's just on and I'm like inevitably in the next 10 minutes I'm going to laugh at some point like because it's so it's so bad like I don't give a **** about anything you're saying nothing",
      "start": 623.2
    },
    {
      "text": "when it's just on and I'm like inevitably in the next 10 minutes I'm going to laugh at some point like because it's so it's so bad like I don't give a **** about anything you're saying nothing that you're saying is relevant to me big ke dog's got to drop in big ke dog so I recently lost CNN like I no longer have CNN the channel okay so this morning I was watching local news and it's sucks but it was why don't you watch in the morning why don't you watch MSNBC is pretty good in the morning Morning Joe what channel is that I don't I don't have any of7 I don't have any of those how do you not have umn isn't that a basic C I switched plans cuz like it was way cheaper and I now have like double the speed but I lose like the higher end it doesn't matter but I that commercial was on and he was pointing at his house from his like childhood I'm like we believe you and we don't care we don't care if you grew up here or not can't substantiate this anyway yeah it's but it's not it's not in any",
      "start": 662.88
    },
    {
      "text": "pointing at his house from his like childhood I'm like we believe you and we don't care we don't care if you grew up here or not can't substantiate this anyway yeah it's but it's not it's not in any way shave or form relevant at all that you are a local that you grew up here really it's a local Boy made good you understand like you know it's a Cutthroat World being a TV reporter you get you you start in the smaller markets so to get to a market like San Francisco get to be an anchor on it I don't know exactly who you're talking about it's this there's a lot of steps let alone to come back to where you're from a lot of people are transplants they go there and they just start reporting on wherever they get they get the job M would it surprise you to know that I used to watch The Weather Channel for fun not even a little in the late '80s and early 90s really enjoyed The Weather Channel a lot talk a lot about geography see and I don't my question for the local news do that I guess you're",
      "start": 707.08
    },
    {
      "text": "for fun not even a little in the late '80s and early 90s really enjoyed The Weather Channel a lot talk a lot about geography see and I don't my question for the local news do that I guess you're talking about San Francisco like I grew up watching the local news in Chicago Fox 32 Walter Jacobson Robin Robinson that's because you're you Mary mer mercio in the morning **** yeah invested interest for me I could never understand that cuz yeah you watch this **** and you're like who is the audience for this and I remember it's it's all these people just want to feel good about talking about something so they're like I'm going to report on a story this is what's going to get me to a real story cuz and when I went to college at SF State for video production stuff I was one of the few people there that's not trying to be a news anchor which is kind of ironic for what I ended up doing uh not that this is news you were delivering news right now I'm the one I'm on camera doing this type of",
      "start": 746.16
    },
    {
      "text": "there that's not trying to be a news anchor which is kind of ironic for what I ended up doing uh not that this is news you were delivering news right now I'm the one I'm on camera doing this type of stuff all those other **** there's maybe like two of them that made it and they're covering news in like weird like Marin County like cities that I've never even heard of and like they're calling it San Francisco local news and it's like that's not not at all and so I'm like they can't even point at their house and say I grew up there they have to stand there and be like I grew up uh oh my God and every time they post stuff on Facebook I'm just looking at this **** and I'm just like this is what you're doing with your life you're standing out there talking about how this local bicycle shop is going to help people that's not bad though I mean like don't get me wrong there sound like breaking news but there's people who care about that and want to know about the local business more",
      "start": 783.36
    },
    {
      "text": "shop is going to help people that's not bad though I mean like don't get me wrong there sound like breaking news but there's people who care about that and want to know about the local business more entertainment though would wouldn't you say sure but it's window into your local community sure I mean that's true my my wife reads the uh the I guess it's the marina times or whatever it's some sort of like local paper that's just about our neighborhood and she loves reading it because it actually you onto like what shops are closing what shops are coming in and you know spoilers yoga closed this yoga shop opened yeah exactly but most of the only shops I can actually afford to be her like it's like Nike and like you know sure the big the big conglomerates but um I get that but I just think it's like that's that whole thing is just such a relic of a bygone era right where they they like like they all dress in the suits and they have the makeup on and then when it's more of a casual thing",
      "start": 826.0
    },
    {
      "text": "like that's that whole thing is just such a relic of a bygone era right where they they like like they all dress in the suits and they have the makeup on and then when it's more of a casual thing they just take the blazer off and maybe roll up the sleeves sure still have the tie though because you still have to have an air of professionalism right and they talk in that voice tell me about this thing that you're talking to me about that sounds great back to you Jan and then there's always the **** 3 second delay yeah I hate that **** that shit's awkward as hell but I'll tell you what man you get attached to these people especially in your local market and then when you get to CM National my boy Lester Holt you talk Chicago's own Lester Holt who talked to Dad down on the crane site oh that was a big day let me if I'm lying I'm ding say the person who has probably big Greg Miller comes 80 times the social following you were probably 80 times more Prof like more more popular than but",
      "start": 867.48
    },
    {
      "text": "was a big day let me if I'm lying I'm ding say the person who has probably big Greg Miller comes 80 times the social following you were probably 80 times more Prof like more more popular than but it's not a popularity thing you trusted Le Lester Holt and he had he had this bombass mustache he would have loved it forever get a good must then he shaved it though he he had like the V he shaved it when he went he went National with MSNBC Lester Hall yeah Lester Hall was was the dude I will tell you two things number one we have a Weatherman in New York who goes by the name only of Mr. G that's awesome and you can look up so it's like it's like Kevin you know Kevin O'Neal blah blah blah and Mr. G with the weather and he's like I'm like who the **** is this guy I've been asking that question for 5 years uh on Long Island we have a thing called news12 Channel 12 is just this channel you B Channel Long Island where it's just it's just 24 hours Long Island news it's local news for 24",
      "start": 909.44
    },
    {
      "text": "for 5 years uh on Long Island we have a thing called news12 Channel 12 is just this channel you B Channel Long Island where it's just it's just 24 hours Long Island news it's local news for 24 hours a day and if you want to just lose your mind just tune in CU my dad doesn't have cable anymore he only gets like you know like NBC and ABC and he gets news 12 and I just sat there and watched it for like 15 minutes I'm like I can't believe I can't that this channel still exists and they just are like over in saset uh geese are flying from Canada to the P I'm like and then like 20 minutes later they're on the same story I'm this is **** this is awful this is the worst thing I've ever seen in my goddamn life the only reason news 12 was relevant for one reason school closures exactly you go to the **** news 12 and you got the little school closure kind of that was the best like that was the best lottery in the world to wake up and it's been snowing out and you go to your you go to Fox thing in",
      "start": 949.56
    },
    {
      "text": "**** news 12 and you got the little school closure kind of that was the best like that was the best lottery in the world to wake up and it's been snowing out and you go to your you go to Fox thing in the morning you look at the little ticker and you're just waiting just waiting just waiting we don't we don't get that **** out here nope the only the only time school was closed was like was 911 and that you didn't need local **** for that was clear you know dude the worst thing is you I guess you guys can't relate the worst thing was it would be like you know I was in South Country School District so it was it was so it would be like you get to there to the end it would be like you know this school uh closed this school closed this school closed like South Country School District 2 hour delay this school closed this school like **** it was it was like the worst thing you were like you were like waiting it was that was that's so funny that that that feeling I remember it was a big",
      "start": 994.6
    },
    {
      "text": "delay this school closed this school like **** it was it was like the worst thing you were like you were like waiting it was that was that's so funny that that that feeling I remember it was a big deal when when our school finally got big enough to make it on there because you know we were private schools forever so a lot of times they didn't even **** know we had the we had phone trees that was another big way I remember the preemptive phone tree once we were at basketball practice and we heard rumors that the phone tree had started because what the **** the phone tree you like one person or two people like five people start calling five people call five people call five people to let them your family's like when my family gets called by by Mom why or whatever we then call three other families to inform them that way and spread it that way that's how you to do back okay but there was one one basketball practice where they were like it's going to be too cold tomorrow they're",
      "start": 1027.36
    },
    {
      "text": "other families to inform them that way and spread it that way that's how you to do back okay but there was one one basketball practice where they were like it's going to be too cold tomorrow they're they're closing school and we're like what and then you went home and the phone tree started you're like yes this is awesome oh that was that brings back such a nostalgic feelings for me like sometimes you wouldn't go to school for days at a time or a week at a time because it was getting hammered with snow especially when I lived in New England and it was even in the only thing that was different was Northeastern they never cancel classes because we had underground tunnel system that they strategically built so you can so you can never you never have to like leave like you know as long as you were on one side of the campus you get all the classroom buildings and stuff like that I was like you **** everyone else had everyone else had wasn't you know everyone else was like oh no because",
      "start": 1060.28
    },
    {
      "text": "were on one side of the campus you get all the classroom buildings and stuff like that I was like you **** everyone else had everyone else had wasn't you know everyone else was like oh no because we get hammered in snow up there also their expectation of snow a little different up there as well as you guys learned at P rid a lot of pride a lot of pride in a cold environment of Chicago of Boston like we're going to get through this it's not that cold dad's out there shoveling six feet of snow on this acre long driveway do you want to use a snowblower no it's not that bad all right you're going to die out there Dad yeah it's negative 10 your dick shrivels up into a little egg corn trying to walk just to the car it's terrible heat it up hopefully yeah sit there heat it up for 15 30 minutes can't start that thing that was always the four tourist that why we live in these places made fun of he made a reference to it cuz it was the Chicago days he'd come to my house to carpol in a school",
      "start": 1090.88
    },
    {
      "text": "can't start that thing that was always the four tourist that why we live in these places made fun of he made a reference to it cuz it was the Chicago days he'd come to my house to carpool in a school or whatever we'd get in there and I always made a joke that it was like Apollo 13 where I didn't have enough amps but I could if I turned on things in the right order it would be okay so you get in there you turn the car on you then could turn on the heater to get it going or no I'm sorry you could turn the car on you could turn on the radio and then you could turn on the heater if you turn on the car and you went the heater and then you want the radio just killed the car you sat there you just sat there let this **** thing heat up while you're doing this you're doing a lot of this maybe making out with pus wait minute this makes no sense to me but the way he just explained it I didn't realize you were talking about heating up the car I thought you still talking about your Acorn dick oh",
      "start": 1127.8
    },
    {
      "text": "out with pus wait minute this makes no sense to me but the way he just explained it I didn't realize you were talking about heating up the car I thought you still talking about your Acorn dick oh no Acorn dick your Acorn Dick's gone you got to you got to get to the car to heat it up and like huh like was thinking about the dick like he's just like I got to get that about the dick let's be honest if your dick is properly heated chances are the rest of your body is properly hden right that no situation you can think of where your dick is hot and the rest of you is ice cold so honestly if you worry about the tip of your dick you're probably you're probably thinking the right way it's like it's like in Batman Begins when he says don't worry about your arms worry about your dick rest your body go I don't have to save you you're still kind of **** bur this isn't very nostalgic reminds me my dad had he still has it this this Vermont wood stove these these iron stoves that you like get",
      "start": 1160.28
    },
    {
      "text": "body go I don't have to save you you're still kind of **** bur this isn't very nostalgic reminds me my dad had he still has it this this Vermont wood stove these these iron stoves that you like get hand casted they're really expensive you have drive to like Burlington and bring them down you have to have like 17 people put in the back of your **** truck and he would use you get buy a bunch of wood cords of wood and like use that instead of like my dad like wouldn't use the heat it was a we used to tell the story in a minute the the uh cuz we had we had a thermostat which just like you there was a strategy about using it so your dad my dad would never know um until he got the oil bill but you would risk it anyway it didn't matter but he would heat he put this thing in and it was in the center of the house so like it would go it would proliferate around the house pretty nicely but if you were in the living room it is so **** hot in there I was like you'd sit there watch TV you're",
      "start": 1199.16
    },
    {
      "text": "center of the house so like it would go it would proliferate around the house pretty nicely but if you were in the living room it is so **** hot in there I was like you'd sit there watch TV you're like sweating you're like you're underwear but you look outside it's like Z degrees out but uh my dad we used to have this like **** scheme going on me and my sister and then me later when I was when I was uh when I was by myself after she went to college where my dad uh never like hated using the heat you could never put the heat above 6 or something like that and it was like a little thing you turned or whatever and so we would do it and put it on like 70 or 75 and then what you would hear the garage door open we come home and you'd run downstairs but if you had your music on or like you weren't at home or you forgot oh dude it was over and he would walk in as a Family Guy kids kids around about you'd come in and you be like the but like go right to the thermostat and be like on 6 or",
      "start": 1236.32
    },
    {
      "text": "at home or you forgot oh dude it was over and he would walk in as a Family Guy kids kids around about you'd come in and you be like the but like go right to the thermostat and be like on 6 or whatever he'd be like it's definitely like 70° in here right now I don't know what you're talking about just I don't know what you're talking about we did the same we did the same thing growing up in SoCal uh but with air conditioning and air conditioning was really expensive cuz my parents had uh we had a two-story house and the air conditioner two-story house like machine like the outside thing it would it would pipe in air um and it wasn't until recently that my parents got a smart air air like air conditioner that had two different zones so you could if you're upstairs predominantly you could it would shut off the downstairs one and vice versa but my brother and I would literally my mom was always the worst cuz she would swear to God that it's freezing in the house and it is I mean it's like",
      "start": 1273.24
    },
    {
      "text": "would shut off the downstairs one and vice versa but my brother and I would literally my mom was always the worst cuz she would swear to God that it's freezing in the house and it is I mean it's like 95° and she is like it's co it's cold and I'm like you don't even believe that you're **** lying to me right now so my brother and I would always when they'd go out of town we would do we would just **** it would be a **** ice box in that place like you could see your breath in front of you and then we would go outside party and just leave it on and my mom would come back and like a $700 Bill we're like we don't know what happened don't to family can't prove it was us uh yeah the snow days I don't know about but the smog smog alerts we used to have a lot so we'd have we'd have know SM aler growing up in southern CN smog is we'd have smog alerts cuz the smog would be uh would be too thick and so you wouldn't be allowed to go outside and really mhm you would have to just sit you have",
      "start": 1313.92
    },
    {
      "text": "growing up in southern CN smog is we'd have smog alerts cuz the smog would be uh would be too thick and so you wouldn't be allowed to go outside and really mhm you would have to just sit you have to sit you weren't allowed like run around because apparently it was supposed to be bad for your lungs that's where I grew up but you would see it I mean you'd like you'd look outside and try to take bets on whether or not they were going to no one **** cared we all did it anyway but uh well not me cuz I was fat but the people who actually likes physical exer go there and do it I like dope whatever this doesn't change my plans one way or the other to just stay inside what I was going to do I'm like is this going to rot the twinkie in my hand then **** it all right uh but yeah but but that's that's interesting but I would still gladly I still just for the life of me don't understand why people willingly choose to live in the snow it doesn't make any sense it's God's way of telling you",
      "start": 1351.52
    },
    {
      "text": "that's interesting but I would still gladly I still just for the life of me don't understand why people willingly choose to live in the snow it doesn't make any sense it's God's way of telling you don't live here stra up stay away from here that's true people in Phoenix like what the hell's wrong with you what are you doing oh that's I know it's dumb if we should all be living probably in a much more habitable envir San Francisco probably San Francisco does have the most like that's the weather this is what you're going to get don't worry about it it's not going to fluctuate too much off yeah I mean for I'm trying to think if there was any was there anything that schools would stop for earthquake day no earthquakes would happen reron day and we're just kind of here do you remember like the earthquake drills where it's like and you're like all right go to the desk they had to teach us like you know everyone has fire drills they would do earthquake drills like once a month where",
      "start": 1388.92
    },
    {
      "text": "like the earthquake drills where it's like and you're like all right go to the desk they had to teach us like you know everyone has fire drills they would do earthquake drills like once a month where everyone had to get under a desk or in between the the door things was so disruptive we tornado drills yeah go out of your classroom get in front of your locker and then get down in a ball and cover your head cuz kiss your ass goodbye it's **** over a tornado roll you have to um do you have to like lasso yourself to a pipe no that's what I always thought I thought there was so many you know easier ways to do that safety latch you guys just like latch on like they do when you're out of space you know I mean yeah um by the way all that's **** you know that right like oh absolutely they were like go they don't I don't think they even teach kids to do that anymore the doorway thing is like this table you think this is going to **** save us from earthquake I guarantee you the **** at",
      "start": 1425.28
    },
    {
      "text": "like go they don't I don't think they even teach kids to do that anymore the doorway thing is like this table you think this is going to **** save us from earthquake I guarantee you the **** at Sutro Elementary School ain't helping anybody those little pieces of flimsy ass plastic get out of here yeah right just make it feel better it's like the our parents used to tell the story about the nuclear drills where it's like get on your like are you **** nuts it's a it's a goddamn Sun exploding outside I think we're dead do a matter of for hiding underne asking by supposedly uh and this could be old as well cuz I think I heard about five six years ago but supposedly the best thing to do is to get near near something that's strong for what what are we talking about now earthquakes thank you so that when because I guess they I guess they looked at a bunch of buildings that had collapsed and they noticed triangles constantly so like when the rooftop collapses it it hits and then",
      "start": 1468.56
    },
    {
      "text": "thank you so that when because I guess they I guess they looked at a bunch of buildings that had collapsed and they noticed triangles constantly so like when the rooftop collapses it it hits and then it'll it'll get stuck on something that's strong and it'll make a triangle and if you're right here if you're in the middle of it you can actually survive so they say get close to your bed because a mattress can actually take a fair load of weight and still Teeter I mean you're still stuck **** in the small area which you're going to live but they but don't get near your **** like you're just going to get Jam finger if you go into your door yeah the tornadoes if you're at home and it's **** bearing down on you the deal is you're supposed to grab the mattress and go lay in the bathtub really yeah that's hilarious the mattress a king size use the mattress to cover yeah well that's smart though because then you're not getting hit by glass there's only one where my mom's like ah go get",
      "start": 1505.6
    },
    {
      "text": "yeah that's hilarious the mattress a king size use the mattress to cover yeah well that's smart though because then you're not getting hit by glass there's only one where my mom's like ah go get in the bathtub this might be the one I like ah God damn it walk over there get in the back oh yeah but dude tornadoes ter cups and you and you dumped your your draw for action figures into the bath I remember when we were uh like it was like you know I was talking to you earlier on one of the shows about like when we my parents like obsessed with going out to the country for whatever and there's always a tornado there's always some severe weather whatever it all comes during the summer so we would do that thing where like you know I I did a day camp or whatever right where you know arts and crafts and you go to the pool every day it was mainly like a supervised thing to the pool every day but like they all go to this water park all right cool you go and I remember this **** tornado warning",
      "start": 1539.48
    },
    {
      "text": "and you go to the pool every day it was mainly like a supervised thing to the pool every day but like they all go to this water park all right cool you go and I remember this **** tornado warning comes in it's like in the BBS of glennellen you know I'm growing up here the BBS of Chicago in Glenn Ellen unincorporated unincorporated glennen but I would be downtown glennen for the day camp right when the tornado siren goes off it's like cool it's too populated a tornado's not going to roll through here like I'm not I'm we're going to be okay it's just going to be really bad weather really bad thunderstorm hail whatever you know what I mean but when you're out in like hey we built a water park in the middle of **** nowhere that's a real tornado situation that's a real thing that's going to get you and I remember having it if that one with the Sirens go off and like the adults really freaking out of like getting you into the locker room and having you **** go into the little ball in",
      "start": 1574.0
    },
    {
      "text": "get you and I remember having it if that one with the Sirens go off and like the adults really freaking out of like getting you into the locker room and having you **** go into the little ball in front of these lockers kids just **** SOB God every going to die yeah that sounds scary as all **** then it doesn't happen you get on a bus and go back you're like war vets like You' seen so much **** out there I would think that I would just sit in the water and then let the thing suck the water away from me and I'm just bone dry I did you ever were you ever in an earthquake like a real earthquake not one little tiny ones no I don't remember there ever being one that big I'm sure there was but when you grow up in Southern California it just doesn't you just feel earthquakes all the time they're just like the little tidy things it's like all right earthquake right I mean I was here obviously for the '89 earthquake which was crazy but I was a baby so I don't remember my mom acts like",
      "start": 1607.72
    },
    {
      "text": "they're just like the little tidy things it's like all right earthquake right I mean I was here obviously for the '89 earthquake which was crazy but I was a baby so I don't remember my mom acts like it was the scariest thing of all **** time pretty big but uh your house like when when you moved out still had the cracks on it yeah my house was like devastated by that **** um but growing up I I experienced the little ones forever but then when I was like 14 maybe there was a a fairly big one and I'll never forget I was in my garage and all of a sudden like it was me and my brother we just like playing with our **** skateboards or whatever and I just hear noise I'm like that sounds like giant Domino's falling he's like yeah it does it's really weird and all of a sudden the giant the noise hit us and everything was shaking like holy **** like this is like a **** scary movie like we're going to **** die right now that's freaky it was it was really really scary we ran into the",
      "start": 1646.16
    },
    {
      "text": "hit us and everything was shaking like holy **** like this is like a **** scary movie like we're going to **** die right now that's freaky it was it was really really scary we ran into the middle of the street that's cuz that felt safest y I agree with that people are always like oh no you want to get because of the power lines you got's a lot power lines around the I'm I'm running into the backyard that's fine but the the the uh first time I felt an earthquake was like a 5.1 or something when I first moved here in 2000 so not a big one I me it's you feel it was but I never felt an earthquake before and and uh I was in I was I lived in Daily City and I was like in my underwear in my bed like playing a game or I don't know what I was doing and I like ran up and out into the street like my underwear and then I real like without even thinking like I gotta get out of this house and then yeah I'm like just no one's around it was like you know lived in the hills of earthquakes are",
      "start": 1687.28
    },
    {
      "text": "like my underwear and then I real like without even thinking like I gotta get out of this house and then yeah I'm like just no one's around it was like you know lived in the hills of earthquakes are creepy I sometimes I think I've said this before I wonder sometimes I just sit know tranquil moments in time and I'm like it could happen right now oh anytime like just right now warning there's nothing you can do about it it's going to happen it is going to happen the city is going to fall into the **** Pacific Ocean one day that was that was the the scary weird thing you know they do talk about like trying to make the kids feel safe they also terrify the goddamn kids like you that sounds like a traumatic experience right and I get that that's trying to protect you or whatever so that's cool but so I went to middle school in the marina M and oh that's a bad spot all the time they're like if an earthquake happens we're gone it's good we're just gone we're going to sink into the ocean and",
      "start": 1722.56
    },
    {
      "text": "but so I went to middle school in the marina M and oh that's a bad spot all the time they're like if an earthquake happens we're gone it's good we're just gone we're going to sink into the ocean and we're all going to be gone and it's like don't tell me that just let it happen the marina the marina is supposed to be legit awful for an earthquake though because it's because of the sand the liquification of the sand there and stuff like that yeah and it's built on top of the rubel the 1906 earthquake which was a bad earthquake but so I I I've heard the same thing that like the Marine has finished if there's like a really bad earthquake yeah I'm like good because I'm there all the time now so my technically I think you're you're in cow Hollow really because I think anything I think anything North or South rather of Lombard is collow okay the marina starts at Lombard and goes I think that's all Technically she's gonna break off at Lombard and Flo away I I think we're all on Bedrock but I",
      "start": 1763.16
    },
    {
      "text": "North or South rather of Lombard is collow okay the marina starts at Lombard and goes I think that's all Technically she's gonna break off at Lombard and Flo away I I think we're all on Bedrock but I could be wrong don't don't don't quote that would be great yeah because that that's been as long I mean when we used to go to the comic club and stuff people used to talk about the marina yeah that's but still I mean I don't know I don't really have any but they do say Kev you probably know about this I don't know that that the the there's two kinds of or there's multiple kinds of earthquakes but they were saying that the there's only there's a there's only an upper limit that they think that an earthquake in San Francisco could have in like the sevens they were saying like it can't get much worse than that but there were because of the because it's either like the the sub subduction I don't know what I don't know the terminology the one earthquake where one goes on top of the other and",
      "start": 1799.48
    },
    {
      "text": "worse than that but there were because of the because it's either like the the sub subduction I don't know what I don't know the terminology the one earthquake where one goes on top of the other and the other where they slip like they get stuck and they slip whatever one is like weakest or like they can predict is the one that's up here and they were saying in Southern California that's where everything's going to get **** up they were like I was I was reading about that recently because there's a lot of interesting stuff about well two things one in Washington and Seattle they say they're **** up there because there's a massive remember this story made the round was like it was in the New Yorker or something like that a long time ago they were like no one's paying attention that there's like terrible **** going on in the Northwest and that's like where there's going to be like an awful earthquake and they were saying it was along some some Corridor I heard San Andreas' fault",
      "start": 1831.84
    },
    {
      "text": "like terrible **** going on in the Northwest and that's like where there's going to be like an awful earthquake and they were saying it was along some some Corridor I heard San Andreas' fault they were saying like everything East or no everything west of this quarter of this highway they're like it's **** like and they and they and it was a fascinating thing where they were saying they traced this major earthquake that happened there like a thousand years ago to this huge tsunami that happened in Japan and like and they were talking about the investigators that figured out that it was the earthquake there that caused this massive tsunami and then they did all this like back this calculation about how bad it was and like how the Earth like dropped and **** like that like at that point um and the second one is in I think it's in Yellowstone right uh or there's one in Southern Illinois that's really bad too they're saying there's a mega volcano in one of the national parks and",
      "start": 1861.88
    },
    {
      "text": "point um and the second one is in I think it's in Yellowstone right uh or there's one in Southern Illinois that's really bad too they're saying there's a mega volcano in one of the national parks and they're like if this bad boy goes off the **** a mega volcano basically all of Yellowstone is a big ass volcano and they like they were just saying it seems like it's okay right now but if this like goes off like it's probably going to cause like it's the United States is the least it's be like a nuclear winner yeah you know so seen few trigger points here the uh the devastation of Mount St. Helen like that is insane the do the I saw a documentary on on you see it with your eyes it's **** nuts man it's like it looks like a nuclear bomb went off it's crazy yeah I saw Nova about how uh Nova will be one of my favorite shows fantastic show about how the the plant life and the animal life started slowly coming back the last years and they were like what they sent back cuz you're still not",
      "start": 1894.36
    },
    {
      "text": "will be one of my favorite shows fantastic show about how the the plant life and the animal life started slowly coming back the last years and they were like what they sent back cuz you're still not allowed to go like there whatever unless you're like an inves or scientist or whatever and they going in there finding like plants kind of making the comeback and and all that kind of sh because Mount St. Helen went off **** nuts I think it was 1980 so jetpacks oh yeah jet packs so I want one mine would be carbon fiber like a black carbon fiber that'd be dope and I call it the Super Dragon how long was that topic Kev big Kev dog should we make it minutes minutes okay great okay",
      "start": 1936.88
    }
  ]
}
