{
    "id": 1975,
    "video_id": "kB_FM4qztZw",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "We Predict How Will Game of Thrones End - The GameOvergreggy Show Ep. 140 (Pt. 4)",
    "description": "SPOILERS! We discuss how we think Game of Thrones will end.\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1470898800,
    "duration": 1495,
    "transcript_chunks": [
        {
            "text": "Anyways Tim, yes to number four is all yours. So here's the deal. Uh, we fell in love with you over Game of Thrones content where I, I fell in love with over the comic book stuff. Well, you take it to a whole other level of really kind of explaining all the **** that we don't understand because you are an, not only the TV show but also the books and the differences and the characters and the history of the characters that you wouldn't even know exists if you just watch the show. So my question to you, I want you to kind of predict the future here. How is Game of Thrones going to end? Like let's go through the characters and where do you think everything's going to end up in the TV show universe and then if you think it's going to end differently in the books, you know, let's, let's go from there. This might get spoilery so just be a th%, it's going to get spoilered if you're not up to date right now, right? Okay, cool. Yeah, yeah. All right, so what do we want to start with? Who's with who? Tyrion is",
            "start": 2.85
        },
        {
            "text": "this might get spoilery so just be a th%, it's going to get spoilered if you're not up to date right now, right? Okay, cool. Yeah, yeah. All right, so what do we want to start with? Who's with who? Tyrion is going to be king. I think that's, I think that's a possibility because as we know Daenerys, she's amazing conqueror but she's not a great ruler and that's how I am. Like I love conquering but I hate the mundane realities that actually R Kingdom like the man, what does that mean? What do that mean life 19 and so I don't know. I think that he would be a great fit to be the king although I don't know. I mean that's definitely, I feel like the show is, is writing kind of for fanfiction of what people want to see so I feel like Tyrion, I'm going to give him like a 60% probability of like ending up on the Iron Throne. Okay, uh, I mean as we have, okay so Jon Snow's like the only eligible bachelor in the entire of Westeros so I mean I'm pretty sure that Daenerys and him are going to hang out half Targaryen",
            "start": 55.84
        },
        {
            "text": "Iron Throne. Okay, uh, I mean as we have, okay so Jon Snow's like the only eligible bachelor in the entire of Westeros so I mean I'm pretty sure that Daenerys and him are going to hang out half Targaryen although she can't have babies so I, I mean that doesn't mean they're going to have a dynasty or anything like that cuz she's barren so like they couldn't be, they couldn't carry on their line you know if they were king and queen like so that wouldn't work. So it would make more Ser like sense for Tyrion and maybe somebody else, maybe Sansa, maybe they get back together. May we're waiting for. Maybe Sansa's like, you know what, you weren't so bad, you know, see How the Other Half Lives. No, I'll **** you, you were all right actually, uh comparatively to everybody else. Um, um, but I think that you know we might see, um, I mean we might see Bran warg into a dragon, you know, I feel like that holy **** that could be a thing, like that could be a thing. I think we're going to have the Clegane Bowl eventually we're",
            "start": 107.84
        },
        {
            "text": "see, um, I mean we might see Bran warg into a dragon, you know, I feel like that holy **** that could be a thing, like that could be a thing. I think we're going to have the Clegane Bowl eventually we're going to have to see Sandor and the Mountain, zombie Mountain like fight it out. Jamie is definitely going to kill Cersei. Uh, he's going to choke her out because she's like the big bad for next season so I mean let's, let's take this season by season then. So right now season six just ended. We know we have two more left. We know that they're going to be shorten seasons so what does that mean? So season, season 7 is going to be seven episodes and I think season 8 is going to be eight episodes. That's not confirmed. I think the seven part Seas final two seasons of the show so one of those Seasons work. I think season s was confirmed for seven. Season seven is confirmed for seven. Season 8 is not confirmed but the rumor is they had said that there's going to be 15 left. I heard 13 to 15 it could be",
            "start": 151.16
        },
        {
            "text": "I think season s was confirmed for seven. Season seven is confirmed for seven. Season 8 is not confirmed but the rumor is they had said that there's going to be 15 left. I heard 13 to 15 it could be somewhere in there so with the two seasons left okay what do you think we're going to go from here season six what happens in season six okay well in season six Cersei is the big bad because they've been doing a big bad every season so last season it was Ramsey Bolton this season it's going to be uh Cersei of course and I feel like this is we'll probably in this season see Jamie kill Cersei at some point uh and then the season after that we're going to have the Night King I assume is going to be the deal um so next season will probably be all about dispatching Cersei her whole story what the deal is uh and Daenerys obviously she's coming over so I mean you know Tyrion will be coming back as well so we're going to have like them taking over King's Landing I one thing that I think might",
            "start": 191.56
        },
        {
            "text": "deal is uh and Daenerys obviously she's coming over so I mean you know Tyrion will be coming back as well so we're going to have like them taking over King's Landing I one thing that I think might happen is okay so we saw at the end of last season she blew up the de se of Baylor right well if you remember Jamie the king Slayer he killed M King Aries jer's father because he was going to blow up the entire city right so I feel like one thing that Cersei might do next season is if Daenerys comes to attack King's Landing and take King's Landing Landing she might try to blow up the city like Mad King Aris and that will probably prompt Jamie j to kill her cuz he's going to have to be the queen SL and yeah P it's the pattern he's repeating that same pattern um well there's also there was that the um the projection or whatever that Cersei the the prophecy right where Cersei was going her kids were going to die and then her brother's going to kill her we all assumed it was Tyrion right but now",
            "start": 235.0
        },
        {
            "text": "um the projection or whatever that Cersei the the prophecy right where Cersei was going her kids were going to die and then her brother's going to kill her we all assumed it was Tyrion right but now this is like all right it's going to be Jamie it's got to be Jamie I mean like I mean it it could be Tyrion but I really feel I mean Jamie and her are the one that have like their whole beef going on and their whole relationship's been really weird in the show as compared to in the books like in the books Jamie's like over her I'll see you later whatever she's not queen of Westeros or anything yet in the books so if he's over her is he all about Brienne he's not about Brienne either unfortunately you know he's just kind of like I got to figure my **** out you know I think so but dude I want to see I want to see somebody get with Brienne I would love to see Jamie get with Brienne what about Tormund but I'm down for Tormund I like he's a hot dude like that act is really cute and I'm like J like what",
            "start": 283.92
        },
        {
            "text": "see I want to see somebody get with Brienne I would love to see Jamie get with Brienne what about Tormund but I'm down for Tormund I like he's a hot dude like that act is really cute and I'm like J like what are you doing Bri get it like why are you being scow to that's like the the uh the assistant toon yes no no no padrick is pleasure tried to jump on the train my arm got ripped off padrick is the Squire to Brienne though and he's the guy who did so who do you want to **** Brienne uh Tormund but like I mean she oh thank you the Capital One guy thanks why don't you just use words I know yeah I want to see that I want to see that I don't okay so now hold on a second did you know that Jamie only has one hand yeah okay God damn it CG Greg so just so you know we love Game of Thrones Greg somehow missed the train no was on the train and then jumped off yeah this season get no no no what what I in the very same way I'm not very I'm not a big space guy I'm not a very big fanty old school hey we got",
            "start": 326.52
        },
        {
            "text": "the train no was on the train and then jumped off yeah this season get no no no what what I in the very same way I'm not very I'm not a big space guy I'm not a very big fanty old school hey we got fires and sticks and **** you know what I mean like Skyrim was weird I got into Skyrim but that was like thing and so I had a girlfriend for a long time who was like oh I like Game of Thrones let's watch Game of Thrones like I'll watch along and this these are the conversations we had oh my God can you believe that and I'm like who is that oh the guy from The Station Agent oh thank you very much that helps me out oh the Capital One guy all right great now I know what's going on and so then we broke up and then we get to this season I'm just like I'm not motivated to watch this not because I was forced but because it was her show in the same way I forced her to watch Flash right and so here we are where I was just like I have no motivation and apparently this is the season where",
            "start": 377.88
        },
        {
            "text": "I was forced but because it was her show in the same way I forced her to watch Flash right and so here we are where I was just like I have no motivation and apparently this is the season where everything happened was great no no no no I wouldn't say that I feel like this season's very much fanfiction crazy season I mean it's like cuz they're off the books now so sure well the book sucked obviously George Railroad Martin over forever I'm asking you for your predictions of the future but let's go go back a bit what would what would you have done with season 6 then well I mean I feel like they just blew their load with this whole show like why do one one book per season like there's so much in all these books they're so dense you could really like once I understand the first season they don't know if the show's going to go or not they don't know if it's going to catch on I get it so they're trying to fit a whole lot in there right but once you see that this shit's like popping off why",
            "start": 419.16
        },
        {
            "text": "know if the show's going to go or not they don't know if it's going to catch on I get it so they're trying to fit a whole lot in there right but once you see that this shit's like popping off why aren't you like whoa and like have four seasons out of books like four and five but isn't that the whole I mean to jump in from the sidelines does doesn't that fall into the whole thing of like what we hate about TV where TV goes on too long and but there's enough to mind that you could like it's the thing like they have so much that they could work with and they were just like nope we're just going to go real fast it's kind of like I kind of feel like the that it works for their benefit because season five was the one that everyone had a lot of issues with because it was so slow and there was like nothing really happening until the end yeah well I mean they changed a lot of things too in season five and it's it's h it's just man Sansa stories killing me Sansa's killing me is Sansa killing",
            "start": 456.48
        },
        {
            "text": "like nothing really happening until the end yeah well I mean they changed a lot of things too in season five and it's it's h it's just man Sansa stories killing me Sansa's killing me is Sansa killing you guys yeah she is I mean what's funny about her is like so everyone was upset everyone was upset about her in uh season 5 and then now she's in season 6 everyone's all about her but it's like it to me it doesn't really seem earned like she just kind of all of a sudden this badass character that's like all schemy and **** she wee a black dress at the end and all of a sudden she goes from being the worst human being ever to I'm supposed to like you now but then she doesn't do anything with it then she just ends up getting like raped and tortured for a whole season and you're just like I thought that like I thought with Sansa like well maybe she'll play the father against the son and maybe she'll sew dissension within the house and that's how she'll like subtly no like it was just I'm",
            "start": 493.92
        },
        {
            "text": "that like I thought with Sansa like well maybe she'll play the father against the son and maybe she'll sew dissension within the house and that's how she'll like subtly no like it was just I'm going to jump off with Theon in the snow and we're going to run away and it was just like whatever and then like Littlefinger is weird and that whole thing and next like okay so I don't know this whole season where she's like I'm not going to tell John about the knights of the veil and you're like what and then at the end she's like could waited she's like sorry I didn't tell you John and he's like it's cool and it's like well so so that's the thing though is what was that whole staredown about right where the the King of the North King of the North whatever and then Sansa looks over at Littlefinger and Littlefinger does a little like I'm Littlefinger here's my eyebrows it's it's really confusing to me because people who are pro Sansa are like well that means that her and him or In Cahoots and",
            "start": 538.04
        },
        {
            "text": "and Littlefinger does a little like I'm Littlefinger here's my eyebrows it's it's really confusing to me because people who are pro Sansa are like well that means that her and him or In Cahoots and that they're going to maybe **** over John or kill JN and then take it or something like that but then the preceding thing that when we see them together she rebuffs his advances so I don't think they are in cahoots and I don't and Sansa's never done anything awesome so I don't think that she's going to do something awesome you know like I just don't see it so I don't know what her endgame is and like really honestly and I thought I think too it's like okay so she was married to Tyrion and then she got married to Ramsay and then she I mean you've been around a little bit like you've hung out with dudes like whatever and so when Littlefinger comes to her and is like hey like I'm telling you you can essentially manipulate me because I like you so much and she's like no whatever it's like",
            "start": 579.52
        },
        {
            "text": "with dudes like whatever and so when Littlefinger comes to her and is like hey like I'm telling you you can essentially manipulate me because I like you so much and she's like no whatever it's like no no no like manipulate that guy like what are you doing like say yes I'll kiss you and then she's really like I want to see her do something like sply fingers thing yeah like learn or something like learn learn the Game of Thrones though it's like that guy's the most manipulative guy and if she can manipulate the most manipulative guy in the Seven Kingdoms well then you've earned my respect yeah so what do you think his end game is then well I mean he obviously wants to sit on the Iron Throne I mean that's his whole deal I guess I don't I mean it's like why it's just seems like a lot of work BS and you know how much in debt the Seven Kingdoms is to the Iron Bank across the sea so like do you really want to be like responsible for all the debt that's owed like I don't know I think that",
            "start": 621.44
        },
        {
            "text": "BS and you know how much in debt the Seven Kingdoms is to the Iron Bank across the sea so like do you really want to be like responsible for all the debt that's owed like I don't know I think that being the king of Westeros wouldn't be an awesome deal right now but yeah he I mean he wants to do that I don't know he's now he's in control of the veil right so I mean he is a warden of I guess the East um so he's got that stuff going on with Robin or whatever I don't know I don't know where he's going he wants to take over everything he wants to use Sansa Sansa is an idiot we'll see you know like we'll see I know that he's going to probably cause problems for Daenerys you know cuz Varys and Littlefinger are kind of add odds they both have their own schemes you know where you have Littlefinger who really I believe does want the best for the Seven Kingdoms whereas Littlefinger wants them for himself like he wants them for ego reasons so you know Varys is backed Daenerys and so he's backed",
            "start": 661.68
        },
        {
            "text": "who really I believe does want the best for the Seven Kingdoms whereas Littlefinger wants them for himself like he wants them for ego reasons so you know Varys is backed Daenerys and so he's backed you know Sansa so maybe maybe Littlefinger will try to get Sansa to mess up something for jys when it comes to jys and JN like having an alliance or something but then again you also have at the same time they're all getting all the women characters together because there's this big like just like you ghostb we're going to do the four of the five Queens so we're going to have Yara and the sand snake lady who cares uh and then you have two Unix and dwarf and then Daenerys and then they're going to come over going to fight Cersei but then you have you know what's her face Sansa so Sansa going to join the chicks cuz she hates Cersei yeah you know so I could I don't know yeah I don't know and then Marjorie's gone it's so sad but we still got the grandma though yeah she's awesome she NOA is on",
            "start": 705.16
        },
        {
            "text": "join the chicks cuz she hates Cersei yeah you know so I could I don't know yeah I don't know and then Marjorie's gone it's so sad but we still got the grandma though yeah she's awesome she NOA is on team Da yeah well so with Daenerys I mean obviously that's been the storyline that everybody's been waiting for for so long is like when she actually going to come over we finally see her coming over what in season 7 that's about to come up what do you how do you see that playing out in terms of Daenerys their team storyline um I mean it's I mean it looks like they're setting sale for King's Landing straight up so I mean that's the thing is how are they going to play out this if my plan of Cersei blowing up the city like it could go two ways either Jamie strangles her or she does in fact blow up the city and maybe Jamie like strangles her later so maybe maybe she does like kind of have a successful trick again and like ends up killing some of her team you know who who knows I don't think",
            "start": 752.72
        },
        {
            "text": "up the city and maybe Jamie like strangles her later so maybe maybe she does like kind of have a successful trick again and like ends up killing some of her team you know who who knows I don't think that I mean Daenerys will probably flying around a dragon so she'll probably be cool you know I don't know if Wild I know fire cannot kill a dragon I'm not entirely sure about Wildfire but I assume they're good they're probably good yeah so then there's the um Yara the the other dude the what's you're on you're on right so he has boats he's coming he's doing sh he I mean he says he's building them but how long does that really take you know well I mean they had to introduce him for a reason right so what is what is that reason him he has that whole team are they going to intercept them getting K Landing well I mean that's the only thing I that that makes a lot of sense now that you're bringing him up I totally forgot about old stupid Euron I want to like blank him out of my memory um yeah",
            "start": 799.36
        },
        {
            "text": "K Landing well I mean that's the only thing I that that makes a lot of sense now that you're bringing him up I totally forgot about old stupid Euron I want to like blank him out of my memory um yeah he's he's going to have to hook up with Cy cuz he's a bad guy you know and so it's like all right I'll help you with my ships because you don't like her Armada got blown up in uh the Blackwater yeah Blackwater Bay situation so um so yeah she's definitely going to need his ships so I guess they're going to form an alliance M but is I mean she's not going to marry like she won't marry that guy but I mean I don't even know if they necessarily need to actually team up just more be on the same side right like we know that he's he's trying to bang Daenerys that's not going to end well for for anybody I mean Yara got there first so yeah exactly yeah although although Daenerys would never hook up with that guy anyways yeah no no no definitely not so all right so that's all going on we're assuming",
            "start": 841.92
        },
        {
            "text": "I mean Yara got there first so yeah exactly yeah although although Daenerys would never hook up with that guy anyways yeah no no no definitely not so all right so that's all going on we're assuming they're going to come through the whole Wildfire like do you think the season finale will be the King's Landing Flames Cersei dad I mean it's interesting it's like are they going to do that or are they just going to because that's the thing are you really just going to have one season with the Night King because he seems like a really **** up bad guy that's going to take some doing to figure out what to do with him so like maybe maybe like the kns king stuff will start happening more in that season and we'll get rid of the Cersei like I just don't know how Cersei is going to hold out she doesn't really have any allies she doesn't really have any money she doesn't really have any ships like she really doesn't I mean every like the whole kingdom is very stared from the war of the seven Kings and",
            "start": 881.12
        },
        {
            "text": "have any allies she doesn't really have any money she doesn't really have any ships like she really doesn't I mean every like the whole kingdom is very stared from the war of the seven Kings and everything so it's just like I don't know how she's going to defend herself that well you know so maybe she's dispatched earlier and then we get into kns King stuff M and then the next season is just all Night King Shenanigans I mean that would be crazy if they got River early cuz then the wall needs to come down at some oh yeah yeah I for yeah the Wall's going to that could be see we the Wall comes the wall coming down and like everyone coming yeah then so what's the Ning doing for this season then do we just get a little glimps of him like we've been getting forever yeah Okay cool so then it makes sense then for Cersei could be it doesn't need to be right away that she gets done and then she keeps going on and then Arya she wants to go west of Westeros what the **** does that mean I",
            "start": 922.52
        },
        {
            "text": "it makes sense then for Cersei could be it doesn't need to be right away that she gets done and then she keeps going on and then Arya she wants to go west of Westeros what the **** does that mean I don't know I hate I love Arya so much in the books and I just hate what they've done with her in the show like I was so excited for her to go to Braavos and like everything in Braavos have just been like no no this is not what I want this isn't Canon this isn't what it's supposed to be yeah I'm being I'm being a dork about it so I'm yeah and like she just gets over there so quick and I don't know it's do you really even want to go back to Winterfell after all this I mean you really want to hang out with Sansa do so do you think she ends up back in Winterfell uh I mean I how could she not you know I mean how could she not show up like you want to see well cu the question now is does she go back to Winterfell does she keep going down her list and killing people or does she just go straight",
            "start": 961.96
        },
        {
            "text": "know I mean how could she not show up like you want to see well cu the question now is does she go back to Winterfell does she keep going down her list and killing people or does she just go straight do you know who else is on her list there's Cersei the Hound Tech well I guess she was told the Mountain the Mountain's off the list now so no no the H wait what the Hound the Hound is Hound's off the list is yeah she thought he was dead yeah but I mean if she if he's not they can be they br though they like double jeopardy you can't kill him twice Okay Okay cool so we'll take the Hound off the Mountain's still there I watch that season yeah um are dead so those are off the list she do about the Boltons um and she got those I I can't remember Raph poer oh but I don't know if those are book I I get my books and my show The Executioner the the the that was right The Tickler The Tickler yeah the tickler the dude put remember theck tick monster the rat on the dude's stomach yeah oh yeah yeah",
            "start": 1005.16
        },
        {
            "text": "I get my books and my show The Executioner the the the that was right The Tickler The Tickler yeah the tickler the dude put remember theck tick monster the rat on the dude's stomach yeah oh yeah yeah yeah there's okay there's roor and biter and then like Raph and the tickler or something or maybe Raph is the tickler I can't again my I don't remember that my it's all getting mushed up in there so so the Hound speaking of the Hound he is just got with the Brotherhood without banners that's a good place for him yeah so he's going to be doing that whole thing how do you think him and the Mountain come together again well I mean okay so I know that the Brotherhood without banners is not down with the Barians you know like they're super against Cersei as well so I could just I could definitely see them joining up with daenerys's side or even just like being gorillas you know just like helping Daenerys by like on the sidelines um so yeah I could see them definitely going to be like hey like",
            "start": 1049.72
        },
        {
            "text": "see them joining up with Daenerys's side or even just like being gorillas, you know, just like helping Daenerys by like on the sidelines. Um so yeah, I could see them definitely going to be like, hey, like they need some help, like let's descend and take this whole kingdom back and make it not lame for everybody. Although I don't know, we'll that whole that whole thing is off the rails too with Bar Dondarrion and then there's no Lady Stoneheart. Um do you think we'll ever see Lady Stoneheart? No, it's too late at this point, right? Yeah, it's too late especially because they brought Jon back so that kind of messes it up for like Catelyn being brought back and then yeah and I you know I wish I Jon Snow was like, do you guys wish this? He just he seems like if you die you come back you should be a little bit different, you should be a little different. See that's what I'm really so okay I'm going off track here a little bit the books do you think the books are going to handle things much differently than",
            "start": 1095.8
        },
        {
            "text": "different you should be a little different. See that's what I'm really so okay I'm going off track here a little bit the books do you think the books are going to handle things much differently than the show did? I hope so. I mean, I think I think so. I mean, it's already very different so I mean there's definitely going to be a lot of differences. Um but I yeah like like in terms of Jon do you think that the books are going to make Jon a bit more dark or just different garious? Well okay so he's so in the books he's been stabbed. Um he's got the stabby stab but he has not we don't know what's happened after that so we do know Melisandre's on the wall with him and she has pulled a glamour before where Mans was somebody else she did a Switcheroo so I don't know exactly how it's going to happen. I doubt that I didn't think before the show I didn't see him coming back like that where like the red woman brings him back, you know, like I didn't think that was going to be a thing but like with the",
            "start": 1140.44
        },
        {
            "text": "I doubt that I didn't think before the show I didn't see him coming back like that where like the red woman brings him back, you know, like I didn't think that was going to be a thing but like with the with the books I don't even I just don't even try to think about it because I just want to be surprised, you know, cuz it's like I I almost don't even want to watch the show anymore because I don't like the whole the door thing. It's like you know that's some George R. Martin business and like I want to read it in the book and like I know that's going to be like even more like as good as it was and it like made me cry a little bit in the show for the record that was profound for me because even though I didn't watch the episode I read the geek and sundry spoiler report and I was like that's pretty good it was it was like so good I was watching with my neighbors like we had a Game of Thrones night and then like my one neighbor she was like totally like she's totally crying she made me cry a",
            "start": 1182.48
        },
        {
            "text": "good it was it was like so good I was watching with my neighbors like we had a Game of Thrones night and then like my one neighbor she was like totally like she's totally crying she made me cry a little bit and I was trying to cry in front of these guys it was I'm a tough chick yeah well you know I don't I feel weird about crying in front I'm an Aquarius we don't like crying in front of people we don't like do Taurus cry in front of everybody cuz I cry in front of everyone you guys are emotional beings Man true we are the you're steady but you you like the nice things you know you're touched by things very touched very tou so what's up with my boy Gendry we're gonna see him again he's out there rowing **** who knows is he still rowing it's been like three seasons of him rowing oh well talking about Arya I bet she's going to see him think you know I bet Arya I mean do you do you think he'll ever be referenced again I mean I think you know what here's my FanFiction thing I want to see",
            "start": 1221.4
        },
        {
            "text": "about Arya I bet she's going to see him think you know I bet Arya I mean do you do you think he'll ever be referenced again I mean I think you know what here's my FanFiction thing I want to see Arya and Gendry get together and then they finally get to be together and then they sail off and they're just like **** this **** this **** sucks like we're just going to adventur that's the west of West see go west yeah it's like but you know just let's go to the Summer Isles I don't know like there's there's some nice Islands below where it's tropical hang out there like go anywhere like Westeros kind of sucks like yeah I'm very excited man I'm hoping I'm hoping for good stuff cuz now that we're at the end like I like that all the fan surfacy stuff's happening I like that all the the questions that people had the theories that people had they're starting to get answered is it or is it not you know and it's cool I think that the the end the the finale I thought was amazing but the reveal",
            "start": 1264.08
        },
        {
            "text": "that people had the theories that people had they're starting to get answered is it or is it not you know and it's cool I think that the the end the the finale I thought was amazing but the reveal of the Jon Snow situation the R plus J equals A it's like why not just say it why not just say why not just say it you know like I thought it was kind of weird have a whisper there Whispers for another reveal later that's not yeah like come on come on I love Lady Mormont I think that Jon should become betroth to her and let her grow up and then marry her cuz she's the one's she's the one she's bringing the Thunder she's the queen of the north okay if he's the king of the North like that little **** is the best like I love her little scowl great do you know about this I've seen her on Reddit yeah oh oh yeah you SE you definitely you definitely you're on the internet yeah I know what's going on the big question have they figured out who Star-Lord's father is yet oh God great it's not Adam",
            "start": 1303.0
        },
        {
            "text": "yeah oh oh yeah you SE you definitely you definitely you're on the internet yeah I know what's going on the big question have they figured out who Star-Lord's father is yet oh God great it's not Adam Warlock unfortunately I wanted it to be Adam Warlock I did too I **** it up he did I they had his pod in the background I thought it was going to be good tease for that that ladies and gentlemen this has been the GameOverGreggy Show Kevin take it no give back on your job do it Kevin Kevin Kevin it's your first episode close out theis why do you do this I'm not prepared for anything you know what you do you take the baby bird who's really overweight and you throw him out of the nest and fall straight down but you got the soft bones you're going to land you're going to ex exit the show um I actually don't ever listen to the each and every week each and every week keep going oh yeah like I like I don't ever listen to the outro of the show it's the intro of the show again I said outro I",
            "start": 1345.72
        },
        {
            "text": "I actually don't ever listen to the each and every week each and every week keep going oh yeah like I like I don't ever listen to the outro of the show it's the intro of the show again I said outro I know oh is it I don't know I've never listened to it by this point I'm sleeping ladies and gentlemen this has been the GameOverGreggy Show mhm ladies and gentlemen this has been the GameOverGreggy Show each and every week each and every week four sometimes five four sometimes five best friends best friends gather around this table each bringing each bringing their own topic to the table close enough sure sure sure sure they talk about it and uh you can get on go on patreon.com forward SL Kinda Funny don't say forward SL patreon.com that's a Nick thing I we never **** did forward slash that's a Nick thing ah thank you for hanging out with us for nearly hours if they want to get a free word they go uh youtube.com/ I **** God damn it Kevin you're only thank you very much thank you very",
            "start": 1391.24
        },
        {
            "text": "a Nick thing ah thank you for hanging out with us for nearly hours if they want to get a free word they go uh youtube.com/ I **** God damn it Kevin you're only thank you very much thank you very much this has been a great show you should definitely check her out over patreon.com comicbookgirl19 yeah forward slir Nick isn't here this was our one chance go to youtube.com/ Comic Book Girl19 yes subscribe there I got a big awesome cont Ghostbusters review oh good yeah really positive yeah the comment section POS I'm sure they're thrilled as they were with ours we go Greg Kevin until next time it's been our pleasure to serve you yeah they said already it's been our pleasure to serve you I hate you Kevin godamn",
            "start": 1432.68
        }
    ]
}