{
    "id": 1995,
    "video_id": "LTYo1acn7Aw",
    "show_name": "Animated",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Anthony Carboni",
        "Colin Moriarty",
        "Zacq Wenzel"
    ],
    "title": "Thor and The Fuckwad - Kinda Funny Doodles",
    "description": "New episode of Kinda Funny Doodles every Friday!\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nAnimated by Zacq Wenzel\nFrom these videos:\nFuckwad - Gamescast 32 pt.1\nTips Are Rolling In - Colin and Greg Live 01.13.2016\nThor - GOG 71 pt. 3",
    "published_at": 1471622404,
    "duration": 98,
    "transcript_chunks": [
        {
            "text": "Greg: Uh the pure one Tim Gettys off on a mission. Topic number one could just be Tim Gettys. Fuckwad. Colin: Are you saying- G: But then we then we that's like the topic of a paper. C: But is it? Tim Gettys: Fuckwad? C: Why not? I mean, why not? I'm not talking necessarily about grammar... G: I'm saying it's pretty definitive. C: What's the definition of a fuckwad? G: Tim Gettys! You look it up, it's him there he's doing that grin thing he does yeah he's doing that Tim Gettys grin stuff he does. C: I didn't expect that definitive answer I'm glad that you gave it to me. G: That's what I'm here for. C: We got another tip so I have to scroll down.",
            "start": 0.0
        },
        {
            "text": "G: That's what I'm here for. C: We got another tip so I have to scroll down. G: Oh my god the tips are rolling in like water rolls down and ducks back before you eat the duck in a bucket o' water ha ha ha. C: You need, we need to get you on some meds. Nick: 80's cartoons or commercials were always the best cause they promised something that they couldn't possibly come through with. It was like you're playing a video game like... and then all the sudden Thor would come out of your closet with just glistening thighs and like a big hog between his legs and you're like, you're like what's happening, what's going on? (laughs) That's something else and you're like and he's like don't tell your Mom I'm in your room kid! And you're like, I don't know why you're saying this to me. Anthony: That was probably not a commercial, that's a repr- - Yeah, that's a repressed memory.",
            "start": 29.6
        }
    ]
}