{
  "id": 1964,
  "video_id": "Oj4_TIwds9s",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Jared Petty",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Jared Petty (Special Guest) - The GameOvergreggy Show Ep. 139",
  "description": "Check out Jared's site:\npocketsfullofsoup.com\n\nThanks to SquareSpace and LootCrate for sponsoring this episode!\nGo to http://lootcrate.com/kindafunny  and use promo code: KINDAFUNNY and http://www.squarespace.com and use promo code: KINDAFUNNY\n\nJared Petty joins us to discuss his Patreon, Third Parties, Music, and more. (Released to Patreon Supporters 07.29.16)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1470380401,
  "duration": 6867,
  "transcript_chunks": [
    {
      "text": "This podcast is brought to you by Squarespace. Whether you need a landing page, a beautiful gallery, a professional blog, or an online store, it's all included with your Squarespace website. I almost said the name wrong. Squarespace, but you knew what it was. You've already heard me. You've heard me do this. Anyways, start your free trial today at squarespace.com and enter the offer code Kinda Funny to get 10% off your first purchase. Squarespace. Set your website apart. And also remember, it's called Squarespace, not Squashpace or Squashpace or whatever I was about to say. But if you want to use Squarespace, just start squash.com. I'll be your first sub. What's up everybody? Welcome to the GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the predict the Reverend Jared Petty. Hey Jared, how are you? The pred the predict I'm so used to reaching over and have Nick Scarpino here with his ice cream scoops and his heather gray shirts. You threw me for a loop here",
      "start": 0.32
    },
    {
      "text": "Jared Petty. Hey Jared, how are you? The pred the predict I'm so used to reaching over and have Nick Scarpino here with his ice cream scoops and his heather gray shirts. You threw me for a loop here in your blue polo. I am not a producer nor a seducer. I am Irely but I'm thrilled to be here. I have wanted to be on the show since you began this noble endeavor those many decades ago and now at last here to join you on game. Very happy.com own. Uh yes indeed. We have something new to talk about but we'll get to that in a second. Yeah. Over here at the proud of Long Island Color. It's good to be with you today. Good to be with you. This is like time warp calling. This is great. I forgot to bring this up on Gamescast cuz we recorded that a second ago, but like you without the beard and the hair. I'm like whoa. I saw a picture of you with Aaron and that it confused me cuz I didn't read the caption cuz I don't like to read. Um and I was just like what the **** Like what the hell is this? I",
      "start": 76.64
    },
    {
      "text": "I'm like whoa. I saw a picture of you with Aaron and that it confused me cuz I didn't read the caption cuz I don't like to read. Um and I was just like what the **** Like what the hell is this? I thought it was an old picture. I'm like but it's a new it's a new old picture. Did you weave a cocoon and then come out like I actually just went to a barber for the first time since 2008. Okay. Did you have them do the beard too? Man, I've never done it. Never done it. I don't trust Super Cuts to do that. So, I like I didn't go to Super Cuts. I'd have to go to some fancy **** I went to a place called Metropolitan Barber Shop, which is like very highly recommended. Um, it was expensive, but it was, you know, I'm not going to do it all the time. How much is expensive? It was uh $50 worth tip to shave my head and shave my beard, which is a lot of money. For for for context, I was making the guy laugh. I'm like, you know, I bought a $10 buzzer in early 2008 at Target and I've been using it",
      "start": 113.44
    },
    {
      "text": "to shave my head and shave my beard, which is a lot of money. For for for context, I was making the guy laugh. I'm like, you know, I bought a $10 buzzer in early 2008 at Target and I've been using it ever since. And I've shaved my own head every single time. And it doesn't it's not like a miraculous haircut, but I'm like I'm paying probably a dime a haircut at this point. Yeah, at this point. Yeah. I can't get a clean even shave when I do it myself. Actually, my hair looks awful right now anyway. So, but but I I salute you going to a quality barber because I have been a a victim of beard like beard homicide. It's happened. I went to a barber once who made unsolicited changes in my beard pattern. Oh my god, that's scary. Very severe. And honestly, it was He gave you those panini lines. He he tried to give me the the chin strap without asking. And he got well into it before I was like, \"What are you doing?\" And it was a sad moment. And I had about 6 weeks where if you watch it on IGN",
      "start": 149.44
    },
    {
      "text": "he tried to give me the the chin strap without asking. And he got well into it before I was like, \"What are you doing?\" And it was a sad moment. And I had about 6 weeks where if you watch it on IGN every video, I've got my hand like this because I mean, you know, this isn't exactly a striking profile. I look like the Pillsbury Doughboy. Anyway, but but just having it up here looked so weird. But worse, I've had my beard since I was 18 years old. I have never shaved it off and I could feel parts of my face down there that I had not felt and it was just not okay. Ugh. Yeah. I I uh I basically told him, he's like, \"Well, what do you usually do?\" I'm like, \"I usually do like 3/8 inch or and you know, a quarter of an inch.\" And I'm like, \"Just, you know, but I usually shave it.\" I used to shave it really short. I'm like, \"Just do whatever you want.\" And he asked me a few questions and I was like, \"Have at it for and uh you know, it'll grow. It's it's hair. It'll grow back, you know, but I",
      "start": 188.16
    },
    {
      "text": "it really short. I'm like, \"Just do whatever you want.\" And he asked me a few questions and I was like, \"Have at it for and uh you know, it'll grow. It's it's hair. It'll grow back, you know, but I like it. Um I'm not going to I'm not Thank you. I'm not going to maintain it. This just gives me more time until I have to shave my head again.\" Sure. But uh I wanted to try it once. Uh you know, treat myself to something nice. You know, you know, the nice little shave with the cream on the back of the neck. They use a straight razor. Yeah. Oh, yeah. That was very nice. It was like I was I was laughing like it's so unusual to have anyone else using a buzzer on my hair. Like really, you my neck, but come on. Don't insult me in my I mean I know you play a role. You play a role. Did they do the hot? No. No, they didn't. Oh, the hotel's so good. Some nice after shave on the neck and you know, like just a good buzzer. not a buzzer that's like pulling out half of your hair as you're like, you",
      "start": 226.32
    },
    {
      "text": "hot? No. No, they didn't. Oh, the hotel's so good. Some nice after shave on the neck and you know, like just a good buzzer. not a buzzer that's like pulling out half of your hair as you're like, you know, because it's getting stuck because you haven't oiled it in years. And I want to say shout out shout out to the Gregs of the world though because there is a very special summon when you shave your own head of having that guy that finishes the job cuz you can't no one can see back there. There's not a mirror contraption in the world that can perfectly allow you to shave the back of your head. It's true that when I was younger, I used to like I used to do it I used to do it by myself and I have done it by myself and I think I've done okay, but you just never really know. It's never It never looks like this. No. Oh no, no, no. But it never looks like this when he does it either. Greg could do it. I give him credit over there. The pure one Tim Gettys. Let's Tim Host. If you didn't know",
      "start": 261.36
    },
    {
      "text": "looks like this. No. Oh no, no, no. But it never looks like this when he does it either. Greg could do it. I give him credit over there. The pure one Tim Gettys. Let's Tim Host. If you didn't know, ladies and gentlemen, this is the GameOverGreggy show. Each and every week, four, sometimes five best friends gather around this table. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kindafunny where you get each and every episode early along with a whole bunch of goodies and exclusives and early access and exclusive access and all sorts of pictures and things like that. Also, Amy Gills over there. If you don't have any bucks to toss our way though on patreon.com/kindafunny, head over to youtube.com/kindafunny where we post the show topic by topic daybyday the following week before the entire thing is up for free as one big video in MP3 the following Friday. I'm going to hijack this real quick before we go any any further. Uh just wanted to",
      "start": 295.12
    },
    {
      "text": "daybyday the following week before the entire thing is up for free as one big video in MP3 the following Friday. I'm going to hijack this real quick before we go any any further. Uh just wanted to say that a woman named Lindsay McKeen reached out to me um and uh asked us to wish uh her boyfriend Adam Dubison made that up. Adam Dubis. His birthday is on August 13th. He'll be 5 years old. He's apparently a big fan. Um and it's his birthday, so I want to wish him a happy birthday. Happy birthday, Adam. Dub. Dub. You. We can make this work, right? Yeah. Oh, yeah. That's something. Jared. Yeah. Your topic is starting us off. Well, Greg, I am here to shill. Yes. Yes. I am here to unapologetically shill. My topic is my new show. What's your new show? My new show is called Pockets Full of Soup. And sounds Yeah. Well, it it sounds gross, but it tastes delicious. Yep. There's a story behind Pockets Full of Soup and where that name came from. I think I'll tell it on the show. If you want to",
      "start": 329.44
    },
    {
      "text": "And sounds Yeah. Well, it it sounds gross, but it tastes delicious. Yep. There's a story behind Pockets Full of Soup and where that name came from. I think I'll tell it on the show. If you want to know, you should watch. Wow. Look at that. What a tease. He's a pro. Damn. Yeah. Find out where that where that So, what is Pockets Full of Soup? Well, Pockets Full of Soup is a storytelling show. Um, it's an interview show at heart, but not the kind of interviews maybe you're used to seeing because I'm not really asking my guests about themselves so much as I'm asking about the people who have made them who they are. For example, Greg Miller. Yeah. You're going to appear on this show right after. You're a guest. Yeah. We're going to get together. We're going to film that. You're going to sit down and I'm going to say, \"Greg, tell me about somebody you're thankful for.\" Okay. You're going to pick somebody, not the person you're most thankful for necessarily, but somebody who has influenced",
      "start": 383.6
    },
    {
      "text": "and I'm going to say, \"Greg, tell me about somebody you're thankful for.\" Okay. You're going to pick somebody, not the person you're most thankful for necessarily, but somebody who has influenced you. Because each of us in our lives are all formed not just by our own decisions but by the people around us. I know this really well. The people at this table have changed my life in many wonderful positive ways. In many horrible ways, wonderful ways and and they're just a few of the ones. Everybody has a story to tell about the human beings that have influenced them. I'm not going to try to make this saccharine or overly sweet. And I think the idea here is that we're just going to talk about the real influences, whether they be sad or funny or touching or or or wonderful or tragic. The ways people have influenced us, made us who we are, helped us and shooting for something, you know, positive. So, and we're also launching the Patreon around this this week or I am uh the So, the show again",
      "start": 417.84
    },
    {
      "text": "have influenced us, made us who we are, helped us and shooting for something, you know, positive. So, and we're also launching the Patreon around this this week or I am uh the So, the show again, Pockets of Soup. You're going to be able to find that at pocketsoup.com. And, uh, the Patreon is patreon/jared petty. My name J A R E D P E T Y. And I'm going to be reaching out this week and asking people to help support this uh because in addition to being something that I really think could be useful, something a different kind of voice, something that doesn't really exist yet uh in in this this conversational social friend space on the internet. I also uh frankly could use the help with uh with my income right now and uh it would be very kind if uh people were able to assist in that. Uh I think that I providing something that they're going to enjoy and uh I could use some help from that. So, let's talk about it all over the F. You put out a lot of interesting tidbits there. I want to",
      "start": 458.0
    },
    {
      "text": "think that I providing something that they're going to enjoy and uh I could use some help from that. So, let's talk about it all over the F. You put out a lot of interesting tidbits there. I want to talk about Too many tidbits. No, not at all. Not at all. Why is this the show you want to do right now? Okay. Well, it's for several reasons. Um, first, I think I'm going to go back to uh to Bob Ross on this when the the Bob Ross Twitch thing happened. Uh, so, you know, I some people here may know, but I uh I like many people in the world struggle with depression and anxiety. And Bob Ross's emergence or re-emergence into the world on on Twitch and uh and later on Netflix has had a positively therapeutic effect on me because this guy for all the the goofiness and the silliness of the of the hair and the the kind of weird brand that he built around that and sitting there painting on public television in front of a black background. Strip the irony away from the resurgence and popularity. And",
      "start": 498.32
    },
    {
      "text": "and the the kind of weird brand that he built around that and sitting there painting on public television in front of a black background. Strip the irony away from the resurgence and popularity. And what the guy was all about was trying to help you have a better day. Not just when he was there with you, but when he walked away, he was there to say, \"There's something in the world besides horror and frustration and difficulty. Yes, those things are real.\" He never denied them. But he said, \"You also have some measure of control over some parts of your life. Reach out, seize those, and be a better person.\" Nobody does that alone. And that's, I think, the seed that was planted that got me on this. So I thought, what's something that that I can do to try in a tiny way to reach people and help them to to hear again and again and again the testimonies that despite as bad as it all gets, things can get better. Well, every human being in this room, every human being I've ever met, no matter",
      "start": 539.52
    },
    {
      "text": "them to to hear again and again and again the testimonies that despite as bad as it all gets, things can get better. Well, every human being in this room, every human being I've ever met, no matter how rough things have turned out, people have stories that are meaningful about what people have done for them or to them or with them that have made things better. Yes, there are bad ones, too. I I get that. I don't want to be in denial about the rotten way the world can be. I I think I I I've had plenty of occasion to understand how crappy it gets, but in the middle of all that, I also keep running into wonderful things. So, first part of that's a force for positivity. Um are you hurling hurling objects, Kevin? That force for positivity as we stone Kevin. Um that's the beginning. I also wanted to do something that I could do on my own. So, I could I could manage, you know, this is me and a guest. I have been fortunate enough in in my in my time here in San Francisco to develop a a network",
      "start": 584.24
    },
    {
      "text": "to do something that I could do on my own. So, I could I could manage, you know, this is me and a guest. I have been fortunate enough in in my in my time here in San Francisco to develop a a network of friends that are professional entertainers, people that that that are all about creating good stories. You guys hear kinda funny every day. This is a forget site. This is an initiative about community. My buddies over at the comedy button and again and again again people finding ways to reach out. This is my own little way to make that happen. And also a um to be frank um another reason I'm doing this at this time in this way and launching it with a Patreon is because this is an expensive place to live and uh things have been tight. Um and this is a a measure I believe I can take to help make that happen. And now that's the other tibbit you you keep talking about and branching about. I find what's what's interesting about you doing this and talking",
      "start": 632.24
    },
    {
      "text": "I believe I can take to help make that happen. And now that's the other tibbit you you keep talking about and branching about. I find what's what's interesting about you doing this and talking about positive bringing positivity and bringing this positive person and you know shining a light on the good the good in the world, right? is that for me when we worked together at IGN, you were always that guy. Every day you were the nicest, happiest dude. Go out of your way to help everybody in all these different things. It's very kind of you. I have plenty of bad days where I'm horrible and evil, but I don't believe I've seen that ever. I got a terrible temper. I really do. No. Well, I believe it. I mean, I guess cuz you're saying it and you've never lied before, but I don't. It's You strike me as one of those I'm having a bad day and you like you to like piss Colin off. You like put his phone over there when he's not looking like I got him good. I'm so angry today. But the thing about it",
      "start": 676.56
    },
    {
      "text": "as one of those I'm having a bad day and you like you to like piss Colin off. You like put his phone over there when he's not looking like I got him good. I'm so angry today. But the thing about it is I want to know how do you maintain that? How do I mean you maintain this positive persona and you've had so many reasons to break? You have you know what I mean? Like you I feel like it's that weird I I'll never forget when the accident happened. I'm sure our audience knows all about it. I'll ask you I mean tell whatever you're comfortable with. But when that happened I remember Brian Albert text texting me when I was on he knew I was on a plane ride and when I landed he called me as soon as I texted back cuz he knew I was off the plane. And it was one of those things of how can the how can the the worst thing happen to the best person we know? Well, I bad things happen to people, I think, regardless of of where they are in life. I I I without exploring the the cosmological or",
      "start": 711.28
    },
    {
      "text": "how can the the worst thing happen to the best person we know? Well, I bad things happen to people, I think, regardless of of where they are in life. I I I without exploring the the cosmological or theological implications of that, bad things happen and they happen to everybody. Some worse things happen to some and some to others. But when that car came up the wrong way up the bridge and hit Angie in the face, it almost I guess I should tell the story, shouldn't I? Absolutely. Yeah. For those that don't know, and this audience, many people in this audience really helped us. Um about a year and a half ago, my wife and I were struck by a drunk driver the wrong way up the Bay Bridge or an impaired driver. Um and uh she she came up uh this this oneway bridge the wrong way, hit us head on in high speed. My wife was almost killed. My wife is still recovering. some of her injuries she will never completely recover from. Um she's doing far better than we ever thought she would. Uh and in that",
      "start": 744.48
    },
    {
      "text": "speed. My wife was almost killed. My wife is still recovering. some of her injuries she will never completely recover from. Um she's doing far better than we ever thought she would. Uh and in that dark time where we didn't know if she was going to make it or not, uh the first uh that first uh few days there, the people at this table and some other people um made it their purely benevolent utterly generous and human mission in life to find ways to help us. Um, I went to sleep one night and woke up the next morning and somebody had created a a uh a fund to help us out with the considerable expenses related to this that raised a truly enormous amount of money for which I will never cease to be grateful. But that was only it was really important and it was you guys in your in your roles through through both what you were doing at IGN and what you were doing here at the beginning of of Game of Greg and what became kinda funny and also some other kind people just person after person that",
      "start": 789.12
    },
    {
      "text": "through both what you were doing at IGN and what you were doing here at the beginning of of Game of Greg and what became kinda funny and also some other kind people just person after person that reached out again the guys at Comedy Button and the folks at Unlocked and on and on and the kind people at IGN but in addition to the money there was always other people lifting me up. I was never alone. Never. Even when I was alone in a room, I was never alone. There were constant messages and phone calls and texts and knocks at the door and people coming to my desk and people coming to the hospital and people coming to the room. The kind people o over a good job brain just showed up to visit my wife because they knew it was her favorite podcast and they visited her in the hospital. They just just out of the kindness of their hearts and this went on and on and frankly still goes on. people still help me. And man, I hate being a tragedy. I hate it cuz there's an element of it where for a",
      "start": 841.04
    },
    {
      "text": "just out of the kindness of their hearts and this went on and on and frankly still goes on. people still help me. And man, I hate being a tragedy. I hate it cuz there's an element of it where for a while you feel like a great burden upon people even though you didn't cause the situation. But eventually in the course of this I learned to accept something about life that that I learned through this. We are lost without each other. We just are. Um and I think that's the germ, the seed at the center of the show. It's all about how other people make us who we are for the better. That experience plays highly deeply intrinsically into that. Um I I don't talk about it publicly very much, but the my faith's tied up in that idea that that ultimately the love of people for other people is the most important thing in the world and the only thing that really changes things. I've witnessed that and um I'm going to try to find a way to share what I've learned through this through that. The focus",
      "start": 887.2
    },
    {
      "text": "important thing in the world and the only thing that really changes things. I've witnessed that and um I'm going to try to find a way to share what I've learned through this through that. The focus isn't going to be on me. I'm I'm talking to others and the focus isn't even going to be on the person next to me so much as it is how other people made them the best of who they are. And I think that's the the coolest thing about this. We were talking about this out there, but you know, everybody's favorite thing is themselves. Everybody loves to talk about themselves. Everybody loves making their lives better and like at the end of the day that you know you are you so you know you better than anyone else does. However, you are only the people that you surround yourself with. You are the relationships that you have. Your entire life's journey is to find love, to find companionship, to find friendships with people that make you better, that make you feel fulfilled and all this all of these",
      "start": 941.36
    },
    {
      "text": "that you have. Your entire life's journey is to find love, to find companionship, to find friendships with people that make you better, that make you feel fulfilled and all this all of these things. And I feel like the idea of the show is so brilliant because it allows you to really kind of stop and think about who are the people that are making you strive to be who you want to be and who you want them to have in their lives and whatever it is. And I think that it's it it really does go very deep into into what I believe, like you were saying, life is about, which is relationships. And it is um working with other people and talking to other people and figuring out like just what we do in the show. Like we learn from each other and from the audience and from everything. But it's like I think that it's it's a beautiful thing to to be positive. I always love being positive. But I think that to to really kind of not just be blindly positive, but to focus on what is positive and what you",
      "start": 987.36
    },
    {
      "text": "that it's it's a beautiful thing to to be positive. I always love being positive. But I think that to to really kind of not just be blindly positive, but to focus on what is positive and what you truly think is important about somebody else. and talking about that allows you to to speak about stories in a way that you really can't in any other um framing. Yeah, it's possible to be positive without being unrealistic. But I think to be positive in the face of the horrible realisms that also surround us requires other human help. It just does. And thank God I'm surrounded by kind people who do that and so are a lot of others. It doesn't always work out that way for everybody. I I recognize that. But we should tell the stories. We we we ought to represent the whole spectrum. You know, there there's plenty of evidence out there that the world is a crappy, terrible place full of horrible things. The the last few weeks are are a reminder to us on a global scale of how awful things are. But",
      "start": 1034.08
    },
    {
      "text": "There's plenty of evidence out there that the world is a crappy terrible place full of horrible things. The the last few weeks are are a reminder to us on a global scale of how awful things are. But that's not the whole story. I just want to present another tiny piece of what's real there which is that yeah that's all true. And so is this. Here's a few of the good ones that also exist there. And I hope I can do that with some sincerity. I had doubts about how this would work out but I've got a couple of these in the can now. And I was surprised how well it came out. People are eager to talk about the people that have influenced them in the best ways and in the most positive ways. And there are stories that are funny and heart-wrenching and striking and inspirational all tied up in these little two person interviews. And I was like, \"Okay, I think this is actually something worth doing.\" And I wouldn't do it if I didn't think it was. So once I got those those test bed pilots in the",
      "start": 1085.84
    },
    {
      "text": "little two person interviews. And I was like, \"Okay, I think this is actually something worth doing.\" And I wouldn't do it if I didn't think it was. So once I got those those test bed pilots in the camp, I was like, \"Yeah, we're going to we're going to do this.\" Well, at some point you have to drop this whole like I'm just Jared Petty and admit that you're good at this. Yeah. You're great at podcasting. You're great at talking. The Games Cast we just did was great. I mean, you could talk to anybody. It's like I was talking to somebody the other day when we were pitching something. I forget for what show or whoever sales thing we were talking to. Oh, it was panels. People were worried about panels. I was going to be on at Comic-Con and they were worried about one of these developers climbing up. And I'm like, I could talk to a rock for an hour and probably make it all right. You don't have to worry about it. And you strike me as the exact same way. And that's why we always loved having",
      "start": 1138.88
    },
    {
      "text": "up. And I'm like, I could talk to a rock for an hour and probably make it all right. You don't have to worry about it. And you strike me as the exact same way. And that's why we always loved having you on Beyond. But when we introduced you here and then when we originally introduced you like on Beyond as a personality, at some point we started calling you the reverend. Yeah. Because you had been a reverend at one point. still am technically. Yeah. Still got my credentials. You haven't taken them away yet. You talked about how um you don't talk about your spirituality often. Mhm. Everything that happened to you in the last year and a half, did it did it weaken it at all? Did it strengthen it? I mean, was there were there moments? It changed it. Yeah, there were moments. There still are. Uh I I absolutely This is, you know, um this is a process. Uh here's the thing about almost getting killed. It does terrible things to your body. And if you get that close to dying and live through",
      "start": 1171.84
    },
    {
      "text": "Uh I I absolutely This is, you know, um this is a process. Uh here's the thing about almost getting killed. It does terrible things to your body. And if you get that close to dying and live through it, you are never the person you were before. Um, that's what's happened to my wife. And if you are near someone and you care about someone that that's happening to, you will never become the person you were again. You we can never go back to the way it was emotionally, physically. Everything about my life, from my goals to my dreams to our plans, about our family, all of that changed and is still changing. And I still don't know what the landing point is. And we still get news. And some of it's great. She's so much better in so many ways than we ever thought. And some of it's awful and terrible. And we still get awful news sometimes. And all of that shakes me to the core. And yes, I have laid in the night and cursed God. And I have laid in the night and prayed. And I have even I believe",
      "start": 1207.2
    },
    {
      "text": "And we still get awful news sometimes. And all of that shakes me to the core. And yes, I have laid in the night and cursed God. And I have laid in the night and prayed. And I have even I believe occasionally gotten a very pulpable um response on occasion that just enough to keep me going. But that response, as I find, you know, I spent seven years in college studying studying scripture and and five years in the pastoral vocation full-time. And one of the things I learned as I interpret it, the story of faith, whether you believe that there's a God or you believe there's no possibility that there's a God, in either case, the story of faith is people reaching out to one another and trying to help one another, not for the sake of their own self-interest, but simply because it makes the other person's life better and makes the world a better place. I mean, as I understand Christianity, the most important command Jesus said there ever was was when he was asked, you know, what what do you",
      "start": 1259.04
    },
    {
      "text": "person's life better and makes the world a better place. I mean, as I understand Christianity, the most important command Jesus said there ever was was when he was asked, you know, what what do you do? He said, 'Well, love God and do that by loving others. I I don't care if you particularly about the prayer. I don't care particularly about the offerings and the sacrifices and the songs and the adornments. I care whether or not you help the person next to you, feed the hungry, take care of those who are in trouble, visit prisoners, and don't judge. Even if somebody hurts you, try to help them anyway. And that's hard to do. I have failed so many times in that, but I have been the recipient of so much of it. And um it's not about deserving, it's just about divesting. Well, I think that, you know, when you approached me about your idea and and and and we were we went out, it's actually when we saw Independence Day and and uh all good ideas. Yeah, it was a dark it was one of the darkest",
      "start": 1315.12
    },
    {
      "text": "know, when you approached me about your idea and and and and we were we went out, it's actually when we saw Independence Day and and uh all good ideas. Yeah, it was a dark it was one of the darkest days in modern human history. The day we saw Independence Day and we were you and I and Aaron and Kate and and Angie went to a restaurant. and you and I were were were chatting and and um I liked the idea that you had, but I also feel like, you know, in my you know, we could do we could I guess help or elevate a lot of different people in our lives or a lot of just different people out there that we like, but you've always struck me as and I've known you for a while now as um someone who deserves it, like deserves more, deserves better, deserves good things. And I've always had an incredible amount of respect for the way you carried yourself. Not only after what happened to you and Angie, but actually before um because I remember when you first started working at IGN. Um you and I had",
      "start": 1362.8
    },
    {
      "text": "amount of respect for the way you carried yourself. Not only after what happened to you and Angie, but actually before um because I remember when you first started working at IGN. Um you and I had chatted a few times, but I'm like always running around and being like kind of like Kurt or just like, you know, like all right, that's cool. Like, you know, like and I remember approaching you a few weeks later and been like, you know, I'm sorry. Like there's something different about you, isn't there? Like, you know, like you're douchebags like Vince and Geneva. You're just you're just you're just like you deserve the the person to stop and talk. You deserve the time. You have insight. You're smart. You're kind and friendly. Like well there there. Yeah. You're well spoken and articulate. You're educated. You're open-minded. You're you're worldly. You've lived all over the country. You've lived in Japan. You've you you've seen and done a lot of things with your life. And so I always had a",
      "start": 1408.08
    },
    {
      "text": "educated. You're open-minded. You're you're worldly. You've lived all over the country. You've lived in Japan. You've you you've seen and done a lot of things with your life. And so I always had a great deal of respect after what happened with you and Angie because I'll never forget and you and I have talked about this before where I remember that one of the first things I asked you after that was like who did it and are they like like are they are they dead? No, they're not. I was like too **** bad, you know? I I remember saying that. I'm like **** them, you know? And you were like and I was like that's too bad that they get to walk away when that piece of **** should be 6 feet under, you know? And I was full of this like vengeance and this like want of revenge. And the man who it happened to and the man who watched his wife almost die and go through this catastrophe that only modern medical science helped and and faith probably helped her get out of was the one like no like",
      "start": 1450.08
    },
    {
      "text": "happened to and the man who watched his wife almost die and go through this catastrophe that only modern medical science helped and and faith probably helped her get out of was the one like no like she's just a person and she's sick. I remember you saying it to me, she's sick. And I'm like, what the **** are you talking about? You know, like and it and it showed me like, wow, I'm like totally bent in a certain way that I think a lot of people are about that. And you are you had such grace about it and I'll never ever ever forget it. Like I'll just never like as long as I I I can go we can go do our separate things. I never see you again one day. And I'll always remember that like that lesson that taught me about who you are. And so it's because of that that we want to go to the audience and ask them for their help to help help you elevate this new project. You deserve it and you've been it's the same thing when we were on Podcast Beyond and we helped you raise some of that money so",
      "start": 1486.4
    },
    {
      "text": "and ask them for their help to help help you elevate this new project. You deserve it and you've been it's the same thing when we were on Podcast Beyond and we helped you raise some of that money so you can pay your bills direct in the months leading or the months subsequent to that terrible event. And we're going to do it again because you deserve it and you deserve good things. You're smarter and and kinder and friendlier and more real and more humble than almost anyone I've ever met. And the fact that you have all of those things inside you, like, you know, someone might have the the humility, someone might have the kindness, someone you have all of it. And so, I respect the **** out of you. And I hope that this I I know you have very modest uh expectations about how this is going to do, but I I I think that you deserve meteoric success in this. And I hope you find it. And if we can get be there at that that again that germs stage that that that seated stage then I'm happy to do",
      "start": 1529.52
    },
    {
      "text": "do, but I I I think that you deserve meteoric success in this. And I hope you find it. And if we can get be there at that that again that germs stage that that that seated stage then I'm happy to do it for you 100%. Thank you. That means the world to me. Off your resume there of amazing attributes. Uh Colin left off the time you brought in two submarine sandwiches and ate one for breakfast and I was like **** yes. This guy is awesome. That was a really big God. I'll never be like oh Jared's even better than I thought he was. That leads to heart disease. Don't do it. You are you are authentically one of the good ones. 100%. And and I know in your inside you you know that. But I've I' I've encountered and met so many people now that know you. You know that have I've never heard one bad thing about you ever. Oh, I have a list. Uh I I'll gladly share them, but perhaps this isn't the context of the time. Thank you for gracious. It's incredible. So kind of so I we're all wishing you the",
      "start": 1573.28
    },
    {
      "text": "about you ever. Oh, I have a list. Uh I I'll gladly share them, but perhaps this isn't the context of the time. Thank you for gracious. It's incredible. So kind of so I we're all wishing you the very best. you're part of this family and so exactly thank you guys for please support please support Jared's new endeavor. I think it sounds fun. We're all going to be on it so yeah um probably multiple times. So let me So we've talked about the show's launching. There's a Patreon for it but it'll be available for free everywhere. Yeah, it's going to be available. Here's the details. Uh so the day this goes up. Uh it's going to be out there. It's going to be available. It's available for free. You're going to be able to find it on YouTube. You're going to be able to find it on the Patreon site. You're going to be able find it at pocketsful.com. We'll be on Twitter. We'll be on Facebook. There'll be a Facebook group. You can join that find it there. We will be on iTunes eventually through",
      "start": 1616.4
    },
    {
      "text": "You're going to be able find it at pocketsful.com. We'll be on Twitter. We'll be on Facebook. There'll be a Facebook group. You can join that find it there. We will be on iTunes eventually through Soundcloud, but I'm subject to the Apple, you know, launch stipulations. That takes a little while. You guys know that really well. But there will be a direct link to the MP3 on the Patreon and on the website. So, you should be able to just go there and find it through the Sad Club link there. Um, that's the audio version. Of course, you know, come to YouTube, subscribe. That will help tremendously. It's going to be free and available to everybody else. There will be of course the usual cadri of backer tier rewards and uh you can go to Patreon and find those and I really do hope you will because uh uh I like money and I could use your help. Um but uh yeah people have already helped and I mean you keep dancing around it like you keep saying you like money and not but I mean it all goes",
      "start": 1651.76
    },
    {
      "text": "uh uh I like money and I could use your help. Um but uh yeah people have already helped and I mean you keep dancing around it like you keep saying you like money and not but I mean it all goes back to the Angie thing, right? Like you do the show because you want to do a show and you want to have your own project. I do it because I have my own project and I do it because I live in San Francisco and I have a job that is wonderful and great, but my wife hasn't been able to return to work full-time. And yeah, it would be helpful to to uh find a way to make ends meet. But also, frankly, I mean, this is going to be fun. If I don't make a dime on this, this is going to be fun. And I think it's a tiny little way of giving back to And I just want to put this out there just cuz there's going to be a lot of people out there that's like, \"Oh, well then why do you live in San Francisco? If you need money, blah, blah, blah.\" You don't live in San Francisco. That's true. I live in the I live far",
      "start": 1688.8
    },
    {
      "text": "be a lot of people out there that's like, \"Oh, well then why do you live in San Francisco? If you need money, blah, blah, blah.\" You don't live in San Francisco. That's true. I live in the I live far away from San Francisco. You live far far away from San Francisco and have to commute to San Francisco for work, which is a very different thing. And that I think is a better representation. That's a good point. Yeah. I I financial situation. There's not I can't really move much farther and still do what I do the way I do it. Uh this I live kind of about as far away as you can. And for those not familiar, the San Francisco economic situation is is a is a particular one. It's a **** show. It's an utter **** show. But I'm not trying to again not trying to gripe there. But yeah guys look I I'm not apologetic about this. I really hope that you will uh give and get involved and uh I hope uh soon to hear from a bunch of you too. You'll be able to if you want to send in uh questions by",
      "start": 1725.04
    },
    {
      "text": "I I'm not apologetic about this. I really hope that you will uh give and get involved and uh I hope uh soon to hear from a bunch of you too. You'll be able to if you want to send in uh questions by the way uh you can mail those to uh to mailpockets.com. Um so if you want to ask some of our guest things as they're coming up, some of the people that you can look forward to, you can ask me questions of course, but you can also ask questions for Greg. We're filming you today. Uh I don't know if they'll get in in time when this goes up. So, I can tweet out if you want to say I'm doing a new podcast. Yeah doing something. But uh maybe right now if you want I want to I won't say anything about you. You won't say anything about me. No not at all. Not a little bit. I mean do you want me to blow your soft launch? No that's a couple that's a couple of weeks from now. I will give it time. So yeah. Uh when this goes up and then our big launch that'll be August 1st but you'll be able",
      "start": 1761.2
    },
    {
      "text": "blow your soft launch? No that's a couple that's a couple of weeks from now. I will give it time. So yeah. Uh when this goes up and then our big launch that'll be August 1st but you'll be able to get the content before then because this is specifically time for the kind people who give to Kinda Funny's Patreon uh who are so generous. And I get everybody's asking you for your money. I get that I I don't want to take advantage of your goodwill, but I really think this is actually something worth supporting or I wouldn't be here doing this right now. And of course as you guys know better than anybody else of course just go subscribe on iTunes the YouTube page all that stuff because even if you don't have money to give or don't want to give it you want to see what the show turns out to be. Those numbers help and absolutely so much. Well Jerry we wish you well. Thanks. Thank you for having me. Always a pleasure. Please leave. Oh. Oh no. I don't get to talk about the other",
      "start": 1798.16
    },
    {
      "text": "out to be. Those numbers help and absolutely so much. Well Jerry we wish you well. Thanks. Thank you for having me. Always a pleasure. Please leave. Oh. Oh no. I don't get to talk about the other four sometimes five friends is the fourth you're the fifth. Get out of not one of those sometimes. So uh I want to actually what I was on my phone before was I was trying to round up the um where this question came from because I want to give credit where credit is due because I think it's a great topic and it's a timely topic. Um it comes from let me see J Witherspoon. No no no. Okay. Katherine Hickman. So uh she's a listener of this show. Um I was tweeting out a bunch of political things and I've been quote tweeting a lot a lot lately to try to answer more people. Um and we were talking about the DNC started the Democratic National Convention started yesterday and she asked um can we get a GameOverGreggy topic on third party candidates and consequences of splitting the vote?",
      "start": 1832.48
    },
    {
      "text": "about the DNC started the Democratic National Convention started yesterday and she asked um can we get a GameOverGreggy topic on third party candidates and consequences of splitting the vote? Um and this is popular because everyone hates Donald Trump and everyone hates Hillary Clinton. So what are you supposed to do? And I wanted to involve this and ask you guys and I think it's especially uh pertinent that Jared's here because Jared knows history like I know history. So um we can have an interesting conversation first about where third parties have been and where why they come from where they come from. We can talk about the no nothings and the free soil and all that kind of stuff but and we will I'll give you that history but the but the thing I want to know more about is do you guys think that there is a moral imperative to vote third party or not to vote third party? Sure. um as third party elections in two famous cases actually **** a candidacy of a person who should",
      "start": 1877.12
    },
    {
      "text": "guys think that there is a moral imperative to vote third party or not to vote third party? Sure. um as third party elections in two famous cases actually **** a candidacy of a person who should have otherwise won. Um which one are you going to toss out? What are your two examples? Cuz yesterday 191 and 000 are the are the material ones that actually changed the course of the election. This is the maybe 199 but that's that's yesterday you you've brought up the topic today. Yesterday on DNC night one this tweet from uh Frank Dale was going around about 000. Florida Gore lost and you put in quotes uh by 537 votes. Nater got nine 9 97 a little over 97000. New Hampshire Gore lost by a little over 7000. Nater got 000. So we'll get to 000 cuz that was a that was a major one and I think that people talk about this one a lot with good reason. Sure. He didn't lose. He he he did lose. Yeah. Um now now uh I mean so says the Supreme Court now um five to four. So yeah which is weird",
      "start": 1910.88
    },
    {
      "text": "that people talk about this one a lot with good reason. Sure. He didn't lose. He he he did lose. Yeah. Um now now uh I mean so says the Supreme Court now um five to four. So yeah which is weird cuz math is math. It should have been nine nothing you would assume. Um so so first she asked about kind of the history where where third parties have been. Now I knew the answers to a lot of these questions, but I wanted to go and look and I did about all of the years of consequence that actually third party candidates had run. Okay. Um and so I have those years and I wrote them down. Um it's 183 is the first year of massive massive third party running but it happened it happened a lot actually and we and I knew this and we can talk about this because we're going to um in the years leading up to the Civil War. It happened almost every year. Um and then there were ones like in 189 and 194 but actually 191 and 1948 were big years and then 9 uh '68 was a big year too actually uh with",
      "start": 1960.32
    },
    {
      "text": "up to the Civil War. It happened almost every year. Um and then there were ones like in 189 and 194 but actually 191 and 1948 were big years and then 9 uh '68 was a big year too actually uh with Wallace but you were going to bring that. Yeah. 9 and then 000. We could have another year like that this year. So the history I want to bring up I went and looked up the numbers. I knew the guys but I who ran but I was like who what were the numbers and what were the consequences of these particular elections for for um for the sake of argument right? So in 183 um you had John Floyd running as a nullifier and you had William Wart running as an anti-masonic. And both of those guys actually nullification for what people don't know is was the idea that this mostly southern idea in American politics that does this do the states have the the right to nullify federal laws? In other words can a federal law be passed by Congress and then the states like \"No we're just not going to do",
      "start": 2001.92
    },
    {
      "text": "politics that does this do the states have the the right to nullify federal laws? In other words can a federal law be passed by Congress and then the states like \"No we're just not going to do that.\" um which at that point in American history was far less concretely established than than it is now. It seems weird to us now but then there was genuine question as to which one was the proper understanding of the constitution. Right. So nullification was nullification wasn't a legit crisis in like the 1830s for instance. Um and both of those guys uh pled in the teens. Mhm. Um and so both of them got like a substantial amount of the popular vote and both of them won small massive electoral votes. So there was a consequence there. But it wasn't until 1848 185 that **** started to go haywire because this is when the free soil party started to run. This was this was the harbinger of the end of the wigs and the beginning of the Republican party. The Republican party of course founded",
      "start": 2042.96
    },
    {
      "text": "because this is when the free soil party started to run. This was this was the harbinger of the end of the wigs and the beginning of the Republican party. The Republican party of course founded uh to end slavery. Um and this is when Martin Van Beern who was already president Yeah. Um you know a protege of Andrew Jackson and uh a New Yorker uh ran and won 14% of the vote. Um and then Millard Filillmore in 1856 ran as a no nothing. Now Millard Filillmore of course was already a president as well. Nothing uh was a party that was basically anti-atholic anti-immigrant and nivist. Does that sound familiar? Uh so um and he won uh he won 1.5% of the vote in eight electoral votes. What people don't realize is that in 1860 which was the most consequential election in American history who was elected in 1860? Abraham. John Franklin. John Franklin was getting ready to Great President John Franklin. Sorry I got excited. I got excited. Like I was like \"Ooh I know. I know.\" It was",
      "start": 2083.36
    },
    {
      "text": "Who was elected in 1860? Abraham. John Franklin. John Franklin was getting ready to Great President John Franklin. Sorry I got excited. I got excited. Like I was like \"Ooh, I know, I know.\" It was really So what people don't realize about 1860 was when Abraham Lincoln was nominated is that that was a cluster****. Abraham Lincoln won with only 39% of the vote. Yep. And there were the Democratic Party that year split uh between Breckenridge and Douglas, Southern and Northern Democratic Parties. They had two conventions. They hated each other. And they both split their own vote. And then there was a constitutional party uh run by John Bell who won like another 18% of the vote or whatever. And so Abraham Lincoln won with only 180 electoral votes and uh won with 39% of the vote. And that's when the southern states were like, \"Fuck it.\" He won with literally no support from the southern states. None. Everyone hated him. And because of because of slavery and so then I give you that",
      "start": 2127.92
    },
    {
      "text": "when the southern states were like, \"Fuck it.\" He won with literally no support from the southern states. None. Everyone hated him. And because of because of slavery and so then I give you that background just to give you, you know, 191 is the uh Theodore Roosevelt election, the Bull Moose Party. And this is probably the most conse one of the most consequential because this is the only time a third party came in second. Yeah. So, a third party candidacy ran and Theodore Roosevelt actually came in second place um beat the Republican candidate um who was Tafted who was running for re-election giving us Woodrow Wilson. That was the first example what we were talking about of someone losing an election that they should have won and giving us someone who shouldn't have won which was Woodrow Wilson. Woodrow Wilson should have never been president. If Theodore Roosevelt did not run, Yep. then Taft would have won re-election. And to be clear for people who aren't familiar with the history",
      "start": 2170.96
    },
    {
      "text": "Wilson. Woodrow Wilson should have never been president. If Theodore Roosevelt did not run, Yep. then Taft would have won re-election. And to be clear for people who aren't familiar with the history, Roosevelt had already been president at this point. that he was coming in switching parties coming back in and he was able to command an enormous amount of the popular vote because of that or at least proportionally enormous and spoil well spoil or alter the course of the election. For people that for people that are not aware what basically ended up happening was in 1896 William McKinley is elected. William McKinley's vice president was Theodore Roosevelt. William McKinley is assassinated. Theodore Roosevelt becomes president. Right. Theodore Roosevelt is then then runs again uh 19 No. Yeah. I have the dates right. Yeah. 1896. 1900 runs. Mhm. 1904 runs. Yeah. Something's wrong with this. It's okay. We're close. We're close enough. He he he won. Oh, no. McKinley McKinley died and then he",
      "start": 2207.28
    },
    {
      "text": "I have the dates right. Yeah. 1896. 1900 runs. Mhm. 1904 runs. Yeah. Something's wrong with this. It's okay. We're close. We're close enough. He he he won. Oh, no. McKinley McKinley died and then he served and then he was reelected. Right. Exactly. So, the dates are a little off. Uh the Roosevelt runs for re-election and there is no constitutional amendment yet to stop you from running for a third or a fourth or a fifth term. It just didn't happen. It's called George Washington set the president. No one even really did that **** at that time. FDR was really the only one that that really did it. and um he handpicks a successor Taft and then ends up **** hating Taft. So he comes back in and basically I don't want to use assassinate his his uh his candidacy but basically sabotages his candidacy comes in as a progressive. Everyone loves Theodore Roosevelt. Taft gets **** **** upon and then Woodrow Wilson becomes president. So the first example and really the only one of two or",
      "start": 2240.72
    },
    {
      "text": "candidacy comes in as a progressive. Everyone loves Theodore Roosevelt. Taft gets **** **** upon and then Woodrow Wilson becomes president. So the first example and really the only one of two or maybe three examples of a third party presidency destroying who should have won. And then in 48 you have Strom Thurman who was like a racist. The Dixicrats. Yeah, exactly. And in in uh 1968 you have uh Wallace who was a **** complete racist. Um uh if you don't know if you guys don't know anything about Governor Wallace uh total segregationist uh governor of Alabama I think right and uh ran on a segregationist platform basically for a long time. He actually came back. He was almost murdered in an assassination attempt, became paralyzed, and later on in the 80s ran for governor and won again and apologized for all that **** But no one really cares about that because he has this much like Strom Thurman has this deep-seated like racism. He had this legacy of hate. And although he was actually",
      "start": 2285.6
    },
    {
      "text": "apologized for all that **** But no one really cares about that because he has this much like Strom Thurman has this deep-seated like racism. He had this legacy of hate. And although he was actually became very popular in Alabama in some circles, even when he did that re-election, there's actually a tunnel in Montgomery named after him still. Uh which is unbelievable. Uh and then we get to 199, right? And this is where things get really interesting. Ross Perot wins like 18.9% of the vote as an independent candidate. As people know, Ross Perot actually left the election, left the race in the summer. He was winning, left the race, and then came back late and still won 18.9% of the vote. There's a lot of conjecture that he might have just won if he stayed in. Um, and there was a lot of conspiracy theories. He was something like he thought the FBI and the CIA were after his daughter and there was like black helicopters at his wedding and all this like weird **** Like he thought the",
      "start": 2329.76
    },
    {
      "text": "theories. He was something like he thought the FBI and the CIA were after his daughter and there was like black helicopters at his wedding and all this like weird **** Like he thought the parties were going after him. He was a little crazy. They did a terrible job explaining that dropout because poll-wise he was golden at the moment he walked out. It was it was shocking. It was one of those it's one of those great like just kind of unexplained moments in American history where just like nothing about this adds up and I never got a satisfactory answer. Um so I think that's why it's such a hot bed for conspiracy and maybe he just didn't want to deal with it. But but we don't know and we probably never will. And the reason that that's consequential is that that might have been really the only time that someone would have realistically won as a third party candidate. Um, and then in 2000 you have the notorious uh Gore Bush Nader cluster**** that happens in Florida. Um, and um, so the",
      "start": 2371.12
    },
    {
      "text": "time that someone would have realistically won as a third party candidate. Um, and then in 2000 you have the notorious uh Gore Bush Nader cluster**** that happens in Florida. Um, and um, so the only reason the only reason I say all of that and to bring all that up, you're the problem. You're the hanging chad. I I I I was the hanging chad. I'm sorry. You guys can blame me for that. So So the only reason I bring that up is to set the stage for, and by the way, my dates with McKinley and Theo Result were right. I think the uh I set the stage for because she asked like where what's the history? That is the history. Um the the common theme between all the third party candidates is that they're well outside the mainstream. You're either hyper racist as Millard Filmore was or as Wallace was or as Strom Thurman was or you have very progressive ideals like the Free Soil Party had or Debs who represented the Socialist Party and got a significant chunk of the vote places. Exly. Um, the",
      "start": 2406.96
    },
    {
      "text": "was or as Strom Thurman was or you have very progressive ideals like the Free Soil Party had or Debs who represented the Socialist Party and got a significant chunk of the vote places. Exly. Um, the Roosevelt was a progressive Republican. So, he was well outside of the mainstream. I mean, we're talking about a Republican that's more in line with the Roosevelt would be very at home with progressive Republicanism today, like the person like I am. And he's obviously one of New York's favorite favorite people. But, um, the idea is that they're outside of the mainstream. And so, what you're left with is is the mainstream candidates, the the Republicans and the Democrats, or back in the day, the wigs and the Democrats or the Federalists and the Antifederalists or whatever it might be. The question therefore now that we have the historical perspective that sometimes this does sabotage elections is in 191, was it incumbent on Republican and conservative and independent voters to vote for Taft",
      "start": 2452.0
    },
    {
      "text": "therefore now that we have the historical perspective that sometimes this does sabotage elections is in 191, was it incumbent on Republican and conservative and independent voters to vote for Taft because by voting for Theodore Roosevelt they lost the election for the man who should have won. But does anyone have the right to win the election? That's the bigger question. Yeah. Who who decides who should have won? Gore definitely sabotage or Gore was definitely sabotaged by Nader. There's no doubt about it. Gore would have won if Nader didn't run. But whose problem is that other than Gore's problem? Like, so where do you guys sit on this? Because we're talking today about two candidates that people genuinely don't like for context, and we've talked about this in the past in post-war polling, which is very scientific. So since 1945, so let's say since Truman ran in 48, right? The four most unpopular candidates in polling is Barry Goldwater, McGovern, Donald Trump, and Hillary Clinton. Yeah.",
      "start": 2489.28
    },
    {
      "text": "is very scientific. So since 1945, so let's say since Truman ran in 48, right? The four most unpopular candidates in polling is Barry Goldwater, McGovern, Donald Trump, and Hillary Clinton. Yeah. Yeah. Two two of them are running against each other, which is unbelievable. Meaning that any even a even a moderately decent candidate would destroy them. If a moderately decent candidate were allowed to survive without also being I mean, some of what's going on here is that Yeah. Okay. I got to be careful uh because I don't want to I don't want to advocate something irresponsibly. But I do think that some of what's happened in this case is that we had a candidate that a couple of years ago when Hillary Clinton was extremely popular with voters and years of Benghazi and email exposure has changed that. When Hillary Clinton became the air apparent for the Democratic party, she was a far more popular candidate than she is now. She was pulling much much higher in approval ratings nationwide than",
      "start": 2531.36
    },
    {
      "text": "that. When Hillary Clinton became the air apparent for the Democratic party, she was a far more popular candidate than she is now. She was pulling much much higher in approval ratings nationwide than she is at the moment. But over the course of that uh whether you approve of Mrs. Clinton or not uh her she was subject to a very very close scrutiny that resulted in a gradual decline in her popularity and whether you want to call that well-deserved uh repercussions for her actions or a smear campaign. I'm going to leave that to the viewers to decide. I call it karma. Uh but whatever you may call it, it did happen. I worry that right now many moderate candidates on both sides of the aisle who tried to make a move would find themselves subject to very similar systematic uh systematic treatments. And that's something as old as politics. But right now we're in a very new place where the you know politics is is largely about publicity control. That's one element of it. And information control",
      "start": 2581.68
    },
    {
      "text": "And that's something as old as politics. But right now we're in a very new place where the you know politics is is largely about publicity control. That's one element of it. And information control has changed in the last 4 to 8 years more than it has in the last 40 to 80. Uh the way that people are able to manipulate what we hear, what we understand, and what we see has changed a lot. That has to do with everything from the way news networks works to the work to the emergence of Twitter to the fact that I can go to Bloomberg News and Breitbart and CNN and MSNBC, read the same story and as Wire points out, get four completely different headlines that look like four different news stories on exactly the same facts. Uh, I can choose what reality I live in politically right now and be in the center of the mainstream, not a lunatic fringe guy, which is what that you would have been called 15 years ago. We're still learning how to deal with that and people are still learning to control it.",
      "start": 2632.32
    },
    {
      "text": "center of the mainstream, not a lunatic fringe guy, which is what that you would have been called 15 years ago. We're still learning how to deal with that and people are still learning to control it. And because of that, almost anybody who's going to go front and center is going to be subject to a degree of marginalization that has not been technically possible in human history until very recently. That has to do with the way news organizations, computing power, and network infrastructure are all now tied together in a way they've never been. And I do think that that presents us with challenges where it's going to be very hard for us to get a likable candidate on a national level, maybe for a while. What's your thought on that? Yeah. I mean, I guess the more salient thing to ask to like delve down into it is is a vote for Gary Johnson or Jill Stein a vote for Donald Trump, right? or is it incumbent on the person to vote their conscience? Now, as a student of history, I often I know",
      "start": 2675.2
    },
    {
      "text": "delve down into it is is a vote for Gary Johnson or Jill Stein a vote for Donald Trump, right? or is it incumbent on the person to vote their conscience? Now, as a student of history, I often I know exactly how elections are engineered from a very microscopic and molecular level. I know exactly how it works and and I I've been fascinated by it since I was a very little kid and but I used to be very pragmatic being like you can't vote third party because there are no there was actually no room for them. I used to even argue because in college because I'm like there really is only yes or no, right? pro-life or pro-choice, right? Pro-war, anti-war, free trade, not free trade. Like, there's not that much gray area except when you put them all together. Yeah, that's an amalgamation problem, right? Yeah. And so, my theory now is that **** that. I don't give a **** who wins out of those two. If if if my vote for Johnson, I'm going to go vote for Gary Johnson as a vote for Trump, then so",
      "start": 2717.92
    },
    {
      "text": "Yeah. And so, my theory now is that **** that. I don't give a **** who wins out of those two. If if if my vote for Johnson, I'm going to go vote for Gary Johnson as a vote for Trump, then so be it. Like, I'm voting for my man. As long as we keep telling ourselves that we have these two **** choices over and over and over again, it will never ever change. And we have to start like peeling into that we deserve better than the **** sandwich we've been served and I'm not going to take part in it. So if I have a de facto vote for Donald Trump, so be it. I did not pull the the the lever for Donald Trump. I do not like Donald Trump and if he wins because I didn't vote for Hillary Clinton. I would never vote for Hillary Clinton ever. Ever. So she is not losing a vote for me. You know what I mean? I will never I want to reiterate that ever vote for Hillary Clinton. Maybe that's the answer to your question, Colin. Uh maybe it's not. Maybe voting your conscience isn't binary. Maybe voting",
      "start": 2765.12
    },
    {
      "text": "mean? I will never I want to reiterate that ever vote for Hillary Clinton. Maybe that's the answer to your question, Colin. Uh maybe it's not. Maybe voting your conscience isn't binary. Maybe voting your conscience is simply a matter of testing your conscience and going, I want to vote for this person because I believe they're the best candidate. Or I want to vote for this person because I believe that will keep the lesser of two evils or whatever. They're both questions of conscience. You know, I if just be if you vote for a third party candidate because you think they make the best president, that's a choice of conscience. That's that's a great choice to make. If you vote for one candidate over another, even though you don't particularly like one of them, but you think the other one is the coming of the dark apocalypse, that's also a vote of conscience. There are different weighings of your conscience, but they're both made for the same reasons, and I so I'm not sure that they're",
      "start": 2804.64
    },
    {
      "text": "the coming of the dark apocalypse, that's also a vote of conscience. There are different weighings of your conscience, but they're both made for the same reasons, and I so I'm not sure that they're mutually exclusive. Um, in my case, this is an easy election for me. I I I like Hillary Clinton. Um so this is going to be an an easy vote for me. I do understand why many people are are vying with frustration about candidate two candidates that they don't like. Um for me, were I faced with a situation where I had uh uh Mr. Trump as one candidate, somebody that I genuinely think would make a a a historically terrible president. That's personal belief. And another candidate, let's take Mrs. Clinton out and pops out. Let's let's say George Wallace is the other candidate, you know, and and and George Wallace who was a horrible racist pig in many many ways. Uh at least at least during the early parts of his political career and I I can't speak to his heart later. Looking at both of those",
      "start": 2845.28
    },
    {
      "text": "George Wallace who was a horrible racist pig in many many ways. Uh at least at least during the early parts of his political career and I I can't speak to his heart later. Looking at both of those people, you know, suddenly third party candidate looks more appealing to me. And I get how some people feel that way about it, but like you say, there's no univers. I don't think I can vote for Donald Trump. And if I was looking at a terrible candidate and a bad candidate, my odds are my choice of conscience would be to vote for the bad candidate most of the time. In this case, I don't feel that way. I actually don't feel Mrs. Clinton don't think Mrs. Clinton's a bad candidate. So, I'm having an easier time with this election than many people. I feel like I'm with you in the sense that I my vote would be for the better end result and even if I don't necessarily love one or the other, but what what's interesting to me is talking about the fact that we are in in the place that we are uh with",
      "start": 2891.76
    },
    {
      "text": "would be for the better end result and even if I don't necessarily love one or the other, but what what's interesting to me is talking about the fact that we are in in the place that we are uh with Twitter and news being how it is and all this stuff where Colin you backing this guy is instantly going to mean that all of your followers are now going to be aware of him in a way that they weren't before necessarily. Um, and I think that if there's more views out there, maybe the numbers can change enough, you know, and I think that that's kind of the the the real question where you're talking about the thing of conscious where it's like where's that tipping point of that being enough to make the third party enough to disturb this whole thing, you know, to disrupt the system that we have because I do think that it's choosing the lesser of two evils, but then if you introduce a third option, you need to be able to back that third option enough to make it disrupt things in a way thinking",
      "start": 2938.16
    },
    {
      "text": "I do think that it's choosing the lesser of two evils, but then if you introduce a third option, you need to be able to back that third option enough to make it disrupt things in a way thinking towards the future, thinking towards trying to make things better instead of just trying to make a point against the other two, you know, but like how do you get there without pushing it, you know? Is it maybe this time you voting for him and you, you know, rallying and pushing for him and believing in him is going to, if that brings Trump, I that's a bad thing. But is it going to, you know, set it up for 4 years from now that more people are going to be like, \"Huh?\" And then more people four years later and then maybe in 10 years get to a point where it is a little bit easier to come up with the choices of this or that. But right now, I personally believe that it's like it is a lesser two evils thing. And it's just like the Trump is just bad news. Yeah. That's my thing is I'm voting against",
      "start": 2983.68
    },
    {
      "text": "choices of this or that. But right now, I personally believe that it's like it is a lesser two evils thing. And it's just like the Trump is just bad news. Yeah. That's my thing is I'm voting against Trump. That's what I'm casting my vote for. And so I'm I'm going to cast it for Hillary who I really don't have a opinion pro or con on. I'm not positive or negative on her. She's just Hillary Clinton's what she always done. Did this email thing. All right. Whatever emails. Uh like my hope isn't so I mean like I I feel I feel you on the third party hopefully that you know you'd support him here and then the domino effect and it would all change and d I feel like we've had granted nobody I don't think in terms of like a system somebody shaking up the system like Bernie Sanders or whatever like that was a ground swell that was a big deal this time around. Granted, not third party traditionally, but I'm talking about outside of the normal thing. My hope is that what we've seen in this",
      "start": 3030.24
    },
    {
      "text": "like that was a ground swell that was a big deal this time around. Granted, not third party traditionally, but I'm talking about outside of the normal thing. My hope is that what we've seen in this election cycle and I've talked about before is that four years from now, whoever the incumbent is versus whoever the up and comer is, the up and comer should every I mean from here on out hopefully, knock on wood, politics start to the as usual start to fade away and it's going to be a bunch of people like I'm a normal guy. I'm a normal person. Here's what it is. I will tell you what I'm feeling. I will tell you what's going on. taking the lessons learned from this of Trump being one extreme, Bernie being the other extreme like I'm the moderate normal guy. You know what I mean? I believe this and that and I'm not going to get caught up in this and I don't want to yell at him. Why would we, you know, like you hope that that's whoever the incumbent is is up against next time cuz right now it is",
      "start": 3068.88
    },
    {
      "text": "that and I'm not going to get caught up in this and I don't want to yell at him. Why would we, you know, like you hope that that's whoever the incumbent is is up against next time cuz right now it is this weird thing of Hillary is that still this holdover I feel from like the president we've seen all the time of just saying what they need to say to get elected, you know, carpet bagging, do whatever. And then Trump is the I'm popular because I say whatever the **** I think, but I say I think crazy things and I say it all the time. And it's like **** can't we have a normal person who says what says what they think? That's that's an interesting observation, Greg. The the idea that I mean the thing that drives me crazy about Donald Trump is that he is in a very perverse way addressing very real problems. Um he he he looks at widespread unemployment and a ground swell of anger at economic frustrations and then proceeds to offer not even I wouldn't he offers uh blame described as",
      "start": 3105.92
    },
    {
      "text": "very real problems. Um he he he looks at widespread unemployment and a ground swell of anger at economic frustrations and then proceeds to offer not even I wouldn't he offers uh blame described as solutions or disguise probably blamed disguised the solutions to that which is the element that I find that I find corrupt. I do think that the that the the that the racism and the the Islamophobia and the is is is perverse uh and and very frustrating, but at heart the fact that a bunch of people in America feel disenfranchised is a very real problem. It's just not the right answer to it. Um I think Mrs. Clinton is I think in a lot of ways Mrs. Clinton's a good candidate. Um, I also think what's happening in the campaign has uh has at least forced her in directions where she's realizing she's not going to be able to get through her presidency without addressing some of this. But ultimately, like Greg, I look forward to a future where we're engaging these problems. You know, if enough people",
      "start": 3140.72
    },
    {
      "text": "going to be able to get through her presidency without addressing some of this. But ultimately like Greg I look forward to a future where we're engaging these problems. You know if enough people vote for Gary Johnson does the Republican party or the Democratic party ultimately become more libertarian? Does that happen if they they see that there's an enormous section of the population out there that feels underrepresented? Um maybe I mean I keep holding on hope for what Colin's always talking about the Republican party dying and becoming something new or splitting into two. It's happened. I mean it's so remarkable that the parties haven't died. We haven't had a dead party in in over 150 years. I mean that's that's that's an incredible thing. Parties were coming and going in the first 60 or 70 years of the republic. Like it was **** like no no nobody's business. Like there were million like the federalists and anti-federalists were old news by that was like George",
      "start": 3201.52
    },
    {
      "text": "in the first 60 or 70 years of the republic. Like it was **** like no no nobody's business. Like there were million like the federalists and anti-federalists were old news by that was like George Washington's party and Thomas Jefferson's party they were gone by the 1800s they were gone those men were still watch died in 1799 but Jefferson was still alive when that when that when that party was dead of that was the self-defin that was taking place the fact that the country was still defining what it was I mean we think of you know we think of the United States of America as as a as a single unified entity there were a lot of questions about what that was you know this better than anybody you know just were we the United States of America or the United States of America? Which inflection were we? Those questions were questions those parties were struggling with. Uh and ultimately were decided in the very infancy of the Republican party. Um and but parties instead of dying  you're",
      "start": 3242.96
    },
    {
      "text": "were we? Those questions were questions those parties were struggling with. Uh and ultimately were decided in the very infancy of the Republican party. Um and but parties instead of dying, you're right, they have changed. They've changed tremendously. They've changed radically, but like they haven't changed completely. That's the one thing everyone's like, they changed choices. I'm like, no, they didn't. Not completely. They're but they have changed. the Republican party. If you asked an uneducated person that didn't know anything about politics, like which party freed the slaves and which party had the slaves? Yeah. They'd be like, \"Oh, the Democrats freed the slaves.\" I'm like, \"No, the Democrats were the **** slave owners.\" No. Southern Democrats are the reason Jim Crow survived as long as it did. It's just true. Yeah. And and and they were the one, you know, the Democrats while George Wallace was a **** Democrat. You know what I mean? Like Yeah. And that's the that's the thing",
      "start": 3281.16
    },
    {
      "text": "as it did. It's just true. Yeah. And and and they were the one, you know, the Democrats while George Wallace was a **** Democrat. You know what I mean? Like Yeah. And that's the that's the thing that always that's the thing that always got me. I'm like how did we let this happen? Although our party and I'm not a Republican anymore. I left the party, but I always wonder I'm like how the **** did we let that happen to us? I I think Yeah that that's a long complicated tale. I I think LBJ and the Southern Strategy. Exactly. The Democrats changed. I mean, that's a lot of it. And the Republicans didn't adapt along with them. Uh yeah, LBJ kicked as much of a jerk as that guy could be. He kicked that door down. Uh kicked it wide open and it could never close again. Yeah. So, so I I think the the reason I want to bring this up is not only because she asked or whatever and I think it's an interesting topic, but it really does come to to the for this this particular election cycle. It",
      "start": 3318.96
    },
    {
      "text": "the the reason I want to bring this up is not only because she asked or whatever and I think it's an interesting topic, but it really does come to to the for this this particular election cycle. It doesn't have to be Gary Johnson or Jill Stein. I don't really give a **** who you vote for. It's just that I don't know no longer buy into the notion that you have to vote against an idea. You should vote aspirationally for the person that you think would be the best president. Now, I think that there are I can name you 10 people that I think would be a better president than Gary Johnson very easily, including Mitt Romney who I cannot **** believe didn't get involved in this election because he would have won. I want to reiterate that he would have won and it wouldn't even been close. So, because Hillary Clinton's, we could talk about Hillary Clinton as being, you know, so obviously she has her supporters. She 65% of Americans say they they don't trust her. How can we have a president",
      "start": 3354.8
    },
    {
      "text": "because Hillary Clinton's, we could talk about Hillary Clinton as being, you know, so obviously she has her supporters. She 65% of Americans say they they don't trust her. How can we have a president that 65 65 out of 100 people in the United States don't even trust? You know, like she we now as a New Yorker, as a as a Rockefeller Republican old school Paleocon New Yorker, I have a **** huge grudge against Hillary Clinton. And that's and that's well documented. Of course, she is a **** opportunist. She has done nothing of note. She is she is who she is because of who she is **** married to. And she doesn't have we don't believe in dynastic **** **** in the United States. I don't think it'll be a senator and the secretary of state. She was given would she have been elected senator if she wasn't Bill Clinton's wife? Would she would she have would she have run for president if she wasn't Bill Clinton's wife? And if would she have been Secretary of State if she wasn't Bill",
      "start": 3391.6
    },
    {
      "text": "if she wasn't Bill Clinton's wife? Would she would she have would she have run for president if she wasn't Bill Clinton's wife? And if would she have been Secretary of State if she wasn't Bill Clinton's wife? Those are the whole sequence of events that I'm talking about. She she's a smart woman, an interesting woman. You know, maybe would have been an interesting politician was elevated because of the popularity of her husband. Now, there's not that's opportunism was successful because of the capabilities she had when she took advantage of those opportunities. Sure. I'm not I'm not taking away that she was secretary of state which is a immensely important position and I'm not taking you know I was in New York when she when she won I I get but I mean the death of the Rockefeller Republicans is in is is a bad thing for Americans. Yeah it is. what people don't and that's the other thing that's so frustrating about like we've lost Republicanism and that's why I left the party and people",
      "start": 3430.32
    },
    {
      "text": "is in is is a bad thing for Americans. Yeah it is. what people don't and that's the other thing that's so frustrating about like we've lost Republicanism and that's why I left the party and people are going to read my post on Facebook about why I left but New York was dominated by Republicans at times and and like we were normal people like Long Island still has Republicans and upstate still has Republicans but we lose every election now because we don't control the New York City and we never really control New York City but like the Rockefeller Republican strand was a moderate Republican strand we had George Pataki was a moderate Republican governor when I was a Long Island was represented by moderate Republicans like King, you know, like the we've lost sight of that because we have these the we have these parties running to the edges um with Bernie Sanders and with Donald Trump where it's not in a safe place. And I think the only way to recalibrate the system is not to accept that",
      "start": 3465.84
    },
    {
      "text": "the we have these parties running to the edges um with Bernie Sanders and with Donald Trump where it's not in a safe place. And I think the only way to recalibrate the system is not to accept that that is normal. It is not normal. It says a lot about us that Hillary Clinton and Donald Trump are our nominees. It says a lot about us. Now, we see with the DNC leak that they really tried to engineer this in a way that would make her lo make her win. And I still have on the mind that Sanders would not be Trump cuz I'm not of the mind that Clinton's going to be Trump at this point. Yeah I I'm not going to predict the future on this one. I think either one of them could win it. Oh it's I think it's I think it's going to be a coin toss at the very very end. 538 which is Nate Silver's website which is a very wellrespected pollster uh polling website and prognosticator of politics has it at 55% Trump right now. now. Now which is I never thought I'd see the day when it would",
      "start": 3508.88
    },
    {
      "text": "website which is a very wellrespected pollster uh polling website and prognosticator of politics has it at 55% Trump right now. now. Now which is I never thought I'd see the day when it would be anything but like 10% Trump. I thought that Pennsylvania is even in play. I I don't know what to do with I I feel like I It's like the the Zoolander thing. I feel like I'm taking crazy pills. I you know I don't know. It's It's an unbelievable stretching of the map that Trump's doing. Mike Pence was not a smart move, but it puts the rust belt in play. There's a lot of political strategy going on with these guys for sure. But I just feel like we deserve better. And I guess that's that's what I'm saying is, you know, vote. I want to encourage people to vote their conscience. Vote for the the person you think should be president and send a message. There's going every vote you have has unintended consequences. You know, there is blowback on everything we've ever done in in electorally. Um but",
      "start": 3543.28
    },
    {
      "text": "you think should be president and send a message. There's going every vote you have has unintended consequences. You know, there is blowback on everything we've ever done in in electorally. Um but I don't buy the argument that we have to vote against lesser two evils or we're going to keep finding ourselves in these positions until good people run again. And we might, you know, I don't know Hillary Clinton and Donald Trump personally. They both might be very good people, but they're not my definition of good people running for president. They're not, you know, and um I'm concerned about it. I'm like I'm really concerned about it. It's not that I'm like rah Gary Johnson cuz I'm really not. I've known about Gary Johnson for many years. Gary Johnson was a very popular Republican governor of New Mexico. He's been bouncing around for a long time. Um and he has some ideas that I agree with and some ideas I don't. And I agree with you that Donald Trump is is is specifically talking about",
      "start": 3582.08
    },
    {
      "text": "of New Mexico. He's been bouncing around for a long time. Um and he has some ideas that I agree with and some ideas I don't. And I agree with you that Donald Trump is is is specifically talking about things that need to be talked about, just not in a way that's eloquent or appropriate. I'd say beyond appropriate. I mean that that's I Donald Trump you you we talked about Thurman then we talked about Wallace. We're talking about a person who contextualized against their age is advocating ideas everybody is egregious. That that's the problem there. Um and that that's the part that keeps sticking in my crawl. I don't know if I'm thinking with my head or my heart on this one. I think it's I think it's stuck in my throat right in between. But I know I'm choking when I think about it. and that it's just too familiar. There's just this little echo. I keep hearing this when I when I listen to Mr. Trump speak. It's that voice in the back of my head echoing from high school civics class",
      "start": 3617.84
    },
    {
      "text": "that it's just too familiar. There's just this little echo. I keep hearing this when I when I listen to Mr. Trump speak. It's that voice in the back of my head echoing from high school civics class watching watching this the the the floor the the Senate hearings and just hearing have you no decency at long last. Have you no decency running through the back of my head and and uh Google that guys if you don't know what I'm talking about. But it's it's worth looking up. Yeah. And I I think just to and I know you want to wrap up, but I I I think you know to Trump like I think they both have interesting things to say. I think Trump has every right to speak on free trade which has screwed manufacturing in this country which by the way was part partly the fault of Bill Clinton. Um and I think and I think that he's he's appealing to those people. I also like I don't I don't necessarily think that free trade is always a good idea. I don't. And and we have so like he speaks to that. I don't",
      "start": 3660.6
    },
    {
      "text": "and I think that he's he's appealing to those people. I also like I don't I don't necessarily think that free trade is always a good idea. I don't. And and we have so like he speaks to that. I don't I think we have a massive illegal immigration problem in the United States. Like absolutely. I think we have every right to control our border and I think we have every right to tell people that aren't that aren't supposed to be here that they shouldn't be here. I think that that's totally fine. You can have a respectful way to talk about that, you know, like and on the other side, Hillary Clinton is just eating it all up, but she's not being strategic enough and she's changing her mind on on left, right, and center because of Bernie Sanders and what he did. So, it's it's a complicated issue. I will say this to your point about what Trump reminds you of. There's a lot of hyperbole out there about Trump reminds people of Hitler and and this remind and I'm like you really have no idea what",
      "start": 3706.24
    },
    {
      "text": "I will say this to your point about what Trump reminds you of. There's a lot of hyperbole out there about Trump reminds people of Hitler and and this remind and I'm like you really have no idea what the **** you're talking about. But the like the United States in 2016 is not Germany in 1933. Germany 1933 was suffering from hyperinflation. They had just lost a humiliating war. They had no jobs and there was like a bunch of actually two two out of three of those sound kind of familiar but not not nearly to the extent that it was going on in Germany and there was also a mythos and a lore there about the stab in the back and the November criminals and there was a a bent on eugenics and anti-semitism and all that **** was embedded in Germany. It's a very complicated scene in Nazi Germany or in in in Weimar Republic Germany that led to to to led to the kind of perfect storm of him becoming chancellor in 1933. And I'm not saying that that you know like there there isn't some",
      "start": 3745.28
    },
    {
      "text": "Germany or in in in Weimar Republic Germany that led to to to led to the kind of perfect storm of him becoming chancellor in 1933. And I'm not saying that that you know like there there isn't some comparison. I'm just saying when people are like it's going to turn into a Nazi. I'm like no it's not. It's not. I'm sorry it's not. If Trump becomes president it's not going to turn into a fascist dictatorship. It's not gonna happen. But there was something that he said that I thought was so interesting. And I want to end it on this that I was like, \"Huh, this sounds like Hitler.\" And it was not something that I don't think a lot of people picked up on because people weren't listening closely and they were just whatever was that he talked about, \"We suffered humiliation after humiliation.\" And I was like, \"That sounds like Hitler.\" You know, that's what he prayed upon, the nivism and the nationalism. Um and that's the **** you have to be scared of. So does Trump have some fascist",
      "start": 3788.64
    },
    {
      "text": "And I was like, \"That sounds like Hitler.\" You know, that's what he prayed upon, the nivism and the nationalism. Um and that's the **** you have to be scared of. So does Trump have some fascist tendencies? I think so. Uh does he have some totalitarian tendencies? Yes. But the system will not allow for that to happen. It won't. So unless the system is uprooted like it's just it's a totally different kind of thing. So I want people to keep things in a context as well. Should Donald Trump get elected and I hope that that doesn't happen and I don't want that to happen. We will survive it. You know, we will. But so it's important to keep things in context and to keep things realistic as well about how we can combat realistic problems as opposed to making a mountain out of a molehill. That man is clearly a bigot and that man is clearly a sexist and he's clearly a racist, but he's not Adolf Hitler, you know, and uh so we have to keep those in in mind as well. Nonetheless, vote your",
      "start": 3827.64
    },
    {
      "text": "That man is clearly a bigot and that man is clearly a sexist and he's clearly a racist, but he's not Adolf Hitler, you know, and uh so we have to keep those in in mind as well. Nonetheless, vote your conscience. If you want to vote for Hillary Clinton, vote for Hillary Clinton Johnson, Jill Stein, even if you want to vote for Trump. I'm no judgments here. Um but I say we got to get out of this system and the only way to break this two-party system, the only way to break this ideas of yes or nos or less of two evils is to start showing that we **** mean it. And we got so close with Ross Perot. And I think we can have another moment like that. I do think Gary Johnson will be on that stage and I think that he just has to reach 15% in aggregate polling and he'll be on that stage and that's going to show everyone that there's a third choice. There's a good chance he's going to get there, too. And the crazy thing is is that they're both polling so low that if he can peel off a fourth of",
      "start": 3874.08
    },
    {
      "text": "going to show everyone that there's a third choice. There's a good chance he's going to get there, too. And the crazy thing is is that they're both polling so low that if he can peel off a fourth of each of their voting block, he could win. You know, now he's not going to win, but it's it's aspirational. So, you know, I wanted to bring that up. I'm glad I'm glad we got to talk about it. Uh but just remember to vote or you have no right to talk about any of this at all. This episode is brought to you by Loot Crate. Loot Crate is a monthly subscription box service for Epic Geek and Gamer and Pop Culture gear. For less than $20 a month, you get four to eight items that include licensed gear, apparel, collectibles, unique one-of-akind items, and more. Make sure you head to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on a new subscription. Loot Crate is more than just a subscription service. It's an entire community of fans that share their experience and",
      "start": 3911.2
    },
    {
      "text": "and enter the offer code Kinda Funny to save $3 on a new subscription. Loot Crate is more than just a subscription service. It's an entire community of fans that share their experience and interact with each other around the unboxing of each month's crate. And they guarantee more than $40 in value in every crate. Sometimes it's a lot more. Every month there's a different theme and all the items are curated around that theme. Previous crates have included things from franchises like Star Wars, Marvel, The Walking Dead, The Legend of Zelda, and many more. From bad guys doing good things for the wrong reason to good guys with questionable tactics, August is the perfect time to explore the anti-hero. Hero. I added that echo for you, Kev, because they put it all in caps. They didn't put the echo. They just put anti-hero. So I did echo for you, Kev. Walk the hero villain line with this 100% exclusive collection of items from DC Comics, Archer, Darkhorse, and Kill Bill that includes two",
      "start": 3947.88
    },
    {
      "text": "echo. They just put anti-hero. So I did echo for you, Kev. Walk the hero villain line with this 100% exclusive collection of items from DC Comics, Archer, Darkhorse, and Kill Bill that includes two great collectibles, a wearable, and of course, our monthly t-shirt. And don't forget the pin. Remember, you only have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crater when the cut off happens. Jack, that's it. It's over. So go to lootcrate.com/kindafunny and enter the offer code Kinda Funny to save $3 on your new subscription today. Jared. Yes, my friend. Last week on the GameOverGreggy Show, I went out on a limb. All right. And I said something that angered a lot of people. Uh oh. Set the world on fire. Really? Broccoli. That shit's good. Today I have a similar followup. All right. Here we go. Music. That shit's good. I'm with you. See, know I we do these music conversations every so often here. We One of the famous topics we did here was where we",
      "start": 3987.28
    },
    {
      "text": "a similar followup. All right. Here we go. Music. That shit's good. I'm with you. See, know I we do these music conversations every so often here. We One of the famous topics we did here was where we raided uh five different things. video games, reading music, some two other things. Great. My music was way down there. Music was way down there for me. We've done music recommendations before. I'm like, I don't know. Weezer going to see Weezer Sunday. Very excited. Post fly in from Chicago. Um that's all well and good, but a few months ago now, Jared Petty, my Apple Music, I was doing that the free trial. Yeah. And it stopped. Okay. I was like, ah, **** And I'm like, I don't want to give you Apple Music was fine, but I know Colin's always talking about Spotify. Yeah. So I joined up with the Spotify. Okay. Started using that service. You're booing Spotify. Yeah I'm not a Spotify fan. We've been through this. Keep going. Join up with the Spotify. Way more impressed with than I am",
      "start": 4032.88
    },
    {
      "text": "the Spotify. Okay. Started using that service. You're booing Spotify. Yeah I'm not a Spotify fan. We've been through this. Keep going. Join up with the Spotify. Way more impressed with than I am Apple Music because it's just beaming. It's my phone. It's my iPad. It's the computer. It's the PS4. I turn on one of them. It's like, \"Oh, you're already listening on another one. Do you want to listen here?\" I'm like, \"Yes, or no, maybe. I don't know. It depends on what it is. Whatever you want.\" However, I've been getting around with this music now and I've noticed today it is now a crucial part of my day when before it never was. I I like music here and there. I had a song. I I you know I buy I'm so glad to hear that. I buy all the Nashville stuff because I want to support the TV show Nashville. CMT, what up? Thank you for your help. Uh support Nashville. I buy all the albums for that. I have all my Weezer stuff. I have my Taylor Swift stuff. So it used to be I'd get on the planes or do",
      "start": 4075.04
    },
    {
      "text": "CMT, what up? Thank you for your help. Uh support Nashville. I buy all the albums for that. I have all my Weezer stuff. I have my Taylor Swift stuff. So it used to be I'd get on the planes or do whatever. I walked to the grocery store. I listened to what I had on my iPod and it was great. Okay, good. But now with this Spotify thing, I'm getting this Lana Del Rey girl I've never heard of. She had a song about video games. Put her in like hell. It's not video games called video games. It's about her **** some guy that plays video games. Delray is fan fuckingtastic. I Well, I was I was I was listening that with somebody else and the other day and I was like, are all her songs like this? Cuz I had no idea what they were. And no, they are kind of they're all that like I thought it was like somebody doing like a bassy thing. Each album has a different vibe, a different kind of uh subgenre to it, right? Um I really like her a lot. A lot of people dislike her because she's kind of",
      "start": 4107.76
    },
    {
      "text": "like somebody doing like a bassy thing. Each album has a different vibe, a different kind of uh subgenre to it, right? Um I really like her a lot. A lot of people dislike her because she's kind of mainstream for being that kind of singer songwriter type. Um I I think that that's rubbish. She's amazing. I I love her her style and her uh zero **** given attitude that is really clear from her music. Okay. And um I I'm a big fan of uh Born What? Born to Die. Born to Die. Yeah exactly. That album video games that Yeah exactly. That album's so good. It kind of has a a nice hip-hop vibe without the rap to it in terms of the the production of the the beats and the instrumentals. Um it has a nice orchestral feel um that I really appreciate. Her newest album or ultraviolence and then she had one after that. Um both of those are a bit more of the alt rocky feeling. Sure. Um I'm a little less into those. But having said that, it's still still fantastic and she is still amazing. And uh all I've never",
      "start": 4141.76
    },
    {
      "text": "that. Um both of those are a bit more of the alt rocky feeling. Sure. Um I'm a little less into those. But having said that it's still still fantastic and she is still amazing. And uh all I've never heard a song from her that I dislike. Yeah. Sorry. That's fine. I don't care. I I I like yeah. Don the Del Rey and the video game song. I listen to some other stuff. I didn't it didn't make it to my list. That's how you know I like you. I listen to this and then if I hit the little plus button you get added to my little my Day the Races is my my song. That's the jam from Lana Del Rey. Off to the races. Off to the races. Off to the races. Day the Races is that I'll look into it for you. Is it off the Born to Die? Yeah. Track two. Okay. I'll look into it for you. So you're getting into some of my things here. But so I want to know about your rituals with music cuz now what I find here's what I do every day and it's going to sound dumb. I don't care. It's my ritual. I like it a lot. I",
      "start": 4191.52
    },
    {
      "text": "of my things here. But so I want to know about your rituals with music cuz now what I find here's what I do every day and it's going to sound dumb. I don't care. It's my ritual. I like it a lot. I wake up. I walk the dog feed the dog cuz he sucks. Usually sit around till 9:15 10:45 whenever Kevin decides to **** poof out of the middle of the air so I can buzz him in the goddamn house. What? It's true. Is it Am I wrong? I I can't shower till you get get to the house. Am I wrong? Say something. You're going to talk **** for a second then you realize it's true didn't you? Got you dead to rights boy. Anyways do whatever this is I have to do. But when it's time to shower I'll go or brush my teeth. Go in there. All that stuff. I go in there with the iPad because I bought one of these waterproof speakers back when I when I was down this thing. Put it up. Piece of garbage. I had to be like really close to it for the Bluetooth. Now granted I bought the $0 version. Had to be",
      "start": 4232.16
    },
    {
      "text": "these waterproof speakers back when I when I was down this thing. Put it up. Piece of garbage. I had to be like really close to it for the Bluetooth. Now granted I bought the $0 version. Had to be close to the thing or whatever to play off my iPhone and it finally just broke or whatever. We used to use it for calls. Remember Tim you and I would go take calls on it. I didn't like it at all. And then I got another one at VidCon. I can't even figure out how to connect the goddamn thing cuz I'm apparently 75 years old. So I was like, \"Whatever.\" But I noticed when I take the iPad in there the speakers on the iPad are really good. And if I put it in the corner if I put it in the corner next to my sink it bounces off all the walls and it's really loud and it's perfect. I like that. So I go in there I put it on put on either my songs maybe one of these I like the acoustic coffee house playlist or whatever. There's a lot of good playlists where I just find new music put a pin in",
      "start": 4274.24
    },
    {
      "text": "go in there I put it on put on either my songs maybe one of these I like the acoustic coffee house playlist or whatever. There's a lot of good playlists where I just find new music put a pin in that one put in the corner play do all this stuff right? But then I turn off all lights and I light a candle and I shower by candle light and I like it a lot. Not for the romance of it which is very romantic don't get me wrong but it's like I'm in a spa. I'm listening to good tunes in there. I'm washing up. And this is morning candles. This isn't even starting the day. Start the day. I'm like let's get into a therapeutic space here. And that's important because your your bathroom no window right? Like 100%. Yeah. I shut the door. So So just you close up. You are you are in the darkness. It's you. It's a candle. It's beautiful music. It's the the rush of the water. You got that soapy lather all over you. Do you ever like scrub along with the rhythm? No. No. No. No. Do you sing",
      "start": 4304.48
    },
    {
      "text": "It's you. It's a candle. It's beautiful music. It's the the rush of the water. You got that soapy lather all over you. Do you ever like scrub along with the rhythm? No. No. No. No. Do you sing along? If it's a good song. Yeah. A good song. Like what's the last song you sang along with? Oh I've sing along with I mean if I know the song I'm singing along. You're singing along? Okay. So yeah. Okay. So it's a Do you ever do you ever change the music in the shower? Do you ever get angry get out of the shower and change the track? No that's not because it's over on the other side there in the corner tucked away. And again usually it you know if it's playing off one of the playlists it's going to be gone soon enough. And if it's in my song file it's usually good. See that's one of the keys to a long and successful marriage is work out the mutual music rules early. I've learned like because like you're on a road trip you got the playlist there on your phone or you've got it however",
      "start": 4340.24
    },
    {
      "text": "to a long and successful marriage is work out the mutual music rules early. I've learned like because like you're on a road trip you got the playlist there on your phone or you've got it however you've got it arranged or even if it's just the radio stations if you're if you're traveling on a long trip. No being able to be with somebody who syncs up with you musically not just the type of music you listen to but important factors like hey do you skip ahead in the middle of songs you don't like? Do you keep doing that? Do you change the station every time a new song comes up? Are you somebody that has a playlist prepared and is compatible with that idea? Or do you just want to put it on random and jump around? These are the burning questions you need to work out before you agree to spend the rest of your life with someone because if you don't you will regret it. And you stumble on something. This is when I knew ladies and gentlemen that I had gone from a Spotify Padawan to a",
      "start": 4371.04
    },
    {
      "text": "spend the rest of your life with someone because if you don't you will regret it. And you stumble on something. This is when I knew ladies and gentlemen that I had gone from a Spotify Padawan to a Spotify Sith Lord. And I'm pretty sure that's how it works. Wow. Jedi Treky. I went to the red don't have Padawan. I went I'm sorry Padawan to a red shirt on the Enterprise. I knew this when I woke up one day and I was in a mood and I wanted music to fit that mood and I made a playlist to go run errands and I was like I got it. Spotify red shirt. How do you feel about that? Making playlist **** playlist cuz I'm all set. I know what I want. I deliver. I wasn't going to go into the cuz sometimes it doesn't work Kevin where you have the bucket of all the songs I like. And sometimes I want to shower by that. Sure. Whatever comes on comes on. But sometimes Kevin I'm in a **** mood. And I didn't for a while I was like well I guess I skip but how do I skip in the shower? What? And",
      "start": 4405.52
    },
    {
      "text": "to shower by that. Sure. Whatever comes on comes on. But sometimes Kevin I'm in a **** mood. And I didn't for a while I was like well I guess I skip but how do I skip in the shower? What? And then I was like wait you can make playlists on Spotify. And I did it. I did it. I mean and I was like I make 11 songs ran my errands all around neighborhood before they burned out. Say Magnafi. Mhm. So what I want to know is your music ritual if you have one. And then the followup question is you know and we can go around and after the ritual I want to know how you discover music cuz these these stations I I what was I listening to today? Listen I guess I was listening my iPhone so it's not sunk up here but I was on one of the new one of these stations I hadn't listened to today right? And I noticed all Oh is acoustic uh not more Oh it's acoustic pop. Acoustic pop. And I I just was adding songs left and right. I'm like, \"All these are good.\" I'm like, \"Maybe I should hang out",
      "start": 4451.04
    },
    {
      "text": "And I noticed all Oh is acoustic uh not more Oh it's acoustic pop. Acoustic pop. And I I just was adding songs left and right. I'm like, \"All these are good.\" I'm like, \"Maybe I should hang out on the acoustic pop more. Maybe I'll shower by acoustic pop tomorrow.\" Yeah. Yeah. So liven it up. Jared Petty how do you discover music? Okay. I discover music I think three different ways. Uh the first way I discover music is I'm a internet radio type service listener. I I I'll give I'll I I have a finely tuned in this case Pandora which is a lot what is a lot of time. And I have my Pandora channels which are only a few but they are they are lovingly crafted into into preferential just these beautiful heaven dreams of exactly the music I want to hear at any moment. And and this is key for me the occasional song that I don't like. And I think it's very important that that something pop in that jars me out and makes me go wait a minute I need to make a value assessment of that. And I love",
      "start": 4489.28
    },
    {
      "text": "the occasional song that I don't like. And I think it's very important that that something pop in that jars me out and makes me go wait a minute I need to make a value assessment of that. And I love that. So one of my one of my discoveries comes through new songs coming in through you might like. So some of it's algorithmic and just being fed music that I I create channels that are tailorade but not too tailor made. I try to keep the parameters a little bit open. So I keep getting new kinds of things. And when I realize I'm hearing the same songs over and over and over that's when I switch and create a new channel and I start the crafting process over again usually with my mood and I'll just listen to that and then I'll switch back around and rotate through. That's one way of discovering. Uh the second way I like to discover music is through this what you and Tim just did. Social interaction with people talking with people about the music you love. It's such a great way",
      "start": 4530.0
    },
    {
      "text": "discovering. Uh the second way I like to discover music is through this what you and Tim just did. Social interaction with people talking with people about the music you love. It's such a great way because music is something it it's if there's real magic in the universe. It's music. It does things to us that it it it emotionally transforms us in ways that no other force outside of narcotics I I can can do. I mean music can make you break down and weep. Music can make you furious and angry. I have been at concerts where I have watched acts of gratuitous violence played out. I think largely because of hours and hours of screaming music and the mood that built in the people around. And I have seen people transformed literally their lives changed in moments that were largely influenced by the music going on around them. In that case I'm thinking in terms of a spiritual setting things that have happened in churches where music is a very important part of what happens even though",
      "start": 4565.44
    },
    {
      "text": "by the music going on around them. In that case I'm thinking in terms of a spiritual setting things that have happened in churches where music is a very important part of what happens even though frankly a lot of Christian music sucks. Um so I think that engagement that testimony people telling you about or playing things for you. Oh my gosh that's talking about music is at least as fun as music. That's why Rolling Stone existed you know that or exists. That's that's that's why you have this whole culture built around it. That's why MTV at one point was around and to this day that that's why you you have social structures built on the internet around sharing music and the channels where people listen to it. So I love that. That's the second way of discovery through human interaction. And the third way because I am an old old man is album covers. I still buy albums. I really do. I actually buy CDs on occasion. I am not cool. I do not have a record player that plays the",
      "start": 4613.76
    },
    {
      "text": "And the third way because I am an old old man is album covers. I still buy albums. I really do. I actually buy CDs on occasion. I am not cool. I do not have a record player that plays the vinyl. Um I don't have anything that plays vinyl. Uh I I uh I grew up around vinyl. My parents had a huge record collection. My love for the fidelity of vinyl extends not to the sound and the ritual of playing the whole album but to the art. I adore album art. I just love it. And records have that huge beautiful album art and it is always so great. So CDs have these miniaturized versions of it. And just because I still enjoy the art that goes into an album even though I realize albums are are are almost an antiquated form of expression at this point. They they are a boutique item. um you know it's all about singles and selling concert tickets now. That's how you do it. But I still love them. And so I will occasionally buy an album just because I see a picture on the internet that I think is",
      "start": 4654.24
    },
    {
      "text": "all about singles and selling concert tickets now. That's how you do it. But I still love them. And so I will occasionally buy an album just because I see a picture on the internet that I think is really cool of an album. I'll go I'll go album hunting. I'll go searching through various websites and find and then I'll read and be like, \"Oh this sounds like the kind of thing I might be interested in.\" And I will just just grab music off that. Sometimes I'll buy a sample track maybe one. Sure. And I do purchase music. I I I'm not a uh not not so into the uh just grabbing music from ever. I like to buy music when the opportunity arises and and so I'll go out and buy that new music uh and buy that new track and if I like it I'll try to buy the album. See that's what I've been doing for a while where when in the occasional I'd be you know in a car or something or somebody else would play a song or I'd hear a song and be like, \"That's really good.\" then I'd go on uh you know iTunes and",
      "start": 4705.84
    },
    {
      "text": "where when in the occasional I'd be you know in a car or something or somebody else would play a song or I'd hear a song and be like, \"That's really good.\" then I'd go on uh you know iTunes and buy the album or whatever because I was trying to I was trying to for a while figure out how to in get new music into my library because it was one of those things where I noticed I was just listening to the same stuff over and over and over and over again. Yeah it's a fun way to do it. I then what what's great when they meet up I I I have to give a shout out for a second to Shooter Jennings one of my absolute favorite contemporary musicians. I discovered him of all places through satellite radio. I used to work on the road before this job. I I drove sometimes 13 14 hours a day for work. Uh yeah I was I repaired IT equipment at 911 centers and I would listen to a lot of satellite radio which introduced me to new things constantly. I discovered Shooter through that man. The album",
      "start": 4746.64
    },
    {
      "text": "Uh yeah I was I repaired IT equipment at 911 centers and I would listen to a lot of satellite radio which introduced me to new things constantly. I discovered Shooter through that man. The album cover on his most recent album is a luck dragon like from the Never-Ending Story holding an M16 and wearing sunglasses. It's I want that. I want a mural of that in my living room. But also Shooter makes good good music. You should all check out Shooter Jenn. Do you have a ritual for music when I say that? Yeah. When you What do you think when you listen to music? When I say, \"How do you listen to music?\" How do I um So I music is an integral without music. I don't want to live. Um I listen to music for hours sometimes at work. When I'm writing in particular I listen to music constantly. I often listen to music in transit. I have long commutes to and from on the bus. I like to listen to music when I'm in the shower but even more I like to listen to music when I'm in the bath. I don't do",
      "start": 4779.28
    },
    {
      "text": "listen to music in transit. I have long commutes to and from on the bus. I like to listen to music when I'm in the shower but even more I like to listen to music when I'm in the bath. I don't do I'm doing the bath thing all that often. You get the nice and clean lay in there soak and listen to great music. And I absolutely have a house cleaning music ritual. That's a very important one. But all of those pale in comparison to the most important one which is the road trip music which involves days of preparation beforehand as you prepare the perfect conglomeration of playlists for every situation and have them right there. The playlist is king. I used to love to make mixtapes mix CDs back when that was a thing. I love crafting a and and forget this random stuff. I want them to come in just the right order so that you can have everything flow and jar and switch at just the right moment. You want to take that kind of slow sad song and immediately follow up with something peppy or",
      "start": 4825.04
    },
    {
      "text": "in just the right order so that you can have everything flow and jar and switch at just the right moment. You want to take that kind of slow sad song and immediately follow up with something peppy or quirky or happy and then follow that up with a little offthe-wall then maybe a pop ballad then maybe something a little more twangy and obscure. I love that. So that's the biggest ritual. Preparing and listening to the playlist before the road trip. Okay. Yep. Going on a road trip tomorrow. Playlist is Where you going? I'm going down to LA. Oh nice. Yeah I'm going to Anaheim. My wife and I have never been to Disneyland. Oh my goodness. Yeah. So yeah you just you just made Tim's day you guys. Well we I I lived in Orlando for years and so I've done Walt Disney World time after time after time after time after time but it's our 15th anniversary so we're going to doing it big. I'm excited about that. So excited. Colin how you discover new music? Um I mean a lot of different ways. I",
      "start": 4866.96
    },
    {
      "text": "after time after time but it's our 15th anniversary so we're going to doing it big. I'm excited about that. So excited. Colin how you discover new music? Um I mean a lot of different ways. I I I always found it I don't want to say strange although it is. I want to say it's more alien to me when someone's like I don't listen to music. I don't care about music. I'm like are you kidding me? How many people have you guys met? A lot. Like over over the years like a lot of people like I don't listen to music. I don't care. I just listen to the radio. I don't I'm like are you kidding me? I've only met one person in my entire life that doesn't like music and that's Kevin Kelloo. Blows my mind. Kevin don't like music. He does not like me. Unless it's Queen. He does not like music. **** love Queen. Does that mean it's a good It's a good choice. But uh so like I was really um I was blessed as a kid to be just be growing up in a very musical household and I was surrounded by music. Um",
      "start": 4903.12
    },
    {
      "text": "Queen. Does that mean it's a good It's a good choice. But uh so like I was really um I was blessed as a kid to be just be growing up in a very musical household and I was surrounded by music. Um my parents love love love love music and my siblings love music and play music and and uh to a degree and everyone played an instrument at some point and and that was instilled in me when I started playing drums. Um so it's always been a really important part of my life and I always discovered music in in various ways. I think that's why I have an eclectic I I think I have like a profoundly eclectic taste in music but I couldn't imagine it being any other way. I remember actually yesterday the Uber driver was like um do you want like is this music okay? And I'm like, \"Yeah I kind of like want to listen to anything to be honest. It's totally cool with me.\" Um so I I feel like I discover music these days um through uh Spotify. Um they have a lot of good discovery tools. I used to use",
      "start": 4938.96
    },
    {
      "text": "want to listen to anything to be honest. It's totally cool with me.\" Um so I I feel like I discover music these days um through uh Spotify. Um they have a lot of good discovery tools. I used to use Pandora back in the day to do the same thing. I'm also just lucky enough to have a lot of musician friends and a lot of friends that a lot a lot of friends that play music or are in music scenes or work at music companies or whatever and and and often expose me to that as well. And since I'm pretty well known with our audience of being a huge music fan a lot of people supply me with a lot of bands that I would have never discovered without them that I listen to now like Activist or um Fair to Midland and a few of these bands where I'm like these are **** really great bands that I would have never even known about um because there's there's such a wealth of music out there. But to me it goes beyond that because um you know music is a fundamental part of my life. I listen to music every",
      "start": 4979.92
    },
    {
      "text": "never even known about um because there's there's such a wealth of music out there. But to me it goes beyond that because um you know music is a fundamental part of my life. I listen to music every day and it's not something that I do passively. Like I have to sit down and listen to it. Um and like really like listen to the music. I get distracted by it all the time when I'm doing supposed to be doing other things because I I love it so much. And um you know if if it was up to me like if someone was like you can only play video games or listen to music. I'd be like I'd listen I'd choose music 100 out of 100 times. Like it would be no there would be not even like I wouldn't even think about it. So what's your ritual then? You listen to it every day and you you have to focus on it. Yeah. I I sometimes when I'm in bed I I just take my headphones and I listen to music for like an hour before I even get out. Um or I'll get up and pee as I often do and then um I'll lay down and listen to",
      "start": 5018.16
    },
    {
      "text": "I I sometimes when I'm in bed I I just take my headphones and I listen to music for like an hour before I even get out. Um or I'll get up and pee as I often do and then um I'll lay down and listen to music or when I I don't really work out too much but I always work out and listen to music and uh clean and listen to music or do work and listen to music or just like chill and listen music. Sometimes I'm just like I really just want to listen to that record or I really just want to listen to this song and what I find myself especially with albums and bands that I'm really familiar with for many years sometimes is that I just I'm like I'm really in the mood for this record and I'll listen to that record for a week like over and over and over again. um because it's so good and I'll find new layers in it and new new uh quirks and I'll realize that the song that I kind of always used to think was bad or like that was okay or was kind of filler track is actually one of the great tracks on",
      "start": 5053.84
    },
    {
      "text": "layers in it and new new uh quirks and I'll realize that the song that I kind of always used to think was bad or like that was okay or was kind of filler track is actually one of the great tracks on the album. Then next year I'll listen to that album really closely again and realize no I was right the first time. Um music's like a dynamic and important thing. It's so **** important and music is primal as hell too. It's it's it's in us. um our want for rhythm and organization and all that kind of stuff I think happens uh is largely played out through music. So um which is why things that are off you know four four measure or whatever is is often jarring for people. Um but I so so I discover in a lot of different ways my rituals are I'm so happy to hear that you are listening to more music. I think Spotify is a fantastic service. Um shockingly good service. I would pay $50 a month for Spotify. Yeah you always say that. Um it's incredible. The quality is great and the and you can make",
      "start": 5089.68
    },
    {
      "text": "I think Spotify is a fantastic service. Um shockingly good service. I would pay $50 a month for Spotify. Yeah you always say that. Um it's incredible. The quality is great and the and you can make the quality like really what you want it to be and the um the selection is fantastic. Like there's only a few things that I really want that are missing and they're and they're slowly whitting it down. Like when they got Pink Floyd and the Beatles I was like yes this was this was like half of the **** equation for me. The only thing they're missing now is like I'd like to listen to Tulle and I'd like to listen to De La Soul and they're not there. And that's basically the only bands I can think of that I really give a **** about. This is the first moment I've thought of Tulle in 10 years is when you said that. Yeah. Tool has I mean I'm not a huge huge huge huge huge huge Tool fan. I'm a Danny Cary fan. I love I love Danny Carrey but was a fantastic drummer. But um you know so so and",
      "start": 5130.0
    },
    {
      "text": "you said that. Yeah. Tool has I mean I'm not a huge huge huge huge huge huge Tool fan. I'm a Danny Cary fan. I love I love Danny Carrey but was a fantastic drummer. But um you know so so and and what I like about Spotify too. So the Police are one of my favorite bands right? I love the Police and and um sometimes I'm in the mood for a record so I'll put on Zenyatta Mondatta or synchronicity or something. But then sometimes I just want to listen to like you know my own playlist of the Police which is an option. And sometimes I just want to go to like the best of the Police and listen to the singles. Um and so like there's all those options there as well. There's just it's such a far cry from the gen from where how we grew up. I used to buy tapes. The first tape I ever bought was MC Hammer. Nice. Whoa. And uh the first you know the first song I wrote I ever remember hearing um uh was uh Wildest Dreams by Moody Blues which is uh not a very it's a well-known Moody Blues song",
      "start": 5167.36
    },
    {
      "text": "Hammer. Nice. Whoa. And uh the first you know the first song I wrote I ever remember hearing um uh was uh Wildest Dreams by Moody Blues which is uh not a very it's a well-known Moody Blues song but well after they were popular. I remember sitting in the back of my mom's Crown Victoria when they had just bought it. I was like or 3 years old. I remember like this song is awesome. Um and ever since then it's just been I just been infected with it. I used to buy so much music dude. Like a lot of tapes and then a lot of ton of CDs and I'm so glad we don't live in that world anymore. But I still want musicians to like get their money which is why I'm like Spotify should be should be and will be I think way more expensive than it should be. Hopefully there'll be tears right to kick it back to other people. Tim what's your music ritual? My ritual it's kind of similar to Colin's uh to an extent in that it is a very active experience. When I listen to music I'm listening to music.",
      "start": 5202.0
    },
    {
      "text": "to other people. Tim what's your music ritual? My ritual it's kind of similar to Colin's uh to an extent in that it is a very active experience. When I listen to music I'm listening to music. That's it. Um I can't work while listening to music. That's so foreign to me. And I it's it's not even to say that it's distracting. It's like that's kind of the that's not even right. Like music to me is the it's the focus. Um the idea of multitasking doing something while music is playing is just beyond me. I I'm not even capable of it. Like I I really like to just lay on my bed put some headphones on and listen to an album front to back. And that I I it's more than just listening to it. It's listening to it and then thinking about it after and then listening to it again based on the thoughts that I had the first time. And like kind of like growing and experiencing it. And like I'm in a I'm really weird when it comes to to music and the way I do. I think ritual is actually a very apt",
      "start": 5242.56
    },
    {
      "text": "that I had the first time. And like kind of like growing and experiencing it. And like I'm in a I'm really weird when it comes to to music and the way I do. I think ritual is actually a very apt um thing to discuss for me because my ritual with music is um discovering an artist and that usually comes from the internet somehow or from it usually comes from another one of my loves the internet being one of them video games being another things like that right where I to this day I still go on message boards to find music like I read what people are talking about what people like what people don't like and go from there and find people that have similar tastes to me that leads is to an artist I like. When I find the artist I like then I'm like \"All right if I like them people that like them who do they like?\" And I kind of go from there. Once I find that artist I will just go down the rabbit hole of if there's a song I like find the album I like go from there. But I like to buy",
      "start": 5290.24
    },
    {
      "text": "them who do they like?\" And I kind of go from there. Once I find that artist I will just go down the rabbit hole of if there's a song I like find the album I like go from there. But I like to buy it the actually ripping the CD. That's the whole process to me. So that's part of the ritual is actually physically ripping the CD. And I feel like I just there's something about getting intimately familiar with the with how many tracks are on this album you know naming it like renaming all the files to make sure they're they're all named correctly. Like there's something about that learning process of understanding why tracks are ordered the way that they are and like thinking of the music as really an art form and as something that has a lot of thought put into it instead of just on a song by song basis. Um you brought up the album art earlier and being attracted to album art and being like \"Oh I'm sold.\" I think that's such a simple and brilliant thing because if you're",
      "start": 5333.92
    },
    {
      "text": "on a song by song basis. Um you brought up the album art earlier and being attracted to album art and being like \"Oh I'm sold.\" I think that's such a simple and brilliant thing because if you're attracted to it chances are somebody put a lot of thought into that. And um more often than not I appreciate albums as opposed to singles. And I think that people that have um artwork that is thought out is a sign of a good album or is at least a sign of an album that was thought of and conceived as an album. and respect that you do. And I feel like that is the thing that I'm that's my ritual with the music. Um I feel like I would rather be intimately familiar with a few artists than just kind of familiar with a whole bunch of them. Interesting. Interesting. Um and that's it's funny for me cuz I'm Mr. Millennial and I'm Mr. you know downloading **** and whatever. And that's not to say I don't have thousands of songs on my computer you know but um I am a big fan of not using",
      "start": 5375.6
    },
    {
      "text": "for me cuz I'm Mr. Millennial and I'm Mr. you know downloading **** and whatever. And that's not to say I don't have thousands of songs on my computer you know but um I am a big fan of not using playlists. I like having all of my music on my phone and I like curating it as I'm going what I'm feeling like looking through my like uh when I look at my my iPhone I go to my music tab or whatever and I scroll. The way that I go from song to song is sort by album. So that I think says a lot about me is I'm always looking for the album and bouncing back and forth that way. It's not by artist it's not by song. And um sometimes when I'm not feeling anything specific I'll do shuffle but then inevitably within five songs I'll find something that leads me back to album and go from there. So it's really cool too. Yeah it's it's really weird but I I I definitely music's very special to me and it's something that I I make time for in my life more so than anything else really besides what",
      "start": 5430.72
    },
    {
      "text": "really cool too. Yeah it's it's really weird but I I I definitely music's very special to me and it's something that I I make time for in my life more so than anything else really besides what I do in work and all that stuff that I love. Like um I make time for specific video games you know I make time for movies but when albums are coming out I make time for that. I really am like I'm thinking about that stuff and thinking about the experience I'm going to have with certain albums in a way that is kind of creepy. Sure. Do Do you hear that? Sounds like big dog Kevin's about to bark. What you got for me? You got me laughing. Uh being in the car with him while he listens to music **** sucks. He changes the song every 15 seconds. He like wants to find the right one. No no no. He wants to hear specific parts of the song and then he's out. I mean so to be fair that is a very different random situation. The car specifically with Kevin it's just like it's a whole whole",
      "start": 5479.92
    },
    {
      "text": "He wants to hear specific parts of the song and then he's out. I mean so to be fair that is a very different random situation. The car specifically with Kevin it's just like it's a whole whole disaster but that's because car rides and the road trips that's where the playlist comes into into play where I I'm totally down with that. But music I the album experience with other people is way too hard for me to even try to comprehend because you can't share that experience with somebody else like they the car ride is a single a single song world and it is totally you need to respect the other people in the car. I don't respect Kevin so we I've known him too long. There's too much going on there. But usually usually with Kevin I am showing him something in a song which is why I'm trying to find specific parts. But if you ever notice like and I might this is might be that FedEx moment where I break your the glass shattering with you. Um the most annoying thing for me on the plane is",
      "start": 5530.48
    },
    {
      "text": "to find specific parts. But if you ever notice like and I might this is might be that FedEx moment where I break your the glass shattering with you. Um the most annoying thing for me on the plane is I'll be sitting there and I'm just like if I am on shuffle I'm just bam bam bam bam bam next song. I see you all over the place. Yeah. Yeah. And it's just like I can imagine to the people next to me it's infuriating to see all that **** going on. But they probably shouldn't be looking at your phone. They shouldn't be. Bunch of dicks. Yeah. **** them dicks. So like broccoli music. This shit's good. This shit's good. This topic was brought to you by Squarespace. Whether you need a landing page a beautiful gallery a professional blog or an online store it's all included with your Squarespace website. Jared would you like to bust out a phone? Did you get a phone yet? Uh I I do have my phone is busted. I have a busted phone. Do you want to use mine? I have a phone. I have I I have an",
      "start": 5579.36
    },
    {
      "text": "website. Jared would you like to bust out a phone? Did you get a phone yet? Uh I I do have my phone is busted. I have a busted phone. Do you want to use mine? I have a phone. I have I I have an old beat up. Sorry I'm dealing with I'm dealing with an an event here. That's why I was on things happen. That's all right. That's all right. But no I I I do in fact carry a phone now but it's it's it's ancient and old and grungy. Well let me tell you a little bit about Squarespace. I'd like to hear about it. Would you like to know why you should use it? I'd love to know. Number one it's easy. Creating your website with Squarespace is a simple intuitive process. You can add and arrange your content and features with the click of a mouse. It's also free for a custom domain. Squarespace makes adding a domain to your site simple. If you sign up for a year you'll receive a custom domain for free for a year. Beautiful templates design a best-in-class online store with Squarespace",
      "start": 5617.84
    },
    {
      "text": "makes adding a domain to your site simple. If you sign up for a year you'll receive a custom domain for free for a year. Beautiful templates design a best-in-class online store with Squarespace award-winning templates customizable settings and more. All without a single plugin. They have seamless commerce tools customer support all the time. I mean it's 47 Jared. You can get somebody any time of the day if you need help. Sounds pretty gravy. It's pretty good. Yeah. For your website. Not that because it's so easy to use though. You would never need help from anybody. Don't worry about it. Okay. But it's there if you if you want it. But if you needed it it would be there. But you're not going to cuz it's so easy and intuitive to use. And they got the seamless commerce tools we've been worried about a lot. Anyways start your free trial today at squarespace.com and enter the offer code kinda funny to save 10% off your first purchase. That's squarespace.com. Kinda Funny.",
      "start": 5648.96
    },
    {
      "text": "been worried about a lot. Anyways start your free trial today at squarespace.com and enter the offer code Kinda Funny to save 10% off your first purchase. That's squarespace.com. Kinda Funny. All one word for 10% off your first purchase. Bam. Tim Tam. Yes. What's topic? Bringing it home today. So a couple weeks ago my topic was proposals and how happy proposals make me. You proposed to Gia. You salty dog. I didn't even No. Um so my friends proposed and that was the the you know the the spawning of all that that topic and stuff. But that led me to being really excited about proposals in a way that I had been in a long time. Went down a rabbit hole of watching a whole bunch of proposal videos which one of my favorite things cuz again like I said in that topic it just makes me happy of course. Um last night I ended up doing even more of that and that led to finding videos of um like army people coming back and to their families or which then led to videos of deaf people hearing",
      "start": 5682.4
    },
    {
      "text": "course. Um last night I ended up doing even more of that and that led to finding videos of um like army people coming back and to their families or which then led to videos of deaf people hearing for the first time and just things like that. And now I'm not really sure what this topic is but those videos make me feel a certain way that is so unique you know and it but I love that it it's the same feeling you know it's this feeling of of just happiness and joy for other people. Like it's just raw being happy for someone else you know and like you kind of feel that emotion through them. And I want to know like is there other situations that you guys can can think of that are in that in that vein or whatever. Yeah. I mean you bring I mean you kind of bring it up I guess to to your topic before we jump off I guess into that direction cuz I thought we were going a different way with it when we when we were you were just talking is it reminds me of how spoiled we are now compared",
      "start": 5724.4
    },
    {
      "text": "topic before we jump off I guess into that direction cuz I thought we were going a different way with it when we when we were you were just talking is it reminds me of how spoiled we are now compared to and stick with me the movie Dogma cuz you remember in Dogma the whole thing is that Ben and uh Matt Damon are angels grounded on earth right and Ben's whole thing was that he was a watcher and so he goes to the airport all the time to watch people get reunited and like see each other when they come off the plane and be like have that moment of pure joy. joy and happiness to see each other again and how that obviously there was no 9/11 had happened so you could walk up to the gates and just sit there and watch people get reunited that way but also the fact of like the internet wasn't in a place where yeah these moments we were sharing so much with everybody all the time that you would be able to just go and for hours watch these kind of things and then be like well what about this or",
      "start": 5774.8
    },
    {
      "text": "place where yeah these moments we were sharing so much with everybody all the time that you would be able to just go and for hours watch these kind of things and then be like well what about this or what about a deaf person here what about that like it's such a weird thing of that used to be rare you'd have to be at the airport for something else and then you'd see a couple reunited or whatever mom and unreunited and you'd be like \"A what a sweet moment.\" And now you just sit there and eat popcorn at your laptop and watch it. Yeah it well another one uh that I was thinking about you saying that reminded me of Reddit um somewhere it was on the front page a couple weeks ago of it was a gif of some guy at a soccer game and like some little kid at a soccer game and one of the players came by and like was walking stopped looked over the kid went up to him gave him like a slab and then walked off and that kid like just blew up and then that led to someone responding uh to some hockey",
      "start": 5813.6
    },
    {
      "text": "by and like was walking stopped looked over the kid went up to him gave him like a slab and then walked off and that kid like just blew up and then that led to someone responding uh to some hockey player doing something similar like walking over and giving him a stick and then a bunch basketball players a bunch of uh the hockey stick. I know. Uh and uh it it was just like it's so crazy that like I just felt so good for those kids. Yeah you get it cuz I mean I think we all have those moments in our lives that you remember right? The one that got me choked up uh last night two nights ago was uh it was on Reddit as well and it was a a little boy had just finished his baseball game or whatever and then went to the car and I guess the dad had been pretending he forgot about his birthday or whatever or couldn't afford the gift or whatever and then like and they I think he was pretending that he forgot it forgot about the birthday and the kid was getting all sad about it or whatever and",
      "start": 5852.24
    },
    {
      "text": "whatever or couldn't afford the gift or whatever and then like and they I think he was pretending that he forgot it forgot about the birthday and the kid was getting all sad about it or whatever and like being all cold shoulder about it or whatever and then he made him go to get his bag from the back of the car and open up and of course the bat was there and the kid broke down and then the dad broke down and it's like one of those moments of like uh you know this such a personal moment that clearly is going to leave such an impact on the child let alone the dad you know what I mean and like you share it there it is you find it in two seconds good job Kev you want to put that in there even looking for it I'm it's well I'm you know I'm now I'm big time Redditor I see everything ahead of time I don't really see everything ahead of time but you know I mean I see a lot of stuff early but I mean like you know there was a moment you share of like I remember you know when my parents hid my",
      "start": 5893.28
    },
    {
      "text": "I don't really see everything ahead of time but you know I mean I see a lot of stuff early but I mean like you know there was a moment you share of like I remember you know when my parents hid my Christmas gifts or whatever like the one thing I really wanted I didn't get and then coming back up the stairs when they sent me downstairs to get something But you run into that gift you're like \"Oh my god.\" And now you get to be a part of it and find it and see all that stuff. Yeah. And I mean you know YouTube and all that stuff I think kind of in a much bigger way incentivizes people to to think in that way. Uh for example there's that the Disneyland video of the girl that the little girl she was like probably five with little sister and then the parents are like um told her that \"Oh we're not going to school today.\" And she's like \"Oh like they're driving to school. Have you seen this? Do you know what I'm talking about?\" I I think so. I mean I've seen videos like this",
      "start": 5926.56
    },
    {
      "text": "\"Oh we're not going to school today.\" And she's like \"Oh like they're driving to school. Have you seen this? Do you know what I'm talking about?\" I I think so. I mean I've seen videos like this right? So it's it's a it's a family driving this this girl and they're like \"Oh we're going to school.\" And then they're like \"Oh we're not really going to school.\" She's like \"What? Really? We're not going to school?\" It's like \"No guess where we're going?\" Like \"Oh we're going to Disneyland.\" And she just like burst into tears and the little sister's just like \"The **** going on?\" Um but I I just love that. I just love the just the pure It's just to make her happy you know? Like it's just so awesome that they capture that moment. And then they made a sequel video a couple years later and the girl's like \"It's happening again.\" It's just It's so funny. Like I just love that there's you know there's things that can make people that happy and that those moments of",
      "start": 5963.52
    },
    {
      "text": "years later and the girl's like \"It's happening again.\" It's just It's so funny. Like I just love that there's you know there's things that can make people that happy and that those moments of happiness make other people happy. It's so cool. It it's infectious almost. I agree. Now for me I don't I do not prowl the internet looking for these kinds of videos very often. So almost all of mine are are things I've observed through real life. Is this is this contextually relevant or not? I want to make sure. Oh this is relevant. Okay good. I I so the motion car I yeah I used to um when I was in Japan I I taught and uh a lot of I did was work as a kindergarten teacher. So a lot of tiny Japanese children used me as a jungle gym for like 3 years. It it was pretty wonderful. I I mean to a lot of them in Japan there are not very many people of my height. There are very few bald men. There are very few people with beards and there are very few fat people. So to a group of Japanese",
      "start": 5992.16
    },
    {
      "text": "to a lot of them in Japan there are not very many people of my height. There are very few bald men. There are very few people with beards and there are very few fat people. So to a group of Japanese four-year-olds I was the tallest fattest baldest hairiest thing they had ever seen. I barely looked I want to climb it. Yeah exactly. That was the response. I barely looked human and they would take you down. I mean you 30 Japanese kindergarteners can take you down. Tell me what it take to take you down. It's they it is it's exactly like that. They would literally they'd wrap around your legs and then they they get and they just keep holding on and they grab your arm so you lose your balance and then a couple of them inevitably would try to stick their fingers up your butt which is Japanese thing called koncho where they they try to stick your fingers in your butthole which is is a very interesting cultural phenomenon but yeah they take you down and then jump on top of you. Anyway",
      "start": 6035.2
    },
    {
      "text": "thing called koncho where they they try to stick your fingers in your butthole which is is a very interesting cultural phenomenon but yeah they take you down and then jump on top of you. Anyway kids having impromptu joy at a moment particularly at at a kid like like like Cookie Monster moment. You know how whenever Cookie Monster sees a cookie it's like the first time he ever saw a cookie and he's just like cookie nom. He's just so happy. That's what those moments are like for kids. And being near that is infectious. a few come to mind for me immediately. Anytime a kid goes off a diving board at a pool and screams like cannonball you know there just that look when that you you they freeze in midair and there's that grin from ear to ear and they're about to land right next to their sister and just you know and probably give her a concussion but it's beautiful that that moment that it's happening. This is wonderful moment. Um again in Japan I remember I was standing on an ice",
      "start": 6077.92
    },
    {
      "text": "and just you know and probably give her a concussion but it's beautiful that that moment that it's happening. This is wonderful moment. Um again in Japan I remember I was standing on an ice cream counter like a restaurant and I heard this little singing next to me. Matcha is Japanese green tea and they have green tea ice cream there. I'm standing there and I hear this little song and I look down. There's a tiny probably three-year-old girl just peeking over the ice cream counter just barely. She's just going this green going matcha matcha matcha cream matcha matcha matcha cream. They're just singing it. Oh cuz she's about to get ice cream and she is singing at the joy of the ice cream and that that those kind of moments. Um I was in a waiting room at a at a courthouse of all things uh a few weeks ago and I was playing uh Mega Man Legacy Collection where you can play Colin Morardi's level on my 3DS. Um this kid sitting next to me uh was kind of looking over and watching me play",
      "start": 6123.44
    },
    {
      "text": "uh a few weeks ago and I was playing uh Mega Man Legacy Collection where you can play Colin Morardi's level on my 3DS. Um this kid sitting next to me uh was kind of looking over and watching me play and his mom was there and so he kept looking over and I was looking at her. I was like \"Is this okay?\" And she's like \"Yeah.\" So I handed it over. He had never played Mega Man. He's sitting there playing Mega Man and at first he's trying to touch the touchcreen. Then he figures the controls out. little kid. But I watched him and he ran forward and fell in a hole. He ran forward and fell in a hole. Then I showed him how to jump and he ran forward and jumped at the hole. But then he ran over and jumped over the hole and then he jumped over the hole and ran into an enemy and died and he kept restarting. I think I should have and they jumped over and shot the enemy and then he moved forward and jumped over and you watched him learning and getting f and he just that compulsive bam restart",
      "start": 6168.88
    },
    {
      "text": "restarting. I think I should have and they jumped over and shot the enemy and then he moved forward and jumped over and you watched him learning and getting f and he just that compulsive bam restart restart and it was like looking through some kind of tacky on camera into my past and seeing that unabashed joy of discovery. This kid was discovering 2D platforming for the first time in his life and he couldn't get enough. And we were in that room for I hear you kid. Yeah it was great. He handed the 3DS set back and said \"It's no Sonic.\" No no. His m He just his just this joy came over his face for like two hours he was in there until it was time for him and his mom to leave. And it was it was wonderful to watch just just those kinds of moments. And I I also really like anywhere I am. something that that just if I see someone reading anywhere of any age in any context I get happy watching people read just I'm just like you whatever you're doing right now is making you better um it's",
      "start": 6209.68
    },
    {
      "text": "that that just if I see someone reading anywhere of any age in any context I get happy watching people read just I'm just like you whatever you're doing right now is making you better um it's it's it's just inspiring. So those are the ones that come to mind for me. Yeah. There's an Instagram called Hot Dudes Reading. Highly recommend. I have seen Hot Dudes Reading. Actually I might be on Oh yeah. That's right. Team fat patent pending. What comes to mind for me for some reason is is sporting events. Um especially going to sporting events live. So um hockey games and and and football games specifically are um amazing events to go to live especially with the ups and downs of the team and depending on the stakes of the game. Um that's what's so fascinating. I love sports and that that's what's so fascinating about it is that um in week one in the NFL everyone is 0 and 0 right? Zero and zero right? No one like everyone can win. You're not going to but everyone everyone can win and then",
      "start": 6255.12
    },
    {
      "text": "so fascinating about it is that um in week one in the NFL everyone is 0 and 0 right? Zero and zero right? No one like everyone can win. You're not going to but everyone everyone can win and then by the end of the season the stakes are so high because people are trying to get in to the playoffs and and then the playoff games are like **** zany man. I'll never ever ever ever forget going to the Islanders Maple Leafs game in 2000 in the playoffs. the Shawn Bates penalty shot game which is a **** famous hockey game that I just had like famous not only in Islanders lore but in hockey lore that I happen to be at and that place went off. I have never ever ever been in a scene like that in my life. I was like this is and I'll never forget it. It was awesome. Um it was a penalty there was a penalty shot and like and we won the game and it was like **** bedum dude. It was so awesome. I remember leaving the the Nassau Coliseum on Long Island and people were **** going crazy in the",
      "start": 6311.04
    },
    {
      "text": "a penalty shot and like and we won the game and it was like **** bedum dude. It was so awesome. I remember leaving the the Nassau Coliseum on Long Island and people were **** going crazy in the parking lot and beeping their horns and just laying on their horns all the way down the Long Island Expressway. People were like going insane and I was like \"This is so cool.\" But I've also been in that arena where it's half full you know and they're losing six to nothing in the second period and people are just leaving you know? And uh I still say like like my the mo the most joy I get out of going to an NFL game or going to a Jets game is um when we're winning and the games are going really great and we score a touchdown and uh this place the best the **** best. But when the Jets lose or they're playing terribly that only happens once in the game in the very beginning right? But when you're winning in a lot of those Sundays and I've been to those kinds of games but when everyone's",
      "start": 6353.04
    },
    {
      "text": "they're playing terribly that only happens once in the game in the very beginning right? But when you're winning in a lot of those Sundays and I've been to those kinds of games but when everyone's doing the jet the Jets chant and everyone's like smiling in elation and then there's like 80000 people doing that in unison and the team's playing great and they're winning and everyone's in a great mood it's like it's joyous. It's **** awesome the ups and downs of of sports especially when you are a fan of notoriously bad or typically bad teams like I am with football and hockey. Um you really like remember those moments. It's like I remember for some strange reason it was the game you couldn't go to because you got sick or whatever. But out of all the football games I've been to the Jets games I've been to I remember that game really well. It was it was a but it was a meaningless game. It was a Jets Colts game. It was one of Andrew Luck's first games and the Jets **** destroyed",
      "start": 6399.44
    },
    {
      "text": "games I've been to I remember that game really well. It was it was a but it was a meaningless game. It was a Jets Colts game. It was one of Andrew Luck's first games and the Jets **** destroyed them. And I and I was and I remember I remember specifically Tim Tibo fake punt run for like 5 yards. I'm like what the **** And the place was just going nuts. The game was like totally meaningless in the grand scheme of things. We were like six and 10 that year or something like that. I was like that was so fun. And I remember that moment. I'll always remember that moment. And I remember those moments going to Yankee games specifically with my dad when the Yankees were bad and then when the Yankee because the Yankees were bad when I was like a young kid and then when they were good and how different that was. I And I also remember being on enemy territory. I remember um watching the way other fan bases celebrate the way other fan bases get into games or the way they lose. I've been to",
      "start": 6438.64
    },
    {
      "text": "different that was. I And I also remember being on enemy territory. I remember um watching the way other fan bases celebrate the way other fan bases get into games or the way they lose. I've been to Yankee Red Sox games at Fenway Park. It's a very hostile place for Yankee fan you know and a very very hostile place for Yankee fan. And uh I've seen the Yankees destroy the Red Sox there. And I've seen the Yankees get killed there and the Elation and the Bedum that happens there. And I've been the Patriots Jets games in New England. Um much nicer fan base than the Red Sox fan base. But a lot of crossover obviously um and the way they celebrate. I like going to those different I like everyone's different traditions. I like the 12th man in the Seattle. I like I like um our Jets chant. I like the Eagles song. I like the Bears like song. like all these different things that everyone has and how it brings them joy and it's a tradition and it's a ritual and it's been going on for some of",
      "start": 6472.08
    },
    {
      "text": "the Eagles song. I like the Bears like song. like all these different things that everyone has and how it brings them joy and it's a tradition and it's a ritual and it's been going on for some of these teams for 60 or 80 years. It's pretty cool. Yeah. I mean what you're talking about is like the grand scale thing of the reunion of people right? It's a shared experience between human beings and that is something special to be in those arenas and have everyone on the same page as far as what's happening. And those are some of the most over not even necessarily in the arena cuz I I the two that jumped to my mind right are at Missou you know every time Kansas came through for basketball they beat the **** out of us or beat usually on some heartbreaking three-pointer thing at the end or whatever. And my senior year my final game as an antler we're all there in the dresses with our hair and mohawks like cuz that was that's what you do when Kansas comes to town. Uh and I'll remember",
      "start": 6510.08
    },
    {
      "text": "whatever. And my senior year my final game as an antler we're all there in the dresses with our hair and mohawks like cuz that was that's what you do when Kansas comes to town. Uh and I'll remember I remember two minutes in when it looked like we were going to win and I it started to set in. This is my final time being an antler. And I started tearing up and I was like \"Oh no.\" And then when we finally won the first time in four years I ever saw Missou beat Kansas in person and everyone rushed to the floor and not the Antlers cuz we're trying to make a point that we're not that bad. And like I I just burst into tears and turned around and hugged my other graduating senior Jason. He just held me while I like weeped. Like I weeped. And then the other one being when in Missouri as well but after college watching the Bears advance to the to the Super Bowl and like popping champagne and crying then and calling all my friends in Chicago to talk about like can you **** believe this is",
      "start": 6544.88
    },
    {
      "text": "after college watching the Bears advance to the to the Super Bowl and like popping champagne and crying then and calling all my friends in Chicago to talk about like can you **** believe this is happening finally cuz it's been forever. Our entire lives they have been terrible our entire cognizant lives. Yeah it's it's funny with like sports whether collegiate or professional or even the sports we played as a kid. Like I have a lot of memories of playing hockey like ups and downs really bad moments and really good moments. Um it's funny like Tim actually bore witness to one of the strange sporting moments in my life and he's the only person that saw it which was when the Islanders made the advanced in the playoffs for the first time since I was uh eight. Um so they got to the second round of the playoffs. I actually started hysterically crying. Oh wow. I I like I couldn't help it. I was like overcome like with emotion with joy and like couldn't believe it. Like I couldn't believe",
      "start": 6580.08
    },
    {
      "text": "of the playoffs. I actually started hysterically crying. Oh wow. I I like I couldn't help it. I was like overcome like with emotion with joy and like couldn't believe it. Like I couldn't believe it. That's kind of that's kind of the topic that that I was really trying to get at is the fact that so was I you know just having you next to me. Like I don't care about hockey at all but I cared that you were so happy about this thing. And like that's that's so crazy and it's infectious you know? Like uh I I understand because so many of my friends like my friend James is the like biggest SF Giants fan in the **** world. and knowing him and seeing him be a fan for so long and then for them to win like it it was just crazy. It's like I felt this like celebration within myself for him you know just seeing him that happy was so crazy. And like it for like going back to it um like video games do that to me so much. Like thinking about the Twilight Princess reveal like when they",
      "start": 6621.2
    },
    {
      "text": "you know just seeing him that happy was so crazy. And like it for like going back to it um like video games do that to me so much. Like thinking about the Twilight Princess reveal like when they first announced it like there's the video that if you haven't seen this YouTube right now Twilight Princess uh reaction it's every couple months I'll go back and watch that just to like for that feeling of wishing I was in that room but yet feeling I was in that room anyways. People were so excited that that **** happened. And there's other things like the Street Fighter um the Justin Wong versus Daigo match where you know the the the moment happened and it's just like man I don't understand what's happening but this is it's I'm overcome with emotion from all this and what's really funny to get super meta with it uh watching my reaction to Crash Bandicoot makes me happy about me being happy you know but there's just something about like I know how I know how pure that was like I know Wow.",
      "start": 6665.6
    },
    {
      "text": "super meta with it uh watching my reaction to Crash Bandicoot makes me happy about me being happy you know but there's just something about like I know how I know how pure that was like I know Wow. You weren't doing it for effect. The the perform the the girl crying when she hears for the first time or the child when they put the glasses on and she sees for the first time. Like I mean like it's not there's no bullshitting around about it. Yeah. And I think that there's there's something really powerful about it. And I I I wonder if there's like a name for that. But whatever it is I think it's powerful emotion. It's it's a beautiful thing. Euphoria. Euphoria. Maybe it is. I think that's good. Yeah. Um but it's it's just it's so interesting to me that it it results in tears so often you know? Yeah. It results in just this like your body needs to react in some way right? Like uh you can see if you look in the video I felt like I was about to cry during the Crash Bandicoot thing.",
      "start": 6716.64
    },
    {
      "text": "know? Yeah. It results in just this like your body needs to react in some way right? Like uh you can see if you look in the video I felt like I was about to cry during the Crash Bandicoot thing. Well I mean what's what's the line between laughter and tears? They're both signals from our body that that's they're telling something is wrong. Something is different. Something is uncanny in this moment. Something exceptional and extraordinary and alarming is happening. Laughter and tears are are are both the responses we have to those things. It's I think it's utterly appropriate that that that that we allow ourselves to be overcome by wonder or beauty or euphoria the word used there. I I think it's one of the best things about being human. If we didn't have those moments to look forward to why would we bother? Yeah. Yeah. Ladies and gentlemen this has been the GameOverGreggy Show. Each and every week four sometimes five best friends gather on this table. Each bring a random",
      "start": 6757.68
    },
    {
      "text": "to why would we bother? Yeah. Yeah. Ladies and gentlemen this has been the GameOverGreggy Show. Each and every week four sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that head over to Patreon.com/kindafunny where you get the shows early get a whole bunch of exclusive perks and get some goodies. if you have no bucks to toss our way there. Head over to YouTube.com/kindafunn where you get the show topic by topic day by day until we post the entire thing as one big video and MP3 the following Friday. Of course while you're on that Patreon.com site go over and check out Patreon.com/jared pedy. Your new your new podcast is started up now. Thank you so much Greg. I really appreciate that. Thank you for having me on. It was an honor to be here. You guys Thank you so much for coming. Remember it's pocket pockets full pockets pockets full of soup. Pockets full of soup. That's the name of the show. Got it. And",
      "start": 6805.12
    },
    {
      "text": "on. It was an honor to be here. You guys Thank you so much for coming. Remember it's pocket pockets full pockets pockets full of soup. Pockets full of soup. That's the name of the show. Got it. And it's it's up now. Now you can get for free if you don't want to give him money. You should probably give him money if you if you got it. I'm going to give him money. Support this man. Until next time it's been our pleasure to serve you.",
      "start": 6843.92
    }
  ]
}
