{
    "id": 1983,
    "video_id": "raD18LAEMqs",
    "show_name": "Gamescast",
    "hosts": [],
    "title": "Updated No Man's Sky Impressions - Kinda Funny Gamescast Ep. 81 (Pt. 1)",
    "description": "No Man's Sky is very hard to review.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1471266003,
    "duration": 1862,
    "transcript_chunks": [
        {
            "text": "What's up guys? Welcome to the first ever episode 81 of the Kinda Funny Games Cast. As always I'm Tim Gettys joined by the coolest dudes in video games Colin Morardi and Greg Miller. How do they get away with this dude? I don't understand. I don't understand either. I don't How you feeling about this Gal Gun? I still need to play more of it to get a to get a real opinion of it on you for you. What? I It's exactly what Galaggon was. I knew what Galagan was going to be. I played the Xbox 360 import version with one Tina Sanchez at OneUp with Jeremy Parish on my side. I knew what it was going to be. Shooting these girls making him get all weak in the knees flush in the face make orgasm noises and fall down. That's what it is. That's what I got. I haven't played a lot of it. I haven't played enough to tell you if I'm going to platinum it or not going to platinum it. I still like the idea of it but then I get on the planes and I fall asleep. I saw a thread on the kind of",
            "start": 0.31
        },
        {
            "text": "I haven't played enough to tell you if I'm going to platinum it or not going to platinum it. I still like the idea of it but then I get on the planes and I fall asleep. I saw a thread on the Kinda Funny Facebook group. Yeah. That was like is Greg Miller serious about this gal? I don't know anymore. I don't know. I've gone around the bend on it. But this book, man. Mhm. Good lord. Can you describe it? Pornographic. Pornographic. Describe what you're seeing right now. Right now, I'm looking at a girl in her school uniform. And then on the other one of just her and her bra panties and the panties are not covering everything. It's one of those like But I mean like she's young. Too young. That's what I was telling Colin. I'm all down for this anime stuff, but this too far. That's way too far. Now that's an angel though. That's it. If that get She's like probably years old. She's like a million years old probably. Our angel's old. Now, this one, this is concept art. And I'll tell you",
            "start": 44.4
        },
        {
            "text": "far. Now that's an angel though. That's it. If that get She's like probably years old. She's like a million years old probably. Our angel's old. Now, this one, this is concept art. And I'll tell you what, man. That's a That's something. That is something going on there. That is something. It's how I see the world. This is Kinda Funny Games Cast. Every week we join together to talk about video games and all the stuff around video games and surrounding video games and why we like them, why we don't like them sometimes. Whole bunch of stuff. What's up? Do you want to talk about why we're using the old microphones and Kevin's using the old board? We're using using old microphones and Kevin is using this like tiny little board that is kind of embarrassing really. Um because we used to use it though. We're gearing up. Nick Scarp needs to sit right here and use that thing for the Kinda Funny studio launch that is upcoming. You'll hear more about that soon imminently. You'll hear about",
            "start": 81.52
        },
        {
            "text": "it though. We're gearing up. Nick Scarp needs to sit right here and use that thing for the Kinda Funny studio launch that is upcoming. You'll hear more about that soon imminently. You'll hear about you'll hear about this. Oh, that's terrible. Very It's very exciting stuff. So please bear with us for the audio that is I'm sure unbearable. I'm sure it's fine. It's fine, but it'll be worse than usual. Turbo somewhere pounding his head against the wall. Super upset. Um, anyways, you can get this show early on patreon.com/kindafunny games alongside a whole multitude of goodies or you can be like, you know what, I don't want the goodies and go to youtube.com/kindafunnames. We are once again really close to hitting 00,000 subscribers over there. Maybe we won't get immediately in the great thousand unsubscribe again so we can just play this game constantly. It's like groundhog stay at 190. Rolling the boulder up the hill. We're getting we're getting there. Thank you for that. Really, really",
            "start": 121.44
        },
        {
            "text": "unsubscribe again so we can just play this game constantly. It's like groundhog stay at 190. Rolling the boulder up the hill. We're getting we're getting there. Thank you for that. Really, really do appreciate that. And of course, thank you to all the the patrons, including Steven Eninsler for being the Patreon producer of the show once again. Now, spoilers. He did it for the next month, too. Hell yeah. I got to Can I just say something about Steven Eninsler? I appreciate it and I respect it. You don't have to do this forever. Don't listen to him. You have to. Steenler, we appreciate he makes the show happen. We appreciate your respect. He does, but I'm just saying I feel bad. Has anybody heard from Stephen Insler is my question. I worry he died and his credit card. That's my thing is he's never like hit me up on Twitter. I feel like he should. We're boys now. I feel like I have heard from Steven Enor. I'm probably making that up. You just hear his name every week. There's this",
            "start": 161.44
        },
        {
            "text": "is he's never like hit me up on Twitter. I feel like he should. We're boys now. I feel like I have heard from Steven Enor. I'm probably making that up. You just hear his name every week. There's this there's the other dude from San Diego, Stephen or something like that. I think I met him actually at Polite. Yes, like when I was just there. Incidentally. Oh, makes sense. Makes sense. Anyway, he's a good dude. Um, so I want to talk about No Man's Sky. No sky. No Man's Sky. Ah, if you want a glimpse into what it's like to be Colin and Greg living at this house. Everybody left yesterday and we just laid in our different beds from the other room yelling no in different voices and we were cracking up like it was even playing it. Brutal. So you guys you guys did a little kind of a breakdown of your early impressions on PS I Love You XOXO. You can find that over on this this beautiful YouTube channel.comame. But now you guys have put a little bit more time into it. What What's the status update",
            "start": 199.36
        },
        {
            "text": "early impressions on PS I Love You XOXO. You can find that over on this this beautiful YouTube channel.comame. But now you guys have put a little bit more time into it. What What's the status update from you guys? I have I finally got to dive more. Yeah. You haven't played any, right? I played I played a little over an hour of the game so far. I last night I played Brutal instead. Gotcha. Gotcha. Gotcha. The last two nights I played that game. No, I've been doing it, you know, in the leadup to Nim Sky. What we've been saying a lot is, and when I say we, I mean me, is that I saw this maybe being a game I put 30 minutes into before bed every night, did something like that. And usually I say stuff like that and then just gorge on a game and totally ignore that I ever said that. This is actually been what's happening. These like I'll get in there, I'll actually chip away for 15, 30 minutes, come back to it, go out there, do that. It's a horrible way to play this game. It is a horrible way",
            "start": 244.0
        },
        {
            "text": "been what's happening. These like I'll get in there, I'll actually chip away for 15, 30 minutes, come back to it, go out there, do that. It's a horrible way to play this game. It is a horrible way to play this game. I feel like I making no progress. And this is a game that makes you feel like you're making no progress period. Right? Like you don't play No Man's Sky and like, you know, check off all these boxes, do all these things, complete all these quests. You're going from plan to plan trying to figure all this all stuff. So, uh, my update is, yeah, I'm probably another hour, hour and a half from where I was on PS I Love UXOXO. I just got my Hyperdrive up and running. I just used it for the first time to jump out of, you know, the system I was in into this other place, go over there, see what's happening there. I'm, you know, learning the ins and outs now of selling material or buying new things, how to communicate with I walked in to the first space station, there's some",
            "start": 283.76
        },
        {
            "text": "there, see what's happening there. I'm, you know, learning the ins and outs now of selling material or buying new things, how to communicate with I walked in to the first space station, there's some goddamn alien back there. Looks totally made up. Probably was. I don't think he's a real alien. And he's there and they're like, you know, he he you know, you don't understand their languages, right? You're just you're as you learn, you get words from them. You start deciphering more and more and more, which is a cool cool thing, I think. But I'm there and he's like, \"Yeah, you know, you get little description.\" Have you seen this where you get like you'll talk to somebody or something will happen and you get the the text from your character up here of like a journal entry of like how he's feeling or how he's reading the situation like, you know, this alien that he can't understand is acting angry and da da da and he points at your gun or whatever. And so it pops up and he's like, you",
            "start": 320.4
        },
        {
            "text": "feeling or how he's reading the situation like, you know, this alien that he can't understand is acting angry and da da da and he points at your gun or whatever. And so it pops up and he's like, you know, give the guy your gun, refuse your gun. And I'm like, I'm a guest on the space station. I just got here. I give him the gun. He then gives me a better gun and he's like, \"Oh, it wasn't the way we expected it to go, was it?\" Yeah. He's like, \"How are you traveling? How are you doing this with you got a bad gun? I give you a better gun before I come.\" Oh, I see. I mean, do you So, you see him actually animate angrily. Like, did you get No, they just like kind of No, they kind of look around. There's not like getting facial animations or anything like that. But that was cool. And that was, you know, I was finally feeling, okay, something's happening. But then it I went, you know, I got that I got the hyperdrive. I jump, you know, so I get to hop over there. I go to a new planet and I",
            "start": 352.32
        },
        {
            "text": "you know, I was finally feeling, okay, something's happening. But then it I went, you know, I got that I got the hyperdrive. I jump, you know, so I get to hop over there. I go to a new planet and I land. It's different. It looks really beautiful. You know, that's the one thing about the game. It's gorgeous. There's, you know, I really like the style of it. Uh, see new animals, do all these different stuff, but then it's just back to collecting and stuff. And it was that first thing of like I'm in this weird spot right now where I feel like tonight will be the first time I unless I go to trivia with Colin where I get a few hours to actually sit down and play it consecutively before I pass out. And that'll be the real test to see if how into it I am cuz I I have this thing where I play it for the 15 30 minutes I'm going to give it and I'm like all right this is okay. I'm I feel like I'm finally getting oh I only held 1 things. That sucks. And I got to when am I going to go break do I",
            "start": 387.2
        },
        {
            "text": "for the 15 30 minutes I'm going to give it and I'm like all right this is okay. I'm I feel like I'm finally getting oh I only held 1 things. That sucks. And I got to when am I going to go break do I break this down? Is that more important? I go in I'm still at a glance I still don't know like what I need of like wait does this help my life support which is always dropping so crazily or is it is this going to help me help the ship or the fuel or whatever? I always have it, but I feel like I'm always in You're still learning the rules. Exactly. Of the world. But the thing about it is now that I did this first, you know, I think two or three runs now where it's like, \"All right, cool. I got some stuff now. I'll go back to space station. I got some stuff.\" And back and forth, back and forth where it's just like I need now another carrot at the end of the stick. I need to know what's what I do with all this cuz if this is all it's going to be of, you know, doing this, getting a better",
            "start": 418.48
        },
        {
            "text": "where it's just like I need now another carrot at the end of the stick. I need to know what's what I do with all this cuz if this is all it's going to be of, you know, doing this, getting a better weapon, all right, cool. I'm improving this. I can travel further. I don't know if I'm going to stick around much longer. Not that I'm saying the game's bad, just I think I don't know if that's what I'm looking for right now. Yeah. So, what's interesting about that, I see a common thread with a lot of uh people's thoughts on this game are the people that just want to be in a world seem to be super happy about it. But the people that like the the Ubisoft style games, the checklists, and just like collecting things with a sense of completion. This is not that. This is a game you're not going to 100% because I don't it's not possible, you know? It's just more about collecting things, not to collect them all, just to collect the things. Yeah. Well, it's it's that and it's like incremental",
            "start": 452.56
        },
        {
            "text": "to 100% because I don't it's not possible, you know? It's just more about collecting things, not to collect them all, just to collect the things. Yeah. Well, it's it's that and it's like incremental upgrades, right? If it is, okay, cool. Now I have a better gun. Okay, now if I keep keep doing this and get a better ship and now I can get a better hyperdrive and you know, okay, cool. I can craft this thing that makes me allows me to run longer and like that's all cool and allows me my gun not to overheat as fast. And I'm interested in all that in making my explore the best explorer possible, but it's also, you know, the servers are totally **** as of recording. So you get on there and there's no connectivity. So I haven't named anything. I haven't had that experience where I'm like, \"Oh, cool. I'm I'm you know, did have you seen Anthony Carboni's video? Anthony Carboni put up this video. Everyone should go watch it. Kevin, if you can put it in the description, that'd be great. Uh over",
            "start": 489.84
        },
        {
            "text": "cool. I'm I'm you know, did have you seen Anthony Carboni's video? Anthony Carboni put up this video. Everyone should go watch it. Kevin, if you can put it in the description, that'd be great. Uh over on his channel, which I I hope is Anthony Carboni, but who the hell knows? Find him on Twitter. He put up a video that's a PSA, like with the sad music behind it or whatever, where he talks about how he, you know, got to do a whole bunch of content beforehand working with Hello Games or whatever, and he named all the animals Anthony like, \"Oh, it's a C Anthony, and this is this.\" And so he started a hashtag save the Anony's and he's asking everybody who finds a creature to name it some version of Anthony. And so now he's just retweeting all these people doing that. I'm like, I want to do that. I want to get in there and be part of this, but I can't. Right now, I'm just like, oh, cool. It's a name I have no idea how to pronounce and whatever. And this is how That's awesome, though. I saw a",
            "start": 522.4
        },
        {
            "text": "I want to get in there and be part of this, but I can't. Right now, I'm just like, oh, cool. It's a name I have no idea how to pronounce and whatever. And this is how That's awesome, though. I saw a bunch of tweets of just T-Rexes. There's that's just straight up a T-Rex that they just put there. Well, and it's like, you know, I And that that is the thing I'm get like you already have those wisps of the game where like right now I'm like, I don't know if this I still want to go play it. I still I keep today, you know, I woke up super early for some reason. Answered a bunch of emails, got through some other stuff. Great. And I was like I had time before you guys came over. I was like, I want to play. Hey, so I jumped in and played for, you know, the 15 minutes. But again, it's just I don't feel like I'm making real progress in that time. And I don't know if it'll be that once I sit down and have a one marathon of session of like, oh, this is how this works and I these are just to be",
            "start": 553.68
        },
        {
            "text": "feel like I'm making real progress in that time. And I don't know if it'll be that once I sit down and have a one marathon of session of like, oh, this is how this works and I these are just to be traded in and da da da if once that all clicks and it can become this thing that I'm popping back and forth into, it won't be as big a deal. I like what I've seen. I'm just worried about how long it'll keep me. But then again, you know, to the T-Rex thing, you know that I landed on this planet, got out of the thing, and then like all these spiders started attacking me, and I was like, \"Oh, Jesus.\" And I ran over to do what I needed. did whatever I did, you know, I put the stuff back in my life support, talked to the guy, got the thing I needed to get my warp drive working, jumped back out, ran started trying to shoot the spiders. That scared him off, but then the sentinels were coming over like Jesus, **** it. Ran over, got into my ship, and just as that happened, literally a dinosaur ran",
            "start": 584.56
        },
        {
            "text": "trying to shoot the spiders. That scared him off, but then the sentinels were coming over like Jesus, **** it. Ran over, got into my ship, and just as that happened, literally a dinosaur ran up to the window of the ship was like chilling outside. I'm like, \"Aha, **** you.\" And I go to hit the thrusters and it's like, \"You're out of thruster gas.\" I'm like, \"God damn it. **** What am I going to?\" And then when I went through and I find out that I had some and did it and got the hell out of there. It's like that's a cool experience and I do want that and it's like I will come back for that but I'm worried if it is just land gather go land gather go and it's and but it is that thing I say that and then at the same time I finally got the hyperdrive right got to the new place got into the new space station and went into their thing and they have all the different prices for all that stuff and I was like **** why didn't I write down what was selling at a higher price at the other",
            "start": 617.12
        },
        {
            "text": "the new space station and went into their thing and they have all the different prices for all that stuff and I was like **** why didn't I write down what was selling at a higher price at the other space station so then I could go harvest whatever I need to there or buy whatever here and go flip it and just sit here. And I'm like, why didn't I just sit here for 30 minutes doing this over and over and over again in this loop? So, I had unlimited money. I'm like, I want to do that. I want I I want to spend a night just sitting there getting millions of space bucks or whatever the hell it's called. Great. On the black market of No Man's Sky. Yeah. But I mean, like, that's the fun of that game is, you know, going in. And that's the thing is like, yeah, it doesn't necessarily have the Ubisoft checkboxes, right? There is you jump over like, you know, where it tells you I I keep doing things. It's like new accomplishment and it's like you know you've met this many aliens or this has",
            "start": 650.8
        },
        {
            "text": "Ubisoft checkboxes, right? There is you jump over like, you know, where it tells you I I keep doing things. It's like new accomplishment and it's like you know you've met this many aliens or this has happened or you've taken you know gone this far. Very cool. You can go track all that in there. There is the thing of like when it is get your hyperdrive running. is get this thing, get the fuel, do this, you know, go into space. And there are check boxes there that pop up. But right now for me, it's not super accessible for that, right? Because it was like it's I and I I like this and don't, right? There is no handholding in the game, which is interesting, which and you know, is definitely not what the modus operand is for games at this day and age. So to get in there and have it be like I was like, \"All right, cool. Oh crap, I got to do this. All right, I'm going to sell all this stuff. I don't think it's important. I sell that. I have enough. I bought the the the hyperdrive and then I",
            "start": 686.32
        },
        {
            "text": "like, \"All right, cool. Oh crap, I got to do this. All right, I'm going to sell all this stuff. I don't think it's important. I sell that. I have enough. I bought the the the hyperdrive and then I was like, \"Now you got to get you got to get a warp cell.\" And I was like I like looked around the thing. Could I buy a warp cell? It's like you know it's a it's one of the red the one of the red with the white lightning bolts. I'm like I I see those down there when I'm get. So I left and then it was you know the beacon from somebody or distress signal and went over to him. That pushed the story forward that way. But it was that thing of like am I going to know how to get this? when am I going to fit? And now I've done that, right? And and I've jumped for the first time. And now it's like, all right, cool. Now you have to get the recipe to make your own warp cells. And it's it's like, okay, but where do I get that? And it's like the game's it's all there. I'm going to find it clearly because",
            "start": 724.72
        },
        {
            "text": "cool. Now you have to get the recipe to make your own warp cells. And it's it's like, okay, but where do I get that? And it's like the game's it's all there. I'm going to find it clearly because I was able to get this far without anything. But it's just this interesting thing of it's not all right. Here's your white line. Go straight to this. This is exactly what you need to do and you need to exactly talk to this person. You'll be able to buy this and d I got a big question for you, Greg. Sure. Is it fun? What's your definition of fun? No, your answer. I mean, it is. It is. It is, but it's definitely not fun for everyone, right? You know what I mean? Like, I am I I super I enjoy Minecraft. I really really like Minecraft. And that's not for everybody. And this isn't obviously you're not building like that, but it is the as much as I'm like, ah, is it just re as soon as I find the exploit or not even the exploit, but just the one that literally this is a great way to make money, I'm",
            "start": 757.44
        },
        {
            "text": "building like that, but it is the as much as I'm like, ah, is it just re as soon as I find the exploit or not even the exploit, but just the one that literally this is a great way to make money, I'm going to do that. And I'll sit there and put on a podcast and do that over and over again like I didn't when I just tunnneled into the ground in Minecraft for no reason and got super like I'm going to build it out by this many blocks by this many blocks and put it up here and I want to put a hole there and then I'm like I'm going to give me 16 ovens. I want to cook all this sand to make glass cuz I suddenly want a glass seat. You know what I mean? Like there is that to it. And as soon as it gets to the point of like, okay, cool. I understand how to get a way better ship and I'm going to start building to that ship because I do want to do this. And because right now, one of my annoyances is the fact that it feels like your life support systems, your, you know, oxygen tank, your fire",
            "start": 796.32
        },
        {
            "text": "start building to that ship because I do want to do this. And because right now, one of my annoyances is the fact that it feels like your life support systems, your, you know, oxygen tank, your fire resistance, your fuel go so fast. Go so so **** fast. That's the point. That's the curve of the game, right? Is that I am in this and they don't want me going too far. They want me to figure everything out in this little space. And I feel like once I start feeling it, that I'm getting further and further and further and getting stronger and stronger and stronger, I think that'll be the defining factor for me. And I hope after a solid night of playing, I'll have a much better grasp on that. Colin, what are your I think it's a cool game. Like I I I uh I spent maybe a little more than than an hour through the day. We got the codes. I think this was Monday maybe when I played it because I I played uh Brutal later that night and then last night I played it again. So um it's a the positives",
            "start": 828.48
        },
        {
            "text": "hour through the day. We got the codes. I think this was Monday maybe when I played it because I I played uh Brutal later that night and then last night I played it again. So um it's a the positives from what I can see, from what I can tell. Well, I mean, it's in my head. I'm thinking about it. Uh, it's more than I can say about a lot of games that like really don't um borrow your their way into your to your mind anymore unless they're really really good. And a good game does that. So, I don't think that No Man's Sky is anything less than good. What I do think that it's going to end up being is underwhelming um in its overwhelming nature. Jim Sterling wrote a really interesting review that I I I think is required reading for people out there. Um, he didn't like the game very much at all. I think he gave it a five out of 10. But the salient he had a lot of interesting things to say and what he was saying was that a game and you know and I'm I'm generalizing I talked about it a little",
            "start": 865.04
        },
        {
            "text": "I think he gave it a five out of 10. But the salient he had a lot of interesting things to say and what he was saying was that a game and you know and I'm I'm generalizing I talked about it a little bit on Colin and Greg today is that he was talking about like we are and I've talked about this in the past as well when people bring up like Journey's 90 minutes and Unfinished Swan so short like who gives a **** like those games are great for what they are and he was saying like we're starting to we're starting to conflate scope and size with the character of a game like and that big and procedural or big and and and broad and **** endless means good and it doesn't like that that isn't true. And I think No Man's Sky um for all the marketing problems and all the hype and all the fact they could never reach what people thought it was going to be over these three plus years that we've known about it. Um I think that it's just it's too big and and and I know that's the idea of the",
            "start": 904.64
        },
        {
            "text": "they could never reach what people thought it was going to be over these three plus years that we've known about it. Um I think that it's just it's too big and and and I know that's the idea of the game  but you know I've been really fascinated reading a lot of people's critical reception of the game. The critical reception of game is not good. Like it's it's like yeah it's like very it's very I mean there are people that really like it of course but I I was going through Metacritic's uh as I explained earlier today Metacritic has this thing I don't know how long they've been doing it where they're actually compiling reviews and progress quotes uh as well which I've never seen before. Not that I'm really like looking at Metacritic all the time. And I was reading them just one by one and I'm like three4s of these are like decidedly mediocre. Some of them are just outright negative. And I'm like  that's an interesting thing because everyone's only been playing the game since Monday. So",
            "start": 946.08
        },
        {
            "text": "like three4s of these are like decidedly mediocre. Some of them are just outright negative. And I'm like  that's an interesting thing because everyone's only been playing the game since Monday. So  it has And so  these are like interpretations as of Tuesday night of of the game. And the the thing about me playing it and the reason why I I I just haven't been I want to play it. I'm going to I'm going to play it. I'm going to dump time into it. I am. I have to because I feel like it I feel like I owe it to this game for some reason. I like really see because I feel like there's like I love space. I love space exploration. I love all that kind of stuff. And I feel like  you know  there's something here for me. And when I played it  I was filled with a sense of awe where I was like  \"This is kind of cool.\" Like  I don't really know what the **** I'm doing. Uh  but I'm doing it. But what I'm realizing is that to Greg's point and from reading these reviews and just talking to friends that",
            "start": 980.08
        },
        {
            "text": "of cool.\" Like  I don't really know what the **** I'm doing. Uh  but I'm doing it. But what I'm realizing is that to Greg's point and from reading these reviews and just talking to friends that have played the game and dumped some time in  it's just it really is the same thing over and over and over again. And you can say that about any game  right? Yeah. In Ninja Guy and you're running around swinging a sword left to right over and over and over again. But that's really fun. Like that's a rewarding gameplay loop. I don't know that this is going to be fun for more than a few hours for me. And what I sense from people out there is that some people are really going to love it and some people are not going to like it at all. And I don't know that there's going to be much of a middle ground. And that's fine. Shawn Murray himself  Hello Games's  uh  you know  lead uh  said uh  himself he used the word divisive and and he thinks the game's going to be divisive. I don't think Sony did any",
            "start": 1014.88
        },
        {
            "text": "And that's fine. Shawn Murray himself  Hello Games's  uh  you know  lead uh  said uh  himself he used the word divisive and and he thinks the game's going to be divisive. I don't think Sony did any favors for this game. I think they hyped it up way too much. I think they built it into something that it was clearly not going to be. And I we talked about that for a long time. I I said from the **** word getgo when we when we when we saw it in 2013  I'm like  there's no way like like what what everyone think this team is like 15 people. There's just no way that they're going to make this game into what everyone thinks it's going to be. Yet  it's still algorithmically and mathematically super impressive. It's um a great idea. And and and that's the thing and that's the that's the thing like that's at the nugget for me and why I want to give it time and why I want to give it a fair shake. And I don't think an hour plus an hour and change is a fair shake for this game at all. I want to",
            "start": 1048.48
        },
        {
            "text": "that's at the nugget for me and why I want to give it time and why I want to give it a fair shake. And I don't think an hour plus an hour and change is a fair shake for this game at all. I want to give it a fair shake because I think it's cool. One of the big I think the reason it will be so divisive is the fact that the people who are like it's the same thing over and over again fall out of it are going to walk away with that idea and the people who are going to go into it are going to go into it full boore. And it is going to be that you you're going to have these explorers with these amazing ships who can run for hours and who can never you know don't take damage and have these guns that blast down the iron reser reserves in two sec. You know what I mean? like you're going to get so powerful that that game is going to open up and then space becomes like your oyster and you are able to travel and do all the stuff. But the people like me who are already like if and I'm not saying I'm",
            "start": 1086.48
        },
        {
            "text": "that that game is going to open up and then space becomes like your oyster and you are able to travel and do all the stuff. But the people like me who are already like if and I'm not saying I'm going to be one of them. I hope that I turn this corner and I'm totally in and I'm I get it. It all clicks. I'm ready to go and I want to be that person because I do want to be that person. I want to be somebody who plays the game a long time because I do I still am with the fact that like it feels like a great way end cap to every night  right? We have these stressful days running this business and then to go in there like all right  cool. I'm going to warp over to there. I've never been there. Oh  these planets are Oh  cool. I'm going to get this resource and I'm building to getting this new blaster cannon that I've been really eyeing for my ship or something like that. Those people  the ones who give that much time are going to be like super into. And the people who drop out early and don't",
            "start": 1120.0
        },
        {
            "text": "cannon that I've been really eyeing for my ship or something like that. Those people  the ones who give that much time are going to be like super into. And the people who drop out early and don't get to see that are the ones who won't understand. Yeah. But there's there we talk about it's like the Final Fantasy 13 effect  right? Like how much time you have to put into a game to get something out of it. And I'm simply not made of time. No one is. And like I I'm of the mind in a sense with this game  and this is just me being very candid about it  that there are people that just under no circumstances will will like it and there under circumstances will not like it. Like  and I think that there's just already camps developing or whatever. And I'm really trying to be as objective as possible and going into it. That's why  as I said when we talked about on PSV  I'm like  it's no less than good. I mean  I don't know how you can look at this game and be like  \"This game isn't good or this",
            "start": 1150.64
        },
        {
            "text": "and going into it. That's why  as I said when we talked about on PSV  I'm like  it's no less than good. I mean  I don't know how you can look at this game and be like  \"This game isn't good or this game isn't interesting.\" Of course it is. Uh it's bold and ambitious and I think that Hello Games at the very least should be commended for trying something very new and very different. I mean this is this is a game that is totally algorithmic. This is a game that is in no like when I and I talked about on PS I love you. I think when I went to the credits I wanted to see because I was really super interested. You could just go to the credits immediately for the menu and I was like I want to see how many people worked on this game because I don't believe for a **** second that they didn't outsource a lot of this **** Lo and behold that screen doesn't scroll at all. It's literally like 16 names. And I'm like  that's incredible. I thought when Sony got involved and Sony kind of picked this",
            "start": 1184.0
        },
        {
            "text": "a lot of this **** Lo and behold that screen doesn't scroll at all. It's literally like 16 names. And I'm like  that's incredible. I thought when Sony got involved and Sony kind of picked this game up as a de facto first-party game that they were gonna dump  and I'm sure they did dump a lot of money into it  but they were going to outsource this that there was probably a hundred people that were working on this game and they were just kind of keeping it as well hidden secret. And when and you see that in the credits  there are outsourced studios all all over the world that do **** like make assets or figure out a math equation or figure out a and and so I think that  you know  they should be commended. They really am. There's a great image going around of of four sequences with Shawn Murray looking more and more tired and withered and haggarded as as the process of developing the game goes on. But do I think that they overpromised with the game? I don't think they did. I think",
            "start": 1216.32
        },
        {
            "text": "Murray looking more and more tired and withered and haggarded as as the process of developing the game goes on. But do I think that they overpromised with the game? I don't think they did. I think Sony did. And I I think that that's a that's a problem because there's a problem of of optics with this game. It's the as I said before  it is the same issue that The Last Guardian is going to suffer from. They can't meet the expectations. So  you have to just take the game as it is. And I think I think the game is a respectable  bold  interesting idea. It is extremely empty  but I don't know if that's really I I don't know if that's a bad thing. It's space  but I do get the com  you know  Dan Stapleton at IGN  I read his review today. He doesn't like the game either  and you know  he uh he was saying that he hasn't scored it yet. But he was saying that the game is just empty  that there are like fighter or not fighters  I guess your ships  you can see them sometimes in atmospheres  but like",
            "start": 1250.72
        },
        {
            "text": "that he hasn't scored it yet. But he was saying that the game is just empty  that there are like fighter or not fighters  I guess your ships  you can see them sometimes in atmospheres  but like they're not doing anything. They're not like on trade routes. They're not like even code. They're just there to make it seem like the universe is full. But in reality  you're just totally by yourself. And another person I I think it was a Gamespot or or Games Radar someone said  I because I've been reading all these things. I'm actually more interested in what people think of this game than playing it at this point. Another person was saying it's fun to rename things and it's fun to find an animal and name it or find find a planet or some sort of resource or whatever. But he's like if no one's there to see it  like who cares? Like if if if I name this planet and it's one of trillions of a trillion planets and no one's ever going to see it  who the **** cares? And that's an interesting that's",
            "start": 1291.28
        },
        {
            "text": "to see it  like who cares? Like if if if I name this planet and it's one of trillions of a trillion planets and no one's ever going to see it  who the **** cares? And that's an interesting that's an interesting point that I never really thought about yet. I think it's one of those games like Journey  but like on the opposite end of the spectrum  you're going to get out of it something  as Greg said  something totally different depending on I don't necessarily know if it's time as much as it's like just energy like what like and mind share like what you what you put into it. One of our community members  I don't know his name  I saw it on the Facebook group today  is keeping a handwritten journal of his time in No Man's Sky  which I think is a **** cool idea. I would never do that because that seems like too cumbersome and laborious for me  but he's sketching things out and writing things down. I'm like  that's kind of cool because you would imagine that that's he's roleplaying",
            "start": 1327.84
        },
        {
            "text": "that seems like too cumbersome and laborious for me  but he's sketching things out and writing things down. I'm like  that's kind of cool because you would imagine that that's he's roleplaying that character. Yeah. Yeah. Um  so I think No Man's Sky is quite unlike even though it takes  you know  it's a little bit of Minecraft and Terraria and all these kinds of games  it it it's not unlike anything we've ever seen before. So  I think we need time to marinate and to figure it out because I think for a lot of people  this is going to be the game of the year and maybe even the game of the platform. And I think for a lot of other people  this game is going to crash and burn for them like and and but I think that either way  it's going to be a ma massive success for Sony. Yeah. And I think that's the thing is like we keep talking about how Sony overhyped it and did all this stuff  but like them doing that made all those things true. Otherwise  like without them having it at E3  even",
            "start": 1364.32
        },
        {
            "text": "that's the thing is like we keep talking about how Sony overhyped it and did all this stuff  but like them doing that made all those things true. Otherwise  like without them having it at E3  even multiple E3s  showing the things that they showed  what's the difference between this or Abzu where it is just a smaller game that comes out? Like  if this didn't have that hype and that platform  I don't think that it would be seen the same way. I I definitely don't think the same discussions would be going on. But the game might be that the the unfortunate truth though  it's like The Last Guardian  right? Like if we never saw The Last Guardian and they released it and they called it  you know  Project X on PlayStation 4 and we just didn't know  we would have probably that game would probably be Metacritic scored higher two points. But I guess the what matters more  Metacritics or sales? Well  both because I think that a good example of this is like I we have a pretty good authority the",
            "start": 1398.0
        },
        {
            "text": "be Metacritic scored higher two points. But I guess the what matters more  Metacritics or sales? Well  both because I think that a good example of this is like I we have a pretty good authority the order 1886 sold pretty well right on PS4. That's good for Sony. They probably made money on the game. They have this great engine now and this this high fidelity kind of engine that they're working with  but the game sucks. No one is interested in like there are very few people like I were actually authentically interested in a sequel but there are a lot of people that are like I'm never gonna play that **** ever again and if I see anything with the order on it like there's a long game to be played with a lot of this stuff too. You want both and so I I don't Sony of course wants to be profitable. They're a corporation but also on the back end you know No Man's Sky is going to be supported for a long time. It was a smart game for them to get into bed with. Um  but I I I I I guess what I'm",
            "start": 1429.28
        },
        {
            "text": "They're a corporation but also on the back end you know No Man's Sky is going to be supported for a long time. It was a smart game for them to get into bed with. Um  but I I I I I guess what I'm saying is it's just even if you've dumped dozens of hours into the game as some people have  I still think it's too early to even render any sort of conclusion because this game's just so weird. It's almost like an MMO where it's like just you have to just just relax and like kind of see how it all pans out. The game's not the the game isn't working properly right now. It's it's there's no real online functionality. It is empty. It's it's lonely. But I think that kind of gets me like I am just off of playing I am Setsuna Platinum did on PS4 a really fantastic Japanese role playing game from Tokyo RPG Factory and that game is all about sorrow and sadness. That was like what the game's all about. If you're not into that  the game's going to **** make you cry  you know? Like if you don't want",
            "start": 1464.64
        },
        {
            "text": "RPG Factory and that game is all about sorrow and sadness. That was like what the game's all about. If you're not into that  the game's going to **** make you cry  you know? Like if you don't want to be in that world  but that's what the game was about. I kind of feel like No Man's Sky is about loneliness. I mean  it's about making your own adventure. And that's the thing. And like that when we go back and forth with like what what do they say about multiplayer and and these people who have been trying to find and meet themselves and all or not meet themselves meet each other. You get to this point of I think the journal is such a great point and the the one going around on Twitter today of that weird look looking over there and seeing that weird little animal and it stops and it looks at the guy and then just **** runs at him and starts attacking him. It's like those are those moments where that are going to matter and that it is a game where yeah there isn't a story. There",
            "start": 1503.84
        },
        {
            "text": "at the guy and then just **** runs at him and starts attacking him. It's like those are those moments where that are going to matter and that it is a game where yeah there isn't a story. There isn't this thing happening. It's these moments that you'll have that you'll share that you'll talk about to your friends that are going like my stupid dinosaur spider thing today that happened like those are the ones that make that and you and if you are a guy who's like yeah I do I'm going to hang out in this system because I want to learn this language and I want to keep bringing things back to get words from these people so I can understand all them and you know decode all this and that's interesting and you know fascinating today you know someone hit us up on Twitter and was like you know I heard where you guys are he's like I just finally wrapped my head around monolith that really opens it up. You should keep doing that until you get to that point. That's going to be fascinating. Yeah.",
            "start": 1538.88
        },
        {
            "text": "where you guys are he's like I just finally wrapped my head around monolith that really opens it up. You should keep doing that until you get to that point. That's going to be fascinating. Yeah. And eventually that in I'm sorry to all the  you know  comparisons to Minecraft. I do think that this is going to be another game that's such a moving target. They're going to keep putting out these updates and it's going to be like  \"All right  cool. This is how you can see things easier. This is what now those ships are trade routes and doing all these things.\" I think that's the key thing too in the to the argument against the order 1886 thing the Metacritic stuff is that this game is going to and it depending on the people the hardcore people um playing and finding this stuff which I think that there there is already we're seeing there's that a group of people that are dedicated to that and as long as there's enough nuggets like that Kotaku is going to every day have some different like oh",
            "start": 1576.16
        },
        {
            "text": "there there is already we're seeing there's that a group of people that are dedicated to that and as long as there's enough nuggets like that Kotaku is going to every day have some different like oh this thing found this thing found for how long forever you know what I mean for the next year you know like I finished today right my session and I was like I need to go watch a couple of these videos that are like the five things to do when get No Man's Sky just to get a little jump start like what what would amplify it? You know what I mean? And that's literally how Minecraft started  right? Where it was here's this game  no **** recipes in it  and people had to start going to boards and talking to each other and checking in. I I think I think the one important thing with No Man's Sky is in we we are eager to jump to conclusions a lot in this industry and I do and I I think I think we're our conclusions whether they're positive or negative or neutral are right for us and I don't think",
            "start": 1609.36
        },
        {
            "text": "we we are eager to jump to conclusions a lot in this industry and I do and I I think I think we're our conclusions whether they're positive or negative or neutral are right for us and I don't think there's anything wrong with that. I think No Man's Sky is one of those games where we kind of have to keep an open mind like that's that's where and like and keep that open mind open for a while longer. Doesn't mean you have to play it or buy it  but I think it's going to be it's just it's just it's weird. It's not a platformer. It's not it's not a sidescroller. It's not an RPG. It's it's it's just it's kind of this weird thing. I I I just I'm reluctant even very preliminarily having played the game in a very rudimentary way. I am nowhere in the game at all. You know  I'm flying around and seeing **** but I'm like  you know  I just don't know. I don't know. I all I know is that it's it's good. Like it's it's it's good. It's it's and I I I and I think the word like I the bold bold is the",
            "start": 1644.12
        },
        {
            "text": "**** but I'm like  you know  I just don't know. I don't know. I all I know is that it's it's good. Like it's it's it's good. It's it's and I I I and I think the word like I the bold bold is the word I would use to describe it. I just think it's bold. So bold games sometimes don't work out very well. You know  I think Abzu  you guys  I know you guys talked about it last week. I think Absu is a huge miss. Like I think I think as I described it in a Seinfeld a Seinfeld uh reference  we already have a George  you know  we already have a Journey. We don't need Abzu  right? No Man's Sky. We don't have a No Man's Sky. So  it's like I I want I need I need time and I've never not never  but I it's been a long time since I've been so interested in what other people think where I'm like I don't even know what to think. Like I I want to I'm like I'm seeking out random ass opinion. I I read Jim Sterling's reviews. I I'll read a review here and there  but I'm like scouring **** about No Man's",
            "start": 1680.48
        },
        {
            "text": "know what to think. Like I I want to I'm like I'm seeking out random ass opinion. I I read Jim Sterling's reviews. I I'll read a review here and there  but I'm like scouring **** about No Man's Sky because I'm I'm just like I don't I want there I want to see like what the consensus is. The consensus seems to be ironically when you have two polar opposites right in the middle  right? Like  and it's not because people are meeting in the middle. It's because like  well  you take some of the good and some of the bad. You take the good  you take the bad. Thank you. Yeah. Take them both. And there you have. Facts. Facts life. Facts. Life. So  do you think people should play No Man's Sky? Give it a shot. Yeah. I I mean  if what's you've been hearing sounds interesting? Sure. If you're like  I hated everything about Minecraft and I hate games that don't have a narrative  then. No  of course not. But I What do you think  Paul? I don't know. I don't know. Like I I I think remember we talked",
            "start": 1718.56
        },
        {
            "text": "hated everything about Minecraft and I hate games that don't have a narrative  then. No  of course not. But I What do you think  Paul? I don't know. I don't know. Like I I I think remember we talked about often about The Witcher 3 how and we were actually talking I think Adam Boy about it a few days ago where I'm like Witcher 3 made me lose my goddamn mind because it just never stopped. Just never stopped. Never stopped throwing things at me. Never made me feel like I was making any progress. Never you know all those kind of things that concerns me about No Man's Sky because it is a thousand times worse than that. Mhm. So  in that sense  you know  if that sounds fun to you  like an endless I feel like you're going to extract and squeeze much more than $60 out of the game if you play it enough. If you're committed to it and you stick it through. Yeah. But I think that if you you should probably watch some videos. You probably I would wait. I mean  I don't I don't What's the rush? The",
            "start": 1754.24
        },
        {
            "text": "If you're committed to it and you stick it through. Yeah. But I think that if you you should probably watch some videos. You probably I would wait. I mean I don't I don't What's the rush? The game's probably going to be patched again soon. Like I we've waited so long for this game. If you maybe wait a few more weeks and see what people really think and some people you trust like have render final verdicts and no you know Hello Games maybe releases another patch and stuff. Remember the game radically changed with the patch the day one patch like radically if you read the I've never seen patch notes like that in my **** life and with a launch game in my actually or a launch patch. In fact I don't I don't know if I've ever seen a patch like that ever and even one a year after the game came out. It's like they're like we changed everything. You know it never I don't know if you saw the patch it never stopped. Yeah it was like we changed this and oh we changed the entire game. Okay",
            "start": 1791.28
        },
        {
            "text": "out. It's like they're like we changed everything. You know it never I don't know if you saw the patch it never stopped. Yeah it was like we changed this and oh we changed the entire game. Okay cool. You know and uh the one thing that concerned me about it which people said was mitigated by the patch was that people already had the platinum trophy which shows you that not that trophies are indicative of length or quality of a game of course but shows you that you can see and do everything in the game because the trophies are all like see this many things and achieve this title and all this kind of stuff. People have it. So another thing to be a little concerned about begun but be openminded.",
            "start": 1826.48
        }
    ]
}