{
  "id": 1958,
  "video_id": "tN6ae2XWOlM",
  "show_name": "Gameplay",
  "hosts": ["Tim Gettys", "Kevin Coello", "Geneviève St-Onge"],
  "title": "Deus Ex Go Breaks Kevin - Kinda Funny Plays",
  "description": "Deus Ex Go is awesome and can get really tricky. Watch it break Kevin.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
  "published_at": 1470240005,
  "duration": 2432,
  "transcript_chunks": [
    {
      "text": "What's up guys? Welcome back to Kinda Funny Games. I'm Tim Gettys. This is Iten. This is Kevin Coello the GoPro. And this is Genevieve. You know Kevin. These guys Square Montreal. You might know them from Tomb Raider Go. Lord Croft excuse me. Jesus I You might know them from You might know them from Deus Ex Go which we're playing now. Yeah. What do you What do you do over there on the game? Uh game designer. He designed that **** Okay. Here we got Kevin. He beats that **** That's what he does here. So you we kind of got to play a little bit at E3 right? And uh he did a really good job. Genevieve you were very excited. I was fine. How good was I did just as normal as anyone else. No, you did it very quickly. Took about 4 minutes and then again I don't think that's a real number. It was only four minutes and then we dubbed you Kevin GoPro Coello because you win every Go game. There you go. You're in there now. So now I've I've definitely forgotten everything. I I I don't",
      "start": 0.08
    },
    {
      "text": "It was only four minutes and then we dubbed you Kevin GoPro Coello because you win every Go game. There you go. You're in there now. So now I've I've definitely forgotten everything. I I I don't The game is supposed to teach you. So that's fine. So tell us a little bit about the game. What is this? So this is Go is like you said there were Lrop Go and uh and Hitman Go. They're basically uh simplification like distillation of the big franchises. So when you have like when you play Tomb Raider, you feel a certain way, you do certain things. These are uh things that we wanted to get back into Lov go for Deus Ex. It's it's completely different just because of the franchise itself. Uh it comes from a way different place. It's like near future kind of sci-fi dystopian a little bit. But it also like on a gameplay level it's all about the augmentations, the hacking stealth and bringing that into go gives us a different like feel to play with basically. Awesome. So the go games have always kind of",
      "start": 44.72
    },
    {
      "text": "on a gameplay level it's all about the augmentations, the hacking stealth and bringing that into go gives us a different like feel to play with basically. Awesome. So the go games have always kind of been like this like board game take on the the different franchises. So what's the the different uh gameplay because of the Deus Ex a lot coming from Deus Ex it's like one of the main thing that we've been seeing here is this guard guy when he sees you he turns on his shield he's going to see you on the whole line and he's chasing you. So, it's one of the most like smart enemies that we've had in a go game because like the other enemies like let's say the guard in Hitman Go just kills you if you're right there. This guy sees you from afar, turns on his Titan shield and chases you. So, like you're in danger when he sees you, which is another thing that we had before. Kevin just did the thing that we fixed on Hitman Go, which is you never get stuck pretty much. And so, he restarted the level cuz",
      "start": 96.72
    },
    {
      "text": "danger when he sees you, which is another thing that we had before. Kevin just did the thing that we fixed on Hitman Go, which is you never get stuck pretty much. And so, he restarted the level cuz he wanted to start fresh. Yeah, it's one of the things we try and design the game so that you don't get stuck, but you can still like restart if you want to, but usually whatever you do, you can just like let time pass basically like waste some time in two like safe nodes puzzle will reset cuz these guys when they lose sight of you um they go back home and once they're there it's the same puzzle as before. So you can kind of play with it in a way that's that becomes less frustrating over time. you don't have to restart it. If you do a bad move, you just flee and start over. So, it's something that we've learned from the other Go games is making making a a playground more than having like a really strict rule puzzle so that basically flows better when you play it. I like how in a in Loft Go",
      "start": 146.72
    },
    {
      "text": "we've learned from the other Go games is making making a a playground more than having like a really strict rule puzzle so that basically flows better when you play it. I like how in a in Loft Go there's like a there's a narrative that kind of goes through it where it's like as you play the levels there's a lot of background environment storytelling going on, but there's not actual any like written words or anything. But here there's like a lot more story elements going on as you play. It's one of the things we kind of grabbed from Deus Ex also because it's such a core pillar of the franchise having these conspiracies having these uh like the the really like involved story from the Deus Ex. We didn't want to do the same thing obviously uh as that but we still wanted to pay a nice homage to that having not had it in the game. So, it made it I know what I did wrong in the game in a way that is not as in-depth as like Mankind Divided obviously, but it's still like something we want to play like",
      "start": 191.68
    },
    {
      "text": "not had it in the game. So, it made it I know what I did wrong in the game in a way that is not as in-depth as like Mankind Divided obviously, but it's still like something we want to play like we want to have these character do some stuff in the game. Narratively, it takes place before Mankind Divided, but it's the same um environment. Jensen is undercover in the Task Force line. He's also working with a with a group uh hacker group um on the side gathering information and all of that. So that's the this that's a school that we work with, but it's still like what Jensen does before. So Gotcha. So what what is it, right? So he was able to pick up the energy, which is what enables you to use your augments. It's pretty cool. Every time you pick one up, you can use it. And in this case, uh at this point in the game, there's only the cloak enabled. Later, you see other ones like rem hacking, uh EMP shot, and all of that. Uh it wouldn't make sense right now to have the remal hacking. We",
      "start": 235.76
    },
    {
      "text": "at this point in the game, there's only the cloak enabled. Later, you see other ones like rem hacking, uh EMP shot, and all of that. Uh it wouldn't make sense right now to have the remal hacking. We don't even have the hacking yet in these levels. They're gonna come later in two levels. In a couple of levels. Yeah. Uh but this is also an example of how we want to do the Deus Ex versus Deus Ex Go thing where we want we know hacking is a huge thing. Uh let's say like your your first time hacking a turret in the Deus Ex feels good. It feels really nice. You want to like you you turn it against the enemies. you just step back and see the magic happen, right? It's something that we really want to have in the game, but in a way that's that's different. In a way that makes sense for our game. So, all of a sudden, we have this. Oh, no. I hit the wrong button. It's fine. You can go back. It was never go amateur. Well, look at this. What What is What is this? I want my Vita. When's it coming to Vita? We're",
      "start": 286.4
    },
    {
      "text": "we have this. Oh, no. I hit the wrong button. It's fine. You can go back. It was never go amateur. Well, look at this. What What is What is this? I want my Vita. When's it coming to Vita? We're We're making it for mobile first, let's say. All right. But then immediately after yeah I I got trained by her. But the thing is it's it's basically a tiny studio. We have this game was started like four people. We're now like 10 or 1 people. We've always scaled up the production team at least 1 people. That means it's also like we focus on making the game first and we'll see uh for the rest of it later. So Jen, what are you most excited about then for this is your now third Go game that you've been a part of. What are you excited about this one? Um, clearly the team has stepped their game up when it comes to mechanics. We are the meanest we've ever been, but also the smartest. Uh, the mechanics are introduced in much more seamless ways and then you can combine all those crazy things. And so",
      "start": 333.44
    },
    {
      "text": "it comes to mechanics. We are the meanest we've ever been, but also the smartest. Uh, the mechanics are introduced in much more seamless ways and then you can combine all those crazy things. And so the major difference that is coming to this game in specific is it's kind of solving an issue that we not an issue but a challenge that we had. Meaning that people were burning through the content after two days and we were all sweat and blood and tears of shipping the game. They were like we want more levels. It's so good. We want more levels. We finished it cuz our audience is kind of hardcore for the mobile platform because our franchises are hardcore too. And so, um, yeah, we were like, okay, how do we fix this problem? Because we're a super small team, and so it's hard for us to make handcrafted content to the same pace as people are burning through it. Um, so we're coming up after launch, we're coming up with a level editor that's called the puzzle maker feature. Um, and it's going to",
      "start": 379.6
    },
    {
      "text": "content to the same pace as people are burning through it. Um, so we're coming up after launch, we're coming up with a level editor that's called the puzzle maker feature. Um, and it's going to be essentially allowing you to make really mean, really mean levels, userenerated content. Exactly. And that's what Kevin is going to be faced with in a minute is the meanest levels. Why I enjoy this game? But like from the get-go, the the challenge was that and this game was created from the very beginning as something that uh we should be able forot about the turret, guys. It did not forget though. Nope. Did it again. Did it again immediately after. Yeah. And yeah, since the game was made from the get-go with that in mind, we still have like even though the puzzle maker doesn't come out with the game because we want to iron out everything with it before we we give it to people, we still have uh he dodged a bullet there. Oh, no. I thought he was going to get stuck. Uh, nope. I don't see why",
      "start": 427.76
    },
    {
      "text": "game because we want to iron out everything with it before we we give it to people, we still have uh he dodged a bullet there. Oh, no. I thought he was going to get stuck. Uh, nope. I don't see why you would. Does when he gets shot, doesn't he get stuck? He's He's got this Titan Titan shield on, which you don't. Got it. Got it. Got it. It's getting trickier. No, I figured it out. I I I just thought he was going to get stuck. So that was my title. Yeah, don't lose the title, guys. I don't think it's one of those kind of titles. I'm pretty sure it is. If you can't have it, no one can. All right. So, the idea here is that there's no reason for him to I got Don't worry about Oh, it charged. He's dead. And then shut. He's dead. It's done. It's done. You all wanted him dead. He's dead. I'm proud of you, guy. Yeah, thank you. Good job, dog. So, yeah, so we have the back end now to actually have seamless content uh in without making an update on the app store without doing any work",
      "start": 479.6
    },
    {
      "text": "I'm proud of you, guy. Yeah, thank you. Good job, dog. So, yeah, so we have the back end now to actually have seamless content uh in without making an update on the app store without doing any work yourselves. You just It's genius. Actually, the game has the engine to process data that we can just put there every week. We can put five levels every week uh for people to play. Awesome. And it's just like you finish the game, you go there, you add different things. Yeah. And we we were inspired a little bit by the the crossword puzzles in the in the New York Times where it gets like harder every day and on Sunday you're a monster if you're able to do it. But like we have this this thing where on Fridays it's going to be a hard puzzle. Uh but we we'll have puzzles for every so it's not about being like evil per se. It's only about having more content than before because it was really like but but the thing is the mechanics are there and they're pretty deep. So, there's like there's room",
      "start": 530.4
    },
    {
      "text": "being like evil per se. It's only about having more content than before because it was really like but but the thing is the mechanics are there and they're pretty deep. So, there's like there's room there to have something evil, which which like Yeah. Oh, I got it. I got it. It's a two-step thing. You can do two steps and it's going to wear me with this. So, what's going on here? So, you have the there's the blue power up. What does that do compared to the yellow? What he did right now is is hacking the turret so he could walk in front of it to grab the augmentation because then um he has to go back and hack the other turret cuz the augmentation the the cloaking only lasts for one turn. So he couldn't walk both turn both turns in front of the turret without dying. So he had to go hack it in order but the other one you could clo past. That's what he did. I wasted a turn going for the extra. Yep. It's fine. Come on. I don't think you did. I think you wasted time. Well, I wasted one",
      "start": 578.56
    },
    {
      "text": "it in order but the other one you could clo past. That's what he did. I wasted a turn going for the extra. Yep. It's fine. Come on. I don't think you did. I think you wasted time. Well, I wasted one step going forward and then coming back. What does What does that matter? Doesn't matter. It doesn't matter. There is no trophy. The imaginary platinum trophy. It's going to matter cuz if you look at this here in the bottom corner, it says three steps and you can complete this level in 18. Eventually, it's going to matter. Today does not matter. So, if you want the platinum or if you want like the achievements cuz there's no platinum. Uh if you want the the achievements, you're going to have to have all of them in the least amount of steps possible. So, you have to be efficient and that's what makes the game so much fun. The longevity of it increases in my mind. So, that's one of the one of the hackables in the game. Uh, in this environment, you can hack the the actual puzzle. Mhm. And",
      "start": 624.16
    },
    {
      "text": "makes the game so much fun. The longevity of it increases in my mind. So, that's one of the one of the hackables in the game. Uh, in this environment, you can hack the the actual puzzle. Mhm. And some of the nodes in the puzzles you can't reach unless they're actively being hacked by you. That means like you basically have to shape how the level works. Uh, you can break line of sights with that. You can trap enemies on them. If there's an enemy on it, when you undo it, uh, they're going to die. Same thing with you. If you get stuck on it when something unhacks one of the terminals that you hack, you get killed. Um, so you said Vita when So that's our entire E3 interview with Kevin. Was that just Vita questions? It wasn't even an interview though. We just hang out. Just just Kevin. That's how he is. Kevin Kell is the type of guy that will just will not stop hounding you until something happens. So, I feel very very sorry for for your entire It's one of the guys who who bought a Vita I",
      "start": 671.36
    },
    {
      "text": "he is. Kevin Kell is the type of guy that will just will not stop hounding you until something happens. So, I feel very very sorry for for your entire It's one of the guys who who bought a Vita I guess is what you're saying. Oh, yeah. No, that's true. That's that's absolutely true. I feel sorry for Greg. I feel sorry for Colin. I feel sorry for everybody on Vita Island. I love my Vita. I love my Vita too. It's a good machine, but it's not the 3DS. So, anyways, so um are we ready to like challenge Kevin to the death? I think uh yeah, there's a few things he hasn't seen yet. He's going to figure them out. I think he will figure it out. No, that's better than me. He's not going to figure it. No, I had to wait. I had to wait invisible then get them. So you guys since the GoPro you guys made some custom levels using the userenerated Exactly. We wanted to show that off and we came back to the office after E3 and we're like who is the level designer? Who's this guy shut up about the Vita?",
      "start": 719.84
    },
    {
      "text": "some custom levels using the userenerated Exactly. We wanted to show that off and we came back to the office after E3 and we're like who is the level designer? Who's this guy shut up about the Vita? Greg Miller. It's like no, not Greg Miller. It's Greg Miller's other guy. Okay cool. We sat down and we're like, \"Okay, you know all those crazy levels you made that we cannot use in the game? Bring them back out. Bring them back.\" Did we say Vita? We're talking about It's coming. It's a nightmare. We want you. Hey we won. You know these nightmares where like anything you say does like it just doesn't matter. It just you just say things and and things. Welcome to my life was great. That's kind of that's kind of all that ever happened. So, all right. Hold on. We'll let him like this guy. He's into it now. He's like he's getting want to make it right. Yeah. But you see he figured it out. Yeah. He will need this this sort of wit for and and and sharpness of mind for the next puzzle. I mean",
      "start": 767.68
    },
    {
      "text": "into it now. He's like he's getting want to make it right. Yeah. But you see he figured it out. Yeah. He will need this this sort of wit for and and and sharpness of mind for the next puzzle. I mean when you talk about wit when you talk about sharpness you're talking about Kevin Quill. Oh. So let's let's bring it on. All right. So basically like we wanted to to flex the some of the features in the game and we we built that's not it at all. We wanted to to show the fact that like every day you come back there's going to be levels for you there. Um not necessarily harder but usually like around the team or different kind of ideas and all of that. Uh should we go directly to like a special puzzles or can No let's go with the first one. Do as you feel. That's a Monday. We'll get to the Friday soon but that's a Monday. All right this is a Monday. So this is your Monday. We got to go through the different days. It's different. It's not something that we would have. Sorry I'm seeing a bit",
      "start": 813.6
    },
    {
      "text": "soon but that's a Monday. All right this is a Monday. So this is your Monday. We got to go through the different days. It's different. It's not something that we would have. Sorry I'm seeing a bit more happening. There's a lot happening, but it's also way more abstract. It becomes like this kind of uh this abstract space that is just a level, you know? It's not a mansion. It's not like a secret lab. It's not any of that. It's a it's a level. And we based this level around the idea of having a lot of augments. And we have to uh warn you right now, you have access to two different augments in this level. So you have access to cloak. You also have access to remote hacking. So this means you can when you use your augment, if you tap on Jensen, you're going to cloak. If you tap on a remote terminal, you're going to hack as if you were sitting there. So you have to keep that in mind with this. This is something I haven't done before. What happens when I'm cloaked? Walk into something",
      "start": 862.32
    },
    {
      "text": "terminal, you're going to hack as if you were sitting there. So you have to keep that in mind with this. This is something I haven't done before. What happens when I'm cloaked? Walk into something visible. So become visible. Well, I'll just see. You'll see. Cloak lasts for a full turn. So, you're full. A turn. One movement that that was one turn and like he cloaks out at the end of the the other. So, it's kind of where it's the board game roots of the go series, which is like a turn is when you use it until when you could use it again. Gotcha. Huh? Yeah. All right. So, do that. So, like I won't be able to go on this thing, but Guys, let me handle. Let me I got this. The rest of this show is only going to be about us making weird sounds. It's one of these games where when you watch somebody play and you know the solution. It's kind of hard. But he's getting there. Playing go games in front of other people. It's actually the worst thing cuz you feel dumb if you fail. Always. Yeah.",
      "start": 906.64
    },
    {
      "text": "play and you know the solution. It's kind of hard. But he's getting there. Playing go games in front of other people. It's actually the worst thing cuz you feel dumb if you fail. Always. Yeah. You're good though. You got this. It's funny when others are also like, \"Oh, I'm going to do that.\" And it's like, \"Please, you don't know.\" Hey, Mr. Game Designer. You don't know. So, uh well, there's a visual bug for one, but I also think I didn't see anything. I I also think that this puzzle was broken. No, stop saying that. Kevin's just broke it. Let's go to four. Let's go to four. You were saying this one. Well, that was the one for you. There's going to be a little boot camp from me uh about mechanics right now cuz in the game it's going to be seamless. Uh oh, no. Nothing new in this one. Okay. Only things you know if you want to make sure like what augmentations you have in this one. It's only cloaking. Yeah. I like calling invisibility. Invisibility. I think the technical term is glass",
      "start": 955.76
    },
    {
      "text": "Only things you know if you want to make sure like what augmentations you have in this one. It's only cloaking. Yeah. I like calling invisibility. Invisibility. I think the technical term is glass cloaking something. Patrick can help me on that one. But the technical term now what's this little guy over here? Little spider guy. Is he making you the This is a call back to other Go games. It's the It's the It's a robot, so he's dumb. It's the one that when you go in front of him, he kills you. It's the snake. It's the snake in go or the blue guy in the hip and go. Yeah. Oh, right. He undoes the thing. Mm- Damn. That's annoying. Oh, now there's another one. What's the matter, Kevin? Oh, dear. I didn't see it. I think you didn't see it. I didn't see it. We You need to pay attention. You guys got to stop talking so much. **** I **** up. I should have gone that way. All right, give me a second. Give me a second. It's fine. It's fine. Look at him. Take your time. That was sad. I believe",
      "start": 1006.4
    },
    {
      "text": "got to stop talking so much. **** I **** up. I should have gone that way. All right, give me a second. Give me a second. It's fine. It's fine. Look at him. Take your time. That was sad. I believe in you. We saw one of the cool animations, though. He was invisible and the guy just bumped into him and take them out. I believe in you. Yeah. This is a lot of stress. I just want you guys all to know that. It's good. Stress is good for your heart and like overall longevity and everything. I'm so excited at the thought of Greg watching this. Like he's going to be sitting as it at his desk being like, \"Nerd.\" How does it feel, Kevin, that you have a new arch rival in life? I had an enemy before and now he's Canadian. This is a This is a global scale threat here, Kevin. Mhm. This is stressing me out. Tell Tell us what's going through your head. What do you think? Yeah. Well, like why is there one over here that I can't even see? See that guy right there? Mhm. He's just chilling right there.",
      "start": 1060.96
    },
    {
      "text": "out. Tell Tell us what's going through your head. What do you think? Yeah. Well, like why is there one over here that I can't even see? See that guy right there? Mhm. He's just chilling right there. You can pinch. Have a little bit of with the Vita. Way simpler. Oh my god. Oh yeah. Wait, did they did it here too? So who needs a Vita? Everyone. All right. Take us through your logic. All right. So if I move down here, silence for 50. Well, no, cuz I got to think. Take us through your log. I'm just I'm going to act. I'm going to act. Act think about think about like what resources are in there. because it's their X. Every enemy can be a resource. Every augment that you have should be used in a way that you don't use them after being seen, for example. I'm just wondering, he's going to come down immediately if I go over. And also, your your cloaking is going to expire. Yep. Yep. Now, it's gone. And it doesn't regenerate. Nope. It's not one of these. Yeah. I know. Got to restart. Give me a",
      "start": 1111.04
    },
    {
      "text": "immediately if I go over. And also, your your cloaking is going to expire. Yep. Yep. Now, it's gone. And it doesn't regenerate. Nope. It's not one of these. Yeah. I know. Got to restart. Give me a second. Uh oh. He's going to smash it right when Yeah. When he But but but there's exploration like this guy now saw you on the other side. Oh boy. Oh boy. Oh no. Okay, you got this. Yeah. Well, no. Now I'm all stressed out. You guys are looking at me. All right, I'm going to give you the one tip is that like be patient with the augment. You're going to see when you have to use it. All right. And just explore without dying. You're going to get there. It's usually one of the rules we have for design. If if your next move doesn't kill you, try it. See what happens. And that's something that we used to teach people about the mechanics in the game. Like in the first game, in one of the first levels, you can either like walk right in front of somebody and die or do the only other solution because",
      "start": 1167.6
    },
    {
      "text": "to teach people about the mechanics in the game. Like in the first game in one of the first levels you can either like walk right in front of somebody and die or do the only other solution because I know I know it but a step after. I'm just trying to troll you because some of the guys that see you aren't a big problem. Oh you're going to learn something. You're going to learn today. You're going to learn. These games are Oh I shot my What? I shot at the guy behind you. I didn't see you. Oh cuz I was invisible. Such great games. Did you Did you see the name of the level? I thought we were friends. That's really funny. That's awesome. Oh man. Yes. Now you have to be like \"Oh what did I just do? How did I How did I get to where I was?\" So stressful. Yeah. Oh that was a waste. Now I'm stuck there. You should go up there. Mother what's going to happen when I go up there? Dog **** gets shot. Oh I love that. That was great. Now you're going to die. Yeah I know. That's true.",
      "start": 1226.56
    },
    {
      "text": "I'm stuck there. You should go up there. Mother what's going to happen when I go up there? Dog **** gets shot. Oh I love that. That was great. Now you're going to die. Yeah I know. That's true. Yep. They'll shoot me too bud. That was pretty funny. I mean it's it's tricky cuz if I go down um but I'm there I can hack it. So there's only one thing you haven't tried yet. It's it's hacking. Hacking. Yeah. Yeah. You're going to see something like Do do it. Just hack it. Hack what? Hack it and then survive. Hack that platform. That's another hack. You guys are freaking me out. I don't like that. Yeah. Yeah. And then like walk down. Don't die for Don't tell me. Give me 0 or 30 minutes. I'll figure it out. Oh he he broke Oh but now I can go without him seeing me. No. No. You were You guys stop You slowing down the thinking process. You should actually stop. You're right. But it's hard now. You Yeah you I'm screwed. Yeah that was a **** up thing to write in the the bottom there.",
      "start": 1295.92
    },
    {
      "text": "stop You slowing down the thinking process. You should actually stop. You're right. But it's hard now. You Yeah you I'm screwed. Yeah that was a **** up thing to write in the the bottom there. All right. All right. Oh you're going to be so happy once you finish it. If I finish it at this point then No I feel like Okay you got this. Okay so you know I believe in you now. You get it. Yeah maybe you guys can help each other cuz we can't actually help. We know the solution. Get mad at us. I went the wrong way. But it's fine. We can just wait some time. Wait he's going to go back. It's fine. All right back **** Oh what happened there? I think you wasted. Uh yeah you tapped and swipe or something. Okay you can also put it down on a table if that helps. No it doesn't. No you need to try. Doesn't help at all. I know. I I'm just I'm I'm all You're supposed to go invisible. You are actually good. So what do you know about the guards? They suck. They like to kill me. They",
      "start": 1363.0
    },
    {
      "text": "need to try. Doesn't help at all. I know. I I'm just I'm I'm all You're supposed to go invisible. You are actually good. So what do you know about the guards? They suck. They like to kill me. They they break line of sight for each other right? Uh but he's so close. I'm sure he's gonna get Yeah I know. I know. I know. I know. I don't like the way you guys are talking. Like I'm not here. I believe in you Kevin. Go. Go. Oh yes. That's good. Stop. Stop it. That bastard. What a dick. Oh so he already saw me. Yeah he turns around and sees you. Mhm. And then he's going to move next turn. But um if you if you go there can you have him chase you? Hold on. Hold on. No he's getting it. No I'm not. No you're good. If you do that get it now. Stay alive for a while. Yeah stay alive. All you got to do is stay alive. I don't like that you guys told me this. You tried it. That's the first thing you did and for some reason you didn't like No. Yeah that could work. It can work cuz I'm in",
      "start": 1413.44
    },
    {
      "text": "got to do is stay alive. I don't like that you guys told me this. You tried it. That's the first thing you did and for some reason you didn't like No. Yeah that could work. It can work cuz I'm in the dead end. No that's where I go now. Oh it doesn't work if he's going to get Look also if I kill him this There's a drone. Snake's going to Yeah the snake. The snake. Hi technique. Yeah it's a fancy snake. See? See? You went You went right but left. Yeah totally open. And now we got it. Whatever. I'm gonna get one kill. Nope. I went the wrong way. Again I need my I need my D-pad. You know you need time to think about it. Some calm which we don't provide. No not at all. This is super stressful. The game's making fun of me. Tim did a game ever make fun of you? A game that I love. Yeah thank for that. Yeah that was a good call. I like that a lot. I want to go down. It's fine. The other one is evil. This one is just merely like kind of hard. Oh no. The other one is actually something",
      "start": 1486.32
    },
    {
      "text": "for that. Yeah that was a good call. I like that a lot. I want to go down. It's fine. The other one is evil. This one is just merely like kind of hard. Oh no. The other one is actually something special. This is when I told everyone that I'm I'm not as good as as they claim. But I don't think anyone would be like these are hard puzzles that we use like the limits of the go down again. I think. Now now you're telling me completely how to do it. I No I didn't. He said he thinks. Are you hearing voices? I I didn't say anything. You got to see this. No. What are you whisper about to fall? You go down. Yeah. No. If you Oh I go left. You need to enable. What if you do anything you want? Wait. Okay. Huh? What if you could become whatever you wanted? No cuz he's locked now. He was locked. No I I swiped left. I hate these eyebrows. Bring me a Vita for Christ sakes. Somebody. You're just saying that because you're angry at us. If you like it better you can tap on. Don't take it out on",
      "start": 1539.16
    },
    {
      "text": "No I I swiped left. I hate these eyebrows. Bring me a Vita for Christ sakes. Somebody. You're just saying that because you're angry at us. If you like it better you can tap on. Don't take it out on on the iPad. You made me forget the solution to this puzzle. Don't worry I figured it out. I can still spoil it. I know. I know. I know the solution. I've played enough of that game. I know how it works. Yeah. You made this. We'll get through it. Yeah. You're good. Oh yeah. He's totally fine. Okay. Well you guys told me how everything. It's not over after this. I know. And then you'll tell me the next part. Oh god. So I have nothing don't you? You got your wit. You got your augment still. Check. Oh man. This is the good part. Oh yeah. There's going to be a light bulb. Pay attention. I don't know. I'm scared. So now what we do in play tests when people get stuck and everything because we don't want to give solutions is like what's your goal here? Where are you going up",
      "start": 1596.64
    },
    {
      "text": "attention. I don't know. I'm scared. So now what we do in play tests when people get stuck and everything because we don't want to give solutions is like what's your goal here? Where are you going up there? Okay. What's blocking you? All these dudes. What do can you do about any of that? Turn invisible. Go in front of him. But then I'm visible there. Oh but no. Did I do it wrong? Uh not yet. But now yes I think so. I think I think so. Is that because I can't kill him because he's got his shield his like rock shield on. These guys are Yeah blocking. And if I step forward without the invisible what do you think the solution would be to to like taking care of these guys? No but then that'll kill. Oh so I can step forward before getting killed hack it right? And then it's visible. No but then it goes to kill me and it dies. And we both die. Do it. Do you want Yeah you're you're stuck now but you have all of the pieces of the puzzle. Yeah. Nice. I have most of the pieces. Yeah",
      "start": 1655.44
    },
    {
      "text": "but then it goes to kill me and it dies. And we both die. Do it. Do you want Yeah you're you're stuck now but you have all of the pieces of the puzzle. Yeah. Nice. I have most of the pieces. Yeah cuz you guys were like \"Hey look at all these pieces.\" Yeah the turret kills you. So that Sure does. Yeah. Sure does. That's what turret turrets do. And this is even This isn't the hard one huh? It's kind of hard. It's hard because it's like it uses the limits of the mechanics and everything. Um shouldn't you even see me? The node is off. Like there's a there's a glitch in this level right now. Got it. Not literally. I'm just saying like these nodes don't work until you plug them in and then he's going to see understood now. And the idea here is that this guy Why did I Well why did I go that way? Why did I go that way before you hacked it again? Uhhuh. Uh the guy was stuck there. Remember that? Right. Right. Right. That was helping you in a way. What? Why? Why? This is what we need.",
      "start": 1713.36
    },
    {
      "text": "that way? Why did I go that way before you hacked it again? Uhhuh. Uh the guy was stuck there. Remember that? Right. Right. Right. That was helping you in a way. What? Why? Why? This is what we need. It's super silent. Yeah. Yeah. Be quiet. Let's give him this one chance. I like when you guys are talking about the game and I'm just kind of chilling. So the cool thing I can I can talk about cool tech right now is that when we came here I don't know like a half an hour ago these levels weren't on the iPad at all. We just downloaded them from the from the server and just loaded seamlessly in the the game which is super cool because there's actually uh that's the way we're going to give like regular puzzles to everybody. And that's super cool. Yeah. Much easier than pushing updates to the app store and then people need to redownload the update and so this is a lot more easy. Yeah focuses the future updates like in features and like different game mechanics maybe or even like we",
      "start": 1771.2
    },
    {
      "text": "the app store and then people need to redownload the update and so this is a lot more easy. Yeah focuses the future updates like in features and like different game mechanics maybe or even like we talked about getting tricky. We talked about the puzzle maker but like we can focus on that instead of like hack just creating more uh No no. Oh there it is. I went to hack it again. Yeah that sucks. Cuz this is not the right way to play. Oh my god. Put it on the Vita guys. Put it on the Vita. All right. Um I'm not saying he said he he was going to do the right thing he would he would solve it eventually. I think you want to try the other one just to change like he's so close to getting it. Yeah. But maybe like you know we've played these games before and we know that like at some point you just walk away. You come back like an hour after that. Do you? I stay up for hours playing that. You just like solve it right in like two seconds and you're wondering what even happened before like",
      "start": 1818.56
    },
    {
      "text": "just walk away. You come back like an hour after that. Do you? I stay up for hours playing that. You just like solve it right in like two seconds and you're wondering what even happened before like that you didn't get it right. I think it's one of these situations cuz maybe maybe can I interest you in like not doing that? Oh. Oh what? Not not locking him. Oh that makes a lot of sense. You're so smart. No it's just you can still undo it. Yeah. Can I maybe interest you in not doing that? Just like slide away. There he goes. There he goes. That was the most polite You just **** up kind of thing. So now every like just all of the doors are opened for you now. Almost. You you just like you still you still got to work a little bit for it I think. But you you had the right idea earlier. Mhm. Now you're right. The light bulb moment has happened. Yeah. There we go. Cuz now Oh but I can't reach it. Ah I can go around. These little like tiny little puzzles are fun. A lot of fun. Good",
      "start": 1876.64
    },
    {
      "text": "Mhm. Now you're right. The light bulb moment has happened. Yeah. There we go. Cuz now Oh but I can't reach it. Ah I can go around. These little like tiny little puzzles are fun. A lot of fun. Good job on that. Oh it doesn't kill him. He has a shield. Welcome to part two of the puzzle. Damn it. That one killed me. God damn it. Yeah. puzzles inside of a puzzle. Do you give up? No I don't give up. This is going to be a long let's play. Everyone get comfortable. Grab some snacks. Go grab a drink. And after you beat this one I can probably assure you that if you go grab a drink right now when you come back it's not going to be solved. So you're not like missing anything. What? That's mean. He's just starting. They They made They made a hard a hard puzzle. It's This is hard. Very true. You're so close though. Yeah. Yeah but I'm not close at all. Yeah you are. No. God damn it. I D-pad. Give me a D-pad. Come on. I think there are D-pads for iPads. iPhones. It's a gigantic freaking",
      "start": 1930.48
    },
    {
      "text": "You're so close though. Yeah. Yeah but I'm not close at all. Yeah you are. No. God damn it. I D-pad. Give me a D-pad. Come on. I think there are D-pads for iPads. iPhones. It's a gigantic freaking Dad. Yeah I know. So what do you do for this game? I'm the game designer. And uh you guys were just like \"Oh I'm going to **** with Kevin.\" Yeah that sounds fun. Yeah. Well that was Jen but we said \"All right you know what? That's something I could stand by.\" We think we thought about it. We've been trying to **** with him for years. We thought about it and we had everything we could like we needed to do that and make it happen. So you know I love your games right? We thought you would think it's a like a thoughtful experience like a thoughtful It hurts. Love it hurts Kevin. Mhm. It's so tricky. Tim help me out. What? What are your thoughts here? Cuz I So what happened? What went wrong the last time you were in this position? Oh I should have just gone left instead of",
      "start": 1992.64
    },
    {
      "text": "Mhm. It's so tricky. Tim help me out. What? What are your thoughts here? Cuz I So what happened? What went wrong the last time you were in this position? Oh I should have just gone left instead of right. No no no no. Like too late. Too late. I already did it. I already did it. Yeah I already did it. You see that? You done it. I think you Yeah I think you're stuck actually. Oh god. Yeah I'm dead again. What were you going to say though? Maybe he's going to forget it before next time cuz he's blocking the turret right now. He's blocking the turret. But but why is it not like what why is that not efficient? Because he's wearing a shield. Yeah. So when he comes back does he wear his shield? Yeah. When when does he lose his shield? After he hits his base. Yeah. There's a platform you're playing with. Maybe can I How do you How do you look at it? Give me a V. Binge. Oh no. They bug met you. Oh I know. Too much pitch. Everybody close your eyes.",
      "start": 2056.48
    },
    {
      "text": "there. Yeah. There's a platform you're playing with. Maybe can I How do you How do you look at it? Give me a V. Binge. Oh no. They bug met you. Oh I know. Too much pitch. Everybody close your eyes. Oops. There we go. Why is it so slow? Because it's beautiful. Oh yeah. It's so pretty. Let's see. This game beating me. No in the end we're just messing with you. You can't really publish it. Yeah. Oh my god that is so messed up. Oh boy. No you guys don't do that. You guys wouldn't do that. I I know you guys are good enough to know you would never do that to me. It's true. I did forget like for a while I did forget the solution because I'm like I I'm so empathic with you. Like I'm in it with you that I kind of forgot where where we were going with that. But Pang is probably holding his face with both hands just finding this completely amazing. Yeah cuz this is not even the hard one right? There's one that's that's just even trickier than this. It's hardish. It's Yeah it uses",
      "start": 2106.96
    },
    {
      "text": "his face with both hands just finding this completely amazing. Yeah cuz this is not even the hard one right? There's one that's that's just even trickier than this. It's hardish. It's Yeah it uses more abstract ways of dealing with the mechanics. Careful. Go. I know. Give me a second. I don't want to go back up. No it's fine. It's fine. No I did it. She told me to do it. I did it. Now he's stuck there. So that's good. Is it? Yeah. So yeah it's basically now he's not going to now he's going to go back home. Yeah but then then you can time yourself. He's not going to go back home. Yeah he is when you Oh if I let him. Yeah. Stop tell if you guys give me the answer. It's not working. My nemesis. Jen is uncontrollable. So if you do your thing now. So wait. Yeah. What's happening there? Yeah. I don't know. Bunch of stuff. Swipe carefully. Don't mess up. You're good. Got it. Stop guys. There you go. Ooh. Kill it. Why isn't it shooting the spider? Uh one turn at a at a time. So if",
      "start": 2164.72
    },
    {
      "text": "Yeah. I don't know. Bunch of stuff. Swipe carefully. Don't mess up. You're good. Got it. Stop guys. There you go. Ooh. Kill it. Why isn't it shooting the spider? Uh one turn at a at a time. So if you Oh you scared. It's a turn based game. You buddy scared me. There we go. There you go. Yay. Yay. I got it done once they gave me the answer. Look at him. He's still taunting me. That's awesome. What was his name? Yeah. It's really I can't say that. Yeah. Peter I'm coming for you. I'm coming for you. You can have a look at least at the other one cuz I know it's it's probably not going to happen. You know but it's we give him one life. You What the hell is that? So this is this is the You got a robot man. This is a spider right? Yeah. Spider-Man is standing up. So right. This one is a special version of the walker in the game. The lizard. Yeah. Or No it's a spider. No the walker I'm talking about. Yeah. Oh the spider. So this is from Metal Gear. Is that what you're saying? No.",
      "start": 2219.76
    },
    {
      "text": "special version of the walker in the game. The lizard. Yeah. Or No it's a spider. No the walker I'm talking about. Yeah. Oh the spider. So this is from Metal Gear. Is that what you're saying? No. What I'm saying is like this guy when he I so I went to him played GoPro Koala now what Peter I'm coming for you the the idea with this guy is he walks and kills you but if he encounters a hacking line on this oh he he removes hacking so you can't hack through him right god damn Also how would Oh I see it. So I have to get here to kill that one so that I can kill him. This is another one of those cool puzzles. See where it's like I can't hack this cuz I hack that way. I'm so happy you saw that. Yeah we won't be here for 5 hours. Maybe. I don't know cuz Peter's so smart. But you have you have the the luck. I would say that we just explained a mechanic to you because like you didn't encounter it in the game organically. Organically but we had to explain to you how it worked.",
      "start": 2287.12
    },
    {
      "text": "have you have the the luck. I would say that we just explained a mechanic to you because like you didn't encounter it in the game organically. Organically but we had to explain to you how it worked. So you know what? You should How come it didn't just kill the Oh the shoot across the Oh got it. Okay. because you can't hack through any I went to click the thing again. We're going to stop here ladies and gentlemen. We probably do. Yeah this is Deus Ex Go. The GoPro has been beat. But I don't I don't blame him. I blame us little chatter boxes around him. Peter I'm coming for you. But Peter you better watch out. Thank you guys very much for joining us. We're very excited. What platforms is it coming to? When is it coming? Phones and tablets this summer. So we're going to announce very soon when it's going to come out. Stay tuned. Wait. So when was that for the Vita? When's it coming to Vita? Soonish. Maybe. It's not actually planned right now. It's not like planned. Thank you. Bye. Bye.",
      "start": 2367.28
    },
    {
      "text": "when it's going to come out. Stay tuned. Wait. So when was that for the Vita? When's it coming to Vita? Soonish. Maybe. It's not actually planned right now. It's not like planned. Thank you. Bye. Bye.",
      "start": 2413.68
    }
  ]
}
