{
  "id": 1990,
  "video_id": "WQR52crDOrY",
  "show_name": "The GameOverGreggy Show",
  "hosts": [
    "Greg Miller",
    "Tim Gettys",
    "Nick Scarpino",
    "Colin Moriarty",
    "Portillo"
  ],
  "title": "Dinosaurs, Jetpacks, and Romeo + Juliet - The GameOvergreggy Show Ep. 141",
  "description": "We talk about jetpacks, dinosaurs and Romeo + Juliet. (Released to Patreon Supporters 08.12.16)\n\nSubscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
  "published_at": 1471584342,
  "duration": 5616,
  "transcript_chunks": [
    {
      "text": "Heat. Heat. Full good jean throne. This is real. I weighed myself. I'm back at 185 again. So I'm 10 pounds heavier than I was like two months ago. You're a beautiful human being now. I'm so fat. Like you really don't get like how fat my gut is. You're like 61 though. Look at my gut. Girl from Chicago. Does that look like a normal **** person's gut? You're pushing it out. I'm not. I'm always sucking it in. I don't know how many times I have to explain this. What's up everybody? Welcome to the GameOverGreggy Show. Kevin keep all of that. I'm one of your hosts Greg Miller alongside the producer/seducer Nick Scarpina. Hi Greg. It's not a Heather gray shirt but it is a dark gray shirt. Is it a brown? Is there a brown in there? Am I seeing a brown in there? Does anybody see a brown? It looks like it it's pretending it's charcoal but it's missing charcoal. Charcoal gray, I think. Yeah, dark gray. I'm going to do this. You got You're showing the ice cream scoops in a",
      "start": 0.0
    },
    {
      "text": "see a brown? It looks like it it's pretending it's charcoal but it's missing charcoal. Charcoal gray, I think. Yeah, dark gray. I'm going to do this. You got You're showing the ice cream scoops in a weird way. You got that thing where like the I hate it when the t-shirts do that where it rolls up a little bit there on the end like that. You see they got to be rolled up all together or not at all. Now, real quick, Kevin just exclaimed, \"God damn it, audibly enough for us all here. Do you want to restart the show? What did you do wrong? What's wrong?\" None of our mics were on. No, I mean everything's gone. No, it's just a stupid time code. Someone changed the settings on it. Okay, so now it says 9 hours and 14 minutes. You understand why an audible god damn it like that? **** useless. Be a show without Kevin interrupting it unnecessarily. What am I going to do with that? How am I going to edit with 9 hours? 5 seconds into the show. Well, you just keep that time code. No, but that",
      "start": 71.28
    },
    {
      "text": "be a show without Kevin interrupting it unnecessarily. What am I going to do with that? How am I going to edit with 9 hours? 5 seconds into the show. Well, you just keep that time code. No, but that doesn't When you import that. Sure. Then it's minus 0 from it. Minus 9 hours from it. Multiply it by the square root. Take nine and minus zero from it. You'll still have nine. Kevin, who changed the setting on that? I did. Girl from Chicago. I a brown it over there. The pure Tim Gettys. Oh, you know what I'll do? What are you going to do? I'm going to cut every I'm going to cut and then I'm going to reset it without deleting any of the files. That does that, right? You can just go and reset. We have to fire you at some point, right? Somebody. So, the national nightmare is over. Kevin couldn't figure out how to reset it. So, now he's just going to use a stopwatch on his phone. Plus or minus a minute 30. And there you go. You're all set now. You ready, Big Dog Kev? We got your permission to",
      "start": 106.24
    },
    {
      "text": "figure out how to reset it. So, now he's just going to use a stopwatch on his phone. Plus or minus a minute 30. And there you go. You're all set now. You ready, Big Dog Kev? We got your permission to keep doing the show over here, big guy. Kev, give us the Give us the Okay. Give us the okay. Big dog Kev, you okay? We're sending him word to Cape Canaveral. We need you. We need your word back, Kev. Big dog Kev, you happen over Oh, he's got the sad eyes and the sad face. Do you want me to record? You have to say when you're starting it, Kevin, or else it's useless. Hey, Google. Start the stopwatch. No, it's fine. All right. Bye. It's not useless cuz then I just know roughly around minute mark. Exactly. You're fine. Like minutes within the you 40 minutes for the first topic or what? What? Why are you guys left? Cuz this is a very fun situation. It's a glimpse behind the garbage truck on fire. So few get. And rounding out the group, the pride of Long Island returning to the show. Call",
      "start": 149.04
    },
    {
      "text": "Why are you guys left? Cuz this is a very fun situation. It's a glimpse behind the garbage truck on fire. So few get. And rounding out the group, the pride of Long Island returning to the show. Colin Morardi. I'm back. Everything's fine. Everything's good. Thank you. Thank you for coming. Thank you for coming home to this. You're should have really not come home. Yeah. Not deal. It was It was It was an interesting week. No, Nick. No, you reuniting all of us for the first time. And it feels like a long time, but I don't think it was that much. I was gone for 8 days when we were together. You were gone. He was gone when you were here. Eight days and nights. Yeah, you were gone for a long time. Yeah, I was gone. Stuff up. I am actually. It's a nice break. Uh I was starting to go a little crazy over there by Are you starting to return to sanity or Okay. No. So, it's going to be it's going to be a uh a long a long time till I'm 100%. I might not be the same ever again. What happened to your",
      "start": 192.56
    },
    {
      "text": "over there by Are you starting to return to sanity or Okay. No. So, it's going to be it's going to be a uh a long a long time till I'm 100%. I might not be the same ever again. What happened to your thumb? Truth be told. No, I jammed it. Carrying it. What happened to your thumb? I just You jammed it. Yeah. But it's not so it's not cut, but you have a tape. No, it's fine. It was just uh it was bleeding a little bit on the nail. So, I just I taped it over so I don't bleed on stuff. You like what my dad does when he just puts duct tape on his finger and then leaves it there for like I thought about Well, it it bled and then I'm like, \"I'll just I I'll wrap it and if it keeps bleeding by tomorrow, maybe I'll do something about it.\" Still bleeding. I thought for one second about putting super glue on it. Ooh, man. Real man stuff. Then I was like, I'm not manly enough to put super. So then you got the little brace thing. Yeah. Then I got Well, I went to the I went to the uh urgent care cuz",
      "start": 234.24
    },
    {
      "text": "glue on it. Ooh, man. Real man stuff. Then I was like, I'm not manly enough to put super. So then you got the little brace thing. Yeah. Then I got Well, I went to the I went to the uh urgent care cuz it kept bleeding. So, I was like, I'm going to go to urgent care in my neighbor in the marina, which I thought only cost me $100, but it turns out that was just my co-pay. Then for an X-ray and a little splint was an additional $140. Good. So, for $140 I had a doctor who was with me all of 3 minutes tell me it's going to be fine. You're going to live. And when I asked this guy, I was like, uh so should I I mean, you know, it's really hurting, but I guess it's fine. Should I do anything about it? He's like, might be broken, might not be broken. Either way, there's nothing really we can do for it. We can just put a splint. Do you want to know if it's broken or not? I'm like, well, kind of. Cuz I'm like, doesn't that affect I'm like, what does that affect? Well, it affects how long it's",
      "start": 267.6
    },
    {
      "text": "for it. We can just put a splint. Do you want to know if it's broken or not? I'm like, well, kind of. Cuz I'm like, doesn't that affect I'm like, what does that affect? Well, it affects how long it's going to heal. So, if it's broken, it's probably going to take like a month or two to heal. If it's not, it'll take seven to nine days. I was like, well, I want to know that cuz I got more **** to do. He neglected to tell me that in order to know that, I would need an X-ray that would cost $105. So, my favorite thing is then you get this the little splint thing. Get the splint thing which cost $15 and then we go at Walgreens. We get in your car. We get in your car to drive. I looked out of my head. I already think Nick's losing his mind. Then all of a sudden Nick just starts driving. Just goes. I was just looking at his head and I'm like, \"Oh, **** This is it.\" Yeah, this is it. He forgot about it. He blacked out everything. He's slowly losing. Turns out I appreciate all the work",
      "start": 307.52
    },
    {
      "text": "goes. I was just looking at his head and I'm like, \"Oh, **** This is it.\" Yeah, this is it. He forgot about it. He blacked out everything. He's slowly losing. Turns out I appreciate all the work you're doing. No, my pleasure. Everyone's going to be excited when they see the studio. It's really fun. It's been a little bit of a kerfuffle cuz a lot of things have gone not wrong, just kind of wrong. Kind of like how we open this podcast. Yeah, that's exactly every day, every decision, everything. We had some stuff shipped incorrectly, wrong sizing for things. It's a lot of a lot of problem solving that last week that drained me. And then to add insult to injury, I busted my thumb. Well, in addition to that, I was hanging out with Kevin. Kevin's like, \"Dude, I'm concerned about Nick and I'm like, \"What's up?\" He's like, \"He has bruises everywhere.\" A lot of bruises. What do you mean he has bruises? We had to carry a lot of stuff up up and downstairs and things like that. Was it Matt? You",
      "start": 341.28
    },
    {
      "text": "\"What's up?\" He's like, \"He has bruises everywhere.\" A lot of bruises. What do you mean he has bruises? We had to carry a lot of stuff up up and downstairs and things like that. Was it Matt? You know, it was Matt. Yeah. These bruises appear right when the big brother comes back to town. The big dog. No. He's walking around with a sock full of soap just whipping everything whenever something's wrong. No, it's brutal. Like I literally I don't know where I got these scratches from. I just have no idea how my arm got like this. But show me again. No. No. No flex for everybody. Show them. There it is. There it is. Pump it up. Shut up and let him be happy for two seconds. That was cool. Yeah, that was fun. Speak up, Kevin. It's important. Who got him that shirt? Who told him he was okay to wear that shirt? Get in front of the show everybody. The big dog Kev shirt. We We had a fan send us all sorts of homemade shirts for us. I love slash hate this shirt so much. My wallet. Wait a second.",
      "start": 381.04
    },
    {
      "text": "that shirt? Get in front of the show everybody. The big dog Kev shirt. We We had a fan send us all sorts of homemade shirts for us. I love slash hate this shirt so much. My wallet. Wait a second. What are you doing? Why are you going through my wallet? Oh, it's tax season. Oh no, not my birthday tax. If you didn't know, ladies and gentlemen, this is the GameOverGreggy Show. Each and every week, four, sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, head over to Patreon.com where you can toss us a few bucks. Why do you have so many ones? Who the **** are you? Why is everybody Don't start. No, don't. You don't. Nobody. Don't worry. You got like a G in your wallet. What are you doing? $15 with a ones. Okay, so that's interesting. What do you want me to do? That's just how it is. You go to Patreon.com/kindafunny where you get each and every episode early. Uh you can get a whole bunch of exclusive perks and",
      "start": 420.16
    },
    {
      "text": "that's interesting. What do you want me to do? That's just how it is. You go to Patreon.com/kindafunny where you get each and every episode early. Uh you can get a whole bunch of exclusive perks and bonuses there. We put them up on Friday for you. Then if you have no money to toss, that eventually goes to my wallet. You can head over You can head over to Youtube.com/kindafunny where we posted topic by topic day by day until the entire thing posts as one big video on MP3. Mhm. I'm going away. I want I drew money so I'd have cash. Are you going to a strip club? Yeah, the dollars. I don't I mean I hate cash period. Oh, I always have cash. I hate it though because this is what happens. I put in a 20 and then for something and I get all these ones back. And yeah, I agree. And then a long time ago I was forced to switch to a bifold wallet instead of a trifold wallet and these things suck. There's no room. All the money gets bent and jammed in there. That's because you're not No human being is",
      "start": 458.96
    },
    {
      "text": "I was forced to switch to a bifold wallet instead of a trifold wallet and these things suck. There's no room. All the money gets bent and jammed in there. That's because you're not No human being is supposed to have that many bills in the What do you want me to do? Sounds like a sandwich. This is the world I was cursed with. All right. I didn't I wanted some cash and I have too much now. What's the difference between cursed and cursed? Um, use cursed. The curse. No. C cursed would be Isn't that a No, I guess two cursed would be Yeah. Uh Harry Potter and the blank child. What is it? Cursed child. So it's not cursed child. Well, I think you could say cursed is cursed. That's that's what I'm that's what I'm thinking. Now, let me just see what I'm talking about this bifold though. You got all this stuff. It's all shoved in this wallet. Now I got cash. You know, I got cash cuz I don't I don't I sometimes I just want to use cash randomly. It's like how my dad sometimes only",
      "start": 498.48
    },
    {
      "text": "You got all this stuff. It's all shoved in this wallet. Now I got cash. You know, I got cash cuz I don't I don't I sometimes I just want to use cash randomly. It's like how my dad sometimes only uses his easy pass in New York City every other time. And then when I ask him why, he's like, I just don't want him to know where I'm going for the toll road. It's nice. Very, very smart. So, you're done. Oh my god. Like, why are we online at the Throgs Neck bridge? We could just go through the easy pass. We got to use the cash this time. Like, all right. But don't they take a picture of your license every time you go through that thing? God bless them. When you're back, you're returning. What's your topic? Dinosaurs. I'm so happy we're all back together and this this is what you get. What about dinosaurs? Call it your favorite dinosaur. Yes. Want to talk about your favorite dinosaur? Now, I want to give a shout out. I'm going to I'm going to start this. All right with you, Kevin, if I",
      "start": 547.76
    },
    {
      "text": "about dinosaurs? Call it your favorite dinosaur. Yes. Want to talk about your favorite dinosaur? Now, I want to give a shout out. I'm going to I'm going to start this. All right with you, Kevin, if I started, right? You okay with that? Okay. Don't worry. He won't let you know if something's not okay with it. So, you're maybe a minute and a half in. Okay. Uh gonna give a shout out to my dude, the Stegosaurus. M what I feel like is an underappreciated defensive dinosaur that uses his armor and his spikes to keep everyone at bay as he eats bushes and flora all around him. He's got a small neck so he's eating on the ground. You know, he's hanging out. He's chilling. He's got the little spiky tail. You know, he can **** you up with it if he wants. Little armor plating. Everyone leaves him alone. My dude, the Stegosaurus keeps to himself. Mhm. And that's why I want to give because everyone's like, \"Oh, I like the Tyrannosaurus Rex.\" Like, well, of course. What about the Stegosaurus? You",
      "start": 588.16
    },
    {
      "text": "My dude, the Stegosaurus keeps to himself. Mhm. And that's why I want to give because everyone's like, \"Oh, I like the Tyrannosaurus Rex.\" Like, well, of course. What about the Stegosaurus? You know, Tyrannosaurus Rex not **** with the Stegosaurus. No one's **** with the Stegosaurus. I don't know if we have it on good authority that the Tyrannosaurus Rex doesn't **** with a Stegosaurus. We actually don't have this on none of this authority happened hundreds of millions. It's it's it's a distinct possibility that at some point in the history of the Earth, a T-Rex was like, I'mma **** with that Stegosaurus right now. I'm **** I'm going to **** that **** that thing up right now. **** that. The comet hurdling through the atmosphere is like, I got nothing to lose. Writing on tailed **** Time for me to bite this thing that's armored. I've always wanted to. Now it's my chain. Does anyone even care about dinosaurs? Cuz you like isn't it that like when you're a kid everyone",
      "start": 628.64
    },
    {
      "text": "**** Time for me to bite this thing that's armored. I've always wanted to. Now it's my chain. Does anyone even care about dinosaurs? Cuz you like isn't it that like when you're a kid everyone loves dinosaurs but then at some point unless you become like a paleontologist you just don't care. I mean here's the thing. We all know dinosaurs don't actually exist. They're like Santa Claus and they're really cool when you're young and then you grow up and they're still cool but then you just realize that people are just making them up and they're not real. Did you hear about that report? Dinosaurs not real. Yeah. I mean the Christians who just believe the Yeah. Is that what you're talking about? No. Dinosaurs are far. I'm just making up **** Dinosaurs are **** awesome, though. They always are. They always have been. They always will be. My favorite. I don't know. It's hard because they've had so many different incarnations over the years, you know. Obviously, I think back to Land",
      "start": 666.28
    },
    {
      "text": "are. They always have been. They always will be. My favorite. I don't know. It's hard because they've had so many different incarnations over the years, you know. Obviously, I think back to Land Before Time being the definitive. What a sad movie. Oh my god. It's a devastating movie for a child. Um, I remember being very sad. I don't remember anything that happened. If you notice, kid movies don't they pull punches all the time. That's why we have such a weak generation now. They should have all died at the end of Toy Story 3. They should have all been melted into a bowl. None of this is true. And then we would have had kids who were tough then. No, no, nothing. There's no like Are you kidding me? 3 is horribly sad. Sure. And then it has a beautifully happy ending. No, it doesn't. There was no happy ending for Bambi. It was not happy. Oh my god. Bambi was brutal, too. The end is happy. Mom's still mom's still dead, though. Yeah, mom's still dead. Yeah, the mom's still dead. Yeah, mom's",
      "start": 696.48
    },
    {
      "text": "no happy ending for Bambi. It was not happy. Oh my god. Bambi was brutal, too. The end is happy. Mom's still mom's still dead, though. Yeah, mom's still dead. Yeah, the mom's still dead. Yeah, mom's not coming back, Kevin. Mom, that ain't coming back either. No. Damn. She got an offscreen kill, too. Like, how sad is that **** There's like, oh, she's dead. But isn't the whole plot of Land Before Time I used to watch. It's It's about like these young dinosaurs with no **** parents. Isn't that what it's about? Like parents? I I thought I thought Little Foot's Little Foot's mom died, but he has the grandparents, right? That's right. He has grandparents. Everyone being like very sad about this. They all have parents. What's the Dodo's name? Except for Except for your boy. Not the Dodo. The Stegosaurus Spike. Spike. Yeah, Spike. Spike don't got no parents. Talk about Spike. Do you guys talk about You don't **** with You don't **** with Spike? Colin, wait. You're gonna **** stand",
      "start": 730.0
    },
    {
      "text": "Stegosaurus Spike. Spike. Yeah, Spike. Spike don't got no parents. Talk about Spike. Do you guys talk about You don't **** with You don't **** with Spike? Colin, wait. You're gonna **** stand here and tell me that your favorite dinosaur is Stegosaurus. You're going to tell me you don't **** with Spike. Do you mean Stegosaurus? I hate you so much, Kevin. Yeah, Stegosaurus. What was Spike wasn't this though, wasn't he? No, he was the like I'm glad we got No, I don't think he was either. And I enjoy that he used the mic for like to to derail the show and now that he's trying to be an active participant in it, he's like, \"No, just yell off screen.\" Nobody needs any up every third word he said. Nick, who's your favorite diner? Favorite dinosaur? Uh, I like the one that used to be like this. Not the mama. Oh, yeah. Oh, no **** I was going to say Earl from that show. Dinosaurs. That's your favorite dinosaur? Yeah. God, I love the ending of that show. Yeah. They're all going to die.",
      "start": 770.8
    },
    {
      "text": "Not the mama. Oh, yeah. Oh, no **** I was going to say Earl from that show. Dinosaurs. That's your favorite dinosaur? Yeah. God, I love the ending of that show. Yeah. They're all going to die. It's all Earl's fault. Um, I I you know, I liked dinosaurs when I was a kid. Uh, and then I think right around the time they said they actually were covered in feathers, I was like, \"That's it. I'm done.\" It's clear that no one knows a **** thing about dinosaurs. If for the first 15 years of my life we thought they were like giant lizards and now we think they're giant birds. I'm done. Figure it out. Are they saying that they're covered in feathers now? Is that Well, some of them do. I mean the the modern bird is the derivative of the dinosaur. So at some point the scale must have turned to a feather. That's an accurate thing, right? At some point evolutionarily dinosaurs must have been covered in Can we get the biology report from biologist Kevin Queller? So, it's a common misconception",
      "start": 811.44
    },
    {
      "text": "feather. That's an accurate thing, right? At some point evolutionarily dinosaurs must have been covered in Can we get the biology report from biologist Kevin Queller? So, it's a common misconception that like dinosaurs were hanging out together. Like the Stegosaurus was from 155 million and 150 million years ago. Sure. And the T-Rex was like 55. Like I just looked up numbers and like there's like a dinosaur timeline. Yeah. So like these So when I said the Tyrannosaurus Rex never **** with the Stegosaurus, that was actually 100% correct. I stand corrected. Spike is kind of like Stegosaurus. He is. What's kind of like the Justice Society before the Justice League. I was blown away. I thought he was that other one that was smaller. The flat ones that are fat like I haven't seen a movie in 5 years. So what the **** do I know? I don't know, man. So when did you guys start watching Land Before Time? I don't think I ever started early 90s. What? You never saw Land Before Time? Oh",
      "start": 849.12
    },
    {
      "text": "in 5 years. So what the **** do I know? I don't know, man. So when did you guys start watching Land Before Time? I don't think I ever started early 90s. What? You never saw Land Before Time? Oh my god. Here's Yo, you're too busy watching Ghostbusters. I wanted to go last just to remind you all the dinosaurs are whack and stupid. Like don't get me wrong, I respect them. It'd be cool if I could look through like a portal into the olden times and see them and like that's fine. Jurassic Park, it's not the olden times. Jurassic Jurassic Park, don't get me wrong. and a **** triceratops. Let them eat triceratops. Uh, but yeah, like I mean the like when you buy the nobody nobody's buying me **** **** toys of these dinosaurs, right? Unless it was that awesome one that was like the mech that it chest opened up and somebody crawled out of, I think, and I had that guy. But overall, my dinosaur is just like, what a **** generic **** toy. What a generic **** like thing to be into.",
      "start": 887.44
    },
    {
      "text": "that it chest opened up and somebody crawled out of, I think, and I had that guy. But overall, my dinosaur is just like, what a **** generic **** toy. What a generic **** like thing to be into. Did you ever have the dinosaur? I'm into squirrels. That's like what it's saying. I'm into rats. Do you ever do you ever have the dinosaur toys that were like really really really like tough hard plastic and they wouldn't move no points of articulation? It looks like it was a log which had the weird rubber thing that I don't think it meant you could kind of move their jaws maybe a little bit just by pinching. Those are like the worst. And that's the thing here I'm at the dollar store. Here's my 99 cent **** triceratops. Great. Awesome. Inevitably I always had one of those in my toy bin and so it would wind up that Batman had to fight it of course and it was just like well dinosaur that's actually a great point. My favorite dinosaur is the T-Rex in the Batcave cuz at least at least they",
      "start": 927.68
    },
    {
      "text": "so it would wind up that Batman had to fight it of course and it was just like well dinosaur that's actually a great point. My favorite dinosaur is the T-Rex in the Batcave cuz at least at least they tried to make them relevant, right? There you go. Here's this **** thing you can hang out here. I like I like dinosaurs because they've they've kept I **** hate you. Are you a big fan of Komodo dragons, too, Tim? They're pretty cool. Chameleons, salamanders. Yeah, they're I mean they're pretty much the they're they're the proof that dinosaurs are real. The Komodo dragon. There's really not many people argue the dinosaurs are real. Quite a few arguments. No, man. Earth creationists. This This is **** cuz Power Rangers had the dinosaurs. There's the We're back. A dinosaur. Wait a second. Wait a second. Shout out to **** We're Back. You can't bring in You can't bring in the dragon zord and all this stuff and be like that's a dinosaur to I'm talking about the **** Voltronur. Yeah.",
      "start": 965.52
    },
    {
      "text": "Wait a second. Shout out to **** we're back. You can't bring in You can't bring in the dragon zord and all this stuff and be like that's a dinosaur to I'm talking about the **** Voltronur. Yeah. But was but was a dragon. Are we talking about the things they morph into? The green ranger. He came in. He's like \"Oh what's cooler than dinosaurs?\" Dragons. But I want to I want to give a shout out to that because I thought dragons were from Asian mythology with some of the fossils that they found. They didn't know what the **** they were right? Oh no. They found dragons. I don't think that's the case but but it could be. It could be the case but I think that that's where that So dragons aren't real confirmed. No, dragons are just I I what I thought were they found dinosaur bones but there's the komodo kimono dragon. The kimono dragon is That's We're not We're not seeing no **** Komodo T-Rexes and **** I'm telling you, dinosaurs ain't real. Dragons real. Yeah. I don't think",
      "start": 1004.0
    },
    {
      "text": "there's the komodo kimono dragon. The kimono dragon is That's We're not We're not seeing no **** Komodo T-Rexes and **** I'm telling you, dinosaurs ain't real. Dragons real. Yeah. I don't think I is a young earth creationist. I think he is. We have all the earth. I've been saying that for years. You're a You believe in flood uh flood geology? Here's the thing, man. I want nothing more than to believe in these goddamn dinosaurs. Dinosaurs are the homies. I'm a little bit offended. Very offended actually at this whole you trying to take What do you mean that they're homies? I mean that like a dinosaur movie is going to be cool or that it's just like every single dinosaur movie ever made. A Godzilla movie. Sure. Greg, they're the homies. Greg, name a bad dinosaur movie because they're they don't exist. Land Before Land Before Time, **** classic. Land Before Time pretty good. Land Before Time 3 brought it **** back. Brought it **** back. Not as good as Before Time. You lost",
      "start": 1044.4
    },
    {
      "text": "don't exist. Land Before Land Before Time, **** classic. Land Before Time pretty good. Land Before Time 3 brought it **** back. Brought it **** back. Not as good as Before Time. You lost me. It goes all the way to 13. I stopped eventually. We're back though. We're back. Brought it back. That was a a more adult cartoon for the adult kids. You know what I mean? Con. Did you watch We're Back? No, but I know what you mean about adult kids. You You would love We're Back. Yeah, I think they would actually enjoy it. It's **** great. I'm sure. Nick's got something. Nick's got a dynamite drop in. Let them Let them do it. The first time I hung out uh over over a holiday week with uh my future in-laws. Yeah, we went to Blockbuster and I made them rent the Will Ferrell version of The Land Before Time. God, that was a bad call. And I **** laughed so hard. And my future father-in-law was like, \"Land of law.\" Sorry, not Yeah. What? Three different things. more time. Um, the welfare we",
      "start": 1085.76
    },
    {
      "text": "Before Time. God, that was a bad call. And I **** laughed so hard. And my future father-in-law was like, \"Land of law.\" Sorry, not Yeah. What? Three different things. more time. Um, the welfare we know and I thought it was the funniest **** thing and my family, my in-laws were like, \"This guy, there's something so wrong with this guy.\" But every time Chaka came on, I was just like, \"This guy **** whoever made this movie gets Todd Phillips, I think it was, gets me. He gets me.\" How hard is it for you to dial down the Nick when you're with the in-laws? No, it doesn't matter. Well, well, because now my personality is on the internet, so like Oh, good point. They probably think you're doing a character. They don't understand that this is the real Nick and the Nick they meet is the mask. They've been I've been drunk with him many times. They see this. But also my my father-in-law is actually a huge fan of ours. He he owns all of our shirts and when he sees someone he keeps he texts",
      "start": 1131.28
    },
    {
      "text": "They've been I've been drunk with him many times. They see this. But also my my father-in-law is actually a huge fan of ours. He he owns all of our shirts and when he sees someone he keeps he texts me every time he sees someone wearing one of our shirts. He goes up and like says what's up to him literally at least. Yeah. Wow. That's cool. That's awesome. Thanks for the support. In-law Scarpino. Sure. De's dad. Yeah, that's I mean that's the way to do it. De's dad. Chaka chaka. Yeah, dinosaurs are stupid. All right, that's enough. Then go **** yourselves. You know what is stupid though is the long neck. Like they need to stop. Bronosaurus. Is that what that is? I mean, it's a great point of why giraffes suck, too. But but the thing is before time made them relevant. Like they made you, you know, sympathize. They made you understand that things are hard for them. Giraffes are **** awesome. You ever seen a fight? Yeah, that's the literally the only redeeming thing about them.",
      "start": 1172.88
    },
    {
      "text": "you, you know, sympathize. They made you understand that things are hard for them. Giraffes are **** awesome. You ever seen a fight? Yeah, that's the literally the only redeeming thing about them. And they have black tongues. And I only know that because of giant black tongue. How would I know if it was? Look at my I'm watching a video of it. Look at my **** Yeah, you watch Yeah, you had it was black because I knew it from uh uh what's the camp show on Nickelodeon with Budnick. Why can't I come up with that right now? Shorts. Yep. Yeah, they talked about it there. It's black tongue. Ugg taught me that. Ugg. They're certainly dark. What was the guy's name on your shorts that you never saw? Oh, I was always over the loudspeaker. Not Wilson. You saw Wilson. Now we get Home Improvement. You just never saw his face. Uh but you saw his eyeballs and he was always doing something. Al Al Al Bundy. Al Bundy. Al Bundy was the guy. Donkey lips. Donkey. Oh my dude. Early 90s. Well, like 88 or",
      "start": 1212.4
    },
    {
      "text": "just never saw his face. Uh but you saw his eyeballs and he was always doing something. Al Al Al Bundy. Al Bundy. Al Bundy was the guy. Donkey lips. Donkey. Oh my dude. Early 90s. Well, like 88 or '89 to 93. Nickelodeon was the best. You weren't **** with that. Yeah. Oh my god. Welcome Back Freshman. Finders Keepers. Hey Dude. Oh Hey Dude. Hey Dude **** sucks. Told you. Thank you. I've seen. Have you guys ever like been near one and fed them? A giraffe? Yeah. No. Were you in a skyscraper and I walked by? No. Yes, I was. It was a four-story house. I just looked out and saw eyes and big black tongue. I was like, \"This is my fantasy. Lick my asshole.\" Licking right up in my under. No, I went to uh up north there's a uh like a like a park, a preserve that has a bunch of giraffes. And I told the guy, \"You should call this Giraffic Park.\" And the guy was like, \"No.\" And I was like, when your business **** goes downhill, remember this crazy thing. And then ape the logo, but have it be",
      "start": 1253.04
    },
    {
      "text": "the guy, \"You should call this Giraffic Park.\" And the guy was like, \"No.\" And I was like, when your business **** goes downhill, remember this crazy thing. And then ape the logo, but have it be have it be a giraffe. You can go up there, you feed them, and they just lick you. It's hilarious. They're huge. Drafts are a little weird, though. The zoo right here and feed them apples. You can't feed them at the zoo. You break in. Some kids tried to feed a tiger once they jumped out and killed them. Did you see Did you see the footage of the woman get out of the car in in China at some tiger preserve and get dragged away by a tiger and killed? Jesus. one of the I was like this is **** nuts. Then the guy you see the guy get out of the car and he's like he doesn't know what to do and then it just tiger on the streets. No they were in they were in one of those like you're you're in the nature preserve or whatever. Don't leave your car and these these people parked for some reason and she",
      "start": 1302.72
    },
    {
      "text": "just tiger on the streets. No they were in they were in one of those like you're you're in the nature preserve or whatever. Don't leave your car and these these people parked for some reason and she got out and walked over to the driver and like opened up and like started talking to the guy and then just out of **** the side of the frame just this tiger grabs her and **** yanks her right away. Holy **** Was it the real tiger or was it wearing a tiger outfit? No, this was 100% real. It was kind of scary actually. Terrifying. Yeah. But it's also like why would you get out of your car? Yeah. You must have brain. We don't put myself in that situation to begin with. I don't I wouldn't go into that place. Yeah. It's like swimming with sharks. It's like why why are you even doing that? Don't do it. Would you go to Jurassic Park if Jurassic Park came back? No. Oh, I would. Yeah. I think that'd be one I'd be like, you probably should do this. Absolutely. Oh, so then dinosaurs are cool.",
      "start": 1341.92
    },
    {
      "text": "do it. Would you go to Jurassic Park if Jurassic Park came back? No. Oh, I would. Yeah. I think that'd be one I'd be like, you probably should do this. Absolutely. Oh, so then dinosaurs are cool. Yeah. If they were real bandwagon, it's kind of like how Greg doesn't like sci-fi unless he likes sci-fi. It's the same kind of thing. You know, sci-fi is so bad. I love I don't mind Jurassic. I don't mind the dinosaurs interacting with us and doing things. But sitting here, I'm like, \"Oh, I'm **** I'm I'm little Tim and I got my book open and I got my legs. I'm laying on my stomach, legs up in the air. I'm kicking them around reading this **** picture pages book about like oh man, this dinosaur had a really long neck and this dinosaur had a scaly back and this like why don't what? Tell me a story about them.\" I lied. I would go to Dur Jurassic Park. Jurassic Park. If I could do the thing they do in Jurassic World where like you ride a little mini triceratops. Remember that? zoo area.",
      "start": 1376.16
    },
    {
      "text": "a story about them.\" I lied. I would go to Dur Jurassic Park. Jurassic Park. If I could do the thing they do in Jurassic World where like you ride a little mini triceratops. Remember that? zoo area. That's what I I want to Jurassic World is the fourth one. Yeah. So, what was I never saw what what is the rationale that they're going to do this again? It's a whole uh big corporation. Yeah. Big corporation buys it. They've already been doing it too for a while. So, it's all been working. No, the park's huge. It's doing well. The first Jurassic Park is so good. Yeah. This one's actually really good. I wish they just leave it. Believe it or not, it's actually better than you think. I remember seeing like this entertaining. It was entertaining. I don't think it's really good. It was entertaining. I think it's really good. It's not great. It's good. I think people were surprised that it was good. Agreed 100%. Yeah, because I remember seeing the third one in high school in a movie theater",
      "start": 1411.84
    },
    {
      "text": "I think it's really good. It's not great. It's good. I think people were surprised that it was good. Agreed 100%. Yeah, because I remember seeing the third one in high school in a movie theater with a little claw mark for the three. Yeah. Yeah. I was like, \"Oh, Jesus.\" They had a dope pterodactyl. Return to form. Yeah. I My thing I never answered my favorite. I think I'm going to go with pterodactyl. Pterodactyl. Yeah, that's a good one. That's pretty sick. Yeah. I like you know my favorite pterodactyl, the one on PeeWee's Playhouse. I forget it name. Terry. Terry. Terry was Terry was hot. Not like hot like I wanted to **** Terry. Maybe I would have, but I'm just I didn't you know back then I wasn't it wasn't all working. Beiality going for you. You want your ass to lick your ass now for the No, he said that you want to double T a **** pterodactyl. It's a little Are you in this with me now? They're just I mean you and I like wobbly age this. Here's what I'll say. Here's what I'll",
      "start": 1450.88
    },
    {
      "text": "the No, he said that you want to double T a **** pterodactyl. It's a little Are you in this with me now? They're just I mean you and I like wobbly age this. Here's what I'll say. Here's what I'll say. And it can be a topic for another day if you want. Is it beastiality if it's a sentient thing and it's talking to me? Like Terry talked and like you had conversations with her. No, I don't think so. I mean, he's having sex with a beast, so probably the courts might decide it, but I mean, I know beast. Well, they can put Terry on the stand and Terry could be like, I wanted him inside me. I wanted to be the middle part in the wobbly age. What? Again, are you with me on this? We're all double teaming Terry. We're all We're going to train on Terry. That's enough. Yikes. Nick, you're in rare forms today. What's your topic? Jetpacks. It's like It's like a seven-year-old's like game show dinosaurs and jetpacks. Jetpacks. So, I saw this story. Is it really? Oh, yeah. It's jetpacks. I",
      "start": 1488.24
    },
    {
      "text": "rare forms today. What's your topic? Jetpacks. It's like It's like a seven-year-old's like game show dinosaurs and jetpacks. Jetpacks. So, I saw this story. Is it really? Oh, yeah. It's jetpacks. I saw this story like a half a month ago and I was like, \"Oh, holy **** I want one of these.\" Um, golfer named Bubba Watson. Are you guys all familiar with him? No, but I like I like I like the name. Um is part of this uh is is helping to prototype this. It's made by Oakley. The **** It is a portable jetpack golf cart. Do we have videos of it? Yo, yeah. Do you want to read the article so everybody gets then we can watch the video. Kevin can do the thing like you guys watch it muted. Sure. The humble golf cart is now a very sle it's is not very slick but it gets the job done. So, is there a better way to get from tea to green? In 013, pro golfer Bubba Watson along with Oakley and Neoteric Hovercraft uh posted that question with the golf cart hovercraft, which is also awesome, but that's",
      "start": 1535.84
    },
    {
      "text": "way to get from tea to green? In 013, pro golfer Bubba Watson along with Oakley and Neoteric Hovercraft uh posted that question with the golf cart hovercraft, which is also awesome, but that's not what we're talking about. What? That's a golf cart hovercraft that they made first. Now, with the help of Martin Aircraft, the team has taken to the skies with the golf cart jetpack. Okay. Based on Martin's current pre-production prototypes, the golf cart jetpack can fly as high as 3,000 ft. What the **** And as fast as 46 mph thanks to a 10 horsepower engine powered powering two duct fans. So basically standard Martin jetack without extra space for clubs and sand bottles. Uh as fun as it would be to get a bird's eye view of the course and watch your watch your uh watch your golf buddy shoot from on high. Uh practical considerations must keep this concept on the ground. Bubbin says the jetpack will speed up play, but in the time it takes to shop it, fly it down the fairway, land and take",
      "start": 1587.92
    },
    {
      "text": "from on high. Uh practical considerations must keep this concept on the ground. Bubbin says the jetpack will speed up play, but in the time it takes to shop it, fly it down the fairway, land and take your shots, your friends who can't join you in the single pilot craft. Uh could well be holes ahead of you, yada yada yada. Uh basically the long and short of this is they're prototyping this. He's kind of the figurehead for it. Each one of them costs $200,000. Okay, which might sound until you see this damn thing in action. All right, you just It's muted. It's okay, bud. We like you looking out for the show. Thank you. Here we go. And you're Kevin's going to put this in here. So, it's down here somewhere. Go suck a dick. Regular golf cart. Why does it need to go Why does it need to go to 3,000 ft? That's so it goes 3,000 ft. I feel like you're going to break the switch and just keep going. Bubba, you don't need to go 3,000 ft. Bubba has a pink driver, but he can do whatever the hell he",
      "start": 1639.28
    },
    {
      "text": "ft? That's so it goes 3,000 ft. I feel like you're going to break the switch and just keep going. Bubba, you don't need to go 3,000 ft. Bubba has a pink driver, but he can do whatever the hell he wants. True. Uh so we stop talking here. Let me There you go. Now, I should also say you need a pilot's license for this and you have to be trained on it because it is actually like it's a space vehicle. A space vehicle. Space. It is an actual plane. So, you have to you have to be able to have So, he's the only person that can pilot it right now. That's pilot mic read. Bubba can't actually pilot it yet, but he's taking courses apparently. This is dope as **** Isn't that amazing? I just want it. So, pretty much has just drone technology got to the point where they're like, \"All right, when we were little kids, we dreamt of being able to fly things and that actually be cool.\" Now, we hit that point and they're like, \"What if we put ourselves on that thing?\" I mean, I that's my question to",
      "start": 1687.84
    },
    {
      "text": "were little kids, we dreamt of being able to fly things and that actually be cool.\" Now, we hit that point and they're like, \"What if we put ourselves on that thing?\" I mean, I that's my question to you guys is looking at this and then not obviously for long rides, but like to get around San Francisco%. Would you get one of these? 100%. I mean, like the problem is that once it became I mean, we'd have the same congestion in the air and then I'd be worried about other jetpack riders. Now, Kevin's shaking his head. Well, you have a um you just put that chip that you have in cars that like auto steers for you. So, like it'll ping theirs and then it pings you and you guys stay away from each other. Okay. Of course, granted, if your car breaks down, you're not going to fall from 3,000 ft. Yeah. I don't That's the thing. I would never get up to You don't have to go that high either. You go like 15 feet above the air just above the cars. Well, you got even above the cars, there's so many",
      "start": 1727.36
    },
    {
      "text": "I don't That's the thing. I would never get up to You don't have to go that high either. You go like 15 feet above the air just above the cars. Well, you got even above the cars, there's so many wires across the streets in San Francisco. You got to get 30 40 feet then. And then you're so close to the face of God. Why not reach out and touch it? Get as high as you can. Drink a bit. Get a little higher. Um, dude, 3,000 feet is high. It's twice as high as the Freedom Tower in New York City. How **** cool. That's how high you can go in that thing. Why would you ever go that high? I would be fine with it because I would be like, \"Okay, here's the deal. Fantastic. Uh go that high. Make people go that high and then if a malfunction happens, everything has parachutes. You just kind of strap off, parachute, it parachutes. You're good. It's fine. It parachutes.\" The fiery wreckage. Why is it fiery? Did a missile hit it? I mean, what how else is it going to break? One of the turbines just",
      "start": 1764.72
    },
    {
      "text": "off, parachute, it parachutes. You're good. It's fine. It parachutes.\" The fiery wreckage. Why is it fiery? Did a missile hit it? I mean, what how else is it going to break? One of the turbines just goes down and you go in a circle and all the way down to the ground. It's like a helicopter. So, so what I'm really intrigued by this. So, why are they like golf carts? That's the one place that we have all the **** room in the world to drive around. We already have a vehicle made just for this. You want to know why? Inconspicuous. Mhm. This seems like a luxury item for old rich white guys. Clearly, the military is behind this. Clearly this has got nefarious purposes and they're like we'll just put it there and we'll put a guy named **** Bubba in it and everybody's going to be like what a cute thing. Next thing you know **** Vita and the secret police here. Lola coming in. They're getting you. They're coming in in jetpacks. Yeah, man. That sounds I feel like this is a huge step",
      "start": 1801.2
    },
    {
      "text": "a cute thing. Next thing you know **** Vita and the secret police here. Lola coming in. They're getting you. They're coming in in jetpacks. Yeah, man. That sounds I feel like this is a huge step forward for jetpacks because the last we last we saw of jetpack was the water the water jetack. Oh, those are sweet. But that's does that even count as a jetack? I don't know. It's gotten some real good videos. No, the jet. Can you find me that video? The water jetack thing is fine. I mean, I don't think that's an actual jetpack. That doesn't use jets, right? Those are turbines, right? What? What you were saying? The first version was called a hovercraft. It wasn't the same version as this. So, here's a picture of that. Um, golf jetack land speeder. So, it is Yeah, it can go over water. It can go over sand dunes and things like that. So, it doesn't So, the virtue of this, of course, is that the golf cart obviously can only do so much. It can't go over water. or can't go over sand really well",
      "start": 1845.12
    },
    {
      "text": "over sand dunes and things like that. So, it doesn't So, the virtue of this, of course, is that the golf cart obviously can only do so much. It can't go over water. or can't go over sand really well cuz it just goes up and then goes and it starts falling down even like what I want. The only cool thing about the golf cart is that you can reenact the scene from Navy Seals where they're playing polo in the golf carts really drunk. Oh yeah. Remember that scene golf cart jetpack gives new meaning to a birdie. Y it's well done. It's well done. Um I have to imagine that you know Oakley is just kind of like throwing some money toward this cuz it's a fun sort of R&D project that they probably won't ever realize. But I don't know. Maybe I mean maybe they're going to try to go to consumer with with this. It doesn't It's like every other technology. It gets smaller simpler. I think so. Yeah. But I mean I'm pretty impressed. Small and simple looking. It is. Have you actually ever heard a jetpack?",
      "start": 1887.76
    },
    {
      "text": "this. It doesn't It's like every other technology. It gets smaller simpler. I think so. Yeah. But I mean I'm pretty impressed. Small and simple looking. It is. Have you actually ever heard a jetpack? Like seen anyone land on a jetpack? No. So I think it was five or six years ago. Real jetack. Yeah, those they're real things. They're loud as **** They're so **** loud. Kevin wanted it muted, remember? And now he's getting now. So now it's a camera. Just at least we got a 3se second. I think it was like maybe it was like six, seven years ago at E3. I think I went to an event where they had someone land like a stormtrooper land a jetpack and it was so **** loud that like you couldn't hear anything. It was ridiculous. It's going he's now this guy's jetpacking by the Statue of Liberty. Mhm. Like that's a jetpack. It's a little nice. Yeah, that that's a jetack. Shoots **** jets of honey. So, is it Yeah. So, is it fire? So, what's the water jetack that they That shoots water. Yes. You",
      "start": 1926.48
    },
    {
      "text": "Like that's a jetpack. It's a little nice. Yeah, that that's a jetack. Shoots **** jets of honey. So, is it Yeah. So, is it fire? So, what's the water jetack that they That shoots water. Yes. You know, I understand that, but is that a jetpack by definition? I mean, it might be using water jets maybe. You're right. I'm not I'm not No. I mean, it's kind of terrifying to see this see jetack man fly past the statue of Is no one dressed as Boba Fett yet and done one of these? Oh, no. That's all they do. Every water one I see I swear one out of every three of them they're in a bucket. I was thinking those little personal pods they used the Cobras used to have. Yeah, of course in the G.I. Joe movie. Yeah, that reminds me of the G.I. Joe movie opening backing up for whatever. Oh my god. The water ones are great cuz there's this video we were watching recently of this this guy, a newscaster. When things are on the news, you know it's about to be bad. He's like, \"We're here and we're talking",
      "start": 1977.76
    },
    {
      "text": "ones are great cuz there's this video we were watching recently of this this guy, a newscaster. When things are on the news, you know it's about to be bad. He's like, \"We're here and we're talking about the new water jetacks. come see what it's all about next. He takes off and goes right into the water. It's just like so good. Why do they air this **** when there's embarrassing **** happens? It's like the classic the classic footage of the woman stomping grapes and falls. It's like why is this on TV? It's too late. They do all the live. That was like pre preyou too. That one was making the rounds. Oh my god. Oh god. It's good. Feels like eBOMB's world. So what do we think the future of jetacks are Nick? I think I mean I'm not I'm usually a late adopter and I think I probably would be for this as well. Yeah, I don't think I'd get the first one off the production line by any stretch of the imagination, but for city living if you could land like land on the top of buildings. Sure.",
      "start": 2023.68
    },
    {
      "text": "for this as well. Yeah I don't think I'd get the first one off the production line by any stretch of the imagination but for city living if you could land like land on the top of buildings. Sure. That'd be pretty cool. I mean it would definitely solve Look at your parking would be the entire city. We looking at the wet the wet jet guy. That's awesome. That's awesome dude. Like God bless people that are like \"That's awesome. I got to get that on the internet ASAP.\" Yeah I know. The people who are just watching their local news and they're just like ready to capture anything or put it up or record it and get it out. Love it. Oh my god. Jut dog. The local news. The local news is kind of an absurd thing. It sucks. I hate the look weird where they try to make this like local make like a culture we were dreaming. Kevin and I were driving the other day and they were talking they were introducing the new local newscaster for Kron or Kron or whatever the hell Kown 4. They're",
      "start": 2064.48
    },
    {
      "text": "make like a culture we were dreaming. Kevin and I were driving the other day and they were talking they were introducing the new local newscaster for Kron or Kron or whatever the hell Kown 4. They're like he's a San Francisco native. He grew up here. And then they cut to a sound bite of him. He's like I grew up right there. And then it cuts back and it's like I'm like this is what what is the point of this? Are we trying so you know him? So you feel like a local one of your boys is made and he knows the city he's going to report on. Who the **** is watching the local news? Like someone is because I watch the local news every once in a while when it's just on and I'm like inevitably in the next 10 minutes I'm gonna laugh at some point like because it's so it's so bad like I don't give a **** about anything you're saying. Nothing that you're saying is relevant to me. Big dog's got to drop in. Big Kev dog. So I recently lost CNN. Like I no longer have CNN the channel. Okay. So this",
      "start": 2115.44
    },
    {
      "text": "**** about anything you're saying. Nothing that you're saying is relevant to me. Big dog's got to drop in. Big Kev dog. So I recently lost CNN. Like I no longer have CNN the channel. Okay. So this morning I was watching local news and it sucks but it was Why don't you watch it in the morning? Why don't you watch MSNBC is pretty good in the morning. Morning Joe. What channel is that? I don't I don't have any 87. I don't have any of those. I don't have um See man. Isn't that a basic cable? I switched plans cuz like it was way cheaper and I now have like double the speed but I lose like the higher end. It doesn't matter. But I that commercial was on and he was pointing at his house from his like childhood. I'm like we believe you and we don't care. We don't care if you grew up here. We can't substantiate this anyway. Yeah. It's it but it's not it's not in any way shape or form relevant at all that you are a local that you grew up here. It's a local boy made good. You don't",
      "start": 2151.52
    },
    {
      "text": "We can't substantiate this anyway. Yeah. It's it but it's not it's not in any way shape or form relevant at all that you are a local that you grew up here. It's a local boy made good. You don't understand like you know it's a cutthroat world being a TV reporter. You get you you start in the smaller market. So to get to a market like San Francisco get to be an anchor on it. I don't know exactly who you're talking about it. This there's a lot of steps let alone to come back to where you're from. A lot of people are transplants. They go there and they just start reporting on wherever they get they get the job. Would it surprise you to know that I used to watch the Weather Channel for fun? a little bit in the late '80s and early 90s. I really enjoyed the Weather Channel a lot. Tell me a lot about geography. See and I don't Well my question for the local news is that I guess you're talking about San Francisco like I grew up watching the local news in Chicago. Fox 3 Walter Jacobson",
      "start": 2196.8
    },
    {
      "text": "about geography. See and I don't Well my question for the local news is that I guess you're talking about San Francisco like I grew up watching the local news in Chicago. Fox 3 Walter Jacobson Robin Robinson. Well that's because you're you watch Mary Merciano in the morning. **** that interest for me. I could never understand that because yeah you watch this **** and you're like who is the audience for this? And then I remember it's it's all these people just want to feel good about talking about something. So they're like I'm going to report on a story. This is what's going to get me to a real story. Cuz in when I went to college at SF State for video production stuff I was one of the few people there that's not trying to be a news anchor which is kind of ironic for what I ended up doing. Uh not that this is We're delivering the news right now. I'm the one I'm on camera doing this type of stuff. all those other **** There's maybe like two of them that made it and",
      "start": 2232.48
    },
    {
      "text": "I ended up doing. Uh not that this is We're delivering the news right now. I'm the one I'm on camera doing this type of stuff. all those other **** There's maybe like two of them that made it and they're covering news in like weird like like Marin County like cities that I've never even heard of and like they're calling it San Francisco local news and it's like that's not not at all. And so I'm like they can't even point at their house and say I grew up there. They have to stand there and be like I grew up uh across Yeah. And it's like oh my god. And every time they post stuff on Facebook I'm just looking at this **** and I'm just like this is what you're doing with your life. You're standing out there talking about how this local bicycle shop is going to help people. That's not bad though. I mean like don't get me wrong it's not like breaking news but there's people who care about that and want to know about the local business. It's more entertainment though wouldn't",
      "start": 2268.88
    },
    {
      "text": "I mean like don't get me wrong it's not like breaking news but there's people who care about that and want to know about the local business. It's more entertainment though wouldn't you say? Sure. But it's it's a window into your local community. Sure. I mean that's true. My my wife reads the uh the I guess the Marina Times or whatever. It's some sort of like local paper that's just about our neighborhood. And she loves reading it because it actually popped onto like what shops are closing what shops are coming in and you know spoilers. This yoga shop closed. This yoga shop opened. Yeah exactly. Well most of the only shops that can actually afford to be here are like is like Nike and like you know sure the big the big conglomerates. But um I get that. But I just think it's like that's that whole thing is just such a relic of a bygone era right? where they they like like they all dress in the suits and they have the makeup on and then when it's more of a casual thing",
      "start": 2309.92
    },
    {
      "text": "like that's that whole thing is just such a relic of a bygone era right? where they they like like they all dress in the suits and they have the makeup on and then when it's more of a casual thing they just take the blazer off and maybe roll up the sleeves still have the tie though cuz you still have to have an air of professionalism right? And they talk in that voice. Tell me about this thing that you're talking to me about. That sounds great. Back to you Jan. And then there's always the **** 3sec. Yeah I hate that **** Yeah that shit's awkward as hell. But I'll tell you what man. You get attached to these people especially in your local market. And then when you get to see him national my boy Lester Holt you talk Chicago's own Lester Holt who talked to dad down on the crane site. Oh that was a big day. Let me if I'm lying I'm dying. Says a person who has probably big Greg Miller comes 80 times the social following. You were probably 80 times more prof like more",
      "start": 2350.48
    },
    {
      "text": "crane site. Oh that was a big day. Let me if I'm lying I'm dying. Says a person who has probably big Greg Miller comes 80 times the social following. You were probably 80 times more prof like more more popular than But that's not a popularity thing. You trusted Lester Hull and he had he had this bombass mustache. You would have loved it forever. You get a good mustache. Then he shaved it though. He had he had like the Viltro mustache and he shaved it when he went he went national with MSNBC. Lester Hole. Yeah Lester Hull was was the dude. I will tell you two things. Number one we have a weatherman in New York who goes by the name only of Mr. G. That's awesome. And you can look up. So it's like it's like you know Kevin O'Neal blah blah blah. And Mr. G with the weather. And he's like I'm like who the **** is this guy? I've been asking that question for 5 years. Uh on Long Island we have a thing called News1. Channel 1 is just this channel",
      "start": 2390.96
    },
    {
      "text": "with the weather. And he's like I'm like who the **** is this guy? I've been asking that question for 5 years. Uh on Long Island we have a thing called News1. Channel 1 is just this channel ubiquous channel Long Island where it's just it's just 4 hours Long Island news. It's local news for 4 hours a day. And if you want to just lose your mind just tune in. Cuz my dad doesn't have cable anymore. He only gets like you know like NBC and ABC and he gets News 1. But I just sat there and watched it for like 15 minutes. I'm like I can't believe I can't that this channel still exists. And they just are like over in Sioit uh geese are flying from Canada to the I'm like and then like 0 minutes later they're on the same story. I mean this is **** this is awful. This is the worst thing I've ever seen in my goddamn life. The only reason News1 was relevant for one reason Snow Days. School closures. Exactly. You go to the **** News 1 and you got the little school closure",
      "start": 2427.6
    },
    {
      "text": "thing I've ever seen in my goddamn life. The only reason News1 was relevant for one reason Snow Days. School closures. Exactly. You go to the **** News 1 and you got the little school closure kind of thing going. That was the best. That was the best lottery in the world. You wake up and it's been snowing out and you go to your You go to Fox thing in the morning you look at the little ticker and you're just waiting. Just waiting. Just wait. We don't get that **** out here. Nope. The only The only time school was closed was like was 911 and that you didn't need local **** for that was clear. You know dude the worst thing is you I guess you guys can't relate. The worst thing was it would be like you know I was in South Country School District so it was it was so it would be like you get to there to the end it would be like you know this school uh closed this school closed this school closed they're like South Country School District -hour delay this school closed",
      "start": 2469.36
    },
    {
      "text": "you get to there to the end it would be like you know this school uh closed this school closed this school closed they're like South Country School District -hour delay this school closed this school like **** It was it was like the worst thing. You were like you were like waiting. It was that was that's so funny that that that feeling you I remember it was a big deal when when our school finally got big enough to make it on there cuz you know we were private schools forever so a lot of times they didn't even **** know. We had the we had phone trees. That was another big way. I remember the preemptive phone tree once we were at basketball practice and we heard rumors that the phone tree had started because what the **** a phone tree? You like one person or two people like five people start calling five people call five people will call five people to let them Yeah. Your family's like when my family gets called by the by mom Y or whatever. We then call three other",
      "start": 2501.52
    },
    {
      "text": "like five people start calling five people call five people will call five people to let them Yeah. Your family's like when my family gets called by the by mom Y or whatever. We then call three other families to inform them that way and spread it that way is how you do it. Okay. But there was one one basketball practice where they were like it's going to be too cold tomorrow. They're they're closing school and we're like what? And then you went home and the phone treats started like yes this is awesome. Oh that was that brings back such a nostalgic feelings for me. Like sometimes you wouldn't go to school for days at a time or a week at a time because it was getting hammered with snow. Especially when I lived in New England and it was even in the only thing that was different was Nor Eastern they never cancel classes because we had underground tunnel system that they strategically built so you couldn't so you can never you never had to like leave like you know as long as you were on",
      "start": 2533.68
    },
    {
      "text": "they never cancel classes because we had underground tunnel system that they strategically built so you couldn't so you can never you never had to like leave like you know as long as you were on one side of the campus you get all the classroom buildings and stuff like that. I was like you **** Everyone else had Everyone else had wasn't you know everyone else was like oh no because we just get hammered in snow up there but also their expectation is snow a little different up there as well as you guys learned at pack ridiculous a lot of pride a lot of pride in a cold environment of Chicago or Boston of like we're going to get through this it's not that cold dad's out there shoveling six feet of snow on this acre long driveway do you want to use a snowblower no it's not that bad all right you're going to die out there dad it's negative10 your dick shrivels up into a little eggorn trying to walk just to the carri Heat it up. Hopefully. Yeah. Sit there and heat it up for 15 30 minutes.",
      "start": 2566.8
    },
    {
      "text": "you're going to die out there dad it's negative10 your dick shrivels up into a little eggorn trying to walk just to the carri Heat it up. Hopefully. Yeah. Sit there and heat it up for 15 30 minutes. You can't start that thing. That was always the Ford Tourist that Po made fun of He made a reference to it because it was the Chicago days. He'd come to my house to carpool in a school or whatever. We'd get in there and I always made a joke that it was like Apollo 13 where I didn't have enough amps but I could if I turned on things in the right order it would be okay. So you'd get in there you turn the car on you then could turn on the heater to get it going. Or no I'm sorry. You could turn the car on you could turn on the radio and then you could turn on the heater. Or if you turn on the car and you went the heater and then you went with the radio just killed the car. You just you sat there. You just sat there. Let this **** thing heat up while",
      "start": 2597.84
    },
    {
      "text": "on the heater. Or if you turn on the car and you went the heater and then you went with the radio just killed the car. You just you sat there. You just sat there. Let this **** thing heat up while you're doing this. You're doing a lot of this. You're maybe making out with pus. Wait man. This makes no sense to me. Yeah but the way he just explained it I didn't realize you were talking about heating up the car. I thought you were still talking about your acorn dick. Oh no. The acorn dick's gone. You got you got to get to the car to heat it up. And I'm like huh? Like was thinking about the dick. Like he's just like I got to get that thing out of thinking about the dick. Let's be honest. If your dick is properly heated chances are the rest of your body is properly heated right? That no situation you can think of where your dick is hot and the rest of you is ice cold. So honestly if you worry about the tip of your dick you're probably you'll probably think it the right way.",
      "start": 2634.0
    },
    {
      "text": "no situation you can think of where your dick is hot and the rest of you is ice cold. So honestly if you worry about the tip of your dick you're probably you'll probably think it the right way. It's like It's like in Batman Begins when he says \"Don't worry about your arms. Worry about your dick. The rest of your body will go I don't have to save you.\" Still kind of **** burning. This is very nostalgic. It reminds me my dad had he still has it. this this Vermont wood stove these these iron stoves that you like get handcasted. They're really expensive. You have to drive to like Burlington and bring them down. You have to have like 17 people put in the back of your **** truck. And he would use you buy a bunch of wood cords of wood and like use that instead of like my dad like wouldn't use the heat. It was a we used to tell the story in a minute. The the uh cuz we had we had a thermostat which is like you had to have there was a strategy about using it so your dad my dad would",
      "start": 2667.84
    },
    {
      "text": "use the heat. It was a we used to tell the story in a minute. The the uh cuz we had we had a thermostat which is like you had to have there was a strategy about using it so your dad my dad would never know um until he got the oil bill but you would risk it anyway. It didn't matter. But he would heat he put this thing in and it was in the center of the house. So like it would go it would proliferate around the house pretty nicely. But if you were in the living room it is so **** hot in there. I was like you'd sit there and watch TV. You're like sweating. You're like your underwear but you look outside it's like 0 degrees out. But uh my dad we used to have this like **** scheme going on me and my sister and then me later when I was when I was uh when I was by myself after she went to college where my dad uh never like hated using the heat. You could never put the heat above 6 or something like that. And it was like a little thing you turned or whatever. And so we would do it and",
      "start": 2704.48
    },
    {
      "text": "college where my dad uh never like hated using the heat. You could never put the heat above 6 or something like that. And it was like a little thing you turned or whatever. And so we would do it and put it on like 70 or 75. And then when you would hear the garage door open when you come home and you'd run downstairs but if you had your music on or like you weren't home or you forgot oh dude it was over. And you would walk in as a family guy that kids are kids around about. You'd come in and you'd be like the but you like go right to the thermostat. It' be like on 6 or whatever. He'd be like \"It's definitely like 70° in here right now.\" I'm like I don't know what you're talking about. Just I don't know what you're talking about. We did the same We did the same thing growing up. in SoCal. Uh but with air conditioning and air conditioning was really expensive cuz my parents had uh we had a two-story house and to air condition a two-story house like machine like the outside. Yeah.",
      "start": 2738.72
    },
    {
      "text": "Uh but with air conditioning and air conditioning was really expensive cuz my parents had uh we had a two-story house and to air condition a two-story house like machine like the outside. Yeah. The outside thing it would it would pipe in air. Um and it wasn't until recently that my parents got a smart air air like air conditioner that had two different zones. So you could if you're upstairs predominantly you could it would shut off the downstairs one and vice versa. But my brother and I would literally my my mom was always the worst cuz she would swear to God that it's freezing in the house and it is I mean it's like 95 degrees and she is like it's cold it's cold and I'm like you don't even believe that you're **** lying to me right now. So my brother and I would always when they'd go out of town we would do we would just **** it would be a **** ice box in that place. Like you could see your breath in front of you and then we would go outside party and just leave it on and my",
      "start": 2775.28
    },
    {
      "text": "out of town we would do we would just **** it would be a **** ice box in that place. Like you could see your breath in front of you and then we would go outside party and just leave it on and my mom would come back and be like a $700 bill. We're like we don't know what happened. Don't know why you're trying to raise your family was us. Uh yeah the snow days I don't know about but the smog uh smog alerts we used to have a lot. So we'd have we'd have uh I don't know what smog growing up in southern I know what smog is. We'd have smog alerts cuz the smog would be uh would be too thick and so you wouldn't be allowed to go outside really. Mhm. You would have to just sit. You have to sit. You weren't allowed to like run around because apparently it was supposed to be bad for your lungs. That's where I grew up. But you would see it. I mean you'd like you'd look outside and try to take bets on whether or not they were going to No one **** cared. We all did it anyway. But uh well not",
      "start": 2812.96
    },
    {
      "text": "That's where I grew up. But you would see it. I mean you'd like you'd look outside and try to take bets on whether or not they were going to No one **** cared. We all did it anyway. But uh well not me because I was fat but the people who actually liked physical exertion go out there and do it. I like dope whatever. This hasn't changed my plans one way to just stay inside what I was going to do. I'm like is this going to rot the Twinkie in my hand? Then **** it right? Uh but yeah but but that's that's interesting. But I would still gladly I I still just for the life of me don't understand why people willingly choose to live in the snow. It doesn't make any sense. It's God's way of telling you don't live here. Stay away from here. That's true. People in Phoenix are like what the hell's wrong with you? What are you? Oh that's I know it's dumb. If we should all be living probably in a much more habitable environment. San Francisco probably San Francisco. San Francisco does have the",
      "start": 2849.12
    },
    {
      "text": "wrong with you? What are you? Oh that's I know it's dumb. If we should all be living probably in a much more habitable environment. San Francisco probably San Francisco. San Francisco does have the most like that's the weather. This is what you're going to get. Don't worry about it. It's not going to fluctuate too much often. Yeah. I mean for I'm trying to think if there was any was there anything that schools would stop for earthquake day. No earthquakes would happen day and we're just kind of here. Do you remember like the earthquake drills where it's like and you're like \"All right go under the desk.\" They had to teach us like do you know how everyone has fire drills? They would do earthquake drills like once a month where everyone had to get under a desk or in between the the door things. It was so disruptive. Ours were tornado drills. Yeah. You go out of your classroom get to in front of your locker and then get down in a ball and cover your head cuz kiss your ass",
      "start": 2884.56
    },
    {
      "text": "the door things. It was so disruptive. Ours were tornado drills. Yeah. You go out of your classroom get to in front of your locker and then get down in a ball and cover your head cuz kiss your ass goodbye. It's **** over a tornado. Do you have to um do you have to like lasso yourself to a pipe? No. I always thought I thought there was so many you know easier ways to do that. Safety latches. You guys just like latch on like they do in the when you're out in space. You know what I mean? Like we're going to latch on. Yeah. Yeah. Um by the way all that's **** You know that right? Like oh absolutely. They were like go they don't I don't think they even teach kids that anymore. Here's the thing. The doorway thing is like table. This table. You think this is going to **** save us from earthquake? I guarantee you the **** at Sutro Elementary School ain't helping anybody. Those little pieces of flimsy ass plastic. Get out of here. Yeah right. Just to make you feel better.",
      "start": 2919.76
    },
    {
      "text": "us from earthquake? I guarantee you the **** at Sutro Elementary School ain't helping anybody. Those little pieces of flimsy ass plastic. Get out of here. Yeah right. Just to make you feel better. It's like the our parents used to tell the story about the nuclear drills where it's like get on your desk. It's like are you **** nuts? It's a it's a goddamn sun exploding outside. I think we're dead. Doesn't matter if we're hiding under goodbye. Supposedly uh and this could be old as well cuz I think I heard about five six years ago but supposedly the best thing to do is to get near near something that's strong for Wait what are we talking about now? Earthquakes. Thank you. So that when cuz I guess they I guess they looked at a bunch of buildings that had collapsed and they noticed triangles constantly. So like when the roof top collapses it it hits and then it'll it'll get stuck on something that's strong and it'll make a triangle. And if you're right here if you're in the",
      "start": 2957.44
    },
    {
      "text": "triangles constantly. So like when the roof top collapses it it hits and then it'll it'll get stuck on something that's strong and it'll make a triangle. And if you're right here if you're in the middle of it you can actually survive. So they say get close to your bed because a mattress can actually take a fair load of weight and still teeter. I mean you're still stuck in this small area which you're going to live. But they but don't get near your **** **** Like you're just going to get jam finger if you go into your door. Yeah. The tornadoes if you're at home and it's **** bearing down and you The deal is you're supposed to grab the mattress and go lay in the bathtub. Really? Yeah. That's hilarious. Use the mattress king size. Use the mattress to cover. Yeah though cuz then you're not getting hit by glass. There was only one where my mom's like \"Ah go get in the bathtub. This might be the one.\" I was like \"Ah god damn it. Walk over there. Take a",
      "start": 2993.2
    },
    {
      "text": "though cuz then you're not getting hit by glass. There was only one where my mom's like \"Ah go get in the bathtub. This might be the one.\" I was like \"Ah god damn it. Walk over there. Take a cat. Get in the Oh yeah. Dude tornadoes were empty cups and you and you dumped your your drawer full of action figures into the bath.\" I remember when we were uh like it was like you know I was talking to you earlier on one of the shows about like when we my parents like obsessed with going out to the country for whatever and there's always a tornado. There's always some severe weather whatever. It all comes during the summer. So we would do that thing where like you know I I did a day camp or whatever right? Where you know arts and crafts and you go to the pool every day. It was mainly like a supervised thing to the pool every day. But like they all go to this water park. All right cool. You go. And I remember this **** tornado warning comes in. It's like in the BBS of Glenn Ellen",
      "start": 3026.08
    },
    {
      "text": "a supervised thing to the pool every day. But like they all go to this water park. All right cool. You go. And I remember this **** tornado warning comes in. It's like in the BBS of Glenn Ellen you know I'm growing up here the BBS of Chicago in Glenn Ellen. Unincorporated Glenn. Uncorporated Glenn Ellen. But I would be downtown Glenn for the day camp right? When the tornado siren goes off it's like cool. It's too populated. A tornado is not going to roll through here. Like I'm not we're going to be okay. Okay it's just going to be really bad weather really bad thunderstorm hail whatever. You know what I mean? But when you're out in like hey we built a water park in the middle of **** nowhere. That's a real tornado situation. That's a real thing that's going to get you. And I remember having if that one sirens go off and like the adults really freaking out of like getting you into the locker room and having you **** go into the little ball in front of these lockers",
      "start": 3057.12
    },
    {
      "text": "I remember having if that one sirens go off and like the adults really freaking out of like getting you into the locker room and having you **** go into the little ball in front of these lockers kids just **** sobbing. God everybody's going to die. Yeah that sounds scary as all **** And then it doesn't happen you get on a bus and go back. You're like war vets like you seen so much **** out there. I would think that I would just sit in the water and then let the things suck the water away from me and I'm just bone dry. Did you ever were you ever in an earthquake? Like a real earthquake? Not in one little tiny ones. No I don't remember there ever being one that big. I'm sure there was but when you grow up in Southern California it's just doesn't you just feel earthquakes all the time. They're just like the little tiny things as earthquake right? I mean I was here obviously for the '89 earthquake which was crazy but I was a baby so I don't remember. My mom acts",
      "start": 3089.36
    },
    {
      "text": "all the time. They're just like the little tiny things as earthquake right? I mean I was here obviously for the '89 earthquake which was crazy but I was a baby so I don't remember. My mom acts like it was the scariest thing of all **** time. It was pretty big. But uh your house like when when you moved out still had the cracks on it. Yeah my house was like devastated by that **** Um but growing up I I experienced the little ones forever. But then when I was like 14 maybe there was a a fairly big one. And I'll never forget I was in my garage and all of a sudden like it was me and my brother were just like playing with our **** skateboards or whatever. And I just hear noise. I'm like \"That sounds like giant dominoes falling.\" He's like \"Yeah it does. It's really weird.\" And all of a sudden the giant the noise hit us and everything was shaking. I'm like \"Holy shit.\" Like this is like a **** scary movie. Like we're going to **** die right now. That's freaky. It was",
      "start": 3126.16
    },
    {
      "text": "all of a sudden the giant the noise hit us and everything was shaking. I'm like \"Holy shit.\" Like this is like a **** scary movie. Like we're going to **** die right now. That's freaky. It was It was really really scary. We ran into the middle of the street. That's what cuz that felt safest. Yep. I agree with that. People are always like \"Oh no you want to get Well because of the power lines you got. There's a lot of power lines around. The I'm I'm running into the backyard. That's fine.\" But the the uh first time I felt an earthquake was like a 5.1 or something when I first moved here in 2000. So it's not a big one. I mean it's a you feel it. It was but I never felt an earthquake before and and uh it was in I was I lived in Daly City and I was like in my underwear in my bed like playing a game or I don't know what I was doing and I like ran up and out into the street like my underwear and then I real like without even thinking like I got to get out of this house and then",
      "start": 3168.48
    },
    {
      "text": "playing a game or I don't know what I was doing and I like ran up and out into the street like my underwear and then I real like without even thinking like I got to get out of this house and then there I'm like just no one's around. It was like you know lived in the hills of earthquakes are creepy. I sometimes I think I've said this before. I wonder sometimes I just sit and you know at tranquil moments in time and I'm like it could happen right now. Oh anytime. Like just right now warning there's nothing you can do about it. It's going to happen. It is going to happen. The city is going to fall into the **** Pacific Ocean one day. That that was the the scary weird thing. You know they talk about like trying to make the kids feel safe. They also terrify the goddamn kids. Like you you that sounds like a traumatic experience right? And I get that that's trying to protect you or whatever. So that's cool. But so I went to middle school in the Marina and oh that's a bad spot. All the",
      "start": 3200.4
    },
    {
      "text": "that sounds like a traumatic experience right? And I get that that's trying to protect you or whatever. So that's cool. But so I went to middle school in the Marina and oh that's a bad spot. All the time they're like if an earthquake happens we're gone. It's we're just gone. We're gonna sink into the ocean and we're all going to be gone. And it's like don't tell me that. Just let it happen. The Marina is supposed to be legit awful for an earthquake though because it's because of the sand the liqufification of the sand there and stuff like that. Yeah. And it's built on top of the rubble of the 1906 earthquake which was a bad earthquake. But so I I I've heard the same thing that like the Marina has finished if there's like a really bad earthquake. Yeah. I'm like good because I'm there all the time now. So technically I think you're in Cow Hollow. Really? Cuz I think anything I think anything north or south rather of Lumbard is Cow Hollow. Okay. The Marina starts at Lombard and goes I",
      "start": 3238.96
    },
    {
      "text": "the time now. So technically I think you're in Cow Hollow. Really? Cuz I think anything I think anything north or south rather of Lumbard is Cow Hollow. Okay. The Marina starts at Lombard and goes I think that's all technically he's going to break off at Lombard and float away. I think I think we're all on bedrock but I could be wrong. Don't don't don't quote me. That would be great. Yeah. Because that that's been as long I mean when we used to go to the comic club and stuff people used to talk about you the Marina. Yeah that's an earthquake but um still I mean I don't know I don't really have any but they do say Kev you probably know about this. I don't know that the the the there's two kinds of or there's multiple kinds of earthquakes but they were saying that the there's only there's a there's only an upper limit that they think that an earthquake in San Francisco could have in like the sevens. They were saying like it can't get much worse than that but they were because of",
      "start": 3276.0
    },
    {
      "text": "a there's only an upper limit that they think that an earthquake in San Francisco could have in like the sevens. They were saying like it can't get much worse than that but they were because of the because it's either like the the sub subduction I don't know what I don't know the terminology the one earthquake where one goes on top of the other and the other where they slip like they get stuck and they slip. Whatever one is like weakest or like they can predict is the one that's up here and they were saying in Southern California that's where everything's gonna get **** up. They were like I was I was reading about that recently because there's a lot of interesting stuff about well two things. One in Washington in Seattle they say they're **** up there because there's a massive Remember this story made the rounds like it was like it was in the New Yorker or something like that a long time ago where they were like no one's paying attention that there's like terrible **** going on",
      "start": 3307.52
    },
    {
      "text": "this story made the rounds like it was like it was in the New Yorker or something like that a long time ago where they were like no one's paying attention that there's like terrible **** going on in the Northwest and that's like where that there's going to be like an awful earthquake and they were saying it was along some some corridor. So I heard San Andreas's fault. They were saying like everything east or no everything west of this corner this highway they're like it's **** like and they and they and it was a fascinating thing where they were saying they traced this major earthquake that happened there like a thousand years ago to this huge tsunami that happened in Japan and like and they were talking about the investigators that figured out that it was the earthquake there that caused this massive tsunami and then they did all this like back this calculation about how bad it was and like how the earth like dropped and **** like that like at that point. Um and the second one",
      "start": 3337.2
    },
    {
      "text": "this massive tsunami and then they did all this like back this calculation about how bad it was and like how the earth like dropped and **** like that like at that point. Um and the second one is in I think it's in Yellowstone right? Uh or there's one in southern Illinois that's really bad too. They're saying there's a mega volcano in one of the national parks and they're like \"If this bad boy goes off the **** a mega volcano?\" It basically all of Yellowstone is a big ass volcano. And they were like and they were just saying \"It seems like it's okay right now but if this like goes off like it's probably going to cause like it's the United States is at least they're like it's going to be like a nuclear winter.\" Yeah. You know so have you seen a few trigger points here? The uh the devastation of Mount St. Helen like that is insane. the the I saw a documentary on on you see it with your eyes. It's **** nuts man. It's like it looks like a nuclear bomb went off. It's crazy.",
      "start": 3369.52
    },
    {
      "text": "devastation of Mount St. Helen like that is insane. the the I saw a documentary on on you see it with your eyes. It's **** nuts man. It's like it looks like a nuclear bomb went off. It's crazy. Yeah I saw Nova about how uh Nova being one of my favorite shows. Fantastic show about how the the plant life and the animal life started slowly coming back the last few years and they were like what they sent back because you're still not allowed to go like around there or whatever unless you're like an investig or a scientist or whatever and they were going and they were finding like plants kind of making the comeback and and all that kind of **** because Mount St. Helens went off **** nuts. I think it was 1980. So jetpacks. Oh yeah. Yeah jetacks. So I want one. I think mine would be carbon fiber. Like a black carbon fiber. That'd be dope. And I call it the Super Dragon. How long was that topic Kev? Big C dog. Minutes. No it's 30 minutes. Okay great. Okay so my topic then is I",
      "start": 3406.4
    },
    {
      "text": "fiber. Like a black carbon fiber. That'd be dope. And I call it the Super Dragon. How long was that topic Kev? Big C dog. Minutes. No it's 30 minutes. Okay great. Okay so my topic then is I want to know what do you never do anymore but you always thought you would? So like what is something you gave up a long time ago but when you were so lost in the moment of it you thought you'd do it forever? Smoking. Yeah. Yeah. I haven't smoked a cigarette in a really long time. Okay. I always thought I kind of would I always had in the back of my mind probably will go back to it but I always had the back of my mind that I would I would just do this and I I figured I'd quit one day but when you smoke for like 10 years it's just a part of your life. It's weird. And the fact that I just don't do it anymore. I'll see people smoking. I'll walk by and see them. You still have the triggers right? Where you Oh yeah. I mean once you once you're addicted you will have that spike of like I",
      "start": 3444.88
    },
    {
      "text": "do it anymore. I'll see people smoking. I'll walk by and see them. You still have the triggers right? Where you Oh yeah. I mean once you once you're addicted you will have that spike of like I need that forever. Like you'll see someone and you'll like it's funny cuz I'll be disgusted like oh god that smells so terrible. I want one. I need it. It's just weird. It's It's a very weird feeling. It's It's a weird feeling having your brain chemistry betray you. Um but yeah that's actually one of those things that I look back on. I'm like I can't I can't **** believe that I used to do that. I can't believe that I used to go like a half a pack to a pack a day and just chain smoke and thought I needed it. That was that was the big thing is I was always like \"Oh this is great. I need this because it's my one time to have a break or yada yada yada.\" Turns out I'm just as highrung now as I was back then. Um if not a little bit better than I was then because I'm never like jonesing",
      "start": 3486.08
    },
    {
      "text": "this because it's my one time to have a break or yada yada yada.\" Turns out I'm just as highrung now as I was back then. Um if not a little bit better than I was then because I'm never like jonesing for that nicotine like I was before. Um but yeah that's that's one of those that's one of those interesting like wow I haven't I I look back on it and it's been like I think the la absolute last cigarette I ever had was in February of this year. So it's been almost 6 months. Yeah six months. I forget. You did the patch for a while. You did the gum. What? Did the patch for a while. It worked. Um and I would use the but then I I figured out that I could use the patch to kind of smoke whenever I wanted to and then go off of it. So I would I would slap a patch on for like a couple days so I wouldn't go through as bad of withdrawals. And then when but then inevitably I would be like I really want a cigarette right now but I got this patch on so I just take the patch off smoke a",
      "start": 3524.32
    },
    {
      "text": "so I wouldn't go through as bad of withdrawals. And then when but then inevitably I would be like I really want a cigarette right now but I got this patch on so I just take the patch off smoke a cigarette put the patch back on. It was pretty bad. It it got pretty bad. I'm proud of you though for doing it. Yeah. I mean hopefully it sticks. You went through all convention season and didn't screw up. Yeah. And that's usually where the big the big trouble is. Well um yeah. I mean that's that's when it's hard cuz you're partying every night and it's just super fun. There's nothing quite as lovely as a cigarette in a cocktail or a cigarette in a cup of coffee or a cigarette when you wake up in the morning or a cigarette right now. Do you do you feel better? Yeah. Like demonstrabably. Yeah. I mean I your energy is a little bit more like you're not you're not having the peaks and valleys anymore. And also you just I can breathe better. Um I just you know I mean it's it's it's it's a pretty",
      "start": 3561.04
    },
    {
      "text": "mean I your energy is a little bit more like you're not you're not having the peaks and valleys anymore. And also you just I can breathe better. Um I just you know I mean it's it's it's a pretty big drain on you when you smoke that much. Sure. So I don't recommend it. If anyone out there smoking quit. Just quit. Good job Nick. Thanks. What about you Greg? What do you do now that you've Well I I thought I mean I Yeah exactly. I kicked around and I don't know. I don't have great answers for you and they're all That's a real serious one right? I mean mine are all superficial stuff. I think when I really dumb one but I feel like when I I don't know if when I got back into wrestling in high school and all my friends were into wrestling. I remember being so into wrestling. I don't know if I ever thought like this was a passing thing again. You know what I mean? Because I had done it early 80s like or whatever for mid to late '80s like all kids did of Hogan and Warrior and that",
      "start": 3594.72
    },
    {
      "text": "if I ever thought like this was a passing thing again. You know what I mean? Because I had done it early 80s like or whatever for mid to late '80s like all kids did of Hogan and Warrior and that stuff. Then when the attitude area started it was so awesome and so different and it was cool to like wrestling and you're talking you know in school about it with other people. I remember that being awesome. And when I went to college even I was still in wrestling and like going to shows and talking to people there and it was such a this is rad. And then like I remember somewhere in sophomore years being like it's just the same **** over and over again. Like it seemed like attitude era changed everything and anything could happen and then it very much became by the numbers by the book where I still think they are to in a way now. You know what I mean? It's like I fell out of it and I don't remember though at any point being like this is forever. But it is that thing of like I was so",
      "start": 3637.44
    },
    {
      "text": "I still think they are to in a way now. You know what I mean? It's like I fell out of it and I don't remember though at any point being like this is forever. But it is that thing of like I was so into it. It would be like all of a sudden like you know not liking Superman or falling completely out of comic books which I guess I kind of did too before digital like before I could buy everything digital. I didn't want the the collections and I didn't have the spare income so I wasn't really buying stuff. I was reading them off Barnes & Noble shelves and trying to keep up the best I could but not being as into it. But I guess even there there was still the passion to drive and I wanted to be a part of it. If you're if you're driven enough to go to Barnes & Noble and read into like a bunch of comic books then well I mean that was the thing like I remember when in college when I got the internship out in DC uh like there you know you I only knew the other interns really. We'd go out and",
      "start": 3670.08
    },
    {
      "text": "of comic books then well I mean that was the thing like I remember when in college when I got the internship out in DC uh like there you know you I only knew the other interns really. We'd go out and drink or whatever. I just turned 21 not too long before that and uh getting there and then like having you know waking up on a Saturday with nothing really to do. I you know I had a long-distance girlfriend back in Colia at the time. It was just like cool I have zero money. I'm making basically nothing off this internship and I would drive to Barnes & Noble. you know what I mean? And get a coffee or a bottle of water and then just like pick trades off the shelf and walk over there and read magazines and stuff and just chill out and read in this like library that wasn't a library at all that nobody cared about. They was happy to have butts in the seats against people there. Uh another one I thought of again super trivial and stupid is that in high school me and my friends started the",
      "start": 3700.48
    },
    {
      "text": "nobody cared about. They was happy to have butts in the seats against people there. Uh another one I thought of again super trivial and stupid is that in high school me and my friends started the tradition of every Halloween we watched Idle Hands and I That's one we should bring back. And I loved it. And I remember and it was just like one year where it was like November 14th or whatever. I was like \"Fuck I didn't watch Idle Hands this year.\" And then just never did it again. You've never been the same. Yeah exactly. I wish I wish you were the Greg Miller. You could have been. Let's call up Devon Sawa and see if he'll give us a copy of Idle Hands. I mean we can buy them probably watch it. What we need to do is get Devon to come. That'd be amazing. Or then you watch house knock on the door. You've overstepped the house. Figured out where you live. Ha. You know like jump out at him. He'd be like \"Oh cool. What's up Greg?\" Like \"Get the **** out of here.\" No Devon's down.",
      "start": 3737.36
    },
    {
      "text": "the door. You've overstepped the house. Figured out where you live. Ha. You know like jump out at him. He'd be like \"Oh cool. What's up Greg?\" Like \"Get the **** out of here.\" No Devon's down. Devon's cool. I retweeted Devon. Say hi Colin. What What about you? Well two things come to mind for me. Uh one is been playing hockey. Um you thought you did forever. Yeah. Yeah. Well I thought I would like I hockey dominated my life for like a really long time and I don't think people that know me as an internet personality in quotes really and they know I like hockey and I I love the game but like I played hockey all year for many years. I played in leagues constantly. I was on traveling teams. I played for high school. I played for all these kinds of things and uh I was pretty good and and you know not like I was fantastic. I think I was better when I was younger. I played in much more competitive leagues when I was a kid. Um but um I always thought that I would play in some",
      "start": 3772.4
    },
    {
      "text": "and and you know not like I was fantastic. I think I was better when I was younger. I played in much more competitive leagues when I was a kid. Um but um I always thought that I would play in some capacity and I get jealous sometimes or a little envious because I know I could just do it. I can I mean skating is like riding a bike for me. I've been skating since I was like six. But you almost did it recently right? Yeah. I have my pair of skates now and I I just uh someone invited me to go to a men's league or whatever. But like the thing is like my friend Kevin who did our NHL '94 let's plays with us and like he he plays hockey still like all the time and I'm so jealous. He's like it's just a good time. We just get a 30 pack of beer and like put it on the bench and just split the teams up or whatever and just **** around. like we just rent the rink and I remember ice time was so expensive when I was a kid and it's still expensive but then I realized like oh I have a job it's not",
      "start": 3809.44
    },
    {
      "text": "up or whatever and just **** around. like we just rent the rink and I remember ice time was so expensive when I was a kid and it's still expensive but then I realized like oh I have a job it's not like hey you're an adult you know I remember my mom paying like thousands of dollars for me to play hockey like every year you know and not to mention like my equipment not to mention I was a goalie so I was getting you know I was getting a lot of like I used hockey fans would respect it I guess I I used to use Brian's equipment which was like handstitched in Canada and like really nice you know blockers and gloves and pads and um so I always thought I would just play when I was a senior like right before 911 right before my senior year high school I broke a collar bone and I was I was out for the year and I I couldn't play and uh and then I just fell off and and I've played a few times since then and I've skated since then but I I always thought I would play hockey. Um that was a big",
      "start": 3841.04
    },
    {
      "text": "for the year and I I couldn't play and uh and then I just fell off and and I've played a few times since then and I've skated since then but I I always thought I would play hockey. Um that was a big part of my life and I do miss it. I I think that I I remember the smell of hockey. I remember like the the like the the taste of it like 5 or 6 in the morning when ice time was cheap and you would just go with your friends and like just get on the ice and that sound of like fresh you know fresh ice and the puck hitting the stick and the puck ringing off the crossbar which was like my best friend because I was a goalie was always a good sign because it didn't go in. Um and uh I I remember those things very audio visual kind of kind of memories for me. The other thing that I think is bigger that has more resonance to me as an adult is uh chess. Um I play I got really into chess when I was like 1 or 13 and I played chess throughout high school and in college and I played chess all the",
      "start": 3874.72
    },
    {
      "text": "that has more resonance to me as an adult is uh chess. Um I play I got really into chess when I was like 1 or 13 and I played chess throughout high school and in college and I played chess all the **** time constantly. Constantly played chess and um and a chess I was actually very good at and I I really enjoyed it. I would read about I'd read strategy about it. I'd play online. I'd go to uh um clubs and cafes and like uh play like there's a when I was in high school especially like 11th and 12th grade and then like early in uh college I played chess like every day. I would go I would sometimes like cut school or like after school go to Washington Square Park in New York City like get on the train with my friend and go play there at the park with all the tables in the open and stuff. Yeah. You'd see that and like searching for searching for Bobby Fisher. My question I have a question about that cuz I always wondered so pieces are just there and nobody steals them. No no nose aren't",
      "start": 3913.44
    },
    {
      "text": "You'd see that and like searching for searching for Bobby Fisher. My question I have a question about that cuz I always wondered so pieces are just there and nobody steals them. No no nose aren't there. You people go and like occupy those tables and a lot of them are playing a game called blitz which is um conventional chess rules but 5 minutes aside. You can play bullet which is like one or two minutes aside which is like incomprehensibly fast like I can't play that and you're playing for money there. So I would I would you're not playing for fun. And I think I've told the story is that like one of my first times in Washington Square Park I had like what was a kind of a scary situation. It wasn't scary. It was just like I learned a lot where I was waiting to play this guy and um he was and his clock had run out but the other guy didn't notice. So like he was playing as and like hitting the clock like it's gamesmanship. Like the guy didn't notice. He didn't call him out. So they're",
      "start": 3952.0
    },
    {
      "text": "and his clock had run out but the other guy didn't notice. So like he was playing as and like hitting the clock like it's gamesmanship. Like the guy didn't notice. He didn't call him out. So they're playing whatever. And I'm like your clock's out. And and the guy looked at me he's like \"What the **** are you?\" And he was like a grown man. I was like 15 or 16. What the **** are you doing? you know like and like lost like $50 on the game or whatever. And I was like \"All right like you kind of have to learn the rules of the road there.\" And I wasn't very good at playing blitz but um and I'm still not I like playing standard games but um I learned a lot about playing chess in in in Washington Square Park and it's it's an iconic place to play chess. And so me and my friend Dave used to go there um a good buddy of mine and I used to I played chess with Dave like thousands of times. Like he we he drove a Honda Civic I remember and we we took like a few classes together. We",
      "start": 3982.0
    },
    {
      "text": "used to go there um a good buddy of mine and I used to I played chess with Dave like thousands of times. Like he we he drove a Honda Civic I remember and we we took like a few classes together. We had lunch at the same time. So we would roll out the mat at lunch and play. We would play in the back of our astronomy class. Astronomy was basically like a throwaway science class when you were a senior. And our professor like Orion's belt I got it. Yeah. Our teacher was like \"Really?\" The cat. So we would constantly be playing chess there. I'd play chess at lunch. I'd play chess after school. There's this place called Kitchen and Coffee. That doesn't exist anymore. I used to go there and play chess. Um I used to go to Borders and play chess. There was a skate shop that we used to go to and play chess. They'd let us sit in like the display window and play like games of chess like bunch of people. Um and uh I played regularly until I got here um in 2007. And then 2007 2008 I would",
      "start": 4015.68
    },
    {
      "text": "and play chess. They'd let us sit in like the display window and play like games of chess like bunch of people. Um and uh I played regularly until I got here um in 2007. And then 2007 2008 I would play ICC which is internet chess club which is like a cool place like apparently Howard Stern plays on there and like a bunch of other people like it incognito um kind of way and I would play there and you have ratings and stuff like that and and uh you pay money but eventually like I I lost the the allure of the game because it just like you I want to play with people and I lost like my whole group of friends that play and I've always intended on finding I know San Francisco chess clubs. I know people play here I'm sure. Um and I but like getting back into the chess like I can play like I I I kid around with this with Jared actually cuz Jared plays chess Jared Petty who's who was on the show not too long ago where I was like the thing about chess that's funny is a lot of people know",
      "start": 4046.72
    },
    {
      "text": "I I kid around with this with Jared actually cuz Jared plays chess Jared Petty who's who was on the show not too long ago where I was like the thing about chess that's funny is a lot of people know how to play it but you can destroy people in chess. Like if they like I I sit down at the chess table and always expect to win unless I know that the other person knows how to play and and you can do like dickheaded moves like bringing your queen out really. You can beat a person in three moves in chess. And I I and when I don't and when I don't trust that a person knows how to play chess I do that move to like just see like like um because if you if they know if they know you're doing it if they can destroy you like they can trap your queen and all this kind of stuff. So it's a good way. It's a good litmus test but I want to like be able to sit around people. I'm not saying I'm like a **** grandmaster by any stretch of the imagination but I want to play with people that I know",
      "start": 4083.28
    },
    {
      "text": "It's a good litmus test but I want to like be able to sit around people. I'm not saying I'm like a **** grandmaster by any stretch of the imagination but I want to play with people that I know can beat me. And um when you don't play chess for a while you lose it. you always know how the moves go but like you stop seeing the board the way you see it um when you play it every day. And so more than hockey even I always expect that chess would be a big part of my life. And I still contend to this day that chess is the greatest game in the world. Um better than any sport and better than any video game for sure. And and I and I I love it. It is it is a perfect immaculate strategic brain driven fascinating game. And when you read about it and when you read about these tournaments and you read about these people that played and and the some of these people go crazy in their minds like that they play against themselves because they can't find any good challengers. These guys playing",
      "start": 4113.76
    },
    {
      "text": "read about these people that played and and the some of these people go crazy in their minds like that they play against themselves because they can't find any good challengers. These guys playing computers these guys these guy you know um Gary Kasparov playing Deep Blue the IBM's supercomputer or whatever it's and like thinking that they're cheating. There's a lot of fascinating stuff like when Deep Blue beat Kasparov I think in '96 or whatever. Um he like got **** furious thinking that they were like cheating and stuff like that. And it's like there's a man inside the machine. Um is that how long ago it was like when Well they played like over and over again. and they came like I think they're like on a on like the fourth or fifth iteration of that computer. But like the idea that um cuz it's pretty Didn't it get to a point like recently where it it's pretty unbeatable? Yeah. I there there are algorithms where but the there are algorithms that are like really hard even if you play",
      "start": 4152.24
    },
    {
      "text": "it's pretty Didn't it get to a point like recently where it it's pretty unbeatable? Yeah. I there there are algorithms where but the there are algorithms that are like really hard even if you play like chess master or any of these games or whatever like I get to a point where I'm like I cannot like these guys destroy me these um because there's no room for error. But chess the problem with computing with chess is it is so brain driven. And it is so it is such a clever game like there are way like there are sacrifices and gambits and all these things discovery checks and all these kinds of things that um require a human mind like why would you throw away your pieces like that like the computer might not be able to understand like why would you why are you sacrificing like now but you want position you know like and it's so it's so I I they're they're able to do and they're making these great computers but um I remember the my the greatest game I ever played I was a senior in high",
      "start": 4182.96
    },
    {
      "text": "want position you know like and it's so it's so I I they're they're able to do and they're making these great computers but um I remember the my the greatest game I ever played I was a senior in high school this at Kitchen and Coffee and um I used to play with this guy Justin all the time. He used to destroy me. He had a friend um he was like a great chess player on Long Island like he was like pretty renowned and um I used to play you play better people and you learn like just you write notation you learn how to write chess notation and you can play the games back later and like learn what you did wrong or what you did right and there was this guy that used to play there all the time and he wanted to play me for fun. He was like really good like a renowned player and um I lost my queen and which is dev like when you lose your queen in chess it's devastating it's over the game's over if you don't have your queen the queen for people that don't know most powerful piece in chess um it's",
      "start": 4221.76
    },
    {
      "text": "which is dev like when you lose your queen in chess it's devastating it's over the game's over if you don't have your queen the queen for people that don't know most powerful piece in chess um it's like a rook and um a bishop combined basically and so it is a it is a massively uh powerful piece and you usually don't bring it out until the mid or end game and um you protect it at all costs actually because you don't want to lose it and this guy took my queen and I was devastated but I kept playing and the guy was flustered by this. He's like he's like like like it was surprising I didn't knock my king over and be like I I resigned like and I kept playing and I won like I beat him cuz he didn't mon and I I'll never forget as long as I lived this guy was like in his 50s. I was like 16 or 17 years old and I beat him. I I remember um like sacrificing a rook and he just moved and I and with another rook I took his queen and so I was only down a rook and then um instead of being down a queen",
      "start": 4263.04
    },
    {
      "text": "old and I beat him. I I remember um like sacrificing a rook and he just moved and I and with another rook I took his queen and so I was only down a rook and then um instead of being down a queen and then and then I I solely materially gained like position on the board. He hadn't castled and stuff like that. So like he wasn't protected. It was like a whole I'll never forget the game. I see it in my head still like how the game went. Not maybe piece by piece. I remember like the waves of the game and he lost and got up and walked out. He didn't say a good job. Like didn't shake my hand. Didn't say anything. And I'll never forget it as long as I live. I remember him the only thing he said he's like \"Why didn't you resign?\" I remember you saying that and I'm like and then left because it was considered like not a gentlemanly thing to do I guess. And you're like \"I'm from New York.\" Really? He asked you why you didn't Yeah. What a **** Because he took cuz he cuz he trapped my queen",
      "start": 4301.68
    },
    {
      "text": "considered like not a gentlemanly thing to do I guess. And you're like \"I'm from New York.\" Really? He asked you why you didn't Yeah. What a **** Because he took cuz he cuz he trapped my queen and like That's awesome. Yeah. I'll never forget that as long as I live. So anyway long people long stories but that was those are my two things. Hockey and trust. Tim Tamaroo. What was a big part of your life that's no longer a big party life you always thought would be a big part of your life? So I got three things. The first one is is not actually an accurate answer for your question because uh things that I always thought would be in my life. Power Rangers Star Wars Spider-Man. I remember thinking vividly I am never going to stop watching Power Rangers. Ah yeah. Like I remember that like being 8 years old and being like I **** love this. I'm going to love this forever because I I equated that in Star Wars. They're all equal in my book back then. Right. Sure. It's kind of weird",
      "start": 4338.08
    },
    {
      "text": "being 8 years old and being like I **** love this. I'm going to love this forever because I I equated that in Star Wars. They're all equal in my book back then. Right. Sure. It's kind of weird how right I was in a way to for what we're doing here you know? So I can't really say that that's something that I don't do anymore because I I really do. Obviously I stopped watching Power Rangers a long time ago. Um but it's it is kind of weird that I all that nostalgia **** never went away. Video games still just a part of my life just as much as they were. Bad TV shows bad movies. We're about to watch Suicide Squad tonight and I'm **** excited about that. That's a really good point actually of things that I I yeah comic you know I thought Superman and DC comics have been with me literally since birth it feels like and you know video games and those things I I bet hard on and they are still vibrant parts of my life. So I feel like those should be the answers but they're not.",
      "start": 4378.4
    },
    {
      "text": "literally since birth it feels like and you know video games and those things I I bet hard on and they are still vibrant parts of my life. So I feel like those should be the answers but they're not. Uh the answers for me are extreme sports I guess. So rollerblades or um skateboarding inline. Exactly. Exactly. Uh that type of stuff. I mean Tony Hawk's Pro Skater and Aggressive Inline and all those video games that came out really inspired me to get out there and do stuff. And even before then like just thinking about playing games like um like recess style games on like playgrounds right? Like handball or foursquare or that type of **** hideand-seek water balloon fights all this stuff. That was such a uh important thing to me. And like to think of like I feel like those more little kitty things turned into the the skateboarding style stuff. Sure. I was 13 when Razer scooters came out. So like those were **** cool. Um and I I can't I could not imagine then that there'd be a",
      "start": 4418.4
    },
    {
      "text": "kitty things turned into the the skateboarding style stuff. Sure. I was 13 when Razer scooters came out. So like those were **** cool. Um and I I can't I could not imagine then that there'd be a time where I'm I'm not excited to physically do things and uh you know roll around on in some do sick jumps you know do some sick every back before we had cars you know like that. It's like what are you going to do today? I'm just gonna go somewhere was the answer you know and it's just you just get on your scooter and go somewhere. I used to ride bikes like nobody's business and I probably thought I always ride bikes. Yeah. Exactly. All that stuff. And it's if I were to go back to even 15-year-old Tim and be like \"Dude you're not going to give a **** about the skateboard you have it would blow my mind.\" Yeah. You know I used to have to before cars have to go to Kevin's house. I'd have to take the bus and he was like a 30 minute walk uh to get to his house and uh it would it'd",
      "start": 4465.76
    },
    {
      "text": "would blow my mind.\" Yeah. You know I used to have to before cars have to go to Kevin's house. I'd have to take the bus and he was like a 30 minute walk uh to get to his house and uh it would it'd be like a 10-minute skateboard or scooter or whatever and it's just like that **** was just like hell yeah this is awesome. I maximizing my time. Yeah. So I'm I'm kind of sad that that's not in my life anymore but I also couldn't imagine it being there. I'd love it if I'd love it if you still rode a Razor scooter around. No but see then it retros or they got all retro right? So now it's like cool to do him again but it's not. It's definitely not. You know what is cool? That little wheel you get on and just I mean that's I'm going to take a step back for a second and say that it was actually never cool to ride a Razor scooter. I mean and if I mean when not as cool as it was when you were like like skateboarding skateboarding from its inception has always been cool right? Very true.",
      "start": 4512.16
    },
    {
      "text": "never cool to ride a Razor scooter. I mean and if I mean when not as cool as it was when you were like like skateboarding skateboarding from its inception has always been cool right? Very true. from like the the late 70s or whenever the **** it started happening to like when I by the time I was born in the 80s 1980 uh skateboarding was like if you didn't skateboard you were like you were like you're not cool at all and I was not cool not skateboard I tried my brother broke his wrist and then my mom took my skateboard away **** you not in a herculean effort snapped it overnam and just **** hurled it into space I remember getting my skateboard I was so excited to get a skateboard cuz I wanted a skateboard like Marty McFly and I totally overlooked the fact that we had a gravel driveway so then to practice or like even if like I'm out in the **** street like a weirdo just like trying to get it down in front of my little house. It's embarrassing. Embarrassing. Yeah I tried that",
      "start": 4551.44
    },
    {
      "text": "so then to practice or like even if like I'm out in the **** street like a weirdo just like trying to get it down in front of my little house. It's embarrassing. Embarrassing. Yeah I tried that for about a second. But skateboarding I think is one of the only things like that that has actually stuck around right? I guess mountain biking but it was never that cool. Like biking is BMXing. Like BMXing I get not mountain biking seems like BMXing's kind of cool but skateboarding has always been sort of like biking is cool. Not BMX. Yeah BMX. BMXing was a was a I mean people still do it right? Yeah it was it was the thing. Matt Hoffman was like Yeah. Dave Mer has been tied right? Isn't he My my brother Dan who does animated series uh has been skating since he was eight or nine and is really good and still skates to this day in his in his early 40s. He still has a deck in the back of his car. He still skates like to this day and like and it's like he is nasty like still. And I",
      "start": 4591.6
    },
    {
      "text": "is really good and still skates to this day in his in his early 40s. He still has a deck in the back of his car. He still skates like to this day and like and it's like he is nasty like still. And I grew up in that c like in that around that culture. It's a it's a fantastic culture. These guys like going to New York City and buying these bootleg tapes to watch like other people's perform. This is long before it was you know common to be able to buy you know real skate shapes and stuff like that. Like there was a lot of like bootleg ass **** going on out there. And I remember I remember like being kind of I was always not I always I had a skateboard in college when I would skate to class and stuff. But um I I used to ride uh girl skateboards. But um but the that I always respected the **** out of that culture because it has been a ubiquitous American thing for like you said for like 45 years. And it is pretty it is pretty neat when you think about it. Um if people ever my my",
      "start": 4630.56
    },
    {
      "text": "**** out of that culture because it has been a ubiquitous American thing for like you said for like 45 years. And it is pretty it is pretty neat when you think about it. Um if people ever my my brother lives in Philadelphia. Has lived there for over 10 years and there's a skate park in I think it's still there in Philadelphia called FDR which is like a an amazing place to skate and you see people doing all sorts of weird **** Still people riding longboards and like just **** like Yeah. grooving around and guys doing like doing like you know like guys like still stuck in the 70s and I used to just sit there and watch like I'm like like this is **** awesome. Like really really cool culture. Yeah. Um but then the the other thing and I think this is the more relevant one is I always thought that I would have to do a lot of **** that I don't want to do like write essays and like do shitty jobs that I don't want to do and like you know prove things to people and stuff.",
      "start": 4666.48
    },
    {
      "text": "always thought that I would have to do a lot of **** that I don't want to do like write essays and like do shitty jobs that I don't want to do and like you know prove things to people and stuff. And somehow I have evaded all of that. Like somehow what we do now allows me to just not deal with so much of that **** And it's crazy cuz I would have there's no way that I could have predicted that I wouldn't have to. It's not like I don't need to do there's not things that I don't want to do but even the things that I don't want to do here are still way higher than like 90% of the things people even like at their jobs and stuff. So that's that blows my mind because we are have been gotten such a really cool opportunity to do this **** And it it's it's awesome you know cuz I remember being in class um whether it's high school or college and writing papers and just being like \"Fuck I wish I could just edit a video. I wish that was my assignment was to edit a video.\" And then",
      "start": 4699.44
    },
    {
      "text": "being in class um whether it's high school or college and writing papers and just being like \"Fuck I wish I could just edit a video. I wish that was my assignment was to edit a video.\" And then when I got into the my higher like major classes in college it was like \"Your assignment is to edit a video.\" And it was like \"Fuck I wish I could just edit the video I wanted to edit. I don't want to edit this **** Like this is stupid.\" And now it's like I get to edit whatever video I want to edit you know or not edit or not. But like that's awesome. Yeah. No that's true. I mean that was that was that's something you don't that's one of the the things that we're kind of blessed with doing what we do right? We always kind of think each and each of us can honestly say that we're pretty lucky to be doing what we're doing. Uh we work really hard at it but at the same time there's a some cosmic thing happened where we all got together and this just sort of worked out which is which",
      "start": 4747.36
    },
    {
      "text": "lucky to be doing what we're doing. Uh we work really hard at it but at the same time there's a some cosmic thing happened where we all got together and this just sort of worked out which is which is awesome. We have a lot of people out there that help support us which is even **** awesomer. Um but I feel you on that because up until I don't I don't think I understood the freedom that this was going to afford us until we did it. And I was like \"Oh wait. Like we could just decide we don't want to do that thing and we don't and there's no one there's no **** up a senior vice president agenda or something like that or like I'm not calling out anyone specifically but like or or a or a CEO or some someone that owns the business that's like well this is part of the plan.\" And then all a sudden you get someone comes to you and was like I need you to do this thing that I don't even believe in but you have to do it and you have to sell it to your team. And it's like I don't",
      "start": 4783.04
    },
    {
      "text": "all of a sudden you get someone comes to you and was like I need you to do this thing that I don't even believe in but you have to do it and you have to sell it to your team. And it's like I don't want to do that either. None of us want to do any of this stuff but it's I guess it affects the bottom line. So that that is pretty that's pretty important I think. Mhm. Um yeah. Tim yes. What's your topic? So my topic uh is going to definitely be a nice end to this episode of Ridiculous Shenanigans. I want to talk about the Romeo and Juliet movie from 1996. Claire Danes. Claire Danes. Shout out to Claire Danes though. Now here's the thing about Claire Danes. I'm gonna look at the IMDb page. She great cast. Oh John Leguizamo. I can't remember who Romeo was. Leonardo DiCaprio. Was Leonardo DiCaprio. Johno. The guy from Oz who was in Everything Now. Ernie Hudson. No not Ernie Hudson. He was from Oz as well. Yeah. Look that look that up. Hurry up. Stop fucking around. But Claire Daines was",
      "start": 4821.52
    },
    {
      "text": "Johno. The guy from Oz who was in Everything Now. Ernie Hudson. No not Ernie Hudson. He was from Oz as well. Yeah. Look that look that up. Hurry up. Stop fucking around. But Claire Daines was aok. Okay. Well I mean this is like Yeah cuz this was the Here's You can look through whoever you're looking for but this was the thing. I remember when this hits this hits when I'm in high school and this is like her and I'm probably wrong but in my mind her first big movie after My So-Called Life and so my so-called life was totally when I like totally developed a crush on this woman of like she you know she's in she's in high school too right? And like this loner outcast kind of thing or whatever in love with of course the Joker Jared Leto. And uh then to see her go to this and in the time it was such a big deal that she was like this super hot thing. And then Leonardo DiCaprio of course the perfect I mean I do not believe in any couple in the history of couples more than",
      "start": 4864.0
    },
    {
      "text": "in the time it was such a big deal that she was like this super hot thing. And then Leonardo DiCaprio of course the perfect I mean I do not believe in any couple in the history of couples more than those two human beings together. I just want maybe Britney and Justin I want to give them. No. Okay. No but I mean just making sure I understand. There's a fantasy that I'm trying to uphold here. What about Kate Winslet? I don't know. That's a joke. near far wherever you are. You're shaking. I'll be uh God this movie was fuckin' good. It's so fuckin' cool. Baz Lurman. Baz Lurman did that and then he did Mulan Rouge and you were like \"What the fuck?\" Baz Lurman where you come from then. Can't remember anything else he did after that. Rouge was so dope too. Rouge is awesome. All of them had really like this is one of the things that I loved about his style or love about his style is that he really picks like you can tell he sits and listens to music and like envisions the story through",
      "start": 4905.92
    },
    {
      "text": "really like this is one of the things that I loved about his style or love about his style is that he really picks like you can tell he sits and listens to music and like envisions the story through music which is the most important which is really really awesome cuz they look they're all sort of like really long amazingly directed music videos um but with awesome fuckin' covers of the song. I'm thinking specifically more Milan Rose I think if I remember um I forget what the song was. There was a Prince in Romeo and Juliet. What was it though? I'm trying to figure out. There was a couple songs in Rome and Juliet that were I can't remember what it was when Cry the soundtrack is like all like I the Romeo and Juliet soundtrack is like an it starts with like number one crush or whatever isn't a garbage song like there's a lot five times platinum. Yeah it's like an amazing I remember getting that CD and being like and my sister actually I was in sixth grade I think when it came out or",
      "start": 4949.44
    },
    {
      "text": "a garbage song like there's a lot five times platinum. Yeah it's like an amazing I remember getting that CD and being like and my sister actually I was in sixth grade I think when it came out or seventh sixth grade I think and uh I was like wow what a fantastic this movie is so sty not knowing anything about cinema then or now I was like this movie is stylish this movie is fuckin' well told it's it's interesting it's uh it's Shakespearean but modern obviously I I I fuckin' loved that movie and I and I I I don't know if I'm just overreme remembering it or it was just because I was a kid and it was like kind of part of the zeitgeist at that time for for me and and my friends and for but I felt like that movie was kind of like a cultural phenomenon. Oh definitely. I mean no to my I looked at the I wasn't in high school yet. I was about to go to high school I guess. Um or you know whatever. But like you're at that age where like everyone like you're still in English class. They're",
      "start": 4989.36
    },
    {
      "text": "at the I wasn't in high school yet. I was about to go to high school I guess. Um or you know whatever. But like you're at that age where like everyone like you're still in English class. They're trying to make you read all this shit You have no you're like there's no relevance to you. I always felt like with this and then to have it set in you know this modern thing original script and then use guns instead of knives and all this different stuff. It was like set in LA. It was like a great idea but still this but still a Shakespearean language. Yeah. So so here's this is kind of blowing my mind. I thought people didn't like this movie. Oh a lot of people didn't like it. Paul Rudd was in this movie. Yeah. I didn't realize that either. I was thinking of Harold Perinu. Okay. You know him. He's You've seen this guy and everything. Yeah. You could have just said uh I was in a wheelchair in Yeah. Um terrifying for myself to watch. Yeah. Which is forever. I watch I watch Oz in high",
      "start": 5028.0
    },
    {
      "text": "him. He's You've seen this guy and everything. Yeah. You could have just said uh I was in a wheelchair in Yeah. Um terrifying for myself to watch. Yeah. Which is forever. I watch I watch Oz in high school and I'm like I don't know why I'm forcing myself to watch this. I can't stop. It was like Chris Maloney and JK Simmons. Every time I see those two guys I'm like \"Yeah you guys are awesome.\" But I remember when you burned a swastika into another dude's ass and you cut a guy's like neck with a razor blade that was in your one guy bit a guy's dick off and also like Oz was you know you don't know what Oz Oz was about like a super maximum prison and it was fuckin' fuckin' terrifying. Horrifying. It was horrible. Horrifying. I can't believe I watched all that shit I was like did it have anything to do with Wizard of Oz at all? They called they called the um this they were in the supermax portion of the prison. They called it Emerald. Make sure that that's what it was called I guess.",
      "start": 5061.2
    },
    {
      "text": "to do with Wizard of Oz at all? They called they called the um this they were in the supermax portion of the prison. They called it Emerald. Make sure that that's what it was called I guess. And so they called it Oz but I don't know if I think maybe it was Oswald Penitentiary. Does that sound right? I don't know. It was terrifying. Literally. Yeah. Don't watch it. 14 years. It will ruin your your your perception of JK Sims. Really? Like Yeah. The guy that played Jane Jamson in the first three um Spider-Man. Super fun guy. Now he's now he's Commissioner Gordon. He was like the leader of the the neo-Nazis the skin heads. And he was fuckin' horrible. And it was awesome man. That show is that show is fuckin' Well let me ask you this. You would know the answer to this. Was this the first like because I remember like 10 Things I Do About 10 Things I Like About What They Hate About You. The show. Yeah. Yeah. Like so I know that that was kind of like a thing that people were doing after",
      "start": 5100.56
    },
    {
      "text": "like because I remember like 10 Things I Do About 10 Things I Like About What They Hate About You. The show. Yeah. Yeah. Like so I know that that was kind of like a thing that people were doing after Julia. Was there was a was there a uh modernized tradition of retelling Shakespeare before this particular film? Not like that. Um I think you know the only other Shakespeare film that I can even remember is the classic like Franco Zepharelli Romeo and Juliet where there was nudity and I remember that was a big deal when they showed that in Clash like all right everyone relax the human body. I think we were all excited cuz he thought it was going to be her and I think it was him right but we got robbed robbed I tell you I remember around that time Mel Gibson had done a red uh a retelling of Hamlet which everyone kind of criticized a little bit because it was it was shortened. Um and I think obviously there was I think there was a good Henry VII. Um or Henry V. What was the movie that",
      "start": 5142.56
    },
    {
      "text": "Hamlet which everyone kind of criticized a little bit because it was it was shortened. Um and I think obviously there was I think there was a good Henry VII. Um or Henry V. What was the movie that that Elizabeth uh uh Diamonds Are Forever chick? Why can't Elizabeth Taylor? Elizabeth Taylor. She was in a Wasn't she in like Taming of the Shrew or something like that? Or Cleopatra for sure but I don't know if that's what you're thinking. Can you Can you Can you look that up for me? Um I remember seeing that I thought it was maybe it wasn't. Maybe it was. I don't But I think that's why this film was so it was very weirdly accepted like or very weirdly like like when when it when it hit people didn't really know what to think about it. I was like I should not like this as much as I do but I never like I am shocked that you like it cuz it is very very very style substance when I when I watched it the first time I think I remember hating it. Yeah. And then it wasn't until I watched it",
      "start": 5184.0
    },
    {
      "text": "I never like I am shocked that you like it cuz it is very very very style substance when I when I watched it the first time I think I remember hating it. Yeah. And then it wasn't until I watched it I think a little later in life and I'm like this is fuckin' genius. Actually no it wasn't until Mulan Rouge happened and then I was like ah I get it. This is just like up until that point I had just been acclimated to a specific type of film making right? Because like in the 80s there wasn't a lot of that happening right? You were either like making cool indie films or blockbusters and it was pretty much that was my childhood. I'm not saying that wasn't going on. Obviously there's a lot of great uh uh directors doing other stuff in the 80s but my exposure to it was like Predator Total Recall all that stuff. So seeing this I'm like I don't I I don't I can't deal with this. Um and granted that was mid '90s. And then I think it wasn't until Mulan Rouge that happened and I was like oh",
      "start": 5219.36
    },
    {
      "text": "all that stuff. So seeing this I'm like I don't I I don't I can't deal with this. Um and granted that was mid '90s. And then I think it wasn't until Mulan Rouge that happened and I was like oh I think I'm ready for this now. You go back and watch it you're like this is kind of genius. Yeah. But also I think I had an English lit teacher who was like that was terrible. Like the worst interpretation. I was like but I don't think you're right because this is just an interpretation of the story. And I think it's really cool cuz for a lot of people especially people my age I was 16 when the movie came out. That was the age of the characters right? And I was like this is pretty kind of cool because these are supposed to be like young teenagers in love and I'm in love and I'm kind of understanding their language a little bit more now. Like I'll be honest most of the time when I read Shakespeare I'm even probably to this day and try to read Shakespeare in fuckin' 0 years but I",
      "start": 5258.8
    },
    {
      "text": "understanding their language a little bit more now. Like I'll be honest most of the time when I read Shakespeare I'm even probably to this day and try to read Shakespeare in fuckin' 0 years but I guarantee you I I would still struggle with it. But seeing it there you at least understood the emotion of what was happening even if you couldn't quite parse together. Well there's a novelty to it. the deep meaning of everything you know like seeing the characters and having them still talk that way but having the the scenarios that they're in kind of tell the story in a different way. Like it's funny cuz it reminds me him his movies remind me a lot of Tarantino movies in the sense that the music you were what you were saying earlier the music kind of motivates the scenes a lot. So you could tell that every single song choice whether it's uh from the like the pop soundtrack stuff or the like orchestration and score to it like that it feels like they made that first and then edited",
      "start": 5295.36
    },
    {
      "text": "could tell that every single song choice whether it's uh from the like the pop soundtrack stuff or the like orchestration and score to it like that it feels like they made that first and then edited the movie on top of it. So it is like a two-hour um music video. I was reading trivia a second ago about the movie. The movie's two hours because in the the first uh it's exactly two hours because the in the intro bit they're like the hour traffic of this blah blah blah blah blah. It's like that's fuckin' awesome. There's a lot of little thoughts being put in there and stuff. But I want to give a shout out to the intro. When's the last movie? I don't know. Super long. But I I I'm renting it from iTunes because I want to I want to watch the intro cuz I remember it being the fuckin' coolest thing in the goddamn world. Let's look at this. Are we He also did Gatsby. That's how you go to jail. They can go They can look it up. This shit Oh yeah. Like what the fuck is this? You going to start",
      "start": 5329.6
    },
    {
      "text": "in the goddamn world. Let's look at this. Are we He also did Gatsby. That's how you go to jail. They can go They can look it up. This shit Oh yeah. Like what the fuck is this? You going to start the movie with this? Damn right. Yeah. Damn right. Yeah. So yeah it starts off with that like news report thing where it's her giving that opening monologue or whatever. the camera zooms into the the TV and all of a sudden just shit explodes to this like ridiculously epic music playing and then just cuts of all the different things and it's just like there's a voice over over building uh orchestra music and it just explains the story of the monulets whatever you see these shit with shotguns and stuff and it's like like long bow or whatever the fuck I'm like holy shit this is awesome and then just bam Romeo and Jo like I'm fuckin' it and then John Leguamo's there cruising around like a gangster doing his shit tango dances and shit hell Yeah. Leonardo DiCaprio my dude. Yeah. Did",
      "start": 5367.44
    },
    {
      "text": "then just bam Romeo and Jo like I'm fuckin' it and then John Leguamo's there cruising around like a gangster doing his shit tango dances and shit hell Yeah. Leonardo DiCaprio my dude. Yeah. Did you see The Great movie? Did you see The Great Gatsby? Oh yeah. What' you think of that? It was all right. It was a great style of it. But yeah. Was he fresh off was was uh was DiCaprio fresh off of Growing Pains? Was this like had he done movies? He did Gilbert and he did the Basketball Diaries as well. Oh earlier 90s. Yeah. He came out with Basketball Diaries and I was like \"Holy shit this kid this kid can act and he is finds good projects.\" And then he did this and I think this is what like he was always a kind of a heartthrob but I think this was like put the poster on the wall turn the lights off and just let things get better. He's an amazing actor. An amazing just an amazing actor. He's a great actor. He's And he's only getting better with age too. Like the glad he finally",
      "start": 5420.0
    },
    {
      "text": "the lights off and just let things get better. He's an amazing actor. An amazing just an amazing actor. He's a great actor. He's And he's only getting better with age too. Like the glad he finally didn't he finally win an Academy Award for the He was in Titanic. Who's the guy? Who's the guy that you follow me on this one just just started a sports show on HBO and he has that awesome promo where he's like I believe um in a Bill Bich what whatchamacallit like presidency I believe that every Leonardo DiCaprio movie would be just a little bit better if it was a Matt Damon movie. Is it No it's not Jim Rome. Anyway it doesn't matter. Funny line but I disagree with him via Millie. I think DiCaprio is just as good. Just as good as Matt Damon. I think he's better than Matt Damon. I love Matt Damon. Is that a question? People People think Matt Damon is better than Leonard DiCaprio. Matt is pretty fuckin' good. Matt Damon is good. Matt Damon is really good. Matt Damon's cool. He's not fuckin'",
      "start": 5464.64
    },
    {
      "text": "Is that a question? People People think Matt Damon is better than Leonardo DiCaprio. Matt is pretty fuckin' good. Matt Damon is good. Matt Damon is really good. Matt Damon's cool. He's not fuckin' Leonardo. Just make sure we're all the same echelon. I would say I would say yeah that that top top with like Clooney and all those guys like the top top top. I feel like Matt Damon is one step below your Clooney and your DiCaprios. IMO. I mean Matt Leonardo DiCaprio's god tier. Mhm. Matt Damon he's a good actor. There's a difference. Great. Great. I give him great. Okay. I was going to say what's the I can't I can never remember the guy's name. Uhhuh. plays Ernie Hudson. No Nightwing in uh in the third Batman movie. Uh oh Joseph Gordon. He's fuckin' awesome too. I love that guy. Oh yeah. He's awesome. Not that I great. We're about to see the great actor Jared Leto tonight. So I can't wait to see that. That's actually the thing I'm looking forward to most. I want to see that and I want to",
      "start": 5501.68
    },
    {
      "text": "awesome. Not that I great. We're about to see the great actor Jared Leto tonight. So I can't wait to see that. That's actually the thing I'm looking forward to most. I want to see that and I want to see Batman swim. And if I can see those two things I'm done. You want to see Batman swim? By the time you see this video that video our reaction to Suicide Squad's up. So make sure you go check that on. Maybe one of us is dead by now. A quick prediction. No cuz it's so old by the name. A good point right? This is going to happen. If you didn't know ladies and gentlemen this has been the GameOverGreggy show each and every week. Four sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that head over to patreon.com/kindfunny where you can toss us a few bucks and get each and every episode early along with a bunch of exclusive things and perks and goodies and tears and whatever. If you got no bucks to toss though",
      "start": 5543.52
    },
    {
      "text": "where you can toss us a few bucks and get each and every episode early along with a bunch of exclusive things and perks and goodies and tears and whatever. If you got no bucks to toss though head over to youtube.com/kindafoney where we post the show topic by topic day by day until it goes up as one big video or MP3 around the world. Until next time. Look at that ice cream scope. Huh? Jesus Christ. Throw some weight up. I'm not doing I totally could. I could flip this whole table if I wanted to. It's an IKEA dare. It's only Until next time it's been a pleasure to serve you.",
      "start": 5579.4
    }
  ]
}
