{
    "id": 3710,
    "video_id": "bzKrtC3dV9E",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Mike Howard",
        "Mike Doherty"
    ],
    "title": "Fortnite Passes 1 Billion Dollars (w/ Mike and Mike) - Kinda Funny Games Daily 07.19.18",
    "description": "Visit http://omahasteaks.com and type KFGAMES in the search bar to get this Grill-Ready collection for $39.99.\n\nMike and Mike unpack fortnite making a billion dollars in microtransaction dollars, the culling 2 shutting down and guerrilla games expands its studio!\n\n00:02:14 - Housekeeping\n1. Greg Hosts the Marvel Games Hall H Panel (1p.m. PT)\nFor the First Time Ever Greg is working the BIGGEST Hall at Comic-Con. Go check it out and see him try not to screw it up!\n Kinda Funny Hosts Rocket League’s 3rd Birthday Party (3 to 9p.m. PT) - Come on over to PetCo Park where Greg, Nick, and Tim are hosting Rocket League’s third birthday. The event is free, and Kinda Funny Commissioner (and WWE Superstar) Xavier Woods will be there. What more could you want?! - Friday July 20\n3. Kinda Funny’s Streaming with SkyBound (10:30a.m. to Noon PT)-The boys are heading over to Skybound’s SDCC site, bringing a Nintendo Switch, and partying with you. Come watch them podcast, play games, and bring on all sorts of special guests. This is one you won’t want to miss!\nGreg’s Hosting The Pool Panic World Championships (10p.m.PT) -Pool Panic’s a WEIRD game, so it required a WEIRD host. Enter our Greggy. Friday night, Greg’s hosting the world championships at the Adult Swim Skate Park, and you’re invited!\nKinda Funny Meet & Greet! (3p.m. PT) - Greg and Andrea are taking over the Skybound space for a meet and greet to end all meet and greets! Tickets are required!\nThe Roper Report   -\n00:05:09 - Fortnite Has Made over 1 billion in micro transactions ( NICK SANTANGELO, IGN)\n00:12:35 - The Culling 2 Tanked at launch and is pulling the game from all online shops. ( Owen S. Good, IGN)\n00:17:50 - Madden 19 has its cover star! (Alex Gilyadov, IGN)\n00:20:18 - Bethesda Is less likely to let an outside developer develop a Fallout game. (Eddie Makuch gamespot)\n00:23:25 - Guerrila Games is expanding and moving to a five floor office. (Sammy Barker, Push Square)\n00:29:55 - Out today\n Reader mail   -\n00:35:35 - Top games that you guys are looking forward to that are coming out soon - Christian (@CTH73 on Twitter!)\n00:37:47 - Have either of you had the time to see Nathan Fillion in the new Uncharted fam film - Alex Van Aken\n00:39:06 - What was the first game that that hooked you in because of its multiplayer - Erick\n00:40:48 - What are your thoughts on the new Crash level, Future Tense, that was added to the N. Sane Trilogy recently? - KBABZ\n00:42:28 - Finding time to game - Eric R. Miller AKA NHDrumline17\n00:45:47 - Squad Up: Gasmcookie (Epic) - Fortnite\n00:46:30 - One of them rotatin’ segments - Minute with Mikey!\n00:47:40 - You‘re Wrong\nTomorrow’s host: US! Mike and Mike in the moring.\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1532033093,
    "duration": 3184,
    "transcript_chunks": [
        {
            "text": "[Music] what is going on and welcome to kind of funny games daily for Thursday July 19th 2018 I'm one of your hosts no bike mic and I am joined by my fellow Greg Miller industries employee Mikey double D Doherty how you doing today Mikey what's going on players I'm good I'm doing good thank you we are here back from our Lake Tahoe vacation I hear tell me all about your exam with the lake Italian stallion oh and did you have some folks of some fun maybe some boats beers babes the whole beach the whole shebang the whole shebang man you look good you look tan and I love whenever everybody comes up to Lake hangs out with me those best friends you guys are truly amazing yeah you too good for me now you're too famous to come up come on up you're too good to me well of course you're probably saying to yourself where is the kind of funny crew who are these guys well guess what all of the kind of funny crew is down in beautiful San Diego at San Diego comic-con hosting a variety of panels events",
            "start": 1.22
        },
        {
            "text": "to yourself where is the kind of funny crew who are these guys well guess what all of the kind of funny crew is down in beautiful San Diego at San Diego comic-con hosting a variety of panels events meet and greets with you the kind of funny best friends so guess what today were in control so if you didn't know ladies and gentlemen this is the kind of funny games daily each and every weekday on a variety of platforms we run you through the nerdy video game news you need to know about if you like that be part of the show that kind of funny calm /k FDG with your questions concerns comments bad PSN names and everything else under the video games Sun then tuning to twitch.tv slash kind of funny games live to watch us record it and if you're watching live you got a special job to do go to kind of funny comm slash you're wrong to help us set the record straight with anything we screw up while on the job for everyone watching later on youtube.com so that's kind of funny games and listening on",
            "start": 53.94
        },
        {
            "text": "funny comm slash you're wrong to help us set the record straight with anything we screw up while on the job for everyone watching later on youtube.com so that's kind of funny games and listening on podcast services around the globe Mikey let's get into housekeeping right now we got a lot of cool things to talk about I'm sorry I don't know who thought this was a good idea on the show we are having too much fun we're in control and let's tell you where those guys are down in San Diego so for housekeeping news Thursday July 19th number one on the docket the biggest one you need to know about Greg Miller is hosting the Marvel games Hall H panel at 1:00 p.m. West Coast best coach Pacific Standard Time for the first time ever Greg is hosting the biggest hall at comic-con go check it out and see him try not to screw it up like we're trying out the scores really bad number two kind of funny host rocket leagues third birthday party 3 p.m. to 9 p.m. two nights come over to Petco Park where Greg",
            "start": 102.9
        },
        {
            "text": "him try not to screw it up like we're trying out the scores really bad number two kind of funny host rocket leagues third birthday party 3 p.m. to 9 p.m. two nights come over to Petco Park where Greg Nick Tim are hosting rocket leagues 3rd birthday party the event is free I said free folks so make sure you come down there they're kind of funny commish WWE superstar Xavier woods will be there what more could you want Mikey not much now I'm like I mean in the Commish got rocket League kicking back kinda funny best friends oh come on they're pro-choice eSports let's go alright let's move on to Friday July 20th number three kind of funny is streaming with Skybound 10:30 a.m. to noon pacific time go check that out the boys are heading over to sky bounce SDCC site to bring you the Nintendo switch and party with you so make sure you watch them podcast play games and all sorts of fun things with all sorts of special guests you don't want to miss out on that one and then going in with Friday",
            "start": 155.32
        },
        {
            "text": "and party with you so make sure you watch them podcast play games and all sorts of fun things with all sorts of special guests you don't want to miss out on that one and then going in with Friday number for Greg's hosting the pool Panik World Championship at 10 p.m. West Coast best Coast time Greg is gonna be down with the Adult Swim team at the Adult Swim skate park and you're invited so don't miss out on that awesome event don't you miss it Adult Swim's Day you skate part wears cool Greg when you need them you're natural man alright and then we're gonna round it out right now on Saturday July 21st number 5 kind of funny meet-and-greet 3 p.m. Pacific time Greg and Ray are taking over the sky bounce space for a meet and greet to end all meet and greet tickets are required so go over there get some tickets meet up with the kind of funny crew and of course the kind of funny best friends alright it looks like you can't go gonna take it you can't come but you know what just see them at",
            "start": 212.53
        },
        {
            "text": "get some tickets meet up with the kind of funny crew and of course the kind of funny best friends alright it looks like you can't go gonna take it you can't come but you know what just see them at the door you tell them I sent you they'll let you in they won't let you in okay this show is brought to you by our sponsor but you know what we'll get into that later today now it's time to begin the show with what is and forever will be the Roper report some news today on the rubble report we have five items baker's dozen I will cut you my great job team number one for tonight has made over 1 billion dollars in micro transactions this is coming you from IGN Nick Santa legal oh I'm sorry I've been really good a new super data report via game industry dot biz shows that fortnight has made more than 1 billion dollars off in-game purchases alone the report also claimed that fortnight is only growing in popularity overall with an upward trend since October 2017 they saw a huge spike in February",
            "start": 263.62
        },
        {
            "text": "1 billion dollars off in-game purchases alone the report also claimed that fortnight is only growing in popularity overall with an upward trend since October 2017 they saw a huge spike in February and it only started slowing in May while still continuing upwards the slowed made growth was still good enough for a whopping 380 318 million dollars in revenue epic games may soon have even more opportunities to take money off in game fortnight purchases - as for tonight may soon be getting vehicle skins and players are likely about to get the opportunity to gift in-game items for one another plus epic will soon start genuine fortnight revenue outside the game entirely with Funko's fortnight merchandise go get your fortnight pop goes on right now Mikey fortnight big success 1 billion with a be my friend what you think about that in the same when like do you think this game is ever gonna slow down it's just kids it seems like it keeps growing the more platforms that get on the more people",
            "start": 324.94
        },
        {
            "text": "my friend what you think about that in the same when like do you think this game is ever gonna slow down it's just kids it seems like it keeps growing the more platforms that get on the more people keep playing I'm seeing people who play video games playing this game now but it's become like like it's almost like the Pokemon go oh like like console gaming like it's ridiculous fire it is the zeitgeist right now for our era Mikey it was perfectly released as free-to-play it had the beautiful cartoony animations pub she had that more down to earth bloody violent gameplay so this appealed to all audiences and Epic Games has done a phenomenal job coming out free-to-play constantly updating the game and offering these in-app purchases I mean you and I both know snow bike Mike likes to spend that cash on video games okay and any time that you can give me some awesome skins cool pickaxes guess what I'm doing I'm buying them Mikey want to give you a quick one really quick just so you know out",
            "start": 382.27
        },
        {
            "text": "cash on video games okay and any time that you can give me some awesome skins cool pickaxes guess what I'm doing I'm buying them Mikey want to give you a quick one really quick just so you know out there fortnight was released July 25th 2017 we are yet to surpass one year of fortnight and this game is the biggest game on the planet from streamers to buying things on the revenue it's crazy right now and one thing that I took away of course shout out to the golf carts I mean that is a great addition to the game I cannot wait to put that kind of funny blue smiley face epic if you hear me put that on my golf cart so I can represent the kind of funny crew and of course it's a gift in-game items to my friends Mikey that's a big passion of mine is to be able to give to my friends I want to be able to give out skins buy things for fellow players because currently I got the skin I love I got the fish in the fish tank astronaut suit and I look like a mastermind villain and I'm not switching",
            "start": 427.86
        },
        {
            "text": "able to give out skins buy things for fellow players because currently I got the skin I love I got the fish in the fish tank astronaut suit and I look like a mastermind villain and I'm not switching folks so if epic wants my money I got a gift it to somebody else that is like they are finding every way possible for you to give them their money and I think that's what they're doing so smartly that one they're doing across all platforms they're trying to get the the all platform play going on which is not looking so hot right now but Macedo it's a phenomenon and it's ridiculous how many people I've seen just get pulled in like I got at first as I know I'm not the online player like I don't have enough time to do this and then it got released on switch and then that's what got me in incredible and that's the joke you know why I keep doing it the game is a success if my boy kind of funny Kevin in the backgrounds playing it non-stop right keV all right well we got a viewer question about",
            "start": 474.69
        },
        {
            "text": "and that's the joke you know why I keep doing it the game is a success if my boy kind of funny Kevin in the backgrounds playing it non-stop right keV all right well we got a viewer question about this topic from 8-bit dad's shout out to KB Thank You the question out there epoch is rumored to be adding another way to spend money in for tonight through item gifting with all the money they are making it's only a matter of time before other Studios start to follow suit what Triple A franchise do you guys think would be would be able to succeed in the free-to-play model I think this markets about to get flooded I think the way we've seen this time and time again with like these trends everyone floods the market and then so many of these games go out to die it was announced like today I believe her yesterday with Halo not having the Halo infinite not having the battle royale mode I think Halo would have been a phenomenal battle royale like game but you see more people like Call of Duty like",
            "start": 517.26
        },
        {
            "text": "her yesterday with Halo not having the Halo infinite not having the battle royale mode I think Halo would have been a phenomenal battle royale like game but you see more people like Call of Duty like trying to get into this and I don't know if that's necessarily gonna work and I'm we're gonna see more of these Studios kind of flooding in trying to get this cash grab that's going on trying to get that billion but fortnight god and I just don't I a lot of people are gonna fail like I feel like the markets to flutter as it is just between pub G and fortnight like is there really room it's incredible Mike I think you know the barrier to entry is zero you put your game on free to play anybody can download it from kids momma's daddy's doctors dog walkers it doesn't matter who you are what walk of life you are and I think they do a great job with that I mean I think of multiple titles on my xbox that I can play Neverwinter it's free-to-play you jump in and guess what the first thing you're",
            "start": 568.12
        },
        {
            "text": "of life you are and I think they do a great job with that I mean I think of multiple titles on my xbox that I can play Neverwinter it's free-to-play you jump in and guess what the first thing you're hit with is hey you know you might have got this for free but maybe you should buy some stuff and I think that is the next move but I think first we go to games and services my big hunch right now our halo infinite might become a games as service get ready for that Madden like the boys have always talked about that could be turning into a games of service with live roster updates and once you move into that then I think we start to push the free-to-play with more in-app purchases I like the games of services idea I like that you you pay this upfront and then like even if it's a hundred dollars you're paying more than a regular triple-a game and then you you you get updates just like fortnight's doing and then you you have that little initial cash flow you like you get like some skins at",
            "start": 611.14
        },
        {
            "text": "you're paying more than a regular triple-a game and then you you you get updates just like fortnight's doing and then you you have that little initial cash flow you like you get like some skins at the beginning or something like cash like spendin like game I'll there's something that some people have always said that like if you're not charging for your game like like how much do you believe in it and like that's why I like to see it's like I would I would gladly pay $130 for fortnight and then just have that be the games of service there's no fortnight to this is just fortnight and it's just gonna live and breathe and you can micro transaction you can get the skins but again with the my contracts and transactions you're gonna see a lot more scheme your developers or publishers try it try to get that money and do the unsavory business business tactics to try to get everyone's money to play to win things like that so it's gonna be interesting to see how this plays out but what triple-a",
            "start": 652.81
        },
        {
            "text": "to get that money and do the unsavory business business tactics to try to get everyone's money to play to win things like that so it's gonna be interesting to see how this plays out but what triple-a do you think would make a good a good battle royale game Oh Battle Royale yeah yeah I mean we're gonna see it with Call of Duty battlefield 5 and Halen would have been incredible yes I believe something we're gonna dial it back with the players base of 60 to 80 and I think you're gonna see some incredible battle Royales but we're not see the issue with that is can you compete with the two juggernaut set is fortnight's that is pub G that would be the question all duties have a single player let's see what they're banking on and then I don't know if they have the legs to run their race we'll find out but that's a perfect segue because fortnight is the model but guess what we got some sad Battle Royale news and of course somebody's switching over to free to play so Story number 2 the culling",
            "start": 690.84
        },
        {
            "text": "out but that's a perfect segue because fortnight is the model but guess what we got some sad Battle Royale news and of course somebody's switching over to free to play so Story number 2 the culling to tanked at launch it is pulling the game from all online shops this is from IGN oh and s good has written this article so make sure to go drop him a like and read that article please the culling 2 is the latest game to get on the batter Oriole hype train but developer Xavier picked a rather bad time to launch fortnight Battle Royale fish season began today and perhaps you heard about that player unknowns battlegrounds maker pub G Corp also just reopened its test servers with a new update for Xbox one versions it's great either way there's tons of battle royale action on any platform so that may be why the calling to has just one player at this moment recording on this charts immediately this Thursday morning on East Coast not exactly prime time but the games peek over the last 24 hours is",
            "start": 734.31
        },
        {
            "text": "be why the calling to has just one player at this moment recording on this charts immediately this Thursday morning on East Coast not exactly prime time but the games peek over the last 24 hours is 13 and the all-time high was 249 right at its debut on June 10th on launch day PC gamers shot this bonkers video of one of its writers winning a game before he before his parachute even opened the culling 2 for $19.99 is also available on Xbox and PlayStation it's the sequel to the culling which launched in early access in 2016 and then fully backed in October that game was built as a Hunger Games inspired multiplayer first-person shooter evolving 16 players armed with high-powered rifles and brutal melee weapons the latest one is supposed to fit 50 players against one another with bigger focus on ranged weapons well as of today that has now been pulled off of the stores they're offering refunds we watched a heartbreaking developer story out there on the youtubes about how sad they were how",
            "start": 784.98
        },
        {
            "text": "on ranged weapons well as of today that has now been pulled off of the stores they're offering refunds we watched a heartbreaking developer story out there on the youtubes about how sad they were how this was the misstep to go to this and I mean if we rewind the tape back to kind of funny games daily with Andrea and Greg this was a day before I haven't written down the day was announced July 10th the one day before the release those two looked at each other had no idea what was going on and here we are four days later a week later and it is over Mikey what do you thought said that's not good like I this is probably worst case scenario for any developer making a multiplayer game like I think that's like probably the biggest fear of any developer is just having no one player game like that's the goal is again everyone and the video that we saw he was just broken and like you feel so bad for him and especially when he opens up with like this isn't the game you guys wanted and this isn't",
            "start": 842.4
        },
        {
            "text": "the goal is again everyone and the video that we saw he was just broken and like you feel so bad for him and especially when he opens up with like this isn't the game you guys wanted and this isn't a game that we want it's just heartbreaking I mean two players one player Oh like and then what the peak in the last where is it 200 yeah the the 200 3249 like that's for a launch of a multiplayer game that's $20 pretty entry-level price this is what I'm talking about mine the markets too flooded too yeah calling you mention oh gee there's oh gee whatever it was I don't want to say it's a cash grab but it feels awful like a cash grab like just oh here it is here's going to like put put it out 50 players like let's do this and like I said for a night pub gee so dominant right now especially when pub she comes over to PlayStation I think like it's gonna be very hard very hard again in this market Mikey it's an interesting one and you know it almost ties back to topic number one you brought up",
            "start": 889.02
        },
        {
            "text": "pub she comes over to PlayStation I think like it's gonna be very hard very hard again in this market Mikey it's an interesting one and you know it almost ties back to topic number one you brought up games his services should the culling just have continued as calling day one which I did not add into the story just so you all know they will be pulling back the calling to but they're going to re-release the culling day one edition it's gonna be free to play for everybody they're gonna go back to their roots try to read real line read of eyes a plan for the original culling and go off of the community feedback but even going back to free to play the games is service with the waters being so oversaturated like you said how do you break through in this market to try to even compete with fortnight pub G and then on the bottom realms you got realm royale you got other titles coming out islands of the nine and can you really make this a profitable business no yeah you can I feel like it's",
            "start": 944.22
        },
        {
            "text": "pub G and then on the bottom realms you got realm royale you got other titles coming out islands of the nine and can you really make this a profitable business no yeah you can I feel like it's too flat at this point I think you need to go out and try to find more creative ways the next big thing you I think that's what developers should start moving on this okay this wave we've missed this wave let's find the next wave like let's let's go out let's innovate let's actually bring something new to the table that is a phenomenon like this battle royale and this just happen it's heartbreaking heartbreaking the diary was very sad go watch it go of course check out the IGN article we wish them all the best I hope they realign and re get back to what they want to do and it is one of the og battle Royales we'll see what happens with calling day 1 and what they go with from there I don't know if they can do it like I like going back like that I just I I just feel sad for them like it's yeah",
            "start": 989.04
        },
        {
            "text": "Royales we'll see what happens with calling day 1 and what they go with from there I don't know if they can do it like I like going back like that I just I I just feel sad for them like it's yeah alright well guess what topic number three Story number three we need a little 15 seconds of sports don't run the graphic cuz I got this bump off I've got my bow bow Madden 19 has its cover star Alex get it off from IGN reports EA has unveiled Madden 19 s NFL cover star Pittsburgh Steelers wide receiver Antonio Brown considered one of the greatest wide receivers of all time Brown graces the cover with a wide smile he also is the cover athlete for Madden NFL overdrive the mobile game there's a lot of milestones athletes dream of is the quote and after being inducted into the Madden 99 club earlier this year and now appearing on the cover of this year's games it's clear that the business is not just booming but it's also among the all-time greatest with these honors Brown said Madden NFL 19",
            "start": 1032.78
        },
        {
            "text": "this year and now appearing on the cover of this year's games it's clear that the business is not just booming but it's also among the all-time greatest with these honors Brown said Madden NFL 19 will release August 10th on Xbox one ps4 and PC while overdrive will be available on August 15th on iOS and Android Mikey tell me about I'm a happy guy I'm a fan as of Cincinnati Bengals fan the Madden curse I love it I just know it makes me happy it's a good cover he looks good he looks great very handsome man he's got some boy he's got a smile for miles and you may have seen him on Dancing with the Stars this guy's got the energy the fun the million-dollar smile he's what you want to see on the cover I threw this in here just because that B is the the Madden curse I'm just maybe then maybe the Bengals could do the Hail Mary and kind of kind of squeeze into the playoffs we're gonna cross we'll see I do want to bring up when you talk about the Manning curse guess who was the cover athlete for",
            "start": 1086.84
        },
        {
            "text": "could do the Hail Mary and kind of kind of squeeze into the playoffs we're gonna cross we'll see I do want to bring up when you talk about the Manning curse guess who was the cover athlete for 2018 Tom Brady the goat edition well guess what the goat did not come through and last year's Super Bowl so the Madden curse might be real folks and I do want to touch on one more thing Antonio Brown being inducted into the 99 club with the 99 overall rating guess how many players before that have ever been inducted into that club many Mike six total athletes have ever been 99 Antonio Brown will join the fold with that what a great story there congratulations to him and also shout-out to EA I'm personally liking the minimalistic covers that they have for their cover athletes right now of course we've seen NHL 19 with PK subhan from the NASA predators we got MBA Live 19 with my boy trust the process Joell embiid of the 76ers with that flat red behind him FIFA's got a beautiful blue I gotta say",
            "start": 1140.45
        },
        {
            "text": "seen NHL 19 with PK subhan from the NASA predators we got MBA Live 19 with my boy trust the process Joell embiid of the 76ers with that flat red behind him FIFA's got a beautiful blue I gotta say they're doing a great job with this I'm very excited good here it's good to end man good time to be alive right now I love games well guess what that takes over my news segment it's your turn to take over the news Mike Mike doing change it let's do it alright here we go so Bethesda is less likely to let an outside developer develop a Fallout game 2010 fault new Vegas was developed by Obsidian Entertainment not by Bethesda Game Studios itself the game was generally well liked and people praised it for its big detailed open worlds quest filled with quests filled with personality while obsidian has said it would like to make another fall game someday it sounds like it won't happen but does the boss todd howard said in a new interview that the company would rather develop big games internally he",
            "start": 1187.01
        },
        {
            "text": "said it would like to make another fall game someday it sounds like it won't happen but does the boss todd howard said in a new interview that the company would rather develop big games internally he told the Guardian that he isn't ready to say definitely that a Fallout game from outside the studio won't ever happen but don't count on it his quote is I wouldn't never say I would I wouldn't I wouldn't say never Howard said but now that our company is so big it's always better to keep stuff internal it becomes less likely likely but I could never say never I thought of sitting guys did a great fabulous job Bethesda was a more internal development headcount than it did years ago when I went to obsidian to make a fall game so given the size and the stature of the fall brand it makes sense that Bethesda would want to develop new entries in the house yeah so that I mean next games fall 67 what do you think this I mean this sounds exactly right on the course for what he's talking about the",
            "start": 1234.53
        },
        {
            "text": "Bethesda would want to develop new entries in the house yeah so that I mean next games fall 67 what do you think this I mean this sounds exactly right on the course for what he's talking about the studio has grown exponentially they have proven the concept they know what they can do they know what they're looking for they don't really need to reach out for outside help but I will say Fallout New Vegas was my favorite entry of the fallouts thus far I thought of city and did an amazing job and now some of you may say Mike it was a good game it was bland out in the desert it had some flashy lights but in reality they added some new gunplay to it they added some they had some great quest storylines that probably would have just been addressed anyways by the internal team from Bethesda which now will happen from now on so sad to hear he said never say never so there's still a chance but I do believe with this big of a studio this big of a title we will not see fallout fall in the hands of",
            "start": 1281.78
        },
        {
            "text": "will happen from now on so sad to hear he said never say never so there's still a chance but I do believe with this big of a studio this big of a title we will not see fallout fall in the hands of anybody else from now on yeah it's interesting move because again they're not going for the cash grab they're going for quality they want that quality control just like Nintendo did just like Sony did just an internally develop all internal it's a good and a bad thing because you're not giving the the outside developer its shot its chance which it's a little sad that again like they want the quality control they want to be able to hands-on and like it said in the story they've expanded so it's gonna be interesting to see like what the next volume is if they'd like do a spin-off outside the 76 true Mikey to be honest with you when we read this I thought fallout 76 would have probably been from somebody on the outside with how fast that turnaround time was from 4 to 76 now and with the kind of",
            "start": 1328.76
        },
        {
            "text": "Mikey to be honest with you when we read this I thought fallout 76 would have probably been from somebody on the outside with how fast that turnaround time was from 4 to 76 now and with the kind of genre it's going for not the true fallout style but more of a little multiplayer survival as they talked about you can play at many different ways but when you hear that you see the turn over time that probably would indicate to me maybe we've reached out but like todd has said this team has grown a lot they know what they can do and it's easy from there absolutely well speaking of growing developers guerrilla games is expanding and moving to a five-floor office grow games has always been on Sony's most one of the Sony's most important developers with the release of horizon zero dawn its stocks have risen dramatically the studio is now one of the most recognized games game companies in the world working on one of the most promising new intellectual properties the problem it needs more space",
            "start": 1373.07
        },
        {
            "text": "have risen dramatically the studio is now one of the most recognized games game companies in the world working on one of the most promising new intellectual properties the problem it needs more space that's why beginning next year it will be moving to a new 5 floor office the former telegraph complex it is currently being reanimated and packs a whopping seven thousand three hundred square meters of floor space more than enough to house the four hundred employees the Amsterdam developer eventually hopes that tracked it currently has 250 workers after a horizon zero dawn was accelerating the best talents are coming to us the last month we have already hired nine new people but we also need more space for our sound and motion tracking Studios many managing director Hermann hosts old Dutch website hit Patrol we have worked on the horizon for six point five years which is exceptional but we want to release games in two to three years both new titles are games based on existing titles holes",
            "start": 1418.7
        },
        {
            "text": "hit Patrol we have worked on the horizon for six point five years which is exceptional but we want to release games in two to three years both new titles are games based on existing titles holes explain the guerrilla games has been looking to expand for a while but there was a concern that they may have to leave Amsterdam Amsterdam in order to do so my fear was always that we would have to leave the city by Amsterdam is part of our identity he explained this is where we came into existence and this is where we have always been and our ambition to be the best game company in the world the new office will be equipped with statues the Studios game characters while the entire floor a top floor will be used as a communal space we're turning this thing into a palace he concluded what a great story I mean a lot of big takeaways from that one that really resonates home with me is staying in Amsterdam you heard it it's part of the culture it's their identity that's where they want to be and to",
            "start": 1466.61
        },
        {
            "text": "I mean a lot of big takeaways from that one that really resonates home with me is staying in Amsterdam you heard it it's part of the culture it's their identity that's where they want to be and to be able to make that work in such a city where probably space is limited like we see here in San Francisco to be able to find that larger space to be able to create that room for more employees I think that's so cool and to keep it in the city that you love how awesome is that yeah I mean speaking of like production time and like turning around games we actually have a listener question from Nate McKinney Nate says hot damn cheeks and snow bike Mike you've sexy Devils first thing begin to begin with Congrats hi I'm happy for both of you now on to the news grill game is nearly doubling its staff in getting a new office while Harmon saying he hopes to shorten production time to three years presumably they are preparing to ramp up production on horizon 2 could this mean we see horizon 2 sooner",
            "start": 1513.74
        },
        {
            "text": "in getting a new office while Harmon saying he hopes to shorten production time to three years presumably they are preparing to ramp up production on horizon 2 could this mean we see horizon 2 sooner than we think a launch or near the title of PS 5 perhaps and what do you guys think or what do you guys want to see in horizon sequel thanks and now have a great show Nate Thank You Nate for the message I mean I'll kick it off really quick what do I want to for more horizon more robot dinosaurs of course more a lorry because I love that redheaded beauty so good and I gotta say man how impressive to just like bethesda almost we're growing the studio we're gonna go through those growing pains but now we've identified how to create these games and to see them go from the original og titles of killing what what it was it again once I'm kill zone yet pills them from chi-town now over to horizon zero dawn to say hey we know we're gonna make a sequel we're gonna make new games and we're gonna",
            "start": 1561.86
        },
        {
            "text": "killing what what it was it again once I'm kill zone yet pills them from chi-town now over to horizon zero dawn to say hey we know we're gonna make a sequel we're gonna make new games and we're gonna set the timeline of two to three years PlayStation this is a big win right now and this is one of those was it announced at e3 it's been kind of quiet he goes on this speech right here and this now gets you amped up for having you PlayStation for being a PlayStation person right now well this is them becoming a naughty dog like this is them ramping up and being that big thing that Sony has that that ace the ace that they have in their pocket the be able to say like hey like we have the best developers in the game right now now that speaking a naughty dog that makes me think like they split teams like do they or are they gonna keep it with the three year cycle can you do three year cycle with splitting up 400 and people or more I mean five stories is there's a lot of space so they could",
            "start": 1608.15
        },
        {
            "text": "teams like do they or are they gonna keep it with the three year cycle can you do three year cycle with splitting up 400 and people or more I mean five stories is there's a lot of space so they could even expand toward that so like what do you think they rotate it horizon bring back a kill zone maybe in a new IP but to two teams at once or what well what are you thinking here man you know I'm not on the game development side so I don't know what it truly takes but I would say if they found the rhythm to have that many employees be able to crush out a big triple a title in that time frame and just focus on one that's all great but like you said if we have that many employees they talked about adding another motion capture space so that really leads to maybe there is two teams maybe we just needed more space but man two teams working on two separate titles now you kind of double the years there because you have two teams and they're switching off and on kind of like a Call of Duty",
            "start": 1651.8
        },
        {
            "text": "just needed more space but man two teams working on two separate titles now you kind of double the years there because you have two teams and they're switching off and on kind of like a Call of Duty situation for me I think that really goes to so probably going to be a two team situation here but that's what I'm thinking and seeing how Naughty Dog did it even though it really did exhaust them like that it was still quality control it's not like Hall Duty where oh you have an offer you young you're you have an off year um and I I'm gonna be interested like are they gonna try to do Killzone again later they can try reveal or they just done with it are they gonna try to do horizon new IP like it's exciting it's exciting that we have a times where first party studio might actually be pumping out to games in a very short span of each other it's gonna be so incredible and more horizon zero dawn to come come on let's have some fun Mikey really quick before we leave this Nate asked what do",
            "start": 1699.2
        },
        {
            "text": "out to games in a very short span of each other it's gonna be so incredible and more horizon zero dawn to come come on let's have some fun Mikey really quick before we leave this Nate asked what do you want to see from her eyes and I stole that from me tell me what do you want to see from the new horizon I want to see more horizon like I want to see where that story picks off I want to see a bigger world I want to see more I guess the big thing is the side quests I want to see the side quests just go in little Morse's like character driven a little more story driven not just something like you get from open-world games where it's like and like okay like go get my piece of ham over here from this dog and you have to go and you have to do pointless I questioned by grind I rather shorten like that how many cyclists there are and actually have them matter and actually have them you want to do them instead of just like I don't want to go find your [ __ ] dog like leave me alone god damn it",
            "start": 1737.46
        },
        {
            "text": "that how many cyclists there are and actually have them matter and actually have them you want to do them instead of just like I don't want to go find your [ __ ] dog like leave me alone god damn it I love it well Mikey horizon zero dawn 2 is gonna be quite some time away the new IP from gorilla is gonna be quite some time away but if I wanted to know what was coming now where would I go the official list of upcoming software across each and every platform as listed by the kind of funny games daily show host each and every weekday well I'm gonna read them yeah yeah I like it there we go we got it we're getting our motors cooking first thing first thing releases for Thursday July 19th are as follows chicken assassin reloaded for the switch shitty connection for the switch gotcha Racing seconds ps4 guts and glory ps4 Xbox one and switch frost for switch league bowling for switch lost phone stories switch nidhogg to Xbox one no reload heroes switch pool panic switch scenario characters",
            "start": 1778.89
        },
        {
            "text": "ps4 guts and glory ps4 Xbox one and switch frost for switch league bowling for switch lost phone stories switch nidhogg to Xbox one no reload heroes switch pool panic switch scenario characters pick cross switch shootout switch stars ship revenge operation take back earth switch tan Zia switch now Mike I want you to sell me on chicken assassin reloaded what is this lanky double D Doherty and everybody out there in the press pool have I ever told you guys about chicken assassin reloaded well guess what folks jump into a dog-eat-dog world a chicken cluck chicken world here in this upcoming battle royale title you we got egg launchers we got hand shooters out there and you will be battling another hundred chickens out in the streets of chicken topia one chicken will survive and they will move on to be the greatest chicken known to man that was your snow bike Mike selling point that is not the game Kevin has now brought up for God I got close but it was not in but imagination like that",
            "start": 1839.57
        },
        {
            "text": "on to be the greatest chicken known to man that was your snow bike Mike selling point that is not the game Kevin has now brought up for God I got close but it was not in but imagination like that getting out there he's got samurai swords he's got guns he's got teammates I mean Mikey guess what might be required playing for the day today let's do it chicken assassin I think you will be seeing Mikey double D Doherty it's no bike Mike playing chicken assassin reloaded tonight language Christ it's not a battle royale game I'll give you a full review of what our thoughts are Mike what that is the games that are coming out from the kind of funny show host let's go on over to an ad no to the deal of the day no ad no okay wait at first I think I got a deal is I sorry you're right you're a deal of the days are you ready cuz I got some great deals all right go for it all right from my all my xbox people xbox ultimate games sale is now live save up to 60% off over more than 700 games oh boy and",
            "start": 1909.23
        },
        {
            "text": "the days are you ready cuz I got some great deals all right go for it all right from my all my xbox people xbox ultimate games sale is now live save up to 60% off over more than 700 games oh boy and guess what on top of that if you don't got Xbox Live Gold guess what they're selling xbox three month the gold membership for $24.99 you probably save yourself snow Mike Mike that's the same deal as it always is well here's the catch they're gonna give you $10 of Xbox currency on top of that deal so guess what for all you fortnight players out there you can buy yourself a battle pass with ten dollars for free talking goddamn it you love it kid all right that is your deals of the day that we found it's time to jump to our show add and sponsor for the day that's right sheiks junior and snow bike Mike it's time for a word from our sponsor Omaha Steaks remember when we talked about Omaha Steaks over there on that F Father's Day I'm gonna assume that like there's no bike Mike's like yeah of",
            "start": 1970.31
        },
        {
            "text": "Mike it's time for a word from our sponsor Omaha Steaks remember when we talked about Omaha Steaks over there on that F Father's Day I'm gonna assume that like there's no bike Mike's like yeah of course - do you do of course listening flash viewer I got it from my dad my dad loved him so much that he now sends me Omaha Steaks for every holiday and I just send them back for every holiday and we're in this oh my hostage time loop plus when we grill here I usually use the old mistakes we get through these deals and they're amazing we love Omaha Steaks now I've got a great summer grill deal for you ladies and gentlemen right now Omaha Steaks is giving a limited time offer to our listeners for the summer go to Omaha Steaks dot-com type KF games in the search bar and you can get this Omaha Steaks grill ready collection for just $39.99 that's 80% off here's what you'll get to tender filet mignons two beefy top sirloins four juicy boneless pork chops four boneless chicken breast for all beef",
            "start": 2022.66
        },
        {
            "text": "grill ready collection for just $39.99 that's 80% off here's what you'll get to tender filet mignons two beefy top sirloins four juicy boneless pork chops four boneless chicken breast for all beef Omaha steak burgers for traditional cabassa sausages award-winning gourmet jumbo Franks one Omaha Steaks seasoning packet and four made from scratch caramel apple part lists for free again this limited-time package for just $39.99 when you go to Omaha Steaks comm and type KF games in the search bar and add their grill ready collection to your cart don't wait you want to get this offer soon before the end of summer so go to Omaha Steaks com type KF since our grab your friends fire up the grill cheeks Mike back to you all right come on Kevin hey thanks for that awesome and read and shucks Mikey double D door to you and I might be grilling up some steaks next time you're up in Lake Tahoe ha steaks thanks so much for that Greg Miller it's time to jump into our mailbag riddle mail mails here I",
            "start": 2059.08
        },
        {
            "text": "double D door to you and I might be grilling up some steaks next time you're up in Lake Tahoe ha steaks thanks so much for that Greg Miller it's time to jump into our mailbag riddle mail mails here I got you before that Kevin pulled up the ad and I thought that was me like I thought Greg was me I was like am I the only one who could see snow like Mike right up visible well our first question comes from Christian at see th 73 on Twitter hey cheeks Mike Congrats again on hosting just interested in both of your top games that you're looking forward to that is coming out soon personally I am way hype for spider-man ps4 hope to see you more on more KF content hash tag Greg Miller industry's night for the great question right there of course what are you hype for what is your Gatorade high moment drop the bugs in chat what is my Gatorade get a hype moment of course it's got to be spider-man we're gonna have so much fun with that title and then we're gonna move right on over to Red Dead",
            "start": 2110.33
        },
        {
            "text": "moment drop the bugs in chat what is my Gatorade get a hype moment of course it's got to be spider-man we're gonna have so much fun with that title and then we're gonna move right on over to Red Dead Redemption now you and I didn't report on it today but Grand Theft Auto online is receiving another online multiplayer update and man if they treat the love that care they do with Red Dead the same way that they did with Grand Theft Auto I mean man you got a whopping title on your hands so get ready for that one of course fallout 76 I'm excited to jump into the wasteland with all my best friends out there those are what I'm hyped for Mike okay about you I spider-man that's a [ __ ] big one I cannot wait I we it's just south so little of the superhero like actually good superhero games I am very excited to jump into that world and get that story and like just riding off the hype of like infinity war and just just the hype of superheroes right now I'm actually excited to be able to interact",
            "start": 2157.52
        },
        {
            "text": "excited to jump into that world and get that story and like just riding off the hype of like infinity war and just just the hype of superheroes right now I'm actually excited to be able to interact with the world and play actually a really good spider-man story again The Last of Us well I mean it it's not this year but I actually think it could be sooner especially with that proposed leaked date which again create some issues it's definitely is but I'm excited like Last of Us is just it's my game I just I'm excited to see where they go from there but I mean just little things Spyro that's another big oh god I forgot about spiral spiral I am gonna play a platinum all three I I just can't wait for spyro spyro is one of my childhood games I love it a little less than crash but like it's it's I'm came stumbling with words right now I love me some Spyro I love him Mikey that sounds great well I'll take the next reader question go for this is coming from my guy from Boulder Colorado Alex",
            "start": 2206.57
        },
        {
            "text": "I'm came stumbling with words right now I love me some Spyro I love him Mikey that sounds great well I'll take the next reader question go for this is coming from my guy from Boulder Colorado Alex Van Aken what AB Alex Congrats on hosting a show this week boys have either of you had time to see the Nathan Fillion in the Uncharted fan film did you enjoy it were you disappointed it wasn't something more personally I loved it I thought it was [ __ ] dope I want Nathan Fillion as Nathan Drake I know he's old I know he's oh that's that that's thing by I think he played it so well I think that is the perfect casting and I if we ever get this much like we will never get an uncharted movie I feel like but III think that's perfect that was just enough for me to like scratch that itch of a cinematic uncharted world it was incredible and he plays that role so great you know you might be saying he's too old well guess what Nathan Fillion here's your call out from the kind of funny vids crew and",
            "start": 2255.77
        },
        {
            "text": "uncharted world it was incredible and he plays that role so great you know you might be saying he's too old well guess what Nathan Fillion here's your call out from the kind of funny vids crew and your boy snow bike Mike I need you to drop everything you're doing Sony Naughty Dog get on the phone right now we need to drop everything we need to book him for the next five years just shoot a hundred of these movies right here right now don't do anything don't even look at that cheeseburger just start shooting Uncharted fan films cuz man that was incredible I didn't like the cast 'silly casting aside I thought I was following him personally really but hey okay to each his own I thought that was pretty cool what a great time and that was awesome to watch I was about it next question comes from Erik what's for tonight taking over the multiplayer space the way it is what was the first game that hooked you in because of its multiplayer keep up the great work guys that's an easy one Mikey",
            "start": 2302.48
        },
        {
            "text": "from Erik what's for tonight taking over the multiplayer space the way it is what was the first game that hooked you in because of its multiplayer keep up the great work guys that's an easy one Mikey double D Doherty let me take you back to a time in 2004 when me and my middle school buddies were about to graduate and would come home every single day to a little game called halo - man my buddy AJ lived right across the street from the school he had an older brother that was four years older than us and we would pack AJ tesslar arrows house with about twenty kids ranging from the age of 13 to 18 years old and we would play Halo 2 multiplayer until the Sun went down and our parents had to pick us up and say hey did you do any homework and I said no but I got to level 22 today on online big team skirmish matchmaking and my mom hail it but gosh darn it halo 2 multiplayer changed my life Mikey what kind of multiplayer games were talking halos big one halo the LAN party the you know the",
            "start": 2342.65
        },
        {
            "text": "team skirmish matchmaking and my mom hail it but gosh darn it halo 2 multiplayer changed my life Mikey what kind of multiplayer games were talking halos big one halo the LAN party the you know the sleepover where everyone comes over everyone hooks up their Xbox you're playing some halo that 4:54 captured the flag another big one was modern warfare 2 with rust 1 beyond 1v1 on rest come at me bro that's that's that was the one that was the one and then yeah from there it's just I've been very selective on like what multiplayer games just because I don't have that time to invest but yeah that that would that would be my multiplayer I love it my King Laurent should give me the next one well I got a little mixed up here so let me give you one from kebabs what are your thoughts on the new crash level future tense that was added to the insane trilogy recently it felt like a lot like crash 1 level to me which was great because those had the most involving obstacles and going up the skyscraper",
            "start": 2391.0
        },
        {
            "text": "level future tense that was added to the insane trilogy recently it felt like a lot like crash 1 level to me which was great because those had the most involving obstacles and going up the skyscraper was a wonderful idea as well what would you want out of a brand-new game built in that engine an effective crash for that follows the classic conventions or a more contemporary platformer with more open level open-world level designs Mikey you're my crash expert Jim Gettys isn't here still a about me it I loved it first of all that that level was so I loved that it was original it felt better than like any of the crash levels just because again they've taken things that they've learned we're in a different era in 2018 in video games and platformers it made me itch for a new Crash Bandicoot game and which I think we were gonna get I think they'd be dumb not to do another one and hopefully that CGI remaster because you know best kart racer ever made man I love that I gotta say I have not",
            "start": 2448.57
        },
        {
            "text": "game and which I think we were gonna get I think they'd be dumb not to do another one and hopefully that CGI remaster because you know best kart racer ever made man I love that I gotta say I have not played the new level but from the remastered trilogy I have to say it is incredible to play on and now it's on all your devices Xbox and switch now there's no reason to play it and I think the well well-deserved fan service that it's gotten I think we're gonna see more crap oh no no no doubt I mean number one on the charts for months and months and months when it came out and then on top of that it's like I want unfortunately I wish there was a crash to level that they did is DLC but we get what we can and can't beg and choose you know I love it well Mikey let's both choose one more because I got one for you and then I'll let you choose one all right let's go this is coming from Eric R Miller aka MH drumline 17 my question is pretty simple but I figured I use this chance with my boys",
            "start": 2498.64
        },
        {
            "text": "I got one for you and then I'll let you choose one all right let's go this is coming from Eric R Miller aka MH drumline 17 my question is pretty simple but I figured I use this chance with my boys cheeks junior and snow bike mic to get some different answers how do you to find time to game in your lives it feels like Greg Tim Andrea etc are able to fit in a lot more gaming time due to the nature of their jobs but for those of us who have jobs outside of the industry it can be hard to juggle relationships work social activities life chores and the rest how do you end when do you find time to squeeze in some gaming around your hectic schedules it's hard it's it's really difficult I think that's the the balance I really struggle with my in my life between like podcasting like actually interacting with people and going out and doing things and being with friends and then work full-time job and then on top of that full-time student on top of that trying to make YouTube content and then to",
            "start": 2543.82
        },
        {
            "text": "with people and going out and doing things and being with friends and then work full-time job and then on top of that full-time student on top of that trying to make YouTube content and then to make you create you to content you have to stay up-to-date on the games and it's just a circle that like never ends youtube.com 4 / tip do gaming ya know so it's hard it's hard with it not being content creation being the full-time gig especially with like I said full-time job school it's the switch has really helped being able to play like you know some fortnight or you know some Donkey Kong tropical freeze on my breaks at UH in between classes or that work on break or lunch at work it's difficult I really I have a hard time with that most the time I'll put in a podcast then I'll play a game I wish I know is blasphemy so many people but that's really the only way I can try to fit it all in because I don't have a job where I could just listen to podcasts all they would like I used to have so is",
            "start": 2594.04
        },
        {
            "text": "I know is blasphemy so many people but that's really the only way I can try to fit it all in because I don't have a job where I could just listen to podcasts all they would like I used to have so is yeah it's hard what about you Mike I think you hit it on the head just like anybody in life it is difficult to find that balance currently in my current life state I am blessed I'm single what up ladies out there I only have two beautiful pug dogs so they need minor attention their food driven so if I give them a whole lot of Turkey guess what they pass right out and I do work a fifty hour week plus job so I'm always busy at work but I come home I find the time this is my passion I love playing video games I love seeing new video games and no matter what I'm driven to go do that so I'm on there five nights a week live streaming to you live on twitch.tv slash no bike mic where I'm giving you that high-energy fun and that's spicy so thankfully I'm able to play a lot of games throughout that",
            "start": 2644.02
        },
        {
            "text": "five nights a week live streaming to you live on twitch.tv slash no bike mic where I'm giving you that high-energy fun and that's spicy so thankfully I'm able to play a lot of games throughout that I still try to find time to get away from the screen go out there every Thursday night of course I have my men's league basketball team me and the team snow bike Mike and friends suit up boot up lace it up and hit the hardwood and then every Tuesday night I'm down a beautiful Zephyr Cove Nevada Beach I'm out there playing softball with my co-ed softball team rocket League vodka so I try to find that balance but video games truly are my passion so I'm playing it a whole lot I don't know how you balance it because you're always climbing mountains and [ __ ] like I don't know what's going on like you're just always on Instagram you're in some beautiful Lake area when the woods in the middle of nowhere it's an it's impressive that's actually the the one I was gonna end on so high low that's a",
            "start": 2685.51
        },
        {
            "text": "you're just always on Instagram you're in some beautiful Lake area when the woods in the middle of nowhere it's an it's impressive that's actually the the one I was gonna end on so high low that's a good segue to squat up so our squad up for the week is gams cookie he's looking for people to play fort night with AD gam gasps Oh gasps um yes so that's GA sm c oo k IE on epic if you wanna [ __ ] [ __ ] up go [ __ ] [ __ ] up with gas and cookie I'm gonna add gasm cookie right now after the show and we're gonna go F some s up right now I can dig it there Mikey I want to go on over into one of our rotating segments the guys and the gals of the kind of funny games daily crew are not here so we get to choose the rotating segment and I think you got something special for me so my segment take it away this is a minute with Mikey this is a minute I got I'm angry I mean tell you about it and I'm gonna tell you about it in under a minute so here we go yeah we got time I really just look at this",
            "start": 2731.08
        },
        {
            "text": "away this is a minute with Mikey this is a minute I got I'm angry I mean tell you about it and I'm gonna tell you about it in under a minute so here we go yeah we got time I really just look at this time alright [ __ ] stop with the high-fives there's too many high fives in the world I'm gonna say it I know some popular opinion but I don't need to be high five anytime anybody does anything I don't need a a will tell me a high five and two minutes like a good job is good so high five hey it's just too many high fives we need to cut out with the high-fives and the handshakes just enough with the hands why do we need to interact with each other with the hands there's too many hands there's too many high fives it's just it's it's nuff I've had enough with it as you can see by my facial expressions that minute was Mike just blew me away I mean I am appalled you are you had the mic bud slapping get in the game motivate you each and every day stew Mikey okay well no more high fives arm I",
            "start": 2781.13
        },
        {
            "text": "that minute was Mike just blew me away I mean I am appalled you are you had the mic bud slapping get in the game motivate you each and every day stew Mikey okay well no more high fives arm I don't even look at them I'm not giving him I don't you [ __ ] come up to me on the street with a high five well I appreciate that rotating sing when I hope you had some fun that is your minute with Mike where he rages out about high fives now it's time to get into your wrong we're gonna dive in and see who's gonna correct us for all of everybody else watching and listening on youtube.com slash kind of funny games and podcast services around the globe Mikey we ready to find out what we screwed up god [ __ ] hopeless I'll tell you what Mikey I mean we were tasked with an awesome opportunity thank you to the kind of funny crew thank you so much Miller for believing in us allowing us the community one of you to come out here and put on this show remember it's gonna be a whole lot of fun there's so",
            "start": 2824.15
        },
        {
            "text": "to the kind of funny crew thank you so much Miller for believing in us allowing us the community one of you to come out here and put on this show remember it's gonna be a whole lot of fun there's so many awesome talented can any members out there so and then the first so there will be more to come but let's find out what we screwed up on today's show legs Ignacio Rojas can I get a time out for Ignacio he says it's KF GD not KF DG Ignacio you're timed out let's keep it man right there room in thank you so much silk I appreciate that he says zeiger said snow bike Mike you said for tonight came out on July 25th 2017 technically the game was released in early access last year on that date people often forget the game is actually still in beta and has yet to actually released what's up guys I appreciate that uh yes you know take for tat whatever I don't know I'm out button let's keep it going BG 2580 thank you for that Lord of pone says it's fallout 76 not 67 but he will accept 69 instead",
            "start": 2873.59
        },
        {
            "text": "appreciate that uh yes you know take for tat whatever I don't know I'm out button let's keep it going BG 2580 thank you for that Lord of pone says it's fallout 76 not 67 but he will accept 69 instead alright 69 69 got a deal out there Lord of poen also came back one more time it says guerilla games has had two teams in the past they had a team working on horizon when the others were making kills true Killzone Shadowfall so I forgot about that I'm gonna give you a potato chip ATO on that one as well because you know we don't know about that yeah but thank you for the past on that appreciate that let's see capitalist Pig this year on this one so let's see what these gots he says fallout 76 dev time the time between fallout 4 and 76 falls in tune with Bethesda's normal pace of a three to four years years per game this is not a quick turnaround for this time but falls within their average range oblivion 2006 fallout 3 2008 Skyrim 2011 fallout 4 2015 fallout 76 2018 capitalist pig thank",
            "start": 2926.18
        },
        {
            "text": "years years per game this is not a quick turnaround for this time but falls within their average range oblivion 2006 fallout 3 2008 Skyrim 2011 fallout 4 2015 fallout 76 2018 capitalist pig thank you for always getting my back on that China capitalist pig Anakin's snow bike Mike stated there had only been $6.99 over all Madame players in history he meant to say there was there are six other ninety nine overall Madden players those are the New England Patriots Tom Brady Pittsburgh Steelers Antonio Brown can't read the rest of it but thank you so much on that Anakin's and guess what our final one we did a great job I thought one of our favorites out there Nitro rifle the leader of the nitro Renee Foley says here's one for you Greg is the fake champ yeah great Nick scarpino wouldn't Welch on a bet Greg Miller Welch is on bets thank you I know Nick's tarp you know what it held up that bet nick is the true champ guys Greg is definitely the champ but now you're talking my pizza yeah that's",
            "start": 2990.2
        },
        {
            "text": "a bet Greg Miller Welch is on bets thank you I know Nick's tarp you know what it held up that bet nick is the true champ guys Greg is definitely the champ but now you're talking my pizza yeah that's why I'm saying motion wouldn't [ __ ] me like that you guys are the best thank you for your minute of my two minutes of Mike now let's to guess what your host for tomorrow for Friday July 20th guess what you get snow bike Mike and Mikey double D Doherty I'm so sorry jr. back in the building we hope we did a good job for you please let us know in the questions comments below in that section we want to know how we did we're gonna bring the hype bring the fire to you tomorrow Mikey I am so proud of you you thank you so much for letting me join I really enjoyed you on this episode like work you'd like people find you oh great question well guess what you can find me at snow bike mic on all social media accounts Twitter and Instagram I'm giving you those fires stories that you want to see you",
            "start": 3051.82
        },
        {
            "text": "like people find you oh great question well guess what you can find me at snow bike mic on all social media accounts Twitter and Instagram I'm giving you those fires stories that you want to see you think Nick at nights good well guess what go check out snow bike Mike all the time I couldn't come up with a good one twitch.tv slash snow bike Mike thank you so much for the plug Mikey plug it no problem you can follow me at cheeks underscore jr. on Twitter you can follow my channel over at CTG vids on twitter you can follow me at youtube.com on four slash game or chipped tooth gaming youtube.com forward slash chip do gaming where I do podcast completely consensual it's gaming central Let's Plays review all that good stuff so a new episode coming on Monday so go check it out hit that subscribe button Mike it's been a pleasure",
            "start": 3111.04
        }
    ]
}