{
    "id": 941,
    "video_id": "9IfXbWtmuuw",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Alfredo Diaz",
        "Colin Moriarty",
        "Nathan Vella"
    ],
    "title": "Gears 4! Microsoft Press Conference Reactions! - Kinda Funny Gamescast (E3 2015)",
    "description": "All the biggest Xbox news of E3 2015! Gears 4, Halo 5, Tomb Raider, Minecraft, Fallout 4!",
    "published_at": 1434401501,
    "duration": 2409,
    "transcript_chunks": [
        {
            "text": "what's up guys welcome to the first ever Xbox E3 2015 press conference post-conference Kinda Funny Gamescast, damn all the above. That was good, you did it really well. Thank you guys, thank you. Now we're live, we're live right now on Twitch to all you beautiful people. You guys are just watching home later on VOD, thank you so much. As always, I'm Tim Gettys. I'm joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi, hello. And to my right, or I guess your your left, we got my boy Alfredo. Still your right, even though it's their left. You're right, you're right. Yeah, so man, how excited are you guys? All right, let's before we get into this, let's do a little rundown of everything that just happened, right? We got Halo 5: Guardians, we got some single player stuff, we saw the multiplayer Warzone mode. We got a new game called ReCore, Keiji Inafune's new game from the, a little help from the Metroid Prime creators. Yeah, Armature, Xbox exclusive. All right, we got announcement of Xbox 360",
            "start": 0.31
        },
        {
            "text": "Warzone mode. We got a new game called ReCore, Keiji Inafune's new game from the, a little help from the Metroid Prime creators. Yeah, Armature, Xbox exclusive. All right, we got announcement of Xbox 360 backwards compatibility, that was big. A new Xbox Elite Wireless Controller that's essentially going to put all third-party controllers out of business, bye-bye Scuf. Todd Howard came out, Fallout 4, talked a little bit more about it. We got a new single player demo showing off the world, all this stuff announced that you can play mods from PC on the Xbox One. That's weird and big, weird but a very big deal. If you buy Fallout 4, you get Xbox, or you get a Fallout 3 for free. EA talk, Peter Moore came out, talked a little bit about EA Access including Titanfall this week. Dragon Age: Inquisition coming later. Xbox Live Gold members get it free this week. If you want a demo of that, you want to check it out, see if it's for you. Plants vs. Zombies: Garden Warfare 2 announced. There was a trailer, there was a little Top",
            "start": 48.32
        },
        {
            "text": "members get it free this week. If you want a demo of that, you want to check it out, see if it's for you. Plants vs. Zombies: Garden Warfare 2 announced. There was a trailer, there was a little Top Gun music. It was, there was a lot of Top Gun music. Yes, yes, yes. We got a Forza 6, September 15th. Dark Souls III, early 2016, not an exclusive, half a point for me. The Division, we saw a little bit more of that again. Alfredo, I don't think blinked that entire time. Rainbow Six Siege comes free with Vegas 1 and gigantic Xbox One exclusive. It's another one of those games, looks like every other game. Um, ID@Xbox indie Montage, we saw a bunch of stuff. There's a game called Cuphead. Oh my God, I've been calling, that's the, it's rare that I have a Greg was right. I've been on Cuphead's jock since I saw the first trailer forever ago. That thing looks good, it looks excellent. There's a whole bunch of games, there was some Western game that looked awesome. Below, obviously amazing. Then Steve Gaynor came",
            "start": 90.84
        },
        {
            "text": "the first trailer forever ago. That thing looks good, it looks excellent. There's a whole bunch of games, there was some Western game that looked awesome. Below, obviously amazing. Then Steve Gaynor came out, talked about Tacoma. And let's talk about that on Xbox One. Gaynor, after everything I've done, I made Gone Home, and this is how you're going to repay me? I don't even get trophies in Gone Home, and now I'm going to play the other goddamn Tacoma game, not get any trophies in that too. You have to get achievements in it. Whole bunch more indie games. Made Gone Home. We got Beyond Eyes, we got this. Then we got Xbox Game Preview. They talked about it's like Steam Early Access, we know all about that stuff. Brought up DayZ, which led to Dean Hall coming out announcing his new game, Ion, exclusive to the Xbox and PC. We got a really badass Rise of the Tomb Raider demo, right? That was awesome. Yeah, I know you're trying to get through this quickly, but I want to say that was awesome. Mhm. Ice Climbers Rebooted essentially",
            "start": 135.0
        },
        {
            "text": "got a really badass Rise of the Tomb Raider demo, right? That was awesome. Yeah, I know you're trying to get through this quickly, but I want to say that was awesome. Mhm. Ice Climbers Rebooted essentially is what it was, and it was **** great. November 10th is when that game was coming out. Then Rare Replay, it's pretty much Rare collection, 30 Games, 30 bucks, only on Xbox One, August 4th. 10G, uh, 10K Gamerscore though. Oh man, you get all those, you get all those achievements. Hell no, I'm not. New exclusive Rare game, it's a pirate game called Sea of Thieves. It looked kind of cool, I was into that. Fable Legends this holiday. Valve, I mean, then they talked about this whole Valve VR thing. They got a whole bunch of VR stuff coming. Oculus partnership they mentioned. And then they went a little more in detail on the Microsoft HoloLens, did some Minecraft integration. That was awesome, super crazy. It was one of those things where it's like, oh, I don't want to hear about, oh wait, this is **** cool. Yeah, this is, it's, I, I",
            "start": 171.36
        },
        {
            "text": "HoloLens did some Minecraft integration. That was awesome, super crazy. It was one of those things where it's like, oh, I don't want to hear about, oh wait, this is **** cool. Yeah, this is, it's, I, I tweeted that this is the, we are living in the beginning of a sci-fi movie. Yeah, when sitting just staring at it like a weirdo. Gears of War: Ultimate Edition, August 5th. It's the first game, we all knew about that. Beta out later today, so get excited about that. And then finally, Gears 4. There's no of War, it's just Gears 4. Gears, they're pull fast, could see much. Yeah, it was very dark, but it was pretty, it looked, yeah, yeah. Gears 5. So there you go guys, that was it. What are your thoughts? They did a really nice job. What really, what really continues to resonate with me, um, because Greg and I are, you know, unapologetically, you know, more PlayStation-centric than than any, you know, than anything else, is that they just keep bringing out exclusives over and over again. And as Sony's studios lay largely dormant and",
            "start": 212.4
        },
        {
            "text": "you know, more PlayStation-centric than than any, you know, than anything else, is that they just keep bringing out exclusives over and over again. And as Sony's studios lay largely dormant, and I don't mean literally dormant, I mean we just don't know what the **** they're doing. Sleeping Giants. Uh, they look like the, the tables are kind of turning in the sense that Xbox has all these exclusives. And remember, as Phil Spencer said at the end, and as we said in our pre-show, three massive exclusive games for Xbox One weren't even at the show. Uh, Crackdown, uh, Quantum Break, and uh, what was it? Uh, what's the dragon game? The uh, Scalebound. Scalebound. Yeah, so that's impressive to me that they have this catalog of games, can keep rolling out games. I mean, they have so many games, they put something like an exclusive at the top. Yeah, you know, um, so I was, I was very impressed. I'm always kind of impressed with Xbox's, um, you know, Xbox's approach at their press conferences. Sony will see what they can do and and",
            "start": 258.88
        },
        {
            "text": "at the top. Yeah, you know, um, so I was, I was very impressed. I'm always kind of impressed with Xbox's, um, you know, Xbox's approach at their press conferences. Sony will see what they can do and and the game they bring because uh, you know, obviously they're going to go last tonight. And they had, they're kind of falling behind in the exclusive category pretty significantly. I mean, they're falling behind in a lot of the announcement categories, it feels like, right? The fact that they come out and they're like, everything's backwards compatible now. I, I liked how they presented that, right? Feels like we didn't know if we'd be able to do it, but we figured out a way to do it. Here's how we're going to do it. And then yeah, they had, you know, a smattering of games. And like, I, there were a lot of people during the indie presentation saying like, oh, Indie Box, you know, making fun of Indie Station, which was PlayStation's name for so long. Now it is getting to be not a level playing field, but it's getting there. But",
            "start": 303.48
        },
        {
            "text": "indie presentation saying like, oh, Indie Box, you know, making fun of Indie Station, which was PlayStation's name for so long. Now it is getting to be not a level playing field, but it's getting there. But there was this smattering where there was like some things I was really into, some things I wasn't. But I, you know, the next announcement was always super exciting of what's going to come. I think that's the thing is like, this was a damn good press conference. Like, it's one of those things where it was entertaining for everybody. And and even if you weren't in love with every single thing, it all happens so fast. Like, they didn't focus on one thing for too long. Like, you hate it when there's those demos that last like 30 minutes. It was quick. EA part, they came in, they're like, here it is, bye. You know, it's like, thank you guys. You, they're finally getting it. And I love that that this was for everyone. Biggest moment, undeniably, when Henry Ford III came out. That was weird. I was like, thank God I now know",
            "start": 338.2
        },
        {
            "text": "like, thank you guys. You, they're finally getting it. And I love that that this was for everyone. Biggest moment, undeniably, when Henry Ford III came out. That was weird. I was like, thank God I now know there's a Henry Ford III. Well, what was so weird for me with with Henry Ford III and just that whole thing is I always think about these guys that, you know, or or or women that come to these shows, they're for like 10 seconds. Henry Ford III had to like get into a plane in Detroit, come to Los Angeles, be on the stage 15 seconds. Xbox do a lot of cool things with video games, and Ford's happy to be a part of it. And then and then they have to go. Now I see some people in the comments saying that they, their conference was terrible or that they didn't like the, I don't, I honestly, we might have watched a different conference than you guys if you really feel that way, because I was impressed with it. It's not that everything was good, it's not that everything was hit. I don't care about, you know, this Fable",
            "start": 369.36
        },
        {
            "text": "a different conference than you guys if you really feel that way, because I was impressed with it. It's not that everything was good, it's not that everything was hit. I don't care about, you know, this Fable MMO and all these kinds of things. I actually think, I actually think Rare is all dead with with the announcement of that game. I have no idea what the **** that was. So most ambitious game ever. So there are certain, but there, so there are certain things that that don't look interesting. The Gears, uh, looks awesome. ReCore, anything that Inafune touches is going to turn to gold, great. We know that. So ReCore, Colin, how'd that make you feel? It made me feel great. I mean, Armature, you know, uh, is a studio that is made up of old, you know, retro guys. And them, you know, getting together with Inafune is pretty awesome. And an unusual kind of mixture. You know, Comcept is is Inafune's kind of production house in in Japan. And then they work with a bunch of different developers like Any Arts for instance, with Mighty No. 9, um, or",
            "start": 408.96
        },
        {
            "text": "an unusual kind of mixture. You know, Comcept is is Inafune's kind of production house in in Japan. And they work with a bunch of different developers like Any Arts for instance, with Mighty No. 9, um, or with, you know, Japan Studio for Soul Sacrifice. And now they're working with Armature, um, for this game, ReCore. And I think it looks pretty cool. What's funny to me about it is that no matter how much Inafune tries, he just cannot get away from robots. He can only get away from robots for a little bit, and then he real robot and get back to robots. So it's, I thought that that was pretty funny. Um, Xbox One exclusive, unusual. I think that's a huge boon for Microsoft to get someone like Inafune who definitely has more Japanese bonafides, and that would suggest that he would be a more PlayStation-centric kind of person. Obviously, Mighty No. 9 is very agnostic in terms of platforms, but Soul Sacrifice certainly wasn't. So, um, it was pretty cool to to to see that. I really do believe that the biggest",
            "start": 444.68
        },
        {
            "text": "kind of person. Obviously, Mighty No. 9 is very agnostic in terms of platforms, but Soul Sacrifice certainly wasn't. So, um, it was pretty cool to to to see that. I really do believe that the biggest announcement was the backwards compatibility. And, um, you can't overlook, I took some notes because you can't really overlook, first of all, how they took shots directly at Sony, which is unusual for Microsoft to do. And, uh, that they're basically saying this is important as Sony kind of isolates PS1 Classics to Vita and PSP and PS3. No PS Classics on Vita, but you can play them on PS3. But you can play them on PS4 if you want to use PlayStation Now, you got to pay for it. Even if you own Catherine or something like that, and you want to stream it, you have to pay $9.99 a month. They're like, a **** all of that. Put it in, put the disc in, and you own it. And your digital games already going to start popping up in your library. And what what it suggests to me is that, you know, Sony is not going to be ready for",
            "start": 477.4
        },
        {
            "text": "put it in, put the disc in, and you own it. And your digital games already going to start popping up in your library. And what what it suggests to me is that, you know, Sony is not going to be ready for this. Sony is all in, they bought Gaikai for $400 million. They're not, they're going to be streaming. But I think that they might have taken the losing path, and now they're going to eat it on that. Meanwhile, I'm curious if, you know, they figured out, and they said it very openly in the Microsoft conference, we don't, we didn't know if we can do this. Yeah. And I'm sure Sony feels the same way. But now I feel it's imperative for Sony to figure out how to do it. Because opening up the PS3 library and the PS1 Classics and the PS2 Classics and all these things, PSP Minis, whatever it is, on PlayStation 4 is important. Yeah. And if people own those games already, they're doing it with their first party games like Journey or Flower, but they're not doing it with everything. And it sucks that you have to buy those games",
            "start": 519.52
        },
        {
            "text": "yeah, and if people own those games already, they're doing it with their first party games like Journey or Flower, but they're not doing it with everything. And it sucks that you have to buy those games again. And I'm sorry to interrupt, but I just want to say, we won't charge you to play the games you already own, was the exact quote. That was a direct shot at some talk **** get shot. So here the question though, if they, if Sony goes and flips the switch and like, okay, sorry, we'll figure this out or whatever, are they going to be doing the same thing we faulted Microsoft for? Remember how we were like, when Microsoft backtracked on everything, they had no vision, this, that, and the other. If they come out and like, all right, PlayStation Now, sorry, that wasn't exactly what it needed to be. Like, we're going to can that and give you backwards compatibility. Is that, are we going to be saying the same thing about Sony that they didn't believe in this? Sure. I mean, it's, it's an interesting point. I'm curious what",
            "start": 552.44
        },
        {
            "text": "can that and give you backwards compatibility. Is that, are we going to be saying the same thing about Sony that they didn't believe in this? Sure. I mean, it's, it's an interesting point. I'm curious what these guys think of it. But I think that when they backed up on Kinect and they back up on on their DRM and all that kind of stuff, you have to kind of separate into two things. Was it the right decision for the product? And was it the right decision to to be backtracking on its own? Sure. In other words, it was the right move for Microsoft to do that, probably commercially, even though I was curious about how it was all going to turn out for them if they stuck it to that road. So it's an interesting question. I don't think Sony really can go back on it at least immediately, because they made such a huge capital investment in PlayStation Now, even though it doesn't seem like anyone really cares about it, right? Um, and it, you know, streaming is obviously always going to have an inherent, uh, issue in terms",
            "start": 586.0
        },
        {
            "text": "capital investment in PlayStation Now, even though it doesn't seem like anyone really cares about it, right? Um, and it, you know, streaming is obviously always going to have an inherent, uh, issue in terms of latency, no matter how fast or how good your connection is. So this is an awesome solution. And that's what it is. It's not, it's a solution. You put your disc in, you download the game from Xbox Live. Obviously that, you know, they're going to have 100 games by holiday. They're going to roll them out slowly, not everything's going to be available. But that step's necessary. I think that's very important. Like for me, you're right, like they're not just going to backtrack on Now. Like I'd be shocked if they did that. I would love it though, because I don't really care like for the **** they'd get for backtracking. As a consumer, that's what I want. I want to just be able to to play my old games whenever I want, however I want, my Vita on my PS3, wherever the hell. And it's just like, it's frustrating that I can't do",
            "start": 618.44
        },
        {
            "text": "as a consumer, that's what I want. I want to just be able to to play my old games whenever I want, however I want, my Vita on my PS3, wherever the hell. And it's just like, it's frustrating that I can't do that wherever the hell I am. I signed up for PS Now and I was playing Uncharted, and Uncharted 1 was almost unbearable because there like major dead zones and like a little bit of like latency and lag and stuff like that. Real quick, Alfredo, I'm sorry, I know you have very successful Twitch stream of your own here. If you're going to say that, you have to say, uh, but Uncharted was unbearable. Thank you, Greg, for that. No problem. Letting everybody know. Thank you so much for that. I just, Sony has a huge problem, and it's it's that none of their devices speak to each other properly. Yeah, that that should be their, that should be their most, that should be like their gemstone, right? That you have this PlayStation ecosystem where everything talks and communicates. And Microsoft's coming for that, you know what I",
            "start": 652.8
        },
        {
            "text": "that should be their most, that should be like their gemstone, right? That you have this PlayStation ecosystem where everything talks and communicates. And Microsoft's coming for that, you know what I mean? With the Windows 10. And like, that's the thing is like, you know, Colin predicted that they were going to talk about Windows 10. I, they did, they mentioned a lot, they kept saying it, but like, they didn't really kind of go into too much of details and stuff. But I don't even think it was necessary. Just the one thing I loved about this press conference was almost every five minutes you heard, Xbox One World Premiere Exclusive. Jesus Christ, it was cheesy, but I think that's important. They got to drive that point home. Yeah, I feel like they did drive it home, and it was almost a joke. And I, but I feel that's a good thing that they did to make sure that everybody knows like, we got a lot of **** exclusives. You know, this is what Alfredo wanted, that's what I wanted. And they also, I don't think, I just think",
            "start": 695.12
        },
        {
            "text": "a good thing that they did to make sure that everybody knows like, we got a lot of **** exclusives. You know, this is what Alfredo wanted, that's what I wanted. And they also, I don't think, I just think overall it was well-rounded, right? Like you had indie games, you had the backwards compatibility, you even had like the Xbox kind of like Steam Early Access type stuff too, which I think going be cool initiatives they announced on top of cool games. And then of course they had like, they catered towards the hardcore audience, right? We had our Halo, we had Gears. There was an, um, an Elite Controller, which right, that was out of left field, awesome. You are the most elite player I know. Did that get you going? Uh, I was, no, I was way too excited. Yeah, no, I mean, it's you guys, because it's way too expensive to buy like something like a Scuf. It's like $ $300 to like customize its third party. But something like this, it's like once it gets in people's hands, they'll understand like why it's nice to have extra like",
            "start": 731.2
        },
        {
            "text": "something like a Scuf. It's like $ $300 to like customize its third party. But something like this, it's like once it gets in people's hands, they'll understand like why it's nice to have extra like remappable buttons. I'll have to take my fingers off like the analog stick, et cetera. Um, um, the the reason I was saying this, I have a couple things to say. First of all, about the exclusives, obviously they have to make it clear. And it's harder for them to make it clear with their exclusives because they've had a more choppy history with their exclusives in terms of them eventually coming over or being on PC. Sony's exclusives are more obvious because they own these studios and you know, they're known quantities. No games are not going to be available on that's obvious. But what the one thing that really bothered me with the exclusive announcements was the **** that they keep doing with Tomb Raider. They will not speak plainly about that game. You know, they say something like, exclusive Xbox One holiday. And then it's",
            "start": 770.44
        },
        {
            "text": "the exclusive announcements was the **** that they keep doing with Tomb Raider. They will not speak plainly about that game. You know, they say something like, exclusive Xbox One holiday. And then it's like, what does that mean? You know, like there's been a year of just circular talking about if this game is exclusive or not. Clearly it isn't. So just stop saying that. You know, I mean, that's the one thing where I want, I want them to speak a little more plainly about what they're doing. That's the kind of thing that's that's really pissing me off with that in particular. A lot of people are saying, you know, that they're shocked that games like Titanfall weren't there. What? Titanfall is obviously not ready. Um, and anywhere near ready, of course. And I think Respawn, uh, and EA have significant buyer's remorse with putting that on Xbox One exclusively or Xbox exclusively in addition of PC. So that seems like something that would be at EA's conference maybe next year. So I'm not super surprised about that.",
            "start": 807.68
        },
        {
            "text": "with putting that on Xbox One exclusively or Xbox exclusively in addition of PC. So that seems like something that would be at EA's conference maybe next year. So I'm not super surprised about that. But to your guys' point, I mean, they did announce games that were not exclusives. Garden Warfare is not exclusive, dark obviously not exclusive. Rainbow Six, The Division, obviously announced those, but those are, you know, not exclusive. So they showed some third party. A lot of people were talking after I was tweeting about the Fallout thing that Todd Howard and Xbox at no point said that was an exclusive feature. The fact that PC mods will be there, you know, I mean, maybe there is something similar at PlayStation 4, maybe it's put in a press release, whatever. But there are, they did make a big deal of being World Premiere Xbox exclusive, B-console exclusive. Yeah, yeah. And they didn't say that here on certain things. Something I thought was crazy interesting, no Call of Duty, right? It just, it felt wrong, half",
            "start": 845.68
        },
        {
            "text": "World Premiere Xbox exclusive, B-console exclusive. Yeah, yeah. And they didn't say that here on certain things. Something I thought was crazy interesting, no Call of Duty, right? It just, it felt wrong, half refreshing. You, yeah, exactly, right? Like tells Ubisoft, it's almost like, I don't want to say Call of Duty is waning because it's clearly not waning, but I think that it's it's plateauing. But I think a good sign in a lot of ways, you know, like the fact that like they didn't open it with Call of Duty, like that does show that like that isn't so much the focus anymore. And the fact that we got Gears and Halo in the same year, like that's interesting. Like we're in, we're in a really cool place. The Division and uh, Rainbow Six, like as a shooter guy, what are those are you most interested in? And is there any that you're not interested in playing? I mean, I, I just love Ubisoft like Shooters in general, like Tom Clancy Shooters. So I'm excited for The Division for sure. Like that's, I feel like that's a game that",
            "start": 878.92
        },
        {
            "text": "that you're not interested in playing. I mean, I, I just love Ubisoft like Shooters in general, like Tom Clancy Shooters. So I'm excited for The Division for sure. Like that's, I feel like that's a game that has a lot of depth. That trailer great. I feel like it could be either a really good Ubisoft game or a really bad one. So I, I want to see more and learn more about it. I mean, with the Rainbow Six, they just showed a bunch of like footage that you got to play in the alpha. So I, I'm assuming during their actual press conference, that's where we get to see more Rainbow Six in depth. So I'm excited for this stuff. But yeah, I want to see more of it. Yeah, my thing with The Division continues to be, I want to play it by myself. That game begs to be played by yourself. And that's, it's an eerie setting. It's a, it's a brilliant setting. New York City in perpetual holiday mode or whatever, Black Friday. It's like that game is going to be inherently scarier and weirder by playing by yourself. And so I hope that they give you a",
            "start": 923.0
        },
        {
            "text": "setting New York City in Perpetual holiday mode or whatever Black Friday it's like that game is going to be inherently scarier and weirder by playing by yourself and so I hope that they give you a way out but it's just I'm I'm I'm losing hope you know that Happ yeah that's the thing is I'd love for it to be a Freedom Wars kind of situation where I can run off and do stuff alone and then come up and team up with you when we want to team up but it does feel like a game that's going to be hey play with everybody now here's the big thing I was curious about what you guys uh thought about and this was super unfortunate for uh for Crystal Tomb Raider's release date is the same day as Fallout 4 and I and I I I tweeted out I'm like keep running Lara right in the 2016 because because your game your game's gonna get that game is going to get buried I don't care how good it is and it does look good yeah it looks awesome that was that gameplay looked awesome but you can't release a game on November",
            "start": 958.64
        },
        {
            "text": "game's gonna get that game is going to get buried I don't care how good it is and it does look good yeah it looks awesome that was that gameplay looked awesome but you can't release a game on November 10th you bet you you have a death wish if you if you release your game on November 10th that game looked so stressful man like every single thing in it it's just like holy **** just bad thing after exactly but put it through a lot it's Lara's a tough lady short you have to assume that game's gonna get delayed I I I can't now the weird thing is your PR the weird thing is that they had they they probably didn't know the release schedule for Bethesda until maybe a few weeks ago obviously there's a lot of secrets and all that kind of stuff but I wonder if they saw that and they still doubled down they had a chance to change it yeah and so that was that was making me wonder maybe they're going to stick with it the game might be done I just I mean the game will probably be ready to go no I",
            "start": 999.92
        },
        {
            "text": "down they had a chance to change it yeah and so that was that was making me wonder maybe they're going to stick with it the game might be done I just I mean the game will probably be ready to go no I mean obviously it'll go gold in October or whatever but is it smart to release the game in November now you don't really need it you have Forza you have Halo and then you'll have Tomb Raider next early next year but then you're up against Uncharted you know what I mean that's I got you got to imagine what their heads right like I think their really and the best thing would be to push it forward forward try to get it out in October right try to push it up a couple weeks I mean we'll see I mean it's just everything's trending towards open world RPGs and the and the commercial viability of open world RPGs is we talked about yesterday in a post show Fallout 3 did about four four and a half million 5 million something like that in the first two months of on the market in 2008 mhm but Witcher 3",
            "start": 1036.92
        },
        {
            "text": "RPGs is we talked about yesterday in a post show Fallout 3 did about four four and a half million 5 million something like that in the first two months of on the market in 2008 mhm but Witcher 3 which was an unknown quantity from CD Projekt which is not a well-known studio that that's never really released a game like Witcher 3 in terms of its it's its scope and its depth and its beauty and it and its polish sold four million copies in two weeks so people that still think that Fallout 4 isn't going to sell extraordinarily well and is going to kill everything around it I think are being a little bit delusional unless you're Call of Duty or Assassin's Creed I'd get the hell out of November okay so we're talking a little about all the Blockbuster games and stuff like that so we saw a lot of the ID@Xbox **** so what we're going to talk about here we have a special guest Alfredo we're going to switch you out for a bit and let him come the seats warm enjoy oh Nathan Vella happy games guys",
            "start": 1071.64
        },
        {
            "text": "of the ID@Xbox **** so what we're going to talk about here we have a special guest Alfredo we're going to switch you out for a bit and let him come the seats warm enjoy oh Nathan Vella happy games guys totally farted in this chair was a good fart though if I know Alfredo farts they're good farts that's I don't understand what that means if you know Alfredo uh who better to talk about Xbox indie games than the guy whose game had .5 seconds in the in the oh yeah those .5 seconds sold me man Below based on that up until then I was just like it looks kind of boring game looks like a dumb Zelda and then I was like wait it looks like a great Zelda what what is going on what what what is going on is Xbox are they committed now to Indie developers are they trying to catch up I know it's I can only speak from my experience and our experience has been like they came to us way before Xbox One even was a thing so we've I mean we've had a great relationship with and we were the like Super Time Force was",
            "start": 1107.28
        },
        {
            "text": "speak from my experience and our experience has been like they came to us way before Xbox One even was a thing so we've I mean we've had a great relationship with and we were the like Super Time Force was the second Xbox One ID@Xbox game I think oh wow on the whole platform um and yeah so we've been hammering away on Below for quite a while now excited to show it for the first time in a long time here but holy cow like just seeing more Tacoma uh Ashen which is a game that probably will get overshadowed pretty significantly by the rest of the independent games uh Aurora 44 team nobody really has probably heard about but I've seen a bunch of stuff from Ashen it's going to be really really interesting super cool art style super yeah the the no face thing was interesting too I don't think I've ever seen that it's I think it's going to be really really cool and Cuphead those dudes I'm calling them out on camera those dudes are from Toronto and I have never met them really what's going on in",
            "start": 1152.08
        },
        {
            "text": "ever seen that it's I think it's going to be really really cool and Cuphead those dudes I'm calling them out on camera those dudes are from Toronto and I have never met them really what's going on in Toronto with all of the awesome Indie Games coming out of that drugs it's it's all drugs in Maple Syrup Yeah we actually funny story about maple syrup Superbrothers: Sword & Sworcery the Superbrothers and Superbrothers: Sword & Sworcery is a a a team of two and they now live out in the woods and their family makes the best maple syrup in of Canada what's what's the brand that's quite the statement it's it's a it's they live in a town called Baldwin Mills um and the family is Baldwins and they make the maple syrup that all of the like top-notch like all the people who like inspect maple syrup for quality they go to them to get it I got two uh bottles of it from my wedding present and it was like the best wedding present of all time I'm Canadian hello that is probably the most Canadian wedding",
            "start": 1195.8
        },
        {
            "text": "quality they go to them to get it I got two uh bottles of it from my wedding present and it was like the best wedding present of all time I'm Canadian hello that is probably the most Canadian wedding present one could possibly get that is that a hockey stick yeah I don't I have never played hockey in my life I have to B I like playing it on Genesis yeah oh yeah it though oh my God so I I've never even heard of this game I don't know why told me back when we were at IGN they did they released a trailer and I immediately hit them up I'm like we need to get you on Up at Noon and they're like we're in Canada and have no money to fly and I'm like I have no money to fly you here either so one day now they're a big deal and no one will ever they'll never talk to me again I'm really looking forward to it I think and it's a really interesting like everybody always wants to talk about the art style cuz is just like in-your-face amazing like it's so special um and they're not like this is I think",
            "start": 1239.56
        },
        {
            "text": "to it I think and it's a really interesting like everybody always wants to talk about the art style cuz is just like in-your-face amazing like it's so special um and they're not like this is I think their first game ever wow but I think the other side of it is there's a really interesting game in there too like it's not it's it's kind of a like sidescrolling shooter platformer Boss Rush I mean they mentioned 16-bit and that it instantly brought me back to like a bunch of different games that I love from that generation I think it's going to be super gamey and super beautiful at the same time that's the kind of stuff that I'm super jazzed about and Tacoma I mean that nobody's going to like bat an eye to purchase that game I think it's going to be like one of those auto-buy have to buy it twice now thanks Steve you bought it a billion times back in the day to just to force people to play it I know that's true what a great game though what an extraordinary game we don't we both had palpable",
            "start": 1282.96
        },
        {
            "text": "now thanks Steve you bought it a billion times back in the day to just to force people to play it I know that's true what a great game though what an extraordinary game we don't we both had palpable disappointment though we looked at each other when they announced it because I was like I'm like we just played more on PlayStation 4 so it's was like oh we can't get the trophies now yeah boot up the Xbox One keep holding out hope Midnight City I'll get that paid out for going home sick burn Beyond Eyes that one looked red too you know what I mean like when they talked about it like a blind girl I was like oh is this the game that is the same as Perception that I read about no no this is something different colorful and beautiful I like dang this looks really good definitely it had that like unique look to it which was interesting the gameplay itself like I would like to get my hands on it and see but it kind of reminded me of the the levels that I don't love in 3D Mario games where it's kind",
            "start": 1322.52
        },
        {
            "text": "look to it which was interesting the gameplay itself like I would like to get my hands on it and see but it kind of reminded me of the the ghost levels where you're like can't see what you're doing kind of hoping that it goes more the like Unfinished Swan route of like exploration through revealing environment than that but I don't we'll have to we'll have to see when we get to play it hopefully it's on the floor I would I would be really really hopeful and then like Game Preview stuff yeah for for independent developers I think it's a super well I mean for anybody I mean you're starting to see big big developers do that kind of stuff nowadays too and I think that's that's going to continue on console but it gives it's a really great opportunity for a team like or for a game like The Long Dark or for DayZ to like continue doing exactly what they're doing not have to change their entire development to get on",
            "start": 1357.28
        },
        {
            "text": "it's a really great opportunity for a team like or for a game like The Long Dark or for DayZ to like continue doing exactly what they're doing not have to change their entire development to get on console uh it's a really interesting thing and I I'm I'm super excited to see it and I I think it's great to hear the way that it was introduced which is like we're going to take great pains to make sure that all the BS that has happened with the crappy games on Early Access doesn't happen it's like curated is sounds amazing to me free trials like mandatory trials that's really good idea I I I think that's going to be really cool and it's really exciting I think all that stuff is really important to console gamers too because you know on PC they're they're really kind of looking for that tailored experience where they or not tailored but just like free for all do whatever you want open and doing all that with consoles they want the tailored like just tell me what to like tell me what to try",
            "start": 1398.4
        },
        {
            "text": "experience where they or not tailored but just like free for all do whatever you want open and doing all that with consoles they want the tailored like just tell me what to like tell me what to try that's what I say all the time Tim tell me what to like I'm curious you can give me a little insight into this obviously as as a season developer because I was thinking about this with with with this you forgot to air quotes I'm sorry I'm sorry Season developer because I was thinking about this and I'm glad you're here because with the Xbox Game Preview I always thought about this is it having something like this in kind of an open beta form or like kind of just iterating on it as it's available is it is there a way that it's more stressful for developers cuz they have to they have to worry about getting it out there in some sort of playable form as opposed I always think about that with vertical slices and Final Fantasy XV's demo which they're updating I'm like why are you even doing that",
            "start": 1439.24
        },
        {
            "text": "getting it out there in some sort of playable form as opposed I always think about that with vertical slices and Final Fantasy XV's demo which they're updating I'm like why are you even doing that like work on the game now so how do you feel about that I mean is it all upside think uh no I mean I think it's it's there's a huge upside in that you're you get to see and feel what the players actually care about in your game before you say that your game is done and I think that's a massive advantage and we've seen a lot of the good Early Access games take huge advantage of that but at the same time like like having a release schedule where like people know that stuff is coming updates are coming like it's moving towards 1.0 like really I mean I you got to give Klei a ton of credit they're one of the only studios in the world that has done Early Access twice and made it to full release and both of their games were flawless um I think it's extremely taxing for for development but I also",
            "start": 1473.72
        },
        {
            "text": "one of the only studios in the world that has done Early Access twice and made it to full release and both of their games were flawless um I think it's extremely taxing for for development but I also think there's like when you're making a game um and again this is just speaking for myself but you're always trying to be like what would the player do what would the player think what do they love in this case you can get to a point and just say okay you guys just tell us like don't we're not going to guess anymore you're calling everybody who uses Early Access lazy yes good yeah essentially there's a yeah that's I'm going there's your head what he said Greg always has Greg has a knack for boiling things down to their essence it's going to be really it's going to be really interesting to see it on console cuz I mean like we're we're as developers were super trained to just like oh it's PC uh you got to be your own quality control you put out **** builds and people eat you alive right um",
            "start": 1512.24
        },
        {
            "text": "it on console cuz I mean like we're we're as developers were super trained to just like oh it's PC uh you got to be your own quality control you put out **** builds and people eat you alive right um whereas on console there is this history of like certification and and kind of mandatory quality standards uh so I think it's going to be really interesting to see how that plays in and it's it's the least fun part of making video games by a long shot so I I'm hopeful that that that Microsoft's going to take that on notice as well and maybe you know maybe think about what certification is for for these games because I would love to see you know a a small tight-knit group of really great Early Access games that the really tight Xbox Community because they are really like Xbox Live like hardcores are like the tightest most intensely passionate group of people that I've seen and giving them a chance to actually like help define some games to like maybe you know I would I would love to see",
            "start": 1554.24
        },
        {
            "text": "are like the tightest most intensely passionate group of people that I've seen and giving them a chance to actually like help define some games to like maybe you know I would I would love to see DayZ go differently on console than on PC because that's what but maybe that's a pipe dream now speaking of DayZ I want to know Colin's opinion on Ion this is the Dean Hall game they came out he said it's this what SIM MMO that explores the expansion into space yeah I mean MMO is a huge turn off for me I know but space being out into space and exploring space is a huge turn on for you that cancel out yeah I was going to say you're like it's hard to cancel out it definitely intrigued me I mean that was a cur that was a a curious game I wish that I they showed a little bit more about it you know it it was a little vague I mean intentionally so I think I mean the thing that's still stuck out to me towards the end of the demo other than the fact that Gears 4 looks really really good again though",
            "start": 1596.76
        },
        {
            "text": "it was a little vague I mean intentionally so I think I mean the thing that's still stuck out to me towards the end of the demo other than the fact that Gears 4 looks really really good again though it's just like what are they doing the Rare like what is Rare doing like I'm really I'm curious like what you guys think about about what Sea of Thieves because it seems like every time Rare gets given a game to do or they come up with an idea this this kind of new version of Rare it's not what people expect I feel like there's a lot of disappointment in the game looks cool it can be great but I feel like they're not delivering the goods like what people really want from them I don't even know what people want from them anymore though yeah that was exactly Square they have such an identity crisis yeah I think it's a I think they're at a point where I would love to see them just do a whole bunch of smaller stuff instead of trying to I mean I know that that they have to do the big stuff um",
            "start": 1639.84
        },
        {
            "text": "yeah I think it's a I think they're at a point where I would love to see them just do a whole bunch of smaller stuff instead of trying to I mean I know that that they have to do the big stuff um but I like if somebody was to ask me what game do you want to see from Rare I I honestly I don't know I just want to see them make something like super weird again super off-the-wall super like cuz that was the stuff that I used to think you know as when I was playing their stuff earlier I used to think like no one else is making this type of game right right and I still think they're doing that but not in the way that we all have that like nostalgia twinge in our head I mean when you look at that like the the game they showed what was it called Sea of Thieves it's like it looked cool like graphically and stuff but it's like it just looked like I've seen 10 trailers like that already E3 where it's like oh people like MOBAs and people like Team Fortress 2 so uh let's try to do that",
            "start": 1675.76
        },
        {
            "text": "graphically and stuff but it's like it just looked like I've seen 10 trailers like that already E3 where it's like oh people like MOBAs and people like Team Fortress 2 so uh let's try to do that again here's Pirates yeah I mean I have little doubt I should clarify that I have a little doubt that the game could be great it looks looks cool and stuff I'm just saying like what yeah the question is what is Rare but is it I I honestly think a huge part of it is us not them like uh it's it's you not me thing cuz it's I think we need to kind of and this is going to happen more and more as as games as a medium moves forward but we're going to have to start thinking about like uh that audience that remembers us from 15 years ago uh they want something but what about like there's probably a ton of new Xbox players that that Sea of Thieves looks super amazing to and don't have that Battletoads would mean nothing to you know and so I feel like a lot of people on the internet going be like where",
            "start": 1713.76
        },
        {
            "text": "of new Xbox players that that Sea of Thieves looks super amazing to and don't have that Battletoads would mean nothing to you know and so I feel like a lot of people on the internet going be like where the where's Battletoads and it's like well it's in the collection but where's the new Battletoads it's like well this doesn't make sense really you know sure that was the other thing was I was surprised I mean you you can never really tell the audio levels on these streams in terms of the crowd reaction stuff like that but I thought the Rare Collection was received underwhelmingly I thought that that was a pretty big deal um and I Rare has such a deep you know deep history back to the NES so it's I thought it was kind of exciting to be able to get those games a huge gamer score and all those kinds of things I was I thought that was a nice little nice little like we were saying an ode the throwback to the Rare we remember as Rare kind of re-invents itself I I mean for for me like seeing that",
            "start": 1754.4
        },
        {
            "text": "kinds of things I was I thought that was a nice little nice little like we were saying an ode the throwback to the Rare we remember as Rare kind of re-invents itself I I mean for for me like seeing that I was instantly like oh man here's our Let's Plays for like a month oh gosh like that's going to be awesome when that game comes out on August 4th there's a release date we'll be able to just get in just **** go to town and all the ID@Xbox games too man oh we gonna play the hell out of those be a whole bunch of them I think this is going to be a huge E3 in general for for some independent games and for independent games with publishers The Drift being my number one most like that's the game that I am most excited for period and it's a small team with 505 Games like that probably have never said anything like that before you know what I mean that was just an indie game with uh you know a really awesome uh publisher that's I don't know that all sounds super weird to me but I'm super excited about",
            "start": 1789.64
        },
        {
            "text": "like that before you know what I mean that was just an indie game with uh you know a really awesome uh publisher that's I don't know that all sounds super weird to me but I'm super excited about that and on that note I now need to duck out and head to a meeting thanks a lot for having go get a new game published go do things good hugs Good Hugs yeah I'm going to go meet and talk about video games with other video game people surprisingly at E3 I'm going to get up and hug it bye bye bye fans you guys are great by the way thanks you really are you really are Cheers dude. Alfredo bringing him back in I want to hear what he has to say about this Halo business yes cuz he's he he is the Master Chief Master Chief no I tweeted out during the that demo I was like man if you at the end of this demo fight against Master Chief I'm going to lose my **** uh it looks it looks he didn't no uh but it looks good like it looks really good I think the thing I like most about it is that a lot of like the Halo",
            "start": 1828.64
        },
        {
            "text": "against Master Chief I'm going to lose my **** uh it looks it looks he didn't no uh but it looks good like it looks really good I think the thing I like most about it is that a lot of like the Halo games you play it's like you against a a horde of enemies but now like that you have a squad with Spartans with you like it just feels like more of a like you know like a small scale battle just consistently going on yeah and it it's cool you know like as you all know I'm a huge fan of Red vs. Blue and that is has always been that like kind of the squad thing especially in recent seasons it's got a little more action oriented and this reminded me of Red vs. Blue but the game which is kind of weird if you think about it but it's like it's fun because you're right like you're not just one dude running around like being able to tell the people it's kind of a little like ODST but I feel like this is that's dangerous territory yeah yeah but it's it's the more modernized ODST it's like",
            "start": 1871.32
        },
        {
            "text": "dude running around like being able to tell the people it's kind of a little like ODST but I feel like this is that's dangerous territory yeah yeah but it's it's the more modernized ODST it's like the Halo 4 ODST as opposed to Halo 3 well they have Buck from ODST but now he's a Spartan yeah hey Spartan Up you the only way to go but yeah that that looked cool and the the Warzone mode it was a little unclear what is confused on that it sounds like 1 on 1 and like it looked like like Big Team Battle but then there's like like um like the campaign enemies and stuff like that it was really yeah it was like fight against everything you could do everything everything everything it's like do we get to play as the everything or you know and we'll see I doubt it but um that it'd be interesting the fact that they marketed that way was weird the marketing for just Halo 5: Guardians in general has been really really good cuz like back during E3 I didn't really care",
            "start": 1911.28
        },
        {
            "text": "um that it'd be interesting the fact that they marketed that way was weird the marketing for just Halo: Guardians in general has been really really good cuz like back during E3 I didn't really care about it too much I was like I'm kind of getting Halo fatigued but now they have like um this whole like like the whole Hunt the Truth campaign like Spartans versus Spartans you have Locke versus Master Chief I think is very intriguing they have like a a lot of just like tiny little things here and there like there's like audio um episodes that they're putting out that kind of like is from the the perspective of like a news reporter trying to find out like know dig deep into like the story of like what is going on what is the truth and so it's it's kind of refreshing has that come around for you now now you care about that stuff yeah now I'm now I'm all about it I'm really interesting interesting no beta though young man you were wrong no I know they put the **** beta on Gears we should",
            "start": 1952.76
        },
        {
            "text": "now now you care about that stuff yeah now I'm now I'm all about it I'm really interesting interesting no beta though young man you were wrong no I know they put the **** beta on Gears we should probably talk about that right the predictions our predictions from the Gamescast hey Kevy Kev so you want to bring up our predictions from the Gamescast go to KindaFunny.com forums then go to the general gaming discussion and it's one of the sticky ones up there you'll need to go to last page so as as you guys know on Gamescast last week we did uh we carried over our old uh Podcast Beyond tradition over to the Kinda Funny Gamescast in which we would make bold and outrageous predictions for E3 yep um we usually did five each at on Podcast Beyond obviously for uh PlayStation specifically uh so we expanded that to 20 predictions five for Microsoft five for Nintendo five for Microsoft and then five for third parties each m and uh Greg I'm I'm I'm pleased to report even though you're walking",
            "start": 1991.44
        },
        {
            "text": "we expanded that to 20 predictions five for Microsoft five for Nintendo five for Microsoft and then five for third parties each m and uh Greg I'm I'm I'm pleased to report even though you're walking away and going away Greg you're going away Greg where are you Greg showing Kevin how to do it I was right about one and I was wrong about another what yeah what were your Halo got a release date Halo yeah and it already had one yes it already did but I was right that they said it again sure um Crash Bandicoot did not come out no not a Sur not not a you the only one that thought that was I was like where's he where's he going to come where where this is it and it never happened that's it's on the screen a bit but let's get through these so Greg's predictions Greg was Greg only Greg only got. five points here that was rough some now for the record oh you're going to go through them I guess be let's go through them let's go through them I'll hold everybody hold hands Foley Day holding hands",
            "start": 2030.36
        },
        {
            "text": "five points here that was rough some now for the record oh you're going to go through them I guess be let's go through them let's go through them I'll hold everybody hold hands Foley Day holding hands this is not a drill there we go uh Halo 5 prediction was Greg's number one prediction beta starts uh why did say Gears all right that's enough for holding okay um zero points you were close I mean you almost you were almost there yeah and I close mean you were you were pretty off but some yeah yeah some people wanted to give me a half point for that no **** way that's stupid def not I'm sorry not that you're stupid don't worry uh Greg's second prediction was that Battletoads would be the one more thing teaser for a new Battletoads game he was wrong about that people were trying to give me credit for the Rare Collection too no not at allm all right now you now you you're playing like Colin plus games here now these are games that I I wouldn't even I wouldn't even recommend look at them",
            "start": 2071.36
        },
        {
            "text": "credit for the Rare Collection too no not at allm all right now you now you you're playing like Colin plus games here now these are games that I I wouldn't even I wouldn't even recommend look at them they're playing Colin plus games I'm the one squashing it you're playing Greg's doing the right thing I'm I apologize Greg thank you I know you're used to just yelling at me and berating me for that's true that's a good point prediction number three was that Blue Streak uh which is Cliff B's um PC exclusive would also become an Xbox that was my crazy one uh no points for that now you got a half point here uh Dark Souls 3 Dark Souls 3 was shown yeah um it said exclusive content revealed for Xbox One that wasn't so 05 you just stuck with Dark Souls 3 shown that was it I know I should I I got cocky that's the D though I liked that yeah I like that too that's the danger of overpredicting but I overpredict in order to then get as many granular points Nick knows what I'm talking about number five",
            "start": 2106.36
        },
        {
            "text": "that's the D though I liked that yeah I like that too that's the danger of overpredicting but I overpredict in order to then get as many granular points Nick knows what I'm talking about number five which was your Undead Labs prediction um you said Undead Labs would have a presence show a teaser trailer for their new game it's about zombies and focused on multiplayer none of that was at the show one day I think you jumped the gun on that I think this will be a safe bet for maybe next year but I they just released the game everybody remember Sean Pitts remind me to make this prediction next year I got one already uh and then on my predictions uh my first prediction was that Minecraft would have a presence there so this is four parts Greg yeah know Minecraft SP it's a traditional Colin Microsoft spends significant time talking about Microsoft I got that so that's 0 5 points a big announcement for Minecraft update you know whatever I got that 0 5 teas before the conference I didn't talk",
            "start": 2140.84
        },
        {
            "text": "spends significant time talking about Microsoft I got that so that's 0 5 points a big announcement for Minecraft update you know whatever I got that 0 5 teas before the conference I didn't talk about it before the conference and then talk about how they would support Minecraft going forward they did so 75 points do we want to talk about a little bit of that right here for a second cuz that Minecraft demonstration was bit crazy it's one of those things where this is the the good type of here's something new and we're going to show you this weird demo that's unlike anything you've ever seen that isn't the I'm going to do Wonderbook or we're going to do con this was actually one where all of us were like H God VR and then we're like oh this is yeah you got right and he had like the HoloLens on his on his face and he was just kind of standing there it was like when they when they were when they were doing the stuff on the wall I was like I don't understand sounds stupid and then when they",
            "start": 2175.64
        },
        {
            "text": "his on his face and he was just kind of standing there it was like when they when they were when they were doing the stuff on the wall I was like I don't understand sounds stupid and then when they were like now put it on the table and Minority Report you're like **** **** all right and like I don't want to play I like Minecraft I play Minecraft I don't want to play Minecraft that way but the opportunity now for developers to do whatever the hell they want with games and use it that way that's insanely cool well too you know what I mean yeah I don't know if anybody's making a giant dick on the table are you kidding me everyone's going to make a giant dick T giant dicks on the table there's no doubt about that yeah you can't stop it um yeah I remember during that that Minecraft thing I turned to Greg I was like how did that how does this work yeah I don't know why how is this even working yeah cuz it's like they weren't doing the you think about it with uh the augmented reality",
            "start": 2210.72
        },
        {
            "text": "I turned to Greg I was like how did that how does this work yeah I don't know why how is this even working yeah cuz it's like they weren't doing the you think about it with uh the augmented reality **** from Sony right on Vita right you needed to have those dumb cards whereas this the guy's just like I'm going to look at the **** table and the table is Minecraft it's like what what do you like I'm sure there will still need to be something there to make that kind of crap happen but we'll see very impressive uh the second prediction was a Windows 10 prediction talk about Windows 10 functionality with Xbox One they talked about it endlessly yes um so that was one point everywhere and then I missed the next three uh as we said before the show my third prediction was Quantum Break's release date would be announced um and Quantum Break wasn't on the show at all which they said before the show it's going to be at Gamescom uh in August in Germany prediction four was Lionhead Studios would",
            "start": 2248.24
        },
        {
            "text": "date would be announced um and Quantum Break wasn't on the show at all which they said before the show it's going to be at Gamescom uh in August in Germany prediction four was Lionhead Studios would show up and they would show their new game which would not be Fable they did not show up and they not show a new game and then my fifth prediction was Twisted Pixel would show up and show a new game and it would also be on PC and they didn't do any of that as well so 1.75 points for to Five Point or I'm sorry point five points and uh Kevin if you scroll up to the top um just up a little bit if you're listening your mouse is moving so I think you are he's not dead uh keep going keep going just to the top where it says the score so the score right now is 3.9 I don't know where I got point I got to look at where did I get that what no these 3 three oh so this comes from my Doom prediction in which I got two-third of it right which put an even number in the mix sorry about that uh so 3.9",
            "start": 2283.12
        },
        {
            "text": "got to look at where did I get that what no these 3 three oh so this comes from my Doom prediction in which I got two-third of it right which put an even number in the mix sorry about that uh so 3.9 to two and we still have um Sony yep Nintendo and then a bunch of outstanding third party ones so I think we have actually well you got a Nintendo one already right did I and I got a Sony one right already oh they add is that am I already on there so that leaves 19 0 1 so there's 24 points still on the table real quick uh the chat was asking what's next for us uh at 1:30 our pre-show for EA starts now of course we're just streaming all day we're not stopping if you're just joining us we're Twitch.tv/KindaFunnyGames KindaFunny.com uh every day we come to you with nerdy stuff and of course if you're watching this on YouTube this means nothing to you but if you're a Twitch person right now thanks for watching along with us we are live all day today every press conference pre and",
            "start": 2316.96
        },
        {
            "text": "course if you're watching this on YouTube this means nothing to you but if you're a Twitch person right now thanks for watching along with us we are live all day today every press conference pre and post shows crazy stuff happening but Tim what are we recording right now this is the Kinda Funny Gamescast for the first ever last ever E3 2015 post show of the Microsoft press conference I hope you liked it because I'm about to stop the show right now so I can export the show and get it live for all you people that aren watching live but if you are watching live we're keep talking about everything right here I'm actually going to pee I got a p so why don't you I would like to go eat as well so what are we going to do about that we're just going to **** rotate look Nippo is anxious to get on here and talk about the climbing community and how Lara fits into that I guarantee it he's choing at the bit and not that champing it the bit we've done we've changed champing I'll be right back",
            "start": 2363.4
        },
        {
            "text": "on here and talk about the climbing community and how Lara fits into that I guarantee it he's choing at the bit and not that champing it the bit we've done we've changed champing I'll be right back all right",
            "start": 2398.12
        }
    ]
}