{
    "id": 923,
    "video_id": "g34ksPdfD-0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "What Instrument We Wish We Could Play - The GameOverGreggy Show Ep. 79 (Pt. 2)",
    "description": "If we could be musically talented, which instrument would we want to play?\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1433833201,
    "duration": 2220,
    "transcript_chunks": [
        {
            "text": "Colin , yes it's time for your topic, but first we want to say thank you to everybody who supported us on patreon.com, Kinda Funny in April. Thank you all for all of your support over there. You let us live this dream. You allow us to do all these stupid things we do. We thank you for that. Thank you, thank you, thank you so much. Um, I want to talk about uh instruments, musical instruments. Oh, old skin flute. So the the reason I bring this up, I you're a you can play uh you can play the skin flute in the New York's Philharmonic. Greg, you're so good at it. But um he's had offers, huh? He's had offers. Yeah, he's had offers. Yeah, what does one play the skin flute with? One's mouth or one's with one's fingers? I think it's it's a two-handed and mouth. So like a clarinet. It's like a flute. You're like this, but it is more like a clarinet or an alto sax, ano, or an OBO. Okay, so I wanted to ask you guys this question, not a bassoon . The the reason I asked this question to to you to this group of people is because",
            "start": 2.82
        },
        {
            "text": "is more like a clarinet or an alto sax, ano, or an OBO. Okay, so I wanted to ask you guys this question, not a bassoon. The the reason I asked this question to to you to this group of people is because even though we're all music fans, I'm the only one I think that plays any instruments, right? Like trumpet when you were young, a young man, right? Yes, I don't I haven't played an instrument. Could you could I give you a trumpet right now? Could you play the Trum yeah, I I trout that **** would you? Yeah, 100%. Okay, so this played for like 15 years. So okay, so this is a question even maybe less for you then sure. Um, so the reason I asked this question is because I grew up playing the drums for a long time and um I also played saxophone for a little while and and uh piano for a little while. And then when I was older, I like in high school, I picked up guitar and bass for the first time. And then when I was in college, I really played almost guitar and bass almost exclusively because I just couldn't have drums",
            "start": 80.76
        },
        {
            "text": "older I like in high school, I picked up guitar and bass for the first time. And then when I was in college, I really played almost guitar and bass almost exclusively because I just couldn't have drums with me in my dorms and then in apartments and stuff like that. Um, and now these days I could still sit behind a drum kit and play great. Um, I mean that's always what I'll consider myself, but I play bass probably most competently. Sure. Um, in terms of the string instruments. Um, so I was curious like if you guys could pick up any instrument um and be totally proficient at it. So like it's not a thing where you have learn how to play it. You pick up your six string Bas, your five string Basse and you just know how to play it for instance, um what instrument would you choose and why would you choose it? Piano. Piano. Yeah, I love the piano. It's awesome when you see somebody who can play the piano well, it's amazing especially when you like we at that Patreon party, we had a GDC, right? Uh when at the end",
            "start": 119.44
        },
        {
            "text": "piano. Piano. Yeah, I love the piano. It's awesome when you see somebody who can play the piano well, it's amazing especially when you like we at that Patreon party, we had a GDC, right? Uh when at the end there the guy came in, sat down and started playing the panting like **** that's badass cuz you know what I mean? Like granted you have to tune a piano, but like guars you shum a few and you start screwing around with it and you start giving away that you know what you're doing or I think it be such a cool party trick to go to parties or whatever be able to sit down just be awesome if you not do Chopsticks. Yeah, yeah, actually play something really good. We've also got the opportunity to be like like a Jeff Goldblum or uh uh I think Bill Murray plays piano as well where they just like you're just like you're at a party and you're just there on there piano and you're sit you start playing and start talking at the same time and it just is that sort of like that old school very swaave comedian",
            "start": 160.64
        },
        {
            "text": "like you're at a party and you're just there on there piano and you're sit you start playing and start talking at the same time and it just is that sort of like that old school very swaave comedian mentality where you're like you know Zach Galifianakis used to do that too and play and like make jokes about it. It's just very entertaining with piano. I love piano music so it's just it's soothing, calms you down. He's very versatile too. That's the my favorite thing about it is that it you can you know there's the classical stuff, but like obviously there's a lot of just other types of genres you can play with piano music and I feel like knowing how to play a piano very proficiently would then allow me to play other instruments by default because if you can understand wrapping your head around reading two sets of sheet music at the exact same time doing with two different and stuff like that which I'm assuming is how you me the cffs . Yeah, you play bass treble cluff with your right hand and bass cluff",
            "start": 194.36
        },
        {
            "text": "sets of sheet music at the exact same time doing with two different and stuff like that which I'm assuming is how you me the cffs. Yeah, you play bass treble cluff with your right hand and bass cl uff with your left hand. Yeah, it's like if you can train yourself to do that like I feel that that gives you understanding of music on a deeper level than most other things so you'd be able to like jump onto other instruments. Yeah, piano was interesting because I I took piano lessons for a year and I was I was okay but um but it was it was a challenging instrument to play because I the first instrument I played in school was Sachs and I liked it did but it was just I was like this is not what I'm into and I I started playing drums by myself and then I took lessons later and became quite proficient. I mean that's like really the instrument I'm best at but is both snare and like a whole kit and um that's just something I understand better than something else and actually piano is very closely",
            "start": 235.24
        },
        {
            "text": "I mean that's like really the instrument I'm best at but is both snare and like a whole kit and um that's just something I understand better than something else and actually piano is very closely associated with drums. It's a percussion instrument so you can play it in in in a lot of different ways. I'm more excited about yeah like the proficiency of jumping from piano to synth or piano to you know like some sort of key accompaniment or whatever um cuz see cuz what you're saying is you learn piano and then you're a hop skip and a jump away from the kear. Yeah, yeah, I which is obviously the end goal which is clearly the the Zenith of all great musical instruments. That's what everybody wants. That's another reason like I would go with piano is because that is kind of the basis for a lot of the midi instruments and stuff so like making like hip-hop beats and **** if you know how to play a piano it's like really helpful. Well make no mistake like when you go to music school you have to learn",
            "start": 275.08
        },
        {
            "text": "instruments and stuff so like making like hip-hop beats and **** if you know how to play a piano it's like really helpful. Well make no mistake like when you go to music school you have to learn how to play piano. Piano is like the the instrument that you do any musical scoring from. You don't sit down and like Danny Elfman doesn't sit down in front of his lead guitar and go okay I'm gonna write like the Batman theme. No, you sit in front of piano and that's how that's sort of how everything starts when you're writing music. So like I think my my I think everyone has to learn piano. Like my buddy Scott is a band director. I'm pretty sure like you have to you have to have a functional knowledge of that instrument. Yeah, it's hard man. I took a couple months of it and just it my head wouldn't click with it. I did trumpet for a long time and I almost went to high school at school the arts for trumpet but I'm happy that didn't happen cuz I'm here now. Yeah, it worked out. Yeah, um I played trumpet for a",
            "start": 317.56
        },
        {
            "text": "it. I did trumpet for a long time and I almost went to high school at school the arts for trumpet but I'm happy that didn't happen cuz I'm here now. Yeah, it worked out. Yeah, um I played trumpet for a very long time uh mostly because I did I took about six months of piano and I can't it's very difficult for me to get both my hands working at the same time in that regard. Now when the skin flu is a different story cuz you just got to feel that MH you know what I me every skin flute is different it is but at the same time you can get a general understanding of of the feel for it yeah and then you can you don't really even think your hands just do what your hands need to do but for like I never I could never play drums I could play I no I just couldn't I can't get my hands working independently in order to actually do the Beats I just can't do it and then once you put when you put feet into that forget about it's not happening so for me trumpet was because you mostly just focus on",
            "start": 354.72
        },
        {
            "text": "in order to actually do the Beats I just can't do it and then once you put when you put feet into that forget about it's not happening so for me trumpet was because you mostly just focus on these three fingers and then you have this works well to tune your different valves that's all you really have to worry so much about which is which is same reason with the instrument that I would pick which would be guitar. I would do a six string guitar and here's why driving up to top recently I was listening to a little band I don't know if you guys have heard of these guys they're called Guns and Roses. Oh yeah know them well and you just hear that sound right just Slash when Slash comes in and it's good and it is it it goes from oh hey I can play this instrument to this is a God on stage like this person when he starts shredding panties drop mhm and if there's any reason to start playing music or to be in in uh any real entertainment field it's to make panties drop true story true story like",
            "start": 396.0
        },
        {
            "text": "person when he starts shredding panties drop mhm and if there's any reason to start playing music or to be in in uh any real entertainment field it's to make panties drop true story true story like what you're talking about is yeah you want to make panties drop at the party you really do yeah theoretically speaking I'm not saying figuratively like cuz then that would be just dangerous people would be tripping on over the panties you can't have that I yeah the base of your argument is you want to be the cool guy at the party I don't want to be the cool guy at the party I'm saying if you said hey you could learn any instrument I would be like guitar has always been the instrument that like just think about it when you're in your car and that solo comes up and you just you start going like this you don't know what the hell you're doing you're just you're driving with your knee wheels just spinning out control TR Drive you're trying to go like and you're moving these fingers but you don't",
            "start": 442.0
        },
        {
            "text": "you don't know what the hell you're doing you're just you're driving with your knee wheels just spinning out control TR Drive you're trying to go like and you're moving these fingers but you don't know if you're supposed to be moving those fingers or not I just I always thought guitar because it's the power instrument it is the instrument that is upfront in the sound of any rock band or any alt band or any band that really uses guitar so yeah I would always I I would just want that I would want to be able to do that and sing at the same time cuz I always thought that was fascinating I've always admired people that can play guitar eloquently and also like sing Melody cuz again that's another thing I can't do if you gave me like rock band or not rock band a Guitar Hero and said okay while you're doing this Sing the lyrics I just I would no I can't my bra you do that there modes where you play the guitar and sing the song screw it no that gives me anxiety just thinking about it this is",
            "start": 478.76
        },
        {
            "text": "you're doing this Sing the lyrics I just I would no I can't my bra you do that there modes where you play the guitar and sing the song screw it no that gives me anxiety just thinking about it this is such a copout answer cuz I mean it's not technically an instrument but my answer would be singing if that was oh interesting okay because like man if you can **** do that you can do anything your voice is is an in where the panties drop is the singing I like singing like I wish I could sing I wish that I could hit notes or just even like have that but I can't it's like I'm so limited in my range and it's like it's interesting cuz I have an okay talking voice MH as you guys might know but uh I can't sing you can **** sing sing your God why did you feel it necessary to get sexy cuz he wants to let you know that he knows he has a good voice know I'm listening to you listen to me what I'm talking to your mouth and your ear holes anyway uh I love singing but I I my brother used to sing so",
            "start": 515.64
        },
        {
            "text": "to let you know that he knows he has a good voice know I'm listening to you listen to me what I'm talking to your mouth and your ear holes anyway uh I love singing but I I my brother used to sing so he was the one that got me into it and he used to do like music and stuff amazing yeah he's better than me you like really oh God yeah he's amazing like so good like you're legitimately good uh yeah I I mean I can sing yeah I can um it's not I don't I don't pretend to sing well but I did musical theater some stuff give me some stuff what youing you want me to sing sticks that's what you want the band that is constantly in the upper OCT anyway um no I did musical theater for years in in high school and then it was also like I you just you're around it I was in marching band so you just are around people that can sing and you start doing it and that's what it is it's hard you have to get you have to some people just don't have the ear for it and that's where it becomes difficult because I",
            "start": 553.92
        },
        {
            "text": "people that can sing and you start doing it and that's what it is it's hard you have to get you have to some people just don't have the ear for it and that's where it becomes difficult because I don't think that there are a lot of things that you can teach someone how to do and I think with I'm a firm believer that with hard work and with time and consistency and like you put the effort in you can see great results but some people physically just can't hear the tone the pitch they can't get the pitch so they're always singing off tune or they just they don't have the the capabilities of singing higher octaves things like that that's my thing is I hear it I know that I'm doing it wrong it's just I can't do it that's hard and you have to train Kevin on the other hand Kevin has a hearing problem that **** holy **** have you heard him say you guys have heard him sing yes all right it drives me nuts and at this point I just give him a look cuz now that I'm around him freaking 24 hours",
            "start": 604.8
        },
        {
            "text": "that **** holy **** have you heard him say you guys have heard him sing yes all right it drives me nuts and at this point I just give him a look cuz now that I'm around him freaking 24 hours a day before it used to just be like 15 hours a day yeah I now just **** constantly but he'll just sit there and he'll start humming and it's like you know one of you guys usually one of you two will just be **** have some song stuck in your head for the day so you just **** keep singing it over were you sing it earlier today uh whatever K was listening to this morning now I have sticks in my head so sorry can't help you all right whatever it is there's something and then Kevin will just be sitting there and just start humming just go and it's like what is that right it's like oh it's the Michael Jackson song it's like that's no Michael Jackson song what the hell is that he like it's Thriller that's not Thriller it's like you're just making **** noises oh just it bothers me so much",
            "start": 642.56
        },
        {
            "text": "Michael Jackson song it's like that's no Michael Jackson song what the hell is that he like it's Thriller that's not Thriller it's like you're just making **** noises oh just it bothers me so much some people just they don't have like you have you could sing you can sing I did some musical stuff so if you I don't know how far deep into it you've gotten but if you worked with a vocal coach who taught you how to breathe correctly and where where the the air was supposed to come from and how to support you could be a singer like you could yeah easily I you have good pitch and that's really the hardest thing you want an E flat that's not how yeah that's but what's crazy is there are people there are people that would have like I guarantee there were people watching this right now they like that's not an E flat like they would tell you what note you just saying I'm not that like swagman but there are people that have something that's called perfect pitch which is it's Pitch Perfect that's",
            "start": 685.56
        },
        {
            "text": "not an E flat like they would tell you what note you just saying I'm not that like swagman but there are people that have something that's called perfect pitch which is it's Pitch Perfect that's where that term comes from which is um well they call it perfect pitch and you you have perfect but in in other words like if you play a note on piano they'll go that's an A flat or that's a whatever I I can't do that like I always start songs and then they'll play the real song I'm like oh that's the wrong key let's bring it back down over here right or usually it's I sing a lot lower than possible but it's fun singing being able to sing is fun if for no other reason then it is probably the number one most practical uh instrument to be able to have at your disposal at during parties oh not during parties but during like if you're going like karaoke singing for instance oh sure that's a blast when people don't know you can sing and you start singing something and you're like of course you",
            "start": 728.04
        },
        {
            "text": "parties but during like if you're going like karaoke singing for instance oh sure that's a blast when people don't know you can sing and you start singing something and you're like of course you could always just do what I do in default to uh Gin and Juice. Yeah, that's usually my go to you don't have saying that you just kind of pop it oh got to pop it pop it see but that's something that's interesting to me too though is like when you bring rap into it rap is not as easy as I think people think it is like oh you're just talking fast and it's like no you really got to kind of understand the Rhythm and like hit it on the right notes and understand the the counts and all that stuff and like the theory behind how it works because as we've seen before when we've worked with people like trying to get them to rap it's like man how do you not hear this right now is the way I feel but then it's like oh maybe it's just like it's in the same way that I just can't physically sing they can't",
            "start": 765.92
        },
        {
            "text": "to get them to rap it's like man how do you not hear this right now is the way I feel but then it's like oh maybe it's just like it's in the same way that I just can't physically sing they can't physically hear it in the right way understand you're dealing with the same general principles right you're dealing with rhythm and you're dealing with you also by the way can rap off key. A lot of people don't realize that but when you rap you are rapping in a specific key to a specific song that's in that key like if you start rapping a little bit lower or and you know you go minor you go sharp it's going to sound really weird yeah um but yeah you're dealing with rhythm and you're dealing with performance as well and that's the other thing that people don't realize with singing is that you have there is a certain amount of uh you have to annunciate you have to support you have to there's all there's a it's I mean it's an instrument you are learning piano but you are just it the instrument",
            "start": 803.52
        },
        {
            "text": "there is a certain amount of uh you have to annunciate you have to support you have to there's all there's a it's I mean it's an instrument you are learning piano but you are just it the instrument is just formed inside of your body like all good things yeah yeah that's gross that part's gross yeah I don't know to me I mean I the only thing I want to say is that like to me the best instrument is is drums and and I I that's because I grew up playing them and that that I can still even though I don't have like my kit here it's still in New York uh I can sit behind a drum kid and play it and and I I really don't like lose a beat as a um I have what is what draws you to Drums I don't know you say it's the best instrument all of ours were ones we'd want to share with people drums aren't yeah like it was like I have no interest in hearing you drum no offense no I'm not offended by that at all um my friend Christian used to make fun of me we were in a band together in in high school and",
            "start": 840.08
        },
        {
            "text": "like it was like I have no interest in hearing you drum no offense no I'm not offended by that at all um my friend Christian used to make fun of me we were in a band together in in high school and college um and uh we white side of the table exactly no paper champ and uh he used to say used to B kid around is like there's musicians and then there's drummers because a lot of people like don't think of drums even as an instrument there's an argument to be made because you're not making notes necessarily with a drum that that it's basically not an instrument in the traditional sense but um it's the backbone of every song and you know when a drummer is bad like listen to The White Stripes for 5 seconds it's awful like the the like I don't care how good like the guitar and the vocals are in that like me white ducks at drums and like and like and it like detracts from it and it's famous like it's everyone knows that you know like like she's awful col you better watch your back brother",
            "start": 882.6
        },
        {
            "text": "in that like me white ducks at drums and like and like and it like detracts from it and it's famous like it's everyone knows that you know like like she's awful col you better watch your back brother what's he doing I think he's talking **** what happens when you talk **** shot no like with this video hey Tim how you doing I'm good Nick but Colin Moriarty and Greg Miller are talking **** again what don't they know what happens when they talk **** perhaps we should remind them you talk **** boy you get shot yeah talk **** what you get shot yeah you talk **** what you get shot yeah if you act here talking **** then you know you B to get shot Miller needs to pay for two whereever he go and it ain't cuz he's team fat n it's for his ego calling for PR can I get a PlayStation veto he's super frustrating like a hard to find Amo Tim what's next that's all we wrote ni that's it yeah okay was fun I don't I don't like usually going down that path but like Jack what's his name um",
            "start": 926.64
        },
        {
            "text": "he's super frustrating like a hard to find Amo Tim what's next that's all we wrote ni that's it yeah okay was fun I don't I don't like usually going down that path but like Jack what's his name um Jack White amazing musician and like an amazing singer and then it's just like like and it's like it's like give that like a competent drummer and like make that song More Dynam it was that thing because she couldn't play and she never got any better and it was a problem right and Jack White on the other hand Jack White's like a totally impressive guitar player and singer and songwriter so like you there was a there was a dissonance that was that's the band always comes to mind where I'm like there's a distance between the skill of the drummer and the skill of everything else going on in the song and it ruins the song for me because drumming is who do you think the best drummer is we've had this conversation before your fav Dr my favorite drummer is Chad Sexton from 311 but the yeah",
            "start": 975.52
        },
        {
            "text": "in the song and it ruins the song for me because drumming is who do you think the best drummer is we've had this conversation before your fav Dr my favorite drummer is Chad Sexton from 311 but the yeah like Neil Pert's like one of the great drummers I think that probably 311 has a very technical sound too 3 drums are insane the but um like that's almost an undeniable fact about 311 whether or not you like them or not like Chad Sexton writes most of songs he's the drummer and writes most of their songs which tells you everything you need to know about it like he'll write the song on guitar so he's just a musician um but my I think the most technically sound drummer and like the drummer I like listening to really the most is Stewart Copeland from The Police he's **** insane um but you know I was drawn to Drums as a very young kid because I don't you know I I grew up in a household that was very musical my parents are very into music my you know my sister plays you know instruments stuff so or",
            "start": 1023.44
        },
        {
            "text": "to Drums as a very young kid because I don't you know I I grew up in a household that was very musical my parents are very into music my you know my sister plays you know instruments stuff so or she played you know the flute and all these kinds of things so like really random instruments they're real okay it's his sister for Christ's sake what we all said we're experts to the skin flute can't make one **** look at the camera I'll do what I want the same sister that called us not only an hour ago to congratulate us on everything looking good I want you to know that so how bad do you feel now Miller you're the dirtiest one in the group I don't need to hear I don't need anything from you you sc umbag oh Jesus Christ I the dirtiest the one the only the one thing I wanted to say was that I I was drawn to drums and then I developed really bad habits playing drums early and I played open-handed and St that which is **** stupid and you like you like where you don't cross your arms like",
            "start": 1065.28
        },
        {
            "text": "I was drawn to drums and then I developed really bad habits playing drums early and I played open-handed and St that which is **** stupid and you like you like where you don't cross your arms like it's just you play so if you're playing so if you're playing like you know uh you're playing a right-handed kit with your high hat next to your snare and then you're snare and your seen there's some people that still play like that in bands and stuff but I it doesn't make any sense it's just technically on sound so like when I started playing really playing around in fourth and fifth grade with drums I'd play you know like dot dot dot dot you know like with my hands like that backward and and really I should have been playing a left-handed kit but I'm dominant like I I use both of my I'm pretty ambidextrous but I probably should have been playing left-handed all along but by the time I took lessons so like Muse's drummer for instance is a lefty so his high Hat's here and his snare is here",
            "start": 1100.88
        },
        {
            "text": "ambidextrous but I probably should have been playing left-handed all along but by the time I took lessons so like Muse's drummer for instance is a lefty so his high Hat's here and his snare is here and and he would and he would cross over like that but when I started taking lessons like a couple years later I broke like my teacher like broke me of those habits immediately M and he want you know you can hold your stick like kind of sideways like they would yeah but I I don't that doesn't make any sense to me either so see a I don't think a lot of rock people do that though no all jazz drummers play like that that's more of a it's more because you're like measuring on the like your stick on the snare a lot more with like ghost notes and stuff you just need to have like a different grip but like so I started playing like that but I guess I'm saying that because and then I started playing my rudiments and I'm really pretty good at playing snare too just like you know marching give me a",
            "start": 1141.0
        },
        {
            "text": "like so I started playing like that but I guess I'm saying that because and then I started playing my rudiments and I'm really pretty good at playing snare too just like you know marching give me a parad right now A parad you I'll give you actually I was kidding out more about this with uh no with Christian the same guy where I was like I have to look he's like he found my old drum pad mhm that I left like at his house did you have one of the octagonal drum pads that you flip over it was one surface and other surface you flip it over it's like harder yeah like one side was hard rub the other was like really soft rubber yeah one was like a Remo like white head that you could like bounce and the other one was like a soft like black rubber like this that was like that was flimsy and I was like he was like do you he's like start working on your rudiments and I'm like I don't remember any of my rents you know parad was like right it's so that was it's like it's it's trans like par I think",
            "start": 1174.16
        },
        {
            "text": "he was like do you he's like start working on your rudiments and I'm like I don't remember any of my rents you know parad was like right it's so that was it's like it's it's trans like par I think it's that yeah what is what is the one where it's it's I don't remember I haven't done any of my Rin since like nth grade uh people out there that are Dr that are like well I mean it was like like your flamacue and **** like that I'm like whatever I took those lessons and I did all those things but then I I really got into playing my kit and took lessons on my kit and I I I think I've told a story about how my drum teacher in high school when I started playing when I started taking kit lessons was obsessed with Billy Joel which is no surprise so because and and Billy Joel's not hard to play on drums it's just very it's a it's a metronome way of playing drums you know like ju it just doesn't get so it's it's a fun way to just learn Rhythm which people don't have a lot of drummers have a",
            "start": 1210.28
        },
        {
            "text": "on drums it's just very it's a it's a metronome way of playing drums you know like ju it just doesn't get so it's it's a fun way to just learn Rhythm which people don't have a lot of drummers have a hard time playing live for instance they play Everything fast which is why when you see a lot of live shows everything's played like super fast like Green Day for instance Trey Cool is like one of my heroes I actually got to meet him and talk to him when was awesome when I was an adult and but like he plays fast yeah you know and that's just because you're excited whatever so like playing slow soft easy **** is a good way to learn Rhythm and like to not jump ahead um but I just brought that up because when I was in high school my friends you know play guitar on bass and I'm like I want to learn how to play guitar and bass and I started teaching myself how to play and I play bass pretty pretty Prof like not not like Ramone plays bass but I can play it and guitar I'm like okay with there's",
            "start": 1248.24
        },
        {
            "text": "how to play guitar and bass and I started teaching myself how to play and I play bass pretty pretty Prof like not not like Ramone plays bass but I can play it and guitar I'm like okay with there's pict there's videos of Greg and I playing like singing songs where I'm playing guitar but I taught myself terrible habits that I can never break now like I started playing guitar when I was 14 and I'm 30 now and I I don't use my middle finger on the fretboard that's and that's like and that's how do you do that how do you do these because the the thing I learned like I was learning how to play bar I was learning how to play bar CHS first just this so I i'I'd play 311 if you're playing you know you hold you know down you know is just holding the the you know the low E string down at the three and then holding the other two down with you know my ring finger even though that's not the way you're supposed to play it two apart so it's like d and then I just learned how to play my bar chords like",
            "start": 1285.6
        },
        {
            "text": "then holding the other two down with you know my ring finger even though that's not the way you're supposed to play it two apart so it's like d and then I just learned how to play my bar chords like that and I cannot use my middle finger and then that transferred over to Bas and that's a really bad instrument to not use your middle finger on because if you want to have like any proficiency at all playing anything other than like you know Fallout Boy or something like that which is like just easy like that's like that's easy to play you can use one finger to play that but if you want to so I say that just because if you want to learn how to play those instruments you want to learn how to play drums like I even developed bad habits on drums that were broken because I was young and I was a novice still take lessons oh yeah like that's the one thing I tell people is well find a good instructor too yeah but but there like I always I'm always fascinated in 311 which people give ****",
            "start": 1327.44
        },
        {
            "text": "a novice still take lessons oh yeah like that's the one thing I tell people is well find a good instructor too yeah but but there like I always I'm always fascinated in 311 which people give **** obviously too but they're all great musicians and they all still take lessons like they and they talk about all the time about how like they the guy you know they've been playing instruments for 30 years and they still take bass lessons and guitar lessons and stuff to learn new things to learn new techniques to solidify things that they're not good at to work on their finger movement or whatever it is to work on your rudiments or your roles or anything like that if you're playing drums so I always encourage people like regardless of the instrument you're into like don't teach yourself how to play it's not a good idea more often than not like Ramone taught himself how to play guitar but Ramone's like kind of like a like he's he's he's a saon an instrument like where he can pick up a banjo",
            "start": 1360.24
        },
        {
            "text": "play it's not a good idea more often than not like Ramone taught himself how to play guitar but Ramone's like kind of like a like he's he's he's a savant an instrument like where he can pick up a banjo and play it he can pick up you know a bass and a guitar and play it he can play a stand base he can play and he never talk any lessons ever you know he's and he's also way better than almost anyone I ever met well but I mean that's a one in a million kind of your level of motivation dictates how good you're going to get at anything right it doesn't matter I I case in point I took lessons at Trumpet I hated my instructor so that actually drove me to not progress because I was like I don't want to practice screw this guy and so I taught I learned everything I needed to learn just by being in band class and having the instructor do like the one like not a one-on-one instruction but just basically like uh telling us as we were go cuz you know you're in band class like fifth grade there's like",
            "start": 1393.72
        },
        {
            "text": "class and having the instructor do like the one like not a one-on-one instruction but just basically like uh telling us as we were go cuz you know you're in band class like fifth grade there's like five people in band class and so you're basically getting private lessons but yeah I mean the people that that I know that still play today and excelled at at the instrument were the guys that like they picked it up they decided they love it immediately got into with a good instructor who could encourage them the right way cuz a lot of these a lot of these instructors too are just like guys that you know they didn't really make it as a musician and they kind of want to just **** beat you down right and they're like it's like tough love but I'm like but dude I'm in seventh grade like I don't know how I'm supposed to think or what I if I even want to do this for the rest of my life can't you be like nice to me and like be encouraging and like understanding um but yeah so I had I had a bad",
            "start": 1430.88
        },
        {
            "text": "know how I'm supposed to think or what I if I even want to do this for the rest of my life can't you be like nice to me and like be encouraging and like understanding um but yeah so I had I had a bad instructor I ended up not taking lessons I I did it for like six months and I was like I I don't want to do this anymore and it really put me off from even considering that as a career plus I kind of knew I never just I never had it yeah I got I mean I got stubborn with drums too where like I felt like I was a very good drummer by the time I was in high school like mid to late in high school where I was like I don't want to take lessons anymore either and I got better on my own but I wish that I stuck with lessons because I was actually learning thing like cuz my one the one thing that no matter how good I am at playing drums is is that I struggle a lot with double bass and with a double bass pedal oh everyone does though well no but but I shouldn't because I have great foot movies with",
            "start": 1465.44
        },
        {
            "text": "how good I am at playing drums is is that I struggle a lot with double bass and with a double bass pedal oh everyone does though well no but but I shouldn't because I have great foot movies with my high hat so if you're playing like the ride symbol over here you don't have to worry about the high but you should still keep it probably going for rhythm and that's not a problem for me and I'm playing my base independently double base should actually be easier to play than that because it's really just alternating but and I can play I can can play a double bass probably at like like 64th notes maybe Jesus like like for a few seconds yeah you know but like by the time you're getting into like 1 8 notes and like think about like one like Metallica One like like that's **** awesome and like he's rolling on the bass it's not it's not only like playing like he's rolling you know and too much it's I was like **** like if I just stuck with it I would have been technically better where I can",
            "start": 1502.88
        },
        {
            "text": "rolling on the bass it's not it's not only like playing like he's rolling you know and too much it's I was like **** like if I just stuck with it I would have been technically better where I can I could never play Metallica song you know so I play like more hard and ALT rock or whatever so I just want to encourage people out there like don't get discouraged like play your instruments and really take lessons and take them seriously and when you be and if you're 16 like I was and you're like I'm not I'm I'm I'm going to be the next **** you know Neil Pert I don't need any more lessons I'm like you always can learn something and and I ended up meteor out at something above average because you know I can sit behind a drum set and still play it today but I really wish that I I took it more seriously so I just want to encourage it's true like cuz I love music and I listen to it every day and I've always loved to play the drums and I always **** around with the basic guitar and become",
            "start": 1544.68
        },
        {
            "text": "seriously so I just want to encourage it's true like cuz I love music and I listen to it every day and I've always loved to play the drums and I always **** around with the basic guitar and become good at it but man it it was like you were saying like when you're a kid you don't know any better or you don't know but like music's so important and and and it's good to take it seriously and and learn from people that can teach you and you never you're never too good to learn and I was St I became stubborn playing drums to where I be you know I was I was good but I could have been I could have been great I could have been awesome and it was all because and there's like huge deficiencies in my drum game because of it you know like where yeah I'm sorry continue no so I just I know how I I just want to talk to people out there they're taking it you know you know maybe you don't have the the right teacher anything like that but shake those bad habits because I wish I just took people's",
            "start": 1580.36
        },
        {
            "text": "just want to talk to people out there they're taking it you know you know maybe you don't have the the right teacher anything like that but shake those bad habits because I wish I just took people's advice when I was in college and I like just take guitar lessons and and now I will never be able to play the guitar with my middle finger you know like and I can play things fine and I have I have good movement but you have to you do have to start over you have to start over and like after 15 years of playing the guitar half right you can't it's just not you can't teach an old dog new tricks with bass it's a little different I play bass with a pick and I play a four string bass so it's a little more manageable umh but you know I see someone like Ramon work a base and it's like I'll never ever ever ever play that well you know here can play like that his you know that bass line from Muse's Hysteria that we were talking about like he just like plays out without even like thinking about it",
            "start": 1615.52
        },
        {
            "text": "ever ever play that well you know here can play like that his you know that bass line from Muse's Hysteria that we were talking about like he just like plays out without even like thinking about it like I have to like really I have to like really think to play because I didn't have I don't have that that that novice approach that you needed I I just jumped in and looked up Tabler which is probably the worst thing that ever happened to any musician and you know tab reading tabs is fun and it's easy but it it you need to read music and you need to like learn how to play the instruments properly if tab wasn't available for me playing on guitar on bass and for people that don't know tab do you guys know what tab is nope tab is a way to play guitar on bass where instead of reading the music because I could read music as a drummer drum music is you know there's there's a line for snare and a line for Bass and it's but it's it's manageable and I don't remember how to read it anymore but that",
            "start": 1651.48
        },
        {
            "text": "I could read music as a drummer drum music is you know there's there's a line for snare and a line for Bass and it's but it's it's manageable and I don't remember how to read it anymore but that that's how I learned how to play with with guitar and bass you can play tab which is there's it's it's asky it's six strings written with dashes and then it just has numbers on it and so it'll be like low E string 11 one1    11 and all that means is that you hold the first fret and that's how you play one one but like that teaches you bad habits because then you're like I can play anything and then you just start looking up things and your finger movement's all **** up and you're just trying to figure out how to play things that you're not supposed to play that and then it becomes impossible to site read too like so you like you get when you get a real Musical sheet in front of you that should look like chaos you can't your brain can't decipher it cuz you just get used to seeing it the other",
            "start": 1692.68
        },
        {
            "text": "read too like so you like you get when you get a real Musical sheet in front of you that should look like chaos you can't your brain can't decipher it cuz you just get used to seeing it the other way yeah so I wish that I was a little more patient and a little more procedural in how way I learned those instruments because I can play guitar and we can **** around I can play John Mary with Greg and it's fun or I can play Filter with Greg and it's fun but I'm not holding it right when I looked up how to play Filter I'm playing it totally different than they play it like the way they hold their finger I watch it I watch a lesson of that of that song given by the guy who wrote and plays the song on that b in that band and he's holding everything totally different than I am and I'm like I would I don't know how to even play like that you know that's but that's another reason why like you never that These Guys these top Pros never stop taking lessons too is because you find someone you",
            "start": 1733.04
        },
        {
            "text": "would I don't know how to even play like that you know that's but that's another reason why like you never that These Guys these top Pros never stop taking lessons too is because you find someone you trust it's not about them necessarily teaching you something you don't know it's about them checking back in with you similar to to how people do when they work out and having a trainer go hey you're developing this really weird habit that you should stop doing right now or like Hey try it this way or like you know especially with with vocal coaches they check in with you and they make sure that you're you're you're not straining your vocal cords because you can develop nodes uh that you have then have like famously Adele had to have surgery because she was her the way she sings just your vocal cords rub together and they get little calluses on it plot point in Pitch Perfect one yep there you go who can forget there you go that was it she oh I can sing bass and like that's really weird",
            "start": 1765.4
        },
        {
            "text": "cords rub together and they get little calluses on it plot point in Pitch Perfect one yep there you go who can forget there you go that was it she oh I can sing bass and like that's really weird that was the that was the missing key that's all I needed yeah I took piano lessons until Prince of Persia: Sands of Time came out on PS2 and I was like I'm not going back but that means you probably didn't also love music you know no I did it as like a promise to myself when a friend died and so then like I did it for a while and then it was just like I mean I don't love music it's good exactly if it does that's the thing I'm trying to say if it doesn't speak to you then don't don't play but if you want to become better and you really care about it like do it the right way because I I guess that's why I was curious about like so we have vocals we have piano and skin flute if I remember correctly that was Nick I remember it was Greg's but it's funny is that the instrument that I would really",
            "start": 1802.56
        },
        {
            "text": "why I was curious about like so we have vocals we have piano and skin flute if I remember correctly that was Nick I remember it was Greg's but it's funny is that the instrument that I would really want to take lessons with the most is drums and I play drums yeah but I want I want to like I play drums since I was a little kid and I'm good at them but I want to become better I want to I want like I want to get over that that you know I want to be able to sit down and play One On by Metallica and like really **** play that machine gun **** Basse drum you know what I mean if we're talking lessons I would I would probably take vocal lessons then I don't have any desire to go back to trumpet largely because you just like it's it's so **** hard to practice that in a big city where you're surrounded by people you'd have to get you'd have to get a rehearsal space think about every time Mama Number Five came on you'd **** kill it did you listen to a lot of SCA when you were a kid like I",
            "start": 1838.84
        },
        {
            "text": "by people you'd have to get you'd have to get a rehearsal space think about every time Mama Number Five came on you'd **** kill it did you listen to a lot of SCA when you were a kid like I didn't listen to a ton of SCA like I I was in high school when um the sca movement hit the B not bossones um mighty mighty bossones yeah but they were I guess they were Scot no who's the one skeleton uh Real Big Fish Real Big Fish yeah I I went through that whole movement I was playing Trum back then I wasn't a huge fan of that I loved guys like Arturo Sandoval I loved guys like Perez Prado guys that just like treated that instrument like it was a like a **** Precision weapon you know that could just and I loved any band that the trumpet was the the uh the lead instrument in and so you go back and listen to you listen like Arturo sand like am SOS or any of those songs that he played and you're just like this guy's singing through this and then he's screaming through it and it's amazing like the",
            "start": 1878.6
        },
        {
            "text": "to you listen like Arturo sand like am SOS or any of those songs that he played and you're just like this guy's singing through this and then he's screaming through it and it's amazing like the power that you can get because you just can't get that same power in that sound and I don't want to start this debate um and I don't want people to think that I'm in any way sh form talking **** about Woodwinds but they're the inferior instrument 100% brass is all is the way to go **** shots 100% you don't want to don't say that to Curran Curran the old flute player I think I've told the story before of him the condensed version of this story he beat the hell out of somebody beat the **** out someone with a flute a trombone player so I'll tell you one thing right now in the history of marching band no FL flist has ever beat someone who plays the trumpet ever Trump trumpet great I'm always fascinated by the trumbone and the trumpet always fascinated me because trumbone in its own way where",
            "start": 1923.96
        },
        {
            "text": "band no FL flist has ever beat someone who plays the trumpet ever Trump trumpet great I'm always fascinated by the trumbone and the trumpet always fascinated me because trumbone in its own way where you the note was in the art of where it was held right corre but trumpet always really fascinated me because there's really only four things you can do and it's the per so it's like the open note and then three buttons and then the permutation of all of it and that's like that was what was so I was like damn like CU I would **** around with my friend's trumpet I be like this is such a dynamic instrument for something that looks so easy you know like you I look at it I'm like yeah there can't be anything hard about playing this and then I'd play and I'll be like I just held one button down it's like you're not breathing right through it you know and then you play like and it's like it's it's it's comp like woodwind is hard too but but brass instruments they're all hard like I couldn't play",
            "start": 1959.8
        },
        {
            "text": "like you're not breathing right through it you know and then you play like and it's like it's it's it's comp like woodwind is hard too but but brass instruments they're all hard like I couldn't play any of those things at all I remember **** around my sister's flute and being like I I have no idea how the **** you even play this thing you know like like blowing across that **** I could never do it my friends would give me their fluts and I to this day have never successfully hit a note on a flute it's it really I mean it is because you have to develop those muscles in your in your mouth and in your lips like you just and that sounds dirty but you have to when you first start playing trumpet it doesn't make sense to be fair they couldn't play trumpet either how that buzz yeah like getting the buzz and getting the the air through your lips to the point where if it's just a little degree up or a little degree down you're getting different octaves and you're getting different notes",
            "start": 2004.36
        },
        {
            "text": "the buzz and getting the the air through your lips to the point where if it's just a little degree up or a little degree down you're getting different octaves and you're getting different notes it's crazy it's it's it's awesome though but it's like anything else you the feel for you practice it over years I I could pick it up right now it wouldn't be nearly as good as I used to be but I wasn't that great anyway but I could play some of the stuff and that's the other thing too is that muscle memory of you're talking about the fingers I could probably without thinking if I thought about it I wouldn't be able to do it but if I put the trumpet to my lips and started playing I bet I could play the like some of the Marchers I used to play back in March matter in the field shows I used to play easily cuz you play it so many **** times yeah I got Ukrainian Bell Carol on lock that yeah well you're a psychopath staying outside girl houses playing that one part over and over again you creep so",
            "start": 2038.28
        },
        {
            "text": "cuz you play it so many **** times yeah I got Ukrainian Bell Carol on lock that yeah well you're a psychopath staying outside girl houses playing that one part over and over again you creep so take lessons and learn from people that know more than you and you will be better for it unless you are Ramone and you just are a savant **** Ramone it's true remember when we were we were at that house in Kentucky and there was like a banjo there start playing it I'm like you he's like you ever played the ban before I like no it's just a Backwater gu in that in that regard like I can I can kind of get that because if I were to pick up uh like a flugal horn any I could pick up probably any of the brass instruments and sort of Play It uh yeah I could play I could pick up a baron oh Barone's easy because baritone is a it's trumpet it's just a you different way no I'm think well I'm thinking of the marching Barone which is like it's giant trumpet um which one's the bar oh Barone is this yeah I",
            "start": 2068.6
        },
        {
            "text": "because baritone is a it's trumpet it's just a you different way no I'm think well I'm thinking of the marching Barone which is like it's giant trumpet um which one's the bar oh Barone is this yeah I used to play Barone like you could play the only hard part about that was you have trouble so I'd have to have all my I'd have to have all of my music um to noted down or whatever I would have to transcribe it up to up to uh I'm sorry you have to read Bas CL I would I would transpose up to Trel CL cuz I can never figure that out I just never put the time in I like I **** I wish I took drums earlier though the only reason I played saxophone at all was because my friend Chris was playing sax his name was Chris Hansen and he was you knew Chris Hansen back different Chris Hansen but he played sax so I played sax I'm like I should have taken snare from this early age because I played Sachs for like half a year and I'm like I don't want to **** play this thing yeah that's I play yeah I",
            "start": 2114.32
        },
        {
            "text": "sax so I played sax I'm like I should have taken snare from this early age because I played Sachs for like half a year and I'm like I don't want to **** play this thing yeah that's I play yeah I played Al of Sachs back in school man Junior High man Sachs I always I was I'm glad I never played Sachs just because I did so much marching band that like the trumpet one trumpet can stand out in a marching band way more than any woodwi instrument can because they just cannot produce the same volume of sound that a brass instrument can produce especially a brass instrument that that uh the frequency comes out that high of a of a level so I'm glad I play Trump I love trumpet and in a marching band trumpet is like the lead instrument so it was amazing nice",
            "start": 2148.44
        }
    ]
}