{
  "id": 899,
  "video_id": "IeghaGdJkDI",
  "show_name": "Gameplay",
  "hosts": ["Colin Moriarty"],
  "title": "Colin Plays Castlevania III: Dracula's Curse - Kinda Funny Plays",
  "description": "Can Colin beat Castlevania in one sitting? Let's find out!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1433358000,
  "duration": 2871,
  "transcript_chunks": [
    {
      "text": "Greetings and salutations, welcome to Kinda Funny game, specifically a let's play, specifically a solo let's play by me, Colin Moriarity. There's a game I often reference, it's called Castlevania III. It's one of my very favorite games of all time and certainly one of the NES's best games. And I know a lot of our younger viewers and maybe just viewers that didn't have an NES or access to an NES when they were younger aren't familiar with this game and how **** good it is. Um, so I wanted to uh show it off to you guys. I'm going to play for a little while. We'll see how long I go. It's going to be a longer than usual let's play, but I don't think I'm going to go to the very end cuz the game is very long. Um, so we're going to read here. First of all, the music, just listen to the music. Oh, it's so good. When this game came out in 1989 on Famicom in Japan, it actually had a special chip in it that enhanced the music. So this music that you're hearing here is the North American version and it's not even as",
      "start": 0.04
    },
    {
      "text": "this game came out in 1989 on Famicom in Japan, it actually had a special chip in it that enhanced the music. So this music that you're hearing here is the North American version and it's not even as good as it it sounded on the Famicom game came out on NES in 1990 over in Europe, uh in 1991. Um, so uh it's a great game. It's a prequel to The Original Castlevania. Of course, Castlevania and Castlevania II kind of take place one after the other. Castlevania happens and then Simon Belmont comes back, revives Dracula and kills him again in Castlevania II. Castlevania III is about Trevor Belmont, who's Simon Belmont's father. Um, and you read the story here. Um, and just really a really good example of Storytelling in the NES era. Um, some really beautiful pixel art, um, and a pretty deep story and I love this. I love this picture of the castle here especially with um with Trevor kind of on a Hilltop overlooking the castle as he goes in. Um, so let's let the uh the the rest of the intro play and then we will uh get",
      "start": 30.72
    },
    {
      "text": "this picture of the castle here especially with um with Trevor kind of on a Hilltop overlooking the castle as he goes in. Um, so let's let the uh the the rest of the intro play and then we will uh get into the game itself. Let's enjoy that music for a minute. All right, I'm going to hit start and we're going to go in. So I'll put my name in this column. You can actually put in some different names here to get some extras if you want, but I'm not going to do that. I love this intro of course praying before the cross before he picks up his Whip and gets going. So as was common in the NES era, whether we're talking about Mario or Zelda, Castlevania II was very different than the original Castlevania and Castlevania III brings it back to what Castlevania was like to begin with. Um, but like the third game in those other series really enhances things and becomes really the best in the series or at least in those original NES trilogies. So what we have here in Castlevania III is a very",
      "start": 78.44
    },
    {
      "text": "like the third game in those other series really enhances things and becomes really the best in the series or at least in those original NES trilogies. So what we have here in Castlevania III is a very long and very nonlinear game and that really does borrow from Simon's Quest, which is Castlevania II, but not in very literal ways. So it's not like a role playing game like uh Castlevania II was. So it's not there's no experience points and and all these kinds of things things that you find, but there are nonlinear paths in the game that you take very often and there are characters you find that you can play as in lie of or in addition to playing as Trevor. So right now we're kind of uh working our way through a village on the outskirts of the castle. You actually don't get the Dracula's castle until about halfway through the game, which is one of the cool things about it too. You're basically exploring the countryside surrounding the castle first and here we're kind of in a village. I think it's",
      "start": 136.96
    },
    {
      "text": "about halfway through the game, which is one of the cool things about it too. You're basically exploring the countryside surrounding the castle first and here we're kind of in a village. I think it's called Waria or Wakia Village if I remember correctly. So we're climbing our way through a church with some beautiful stained glass pixel art is absolutely stunning in this game. So as you can see Trevor and Simon look pretty indis indistinguishable from one another and we getting a little more of the lore of um the game in terms of well who's who's Simon's mother? Could it be a character that you meet later in this game that we'll probably encounter called Cipha possible. So we're cruising these platforms here turn upside down and that will become more much more challenging later on. Medusa heads of course make a comeback frustrating as ever and they're of course placed here to make you jump on these things and lose your footing which is no good. You don't want to do that like",
      "start": 172.68
    },
    {
      "text": "heads of course make a comeback frustrating as ever and they're of course placed here to make you jump on these things and lose your footing which is no good. You don't want to do that like that we're cruising. Oh, this music is so **** good. You hear it, Kevin? No. Oh, it's so good. The soundtrack to this game is just unbelievable. Now here we see some pretty awesome sites. I mean this is where this is where Konami's beautiful pixel art really comes into play. I mean look at the backgrounds here. Look at this look how how good it looks just stunning. You're really just walking through a village. You can feel it. It's very atmospheric. This game is extremely atmospheric. I love it. Where is it? There it is. Meat uh wall meat of course we're going to need longtime Castlevania tradition come on these little Igor are annoying. Of course you remember these from the original Castlevania if you guys have been tuning into uh our let's play as I did a let's play of the original",
      "start": 232.12
    },
    {
      "text": "come on these little Igor are annoying. Of course you remember these from the original Castlevania if you guys have been tuning into uh our let's play as I did a let's play of the original Castlevania some months ago and we met those guys when we were specifically fighting Frankenstein's monster in the fourth stage of the original Castlevania Game. We're getting pretty close to the boss on the first level now which kind of acclimates you the how to play Castlevania and this game is really really challenging at first. It's actually quite easy but um and I I I'm surprised I've actually been hit at all. I'm a little rusty so I do apologize about that but um this game is extraordinarily difficult later on especially depending on the path you take CU you'll find out as I I mentioned earlier many different paths to think we don't want that the dagger is the worst the holy water still rain Supreme what am I doing all right here we are that's the end of him grab this real",
      "start": 302.52
    },
    {
      "text": "many different paths to think we don't want that the dagger is the worst the holy water still rain Supreme what am I doing all right here we are that's the end of him grab this real quick see we can grab this all right so that's the end of the first stage Castlevania III rack up points as we do and move on and this is where we're going to get our first choice about where we're going to want to go. We can go to the woods, we can go to the Clock Tower and here we're going to go to the clock tower because there we're going to find a pirate character named Grant that uses a dagger um and he's uh not very useful in the game but we'll have him uh anyway plus the stage is just much cooler than the far stage but we'll have him in our party for the time being and he can cling to walls and all sort of things plus the clock tower music is classic Castlevania music. So one of the cool things about this stage that you'll learn is that and it's it's a rarity in a Castlevania game is that",
      "start": 346.92
    },
    {
      "text": "all sort of things plus the clock tower music is classic Castlevania music. So one of the cool things about this stage that you'll learn is that and it's it's a rarity in a Castlevania game is that we are going to be backtracking out of this stage once we beat it which is not something you see really ever um in a Castlevania game or any NES game really um and you're going to work your way through it. So one of the cool things about this particular stage is that it's designed to be played both forward and backwards as it were um and it's it's a clever it's a cleverly designed stage um in that respect and you're going to find out why in a little while and you're going to see some things too that seem to be totally Out Of Reach no matter what you do and that's because you can get some of these things including an extra life with Grant a little later so we'll show you that and actually getting out of here is like kind of difficult definitely way harder than climbing holy water there we go",
      "start": 413.16
    },
    {
      "text": "things including an extra life with Grant a little later so we'll show you that and actually getting out of here is like kind of difficult definitely way harder than climbing holy water there we go that's what we want we're cruising these uh Knights that take two hits you'll remember from uh the second stage in the original Castlevania. So what's cool is that a lot of enemies that did not make a comeback in Castlevania II because that had really a whole new array of enemies um at your disposal make a comeback in Castlevania III and when you think about in terms of the timeline which is even cooler um Trevor was fighting these enemies before even Simon did so a little kind of rudimentary platforming here uh not as difficult as it probably looks here is another impressive example of uh animation and pixel work in backgrounds look at this background look how awesome it is very very pretty door jumping this looks like it would move you but it doesn't just some pretty",
      "start": 451.64
    },
    {
      "text": "of uh animation and pixel work in backgrounds look at this background look how awesome it is very very pretty door jumping this looks like it would move you but it doesn't just some pretty animation this particular platform we're going to kill that skeleton Knight and climb up to the the next section and here the Medusa heads make themselves known and they're a pain in the ass as always so you just have to kind of be careful and not maneuver them if you can there are enemies later on like so the Medusa heads are always on a fixed trajectory they introduce themselves and they never like that was close they never uh waggle back and forth U but later on you run into these Dragon enemies with shields and towers that actually adjusts based on where you are and those guys are really annoying but Medusa heads are the bane of any Castlevania Fan's existence because they just they just show up at the worst possible moments and you know you're going to get hit by them like you can just",
      "start": 513.68
    },
    {
      "text": "but Medusa heads are the bane of any Castlevania Fan's existence because they just they just show up at the worst possible moments and you know you're going to get hit by them like you can just see that it's everything's lining up so here is one of the places I was talking about where we're going to use Grant later to knock those blocks up out up there and get an extra life if we want to so we're getting further up into uh the Clock Tower and there we got to make a careful jump before we fall here we'll get a two tablet the two tablet is super useful because now I can use two special weapons at once as long as I don't die um or at the end of the stage I probably lose it too um so I can use you know two holy waters for instance and that will be very useful against gramp oh God so the kickback the knock back in Castlevania is severe too as as a lot of fans know and so you need to be that's why the medusas are so annoying is because not cuz they'll hit you and take and you'll take",
      "start": 571.64
    },
    {
      "text": "kickback the knock back in Castlevania is severe too as as a lot of fans know and so you need to be that's why the medusas are so annoying is because not cuz they'll hit you and take and you'll take damage cuz that's really not relevant it's that they'll knock you in the pits and spikes because they're **** annoying so you just got to kind of be careful holy water is actually useful against them if you can plant it properly because the flame stays around for a while o I almost ran into that dagger I don't want that no one wants that all right oh God there we go and sometimes the best course of action as you saw there is to run head first into the Medusa head if you know you're going to get hit because you don't want to get knocked back so we'll climb out of Dodge here and we're basically almost to the boss now uh we'll grab a few odds and ends here including uh some health and here we'll launch that and that should take care of him the heart that he dropped gra a few more Hearts",
      "start": 616.4
    },
    {
      "text": "almost to the boss now uh we'll grab a few odds and ends here including uh some health and here we'll launch that and that should take care of him the heart that he dropped gra a few more Hearts which will and of course the heart a currency uh not money but uh to be used um yeah so see that should be the end of that killed him in about 1 and 1/2 seconds we grab his little orb now here's where the game gets interesting and no one really knew that this was kind of happening if you went into this game blind Grant's been possessed by Dracula's curse the subtitle of the game turns back into a human and we're able to recruit him if we want him he says my name is Grant I dreamed I was turned into a ghost please take me with you my family was killed by Dracula what will you do so you don't have a second choice you either take him or leave him behind you should definitely take him when you run into other characters that are way more useful than him there are two other characters I",
      "start": 657.64
    },
    {
      "text": "don't have a second choice you either take him or leave him behind you should definitely take him when you run into other characters that are way more useful than him there are two other characters I won't spoil like much about them right now um you can always just get rid of him Grant takes a lot of damage and he's not super useful but he can cling to wall like the ceilings which makes him quite useful so to switch between enemies um as we work our way back down you're going to see here it's going to go back to the map and we're just going to kind of go back down as the clock tower crumbles excuse me you press select and now you can use Grant if you want and as you can see here if you press up and then over you can use him upside down like that but Grant makes me nervous I like using uh Trevor he's a little more steadfast and we'll start climbing back down and this is where the clock tower gets really hairy I miss a that one oh God all right so we'll keep climbing just get",
      "start": 713.6
    },
    {
      "text": "Trevor he's a little more steadfast and we'll start climbing back down and this is where the clock tower gets really hairy I miss a that one oh God all right so we'll keep climbing just get the hell out of here before things get too crazy so here we actually have to go back I'm going to duck out oh jeez taking a lot of damage oh I misjudged that one you have to jump actually off of this one sorry it's been a while actually we'll kill these candles cuz I need uh the whip upgrades if you haven't uh played Castle before basically uh like one of the classic Castlevania you start with like a very weak Whip and you have to get two upgrades that you get almost immediately to make your whip into the full like Morning Star Style whip um so we'll use that to our advantage here um and we can actually now that we died uh go back in here and just grab Health if we want to so I'm sorry I died there hopefully I don't die again on this stage I'll probably die again in a little while we'll",
      "start": 759.32
    },
    {
      "text": "can actually now that we died uh go back in here and just grab Health if we want to so I'm sorry I died there hopefully I don't die again on this stage I'll probably die again in a little while we'll little L of practice all right so we can actually just drop down here and then do that get out of that guy's way and just kind of keep moving this guy go through jump and start climbing down there's just it looks like you can drop in a lot of places but you really can't and you don't want to risk it so here's where I died before because I didn't jump and there we go okay so he can hit you on the stairs it's not going to knock you off that guy hit me right in the face all right so we're moving we're cruising we're going to jump this way jump up here grab the dagger since we have no weapons grab the two block again and then we're going to start kind of moving in a counterclockwise Direction now here's where I told you that we can use Grant before so if we press uh select on this specific",
      "start": 818.48
    },
    {
      "text": "the two block again and then we're going to start kind of moving in a counterclockwise Direction now here's where I told you that we can use Grant before so if we press uh select on this specific area we can cling to the wall by pressing a and then up and since we lost um since we lost some health before um this will or life rather this will be useful grab the one up and then drop back down and then immediately switch back to Trevor because Grant is just another unw ieldy character that I can use so now we're scrolling down some more and there's another Tower this is basically the last of the significant Towers in uh in the clock tower stage which you uh saw me go through before so we're going to climb we're going to be very careful we're going to do some jumping go down here and here's where I think and like I was saying before there's just a level of design here that's really clever that actually reminds me a great deal of Castlevania Symphony the Night in a much more limited",
      "start": 869.32
    },
    {
      "text": "where I think and like I was saying before there's just a level of design here that's really clever that actually reminds me a great deal of Castlevania Symphony the Night in a much more limited way where Symphony the Night's design can really be experienced and enjoyed in a in a unique way um because it's made to be played upside down and you don't realize that until you're halfway through the game um so here the stage is meant to be played backwards and I think that that's pretty cool too and so there's a little shortcuts like you just saw there that let you beat things quicker but things like this platforming get a little more technical a little more difficult going back but here we don't have to worry about that second pendulum at all we can just jump over the pit and start climbing back down um and we're almost home free here on this stage got another extra life for for getting enough points which is nice we're going to climb down carefully here kill these Knights that we first met",
      "start": 918.6
    },
    {
      "text": "down um and we're almost home free here on this stage got another extra life for for getting enough points which is nice we're going to climb down carefully here kill these Knights that we first met in Castlevania 1 grab the holy water the precious precious holy water and then climb down we're almost home free there's one last Tower here that we have to get through be very careful you don't want to rush no reason to rush keep climbing keep climbing keep climbing keep climbing Dodge these Medusa heads we can very good kill this guy he's in my way kill these guys get off those spikes those spikes will kill you by the way automatically uh so we're basically almost home free now we're just going to kill the skeleton get through these Medusa heads that were not here by the way the first time we played through and then that's it we're done with the Clock Tower so now we got out of the clock tower it's basically the third stage in the game since it's up and then down",
      "start": 957.36
    },
    {
      "text": "the first time we played through and then that's it we're done with the Clock Tower so now we got out of the clock tower it's basically the third stage in the game since it's up and then down that's two stages um and we have Grant in to so now we're going to go further into Castlevania III's Countryside as we kind of approach Dracula's castle awesome map by the way the countryside so now we're back here in the woods no choice of this next stage to go through these owls are annoying as hell uh boomerangs are good to use against them but we don't have one yet I think we can find one on the stage though holy water is like the least yeah here it is so we can use them like this and at least grab a few of them we can miss all them all right so wait for them to appear if we can get them on the way back there we go and again just awesome music see if we can get these guys to kind of heal a little bit for us duck out of the way let him go by the way these doors here in Castlevania",
      "start": 1023.48
    },
    {
      "text": "on the way back there we go and again just awesome music see if we can get these guys to kind of heal a little bit for us duck out of the way let him go by the way these doors here in Castlevania fashion you know this from Castlev ania 1 as well they're dead checkpoints essentially so these red uh what they call blood skeletons in Castle L don't actually die you just knock them out and then they come back after a few seconds you have to just kind of keep cruising and we'll let him go you don't want to trifle with those Igor as usual clim back down the stairs St here there's actually Health here grab it and we're cruising through this door and that's happening kind of automatically as we move to the next stage here and this music of course indicates that there's another choice to be made so we can either go up towards this area with the statues or down towards the bog that statue is actually another character and so we're going to go in that direction her name is",
      "start": 1075.36
    },
    {
      "text": "choice to be made so we can either go up towards this area with the statues or down towards the bog that statue is actually another character and so we're going to go in that direction her name is Cyphon and we're going to f we're going to fight a cycloptic enemy in order to free her and she unlikes unlike Grant who we're going to say goodbye to um oh this guy's annoying me um is actually quite useful although she's weak defensively she has powerful spells that only she can use so these guys when you destroy them turn these little things that you don't want to destroy as quickly as possibly these little pods we're killing these beastly type demonic enemies here here we're eventually going to have to make this jump we can actually just use that to start killing these guys a little quicker all right we're going to have to make a mo climb down these stairs that are kind of well hidden you can try to kind of lure this guy he's a little bit of annoyance but you can",
      "start": 1149.64
    },
    {
      "text": "guys a little quicker all right we're going to have to make a mo climb down these stairs that are kind of well hidden you can try to kind of lure this guy he's a little bit of annoyance but you can get him to turn around like that and then grab the dagger we don't really want that but it doesn't matter actually the dagger is somewhat useful against this particular enemy that we're going to fight in a little while but rule of them in Castlevania you really don't want the dagger kill him real quick I don't think there's anything there spiders are a little bit annoying so you want to get rid of them since they'll lach little spider projectiles at you o which knock you right into a hole like that that's why you got to be careful this to here Castle all right grab the the whip upgrade I think I we just got to the checkpoint like that they'll come back which is the worst so you want to maybe a little bit of that and then just keep kind of walking duck out of the way just get away",
      "start": 1205.72
    },
    {
      "text": "I think I we just got to the checkpoint like that they'll come back which is the worst so you want to maybe a little bit of that and then just keep kind of walking duck out of the way just get away from those holes the thing that kind of the Brilliance in the design of Castlevania III and just any Castlevania Game really these old style Castlevania games is just the placement of enemies near pits because the knockback is so predictable in these games um that you really don't want to play games all right so we're nearly to the boss and the Cy optic boss can be a bit of a pain but you would just have to know how to fight him now this block can be knocked out but we're not going to want to do anything like that we're going to want to stay here and again to come towards us now the lightning bolts in the background can be used um to cause massive damage if you can get the lightning to strike the enemy in his head um but the timing is a little rough and you just kind of want to stay",
      "start": 1252.76
    },
    {
      "text": "in the background can be used um to cause massive damage if you can get the lightning to strike the enemy in his head um but the timing is a little rough and you just kind of want to stay ducking yeah when the screen flashed like that that's like when you launch you can launch a dagger and actually do massive damage we're kind of just being patient here he's got only one more hit here and then we're going to meet the next character here Cyha so now we have the orb and the Cyclops is dead Cyh is going to break out of the statue behind Trevor now they spell Cipha here s yfa but Cipha is really in lore spelled S y p ha and in Mercury steam's lore which is kind of like a spin-off of real Castlevania Cipher and Trevor get married and Simon or Cipher is Simon's mom um so uh one of the other things is that it says take him with you or leave him behind and this indicated to a lot of people that cyer is actually a man but at the end of the game if you",
      "start": 1301.24
    },
    {
      "text": "Simon's mom um so uh one of the other things is that it says take him with you or leave him behind and this indicated to a lot of people that cyer is actually a man but at the end of the game if you beat the game with c ypo it is quite clear that uh it is not a man so they shake hands we say goodbye to Grant who's now on his own Grant slicks away and we have Cipher in the party now and I'm not too keen on Cipha either but um she's certainly more useful than Grant so here we're going to go on the pirate ship which is another famous Castlevania III stage with another awesome awesome awesome music and again it introduces you to a new platform type here which is these things and we'll see those kind of in play later again that jamming music here you want to get you know these Pirates by the way you see these guys in Symphony of the Night uh the enemies that hold their own heads kind of creepy launch see if we can get this guy with the back up a little bit it's not let me do",
      "start": 1391.28
    },
    {
      "text": "the way you see these guys in Symphony of the Night uh the enemies that hold their own heads kind of creepy launch see if we can get this guy with the back up a little bit it's not let me do it there we go so if we had Grant still we can actually go up there and grab that um that candle if we wanted to but we can't cuz we told Grant to go **** off these uh green style platforms here are going to crumble underneath uh Trevor's feet as you can see here they become weaker if you stand on them for a very long time they go away completely so you got to be very careful again introducing you to an element without being you know life or death quite yet here you'll see it though in in Action a little bit more so there so you just got to be kind of quick on those platforms kill these uh another another series of enemies that you find in many Castlevania games introduced in the original Castlevania get past the blood skeletons grab the health you don't you need it we really",
      "start": 1461.04
    },
    {
      "text": "these uh another another series of enemies that you find in many Castlevania games introduced in the original Castlevania get past the blood skeletons grab the health you don't you need it we really don't going to use it there all right so we'll grab the heart get the hell out of here this part of the stage is very reminiscent of a part of the second stage of Castlevania the original which you might remember played the game like almost a carbon copy of it actually get rid of that guy using our music is extraordinary this this soundtrack is extraordinary in case you can tell some typical platforming here just some platform you got to think a little bit about some moving platforms gotta be careful kind of got to jump on as soon as possible and get to the end before it's too late uh picked up a dagger huge mistake can be rectified a little later here we want to be quick that was close okay we'll kind of cruise through and kill this Apparition here the money bag",
      "start": 1538.28
    },
    {
      "text": "it's too late uh picked up a dagger huge mistake can be rectified a little later here we want to be quick that was close okay we'll kind of cruise through and kill this Apparition here the money bag grab this and that the other thing gra the heart and then go back up uh nearly the top side now we're going to fight another boss here which is Medusa you just want to beat her senseless basically no reason to play around with the Medusa she's dead and we're going to go to the second part of the castle or the I'm sorry the pirate ship use our dagger to kill these guys from afar Hearts now we're going to need to uh heal ourselves we're going to do that to the right in just a moment we kill that guy get out of the way and it should be food here that'll bring us to two in one bar of full health and being one bar off doesn't really matter at this point in the game everyone's doing about three damage to you anyway so as long as you have between uh you know at least if you're missing two",
      "start": 1620.88
    },
    {
      "text": "and being one bar off doesn't really matter at this point in the game everyone's doing about three damage to you anyway so as long as you have between uh you know at least if you're missing two or three or a two at this point doesn't really matter it's the same as if having a full health bar if that makes any sense so here's where those platforms from early on are going to come in where they tried to kind of train you how to use them so this is what you want to do here you want to just kind of use them as and we're to another checkpoint these birds are a pain in the ass so you kind of want to bait them out we met them back in the farest level so we're we're quite low on energy here so hopefully we're going to be okay this boss it's going to be a little bit tough ax will be good see yeah we do so here we're going to fight some familiar enemies and we should be good but we'll see what happens I can only get hit I actually once before I die so so these medusas",
      "start": 1712.2
    },
    {
      "text": "ax will be good see yeah we do so here we're going to fight some familiar enemies and we should be good but we'll see what happens I can only get hit I actually once before I die so so these medusas you'll remember from these are actually the these are actually some of the bosses from yeah I'm dead these are these medusas are actually uh bosses from the original Castlevania oh he knocked me right into bit that's great I got a there we go I'd rather him just run into me and get this guy to go off there we go as long we can get into that boss let's see if we can get to that boss with just a little bit more Health that we did last time we should be okay see what happens that guy flew right off it was quite serendipitous that guy we knocked right into grab the whip upgrade which will be very useful and then oh that was stupid all right and we'll grab the axe I wish I was going into this with just a little bit more Health cuz I'm a little bit out of practice here but I think we'll be okay",
      "start": 1790.64
    },
    {
      "text": "useful and then oh that was stupid all right and we'll grab the axe I wish I was going into this with just a little bit more Health cuz I'm a little bit out of practice here but I think we'll be okay money we don't really need that but here if we can just line them up so we can hit them both at the same time we can get rid of them in quick order so let's see what we can do it all right now the other guy that's going to come out I think is going to be the dude that we fought when we were going after scyon we're going to have to be a little more surgical here this should be the Cyclops enemy yeah so we're just going to need to be a little bit more Surgical we don't want to you don't want to get you don't want to get too far from him so that he just walks up and then you can duck and maybe get a hidden and then see get oh **** come on come on just got to kind of fight him kind of surgically like guess all right grab your Hammer my friend right just a little bit",
      "start": 1854.84
    },
    {
      "text": "duck and maybe get a hidden and then see get oh **** come on come on just got to kind of fight him kind of surgically like guess all right grab your Hammer my friend right just a little bit more one more hit should do it which we will deliver right here and that's it so those bosses are dead that was a little more strenuous than I thought it was going to be Kevin you did you thank you so we'll grab the orb and we'll keep on keeping on for now we go back to the map and the pirate ship's kind of moving along closer to the castle for us which is very convenient and now we're going to be going into a devious and Dangerous Power and this music's rad too so a red aesthetic very similar to this again the second stage in Castlevania some a lot of Throwbacks to that particular stage you're going to see some serious Throwbacks though in a little while the other stages from CIA so we want to just get a little bit closer and duck down kill these enemies",
      "start": 1927.24
    },
    {
      "text": "to that particular stage you're going to see some serious Throwbacks though in a little while the other stages from CIA so we want to just get a little bit closer and duck down kill these enemies can I get through and these were the shielded enemies I was talking about that actually change their trajectory based on where you are it's very precarious situation see they'll like Arc right into you so unlike the Medusa heads they're just a little smarter they're they're going to try in various parabas to get to you I just lost my last life so I'm going to have to continue from the beginning not the beginning of the game clean my glass up there a little bit my nose a little bit we'll see what we can do in the next couple lives and then we'll wrap it up and I'm sorry that I'm not playing you know a cleaner game but it's it's been quite some time see grab the dagger so we're climbing and we're climbing and we're climbing the idea is you just got to you just got to",
      "start": 2022.16
    },
    {
      "text": "you know a cleaner game but it's it's been quite some time see grab the dagger so we're climbing and we're climbing and we're climbing the idea is you just got to you just got to keep moving and it's better to get hit by these guys on staircases because they won't knock you off otherwise the throwback is obviously quite severe and quite significant as we saw when I just lost my last life you just kind of want to keep climbing those guys take them out real quick that was getting I was getting a little greedy there with that heart I shouldn't stay so here's the axe armor enemies that were introduced in um again the second stage of Castlevania um and became most prominent in the fifth stage of Castlevania which a lot of people consider including me the hardest of the six stages of the original Castlevania wall meat much needed wall meat as we get to the checkpoint here so these spark enemies can't be hurt but they can be stopped and you kind of have to time",
      "start": 2063.12
    },
    {
      "text": "stages of the original Castlevania, wall meat, much needed wall meat as we get to the checkpoint here. So these spark enemies can't be hurt, but they can be stopped and you kind of have to time your jumps between them like that. Um, if you hit them, they'll just kind of freeze in place for a minute. So they're kind of similar to the blood uh skeletons in that regard. So there's a funny story about this game that I've told some people um in the past on various podcasts and whatnot. My mom came home in late 1990 from shopping and uh actually was at a soccer game with my sister and she had this game in her hands as a present for me and I think she just bought it, you know, on a whim cuz she knew I love, you know, me and my brother loved Castlevania and I was like six or seven at the time and uh but from afar if people remember like old school Gamers remember Konami games all looked the same. The box art was silver, it had like the logo at the top and I thought it was Track and Field which",
      "start": 2135.48
    },
    {
      "text": "uh but from afar if people remember like old school Gamers remember Konami games all looked the same. The box art was silver, it had like the logo at the top and I thought it was Track and Field which was a game that I didn't want. Um I didn't say anything but I was like really disappointed for like 10 seconds and then my mom's like here I got you this game and I was like so stoked um because we were so we know we were such huge Castlevania fans in that in the Morard household um and remain to be to this day. So I remember I actually that's like actually a very early memory I remember that moment uh very well. So here we're actually going to try to get to the top of the uh the platforms. It's a dangerous place to be and again these things are positioned to make you jump which is bad. So you kind of just want to run get the **** out of here. You can stay on the bottom and get something out of the wall there but it's just not worth it just get to this checkpoint and be done with it here we're",
      "start": 2191.16
    },
    {
      "text": "of just want to run get the **** out of here. You can stay on the bottom and get something out of the wall there but it's just not worth it just get to this checkpoint and be done with it here we're going to run into another Axe Knight. We can use our daggers from afar to kind of weaken them if we want. They don't do much damage so it's going to take a little bit of effort. Every dagger is worth about a half of a whip it, not a whip it , a whip it and by the way I never switched to Sypha so just to show you I hit select um and I'm using Sypha now but I don't have any spells. She has a staff that's very weak as you can see here cool animation. She can get some fire spells and some pretty gnarly spells to use but she takes a lot of damage when she gets hit so she's a dangerous enemy to or dangerous character to use but um now this play this is what things get real hairy here real hairy real quick. You have to be very patient here so here the entire idea is to kind of time it which",
      "start": 2235.12
    },
    {
      "text": "character to use but um now this play this is what things get real hairy here real hairy real quick. You have to be very patient here so here the entire idea is to kind of time it which I didn't do very well and get out of there and things continue to progress dangerously just continue to climb. You want to get a little higher there wait for him to shoot his two and then quickly run and get in between those and then get in between those and you can see things are just getting real dangerous here now. So we continue to climb up we're almost home free but not quite these stupid **** Birds there we go grab some hearts. We don't really have a good weapon to use here we really could use an axe here be patient there it is. I love the turrets in the background the uh the look at the castle very cool or this Fortress really it's really not the castle itself so I think there's something in one of these I could be wrong is and here we're gonna be fighting our old Nemesis",
      "start": 2288.96
    },
    {
      "text": "at the castle very cool or this Fortress really it's really not the castle itself so I think there's something in one of these I could be wrong is and here we're gonna be fighting our old Nemesis Frankenstein and he reigns down with him a bunch of pain but unlike the original Castlevania game you don't have to just hit him in the head so you just really want to go hard on him there and he's dead and now we don't have to deal with him anymore but a nice Came o anyway that lasted about 6 seconds for our friend Frankenstein's monster and we move on to the next stage in Castlevania 3 we're going Kevin Kevin I'm going do it you get in there ain't no one going to stop me now someone's going to stop me at some point this is one of the really cool stages as we get closer to the castle this is kind of like the lead up to the castle now and things get pretty tough here all right so this water will actually push you around so you got to be pretty careful oh I didn't me to",
      "start": 2353.52
    },
    {
      "text": "of like the lead up to the castle now and things get pretty tough here all right so this water will actually push you around so you got to be pretty careful oh I didn't me to do that you can see the little Shadows there that are actually fishmen if you let them come up you don't want to let them come up because they can shoot projectiles oh holy water is quite useful when we get to this transition point the water will start to actually push me instead of pull me shoot at me there we'll just duck under it and going let him shoot getting a little bit closer now here underneath of course if we had Grant we can get down there there's probably an extra life in there or maybe some food we hit a checkpoint so we're through into the next area more ax knits to deal with one two three jump one two three perfect continue to cruise on that bat you got to keep going to get get away from that bat we'll let him shoot some more and then we'll get",
      "start": 2407.84
    },
    {
      "text": "knits to deal with one two three jump one two three perfect continue to cruise on that bat you got to keep going to get get away from that bat we'll let him shoot some more and then we'll get a little closer now these bats coming over and over again most reminiscent of Cast levania's uh fourth stage where we actually fought Frankenstein in the original game um they come about every five six 7 seconds so you just got to kind of be ready for them because you can it doesn't matter how many of you kill they're going to keep on we won't Rush here we'll be patient and then we'll climb we don't bother killing them we don't need to so here we're at the top we'll fight another one of these sons of **** oh oh I don't want that that's a stopwatch we don't want that kill that guy another axe Soldier here there's a checkpoint right behind um there also food no nothing is up here there it is so this part gets a little crazy as you're about to find out I shouldn't have",
      "start": 2493.0
    },
    {
      "text": "another axe Soldier here there's a checkpoint right behind um there also food no nothing is up here there it is so this part gets a little crazy as you're about to find out I shouldn't have grabbed that dagger dumb just got to keep moving just keep moving you just got to keep moving oh I just jumped into a hole that was stupid all right try one more time use the daggers here actually come in handy I don't quite remember that actually fishermen of course introduced in the very beginning of uh Castlevania one so this boss here is a little is is tough and we'll see what we can do against him but he is a tough got there oh sloppy sloppy plan all right it's my last life so let's see what we can do here if not we'll shut it down we do this bridge one more time oh I just got an extra life for points which comes in handy so we'll actually have two more tries at this if we die and I probably will cuz I remember this enemy being quite difficult so",
      "start": 2570.16
    },
    {
      "text": "time oh I just got an extra life for points which comes in handy so we'll actually have two more tries at this if we die and I probably will cuz I remember this enemy being quite difficult so the idea here is is again you have to be patient with this particular boss this isn't this isn't a bossy Slaughter only its heads are weak so you have to just and watch out for its fire cuz it'll knock you right to Oblivion so you have to just be very patient and the axe is very useful here **** and died again Kevin I'm being too I'm being a little too crazy with it I got to be better I got to be smarter I got to be smarter let's that be smart let see what we can do all right so we're going to climb back down we're going to try this one more time let's do or die here if we're going to see the next stage or not I know what the next stage is but you guys probably don't that's that's the big problem all right here we go so we got to hit in there we got a hit in",
      "start": 2680.56
    },
    {
      "text": "we're going to see the next stage or not I know what the next stage is but you guys probably don't that's that's the big problem all right here we go so we got to hit in there we got a hit in there which is nice oh oh I survived that one somehow that was a really shitty placement got to hit in there got to hit in there okay Kevin that's it that's it for us in Castlevania 3 for now we saw quite a bit of the game about half maybe a little of the game it was a lot of fun I hope you guys enjoyed it thank you for joining me it's a game I've been eager to show you guys maybe we'll play the second half at some point soon got to kind of brush up a little bit it's been a while uh but I hope you enjoyed it you met Grant you met Sypha of course you met Trevor Belmont uh but we didn't even see the castle that's the coolest part is this was all the leadup to the castle in the actual game because this game is huge um you saw some of the nonlinear aspects the third character",
      "start": 2760.52
    },
    {
      "text": "didn't even see the castle that's the coolest part is this was all the leadup to the castle in the actual game because this game is huge um you saw some of the nonlinear aspects the third character the third playable character who is he Alucard first time Alucard was ever in a game was this game Alucard of course Dracula spelled backwards he's Dracula's half human son uh so thank you for joining us here on kind of fun games for an extended let's play of Castlevania 3 Dracula curse if you're interested in playing it you can play it on your NES of course if you still have it it's also available on Virtual Console on Wii 3DS and Wii U and it is a game absolutely positively worth playing so I hope you guys check it out I hope you enjoyed it thank you for joining us keep it tuned here to youtube.com/kindafunnygames for more let's plays and Kinda Funny gamescast and all sorts of random **** till next time",
      "start": 2829.64
    }
  ]
}
