{
    "id": 918,
    "video_id": "IvOnhVex6Cs",
    "show_name": "Love & Sex Stuff",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino"
    ],
    "title": "The Girl I Like Has A Boyfriend – Love & Sex Stuff",
    "description": "Submit your questions here!:\nhttp://www.kindafunny.com/loveandsex\n\n\nBut what is she already has a boyfriend? This week Tim and Nick dive into the horrible world of homebreaking.\n\nEach and every Monday at 9AM PST Tim Gettys and Nick Scarpino answer your questions about dating and relationship advice....cause that sounds like a good idea.\n\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff - http://www.QN5.com",
    "published_at": 1433779200,
    "duration": 256,
    "transcript_chunks": [
        {
            "text": "today's question comes from 17-year-old Ben. Ben, yes. He says there's this girl at my school named Cassie who I've known for years but become good friends with this year. We have three classes together in which we talk a lot and have a lot of fun together and I have feelings for her. I thought she felt the same way and was going to ask her out, but then I figured out that she's already dating someone. I want to tell her how I feel, but I'm concerned about what it will do to our friendship if she does not share my feelings. I think we have great chemistry and make a good couple. Should I ask her out knowing that she isn't available and hope she picks me or do I wait and hope she becomes single? That's a tough one. I don't think it's tough at all. This is a bad thing. Home wrecking is bad. Do not do this, Ben. Look, it's like this, you're in high school, she might like you, but the fact of the matter is she's someone else's girl right now and we have one rule on this channel. We only have one. Yeah, and Tim what",
            "start": 4.08
        },
        {
            "text": "look, it's like this, you're in high school, she might like you, but the fact of the matter is she's someone else's girl right now and we have one rule on this channel. We only have one. Yeah, and Tim what is that rule? Talk shit, get shot. Talk shit, get shot, man. Are you in the friend zone? You have to ask yourself that question. Okay, that is the most important question and it's a very, very important skill to hone when you're young because it will save you a ton of time and emotion and emotion. When you guys are chatting back and forth and hanging out, does she view this as a friendship relationship and you know in your heart, really look in your heart and ask yourself that question and if the answer is yes, you're in the friend zone, get out. Evacuate the dance floor or whatever the song lyric is. I don't even think you need to go that far. She has a boyfriend so it's just like the the question you might be asking yourself a lot of times these girls have boyfriends until another when you're 17 years old.",
            "start": 41.64
        },
        {
            "text": "think you need to go that far. She has a boyfriend so it's just like the the question you might be asking yourself a lot of times these girls have boyfriends until another when you're 17 years old. She has a boyfriend, not a husband, not someone she's going to marry most likely. She's just dating this guy until they break up and the next guy comes around which is where the confusion comes in, right? Follow her on Instagram and keep tap, make sure you know the second that she doesn't have a boyfriend then swooping those DMs in. I almost got into a fight in high school about this and a car accident because of this because I was trying to swoop on someone else at the same time. No, yeah, because the guy was like what's up and then we were like it was almost it was a little Fast and Furious moment. Okay, it was pretty dope and by dope I mean I was tailgating him and he went like this and I smashed into a car so you almost got into a fight did get into a car accident got into a car accident almost got",
            "start": 78.12
        },
        {
            "text": "it was pretty dope and by dope I mean I was tailgating him and he went like this and I smashed into a car so you almost got into a fight did get into a car accident got into a car accident almost got fight because of the car acci but the the the impetus of that whole scenario was because I like someone else's girlfriend. Yeah, and you know what in that situation I had to look deep into myself and say what is causing all this havoc in my life? Is it this guy or am I the shit in this situation, right? Is he the problem or am I the person who was trying to hone in on someone else's uh uh you know Cherry Garcia man, you know what I'm talking about. I know someone that Cherry Garcia and I'm like am I going to sneak up on you when you're in a park like this yeah and then and just swoop on that Cherry Garcia. Yeah, here's the biggest issue I have with all of this and that's if it were to work out your entire relationship would be based on the fact that you just convinced a girl the girl that you're",
            "start": 110.4
        },
        {
            "text": "Garcia. Yeah, here's the biggest issue I have with all of this and that's if it were to work out your entire relationship would be based on the fact that you just convinced a girl the girl that you're with to leave someone else to be with you and guess what if it happens to you it can happen happen to someone Happ happen to you again and that's all bad cuz you do not want your entire relationship to be based on home wrecking. Such a bad standard. The other thing too is when you're 17 bro there are so many other people out there that you could be dating and that's that's what you should be looking at. You should be looking at everyone. Yeah, look at who you can date not who you who can you date who else do you like and also sometimes it's nice to just meet other people spend some time with them maybe it doesn't work out maybe it's not she's not the one for you and then maybe Cassie is available and it works out. Yeah, that it's going to be okay, you know other you can't rob the bank because then",
            "start": 149.56
        },
        {
            "text": "it doesn't work out maybe it's not she's not the one for you and then maybe Cassie is available and it works out. Yeah, that it's going to be okay, you know other you can't rob the bank because then you're always going to be on the run. That's what Tim saying and no one wants to be on the run . Okay, you at the end of Ocean's 11 suck. Well they come on they got billions of dollars they can be on the run if they want. I'm good at it too. Yeah, all right well ladies and gentlemen that is Love and Sex Stuff. If you want to leave a question for us to answer cuz we are brilliant clearly clearly some of the brightest Minds that this generation you need Rel yeah we're covering the generations yeah we have all we're like Star Trek generations except actually good. I like that. I like that. L if you want us to answer your questions head on over to kind afunny.com/loveandsex fill out that form fill it in like a Twinkie man fill it in like a Twinkie that was the big thing stinky Twinkie is it filling it in like",
            "start": 188.24
        },
        {
            "text": "your questions head on over to kindafunny.com/loveandsex fill out that form fill it in like a Twinkie man fill it in like a Twinkie that was the big thing stinky Twinkie is it filling it in like a Twinkie or fill it out like a twink. I looked that up filling in the Twinkie boot fill actual proper grammar is fill in but a par of our time okay we'll figure it out we'll talk more about that",
            "start": 227.64
        }
    ]
}