{
    "id": 905,
    "video_id": "mzbEZj0WQfQ",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Colin Moriarty"
    ],
    "title": "Let's Play Not a Hero - Kinda Funny Plays",
    "description": "Subscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1433444401,
    "duration": 1065,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another Let's Play here on youtube.com/KindaFunnyGames I'm Greg that's Colin and this is Not a Hero. Colin, what the hell is this game? Not a Hero is a a game on PC right now by Roll7 who you might know from uh a couple of uh excellent skateboarding games, the OlliOlli games. They're on PlayStation, well they're on PlayStation Vita and PlayStation 4, other other consoles as well. Uh these are our friends from the UK though. Devolver Digital uh published this game and um it's basically a side-scrolling kind of shooter. Um you're trying to get into a rhythm. Uh it's very basic but uh in terms of premise but kind of hard to master. We play to learn, tough to master. We played just a little bit. Uh we're using an Xbox One controller as you can see here to play the game. We're also jamming these tunes but you can use the Xbox 360 controller or custom controller or of course you can just use your mouse and keyboard if you're a huge nerd. I'm sure Portell loves that. He loves",
            "start": 0.08
        },
        {
            "text": "also jamming these tunes but you can use the Xbox 360 controller or custom controller or of course you can just use your mouse and keyboard if you're a huge nerd. I'm sure Portell loves that. He loves a good he loves a good jam. So we're we're very early in the game. I'm not very good at the game. The tutorial is the tutorial of course. So now we're just going to go into the game here and play and just kind of take a look at it. And this Bunny Lord, he tweeted us the other day. Did he? Yeah, cuz somebody said that we should play the game in a Let's Play. He tweeted into something crazy cuz he's a crazy little bunny. I thought that was cute. He's a real piece of **** this guy. He's a real piece of garbage. If you're watching this, Bunny Lord, **** you. Damn, that's **** up. Hey, I'm just saying he's clearly a bad guy, right? Or is he the good guy? Too much story. I don't care. He's Not a Hero. Exactly. So I'm going to play as Steve . Steve has fast reloads. He's accurate, good range. And then eventually you get",
            "start": 42.44
        },
        {
            "text": "a bad guy, right? Or is he the good guy? Too much story. I don't care. He's Not a Hero. Exactly. So I'm going to play as Steve. Steve has fast reloads. He's accurate, good range. And then eventually you get approval ratings that will allow you to unlock Stan. Eventually I want Jesus. I don't know. You overrated. Stanley is where it's at. Look at that afro. So day two, I'm dropped off and we're going to go and you're right into it. You're shooting , you're stunning, you're running, you're doing stuff. Now of course you skip the story so I have no idea what's happened, right? You're just murdering people. Yeah, why not? I guess not. This looks like a a few different games combined, you know what I mean? It's got the the murder. I'm not very good at that. I got I got a slide. Basically what you have to do is you have to slide in the cover. See like when I'm dark here, I'm I'm sliding in the cover and then I'm out. So I you have to kind of use the on the Xbox One or Xbox 360 controller. It's the A button. There you go. See now",
            "start": 73.2
        },
        {
            "text": "the cover. See like when I'm dark here, I'm I'm sliding in the cover and then I'm out. So I you have to kind of use the on the Xbox One or Xbox 360 controller. It's the A button. There you go. See now you're getting it. Now you're getting the hang of it, champ. Yeah, no doubt about it. All right, so remember that one Spy game? That's what this reminds me of. I can't remember the name of it. That's driving me crazy. Look like you're out of ammo. I can hear the clicks. We don't have the headset on but I hear the clicks. There you go. You remember the Spy game I'm thinking of? The Spy game we had to like hack cameras and you came in, you slid in things, jumped. Yeah, the **** was that game called? Yeah, okay. Um yeah, what was it called? Was on PS3. Is that the game you're thinking of? No, maybe. I don't know. Maybe there was there too. Hold on. I'm I'm going to Google around for a little bit. So first impressions, first blush, what do you think? It's fine. It's it's it's a fun game. I I'm not playing it quite right because I",
            "start": 114.2
        },
        {
            "text": "was there too. Hold on. I'm I'm going to Google around for a little bit. So first impressions, first blush, what do you think? It's fine. It's it's it's a fun game. I I'm not playing it quite right because I don't have a, you know, I've just I really just started playing the game. So like I don't have the rhythm. Like I said, it's a game that's easy to understand but very difficult to master, you know? So it's uh, you know, on the bottom of the screen screen here, you'll see um three different things like kill all the Mobsters obviously, but you know, Critical Hits, slide tackles, executions. So is that your mission objective or is that just like additional? I think it's probably just additional stuff that you can do if you want to do. Do you have like regenerating health? It looks like. Do you feel like you're Not a Hero? I don't feel like say Not a Hero. No, I mean I'm Not a Hero. It's being, you know, very obvious in what it's trying to tell me. So I'm going to jump out this window here. I mean that's a heroic thing that",
            "start": 158.0
        },
        {
            "text": "I don't feel like say Not a Hero. No, I mean I'm Not a Hero. It's being, you know, very obvious in what it's trying to tell me. So I'm going to jump out this window here. I mean that's a heroic thing that I just did there, jumping out of that window, getting into that van. I mean that's what bad guys do too. Terrorists would do that. They blow a bunch of away, they jump on there and they do their thing. So now I'm going to try to play it a little cleanly cuz, you know, I have about 10 minutes of experience with the game. So let's see if we can do it a little better. Uh we'll continue on. Bunny Lord is fun. Club Bunny Lord is bad. Colin, I don't think you that's why you're Not a Hero. I'm sick of hearing from Bunny. So I'm going back in here. Going to pick Steve again. Day two, day three, I'm sorry, day three. So what I need to do, come out of the door. I **** dare you. I got to finish within 100 seconds. Call time. Take 90 seconds. Call call 87 seconds. Get him. All right, well he he used the cover. See, you're not the only",
            "start": 197.92
        },
        {
            "text": "need to do, come out of the door. I **** dare you. I got to finish within 100 seconds. Call time. Take 90 seconds. Call call 87 seconds. Get him. All right, well he he used the cover. See, you're not the only one who understands cover. Apparently, I'm the only one that doesn't understand it. I think. Try not to sneeze. Now what are these what are these what do these guys do to you? I don't know. Oh God. I like the use of cover. You like it? Yeah. Oh, nice. Look at that. You don't shoot him. You can just CQC him as Snake would say. Remember Snake? Oh, I remember Solid Snake. Oh, I died. So what I was trying to do here was I was trying to see if I cuz you can slide and then kill them by standing over them. Sure. Uh but it doesn't seem like it's very practical. Then how you reload? Yeah, I don't know. I don't know how I feel about this game. It's interesting. It's an interesting idea. It's again just very it's very basic but there's a lot of depth to it. Deceiving amount of depth. Right, right, right. There you go. So you stand",
            "start": 233.76
        },
        {
            "text": "about this game. It's interesting. It's an interesting idea. It's again just very it's very basic but there's a lot of depth to it. Deceiving amount of depth. Right, right, right. There you go. So you stand in front of these automatically and they just kind of open. I like the guys the guys yelling, \"Fire at will!\" They're laughing a lot. Yeah, they are. They don't give a ****. It's just weird that they all their uniform is like they're bandits from a cowboy movie running around shooting their guns, being cowboys, being free, eating baked beans out of a can over a little fire. That's what I always wanted. Looking up at the I have a drill shot. It looks like here. Is that going to drill through somebody's head? I don't know. We're going to find out. He drilled through the wall. Holy **** , Lew! Yeah, you got your kill streak. 8 seconds to finish level. K. Not going to I'm not trying to push you. Just let you know. Activate that billboard. 0 seconds. Call. Get to the bunny-copter . Call. You didn't kill everybody. Call. You're",
            "start": 297.28
        },
        {
            "text": "8 seconds to finish level. K. Not going to I'm not trying to push you. Just let you know. Activate that billboard. 0 seconds . Call. Get to the bunny-copter. Call. You didn't kill everybody. Call. You're almost there. Call. 9 seconds. Call. Kill everybody. Call. Kill him. Call. Looks like you got four guys left to kill. Call. Got a Nimb Box over there. Call. Looks like it's now about eight guys to kill. Call. Kill everyone. Call. Finish it in 100. Didn't finish in 100 seconds. Oh God, I'm out. I'm out of ammo. There's a lot of things to keep an eye on here. Yeah. Are you feeling the intensity ratchet up? I I am. I'm feeling like I feel like I'm not great at the game so I have a lot of work to do. A lot of practice to be had here. Now let's see. I'm going back up here. Okay. And then I'm done. I'm good. I'm I'm um I didn't kill everyone though. No, this wasn't your I'm a benevolent. Oh, okay. Bunny Billboard brand prime minister. I I like this bunny guy. I think he's a bad guy. He well, he's definitely a bad guy. There's no doubt about",
            "start": 354.2
        },
        {
            "text": "though. No, this wasn't your I'm a benevolent . Oh, okay. Bunny Billboard brand prime minister. I I like this bunny guy. I think he's a bad guy. He well, he's definitely a bad guy. There's no doubt about that. Rubies you're at today . We shall put oh, look at this guy. He's a little squirrel creature creature. Today we shall put an end to Bogden's illegal creature business by blowing. Okay, I've seen enough. You're just done. You know, you don't need to know. Steve doesn't need to know anything. I want to get the Cletus. So we I think if we do this stage, we'll unlock another character. Cletus. This like J. Some folks will never read a with again. Some fol. I died. You're dead, dude. I was a little too brash. You're you're in it to win it as I like to say. Yeah, I don't think I'm I don't think I'm playing the game quite the way it was intended to be played. Well, you're learning. This is your third level of the game. What do you want? What do you want from him, America? What is this? Molotovs, grenades, grenades, nades.",
            "start": 410.76
        },
        {
            "text": "quite the way it was intended to be played. Well, you're learning. This is your third level of the game. What do you want? What do you want from him, America? What is this? Molotovs, grenades, grenades, nades. Some call them. Some people do call them n ades. Yeah, that's true. The guy who invented it, nade shot. Now do you heal over time? Yeah, okay. Regenerating health here in the in the bottom right corner. Sorry, bottom left corner. Don't know my directions. Have it. Oh man, you got no fear. Steve's just jumping out windows, not giving a ****. Look at you. Look at this gentleman. Oh, I think I got him. Grab that's one. You you grabbed one creature. Call. Need to grab another. Need four kills and five 4 seconds. Oh, I see. It's counting down. You're close now. You didn't get it. Use all the special weapons. Call. Out of bullets. Grenades. You got that guy that caught me. I had a little rushing guy hat on. Little son of a ****. What's he doing? Cares . Is this a where is you're not ready to go yet. That's that's going want get that's going",
            "start": 461.88
        },
        {
            "text": "you got that guy that caught me. I had a little rushing guy hat on. Little son of a ****. What's he doing? Cares. Is this a where is you're not ready to go yet. That's that's going want get that's going to be your exit. I want to get out of here. Someone's at the door. Portell. Noe P. You don't have opposable thumbs. If you could answer the door, I'd let you, man. But you can't cuz you're just a little dog. Oh, I know. It's tough being a dog. Oh, I know, buddy. Now what's over here if I can go out here? I like who he just runs through the window. Reckless abandon. It's got to do it, man. All right, this guy's coming up. I'm going to do this. Open fire. Open fire is how you said it. Sound like Gangnam Style. Open Gangnam Style. Remember that one? That was a hit. It was a huge hit. Do you think Billy Joel will ever have a song that big? No, I don't think so. That song's bigger than any Billy song , unfortunately, man. I remember Billy Joel. Whatever happened to him? He's banging around. Seen him this summer. Who's opening for him? No one.",
            "start": 516.56
        },
        {
            "text": "big. No, I don't think so. That song's bigger than any Billy song, unfortunately, man. I remember Billy Joel. Whatever happened to him? He's banging around. Seen him this summer. Who's opening for him? No one. I don't think. Oh, that was a smooth exit. You like that? I like that. Just fall right through the roof of the I did nothing right. I didn't grab the creatures. I didn't I didn't even see the second creature. Four kills in 5 seconds. Use all the special weapons. Now you're the mayor of England though, so you got that going. Or he is. I think I'm going down though in stature here a little bit . What was that, Kevin? Was that a package? Who's it for? S. And one for you. Goddamn. One for me. Yeah, on Prime. My Prilosec. I order my Do you do that because of Larry the Cable Guy? Uh no, I do it because I have really **** up acid reflux. Everyone tweet at Larry the Cable Guy and let him know that the Prilosec got delivered because of him. Just give it to him. Just let him have. Let him let him think he's changing Gods stuff. I God my my",
            "start": 563.6
        },
        {
            "text": "approval rating is at eight. I still have to do I want to do one more. I got to do one more level. I'm not doing I'm not doing good enough. Well enough. I'm not doing good enough. Yeah. Mhm. Now I got to kill the investigator. Don't get punched. You you got to do less than 10 hits and then finish it in 40 seconds. Call. This shouldn't be that hard according to this. No, definitely not. I got fat boy rounds. I wonder if that's a nuclear bomb reference. Yep. Roll7 got the jams, man. Music's good. I can't hear it. I believe the music's good though. I believe it. We put on the thing that lets us control the volume so you should do that. Check out this move. Ready? Oh man, I got knocked right the **** out. Oh ****. Oh damn. Look at my look at I landed on my head. Oh **** son. Holy jeez. He dead, P.Y. Holy jeez. He dead, P. Y. Holy",
            "start": 607.04
        },
        {
            "text": "do that. Check out this move. Ready? Oh man, I got knocked right the **** out. Oh ****. Oh damn. Look at my look at I landed on my head. Oh **** son. Holy jeez. He dead , P.Y. Holy jeez. He dead, P.Y. Holy jeez. All right, let's try. Holy geez. I wanted to lick him. So just just stopping next to anything puts you into cover like on the side of anything. Yeah, as long as you have to roll into it though. You can't just stop. So you can't. Okay, like right there. You which is like why I'm getting a little confused. Gotcha. Like you have to roll. Here's here's my question. Have you thought of only rolling? I have. Do you think they did this cuz they're Roll7? Probably. Do you think indie developers ever get tired of being the cleverest **** in the room? No, I don't think they get tired of that. Now be perfectly honest with you, Mike Biffle, smug face. I feel like I'm getting a little bit better. You're starting to understand the mechanics a bit more. I think my you want to know what I think's happening? What's that? It's a",
            "start": 648.08
        },
        {
            "text": "you Mike Biffle, smug face. I feel like I'm getting a little bit better. You're starting to understand the mechanics a bit more. I think my you want to know what I think's happening? What's that? It's a lot like Spider-Man in Civil War. Well, that's when he stopped. But you're you're holding back. I think you you just got to embrace how crazy it is. You're playing it like I would you'd play a regular game. I I think you should only move with the roll. That's my advice. Well, I'm doing it and you're **** me. Well, you're out of guns. You're out of bullets. You see what you just did to me? Let me stupid son of a ****. Let me sh. I never played this game either. Go roll around. That's good. Why you rolling around, Spider-Man? Hey, how do I reload? Uh B. Got it. Now look out, America. You have a new Bob Saget. You definitely do. And he's not here right now. Now how am I? Oh ****. Okay, I came. I brought it back, C. Why is that guy taking so many bullets? Grab the suitcase. There you go. Get to the Bunny Wagon and shut",
            "start": 699.88
        },
        {
            "text": "definitely do . And he's not here right now. Now how am I? Oh ****. Okay, I came. I brought it back, C. Why is that guy taking so many bullets? Grab the suitcase. There you go. Get to the Bunny Wagon and shut up already. Why you going back up? I want to kill people. I'm lost in the moment. It was the heat of the oh ****. I'm off it. That's my heart head. Why you shooting that way? Oh ****. I felt good. I felt like I had something going there for my first time. Definitely didn't for my first time. That's the thing is that you definitely didn't have anything going there . **** you. I did better than you did. I got the briefcase. I got the briefcase at the very beginning. Were you nuts? You didn't get nothing. Go back to the video and tell me I didn't get that brief. I can't right now. I didn't miss, mate. I maybe that's my guy. That's Steve talking. Oh, does Steve have an accent like Steve Irwin? That's cute. Remember Steve Irwin, the Crocodile Hunter? Colin. Oh, I remember him. Yeah, he's not with us",
            "start": 754.28
        },
        {
            "text": "miss, mate. I maybe that's my guy. That's Steve talking. Oh, does Steve have an accent like Steve Irwin? That's cute. Remember Steve Irwin, the Crocodile Hunter? Colin. Oh, I remember him. Yeah, he's not with us anymore. No. Oh, Doc. Let's go. I'm going to investigate the broken window. You're **** dead. You're a brutal man, huh? I didn't ask for this world. You didn't. But you're doing this. Guy kind of looks like Joel, doesn't he? The Last of Us. This is like alternate universe where good things happened and he instead of being like a shitty carpenter or whatever the hell he was, he went he was got a little special. I wonder what this gun this weapon is. N-speed load. I need that. I've been told I have a speed load for a long time. See what I did there? I've also heard I've also heard a thing or two about you having a Ropey Load. That's in my next game. That's that's Roll7's next game. Ropey Load from the makers of Knob Switch. Come Ropey Load. Oh ****. Oh ****. Oh ****. You're going to die. You're done. That's what they said about the",
            "start": 808.12
        },
        {
            "text": "in my next game. That's that's Roll7's next game. Ropey Load from the makers of Knob Switch. Come Ropey Load . Oh ****. Oh ****. Oh ****. You're going to die. You're done. That's what they said about the bad guys in the movie Robotech. In a movie Robotech. Mhm. That hasn't been made yet. I don't know much about Robotech. I'm not going to lie to you. All right, I did it. I felt pretty good about that. How feel how you like it? Yeah , I'd play more of that when it comes to Vita. Prime Minister. Hey, is that good? That's better than Mayor of England. I think so. I did. I think so. All right, good. Think so. Good . Yeah, this game. I'd play it when it comes to console. Cletus. Blow enemies backwards. Shoot open sh door. Shoot doors open. Shoot to interrupt load. Slow reloads. Pretends to be Scottish. That's one of his things. Pretends to be Scot. Oh, oh, should you know that? K. McDonald. Don't I, Governor? Is that fake Scottish? I think that's it's my it's just my accent . But she gets mad cuz she's Scottish and I I give her the British a right of",
            "start": 861.64
        },
        {
            "text": "Scot. Oh, oh, should you know that? K. McDonald. Don't I, Governor? Is that fake Scottish? I think that's it's my it's just my accent. But she gets mad cuz she's Scottish and I I give her the British a right of course. Rel. Oh God. Do I have like why aren't you I don't understand what's happening here. It's it's a shotgun so you it takes a while to reload. See? Yeah, I don't I like is a real son of a **** like Cletus. Like now what happens if I if I skate in their legs like that? All right, cool. Then you can go over them like stab them. Oh, with the same button? I think so. Yeah, try it on the next guy. Yeah, you're right. You're right. Right, right. When you're right, you're right, Collie. He's tougher. He's tougher. Cletus is an expert class character. I'm not feeling it. You're not feeling it? No, I'm not feel. Turning the lights down. Someone's got to do something, Cletus, cuz I don't I don't like the way he plays. Jez. Up closer, scarecrow. Oh yeah. Cletus is not a speed character. No, no, no. You got to be oh my God. You got",
            "start": 908.36
        },
        {
            "text": "the lights down. Someone's got to do something, Cletus, cuz I don't I don't like the way he plays. Jez. Up closer, scarecrow. Oh yeah. Cletus is not a speed character. No, no, no. You got to be oh my God. You got it said shoot. I thought it was pretty obvious what I think it was. I thought maybe it was going to give me like a smoke cloud, you know what I mean? No, okay. Oh yeah. Now Cletus is feeling it. Making sure that guy was dead. You know how to do it. Oh, I understand completely. You lost your kill streak but I found a best friend. You did find a best friend. And who is the best friend? Oh, thank you. I wasn't sure if I liked you till this this Let's Play took us about eight years to figure it out. Oh, come on ****. Come on ****. All right, all right. We're done with this game. I don't like Cletus. Cletus. I can't I can't. I like the game. I don't enjoy Cletus. Putting that out there. Nice work to our friends at Roll7. It's an interesting game. Bring this to Vita, won't you? I know you want bring it to Vita. Please. Vita made you Roll",
            "start": 973.84
        },
        {
            "text": "I like the game. I don't enjoy Cletus. Putting that out there. Nice work to our friends at Roll7. It's an interesting game. Bring this to Vita, won't you? I know you want bring it to Vita. Please. Vita made you Roll7. Bunny, whoever his name is. Come come to Vita, you piece of ****. Yeah, you little you little son of a ****. Ladies and gentlemen, what do you think? Not a Hero. Let us know in the comments. Then make sure you keep coming back to youtube.com/KindaFunnyGames each and every day for a new Let's Play. We love you. It's been our pleasure to serve you .",
            "start": 1037.44
        }
    ]
}