{
    "id": 945,
    "video_id": "nSeXgzmAvR0",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Are You Afraid of Death? - The GameOverGreggy Show Ep. 80 (Pt. 1)",
    "description": "Colin Moriarty wants to know if we are scared of dying.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1434351600,
    "duration": 1903,
    "transcript_chunks": [
        {
            "text": "What's up everybody? Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller, alongside the producer, S.L. Seducer, slaten bread again, Nick Scarpino. Bre, Bre, the carbs are back. Beautiful pieces of bread today. True story, I've actually been on carbs for a while. I just haven't made a big deal. How how long's a while? A month? Forever. Why have you not eaten any of bre the bread here when you're here? All you you have a sad little Ziploc bag full of loose meat and then you got a **** egg. How the hell am I supposed to put and you're still **** your brains out every day? You're not. See, I'm doing I usually do like more carbs in the morning, so when I go to Starbucks, I get a breakfast sandwich. I'm back on those breakfast sandwiches. At night, I have like last night I had some hard at Starbucks before we go to Starbucks. Yeah, and then we go you go to Starbucks twice a day? Yeah,'cause I this new strategy, would you like to hear it ? That's a I like that you're using the word strategy first of",
            "start": 2.85
        },
        {
            "text": "before we go to Starbucks. Yeah, and then we go you go to Starbucks twice a day? Yeah,'cause I this new strategy, would you like to hear it? That's a I like that you're using the word strategy first of all. Yeah, I want from I haven't heard I haven't heard that word in a long time, so yeah, let's let's uh my strategy is as follows: buy the coffee and then see if you can get the refill at a different Starbucks. Now, they're not technically supposed to let you do this, but sometimes they're cool and they don't give a **** and they don't want the argument and they just do it. So I get two coffees for an extra 50 cents. Nice. It's is not bad. So you're making money? Not making money. Still still costing me money. How much money are you making a day now? Uh, I'm making a negative 50 still. That's pretty good though. You're turning it around though. That was a negative three not too long ago. That's very true. Okay, you're saving 350 a week if you went every day and did it, but you're only going on weekdays probably, right?",
            "start": 55.88
        },
        {
            "text": "you're turning it around though. That was a negative three not too long ago. That's very true. Okay, you're saving 350 a week if you went every day and did it, but you're only going on weekdays probably, right? So you're saving 50. You don't know Nick that well, do you? No, I go every day. No, I'll go to Starbucks at least. You go twice. I'm saying I assume that maybe you go every day, but you don't go twice a day on Saturday, so you see. Well, sometimes I do,'cause here's the deal: it's a waste of money though,'cause my wife and I like to go for walks and sometimes walk like we'll walk for a good half hour, 45 minutes. We'll start it with a Starbucks and we'll just you just keep nothing more refreshing at the end of a walk than coffee. No, that's bad. It's actually been uh I know everyone it's been very bad lately. I've had to I've had to remind myself to hydrate,'cause I've had the uh how you get kidney stones, you know? I know it's true. Greg will drink enough water for all you. I try I try to keep it around over here. Try to",
            "start": 94.8
        },
        {
            "text": "I've had to remind myself to hydrate,'cause I've had the uh how you get kidney stones, you know? I know it's true. Greg will drink enough water for all you. I try I try to keep it around over here . Try to keep it real. I've never seen anyone drink more water than than Greg and I've never seen anyone pee less. There's something really mysterious going on. Evacuated. I turn it into water vapor. That's what powers the inside. I'm a steam machine, guys. You ever see the **** **** truck? I ever see the train from Back to the Future Part III? That's like that's you had a Nick moment there. No, I knew where I was going and I saw it. I just couldn't grab it, so I had a \"Dear Alice\" moment. I knew the word I needed, just couldn't get to it. The reason that Tim doesn't pee is because he only drinks Coca-Cola, which is not really liquid anyway. I eat a lot. I don't ****. You don't ****. You don't eat that much. You **** sometimes . Kevin doesn't pee because he sweats it all out. You I love you, Kevin, but several times stop being",
            "start": 132.08
        },
        {
            "text": "liquid anyway. I eat a lot. I don't ****. You don't ****. You don't eat that much. You **** sometimes. Kevin doesn't pee because he sweats it all out. You I love you, Kevin, but several times stop being this joke. Colin just doesn't drink. He that's the one water he's got for the week. I don't drink a lot of water anymore. I used to. You open a lot of water bottles. Yeah, I lot of water bottles all over. My dad used to make fun of me all the time. Poland Spring we drink back on the East Coast and I used to leave those Poland Spring. That's what you call getting water. Poland Spring is like the Arrowhead. No, not Poland Spring brand, guys. I used to be famous bottled water company . Spring sounds sexy. That sounds nasty. Green bottles. It's just like the Arrowhead. Yeah, pull some string. That's that's when it's nasty. But uh anyway, I used to just leave water bottles over the house. My dad used to get really mad. He's like, \"You drink quick.\" No, used to. Yeah, still. Oh no, I punted one across the living room earlier today. I I don't know",
            "start": 173.48
        },
        {
            "text": "I used to just leave water bottles over the house. My dad used to get really mad. He's like, \"You drink quick.\" No, used to. Yeah, still. Oh no, I punted one across the living room earlier today. I I don't know where it was. I think it was the I probably left it when I was laying on the ground for no reason watching what thought I'd watch hockey. Just lay on the ground, you know, as you want. Feel like exactly. We do different things on the island. And as you know, in case you're curious, it still is true that I have an advantage in our desert island scenario is because I was in fact born and raised on an island. So I just wanted to remind you guys that as well. Um, true story. Colin was very disappointed not more people picked up on that one. Yeah, through the comments like, \"Oh no , it's I think that's one of the funniest things that's come from the show, period.\" Like I like you're the sincerity in your voice that you think that you're better than us because you're from an island. Never mind the fact that I actually",
            "start": 220.64
        },
        {
            "text": "things that's come from the show, period. Like I like you're the sincerity in your voice that you think that you're better than us because you're from an island. Never mind the fact that I actually legitimately grew up in a desert in the Inland Empire. I didn't say it was better than anyone. I said that because I grew up on an island, I could survive the desert island scenario more likely than not. That was all I was trying to say. I'm not going to give you any reason why that. No, I want to know. I don't really know. After we're done making his weird **** documentary about this, like when he when he finally goes in The Killing Spree or we discover the bodies, as I should say,'cause I'm nearly 100% sure he's already killed at least three people. Well, yeah, but then Kevin takes care of the bodies. What the ****? Have muted your mic. Too late. You're not good enough. Not fast enough. Yeah, you don't need to worry about being fast and they're dead, do you, Kev? Look at him slowly go over to mute the mic. Hey, Kev,",
            "start": 257.4
        },
        {
            "text": "**** have muted your mic. Too late. You're not good enough. Not fast enough. Yeah , you don't need to worry about being fast and they're dead, do you, Kev? Look at him slowly go over to mute the mic. Hey, Kev, did the movie The Quick and the Dead turn you on ? I'm gonna **** quit over here. The pride of Long Island, Colin Moriarty. It's good to be here with you, Greg. And there's the pure one, Tim. He's wearing some of his new clothes. New clothes debuting it. I wasn't going to bring attention to you know what? Things **** happen. It's pretty obvious when you walked in today. I knew you were new. A new shirt. I didn't know new pants as well. Well, you told me later. Yeah, can they see my pants, guys? No. Get up and do the little crab squats you were doing a second ago. Crab squats, everybody. If you're listening at home, he's about to crab squat. And there it is. He's crab squatting. That's sexy. What is that? Now he's breaking in. You got to break in these pants, you know? You got to break in pants. What color are they? They like they are",
            "start": 305.28
        },
        {
            "text": "crab squat. And there it is. He's crab squatting. That's sexy. What is that? Now he's breaking in. You got to break in these pants, you know? You got to break in pants. What color are they? They like they are black, right? They're black. How many pairs of jeans did you into the camera, Kevin? You're the one who's going to break the camera one day. Kevin would not have been fun. Kevin almost took a tumble. Yeah, you pointed out to me almost out the window. Oh yeah, right there. Which was long foretold in the prophecy. Oh, I didn't even realize that. Yeah, that's going. He's going to break right through that screen. Not this one, the other one. No, I think he's going to fall out that window, which is going to be hilarious,'cause he's just going to fall like three one foot down. I noticed today. Yeah, I finally was able to put words to how Kevin walks. Kevin walks like a Bushwhacker from WWF. The Bushwhackers. You remember these guys? They march down doing this thing. That's his stomps. Today I was like, \"You walk like not the arm",
            "start": 346.52
        },
        {
            "text": "words to how Kevin walks . Kevin walks like a Bushwhacker from WWF. The Bushwhackers. You remember these guys? They march down doing this thing. That's his stomps. Today I was like, \"You walk like not the arm part.\" He very he walks very heavy. If you sped it up a little bit, you'd be you'd be walking heavy like Stone Cold Steve Austin. You don't weigh 500 pounds. You don't have to walk around like that. A lot weigh like 100. Sounds like you're in a Mech when you walk around. It's true. That is that's a really good way to he acts that way constantly though. It's like just the way he walks. Yeah, he drives that way. The way he is, he drives that way. He sleeps that way. Good Lord, he sleeps that way. Suspension's broken and it was bouncy. That was fine. I feel like Kevin's suspension's broken like physically. Definitely. He does walk a little like a drunk bull. Oh man, you know what I mean? Like a bull that's like I don't know like it doesn't realize that it has control over the front part of its body and the back part of its",
            "start": 389.96
        },
        {
            "text": "walk a little like a drunk bull. Oh man, you know what I mean? Like a bull that's like I don't know like it doesn't realize that it has control over the front part of its body and the back part of its body at the same time, so it's kind of like lists a little bit and then comes back like a bull in the china shop, as it were. A drunk bull in a china shop where like sometimes you're just like, \"Is that bull going to move? Why has it been sleeping for three days?\" Ladies and gentlemen, this is The GameOverGreggy Show. Each and every week for sometimes five best friends gather on this table. Each bring a random topic discussion for your amusement. If you like that, you can get the whole show early over at Patreon.com/KindaFunny each and every Friday. But if you don't want to give us any money, it's no big deal. Go to YouTube.com/KindaFunny day by day for every topic. They're broken out. They're put up. You love them until over on Friday we put up the whole show for free on iTunes, podcast services, Windows.",
            "start": 430.6
        },
        {
            "text": "go to YouTube.com/KindaFunny day by day for every topic. They're broken out. They're put up. You love them until over on Friday we put up the whole show for free on iTunes, podcast services, Windows. Beam it to your brains. iTunes. Believe iTunes. Did I say it weird? Yeah, yeah, you really did. I don't I like making fun of you guys. Nick, is this a new shirt? This shirt? Yeah. Shirt for yeah. I feel like I've seen that before. No, I've seen the shirt before. The the Nick Scarpino and Joy Coke shirt went away. Oh yeah, no, I got I bought it again. I like to buy I buy the same shoes. It's been gone for years, guys. This yeah, I know it didn't go away. Let's let's let's pull the like let's shed some light on this. You say pull the wool again. I was going to say pull the wool. I got pull I got pulling wool on my brain. Uh, the wife threw that shirt away. Yeah, because and I quote, \"It's disgusting,\"'cause it was kind of gross and it had holes in it, but I liked it because it was super comfy. Then I just bought it again at Target.",
            "start": 471.44
        },
        {
            "text": "the wife threw that shirt away. Yeah, because and I quote, \"It's disgusting,\"'cause it was kind of gross and it had holes in it, but I liked it because it was super comfy. Then I just bought it again at Target. Oh, okay. Yeah, I buy that and I I like always to have I'm not wearing them today, but I have the same Vans that I I buy every time they wear out. I just buy the exact same pair again. I'm a creature of habit. No, I do that too. These shoes, these are my sixth pair of these shoes. **** by black con all the time. I like them. Colin, yes, what's your topic? It's so surprising that I get to go first. Usually you bury my brilliance somewhere deep in the show, but you know, I reliably get on base, Greg, and therefore you want me to hit lead off. Want me to hit lead just like Damon Wayans or whatever. The dude was an awesome lead off hitter as far as I understand. Not like Marlon Wayans. I was pondering a question that's quite that everyone has to deal with at one at at one point or something they all have to deal with.",
            "start": 518.0
        },
        {
            "text": "lead off hitter as far as I understand. Not like Marlon Wayans. I was pondering a question that's quite that everyone has to deal with at one at at one point or something they all have to deal with. And it's death. Oh, okay. And I'm wondering, are you afraid to die, Nick? No, I'm not. Stab. What if he just stood up and stabbed him? Good. Turns into a bat and flies away. I knew it. I **** knew it all the time. Um, I'm not afraid to die. No, I don't think so. I'm not afraid of death. I don't think about death often. What I do think about, the only thing I'm really afraid of is not accomplishing what I want to accomplish in life before I die. And that's make a movie. Uh, it's make movies. Uh, it's do what we're doing now, but just on a grander scale. Sure. Um, it's really growing this into something that's that's a that's an empire. Um, but no, I don't think so. I mean, like I think about that a lot too because I'm like, I wonder if what would happen if all all over tomorrow if I got hit by a car or something and I was on",
            "start": 556.68
        },
        {
            "text": "an empire. Um, but no, I don't think so. I mean, like I think about that a lot too because I'm like, I wonder if what would happen if all all over tomorrow if I got hit by a car or something and I was on my deathbed. Would I be sad? Sure. But I would still think look back in my life, but like we did awesome **** and we took risks and I was fulfilled all the way up until this point. Now, give me some some goddamn morphine because my spine is crushed. It's very dark. It's very dark. Took a turn. Took a turn. Um, but I'm not you know, I don't fear it. I don't I I mean, having said that, I want to live forever and I I intend to live forever. Really? 100%. Yeah, that's dangerous with the Bissell and Tannenbaum, man. Body parts. Either the Bissell and Tannenbaum. I'm thinking as soon as they discover as soon as vampires decide to show themselves to us, I will of course uh uh service one in any way, shape or form necessary. Um, and so until that day, until such a day where that person that vampire decides to make me a uh official member",
            "start": 608.44
        },
        {
            "text": "themselves to us, I will of course uh uh service one in any way, shape or form necessary. Um, and so until that day, until such a day where that person that vampire decides to make me a uh official member of the Undead. Okay, that's a way to do it. Yeah. All right. What about you, Greg? Are you afraid of death? No. You've looked it in the face once or twice already . No, I never thought I'd die from cancer. Really? That was never. No,'cause like even from the beginning when they're like, \"Yeah, you might have cancer.\" I was like, \"You're going to have this Hodgkin's Lymphoma. It's got the best it's got like an 80 85% survival rate.\" Oh, you told me. Well, I up to you. I was like, \"Nick, it's bad. Like it's I got one percent.\" One night with your wife and I gave it to him. You had to you were there too though. It in the closet. You knew about that. Yeah, all he heard in the closet was it would have started exactly like this and then a real slow and then a real slow kind of just one or two like last minute spasms. And that's Ron Prince. No.",
            "start": 649.88
        },
        {
            "text": "Yeah, all he heard in the closet was it would have started exactly like this and then a real slow and then a real slow kind of just one or two like last minute spasms. And that's Ron Prince. No, I don't I'm not afraid of it. I don't I don't know. When it happens, it happens. It's I don't ever think about it. You know, you know what I mean? It's so rare that I think you actually get a chance. You're like, \" Oh man, that could have **** me up.\" You know what I mean? I don't think I have those moments really of like where I was close. I'm sure they exist. I think about in backyard wrestling when I almost broke my arm. That's like a that's like a thing of like I was close to breaking my arm, not I was close to dying from a broken arm. But like that was like a moment where it's like , \"Oh ****, I dodged a bullet there.\" You know, I dodged a bullet not breaking my arm there. Yeah, but like the cancer thing and the allergic reaction stuff to the medicine and stuff like it it wasn't going to kill me. It was just pain",
            "start": 692.88
        },
        {
            "text": "there. You know, I dodged a bullet not breaking my arm there. Yeah, but like the cancer thing and the allergic reaction stuff to the medicine and stuff like it it wasn't going to kill me. It was just pain in the ass. Right. Yeah, so I don't worry about it. Tim, are you afraid to die? You know, it's one of those things where it's like in the way Greg's saying, I don't think I've ever been afraid to die in like a a sense of I actually think I'm going to die right now and I'm scared of that. It's more the idea of once I start thinking about am I afraid to die, I think the answer is yes. And I think that because when I watch movies or things that are created to elicit a response for me, like an emotional response, and it's surrounding death, it affects me greatly. And uh the idea of me dying and what that would do to the people I love or like I guess I'm scared of death in the sense of scared of other people dying and I know what that would do to me. Like my mom and brother are two people that at any moment",
            "start": 740.12
        },
        {
            "text": "due to the people I love or like I guess I'm scared of death in the sense of scared of other people dying and I know what that would do to me. Like my mom and brother are two people that at any moment could die. I know anyone can die at any moment, but I feel like them two specifically for very different reasons. Like their ships are about to fall. Yeah, they're just they're doing they're pulling some **** and I'm like, \"All right, guys, don't do this to me. Just don't die,\"'cause I don't want them to. It'll be like that would have it would really suck if that were to happen when that happens. And knowing that feeling, I feel like there's a lot of people out there that would feel that way about me. Yeah, sure. And like not millions, but I could I could name at least one. I'd be upset if you died. Yeah, there'd be a couple people and I'd be like, \"I don't want that,\" you know?'Cause that there's when you watch Lion King, yeah, and Mufasa dies, it's like that scene makes you feel so **** up and like empty for a reason.",
            "start": 778.32
        },
        {
            "text": "a couple people and I'd be like, \"I don't want that,\" you know?'Cause that there's when you watch Lion King, yeah, and Mufasa dies, it's like that scene makes you feel so **** up and like empty for a reason. You know, there's like a reason that all these movies play off of death. Like death is such and it's not just movies, it's everything. Like there's nothing worse than being at a funeral. Like you're being you're surrounded by people that are remembering the good times and all that stuff. So it's like in some ways it's a beautiful thing to like celebrate someone's life. And I feel like a lot of times funerals are that, but it's also like you're only doing that to kind of get over the fact that you're dealing with something horrible, you know? And that stuff really gets to me and it really makes me think. So in that sense, it's like I am definitely scared of that. Like I'm scared of having of I'm scared of knowing that when I die that's going to cause a lot of other people to do that for me. And it's like",
            "start": 820.68
        },
        {
            "text": "in that sense, it's like I am definitely scared of that. Like I'm scared of having of I'm scared of knowing that when I die that's going to cause a lot of other people to do that for me. And it's like I don't want them to do that for me. But we'll play your videos at your funeral. Yeah, know, it's going to be great. Like my funeral is going to be a **** dope ass production. Like for **** sure. I'm not too worried about that. It's going to be essentially like Kinda Funny Live, but just like, you know, a little bit longer. Yeah. Um, and a few more people will be crying. If you funeral, please call me. We will talk you through this. But yeah, it's I definitely think about a lot. I feel like there's been a few deaths in my life that have affected me greatly and have always made me think these things. And it's usually less about the person dying and more about the people that are alive that have to deal with there. Sure. Yeah, they don't the person who's dead doesn't have to worry about anymore. Yeah, yeah. And I",
            "start": 867.8
        },
        {
            "text": "less about the person dying and more about the people that are alive that have to deal with there. Sure. Yeah, they don't the person who's dead doesn't have to worry about anymore. Yeah, yeah. And I don't know, but I'm definitely scared. And it's it's interesting though,'cause this gets really **** deep and it really kind of makes you think like whenever these questions come come up and I don't really have answers to them or I have an answer, but I don't know why it I go back and I'm like, \"Why are we here?\" Like, \"Why?\" Like what Nick said about like, \"You're happy with your life because you lived a good life.\" I am so happy with my life. I've already done so much of the things I want to do and I know I'm going to do so many more and things are great. But it's like, \"So what?\" I always ask myself like, \"Why am I doing all this stuff and like who cares and what's before and helping people? Why help people? Who cares? Help people, hurt people.\" It's like at the end of the day like we're going to be dead and it's not",
            "start": 915.44
        },
        {
            "text": "doing all this stuff and like who cares and what's before and helping people? Why help people? Who cares? Help people, hurt people. It's like at the end of the day like we're going to be dead and it's not going to matter, you know? Yeah, and that's weird to think about. Yeah, I don't want to think about life that way. I just want to be nice and help people and try to make as many people as happy as possible. And I know I feel fulfilled. I want to help other people feel feel as fulfilled as possible too. Sure. But that's it's scary to not know like what's going to happen when you die and why you lived. That's one of the great mysteries though. Yeah, I that part I'm excited about. I don't think about myself dying ever. You know what I mean? That's a rare thing for me. I I always say I want to check out early. I don't want to be around forever. I don't want to get so old that I can't use video games and do all the stuff I like. Right. John Candy, the shaky hands. Like 43. Is that what it was for him? Yeah, that's a bit",
            "start": 956.36
        },
        {
            "text": "want to be around forever. I don't want to get so old that I can't use video games and do all the stuff I like. Right. John Candy, the shaky hands. Like 43. Is that what it was for him? Yeah, that's a bit young. Young. I think I think it feel I feel like in your mid-50s is when you wouldn't be able to play games as well. No way. What? When do my skills start going? You got to say you got about is when you can stop playing video games. When I can. Yeah, when my body will stop me from doing the things I enjoy to do. That's what I'm saying in in a roundabout fashion here. I'm not just hung up on the fact that I want to be able to play Uncharted: Golden Abyss on my PlayStation Vita. Three. The Oculus making another VR. Um, that alone. 31. 31's going really that that'll be the point. I don't know if it'll stick to the 31. You'll be surprised life. Um, I don't know. I mean, I feel like that's the thing. You look at you look at people that are in their 60s now and of course it runs the it runs the gamut, right? If people don't take",
            "start": 1001.28
        },
        {
            "text": "be surprised life. Um, I don't know. I mean, I feel like that's the thing. You look at you look at people that are in their 60s now and of course it runs the it runs the gamut, right? If people don't take care of themselves, you can be in your mid-40s and look like **** and your body will be, you know, decrepit and not work out so well. Um, but there are plenty of people in their 60s that are probably in way better shape than all of us now, just ballparking the figure here. Sure. I would think for you 80. 80 is when I should be able. Yeah,'cause I feel like by like 70, yeah, you're still going to be with it. I mean, I know I have relatives that are in their 70s. They have great medical care. They take care of themselves and they're spry. They move around. I mean, they're not going to be able to get on the leaderboards of **** on a Call of Duty tournament, but you know, I never want to do that. Can I play Gone Home 3? Yeah, you can play Gone Home 3,'cause it's easy. You just click click. Gone back home again. Click. Oh yeah, you",
            "start": 1043.4
        },
        {
            "text": "a **** on a Call of Duty tournament, but you know, I never want to do that. Can I play Gone Home 3? Yeah, you can play Gone Home 3,'cause it's easy. You just click click. Gone back home again. Click. Oh yeah, you know that's like Sarah's child. Can you still read it? It'd be like this though. I can't I don't know. You have at that point you'll be so wealthy, you'll have to pay you'll pay someone to read it to you. Sure . That's always such a weird thing. Comes out. Colin, are you scared of dying? Uh, yes and no. Um, I sometimes think about the moment of death and what that is and like what that's like because if if that's I have in my head this notion that death is more traumatic for the human body than we realize. And the only reason we don't really realize it is because you're dead. So like what I'm sure there's scientific answers to some of these things, but there's certainly no philosophical or spiritual answers to what happens or psychological answers. Like your brain shuts off, your heart stops and then it's just over. Like",
            "start": 1082.76
        },
        {
            "text": "to some of these things, but there's certainly no philosophical or spiritual answers to what happens or psychological answers. Like your brain shuts off, your heart stops and then it's just over. Like I don't know if I believe that. I think there might be like a little bit more. I'm not saying it's a years long struggle. I might be you when you die, it's might not be comfortable even if you're dying like in your bed in sleep. Mhm. You know what I mean? Like I I sometimes think about that. Like what is the act of dying like? You know, my mom died on the operating table when she was 10 and she had like a really serious disease when she was a kid and she died for a few minutes and she swears, you know, the white light thing and stuff like that. And I feel like that's probably more what it's like. And she was at peace and stuff like that. And I feel like your body is full of so much like endorphin at that point that it's just like it's just like a very peaceful and tranquil thing. But I sometimes fear",
            "start": 1131.88
        },
        {
            "text": "was at peace and stuff like that. And I feel like your body is full of so much like endorphin at that point that it's just like it's just like a very peaceful and tranquil thing. But I sometimes fear sometimes it could be like a horrible thing. You know, the thing that I think and I hate verbalizing this. I hate I hate hate verbalizing this because I believe in you know, I don't really believe in it, but you know, jinxing and stuff like that is that I've experienced death in deaths that have really affected me. But like my grandparents dying and my hockey coach in high school died and that was like one of the saddest like moments ever for me. Um, because he was a really good man. Uh, really important to me. Um, but no one in my immediate family has died yet. And you know, I knock on on wood for that. Like I feel like if my siblings, that's terrifying. Your mom is calling you right now. Yeah, that is weird. I um, I feel like if if um something happened to my parents or something happened to one of my siblings,",
            "start": 1164.44
        },
        {
            "text": "feel like if my siblings, that's terrifying. Your mom is calling you right now. Yeah, that is weird. I um, I feel like if if um something happened to my parents or something happened to one of my siblings, like I would lose my mind. Like and and and that so it's more the if I found out , God forbid, my mom passed away or my dad passed away, I'd be **** finished for a while. You know, like that's just I'm very close to them and that would be hard for me to accept. And so I'm not so like a life without one of them. Like where you like you can't call them or you can't you know, in my mind, for instance, I always have the thing, \"Well, if I fail, I can just go move home, right?\" You know, still 30 years old. Like I go home and like my mom can't do that. My mom's parents are dead. She like lives life without them. Her siblings are still alive. You know, they're great people. But I don't know. So I guess I just think about death affecting the people that are very very close to me. I've lost some friends, but none of my close",
            "start": 1203.64
        },
        {
            "text": "are still alive. You know, they're great people. But I don't know. So I guess I just think about death affecting the people that are very very close to me. I've lost some friends, but none of my close friends. In other words, I don't know if I have a realistic view of death because it's not hit very close to me yet. Like very close. Like it's gotten near me in some near misses with some people that have on the periphery of my life that I've I've lost and I've been sad about. But man, like one of my friends, good friends, or one of my like close family members , like my aunts or my uncles or my cousins. Like I it's just not happened yet. And I hate verbalizing. I hate it because it's like such an eerie kind of thing. You it's inevitable. It's inevitable. It could be maybe I'm the first one that goes, you know what I mean? But it's it's it's terrible to think about. What what did he die of? And the doctor's just going to pull up a giant jar of empty mayonnaise and be like, \"I think we all knew this was the case. I think",
            "start": 1249.2
        },
        {
            "text": "but it's it's it's terrible to think about. What what did he die of ? And the doctor's just going to pull up a giant jar of empty mayonnaise and be like, \"I think we all knew this was the case. I think we all knew this is how he was going to go.\" Be like , \"ER doctor, how did you get this empty bottle of mayonnaise?\" I get too. Cheryl gets mad at me because she always bothers me about my diet. But I work out, you know, a lot. And and when I when I got my endoscopy in November, I think I told you this, the nurse dead serious was like, \"Are you an athlete?\" And I'm like, \"I was, but I'm not anymore.\" And she's like, \"You have the blood like blood pressure of like a really like hardcore athlete. Like your blood pressure is like perfect.\" And I'm like, \"How's that possible?\" You know? And she was like, \"I don't know. He's working really hard because you're sweating mayonnaise.\" So I tell Cheryl that and she's like, \"Oh.\" And she's like, \"You've lost like eight pounds in the last year or whatever.\" I'm like, \"Oh.\" And then I so Cheryl's like, \"You're",
            "start": 1290.08
        },
        {
            "text": "hard because you're sweating mayonnaise.\" So I tell Cheryl that and she's like, \"Oh.\" And she's like, \"You've lost like eight pounds in the last year or whatever.\" I'm like, \"Oh.\" And then I so Cheryl's like, \"You're eating bad. I'm worried about you.\" I'm like, \"I have I have the heart I have the heart pressure of an athlete.\" Yeah, your cholesterol is through the roof. Mhm. Oh no, but your blood pressure is amazing. Good and bad. Uh, so I I mean, so me dying personally, I think about this is one of the things I think about too is that in the moment I'm like, \"I could have probably died there.\" And it's it's it's one I just had one a few weeks ago where I just crossed the street without looking. Mhm. And a car was like I I wasn't in trouble at all, but there was cars coming both ways and like I just crossed the street like that. Five seconds later, I would have been **** dead. Mhm . And sometime then I like get stuck in my head and I'm like, \"That's **** up. Like why did I look?\" Yeah, you know, what was I what was I thinking even that I",
            "start": 1332.04
        },
        {
            "text": "five seconds later, I would have been **** dead. Mhm. And sometime then I like get stuck in my head and I'm like, \"That's **** up. Like why did I look?\" Yeah, you know, what was I what was I thinking even that I wasn't looking? So I get caught in those things. But more more or less, I get caught in in you know, what would I do if if someone really really close to me died? And it's I I again, I hate verbalizing it because I you know, but it's just it's just one of those things where I I feel good almost verbalizing because I've never really said it before where it's like that's the kind of stuff that scares me is like when what like how does that what is that like? I saw the way my mom was when her parents died and it wasn't **** pretty. Mhm. You know what I mean? So you know, I I especially when her dad died, like I was it was really not a pretty scene and I don't blame her. And I feel like I'd be **** 10 times worse than that. So um like beyond inconsolable if that kind of stuff happened to me, you know? So those",
            "start": 1372.92
        },
        {
            "text": "was it was really not a pretty scene and I don't blame her. And I feel like I'd be **** 10 times worse than that. So um like beyond inconsolable if that kind of stuff happened to me, you know? So those are the things I think about more than my own death. So no, I'm not afraid of dying necessarily, but I'm afraid of death and how it's going to affect me and the people around me like Tim was saying. And the idea of see death is one of those things that's permanent. You can't do anything about it. It's going to come and you're going to die. And it might be bad. It might be bloody. You might be killed. You might have cancer. You might die in your sleep. It's like, \"Oh, but you're going to die.\" And it's like one of those things that is is scary. And every day you live on this Earth that you're closer to that day. And that's kind of a **** up reality of our lives. So that's why I think we don't verbalize it, but it's it's it's in our minds in different ways. The it's built into our DNA to accept, acknowledge and",
            "start": 1409.08
        },
        {
            "text": "and that's kind of a **** up reality of our lives. So that's why I think we don't verbalize it, but it's it's it's in our minds in different ways. The it's built into our DNA to accept, acknowledge and appreciate and fear death , you know? Because it is one of those things where you break your arm like we were talking about before. Your arm heals. You're dead and you're **** dead. Yeah, know. And and you're gone forever. And so I I don't know. I think about it in a philosophical way. I think about in a personal way. But I I definitely most think about it in a way that that scares me most. And that's uh that's what the people that I really love. Because you I have people in I I have lots of friends and and acquaintances and people I really care about. But there might be 20 people in this world that I really love, you know ? Like love and would do anything for. And poor. Well, I feel that way about the four people, you know, the people in this company. I feel that way about my siblings and my parents. I feel",
            "start": 1446.32
        },
        {
            "text": "love, you know? Like love and would do anything for. And poor. Well, I feel that way about the four people, you know, the people in this company. I feel that way about my siblings and my parents. I feel that way about my good friends from home, my good friends from college. And that's basically it, you know? Like like it's not to say I don't like or you know, but it's just like there's just a core group of people that you know mean a lot to me. And um, you know, even though I've had friends die, I've a friend die in high school and stuff like that. It it was very sad. What you know now as an adult, you know, Mike Pope or Ramon or one of these guys that I grew up with. Like, you know, that would be a terrible thing. You know, be **** awful. So those are the kinds of things I think about. And that's what I was curious about. I was mulling it over actually not too long ago. And so I actually wrote it down in my phone so I can remember it. I had a uh I mean when my grandmother died and I'm with you as well where I've",
            "start": 1487.24
        },
        {
            "text": "about. I was mulling it over actually not too long ago. And so I actually wrote it down in my phone so I can remember it. I had a uh I mean when my grandmother died and I'm with you as well where I've been fortunate enough to still have all my close family and friends still with me. When my grandmother died though, it was a fascinating experience. Um, she was very old. She I think she died well into her 80s, which is great. And she had a obviously a huge family. Five kids, uh three, four grandkids. Um, and a number of siblings that she had had on her side too. She comes from one of those old school Jersey Italian families where it was like just don't stop having kids. Like a just a kid factory. And like eventually to the point where like the ninth kid's like, \"Who are my par who the hell are you people? I don't know what's going on.\" But one of the cool things that I saw that that I got to witness was when you see a family that was pretty tightly knit at the end of one of their lives. And and I looked",
            "start": 1526.4
        },
        {
            "text": "I don't know what's going on. But one of the cool things that I saw that that I got to witness was when you see a family that was pretty tightly knit at the end of one of their lives. And and I looked around the room and I was like, \"Wow, like my grandmother had a lot of people around her that loved her.\" And like I saw her her brother uh crying. And I was like, \" I have a brother and if I'm lucky, maybe one day when I'm 80 or 85, like I'll I'll I'll get to live a life to this point where someone still will remember me and and cry at my funeral, but then also celebrate my life.\" Um, now we all know my brother. He is crazy. Um, and but but and I'm pretty sure he's gonna outlive me somehow. He'll figure out why. Uh, I hope he does at least because that's my other fear too is when I think about uh the people in my life, especially when you get married and you're like, \"I want to be with this person forever,\" and this person you've chosen to be with. Um, the thought of dying before my wife is just not possible. It's",
            "start": 1562.08
        },
        {
            "text": "my life, especially when you get married and you're like, \"I want to be with this person forever,\" and this person you've chosen to be with. Um, the thought of dying before my wife is just not possible. It's not going to happen. I'll take myself out of the equation well before that happens. And I always kid around with her too where I'm like, um, because I'm Italian, so I'm like, you know, but generally I statistically speaking, I think in most Italian families, the guy goes well before the woman. I mean, it's just the way it goes. I think it's because the the women feed the guy to death. Not quite sure if that's what it works. But like I think it's probably all my grandfathers, all of yeah, they've all gone well before their wives. Um, and a lot of my grand uncles. So I I tell my wife, I'm like, \"You know, statistically speaking, like in my family, I'm probably going to go well before you.\" And she's just like, \"Don't even talk about that.\" I'm like, \"No, I hope I do because literally the thought of living without my wife is is",
            "start": 1609.36
        },
        {
            "text": "like in my family, I'm probably going to go well before you.\" And she's just like, \"Don't even talk about that.\" I'm like, \"No, I hope I do because literally the thought of living without my wife is is paralyzing to me. I can't do it. I can't I could wouldn't even know what to do. It's too much.\" Probably going on a downward spiral of drugs. Yeah, well, that's well, you do enjoy Coke according to your shirt. Um, right, Kev. One of one of the things I'll say and and I I I don't necessarily want to leave it like this, but it's just just a word of advice because I I try to live my life like this in the face of these realistic kind of things that happen is that you should never leave any unsaid with the people that you love . And if I ever get into a fight with my dad or my mom and I haven't done that in a long time, but or if I get in a fight with a quarrel with a a friend or you know, Cheryl, whatever. I always before we go to bed or whatever or on the phone, whatever. Like I've called my mom back when I got an argument",
            "start": 1645.0
        },
        {
            "text": "but or if I get in a fight with a quarrel with a a friend or you know, Cheryl, whatever. I always before we go to bed or whatever or on the phone, whatever. Like I've called my mom back when I got an argument with. But you know, listen, I'm sorry. You know, like I don't want to you don't want to leave things like that because you never **** know, you know? And that would be even worse for you if you had a fight with, you know, your mom and then your mom you never resolved it and your mom passes away and that's it. No resolving that after that, you know? That's just a real dark and morbid and realistic thing that happens to people. And I think about would just be like my normal life with my mom . We never resolve anything. We just pretend like it doesn't exist. Oh no, I I I've I've I've said everything I've needed to say really to my parents that I respect and honor them and like love them and appreciate them and stuff like that. And even if we've gotten into little quarrels or things in the past, we haven't",
            "start": 1685.24
        },
        {
            "text": "to say really to my parents that I respect and honor them and like love them and appreciate them and stuff like that. And even if we've gotten into little quarrels or things in the past, we haven't flawed since I was really an adult. But I was even cognizant as a kid and a teenager . Like I don't want to leave things like this just in case. Um, and I feel way like I've talked about in the past and it's funny when you think about it, but it's really not like that. Mike and the Mechanics song, \"The Living Years,\" is like one of the most depressing songs ever because it's about how and everyone knows that song, but he's like singing about uh, \"Say it loud, say it clear, say it clear.\" And he he's singing about how like his he had like a huge fight with his dad and he had they had all this strife and he never resolved it. His dad died and he cannot say anything to him anymore. It's over. And he has like all these things he can say to him and it's too late. And that's like a real **** up but real thing that",
            "start": 1722.32
        },
        {
            "text": "resolved it. His dad died and he cannot say anything to him anymore. It's over. And he has like all these things he can say to him and it's too late. And that's like a real **** up but real thing that happens to people. And so I try to at least put in a position where God forbid one of these things happens. I'd I'd like to go before any of these people go. But um, so I don't have to deal. It's almost a selfish thing. I don't even want to deal with it. Um, that at least, you know, I don't have those kinds of regrets. So that's I would leave that with people. If you have something unsaid, you just had a fight with your girlfriend or your mom or your dad or something, maybe give them a call. Let them know it's okay, you know? So they'll feel better. You feel better. And you never know like when when something happens. So yeah, that's that's how I feel about that. Very up uplifting first topic on the this is why I really this is why I put you in the front of the rotation. Never. I like I like my topics. That was a good",
            "start": 1758.48
        },
        {
            "text": "So yeah, that's that's how I feel about that. Very up uplifting first topic on the this is why I really this is why I put you in the front of the rotation. Never. I like I like my topics. That was a good topic. Your topic's good. It was a good topic. Good. I also wanted to say real quick, I I said that I might have a group of 20 people in my life that like I really am ride or die for. I think it's probably bigger than that. I'm thinking about it. Maybe 30 people. You I got to throw my nieces and nephews in there. You're ride or die for them. Yeah, I am. They don't **** know what's up. They play touch games. **** about you. They do play touch games. They do give a **** about me. They're all we did. We we we what we helped one of them get socks made. Yeah, that that was those ever finished? Did those ever happen? I don't know what ever happened. That was dumb. Uh yeah, I got I got to expand it to that. So probably about 30 people were you know, I'd be sad if hundreds of people died, but I'd be destroyed if this one",
            "start": 1791.76
        },
        {
            "text": "person in this group of 30 or so. Yeah, if it leveled you. Oh yeah. Oh my God, I'd feel bad for you guys. It happened to me too because it wouldn't it wouldn't be pretty. Oh yeah, no, we have to put up with it. We could get mad at you about it . I'd probably disappear for a while. Yeah, and you're hole back there. We still see you. So he coming out. You call the island like it's the island from Lost. There's only one island. Like like we got to go back, Kate. We got to go back. Long Island. We'll just book a flight. It's easy. But see in Lost, they couldn't get back. They didn't know where the island was saying turns out it's because the **** island was Purgatory. I get that, Nick. And you can't just take a United flight. It someone watching Lost right now. Don't just stop watching it . That's what I'm saying. You're wasting",
            "start": 1828.84
        },
        {
            "text": "because the **** island was Purgatory. I get that, Nick. And you can't just take a United flight. It someone watching Lost right now. Don't just stop watching it. That's what I'm saying. You're wasting your time. You're wasting. Go to reruns of Seinfeld, which by the way, still worth like $700,000 a piece. It's crazy. They're great. Yeah, I'm sure I'm sure they are.",
            "start": 1873.36
        }
    ]
}