{
    "id": 958,
    "video_id": "oUERVTDjfJ4",
    "show_name": "The GameOverGreggy Show",
    "hosts": [],
    "title": "Favorite Disney Movies - The GameOverGreggy Show Ep. 81 (Pt. 1)",
    "description": "Tim Gettys discusses his favorite Disney movies.\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1434956400,
    "duration": 1594,
    "transcript_chunks": [
        {
            "text": "what's up everybody Welcome to The GameOverGreggy Show. I'm one of your hosts, Greg Miller. Over here, the producer/seducer, Nick Scarpino. Hello, Greg. How are you? I'm well. We are in harmony, you and I, today. Yes, we are. We've been singing goofy songs about pooping and things. I think we're through uh the planning phase for the most part, the bulk of E3. Now we're getting excited'cause we're into the fun part where we actually just go get to do it. Is that how you feel? Welcome, ladies and gentlemen. This episode was recorded long before E3. We're going to play it off, sir. We're going to act like we... I was going to be like, \"Man, I can't believe we got home so fast for E3 and recorded this show and had it up on Patreon.com/KindaFunny.\" So, well, just Kevin at 15834, bleep out everything. I... that's not... He said we were near two and then it's like 1508, whatever. Kevin out there is packing us up, man. I'll tell you right now, E3 sure was fun. Nailed it. **** killed it. Thank you. No, ladies and gentlemen, it's us.",
            "start": 2.85
        },
        {
            "text": "we were near two and then it's like 1508, whatever. Kevin out there is packing us up, man. I'll tell you right now, E3 sure was fun . Nailed it. **** killed it. Thank you. No, ladies and gentlemen, it's us, Kinda Funny, getting ready to go to E3. So we're all **** crazy. We pizza party today to raise morale and Nick and I's morale is through the roof. Nick didn't even eat the pizza. Yeah, the pizza party was something special. I had fun. Good. The Puro and Tim Gettys. I had three slices of pizza. Damn, that's all. I thought you... I thought you took three at the beginning. You never went back. Back. Interesting. I was working on **** but been working on shits. But yeah, when it happens, when the pizza party pops off, you got to get on it. Can't you can't look a pizza party horse in the mouth. I'm happy we had a pizza party'cause I was promised a pizza party at IGN, never got it. For by the way, Greg just said, \"You can't look at pizza party.\"",
            "start": 55.68
        },
        {
            "text": "party'cause I was promised a pizza party at IGN, never got it. For by the way, Greg just said, \"You can't look at pizza party horse in the mouth.\" So there's a new saying that you can't look at pizza party horse in the mouth. Earlier, you **** up on Colin Live and I didn't call you. No, I don't **** up. There was it was in the chat. I'm trying to remember what it was. No, you'll never remember. You'll have to go watch the entire show to figure out. Even then, I'd have to... It was the chat that called it. I remember what it was. Uh, it was the 55-minute rate you guys went on about backyard barbecuing and then you drew a graph that was literally, I think, years from now people will look at and go, \"Oh, that explains everything.\" That was the first time we knew the pride along Colin Moriarty was out of control. Good to be here with you today. Were geniuses, but they were twisted geniuses. Twisted. **** it was just examining the barbecue situation. That's all. I do feel like we are losing our grip on real reality.",
            "start": 94.12
        },
        {
            "text": "to be here with you today. Were geniuses, but they were twisted geniuses. Twisted. **** it was just examining the barbecue situation. That's all. I do feel like we are losing our grip on real reality. Quicker. Oh, definitely. I haven't left the house in three days. I was just done. Probably do it. I haven't left the house at all since Sunday. You don't need to. It's Wednesday. You got drones. We drone air drop you what. Went to the grocery store, got everything I needed. Got the internet. We're set. You got a toilet. You got 55 to 65 half drunk bottles of Arrowhead Water. You're good to go. Oh, I'm fantastic. I'm feel... This is not going to go bad. No, definitely not. Water. How many times have you refilled that particular bottle? Do you like four times probably? It's looking like it was Celtic. It said Celtic, like a Celtic Warrior. And you kept saying Celtic, idiot. Uh, we say Celtic in the United States. No, we don't. Yeah, we do. What are the what is the Boston basketball team call? I'm just curious. The Celtics. They're the",
            "start": 132.4
        },
        {
            "text": "Celtic Warrior. And you kept saying Celtic, idiot. Uh, we say Celtic in the United States. No, we don't. Yeah, we do. What are the what is the Boston basketball team call? I'm just curious. The Celtics. They're the Celtics. Okay, good. Okay, just curious. Just curious about, you know, that you know about the only usage of a word in American English is the basketball team that we've been calling the Celtics for like 100 years. Amy Gilroy fell off her pot of gold over in Ireland and couldn't believe her **** ears. Was she a leprechaun? I don't know what I don't know what to I don't know what to tell you about that. I'm you know, you screwed up. I'm half-Irish. I didn't screw anything up. We don't... This is the thing that bothers me is we do not say words the way that they're said in their native languages. English is an amalgamation of a lot of different words. A lot of them come from many of them come from Latin. You don't see us speaking **** Latin over here . We Americanize your words. We slaughter it. I don't roll my R's. Yeah, I don't",
            "start": 172.12
        },
        {
            "text": "a lot of different words. A lot of them come from many of them come from Latin. You don't see us speaking **** Latin over here. We Americanize your words. We slaughter it. I don't roll my R's. Yeah, I don't say churro. Say Ruffles. Ruffles. Oh, yeah , you don't. You're right. Good call. You know, it's it's the niche and niche is the great word. It is. It is niche. The word is niche. There's no A over it if we're talking about the salad. So in in in in French it would be niche or niche, you know, niche. But in English, in American English, it's a niche. It's true. We know. No, I'm not done. I'm show. No, you can keep going. Oh, thank. Now rub a little bit. There it is. Each and every week, four some... Oh, yeah, right there . Each week, four sometimes best friends gather on this table. Not yet. Is your pish getting hard? No, my pish isn't getting hard. What's the what do you guys call what's the the new no Pik Pik? Yeah, I like that. What's my grandmother would just randomly throw in extra vowels at the end of everything? She sounds like it's like how",
            "start": 208.48
        },
        {
            "text": "what's the what do you guys call what's the the new no Pik Pik? Yeah, I like that. What's my grandmother would just randomly throw in extra vowels at the end of everything? She sounds like it's like how everyone would say, \"Oh, you want...\" So that's a good example is my Italian family, you know, being like, \"Oh, you got, you know, we have some, you know, spaghetti. We got, you know, pastas, some prosciutto.\" Uh, I'm like, \"It's prosciutto.\" It's and like, \"Oh, you want some mozzarella?\" I'm like, \"It's mozzarella.\" Mozzarella. Yeah, but my my whole Italian side of my family does that. It's a good example. It's like, \"We've been here since 1900.\" Yeah, yeah. You call... Don't say that anymore. Yeah, stop asking me if my pish is clean. I'm 30 years old. Yeah, my mom my mom says uh she has a few of those par sayings left. She says Agita all the time. Oh, Agita is a great word. I use that word a lot. Which one does that mean? It just stomach and digestion. Stomach indigestion. She's like, \"Ah, but but she uses it to for just a total different like she'll use it for just a myriad",
            "start": 256.6
        },
        {
            "text": "I use that word a lot. Which one does that mean? It just stomach and digestion. Stomach indigestion. She's like, \"Ah, but but she uses it to for just a total different like she'll use it for just a myriad of reasons.\" Like, you'll piss her off, she'll be like, \"No, you give me Agita.\" She'll be like, \"You give me the Agita,\" or, \"You're upsetting my Agita,\" or, \"My Agita doesn't like that,\" or, \"Hey, you and my Agita should go **** off.\" Whoa, I made the last one. But I mean, I wouldn't put that past my mom. She's very she's very flowery when she gets angry with her language. The coochie, Nikki, that was my grandmother would always said, \"Nikki, did you was your **** did you wash all the kiki out of your ****?\" And I'm like, \"Grandmother, I'm 17 years old. Yes, I have. If I haven't figured out how to wash my ass at this point, it's never going to happen. You don't have to worry about out of the coochie you poop out of your butt.\" Yep. E, bring a random topic of discussion for your amusement. If you like that, you can go to Patreon.com/KindaFunny each and",
            "start": 303.4
        },
        {
            "text": "you don't have to worry about out of the coochie you poop out of your butt. Yep. E, bring a random topic of discussion for your amusement. If you like that, you can go to Patreon.com/KindaFunny each and every Friday to get the show a whole week early. If you don't have any money to give us, no big deal. Go to YouTube.com/ KindaFunny. Day by day, topic by topic, it's broken out for your amusement for nothing. Then on Friday, we put the whole show up for free as a video and an MP3. Thrizzle. Tim, you begin. Oh, I begin. You like that? We didn't we didn't go over over. I want to talk right to you. Going to do your all right, all right, all right. My topic today is going to be, what is your favorite Disney movie? Now, the reason this comes up is I saw this really, really cool picture on the internet. It's this thing you might have heard of. There's uh remember the Disney movies of the 9 0s when they released the VHSs and they in those big ass puffy the big puffy VHS cases? It's like only Disney did it, but then sometimes",
            "start": 340.48
        },
        {
            "text": "have heard of. There's uh remember the Disney movies of the 9 0s when they released the VHSs and they in those big ass puffy the big puffy VHS cases? It's like only Disney did it, but then sometimes things I hated those things with a passion. They threw off your whole they threw off the aesthetic of my VHS tape collection. And know as you guys all know, I hate that. Like I want my collection to be a damn collection. But what I did like is that they they standardized it. So at least all your animated films, your collection of those would you couldn't do it alphabetically. You had to do it by like by genre. And so you'd have like the Star Wars movies and then the Disney animated films that were like this big and then back to the regular size VHSs. It was rubbish. Yeah, but they deserve to marketing. I had Ghostbusters one and two on VHS in those same puffy case. Well, yeah, so I feel like they revolutionized and then a bunch of other **** started copy. That's when you knew you had like a film. Yeah, you",
            "start": 384.68
        },
        {
            "text": "Ghostbusters one and two on VHS in those same puffy case. Well, yeah, so I feel like they revolutionized and then a bunch of other **** started copy . That's when you knew you had like a film. Yeah, you didn't have a movie you were picking up from Blockbuster. You had a **** piece of art right there that needed to be protected. Ex. And then there was like Bal to and all those like knockoff ass animated films. Where do you stand on because I had a couple because we forgot to take them back of the ones that open up like this, not the puffy cases, but the actual like VHS rental cases that you like and open them up. I loved those. I thought that's Blockbuster case. Yeah, but Blockbuster would take eventually just printed out like the name of the movie on it. And when they give it to you back in the day, I used to go to um I used to go to Video Wiz and they would actually have the cover on it. Oh, which would be cool. So you you get it and it would be by by the 15th or 16th time you got it or like someone rented",
            "start": 425.28
        },
        {
            "text": "go to um I used to go to Video Wiz and they would actually have the cover on it. Oh, which would be cool. So you you get it and it would be by by the 15th or 16th time you got it or like someone rented it. It was like chewed up and looked like someone's dog ate had eaten it. But it was awesome. And then if and then they figured it out, they could just like sell stores. How weird was that? Yeah, man. Yeah, they were awesome. Yeah, you just don't think about it anymore. I know. I would spend so much time just going to Blockbuster or I forget what the other one was called near my house, but like Video Villa. That was was there was there was a Hollywood Video. I never **** with Hollywood Video. By the time they came around, I was like, \" I'm Blockbuster, ride or die. I'm not **** around here.\" Yeah, um but there was, you know, little like mom and pop ones. Like there was a couple of those and I liked those a lot. And those were the ones that had the porn in the back. And so being titties. But um, you know, yeah, you casually",
            "start": 462.28
        },
        {
            "text": "know little like mom and pop ones. Like there was a couple of those and I liked those a lot. And those were the ones that had the porn in the back. And so being titties. But um, you know, yeah, you casually walk by like your you're a seven-year-old pretending like you're interested in French New Wave Cinema. It was always that. And right behind the doors was the point. Like, \"Go, D. I should check this out.\" You're jacking off in the in the back of Video. Why not? Not you got to do. Anyways, we're way off topic. Okay, going back to the topic. So I saw an image on the internet of someone made a Frozen VHS in that style. And I was like, \"That's **** cool .\" And it's like something that I never would have thought about just'cause like those things have been out of my mind for surprisingly long for me being me. So that made me start thinking about the collection. I started talking to a couple of my friends just about what their thoughts are on different Disney movies because depending on when you were born, like you the",
            "start": 497.04
        },
        {
            "text": "me start thinking about the collection. I started talking to a couple of my friends just about what their thoughts are on different Disney movies because depending on when you were born, like you the you stopped watching them at different times, you know? So I feel like I have fond memories of say Hercules or Pocahontas and like Tarzan era than you guys would. One of those movies was good. Okay, Pocahontas. Pocahontas. Well, see, see, Pocahontas is the one that we decided is kind of the the teetering point of the... It is the end of the Golden Age. It is. But it doesn't necessarily qualify as Golden Age. No, no, definitely doesn't. Uh, no, I would say it does. Golden Age ended, I think, with Lion King . No, I mean, Pocahontas was the was the... Oh, wait, we break out a list of Disney movies. We did one movie too many. Like that was'cause I mean, Pocahontas was huge, man. It's like Mel Gibson, didn't he do the voice of uh the main character, John Smith? Then who was the the who actually played Pocahontas? So we know no idea. Um, anyway, I just",
            "start": 542.48
        },
        {
            "text": "'cause I mean, Pocahontas was huge, man. It's like Mel Gibson, didn't he do the voice of uh the main character, John Smith? Then who was the the who actually played Pocahontas? So we know no idea . Um, anyway, I just remember that movie being huge and then seeing it and going, \"Huh?\" Like it just was missing the M. Like The Lion King still, you watch that to this day. Yeah, is a piece of art. It is so beautifully done. Um, then you come back and watch Pocahontas. And the other day, I literally uh it was like six months ago, I watched Hercules because it's on Netflix. I was like, \"Oh, I've never seen this.\" And then I watched the first 10 minutes of, I'm like, \"Oh, no, I have seen this.\" I couldn't get through the first 10 minutes and I still can't get through it. I I had to put it down. I was like, \"I can't stand this movie.\" Yeah, Hercules is weird. I remember I love it, but it's different. But I so the Golden Age , we got Little Mermaid, Aladdin, Lion King. No, wait, Little Mermaid, Beauty and the Beast, Aladdin, and then Lion King was",
            "start": 590.44
        },
        {
            "text": "is weird. I remember I love it, but it's different. But I so the Golden Age, we got Little Mermaid, Aladdin, Lion King. No, wait, Little Mermaid, Beauty and the Beast, Aladdin, and then Lion King was Little Mermaid before Beauty and the Beast. Yes, it was. Little Mermaid was'89, November 17th, 1989. Yeah, so then those four are like the undeniable Golden Age, right? Then you get into there's some in there too. Rescuers, isn't there? That would be in the Golden Age. Golden Age. Yeah, I love Rescuers. Well, I mean, if we're going back, so starting with Lion King and then going backwards in time, they have it as Lion King , Nightmare Before Christmas, Aladdin, Beauty and the Beast, The Rescuers Down Under, DuckTales the Movie, The Little Mermaid, Oliver & Company, Who Framed Roger Rabbit, The Great Mouse Detective, The Black Cauldron, The Fox and the Hound, The Rescuers, The Many Adventures of Winnie the Pooh. Now we're getting into it. Now we're in the now we're getting into the good stuff. The good stuff. Yeah, so there's a there's a",
            "start": 628.4
        },
        {
            "text": "Cauldron, The Fox and the Hound, The Rescuers, The Many Adventures of Winnie the Pooh. Now we're getting into it. Now we're in the now we're getting into the good stuff. The good stuff. Yeah, so there's a there's a lot of stuff. Then obviously, there's the original **** back in the day. We got the Snow White, Cinderella . I was never into those. The only one that really stands out for me was the uh when they did Robin Hood. And I remember watching Robin Hood in I was in Italy and it was one of those trips. I was too young to really be going around Italy for like three weeks with my parents and my brother. So I was so **** bored and I had zero interest in anything other than watching movies and eating at the time. So I had half that covered in Italy because the food's amazing. Um but I I remember going over to one of our cousins'houses in Rome and sitting down and having them go, \"Hey, we've got this.\" And it was the American version of uh Robin Hood. And did the Disney movie. And I was like, \"Pop that in right now.\" And I",
            "start": 669.2
        },
        {
            "text": "our cousins'houses in Rome and sitting down and having them go, \"Hey, we've got this.\" And it was the American version of uh Robin Hood. And did the Disney movie. And I was like, \"Pop that in right now.\" And I just I watched it like three times. Well, that's that's what I was going to say say was yeah, the music's awesome. And Robin Hood's my favorite Disney movie. Really definitively. Yeah, my top three is is Robin Hood, Peter Pan, and Fox and the Hound in that order. I love I so Robin Hood's early 50s or or Peter Pan's early 50s. Robin Hood's 70s. Fox and the Hound's early 80s. And I think those capture the essence of of what era would that be called then if if... Well, that's what I'm saying. Like to me, that is the Golden Era. Like I feel like I feel like I feel like Little Mermaid and Rescuers brought it back for me when I was a young kid. Never saw Rescuers'89. **** awesome. Gold like Golden Era. I think really is just those four movies. Depends on your age though, because like, you know, an animation nerd like my",
            "start": 704.72
        },
        {
            "text": "brother loves those movies, but is much more impressed with the like with, you know, I think and the generally older probably animators stuff would be much more impressed with something like Fox and the Hound or something like that. So I think it is something that is up to your interpretation. I feel like that was when Little Mermaid specifically is when Disney movies became very, very, very big. Very, very big. And that was the first one I remember seeing in the theater too. It came out'89. I was like five or six. Um and I love Little Mermaid. I remember getting the tape that you're talking about. I remember that very well. Um and I liked Lion King. I wasn't a huge fan of Aladdin. And so Aladdin's my favorite. I love that movie. It's a good movie, but I wasn't I was, you know, I was okay. I was like, \"It's fine.\" I have no",
            "start": 745.32
        },
        {
            "text": "Modern Love for the Disney movies. I don't I don't look back and think of them nostalgically or anything like that. But I think Aladdin is the one I remember I got and watched a lot. Wat ched it over and over again. And then right behind that was Little Mermaid. And then the rest I didn't give give a **** about. Not even Lion King. No, Lion King especially did not work for me. I I I was just too old for it. I grown up. I had seen Superman comics. I had things to do. Not see **** kittens rolling around spelling out sex in the dust. Be you want to be more in reality like rooted in reality. Want to see some people who could fly and shoot beams from their eyes. Yeah, that makes sense. The crazy thing to me is is I'm looking at this list. The list becomes so bulbous and full of whatever the **** it is at you",
            "start": 786.84
        },
        {
            "text": "who could fly and shoot beams from their eyes. Yeah, that makes sense. The crazy thing to me is is I'm looking at this list. The list becomes so bulbous and full of whatever the **** it is at, you know, by the 2000s. There's so many **** movies, man. When you look at these lists though, they count a lot of the the straight to VHS, straight to DVD , or straight to Blu-ray. No, Aladdin 3, uh King of Thieves or something like that. So good. It was good. Thank you, Kevin. Thank you. There's certain Disney sequels that get shot on and they shouldn't. Little Mermaid 2 does not deserve hate. What is about what's the give me the plot line? What happens to Sebastian? I just want to know what happens to Sebastian. The daughter of Ariel and the prince. Mhm. What she got to go back to the water? Yeah, yeah, it's kind of the opposite story. She wants to live under. Yes, that seems like an easy sell for Sebastian. Is he dead? Is he alive? Sebastian is definitely not dead. But yeah, crap, right? He's awesome. Aladdin 2 and 3",
            "start": 825.36
        },
        {
            "text": "the opposite story. She wants to live under. Yes, that seems like an easy sell for Sebastian. Is he dead? Is he alive ? Sebastian is definitely not dead. But yeah, crap, right? He's awesome. Aladdin 2 and 3 are awesome. Lion King 2 awesome. Pretty much any of the other sequels. Bambi 2 not good . Little Mermaid 3 **** atrocious. Yeah, I mean, you really don't want to include any of the sequels when you're talking about Disney movies just'cause I think a lot I don't think that's true. I think largely they those were they didn't put the resources, the heart in those they did into the originals. And so I mean, you can you can keep them in consideration, but no one's going to the original Little Mermaid's going to be way better than any any anything else that came out afterward. I mean, yeah, the resources were totally like the animation's garbage comparatively'cause it it was like the um TV Animated Series team working on. Which by the way, shout out to the **** animated series of Aladdin and Hercules and Little Mermaid.",
            "start": 865.0
        },
        {
            "text": "like the animation's garbage comparatively'cause it it was like the um TV Animated Series team working on. Which by the way, shout out to the **** animated series of Aladdin and Hercules and Little Mermaid. They're all good. They're all great. Yeah, we're not we're not criticizing them. They just have they have way more limited resources and way quicker timetables to work with and made a movie. What's the read on Hunchback of Notre Dame? Was that a good one? So that that also counts into the depending on your age. Like I that was the first one I think that I didn't see in theaters. Okay. Like there was that. There's Lilo & Stitch. There's Atlantis: The Lost Empire. A Bug's Life. See that that's Pixar though. It's all in the can we that's I was going to ask, can we count the Pixar movies? I would like Pixar is its own thing. Can we count Avengers? No, Star Wars. I'm going to I'm going to say I'm going to say this real quick, B-man, here. Anywhere I'm looking, I'm looking at the list. The last of these movies literally, and this",
            "start": 910.12
        },
        {
            "text": "can we count Avengers? No, Star Wars. I'm going to I'm going to say I'm going to say this real quick, B-man, here. Anywhere I'm looking, I'm looking at the list. The last of these movies literally, and this is including all of Disney's movies, like Disney animated movies, including Pixar's movies, the last one I saw all the way through and I saw in the theater was Mulan. That was in 1998. Mulan, which is **** awesome. Yeah, I actually really like Mulan a lot. And I saw the theater in Philadelphia. My brother, I remember I don't remember liking it. Mulan's great. There's so many there's a Bambi 2. How the **** is there a Bambi 2? It doesn't even make any sense. You backstory. Yeah, it was genius. It was it was actually a prequel. Bambi's mom, Lu, is her mom finds love. It's like Full House up. Exactly like Full House. It's Fuller House. There's so many like I can't I don't even know what I like. Some of these might even be fake movies. Like The Secret World of Arrietty. Arrietty. The hell? I've never heard of that in my life. I",
            "start": 951.72
        },
        {
            "text": "house. There's so many like I can't I don't even know what I like. Some of these might even be fake movies. Like The Secret World of Arrietty. Arrietty. The hell? I've never heard of that in my life. I think that's a um wait, that's a Japanese. Japanese is a Japanese anime film. This is all just in a Disney. Maybe these are just Disney. But I think Disney may Disney film. Yeah, The Secret World of Arrietty is yeah, that's Ghibli. Those might that was a legitimate animated movie. Pixar. Those those might have been put out by like subsidiaries of Disney. Like I think Disney owns all these **** I've never even heard of any of these movies. Studio Ghibli. Yeah, well, I mean, they released their Blu-rays. So well, that makes sense. They might not own them. Distribute. I mean, Disney, there's Disney Studio Ghibli. They do that. I would I would not be surprised. Is that old? Huh? Studio Ghibli is amazing, by the way. Have you guys watched that documentary about them? I think I brought it up before. It's on Netflix. It's genius. It's it's called The House of uh",
            "start": 994.28
        },
        {
            "text": "Dreams and Madness. And it's about um Miyazaki doing his last film. And it's it's amazing. I mean, they still it's like a tiny little studio that they built from the ground up. Um three stories. And he just has a little corner. And like he does all of his storyboarding. Like he does he writes the script as storyboard. So he doesn't write a script. He just like actually draws as he's going to to write. So it takes him forever to do this stuff. But it's cool to watch like how they do all the ADR and all that stuff for animated stuff. It's really it's worth to watch. And plus he's a those that team is just genius. The Studio Ghibli guys. They're they're so incredibly talented. It's sad that was the Jesus. Yeah, I remember, you know, I watched a lot of anime with my brother when I was a kid. And I remember, you know, we've talked",
            "start": 1041.28
        },
        {
            "text": "about before watching Bubblegum Crisis or Ranma ½, whatever. And they were fun and they were good. But I remember Princess Mononoke being the first thing I'd ever seen except for maybe Ranma uh where um and obviously Akira. But other than those, like where I was like, \"This is insane.\" Like I remember seeing Princess Mon onoke being like, \"This is an this is absurd how good this is and like how beautiful it is.\" And and obviously I was a fan ever since. And it was so cool to see them cross over Level-5 to do Ni no Kuni'cause that was **** awesome. Like that they did a a video game and it was and it was and it was gorgeous and it was fun, you know? Um really a lot of talent. You would get a kick out of this documentary then'cause really it's like it just shows how they do it. And it's it's such a painstaking process to hand animate",
            "start": 1081.56
        },
        {
            "text": "was fun, you know? Um really a lot of talent. You would get a kick out of this documentary then'cause really it's like it just shows how they do it. And it's it's such a painstaking process to hand animate things. And they don't they still hand animate everything. And you'll they'll they'll show the guys doing the background boards in like watercolor. And like, \"Is that really?\" And then they take a picture of it and that's just the frame of the background for the movie. You're like, \"That's **** insane, man.\" They don't do any they don't go back in and I'm sure they retouch it a little bit here and there. But it's pretty talented. But that's what Colin was saying to bring it back to the Disney topic. Which that I think too many it depends on who you ask. If you ask if a 40-year-old or a 50-year-old what was the Golden Era of Disney, they would say, \"Oh , it's got to be Snow White. It's got to be bouncing around.\" Yeah, like when he was when they were still really when they first popularized the release of the",
            "start": 1121.0
        },
        {
            "text": "the Golden Era of Disney, they would say, \"Oh , it's got to be Snow White. It's got to be bouncing around.\" Yeah, like when he was when they were still really when they first popularized the release of the animated film. That's probably when people a lot of people would think about it. But I agree that like like right around um The Little Mermaid is when they brought storytelling up into the into modern era where, you know, up until then, you're like, \"I don't know what's going on here.\" But they that had a lot of humor, a lot of depth and was not particularly aimed toward kids. And it was still a play on if I'm not mistaken. I think it's still a play on uh uh the story line is actually taken from um not mythology. Um I mean, almost all are. Yeah, all of them are. They're they're not original. Yeah, except maybe for The Lion King. But I'm sure that that's based on lying to. Are you joking? What's that? Hamlet? Is it Hamlet? Yeah, okay. Oh, he's singing in The Hunchback of Notre Dame. Original IP from Disney. Yeah, no, I'm",
            "start": 1154.68
        },
        {
            "text": "pretty sure like every Disney movie is taken. It's just a retelling of some story. Do Shakespeare. Yes, don't you? Yes, I didn't real I didn't put that together two and two that it was Hamlet. I didn't know that. That's funny. Oh, I thought yeah, I thought you were. That makes total sense. I didn't realize that. Yeah, um but man, what what's your favorite, Greg ? Which one did you say? I said Aladdin's number one'cause I remember distinctly getting Aladdin for Christmas and watching it non-stop while playing on my Sega Game Gear Jeopardy! Oh, okay. Had a Jeopardy! on the Sega Game Gear. How'd you fair on that? I was **** kicking his ass. Now, granted, not that many questions. So after a while, after a while, you pretty much everything. You're going for the perfect game. Alex, why do you call me Alex? I'm not Alex. Alex. No, but you",
            "start": 1196.04
        },
        {
            "text": "his ass. Now, granted, not that many questions. So after a while, after a while, you pretty much everything. You're going for the perfect game. Alex, why do you call me Alex? I'm not Alex. Alex. No, but you looked at me and you were like you you were like in that space again when you were a kid. You just zoned out for a second. You scare me sometimes. You terrify me. M. I feel like if you Google Disney Golden Age, like people that's a thing. I feel like they'd be referring to Disney. I bet too . There there'd be some good stuff. But uh there'd be it would be the the early 90s movies. And I think that's just because it was like back to back to back to back successes. Everything that was coming out was awesome. Like Pixar. Yeah, and they were coming and they were coming out way quicker. You have to understand that from, you know, Snow White kind of era and even before that, obviously Fantasia and all of that through Fox and the Hound and up until Little Mermaid, they were releasing a movie like every few years of that. So it",
            "start": 1240.12
        },
        {
            "text": "was a big it was yeah, it was like they really ramped up, I think, and started funding more movies where like between Little Mermaid, Rescuers, Aladdin, Lion King, Pocahontas, all like all came out within like 10 years of each other. I mean, they essentially annualizing like movies and they became event movies and all that stuff . And they had a system where they would release the VHS and, you know, it would be the half year and then the Vault and all this ****. So they knew they knew what the **** they were doing. But then what happened is the Toy Story came out and it started this CG thing with Pixar. And they were competing. And that is when I think people started losing interest in the classic Disney animated animated movies because then that's when the we started seeing the um um Mulan and Lilo & Stitch and",
            "start": 1278.28
        },
        {
            "text": "competing. And that is when I think people started losing interest in the classic Disney animated animated movies because then that's when the we started seeing the um um Mulan and Lilo & Stitch and Atlantis: The Lost Empire and that type of stuff. And then Disney. No, that was like that's way later. And that actually kind of bring back like the Renaissance of that revitalized Emperor's New Groove. Yeah, so a lot of Emperor's New Groove. It's mixed a little bit. But people refer to that period that you're talking about as the Renaissance. Renaissance. Not the Golden Era. The Golden Era is when they actually like popularized it with Steamboat Willie and going all the way up to the release. But yeah, a lot of people say the'89 like starting around the late'80s is the Renaissance when they had a Renaissance of, you know, coming up amazing ****. Yeah,'cause then then they did they made Chicken Little. Chicken Little, which was like a CG like um not stop motion. It was Disney's first CG like fully CG movie. And it was ****",
            "start": 1316.12
        },
        {
            "text": "trash. And that like ruined them. And then they put out a bunch of things that were no good like Brother Bear and um Home on the Range or some **** like that. I don't know. There was a bunch of stuff that was really bad. And then Princess and the Frog came out. And that kind of like revitalized. And that brought it back to the handdrawn animation that I don't think we're ever really going to see again'cause that was a success, but not a big enough success justify the what. Then you see things like Frozen. And you're just like, \"All right, well.\" It's funny too. The handdrawn animation is is really expensive now too. It's it's funny that like doing a movie like Toy Story, they're still very expensive to do. But that was like enormously expensive. And the story behind Pixar and all that fascinating. Um but that was",
            "start": 1356.6
        },
        {
            "text": "like really exorbitantly expensive. But now you're seeing like a it's being like transposed now where we were talking about this with Egoraptor with with pixel art and and Bloodstained and Castlevania stuff where just way cheaper not to do like hand animations and handdrawn stuff anymore, unfortunately. So technology just kind of reached that point where it's like it's easier to just 3D model things and just animate them as they go instead of having to handdraw every single frame. Right. But I I still like the look like The Little Mermaid. I'm not sure probably. But certainly in the'90s, like all of those were computer assisted. So so um that's why I like the look of something like Fox and the Hound . I think Fox and the Hound's **** gorgeous. Or Robin Hood. Those are hand animated and actually just hand animated, you know, and",
            "start": 1397.56
        },
        {
            "text": "then filmed like in some you probably know more about it than take picture of it. Yeah , and my my like and you can see how crude it is and how the I love it. I love watching the animations. And there's like flubs and **** up things in it. Like where like and they just and it just keeps going as opposed to these more computer assisted kind of things that are pretty. And they're still handdrawn like The Little Mermaid was, but it was computer assisted. It's like the way my brother animates now where he draws everything by hand, but it's on a computer as opposed to as opposed to, you know, way and flipping. Yeah, you're seeing that with everything though. Like I just started watching Attack on Titan, right? And you're seeing that their a lot of their coloring and a lot of their lines are are very, very digitally drawn.",
            "start": 1437.16
        },
        {
            "text": "they're still drawn. They're still hand drawn, but it doesn't have that shaky or not shaky like squiggly look that a traditional handdrawn line draw. I mean, we we're gone from that. We've been away from that for a while. It's a shame though, because I feel like that that's why I like that's why Robin Hood, Peter Pan, and Fox and the Hound are my favorites because they have that essence and that spirit. Yeah, of what it was to make an animated movie. And how I'm not saying it's easy to make that stuff now. It's certainly not easy. But how **** grueling it must have been to make those movies. And why and that's why it took them forever. Funny too though,'cause when you look at that and there's so many like things on the internet about this now, but they would just like essentially copy and paste techniques",
            "start": 1476.32
        },
        {
            "text": "over all those old movies. Like they would reuse animations all the time. That was what's hilarious in the'80s was so so popular when you'd watch an'80s cartoon show series and you'd be like, you don't really realize that. See, watch when you're adult, you're like, \"Holy ****, that same explosion or that same like airplane going down.\" It's like the Wilhelm scream. Once you see it, you can't unsee it. Yeah, you can't see it. But yeah, they had to they had to do that. But there's dance scenes in like Snow White and Robin Hood and all that. And they're like literally the exact same exact same thing. Yeah, there's a YouTube video on that. I think I saw that. And there's a whole bunch of it like throughout those old movies. And I love stuff like that. Like it's interesting to me. And then it's funny because I have a",
            "start": 1510.2
        },
        {
            "text": "different approach where like I love Aladdin so much because I loved the the super clean like HD look of how the drawings looked because it was computer assisted. And you can see the difference between like Aladdin and Aladdin 2 and 3 because those were a little more cheaply done. And uh it's like, \"Man, quality animation is a **** beautiful thing.\" And that's why like Princess and the Frog is gorgeous to look at because it's like it's just perfected. It's perfected using computers and stuff. But yeah, I hope we see more of that. But I don't think we ever will. No, it's over. Computers have won.",
            "start": 1545.52
        }
    ]
}