{
  "id": 956,
  "video_id": "PfsOmC5jTuk",
  "show_name": "Gameplay",
  "hosts": ["Greg Miller"],
  "title": "Let's Play Massive Chalice - Kinda Funny Plays",
  "description": "Greg gives Massive Chalice on Xbox One a test drive.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
  "published_at": 1434999601,
  "duration": 3280,
  "transcript_chunks": [
    {
      "text": "what's up everybody welcome to another let's play here on youtube.com/ Kinda Funny Games I'm Greg Miller and I'm in the room where we do Colin & Greg Live where we do uh the Gamescast where we do GameOverGreggy Show we do our shows and as you know when I'm in the room by myself it means I'm going to do a long let's play for you so today we're playing Massive Chalice of course this is a Double Fine game Brad Muir's baby and you know I don't I never talk about this on this channel but I used to have another job over at this place called IGN and there I got to do a demo of Massive Chalice I had Brad on up at noon and I loved what I saw so when I found out it was finally out on Xbox One that indeed it was free for Games with Gold or whatever this month or deals or whatever the hell they call it I was excited your first game recommend you play a normal difficulty sure yeah let's do it game name game one I can't change the game all right choose between thematic Nona Heroes many of which now I",
      "start": 0.04
    },
    {
      "text": "I was excited your first game recommend you play a normal difficulty sure yeah let's do it game name game one I can't change the game all right choose between thematic Nona Heroes many of which now I want to be thematic difficulty normal balance start Iron Mode I'm not ready for Iron Mode and a tutorial so you know usually what happens is we jump into these games right in a let's play and it's like 15 minutes we already kind of know the game or we're giving you first blush I wanted to jump in and you can basically play along with me and see what's up cuz what I'd seen I'd like so Random House, Random House here we go I get to select a house now of course what do you got here in the Gs you got any all right because they did this this is of course was uh another one of their Kickstarter games I think all these Banners are named after people who kickstarted let's see if anybody was smart and did Miller, McTavish oh my goodness there's got to be a Miller in here some Miller had to have",
      "start": 39.32
    },
    {
      "text": "games I think all these Banners are named after people who kickstarted let's see if anybody was smart and did Miller, McTavish oh my goodness there's got to be a Miller in here some Miller had to have back this game right? Marar, fuck you, Millar! Damn it, man, I should have done this. You ever do that where you get to a game that's been something's happened with Kickstarter and you're like, oh hey, I really wish I could have had my name in this game, wish I had done that backing and now it's too late? Anybody do Greg? See, every he's doing like Goofy name, not goofy names, but like real names like Grey Wolf, you know what I mean? Design their thing. Did anyone make a Portilla? Porter? How's Porter? We could play in the name of Scott Porter. They've got a cool Banner. Profits is pretty cool too though. Damn, I'm sorry. And see, this is this is the thing when you come into a game and you want to just uh play along with me, you never I'm not going to I'm not going to rush through this. What if I find out I love",
      "start": 84.36
    },
    {
      "text": "sorry and see this is this is the thing when you come into a game and you want to just uh play along with me, you never I'm not going to I'm not going to rush through this. What if I find out I love this game and I play forever and we're doing a long let's play, so who cares if I fuck around a bit with this thing here, right? Wait, Sla, they got a... is Marty? No, Silva. Did Marty back this? That'd be Marty's house . Of course, Marty, a standup games journalist from IGN.com. You probably didn't back this. Skyart. I'm taking Skyart. That's cool. All right, here we go. Um, so what a van... the Vanguard is a party of five Heroes that you control in battle. Selecting houses for your Vanguard is purely cosmetic. Well, fuck, now I didn't know I I could do this. So now here, now we get Millar in here. Probably should read. See, this is the... oh, I want to do this game. You're going to play along with me, you're going to learn how to do it too, and I just screw it all up because I'm an idiot. You think Snyder's in here? Did Christine back",
      "start": 142.24
    },
    {
      "text": "is the oh I want to do this game, you're going to play along with me, you're going to learn how to do it too, and I just screw it all up because I'm an idiot. You think Snyder's in here? Did Christine back this game? No, Chris? Oh, Steiner. Close enough . Scott Snider... no, Scott Steiner is what I was saying. Snyder of course makes the Batman comics. Now let's see if Scott Snyder's in this thing. Whoa, this one's cool. We're taking him. Now we're going to try to find Scott Snyder. See if Scott Snyder's back in Double Fine games. If he's not, you tweet at Tim Gettys and Scott Snyder and you say,'Hey , Tim Gettys, I saw Scott Snyder from Batman isn't back in your games,'and Scott Snyder's gonna go,'I'm very busy making Batman comics that are really good. Leave me alone.'Be right over here if it did. Oh, he didn't. Everybody, don't worry. Scott Snyder's cool. He did this. All right, cool. Video games. Love you guys. Thanks for hanging out with me. It's early in the morning. Taking too long. Patience, patience. I don't see what patience has",
      "start": 192.68
    },
    {
      "text": "worry. Scott Snyder's cool. He did this. All right, cool. Video games. Love you guys . Thanks for hanging out with me. It's early in the morning. Taking too long. Patience, patience. I don't see what patience has to do with this. It should have happened by now. Keeps to its own time, not ours. I can't put on subtitles. I'll put them on after this. Subtitles when I get to a screen. Good morning. Your ruler has risen. Rejoice and let bellow the horns of birth . There's always that fear if I hit a button, am I going to skip the cut scene automatically or can I get to the menus? I'm going to hit pause. Immortal, protector of the nation, paragon of the great Bloodlines, master of strategies, eternal conductor and forger of matrimony. We're here to advise you on how to handle ruling and commanding the fuck every time the horns of battle. Fine, we'll have to do this later. The Cadence is attacking. Heroes, jump in. We're the heroes. Ruler will be with you short. I'm the ruler. And off they go. We'll explain later. We just need you to take",
      "start": 250.32
    },
    {
      "text": "battle. Fine, we'll have to do this later. The Cadence is attacking. Heroes, jump in. We're the heroes. Ruler will be with you short. I'm the ruler. And off they go. We'll explain later. We just need you to take command because our citizens understandably find it hard to trust a giant talking chalice. We are not just a giant talking chalice. The nation will listen to you because you're of their blood, forged from the Bloodlines of the great houses. Oh, and one last thing, unfortunately, the bloodline ritual that was used to create you also bound you to us so you can never leave the throne . But do not despair, you can still command Your Heroes. Look inward and you will find that your mind can follow them anywhere. Be mind powers following people into the shower, cuz that's where we'd all follow. Yet , hold on. So I see them. There we go. We're to turn on subtitles so everybody out there isn't all,'I can't see your Heroes happening.'I'm the fuck rock climber. Take command. Search the area. Okay, is out there somewhere.",
      "start": 306.04
    },
    {
      "text": "see them. There we go. We're to turn on subtitles so everybody out there isn't all,'I can't see your Heroes happening.'I'm the fuck rock climber. Take command. Search the area. Okay, is out there somewhere. Move with the right stick to survey the area. Done. I'm surveying everybody. Rotate the camera pressing this to that. Cool . See, this the problem, I'm already way into this game. Soon the camera around with this. Okay, strategy, jeez. All right, got it. Done. Here we go. Jack Skyart, brainy , strong, wielded, slow learner personalities, a rebel, hung over way too much last night, lowered speed, evasion, hit points. Fuck. Broam Sounder. He was just a guy I thought looked cool, remember? Whoa, looks like a Ghostbuster. Steiner, dim with intelligence. All right, Grant Millar, as if they couldn't get it closer to Greg Miller without fuck getting copy in front. Ah, ah. Oh yeah, a hero has two action points to spend during their turn. You can press Y to forfeit all AP as a hero. Gotcha, gotcha. Lot of tutorials right off the bat.",
      "start": 359.2
    },
    {
      "text": "without fuck getting copy in front. Ah, ah. Oh yeah , a hero has two action points to spend during their turn. You can press Y to forfeit all AP as a hero. Gotcha, gotcha. Lot of tutorials right off the bat. Moving here within the corner point, a lot of... oh, I see, I see what you're saying here. So that's two, this would be one, two, one. I'm going to go here just to show one point. There you go. Then we'll move up here. Is the egg thing? Killing is a bad guy or not? Oh, go fuck. There we are. First Catch of the Day. We can't tell you much about the Cadence because not much is known . It's old, first sighted centuries ago. It cares only for destroy our nation, corrupt. Here come of them as shat, spread corruption. Lady, shut up. I just forfeited all my action points like an idiot. Don't know what I'm... oh God, oh God, it's happening. It's popping off, guys. Hero selection. You can move your heroes any like. Okay, advance Your Heroes until range of engaging an enemy. Now you young lady, hold on. Oh, I can spin the camera. I don't have to. I don't have",
      "start": 432.92
    },
    {
      "text": "popping off, guys. Hero selection. You can move your heroes any like . Okay, advance Your Heroes until range of engaging an enemy. Now you young lady, hold on. Oh, I can spin the camera. I don't have to. I don't have to sit like this about chance. Attack me. Yeah, okay. Starting to break up the team, know what I mean? Send him out there, get that fog of war going. What's happening with that fog of war, Brad Muir? All right, I keep playing it safe. I feel like this is she's she or he is an Archer, I guess. I haven't seen any she's on my team. Got that range, huh? All right, could have been worse. At least they belong to heroic Bloodlines. Oh yes, we forgot to mention, normal humans cannot survive even a single touch Cadence. But because the Bloodlines of your heroes are attuned to us and have our power flowing through them, they have a fighting chance. Okay, okay. What I got here now? I got throw my flask, explosive flask. Nice. Free throw. Let's throw a flask. Let's see what happens when I throw this explosive flask over here. You get smoked.",
      "start": 501.28
    },
    {
      "text": "chance. Okay, okay. What I got here now? I got throw my flask, explosive flask. Nice. Free throw. Let's throw a flask. Let's see what happens when I throw this explosive flask over here. You get smoked. Fuck. That's right trigger. Stealth mode. Sneak to tall... sneak to a tall environment object and blend in and hide from enemies. I don't think that's going to work for me. Uh, let your arrow fly. Now what? He's got crazy ass fuck. No, no, he's melee. Is leave Snyder there. You're going to flank. We got some flanking move. Oh, fuck. There's another one. Seeds, arguably the lowliest of pawns, are more nuisance than menace. But if you're going to remember one thing, don't let those runts form a posse. Keep them apart. Otherwise, it'll be like when Cajacks get together at T, except not the best night of your life. What you're saying, you're saying crazy stuff. So now how ? I already forgot how how did I get the information every character before? Because I'd like that again. Grant Millar. Grant, let's come over here and we're using",
      "start": 586.72
    },
    {
      "text": "you're saying crazy stuff. So now how? I already forgot how how did I get the information every character before? Because I'd like that again. Grant Millar. Grant, let's come over here and we're using you as support, your support system , Grant. Cadence cowards, they'd rather stay back and snipe at you than fight up close. Be wary. Your Heroes are hit, they may forget some of their combat. Well, he's getting hit a lot, guys. He's about to die. That a wide shot. Okay, so okay, here is Earth. You're a thrower, C. Thrower, crossbow. Like, you can't hit from over here. You can't hit from over here. Okay, I want you to fall back and retreat here, here. Well, see, that's the problem with these games, trying. I'm never I've never been good at turn-based stuff except Advance Wars, but because I played the fuck out of Advance Wars. So let's just hit. We're going to hit. That took up all my action points, I assume. Hero skills. So now I need you to get your ass up here. There's more people back here. They just keep coming. Now hold on, let's",
      "start": 671.84
    },
    {
      "text": "just hit. We're going to hit. That took up all my action points, I assume. Hero skills. So now I need you to get your ass up here. There's more people back here. They just keep coming. Now hold on, let's get to our crossbow gun. Win for the good guys. Win for the good guys. Potential movement. Your hero could perform this directed range attack on the enemy. Your hero could throw a flask from this form as you select a potential movement location. See, I don't comprehend because it's like you're going to see these icons. Where are the icons that's going to pop up? We're not afraid of this ghost, this Laps. We're brave warriors who listen to a talking chalice. Okay, you can advance and kick the fuck out of this thing. There you go. Oh my God, it only hurt two. Oh, fuck, it hurt my guy too. Oh no, I'm stupid. Oh no, why you so stupid, Greg? Oh no, that was nope. I'm not learning. I keep touching the hot stove and then being like,'I'm stupid.'Here you have the hunter. Attacking at close range is good, but",
      "start": 747.28
    },
    {
      "text": "I'm stupid. Oh no, why you so stupid, Greg? Oh no, that was nope. I'm not learning. I keep touching the hot stove and then being like,'I'm stupid.'Here you have the hunter. Attacking at close range is good, but attacking from afar where one can think. And I want to have a team of hunters. You might be able to your... everyone's about to get fuck p wned. This is where we all die. Hunter, stay scouting ahead is what they fuck. It was bound to happen sooner or later, so you should get used to this. There'll be a lot more before we're done. No, remember, we're fighting for something bigger than themselves. Persevere, honor their sacrifice. It's a good point. You, I want you to, you can fall back. You have no business anymore. You're what I like to call garbage. See what happens from here. What are you going to do, Lapses? Who is blowing up my fuck phone? Okay, you stay. You, we're not using you at all. Found one of our Alchemists. Brilliant mind in a delicate body. Not worth much in a Close Quarters battle, but they make up for. Let fly.",
      "start": 855.72
    },
    {
      "text": "up my fuck phone. Okay, you stay. You , we're not using you at all. Found one of our Alchemists. Brilliant mind in a delicate body. Not worth much in a Close Quarters battle, but they make up for. Let fly. Oh my. Okay , good. They didn't kill him. Good, good, good, good, good. That than I expected. Grant Millar, of course, the one guy who sounds like might me dead. Fuck. Jesus. Brad Muir. All right, okay. Leveled up some people, did some cool shit. Oh, I get a choice here. Okay, but that one I had no choice. Gotcha. Steiner. Steiner with my boy Scott Snyder, son. All right, so lots to learn here, but am I enjoying myself? Oh, you goddamn right I'm enjoying myself. Y'all know I'm not the brightest, just trying to get by in this workaday world . Got Tim and Colin blowing up the phone over here, right? Is everything okay? So this is our nation. Yes, as you said, we are not in the best of shape. That muck you see surrounding us is the Cad ence. It's what created the pawns, corrupted our lands, and is slowly tightening on us like a",
      "start": 930.84
    },
    {
      "text": "is our nation. Yes, as you said, we are not in the best of shape. That muck you see surrounding us is the Cadence. It's what created the pawns, corrupted our lands, and is slowly tightening on us like a noose. But we do have one advantage. Thanks to several enchanted materials make up our body, we've been endowed with certain powers, one of them being a way to cleanse the Cadence from this world. It's really quite a miraculous process wherein we harness the properties. She knows I don't care. The thing is , it takes a long time for us to charge up for this. A long time. All of the heroes you just commanded in battle will be long gone when we're finally ready. With all that time still ahead, we need you to protect us. I got you. You'll take charge of the nation, command its citizens worthy of becoming Heroes, and ensure that the Cadence does not reach the capital. Now let's check out that keep you just saved . Is that the one I saved? The keeps. The keeps. All right, now we have to make have sex with each other. Masons did",
      "start": 1031.12
    },
    {
      "text": "that the Cadence does not reach the capital. Now let's check out that keep you just saved. Is that the one I saved? The keeps. The keeps. All right, now we have to make have sex with each other. Masons did good work here. I'll thank them later. Here you will appoint one hero as a Regent and one as a partner. More experience they have, more they'll pass on to their children. That goes for traits and personalities too. Everything's game. And keep in mind, assigning Heroes to keeps retires them from combat. Sure, of course, you can't have one foot at home and one in the battlefield. I don't have a lot of people. I don't have a lot of females who are very fertile. So here's what I want to do. We all agree our boy Steiner, Jurg Steiner here, did a good job out there. But Jack Skyart, level three Alchemist, average fertility. He's old too. We're going to let we're going to let Jurg get it on, I think. So Jurg is my Regent now. He was a... I like bone arrows though. High fertility for current Watchrock . But he's only one. He's 19.",
      "start": 1081.88
    },
    {
      "text": "he's old too. We're going to let we're going to let Jurg get it on, I think. So Jurg is my Regent now. He was a... I like bone arrows though. High fertility for current Watchrock. But he's only one. He's 19 though. Seems like he could have a lot of kids. Status: young age. That's a good thing. Hawkeye, impressionable. He's a Hunter. I like Hunters. All right, he's the Regent. Now that your Regent is appointed, it's time to decide on a partner. Although this isn't an arrangement out of love, who knows, maybe it'll turn into that. We've seen it happen, just like all my relationships. Traits, experience, they're all important here . But just because this is an arrangement of necessity doesn't mean you should reduce these Heroes to a pile of numbers either. They deserve better than that. I'm not happy that I'm getting Enforcers out of the bunch . I'm gonna give you Kelly Curret and Kelly. Any happy returns. Let's give the newlyweds some privacy, eh? No, let's watch them forever. It's a lot to take in, but you'll handle it or your mind will",
      "start": 1158.68
    },
    {
      "text": "of the bunch. I'm gonna give you Kelly Curret and Kelly. Any happy returns. Let's give the newlyweds some privacy, eh? No, let's watch them forever . It's a lot to take in, but you'll handle it or your mind will become as cracked as our body. You'll be fine. Now then, please join us back at the capital. Show you some of your other... see what's happening with this game now. I'm getting the hang of it. See, this why it has to be a long let's play. There's so much going on. You are here , right? It's a little hard to tell if you're still in your mind's eye or whatever. This is where your return to after battle. From here you may equip them with any skills or weapons they may have earned, as well as perform research. Basically, we can devote some of our power to help the war effort and the nation, whether it's building new keeps, starting a Sage Rights Guild or a Standards Crucible. Fun stuff. Let's jump into research. Building more keeps is likely the most pressing option as you'll be able to foster more Bloodlines.",
      "start": 1215.2
    },
    {
      "text": "starting a Sage Rights Guild or a Standards Crucible. Fun stuff. Let's jump into research. Building more keeps is likely the most pressing option as you'll be able to foster more Bloodlines. But don't shun the other possibilities. With your approval, we can research weapons, potions, armor. If the amount of time required dissuades you from searching something, consider the Sage Rights Guild. Any hero who joins the Sage Rights will hasten the time required for any pursuit. You will never see combat again. I'm going to build one more keep. Keep in mind, most of our power is focused on charging up to cleanse the Cadence, so we can only devote enough energy to research one thing at a time. Fuck, there's so much going on. Searching for new Heroes, it takes a lot of effort to find people attuned with us, and it'll only get harder the more we do it. But choose whatever you want. I'm going to do I'm running another keep going. We'll get a keep up running, then we'll come back and do some other stuff. Placing",
      "start": 1278.72
    },
    {
      "text": "it'll only get harder the more we do it. But choose whatever you want. I'm going to do I'm running another keep going. We'll get a keep up running, then we'll come back and do some other stuff. Placing a building. Select a region of being construct building. Outer regions are first to to be attacked and corrupted by the Cadence, but they offer significant strategic and tactical bonus when you build there. I want to start. This is my first time ever playing my own game of Massive Chalice. I want to start in the center and work my way out. Fuck the neighboring regions, as the kids say. Kids say that. Oh yeah, one more thing. The end of this war is not even a glimpse on our horizon yet, but your immortality gives us an advantage, the ability to step back and let time pass. You can start and stop this timeline will, but we'll also stop it for you should something require your attention. Got like a Cadence attack, of course. That is a probable possibility . I'm like going into sleep, sleep change. Here we go. Oh,",
      "start": 1330.56
    },
    {
      "text": "will, but we'll also stop it for you should something require your attention. Got like a Cadence attack, of course. That is a probable possibility. I'm like going into sleep, sleep change. Here we go. Oh, look at the time go, buddy. I'm going to have this new keeping. Oh, fuck. They're trained by the Regent partner keep, at which point they transfer the capacity for action. Indeed. Babies have been born. Glorious. Every time. Was it not incredibly unbearable shrieking and smells that are even worse? Shut up, cup, people . Glorious. All right, we got it. We got a babies. Yes, I see, I see what's happening here. All right, all right. Back to speed time. This, I say this about every fuck game. Can you imagine if this game could be on Vita where you could play it on the go, accomplish something without having beaten it into submission? Should have seen my books after I was done with them. I don't know what that means. Oh, see, I got to be fighting more, so this makes more sense now. Do by fertility. Yeah, yeah, yeah. Think it might be time to give",
      "start": 1377.52
    },
    {
      "text": "have seen my books after I was done with them. I don't know what that means. Oh, see, I got to be fighting more, so this makes more sense now. Do by fertility. Yeah, yeah, yeah. Think it might be time to give Jurg Steiner here his old uh, the old,'Hey, Jurg, what up, Jurg? Can we rock?'I don't... do I want to put two levels together? Whoa, whoa, whoa, whoa. Oh, also, these are two males. Wait, can I? I thought I could. You can marry two men right here. I want to put Jurg in there, but then they have to adopt a baby, I think. Oh no, maybe I'm wrong. No, you could see chance for children: none. Yeah, see, there you go. I like the name Michelle. No, but she... I'm gonna go super high. That's good. Got some got some stuff going on over there. Good. Here we go. What does a Crucible do? With a Crucible, the hero promoted to the standard will be boost the experience of recruit trainees, recruit trainers nationwide. Pass. No, fuck that. Sage Rights, Sage Rights hasten the time required, complete research. That sounds like something I need. We're working our way out.",
      "start": 1439.48
    },
    {
      "text": "the experience of recruit trainees, recruit trainers nationwide. Pass. No, fuck that. Sage Rights, Sage Rights hasten the time required, complete research. That sounds like something I need. We're working our way out. Remember, guys and girls, not being rude, just saying. More babies. Yeah, we're getting babies left and right. Babies happening all the... oh, fuck. Finally. Actually, this is bad. As you have no doubt surmised by now, it takes time for the Cadence to create its pawns, so they're only able to attack every few years. Fortunately, you cannot fight back multiple incursions. Shit, there's two. I see, I see. Our primary focus is charging up to destroy our enemy, and we can only allot enough of our energy to send out one group of Heroes at a time. Pawns don't last long outside of the Cadence either, so even if you win one battle, it'll be too late to fight the other. Choose wisely. Blow the horns. Yeah. All right, so we're starting obviously on the ones who are encroaching on our territory. These guys over here, they want to be a bunch of",
      "start": 1502.84
    },
    {
      "text": "be too late to fight the other. Choose wisely. Blow the horns. Yeah. All right, so we're starting obviously on the ones who are encroaching on our territory. These guys over here, they want to be a bunch of fuck. They can do it. 19-year-old female. Oh, they have like things. I see a 5-year-old female Alchemist. We're going in. We're going for it. Did I fuck that up? No, I got to go here, right? I get to pick new people too. All right, so you feel it, that little tingling in the air before a fight ? I know they do. You deploy your... once you give the word, they'll jump in. We'll handle the rest. Make sure they close their mouths when they jump. I love Hunters. I want all my Hunters . All the single Hunters, all the single Hunters. What? Hands up. Let's see who's who's infertile. Can't even search my fertility anything. We'll fine, we'll go age . So if somebody dies, I don't care. Felton at 45. All right, the thrower can be used to toss exploding flasks. Oh, okay, okay. All right, fine. Engage.",
      "start": 1554.84
    },
    {
      "text": "engage . Fuck. Engage. Star Trek. This game's fun. Having a good time so far. Let's see what's happening on why everyone has to text me when I do things. Now granted, I do things all the time. I don't know about you, but I'm ready to hit something today. You're not. You're you don't have to do anything crazy, disembodied voice woman. All right, so I want Hunters to went off. This is a Cajack. They hit things with a club. Sometimes they hit hard and put things down. Other times they hit not so hard and just knock things out. That's funny. That's all you're going to say. Simplest way of life there is. Cajacks, profound purveyor of violence. Oh, I only have one. I forget that. Then fine, Cajack, you can go over here. Splitting the team up. Hold on. I I didn't. It's one of those things where I thought I knew what I was doing. I was like,'Oh, I'm",
      "start": 1625.52
    },
    {
      "text": "oh I only have one. I forget that. Then fine, Cajack, you can go over here. Splitting the team up. Hold on. I I didn't. It's one of those things where I thought I knew what I was doing. I was like,'Oh, I'm moving everybody perfectly.'And then here I am like an idiot, not doing nothing. Suck it up, Laps. Send the other Alchemist over here too. It's a Caj ack. Fuck that I use both points there. Fuck that up. Good to know, Greg. You're stupid, idiot. Everybody hates you. God, I'm so stupid. Why they why are they shooting the rock? Oh, Doctor. All right, they can come through the rocks. This is good to know. Everybody, m. I don't like that. I don't like that he lost a level. It's a powerful fuck attack. All right, so here, do this now. D. See you now. Now we fly. Level up everybody. These guys don't know who they're fucking with now, man. All right, so Cajacks , if that's who these were, I've already forgotten. Oh, fuck, there's another guy. Oh no, I could have moved and I should have moved actually. See what you can do. Nailed it . Crushed it. All",
      "start": 1694.52
    },
    {
      "text": "right. So Cajacks, if that's who these were, I've already forgotten. Oh, fuck, there's another guy. Oh no, I could have moved and I should have moved actually. See what you can do. Nailed it. Crushed it. All right, so now I got this Cajack. So it's not Cajacks I like, it's Alchemists. Alchemists and Hunters are my my jams. A fuck they that way. Let's uh, let's just end the turn. We'll stay right there. We'll let them come to us. Damn with this level lost. Fuck. Nice try, idiot. All right, so what? What's your take? Your shots when you got them, I always say. Now we fly. All right, so now let's which you can throw. Fuck . Move you here. Try to use the cover. Perfect. It's like Men in Black. Remember when Will Smith said,'Don't start nothing, won't be nothing'? It's exactly what it's like. Men in Black, a great movie y'all should be watching. And again, if I haven't point out, I'm really liking Massive Chalice. I wish it was portable cuz I'm a portable sn ob and wish I could play everything on the go so that I could sit there",
      "start": 1798.72
    },
    {
      "text": "be watching. And again, if I haven't point out, I'm really liking Massive Chalice. I wish it was portable cuz I'm a portable snob and wish I could play everything on the go so that I could sit there and be like,'Hey guys, in the plane, look at me playing this game. I'm awesome.'And they'd go,'Oh my God, you're so cool. Can we like subscribe to your YouTube channel?'I'd be like,'Yeah, of course you can. Here's how you do it.'And they'd be like,'Radical.'Did I mention I'm Sir Richard Branson and I'm going to buy your YouTube channel? And I'd be like,'No way, Sir Richard Branson, just let me fly first class all the time on Virgin America.'And Sir Richard Branson would be like,'You know what, I like your style and agree with your ways of thinking. I will do that for you.'I get way too excited about this. Now I got to figure out where the rest of the bad guys are. I feel like over here some bad guys are coming. This looks like a dead end, right? I'm not crazy. That looks like a dead end to everybody else too. Here, I I'll advance",
      "start": 1919.2
    },
    {
      "text": "this dude just to see what's up. There's one. That that would have been smarter to advance this guy first. Oh, there we go. Found the hive, everybody. Oh, fuck, there's one right there. It was a trap. Not my Hunter. I don't have many Hunters. I need Hunters. Oh, fuck. Oh, fuck. In a c. Here's what I want you to do. I want you to fall back here, here, and I'll start shooting these fuck in the face. We're going to get you assistance, sir or ma'am. I'm not sure what your name is, but it will take a while. All right, so then this 40%. That's not great odds. Rid you, deplorable Beast of pestilence. Okay, good. All right, safe. We got some guys. Okay, for the moment we're safe. You can come help. You're probably home screaming,'Don't do this, Greg!'But I'm going to do it because this is the only way I know how to play.",
      "start": 1964.8
    },
    {
      "text": "people need me. People need Greg Miller. Greg Millar. Now can I punch through this fuck? There we go. You little piece of garbage. Oh, we see you. We see you, Seeds . Let fly. Where's the other one? There he is. And I think we're out of the blast radius there, right? So we won't get hurt. Perfect. Didn't hit him, but perfect still. It's not that I needed to hit him to feel good about myself. Not going to make it. Free throw. Choose location to fling an explosive. Cost no action points. Okay, don't fully understand what you're saying. Sorry. Feel like I'm being too reactionary now. There's bad guys over here, weren't there? I'm like, is somebody singing? And then I realize Colin's working out because he's a quitter. So go there. Advance. I know there's I know I saw more nerdy burglar over here, didn't we? Are you are you it? Are you",
      "start": 2054.6
    },
    {
      "text": "the last of the Mohicans. Damn, we did it, guys. It's fight hard, you know. Taken care of. We got some good, we got a good crew here, folks. We're calling Crew. Win crew. Winning crew. Richard Branson. Good job, crew Richard Branson. That's why I named you after the smartest British man I know. Maybe Australian. All right, all right, all right, all right, all right. My baby don't because know. So what? Oh, cuz I have a new keep over here. No. Now here we need to get I need to get some armor. So we got to get some Double Fine stuff. I'm going to be using a lot of Hunters and a lot of Alchemists. I feel like the Hunters are the ones who are getting it bad, and I can only do one thing at a time, right? So I do this. Ah, yeah. Okay, that's going. That's going. That's going. Good, good, good. What the fuck happened there? What did I do? Oh no, Billy. Oh,",
      "start": 2151.4
    },
    {
      "text": "I abandoned the fuck Sage thing. Fuck bags. Well, fuck up, everybody. Fuck up, everybody. All right, well, let's let's fix this. Let's fix the problem. Build the stupid Sage thingamajig. Build right there. Yeah. All right , that's back to going. That means it's in construction. Got it. Understood. Got people having babies. Babies happen left and right out here. Babies to go die for me in the field. You were making choices on the battlefield. Oh no, I'll be making choices on the battlefield. Bummer. What? Come on. I will not apologize if I'm passionate about. You know, when you guide the heroes in battle, well, sometimes the people, Your Heroes included, will want your advice on matters they can't decide themselves. They'll be putting their choices in your hands and sometimes their lives and the decisions you",
      "start": 2274.36
    },
    {
      "text": "sometimes the people, Your Heroes included, will want your advice on matters they can't decide themselves. They'll be putting their choices in your hands and sometimes their lives and the decisions you make put chaos in the... unfortunately, we've learned that the Cad ence feeds off grief and malcontent, so if something tragic happens, corruption can spread very quickly. But the opposite is true too. We will trust your decisions whatever they end up being. Okay, I mean, I have I been you ? I don't like Cajacks that much so far, so I say,'Fuck it, quarantining.'This is a terrible idea. And then like this, I this is funny. Fuck it. Let's see what happens if I put in the shell. It worked. Oh great, yay. I cured her. Everybody, don't worry about me, just a God. Greg Miller, they call me. I didn't back the game though , so my name isn't spelled right in this. Remember the day I finished my training and set off for the capital. There was a lot of crying, mostly from the kids I crushed during my Advanced G. Oh yeah, Margaret , you're",
      "start": 2355.52
    },
    {
      "text": "isn't spelled right in this. Remember the day I finished my training and set off for the capital. There was a lot of crying, mostly from the kids I crushed during my Advanced G. Oh yeah, Margaret, you're my kind of girl. Faster than Enforcer. Oh, Enforcer. I see. I thought Enforcer. I thought Hunters had the the bone arrow. I didn't realize Enforcers had bone arrows too. Now I'm happy. Now I'm super happy. I'm so happy I'm going to gouge at my own eye. I'm not going to do that. That's not how you show happiness, kids, if you're wondering. See, I don't understand why it keeps... oh, that's what's fucked up. Okay, so that's done. That's done. How's this Regency thing coming? No, one year till we're done with the whatever the fuck that thing's called. There we go. Remember, Sage Rights forsake combat for their pure pursuit of knowledge, and your hierarchical institution will greatly influence their rate of research. I don't know what the fuck you're saying. Sage Guild. I was always jealous of those in my class who went on to join their",
      "start": 2411.64
    },
    {
      "text": "knowledge, and your hierarchical institution will greatly influence their rate of research. I don't know what the fuck you're saying. Sage Guild. I was always jealous of those in my class who went on to join their ranks. They ended up designing the rotary trebuchet, still used in keeps to this day, as well as the first Oakstone crossbow. First time I went to one, I came in for an armor fitting, and by the end both of my arms were on fire. What a bunch of brilliant scamps they are . First of many, I hope. Thrills of battle are a hard thing to leave. I always found the thrills of inquiry and invention to be worthy substitute. Just don't get carried away with appointments. Sage Rights can never return to battle, and last I checked, we still need Heroes to win this war. You know what though, you're kind of a jerk voice. Intuition clearly what matters here. I do feel like I like Jack. I don't want to put... oh, I don't like Cajacks, right? We decided. Get in there, Snyder. All right, cool. Do whatever the hell you do in this thing now.",
      "start": 2457.84
    },
    {
      "text": "let's get some armor set up. I need Alchemist. I feel like I have more Alchemists. I don't know. I feel like Hunters are the ones who are getting snuck up on the most, but I don't feel like there's that many Snipers. Ah, we're doing the Hunters. It's only 10 years, chump change to me, a God. For if knowledge is power, then a god am I . Nothing crashes the head like a good battle leader. In some cases, correct. Look at you making jokes. Who's the voice? I wonder. Know who that voice is. Let's go get him. What happened to everybody else? They dead? I'm not paying a lot of attention. I I've been putting people in stuff. I think we like Alchemists and we like Margaret. Get out there, Margaret. 17. I have a lot of hope for you, Margaret. Don't die in this Mission. Margaret made for this job, literally, quite literally. I feel like I shouldn't just",
      "start": 2512.08
    },
    {
      "text": "redo doing Alchemists even though I like like Alchemists a lot. I'm going to put it. I'm going to do it. I'm going to put you out there, Skyart. Damage, damage. All right, cool. Let's go get him. Up, up and at him. I think this might be my last mission. We need to get ready for Colin & Greg Live here in a little bit, but we're going to kick some ass before we do it. Like this game a lot. Massive Chalice. PC, Xbox One. Free on Xbox One at the time of this recording. Good luck. Break leg or 11. Well, I don't like the sound of that. Who do I got here now? Sending out my Hunter, Bingy. We fuck some shit up. What else I got here? Oh, Margaret. Oh man, Margaret, you can't move for fuck. Oh, it's cuz she's blocked. Maybe, maybe, maybe. Now I'm I'm grouping up my all my people, which is not smart, I know. But you know what, guys, I'm a",
      "start": 2587.8
    },
    {
      "text": "God. There we go. Now we're talking. Okay, see what happens now, you old turd burglar ghost women. Okay, so now there we go. Now we got angles, everybody. Remember Curt Hennig. Just wonder . I liked him. He was a good wrestler. Man, these fuck Seeds are garbage, you know what I'm saying? Man, these these Seeds ain't got nothing for us. Let's move you up here. Start advancing out. Start spreading out, everybody. Get nice and loose out here on the map. Margaret, I've been expecting big things from you for a long time. Don't die on this first mission, please. Fan out , everybody. Let's go fuck own some jokes. Remember, just run around, scamps. Yes to you. Death to you. Good job, Margaret. 60 XP. Will be that reckoning. Sweet. I don't know if you have noticed, I'm pretty fuck good at Massive Chalice so far. Not going to say I'm the",
      "start": 2675.4
    },
    {
      "text": "best God they've ever had, but I'm probably the best God they've ever had. Fight back. Damn, see that's the problem with these guys. Ah, fuck. I should have moved him out so I could actually do some. I got a... all I got is Alchemist here. Fuck, they're just going to keep hitting with ones. Oh, here we go. Hold on. Oh, fuck me. I don't want to blow him up. I'd like him to fall. You know, here's what I'll do. I'm gonna I know I'm gonna hurt him. Hold on. I could do this though, couldn't I? Nope, still hurt him. Should have made Alchemist armor . Margaret, I don't know what's happening. This looks like a dead end over here. There's nothing over here, so we've all got to advance at some point anyway. All right, Margaret, let's get back into the fray. Sorry to make you carsick, everybody. Sorry, moving the crew this way, Margaret.",
      "start": 2807.68
    },
    {
      "text": "you're the best among us. You were chosen for this. You're the first, you're the our first Battleborn person. Oh, fuck, stay there, Margaret. I don't want you. You're not. I'm not sending a Hunter to advance up there without anybody to cover their ass . We're going to find these guys wherever these snakes are hiding over here. What the fuck is going on here? Hold on. Send an Alchemist side a bit more. Mhm, mhm. All right, all right. It's like, fuck, man, where is everybody? I love Margaret too much. I made a promise to her parents not to send her into death's doorstep. Not getting cocky. Who's this? I feel like I'm only controlling Margaret. I understand game that I'm making a point that I love Margaret. You don't have to only give me Margaret control. Ah, there's the punk. You punk ass fuck. Now can Margaret shoot from here?",
      "start": 2922.72
    },
    {
      "text": "Margaret. I understand game that I'm making a point that I love Margaret. You don't have to only give me Margaret control. Ah, there's the punk. You punk ass fuck. Now can Margaret shoot from here? Can Margaret end this all for us? Margaret's the chosen one, everybody. Margaret is the chosen one. I just want that on the record that I chose her as their God. I'm I'm their God. I've chosen her as the chosen one. All right, so let's get people moving here now. Broam Sounder, get your ass over there. Find out what the fuck happening . Margaret, don't like putting You In Harm's Way. Margaret, put you over here. Peel back some of... there we go. Now I got some of these punk ass fuck. Another Alchemist. You up there . Ah, here we go. We got them on the run. They're on the heels. Wayne, looking for you to pull a Margaret here and actually do some cool shit. You're not not acting like you can shoot these people, Wayne, which is weird. Can you shoot from over here, Wayne? Because Margaret can shoot from over there, Wayne. I'm just",
      "start": 3020.76
    },
    {
      "text": "letting you know you both have bows and arrow crossbows. Feel like you should be shooting as far as Margaret could shoot, you know what I'm saying, Wayne? Wayne Brady does isn't in enough video games. If everybody could ask Wayne Brady to be in more video games, that'd be great. Here we go. It's popping off. Got all sorts of Seeds over there. They're trying. They're going to try to take a shot at Margaret here. Oh, these fuck sons of bitches. All right. Oh, fuck. Oh, fuck. We got engagement. Oh no, oh no. Okay, so let's do things. First things first, let's Evacuate the Dance Floor. You get out of there. You're hurting. Let's go to you, Skyart, and I'm going to say,'Why don't you uh, fuck, destroy these guys for me, killer?'Now let's jump over back to big old Margaret. Not cuz she's fat, just cuz she's you",
      "start": 3084.24
    },
    {
      "text": "you're hurting. Let's go to you, Skyart, and I'm going to say,'Why don't you uh, fuck, destroy these guys for me, killer?'Now let's jump over back to big old Margaret. Not cuz she's fat, just cuz she's, you know, the Chosen One and stuff. Can you shoot through this and hit that guy? Maybe. Chosen One. My advice. Don't know what your advice was, Sir. Yeah, thank you. Now can you shoot over there? No. So, but if I bring you here, can you shoot or is he still in cover? Do we not have the angle? We got an angle. Pop, pop, pop. A lot of cowards are hiding, which I'm not a fan of. Come face me, cowards. You stay right there, Margaret. You got to kill this guy. Good job, Margaret. Will be the reckoning. Level up, Margaret. Look at Margaret. Told her she's the chosen one, man, for years to come. After all that, I should hope so. Ladies and gentlemen, that's Margaret, everybody. Round of applause at home for Margaret. Fantastic woman, 15 years old, out there kicking ass with her bow and arrow. Uh, I knew her parents way back when when I put them",
      "start": 3139.4
    },
    {
      "text": "together and said,'Hey, you two, fuck and make a baby that I can use in war.'And they said,'You got it. We'll fuck, make a baby you can use in war.'And that's what they did. Oh, now I got this person, another female, another Hunter. Yeah, yeah. My crew is coming along just the way I want it. Ladies and gentlemen, that's Massive Chalice. Uh, out like I said, on PC, out on Xbox One. Free on Xbox One is the time of this recording. Even if it isn't free though, totally worth your time and money. I will again say that I would love this on Vita. I love this game, right? But I mean, this would be so perfect on a handheld. So I'm just putting that out there. Double Fine, Brad Muir, if you want to make money, that's one way to do it. Uh, ladies and gentlemen, this of course has been a production of youtube.com/KindaFunnyGames .",
      "start": 3216.24
    },
    {
      "text": "I'm just putting that out there. Double Fine, Brad Muir, if you want to make money, that's one way to do it. Uh, ladies and gentlemen, this of course has been a production of youtube .com/KindaFunnyGames. Subscribe, share, like the videos. We do a let's play each and every day. And of course, let me know in the comments what you think of Massive Chalice and what you think of Margaret, how her story will go. I imagine she will die in three to four battles. Until next time, it's been my pleasure to serve you.",
      "start": 3253.6
    }
  ]
}
