{
    "id": 979,
    "video_id": "PhFYOkubvRU",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Portillo"
    ],
    "title": "Killing in Batman: Arkham Knight's Red Hood DLC - Kinda Funny Plays",
    "description": "Nick and Greg get rough in Rocksteady's story DLC for Batman: Arkham Knight. Spoiler-free!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1435690801,
    "duration": 1247,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to another let's play here on youtube.com/KindaFunnyGames I'm Greg Miller and this is the producer/seducer Nick Scarpino. Hello, how you doing? Hello, I'm well. Uh, Nick and I are both still obsessed with Batman: Arkham Knight, so we thought we'd do something fun today. Let's jump into the Arkham Episodes here and play the Red Hood Story Pack. I haven't played it at all. We're going to jump in and see what's happening. Are you excited? You're playing. This is a lot of pressure for you. I played, I've played a lot of Batman: Arkham Knight on camera. You're going to get to see how I how I how I uh beat and fight in the combat when we get in here. I eventually have to put on subtitles too . Okay, we should have done that. I turned them off because I've been playing out in the living room. Colin and Christine walk by watching me get these Riddler Trophies. I don't want the story here . Hold on, you're going to do it right now. You're good. Yeah, might as well. I don't it's one of it's",
            "start": 0.12
        },
        {
            "text": "room. Colin and Christine walk by watching me get these Riddler T rophies. I don't want the story here. Hold on, you're going to do it right now. You're good. Yeah, might as well. I don't it's one of it's audio options, I believe. It's one of those where I don't like anyone coming in. I don't want to have it ruined for them, you know what I mean? There's so many things to ruin'cause the guard still chip. Black Mask says they are. That didn't work. Black Mask, quit busting my chops. Just show me what we got. Nobody calls in the liar. You get ****, you get killed. There he is. There is the man, Red Hood. Now, do we want to spoil anything from the main story? Um, I don't think we do. Okay, necessarily. Tap it. Oh no, Nick. So we're not going to spoil anything from the main story, everybody. You see Red Hood there going, he's punching, he's doing his thing. What I'll tell you about Red Hood is that he's voiced by the one and only Troy Baker. You can hear it. I heard it a little bit a second ago. It was pretty easy when he's say, \"Look,\"",
            "start": 34.32
        },
        {
            "text": "he's doing his thing. What I'll tell you about Red Hood is that he's voiced by the one and only Troy Baker. You can hear it. I heard it a little bit a second ago. It was pretty easy when he's say, \"Look, it's a nine times combo.\" Look at Nick Scarpino go. He's been playing the Batman, everybody. I like how he has the guns, but he's really just focused on point. Oh, damn it. No, no, no, Nicki. It's just always so much slower than I think it should be. I know, I hate that too. I hope this unlocks a Red Hood outfit Batman could wear afterwards, even though I know it won't. That'd be cool. What the ****? You got to shoot that guy. Remember, it's the only way to take down the red guys when they're charging. Is it? Yeah, well, I mean, you could jump over and punch him in the back, I guess. Don't forget your guns then. Oh, I'm I'm not doing well here. It's okay. It happens the best of us. Not every it's I am not I not an expert. Destin Legarie is a machine. Destin Legarie is the one of the best Batman I've ever seen. Look at you go.",
            "start": 81.68
        },
        {
            "text": "I'm not doing well here. It's okay. It happens the best of us . Not every it's I am not I not an expert. Destin Legarie is a machine. Destin Legarie is the one of the best Batman I've ever seen. Look at you go though. You're you're picking it back up. You're picking it back up. Oh, okay. Oh, okay. I'm impressed with what I'm seeing from you though, Nick. I won't lie to you. Is that what you want to hear? You go. Look at you go. Go, Section Nick. See, I always just dodge those guys. If you throw a Batarang at not not that one in particular, but the that the guys who were charging at you earlier on, if you throw the Batarang at them, it's an instant knockout. And I'm assuming when you shoot your pistol at him, it's the same thing. Let's knock the hood out of the park. I staying there, man. You like to live dangerously. I like it. There you go. There you go. God damn it. Always that one fell for it. I know. Stand up. No, you I'll get it. I'll get it. I I believe in you. It's hard. I'm so used to Batman being the main. Get this out of",
            "start": 132.76
        },
        {
            "text": "like it. There you go. There you go. God damn it. Always that one fell for it. I know. Stand up. No, you I'll get it. I'll get it. I I believe in you. It's hard. I'm so used to Batman being the main. Get this out of here. Now, I'm not familiar and I'm not maybe we missed it on the loading screen. Do you know is this before or after the events? I don't know. All all we've said so far is they're talking about Black Mask. That's it. So we don't have any context as to where we're at. I'm assuming it's after'cause that would make sense. And and these guns are everything Black Mask says says they are. You calling Black Mask Carr, quit busting my chops. Just show me what we got. Now, what's interesting too is I'm interested to see how long this goes for, right?'Cause people were complaining online, as people are often to do, complain online, often to do, I guess what I'm going to say. This is going to be a terrible waste of bullets. You tell them, Troy Baker. Oh, there. I see. I understand what's happening now. Oh, yeah. I have bullets that kill people.",
            "start": 186.68
        },
        {
            "text": "to do. I guess what I'm going to say, this is going to be a terrible waste of bullets. You tell them, Troy Baker. Oh, there. I see. I understand what's happening now. Oh, yeah. I have bullets that kill people. I don't have to play by Batman's rules. That's a lot easier. Don't forget your special combo takedown. Here you go. See, like that guy running at you. Holy ****, you shot the guy. Shot guy in the face. That was awesome. Come on, you can do better than that. I wish I really hope this costume is somehow unlockable'cause it's a cool suit. I feel bad that Rocksteady put all his time into it and he only get to see it for two seconds or however long. People are complaining that it's not long. It's just this room. It might honestly, it might be. It wouldn't it mean if I totally could see that as that's how this actually turns out. That's the weird thing about Rocksteady and some of the DLC, all their pre-order stuff, you know what I mean? That they put out'cause obviously Red Hood, goddammit, uh here in America, I don't know",
            "start": 234.08
        },
        {
            "text": "turns out. That's the weird thing about Rocksteady and some of the DLC, all their pre-order stuff, you know what I mean? That they put out'cause obviously Red Hood, goddammit, uh here in America, I don't know about everywhere else in America, a GameStop exclusive. You had to pre-order of that. I got this code from a guy named Rodney. Thank you, Rodney, for sending it in. I'm going to get up Rodney's full name, but uh yeah, they put him like I remember this was their big thing when they were like last time with Arkham City that people were all freaked out about like all this exclusive stuff, but it's usually pretty short. And so that's why I wasn't too worried about it. The Batgirl stuff I'm expecting to be really uh it's Rondy Wooten. Rondy Wooten. Thank you, Rondy Woot en. Where is Black Mask keeping the goods? You want information? Read a newspaper. Okay, this gigantic gun I have. He's going to shoot you no matter what. Now, shoot him, Red Hood. There you go. Somebody's finally taken Gotham down and Red Hood knows what's up. I'll",
            "start": 288.36
        },
        {
            "text": "read a newspaper. Okay, this gigantic gun I have. He's going to shoot you no matter what. Now, shoot him, Red Hood . There you go. Somebody's finally taken Gotham down and Red Hood knows what's up. I'll be honest with you, on his side. Yeah, I mean, we all love Batman, but in reality, you have to kill these guys . You got to kill these guys too. Enough of this ****. Beat around the bush. How many times has Joker gotten out and killed thousands? Kill him. Just kill him. Just be done with it. Just kill him. People don't, you know, humiliate Black Mask by taking out his game. People don't give capital punishment enough credit for making Gotham City a better place. If I lived in Gotham City as just a normal, you know, I run like a dry cleaner and there's just a bunch of psychopaths terrorizing the town all the time. I like someone has to kill these guys. Yeah, kill them. Clearly Gordon and his band of goons ain't going to get it done. Now, what what do you have like the disruptor? Do you have all the other materials you we'd",
            "start": 333.8
        },
        {
            "text": "someone has to kill these guys. Yeah, kill them. Clearly Gordon and his band of goons ain't going to get it done. Now, what what do you have like the disruptor? Do you have all the other materials you we'd have as Batman in a silent Predator situation? Look, no, you have a flashbang, a gun, and a face. Oh, a grenade. Uh, that's it. A gun, yeah, the grapple hook and a flashbang grenade. So we're going to have to go old school with this and just shoot people in the head. Yeah, probably. You still silently take him out, of course. Or I could just have done that. He's on to you, it looks like, or he's looking for you. All right, he doesn't have figure we're going to do here. Now, do you like this kind of stuff? I love this. I love Predator mode stuff. Um, um, I'm not great. Yeah, you go. Yeah, like I was saying , telling you today in the of course, we put up our review discussion on uh Batman: Arkham Knight's. I'm way better at it now than I was when I started the game. I really should have just done AR Challenges for the first 15 hours",
            "start": 379.12
        },
        {
            "text": "course we put up our review discussion on uh Batman: Arkham Knight's. I'm way better at it now than I was when I started the game. I really should have just done AR Challenges for the first 15 hours to get really good, learn about my new weapons and such. Whoa, Black Mask's doing some dances up there. Get him, get him, get him. Get this guy's mine. Get him. I got this. Yeah, Nicki. Yeah, sexy. Oh, **** yeah. This is kind of messed up. That's ****. That was really like uncalled for, bro. What are you talking about? We just said that he need to kill everybody. This is awesome. I jam. I like to just do you do you utilize the grates a lot? Yeah, once in a while. I don't like that it seems like every time I went into a grate this time, they're like, \"Hey, someone's moving down there.\" I'm like, \"What the ****? What? Come on. What's the point of the grate if I immediately get seen?\" I wouldn't be looking at the grate for people. Uh oh, it's me. Yeah, they know Red Hood. They just announced it. It was you. What this was about. Can you",
            "start": 424.96
        },
        {
            "text": "the point of the grate if I immediately get seen? I wouldn't be looking at the grate for people. Uh oh, it's me. Yeah, they know Red Hood. They just announced it. It was you. What this was about. Can you get him? No, that sucks. He doesn't know exact. Oh, damn. That's nice. That's a nice takedownage. See, now they're all like, \"Where'd he go? We can't see him.\" And I'm going to just wait for them to one by one come in here. Well, you got two coming in though. Be careful. Oh, yeah. Don't get cocky, kid do. They not know what's that now. Get him, get him. Excuse me. ****, he's on me. He's under us. Yeah, I'm coming around this place too, buddy. Hey, I don't know where Spider-Man is. Oh, he's by the cranes. Very personal. You're making mincemeat out of these guys. Yeah, I know. They don't really know what's up. You were born to be a killer, not to be the Batman. Y'all look like a bunch of dead ****. I'll be honest, this is like a lot more gratifying than being Batman. Yeah, knocking him out. We all have a bloodlust. Also, I like that his takedowns.",
            "start": 465.52
        },
        {
            "text": "not to be the Batman. Y'all look like a bunch of dead ****. I'll be honest, this is like a lot more gratifying than being Batman. Yeah , knocking him out. We all have a bloodlust. Also, I like that his takedowns, like when you do the uh ground takedowns, is just yeah, he just shoots him. But this in this, you'll notice I just instead of doing a silent takedown, I actually like went to actually hit him and he just snapped his neck. Yeah, so it didn't alert the guards, which is kind of interesting. So you can actually do that that stronger um takedown and not have to worry about alerting everyone to your presence. Like, \"Oh, so that was the Knockout Smash.\" That was the Knockout Smash. I I think so. Let me try it again. Let me see if I can do. I thought it was just your usual silent take. I'm going to do it on this guy right now. It's going to be tough. He going to be tougher. Oh, you got it. Yeah, go there. Go there. It's not giving me the prompts to get the oh, do you have all your prompts turned off? No. Oh, I can't do half these",
            "start": 524.08
        },
        {
            "text": "now it's going to be tough . He going to be tougher. Oh, you got it. Yeah, go there. Go there. It's not giving me the prompts to get the oh, do you have all your prompts turned off? No. Oh, I can't do half these things. What are you trying to do? Trying to jump down on this guy and like smash him, but it's not giving. You don't have the cap. You can't glide. Oh, yeah, good point. That's that's what's happening. Red Hood has this motorcycle jacket. He looks like he's a Mark Ryan's friend. What the hell did I just do? Where'd that guy go ? Oh, he's down there. You can probably take down jump from here. No, he would think so, but it's not giving me it. Well, let him go forward a little bit and then just come on down. You're playing a dangerous game of cat and mouse with this dude. Watch. Oh, I guess it does do that. Okay, so there there was a little rumble. Make move on this guy. Oh, this guy's mine. Does your wife watch you play? Uh, she watched me play for a little bit and then was like, then she started watching Netflix. Yeah, see, I",
            "start": 561.04
        },
        {
            "text": "there was a little rumble. Make move on this guy. Oh, this guy's mine. Does your wife watch you play? Uh, she watched me play for a little bit and then was like, then she started watching Netflix. Yeah, see, I think it's this your takedown, which is awesome. That is cool. It's fast takedown. Batman's takedown is way too damn slow. Batman, your old news. It's all about Red Hood now. I have left. Oh, this guy got two. They're they're there together. Oh, that was that was a ballsy move, but you can do. No, you still got him. Good job. Who you going for first? All right, good job. Make make it making you move on Old Bluey. Shh, not so loud. Yeah, yeah, sounds like a jazz musician. Yeah, yeah, not so loud. A lot, man. Keep the face, you know, with The Go onies. Here you go. Putting you down like a dog. Like a dog. Like a dog. Begged like a dog. Dog. I got to watch Begins again too. I want word with your boss, Black Mask. You just broke my neck, man. You ain't going to kill me. You ain't going to kill me. Do I look like Batman to you? I got this cool",
            "start": 603.6
        },
        {
            "text": "dog. I got to watch Begins again too. I want word with your boss, Black Mask. You just broke my neck, man. You ain't going to kill me. You ain't going to kill me. Do I look like Batman to you? I got this cool motorcycle jacket. You up with lead for real. But you ain't going to get him. He knows you're coming, freak. And pow. Good job. Look at you. You were born to be Red Hood. I know. It's sad really when you think about it. Everyone wants to be the Batman, but in reality, we're all just the Red Hood'cause he's making Gotham a better place. Is it's not you should play this. I mean, I'm assuming you're going to go back and play this through one more time. Nope. No, this is it. No, I'm joining one. I'm seeing with you. Okay, you're going to get me the trophy. I don't need to worry about it. Okay, I'm going to play Harley Quinn next. Okay, cool. So I mean like I'll still do my DLC damage. That'll be tomorrow. Sounds fun. Don't worry about it, guys. What the hell? What? It's a Red Hood. Oh, what's up, everybody? Oh, none of you have guns. Oh,",
            "start": 653.48
        },
        {
            "text": "****. Nice job. See, I make the noise for you too. I had some special sound effects in. Oh, ****. Dude, you got no Cape Stun, right? Yeah, it's annoying. So you got to hop over and hit him. Yeah, you kind of just have to. You lean him over to that thing and use the environment. Yeah, how do you do that? I I never actually once you get him over there, I think it's uh Square. Just get close to it and it'll pop up and say special takedown. Now you're dead. Nice. Nice. The guy finally was like, \"Maybe I should get a gun too.\" Yeah, hey, this guy's shooting us all. Has gigantic cannons his arms. Oh, this is not going to go well for me. What are you talking about? You're going to be fine. I'm in low on the old health. This should give you new health for this should not the think of anymore. I think I'm yeah, you got new health now.",
            "start": 701.4
        },
        {
            "text": "for me. What are you talking about? You're going to be fine. I'm in low on the old health. This should give you new health for this should not the think of anymore. I think I'm yeah, you got new health now. When you were shooting and it was going, was that just one hit or was that like? No, that was me just holding the trigger down. Gotcha. Gotcha. Gotcha. Gotcha. Gotcha. Black Mask can take a beating. Get him. So how's it feel? Is the combat good? Yeah, it's good. This is more Batman and this is, you know, Arkham. I mean, right now it's a little hard'cause I'm got stuck. You're relearning. You're learning to walk again, as they say. Damn, like I like dodge bullet. Nick Scarpino's like, \"No, I'm going to kill him.\" Black Mask, my ****. Yeah, I can't really tell. I think I'm supposed to take all these guys out first. I I have it strikes me as one of those where you're going to take them all out and he's just going to get reinforcements. Yes. Yeah, these are all new dudes, right? So **** it. Do your thing. Do your thing, Playboy. You're",
            "start": 773.72
        },
        {
            "text": "me as one of those where you're going to take them all out and he's just going to get reinforcements. Yes . Yeah, these are all new dudes, right? So **** it. Do your thing. Do your thing, Playboy. You're doing great, Nick. Very proud of you, Nick. You you're time. I'm dodging the bullet or am I getting hit by it every time? Um, the fact that you're not dead, I would say is yeah, you're doing pretty well. I really like this outfit. Yeah, it's pretty cool. **** you. Careful with that thing, dummy. You might shoot yourself. Everyone remember to yeah, **** him up. Colin. I called you Colin because you're playing games so well, you're acting like Colin. That's fine. It's the highest compliment I can pay you. Appreciate that. Use dodging bullets like nobody's problem. Shooting Black Mask in his stupid head. I like how everybody else is like taking realistic amounts of bullets. Black Mask in true boss fashion is going to take 30,000. I think I I'm getting a button prompt where I think I'm supposed to take him down and smash him, but",
            "start": 842.84
        },
        {
            "text": "I don't think I'm doing it correctly. Well, I think is are you it's just giving you I think the uh **** your usual takedown combo takedown thing. But I would try to spend him on him, man. Don't let him. Damn it. The tacklers, man, they're hard. I don't like them. Let's try to do this again. I **** unload. Oh, there you go. There you go. Interesting. Interesting. So the gun usage of the gun breaks your combo. Come on, you actually fight. Holy ****. Why the **** are there so many people? They keep bringing them.'Cause I have to get him. Yeah, this is just like when you're fighting , there's a bunch of goddamn stupid adds running around, but you're really just trying to take out the one guy with a shield and the one brute that has to go out a special way. I hate that crap. Oh , I see what you're talking about when",
            "start": 899.68
        },
        {
            "text": "Black Mask is down, he has stars above his head. Do an instant takedown. Oh, ****. ****. Going almost as as you. Oh, good one, Troy Baker, man. Nick's fired up. Oh my God, it's close. Nick, get put him down like a dog. Good job, buddy. Jesus God, that was close. You lived dangerously. See, I'm not great at combat , but I get through it. Yeah, drugs, guns, weapons, whatever you want. I'll pick a plate. Leave Gotham. Never show my face again. Anywhere you want, I'll go anywhere. How about you go to hell? Dang. No, say I had a Joker for me. Spoilers for The End Arkham if she more caught up. Sorry about that. There you go. That was it. See, not bad at all. Not terrible. So what did you think? How'd it go? It's fun. It's a little uh uh it is short, you know. Yeah, no, that's not bad. It's fun. It's cool to play as the opposite uh or the different",
            "start": 977.0
        },
        {
            "text": "fighting styles, right? I that was part of part of the strength of the game is that you get to play a little bit as Robin, you get to play a little bit as Nightwing. Um, and this is different. It's cool. And and the guns definitely add another element to it. It's not quite as fun obviously as if you've gone through the game for you know, 40 plus hours and upgraded everything that has to do with your Batman. You just wreck shop like a god, like a dark God. God. Uh, but it was fun. Good. All right, I liked it. Ladies and gentlemen, that's the Red Hood Story Pack for Batman : Arkham Knight. What do you think of it? Let us know in the comments. Then of course, make sure you keep coming back here to youtube.com/KindaFunnyGames each and every day for a brand new let's play. Just like tomorrow where if everything goes",
            "start": 1071.2
        },
        {
            "text": "according to plan, I will play the Harley Quinn Story Pack. We'll see. Until next time, it's been our pleasure to serve you. Circle again. You need to go into my game, the continue story. Okay. And then from there, there's that thing I think, right? That says uh story or something or other. Yeah, yeah, you don't know what the hell you're talking about. I'm just going to play around. So I do this load screen. So we'll go through once we're inside. Okay, that's a Riddler. Know that. I did know that. I got to that part and then I was like, \"Well, well, **** you, Riddler.\" He's like, \"That's great. You did all these cool puzzles for me. Now go solve 243 more.\" And I'm like, \"****, it's not happening, dude.\" All right, so now'cause I'm stupid too. What is it? It's a one of the d-pad ones, right? Is it am I going here? I don't remember. Circle.",
            "start": 1108.36
        },
        {
            "text": "me now go solve 243 more. And I'm like, \"****, it's not happening, dude.\" All right, so now'cause I'm stupid too . What is it? It's a one of the d-pad ones, right? Is it am I going here? I don't remember. Circle. Do I may be left in the d-pad when you're out of this? Is that left? That's left. I mean, that's left. These are all the AR Challenges. Yeah, up there's one. Okay, down. Oh, I didn't know you do that. Look at that. Down's weapons. Hit start. No, hit the map button. We're the stupidest people. No, they just didn't make this very easy. It wasn't in that downloadable content. Yeah, I know. That's why I thought you should be able to just go to that. It's where it is. It's supposed to be. You sure about that? I'm pretty sure that's where you go download it and there's something that says like Gotham City Stories. I thought somewhere I've seen it before. Let me see quick. You play you you drive this the worst let's play ever. That's why we're not going to use any of this. Maybe we put at the end as a jokey joke joke of the fact",
            "start": 1160.56
        },
        {
            "text": "I've seen it before. Let me see quick. You play you you drive this the worst let's play ever. That's why we're not going to use any of this. Maybe we put at the end as a jokey joke joke of the fact that no we can find was it that any of the **** content? No, this is me not show showing you all the awesome trophies I have from from Riddler. All right, great job. Thank you. I'm really good.",
            "start": 1223.76
        }
    ]
}