{
    "id": 939,
    "video_id": "uBTlCuIwF0c",
    "show_name": "Announcements",
    "hosts": [],
    "title": "#KindaFunnyE3 - How to Watch Kinda Funny at E3",
    "description": "LIVE! Sunday - Monday\nwww.twitch.tv/KindaFunnyGames\n\nLIVE! Tuesday - Thursday\nwww.gamespot.com/E3\n\nLIVE! Friday at The Attack\nwww.twitch.tv/KindaFunnyGames\n\nKinda Funny Gamescast\nwww.youtube.com/KindaFunnyGames\n\n\n#KindaFunnyE3\n\n\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\n\n\n\nMusic by Tonedeff!: http://www.QN5.com",
    "published_at": 1434326106,
    "duration": 161,
    "transcript_chunks": [
        {
            "text": "What's up everybody? I'm Greg Miller and this is the Pure One Tim Gettys. Let Tim host Tim We're here at E3. Oh yes it's very exciting. Kinda Funny's first E3 and we decided we wouldn't go quietly into the night. Our first E3 would go pretty big. So there's a whole bunch of stuff to tell you about it. As Colin Moriarty already put it it comes in acts. So act one is what Tim? Act one is the Kinda Funny Twitch Extravaganza. So on twitch.tv/KindaFunnyGames on Sunday and Monday we're covering all of the press conferences. You get a pre-show you get a post show you get all that goodness. You want to watch the conferences we're going to have it right now. That's the big thing. Everybody's asking us like \"Do I have to click off on the No you could just put on twitch.tv/KindaFunnyGames and sit there the entire day. Sunday just leave it on through Monday doing your whole thing. You talk to all your friends . You say \"Hey Devin CM what's up?\" Ian Gills what's happening in Ireland?",
            "start": 0.24
        },
        {
            "text": "sit there the entire day. Sunday just leave it on through Monday doing your whole thing. You talk to all your friends. You say \"Hey Devin CM what's up?\" Ian Gills what's happening in Ireland? Nobody cares. Yeah it's going to be good. It's going to be really really good. And then for all of you at home that aren't watching live you can watch it on VOD on YouTube and SoundCloud all the podcast stuff. Cuz what we're doing is we're doing a special Gamescast post show for every single conference. Every conference you're getting a new Gamescast pumped out to you via video and MP3 players around the world. Yeah. So that's going to be a lot of fun. That leads to act two. Now act two is probably the craziest thing we've ever done. It's GameSpot Cross Kinda Funny. GameSpot Cross Kinda Funny. Not NX. This is NX. This is GameSpot Cross Kinda Funny. Uh basically what's happening Tim is that GameSpot was like \"Hey we have a second stage. Do you guys want it?\" And so",
            "start": 36.48
        },
        {
            "text": "Cross Kinda Funny. Not NX. This is NX. This is GameSpot Cross Kinda Funny. Uh basically what's happening Tim is that GameSpot was like \"Hey we have a second stage. Do you guys want it?\" And so we took it and we booked it with all our crazy LA friends and devs. We got Cisco. We got Brandon Ralph. We got Devon Sal. We got Tony Hawk. I get to interview Tony Hawk. We have Neil Druckmann. We have Bruce Straley. We have Troy Baker. All these people who are making Uncharted 4. We have Shuhei Yoshida. We have Halo guys. We got Aaron Greenberg from Xbox. There's a million people coming over to hang out with us. All of that is at gamespot.com/e3. And that's Tuesday through Thursday live. We're there talking to you. Crazy things happening. I'm making people eat hot peppers. Oh great. Yeah we love that. We love that a lot. Sorry Jeff Gerstmann . And then act three Tim. What's act three? Act three is we're going to The Attack. Kevin Pereira's thing on Friday. It's gonna be cool. We're gonna do a special",
            "start": 67.84
        },
        {
            "text": "love that a lot. Sorry Jeff Gerstmann. And then act three Tim. What's act three? Act three is we're going to The Attack. Kevin Pereira's thing on Friday. It's gonna be cool. We're gonna do a special Colin & Greg Live where it's Colin, Greg and Kevin Pereira and then we're gonna do some some stuff for them. It's gonna be really fun. So this week's crazy for us. Yeah you get that at twitch.tv/KindaFunnyGames. No funny business there. It'll be there hanging out doing that streaming thing. But yeah attacking. We'll be attacking everybody. Yeah. But the biggest thing is going to be this week of E3. Follow us on Twitter. Follow us on wherever you're watching this video. There's going to be a lot more content coming. Get excited. Talk to us in the chat. And most importantly use #KindaFunnyE3. Nailed it. I got you. That was perfect. I got nothing to say. There you go. Do you want to try one more time or we good? I think we're good. That was great.",
            "start": 105.6
        }
    ]
}