{
    "id": 946,
    "video_id": "vs1dLenqftM",
    "show_name": "Gameplay",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Portillo"
    ],
    "title": "Let's Play Crash Bandicoot - Kinda Funny Plays",
    "description": "Tim shows Greg why Crash Bandicoot is one of the best games of all-time.\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1434481203,
    "duration": 1259,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to their Let's Play here on youtube.com/KindaFunnyGames I'm Greg, this Portillo, and that's Tim. Tim, we're playing your favorite game, it's finally happening, Crash Bandicoot. Let's get right into it. Why the **** do you love Crash Bandicoot? Because it's freaking awesome. It is the natural progression of Mario from 2D to a 3D world that didn't happen. That's what happened . They made a marsupial, they put him in this this linear thing where it's just get to the end. It's the challenge, the only collecting. The start of the endless runners, what you're saying? No ,'cause there is an end, but this is the start, is the first step for the endless runner. I guess that's one way they want to phrase it. There's there's certain levels in this game, yeah, that are like the endless runner, but it's a backwards take on Indiana Jones action. You're running from you're running from the poor baby will always love running their words things they can't. Well, this is probably the game that made me head",
            "start": 0.03
        },
        {
            "text": "backwards take on Indiana Jones action. You're running from you're running from the poor baby will always love running their words things they can't. Well, this is probably the game that made me head back in the beginning. Okay, good. Yeah, so I'm starting off already. Yeah, I've been playing this for maybe 30 seconds and it already doesn't feel right. Let you know that. Why?'Cause they didn't hold up in your head or your city? Because this is how I assumed it would be. Yeah, but it's there anyway. If I could use the analog stick, I'd be nice. Okay, well, you can't yet. I doubt you can. Oh, there we go. See what happens. Now you got that. Now, sure is working. Sure is doing its thing. It's not working at all. Oh, wait, what? Now hit X. That's right. That was that was my problem. Do that. Right, right, right. No, see, Greg, so just give up, please. Why isn't it and played it? ****. Thank you. But it's calling. Mm-hmm. Yeah, but Tim, the PlayStation just like fixed that. No. Well, that's dumb. PlayStation can't do a lot of things cool.",
            "start": 40.23
        },
        {
            "text": "just give up, please. Why isn't it and played it? ****. Thank you. But it's calling. Mm-hmm. Yeah, but Tim, the PlayStation just like fixed that. No. Well, that's dumb. PlayStation can't do a lot of things cool. Definitely on the list. It doesn't on the PSP. These are on this one. What's he use the nub? So the thing is, it's really imprecise. Yeah, that's why it wasn't a good game. It's really moving around in a in a 3D space using this D-pad. Right. The thing is, oh God , yeah, I was fall right in the hole in the ground there. There's the thing. I got my homie Aku Aku. How can we forget? He's the mask. Jimmy, get him. He makes this noise that I'm pretty sure you go all ooga booga, but I'm not sure. It's not like, oh my god, I figure. Yeah, that was racist. So now I have now I have Aku Aku. Yeah , and then eventually you got a third one, then you go crazy and it's like they closing and getting the star Mario and I like that a lot. So how old were you when Crash, um, let's see, Crash came out, you said 96. All right, go on.",
            "start": 91.58
        },
        {
            "text": "got a third one, then you go crazy and it's like they closing and getting the star Mario and I like that a lot. So how old were you when Crash , um, let's see, Crash came out, you said 96. All right, go on. That's what he said, 96. Yeah, it feels right. So I must have been like six . Okay. Yeah, this is just the coolest thing you've ever seen. Yes. I didn't have this. I didn't have a PlayStation. So, oh, here we go. Star power. Doo doo doo doo doo doo doo doo doo doo doo doo. It's exactly doo doo doo. All the people at home don't know that you can't hear the music, Greg. Oh, yeah. So you are just ruining everything. I'm what did I ruin? I was just you added give me a word. Yeah, well, that we use in a bit like Mario. Okay. Yeah, it's nothing like Mario hitting turtles and kicking them around. Yeah, totally not like Mario. And as you play this, you can see a lot of the influences that would go on to become Uncharted. Yeah, where Naughty Dog made this. Here we are in the jungle. Well, do you see the opening of this when he",
            "start": 146.64
        },
        {
            "text": "and as you play this, you can see a lot of the influences that would go on to become Uncharted. Yeah, where Naughty Dog made this. Here we are in the jungle. Well, do you see the opening of this when he woke up on the beach? The beach with the waves. You see those pictures going around? Yeah, yeah, yeah. That's explain anything. Nathan Drake is mister - your Crash. He's definitely not Jak . Yeah, I was heartbroken when Jak and Daxter happened because it was so much better than this. No, because it really is. It really wasn't really. I mean, do you admit in your heart at least to yourself that Crash is a great game? No. Okay. You said it was imprecise. So here's my thing. It's not perfect. Yeah. Is it great? Few games are. But it is. It really isn't though. Like, it's not even just like, oh, it's not perfect and I thought it was. It's like, this is really not perfect. Yeah, but it's still good. It reminds me a lot of Donkey Kong Country. Okay. The first one on Super Nintendo. Yeah, great game. Not perfect. Yeah, you compare",
            "start": 197.04
        },
        {
            "text": "it was it's like, this is really not perfect. Yeah, but it's still good. It reminds me a lot of Donkey Kong Country. Okay. The first one on Super Nintendo. Yeah, great game. Not perfect. Yeah, you compare it to Mario. Yeah, right. That's stupid. Same thing here. You compare this to Mario, you're a **** idiot. But on its own, this is a great game and it's fun. The characters has like fun boss fights. It's pretty creative and they have a lot of nice little love gimmicks. They go a little overboard eventually. Crash 3: Warped shared lots of gimmicks. Yeah, that's the thing you'll never forget. Do I want this back in my life? Yeah. Do you really? Hell yes. I want it to be like this or do you want it to be? I want this. I want this. Correct. Definitely. See, I'm having fun doing this and this game gets really hard. Crash 1 , I never beat Crash 1. One day, it's one of my goals. I told you this a long time ago that yeah, I want to do a Let's Play series and let's go through. I'm actually doing it . Okay. One day, maybe I will stream it.",
            "start": 241.2
        },
        {
            "text": "beat Crash 1. One day, it's one of my goals. I told you this a long time ago that yeah, I want to do a Let's Play series and let's go through. I'm actually doing it. Okay. One day, maybe I will stream it and see if I can do it because there's certain levels that are just so hard. Yeah, and it's not like they're hard because I actually hard a lot in this challenging because of the controls and stuff. Okay. Because you know, because the perspective, yeah, and yeah, the loose platforming. Mm-hmm. Is not a good gig. Without your mask, is everything over there? That's what it's not. Your stupid saying is not okay. Like you were actually stupid. Yeah, yeah. When I was a little kid, I was six and I didn't have this. I didn't have a PlayStation. So, yeah, where does your affinity that was even come at that point? I had a Super Nintendo. Sure. I loved it dearly. And then every once in a while, I would go over like to my friend's house. An older sister had a birthday. Nice. And she'd always be playing this and Point Blank. And I fell in",
            "start": 286.95
        },
        {
            "text": "Sure. I loved it dearly. And then every once in a while, I would go over like to my friend's house. An older sister had a birthday. Nice. And she'd always be playing this and Point Blank. And I fell in love with this little Band icoot game, Crash. Yeah, and I'll never forget it. Yeah, but the thing is, I feel like anyone around my age also loves these games. Okay. And I don't think it's all just because of nostalgia . A lot of it has to do with nostalgia, right? But not all. Yeah, just some. Like, there are they are good games. Damn. Come on. Let me blow yourself up. So, God, don't be stubborn. That's it. Come on, Jak. Get out of there, Jak. Yeah, Jak, are you Jak, fun? Yeah, love Jak, really? Mm-hmm. Did you not agree, Greg? Yeah, I was one of those things that happened overnight because I wanted more. So happy. See, then move away from ya. Take everything they learn here, put it into The Precursor Legacy. Now talk about. So now the thing about this one, Crash Bandicoot, yes, is that how do you you are into these games, but you're not looking",
            "start": 332.28
        },
        {
            "text": "take everything they learn here, put it into The Precursor Legacy. Now talk about. So now the thing about this one, Crash Bandicoot, yes, is that how do you you are into these games, but you're not looking forward to Yooka-Laylee? I am looking forward to Yooka-Laylee, but it took you a while to come on board with it. You weren't well immediately sold on Yooka-Laylee. Well, that's because Yooka-Laylee does my least favorite type of 3D platform ing, which is collect-a-thon. Yeah, now you come around on it. I mean, I'm excited for it'cause it's been a long time since I've had a good one. Don't worry about it , Nick. See, she doesn't sup. You gonna put in the new code this year? Yeah,'cause that's fun. I these games worked pervert. Mm-hmm. You got a password. I don't know what's happening. It's reading the card to directory. All right, let's go give you a passcode. Everybody at home, remember this passcode: square, triangle. I've hidden a lot of things. Right, triangle.'Cause seems like that's all you need. There you go. There we go. We're good. We're",
            "start": 387.43
        },
        {
            "text": "let's go give you a passcode. Everybody at home, remember this passcode: square, triangle . I've hidden a lot of things. Right, triangle.'Cause seems like that's all you need. There you go. There we go. We're good. We're moving on. Looks like the passcode is one. Everybody, okay, Jungle Rollers. So this is one in gaming. It's a it turns a little bit more into a 2D platformer. Okay. Since you like that. Or sorry, not this one , it's the next location. Okay. I like the switches. Thought that reminds me a lot of Mario Galaxy. It's physically murder down. Oh God. Oh damn. By the Galaxy 2. Jak's dead, man. Jak Jak is dead in a lot of different ways. I don't want to talk **** about Jak'cause he used to hold me. It's just, you know, I like Crash more. Crash had the best commercials. He was the PlayStation mascot. When this is when your your console needs a mascot. Yeah, and I think I missed that more than anything. Now the mascot, Shuhei Yoshida. He's a better mascot. I don't know . You don't know the secret is better than I love to, but I",
            "start": 434.95
        },
        {
            "text": "console needs a mascot. Yeah, and I think I missed that more than anything. Now the mascot, Shuhei Yoshida. He's a better mascot . I don't know. You don't know the secret is better than I love to, but I love Crash. But here's my thing though, what you're mistaking is the fact that most people don't know this, Greg. I'm sorry, but it was actually Shuhei Yoshida in the Crash commercials. Interesting. Because you can see the guy's face and never really look like Shuhei Yoshida. You know what I'm saying? Because you see his mouth was the guy's face and he put the megaphone up to his own face. That's not true. Yeah. Mm-hmm. Pretty sure not true. Okay. Yeah, I didn't know that was something else Shuhei Yoshida. He's a lot of things. The only does up. Look at this, man. The Great Gate. Yeah, this is the level I'm talking about. It's just that it's just, Greg, there's a kid. You had your SNES, you had Super Mario World. Yeah, and you came over and you see this, me like, oh man, this looks great.",
            "start": 477.58
        },
        {
            "text": "Yeah, this is the level I'm talking about. It's just that it's just, Greg, there's a kid. You had your SNES, you had Super Mario World. Yeah, and you came over and you see this, me like , oh man, this looks great too. Yeah, there's like trash compared to Super Mario World. No, but again, that map, what does that map look like? It looks like Donkey Kong Country, right? Was it a trash game? No, my God. Yours. Hey, dude, it's really bananas and gets shot out of kongs. What's the point of this game? We're collecting bananas and shot out of kongs. Great . Thanks, Donkey Kong. You're a real **** legacy. They're not kongs, they're barrels. God dammit. So are you cracking the pressure here? Can you get Crash up there? It's hard . How quickly could six-year-old Tim beat this? Probably just like this because the controls are atrocious. The truth comes out, everybody. Truth in my whole time. I'm never gonna stand behind this game and say, sure, it was your favorite game. I it's not my favorite game of all time. You keep saying it's your favorite game. No.",
            "start": 523.07
        },
        {
            "text": "out, everybody. Truth in my whole time. I'm never gonna stand behind this game and say, sure, it was your favorite game. I it's not my favorite game of all time. You keep saying it's your favorite game. No. Nick, what I am saying is that I want to beat this game. Okay. I'm having fun playing this game right now and I want it on my face like the remastered version. I would love that. Give me a Crash Remastered series. I'm really doing. I just want Crash 1, 2, and 3 remastered with slick visuals and better controls. Oh, yeah. If they give me analog, I feel like that would help a lot. Yeah, see, this is the thing. When the PlayStation came out and you go into the stores and play their little demo kiosks and this is it. I was just like, what the hell is this? Really? Yeah, I did not like ****. Yeah, that's correct. I thought the commercials were hilarious, don't get me wrong. But like everything you're showing right here is pretty much why I was like, no thank you, sir. Struggling to get up there. Okay. Tiny ass little hit.",
            "start": 578.12
        },
        {
            "text": "I thought the commercials were hilarious, don't get me wrong. But like everything you're showing right here is pretty much why I was like, no thank you, sir. Struggling to get up there. Okay. Tiny ass little hit. Landing zones. Getting fruit for no reason. You know, I hate the fruits. There's reason for everything. What's the reason to get the Wumpa Fruits? If you get a hundred, you get a life. Damn. I think he's in here in a wreck. I'd be lying if I told you my hands weren't really sweaty. Right. Really? Yeah. Is it'cause it's your favorite game? Won't they redeem all my favorite game of all? You want to see how I grab? Can you get Crash through? God--all. Watch out, man. That's good. My dad, Simpsons game, Crash Bandicoot. He wasn't, you know, why. And I thought that was funny. You bet , Greg, you love them. Look like an idiot in front your friends. Yeah. Wow. Cold, man. Mm-hmm. It's a cool way to play your dad. Mm-hmm. I've never been a good person. Tim is getting cocky. There you go. There you go. Let's go. Do you got nothing for you?",
            "start": 631.36
        },
        {
            "text": "in front your friends. Yeah. Wow. Cold, man. Mm-hmm. It's a cool way to play your dad. Mm-hmm. I've never been a good person. Tim is getting cocky. There you go. There you go. Let's go. Do you got nothing for you? Nope. It has it's very well. It's time to admit it. See, Kevin thinks this looks like fun. Kevin is dumb and stupid. It's finally a bonus. Right? Yeah, yeah. You better get them hands nice and dry. How long do you think it'll take you to beat this game? You said stream it. That's not like a crazy month. You're not gonna be able to stream this in one sitting. Again. Yeah. Oh, we get that long, Tim. Greg. Well, yeah, but you're not good at it. Oh, yeah. No, no, no. It's probably it should take me about probably five hours to beat. Okay. I'd probably take me about 10 hours. Okay. Get out of there. Don't don't get cocky. I see it with Sonic games where I'd wait for the lava to get close to me and then running from the lava'cause I was a badass. And my mom was like, no danger, Greg. No, do it. Get out here, mom. Oh God. So I don't know if it's",
            "start": 677.74
        },
        {
            "text": "games where I'd wait for the lava to get close to me and then running from the lava'cause I was a badass. And my mom was like, no danger, Greg. No, do it. Get out here, mom. Oh God. So I don't know if it's in this game, in the other Crash games, you get a bunch of different power-ups. You can like jump and do this like ground pound thing where you spot . So that sounds like it's that something you put in the sequel and that's good. And then he gets a rocket launcher that shoots the Wumpa Fruits. Oh, that was fun. Does that deplete and don't take that yawn as the fact that your favorite game of all time is boring as ****. It is. Does that deplete the number of Wumpa Fruits you have? I don't remember. It's not a commodity. Are we trading in W umpa here? But it show the password for Tim, Greg. That's your password. Every. Okay. Just remember that sacred symbols of PlayStation. Yes. The Great Gate. Done. You're just done. You're you're cleaning through this game now. It does the same thing Naughty Dog sometimes she does where there's",
            "start": 750.82
        },
        {
            "text": "only save points at uh-oh, family, like, wasn't them. But uh, save points are very infrequent. Yeah, and you'll have to beat like four levels at a time. Oh, dang. To be able to save. And some of them are really hard because they're surrounded with classified bad design. Good job, Naughty Dog. Like, that's how you ever become anything. Hey, great again. Yeah, but you missed lots of boxes. I did. And I learned that the hard way because they drop them on you to show you you screwed up. Now the thing here you also need to remember is that Crash Team Racing is a superior kart racer to to your Mario Karts. It's just hard to believe that you drank the Kool-Aid of so many companies. Mm-hmm. Everything Crash, everything Naughty Dog. Yeah, I just I don't know. I don't know about you sometimes, man. So we're probably gonna end the Let's",
            "start": 795.51
        },
        {
            "text": "Play on this one. Good. The old run into the camera . Nothing bad will happen here. This is what everybody enjoys. Calling you while running the camera. Everybody loves this ****. Here you go. Here's a little a little present for Nick. Yeah. Are we doing this? Yeah. Did the three assessments? Yeah. Childhood friendship. So I got past the first one. Yeah. Can you again? I do it again. You might remember this. This is obviously inspired when in Uncharted, Nathan Drake had to run from the car and shoot behind him as ya. Didn't say it was inspired by me. Oh God. Nick, is there a tribal dance happening inside what they're trying to do? The Crash Bandicoot. Ah, okay. Yes. Crash Bandicoot, the Spanish Bandicoot. Good job, Nick. Actually sums this game up quite well. No, no, no, no, no. You guys in the comments, telling us, Greg, say a",
            "start": 851.11
        },
        {
            "text": "trying to do the Crash Band icoot. Ah, okay. Yes. Crash Bandicoot, the Spanish Bandicoot. Good job, Nick. Actually sums this game up quite well. No, no, no, no, no. You guys in the comments , telling us, Greg, say a bunch of obscenities at Greg's. Oh, well, also let me know what you think of Crash Bandicoot. Not to be confused with Brash Bandicoot or Trash Band icoot. Be at E3 this year as Naughty Dog brings back the fray. How far could you get him? This is a six-year-old. I got really far. Yeah, yeah. But then there's people out there saying that they beat this game that I just simply don't believe. You don't? Yeah, yeah. Naomi Kyle, she's telling me, oh, I beat Crash Bandicoot. Like, no, you did not . Like, I've seen what's the final frame. She would never know. There's no way. I don't believe anyone ever beat it. No one. There's definitely not any Let's Plays on YouTube showing the any really. No, there is not a thing. I thought that in pretty cool. I willing you gotta step it up, son. Tim, it's man. I'm willing to bet that",
            "start": 915.31
        },
        {
            "text": "there's definitely not any Let's Plays on YouTube showing the any really. No, there is not a thing. I thought that in pretty cool. I willing you gotta step it up, son. Tim, it's man. I'm willing to bet that no one I know has beat this game. Okay. Seems like a safe bet. Yeah, Tim doesn't like that. But I beat 2 and I beat 3. I know that for a fact. I know that to be true. I just don't understand how to beat your favorite game of all time if you didn't know. I mean, you say it wants to say it again. I'm a punk-ass **** and I would never say that about you. Thanks, Nick. Thank you. Okay, that's right. They're not against them though. They got you. That's how they get you. That's how they got the hours of replay out of this game. If they would have made it, you know, control well, then this game would have been a lot shorter and nobody would remember. Look at the fear on his face. No, the you know, Crash looks good . Yeah. All right. All right. That's it. Again, we made a pan out on don't don't show up too early. But",
            "start": 969.61
        },
        {
            "text": "a lot shorter and nobody would remember. Look at the fear on his face. No, the you know, Crash looks good. Yeah. All right. All right. That's it. Again, we made a pan out on don't don't show up too early. But if you're aware that's what you're doing wrong. Yeah, I know what nothing too early. I know it's when I go through your life here. The hallway. Here we go. Here we go. Here we go. I don't know. My God. No, no. Yeah, that one's hard. I got to hold down down and X. I got to hold X. Greg, you just gotta steer him, man. All is yours. Yes, you definitely need to stand. I'm not really standing the flow record. He just going. Well, he's going here. But like, we need to steer him. When you need to steer him . You know, I guess they're they just had this day. I didn't steer him, man. I'm just holding down. I've cleared my mind. I'm a blank slate. Crash is communicating with me and Greg, you're so close. You got you got farther than that. There's one more at that. Yeah, I'll give you a cold chill. Did I was like, you ****. Did you really not",
            "start": 1024.48
        },
        {
            "text": "Crash is communicating with me and Greg, you're so close. You got you got farther than that. There's one more at that. Yeah, I'll give you a cold chill. Did I was like, you ****. Did you really not hold left or right? No, just hold on. If the secret is just holding down the whole time, I'm pissed. Again, it's it's kind of like that episode of MacGyver when he was asked to come judge how these people picked locks on doors. It was like he was like a Yankee Swap, right? Where somebody would do it. A team would make the lock for their door and somebody else would make him get a switch out and see who did it. And this a kid, everyone or thinking it, they were using like freezing coolants and stuff and weird lock picks. And eventually on this one door, they couldn't figure out how to do it . They'd done. And the kid that the door wasn't locked. It was never locked to begin with. So he just had to turn the handle. Yeah, I just hope that a joke didn't work. Right. I just blew everything up for you. Holy, this is",
            "start": 1080.98
        },
        {
            "text": "the kid that the door wasn't locked. It was never locked to begin with. So he just had to turn the handle. Yeah, I just hope that a joke didn't work . Right. I just blew everything up for you. Holy, this is how you can beat it now. Now you know how to beat it. I mean, I've been this level a million times. No, I know you've never beaten this game. Yeah, see, here's where you have to start moving. Okay. Oh God. Get back. Pass on these Blair Witch Project crosses. Back, violin, Nick. Hey, you got you got to the war. Be another thing to add into later games as he does the Dax. No. Oh, really? No. Yeah. I had taste. Mm-hmm. That's just been thrust upon me by the community. I had taste and I realized this game was garbage. No. And I said, no thank you. So no, no. You make good commercials. Please only do that. And you know, I Sony said they said okay. And I'm eventually just retired him, sold them to somebody on the phone. It was a bad decision, man. Now you'll never see me again. So it all worked out. He's coming back. E3 2015. Really?",
            "start": 1130.69
        },
        {
            "text": "they said okay. And I'm eventually just retired him, sold them to somebody on the phone. It was a bad decision, man. Now you'll never see me again. So it all worked out. He's coming back. E3 2015. Really happening? No, I'm just hoping the week this goes up, Crash Bandicoot is going back. By the time you see this Let's Play, I'd be awesome. Neil Druckmann, come to anybody. A lot of it, people are excited about Uncharted 4 for things. We're putting it on on hold. Crash is back. I mean, it could just be a crossover game. I'd actually be kind of okay with it. It would just be Uncharted 4. They're like, it's a new subtitle. Issues do Naughty Dog Team Racing. That's all. It's all. All right, ladies and gentlemen, what do you think of Crash Bandicoot? Is it as Tim says, his favorite game of all time, or is it garbage? Let us know in the comments. Then make sure you keep coming back to youtube.com/KindaFunnyGames for Let's Plays each and every day. Of course, go over to GameSpot if it's still E3 and check out our YouTube",
            "start": 1192.45
        },
        {
            "text": "the comments. Then make sure you keep coming back to youtube.com/KindaFunnyGames for Let's Plays each and every day. Of course, go over to GameSpot if it's still E3 and check out our YouTube coverage. If it's not, then good luck in the future. Are the robots yet that are like **** flying?",
            "start": 1242.23
        }
    ]
}