{
    "id": 968,
    "video_id": "XFbgqd1YHbc",
    "show_name": "Reactions",
    "hosts": [
        "Tim Gettys",
        "Nick Scarpino",
        "Alexis Pence"
    ],
    "title": "Game of Thrones Season 5 Review - Kinda Funny Reacts",
    "description": "Get everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1435265484,
    "duration": 1924,
    "transcript_chunks": [
        {
            "text": "What's up, guys? I'm Tim Gettys. I am joined by Nick Scarpino and let's get Lexi yourself. Hey guys, Alexis Cozias. This just feels right. What now? We're doing the Game of Thrones Season 5 review here. Scoot your chair, little chair, little. You don't have between. Are you? What do you got on there? There we go. She's in Tim, a Tim and Nick sandwich. My favorite type of sandwich. It's like a Game of Thrones, right? This is right. So in Season 5, it ended. We started Season 5 with the review with you. Mhm. And then we just haven't done any'cause we've been super busy doing a lot of, you know, video game things and other stuff, Kinda Funny Live, bunch of other things. But anyways, the most important thing is the season is now over, so we get to look back and give our thoughts. Now, I'm assuming this is going to be very spoilery. No, entirely. Okay, so if you don't want the entire season, actually all five seasons of Game of Thrones spoiled for you right now, just mute this but keep watching because we're such lovely and",
            "start": 0.24
        },
        {
            "text": "spoilery. No, entirely. Okay, so if you don't want the entire season, actually all five seasons of Game of Thrones spoiled for you right now, just mute this but keep watching because we're such lovely and good-looking people that you're going to want to see all this. Just put us, put us on your TV right now. You need to have one of those, you guys need to have one of those like alerts, you know, like the flood alerts. Well, we had a Kevin wanted us to just tap our head when we went spoiler and he was going to put this like an me like a good-looking people alert. Oh, I mean that no, no, no, that's just as egregious. Every single one of our videos just needs to be flash. All right guys, so Game of Thrones , Brad Pitt of the internet. I am the, he's the Brad Pitt of the internet. Speaking of, I heard that you caught up with my brother for a little while. I did. Can't wait to hear that . Uh, Tim, what were your first thoughts? What did you think about Game of Thrones Season 5? My first thoughts are I don't understand why everyone hates it.",
            "start": 45.8
        },
        {
            "text": "for a little while. I did. Can't wait to hear that. Uh, Tim, what were your first thoughts? What did you think about Game of Thrones Season 5? My first thoughts are I don't understand why everyone hates it so much. What about you? I feel the same way. Really? Yeah, everyone was so, um, sorry, was so like, it was slow, it was boring. I'm like, what? So much has happened. I feel like how, how can you hate this? We're finally actually making development towards something. See, I feel like it's, it's another one of those situations where we are all, and I included myself in this, so please don't take this as a harsh criticism for everyone out there is watching in present company, of course. We're all a bunch of giant babies and every time we get our sauce or our medicine or our candy, we just, it's not as good as the last time we got it, right? And we're seeing it with superhero movies and now I'm starting to get that Game of Thrones fatigue a little bit where I'm not quite as excited for Sunday nights anymore or whenever",
            "start": 87.72
        },
        {
            "text": "we got it, right? And we're seeing it with superhero movies and now I'm starting to get that Game of Thrones fatigue a little bit where I'm not quite as excited for Sunday nights anymore or whenever my wife decides that it's acceptable for us to watch this week's episode. Um, but it's true, like the fourth season, I was like, ah, this is still awesome, still a great show. Don't get me wrong, it's still the best show on television by far. But it's more of sort of the same and we're, we're starting to get like there's not many characters left that I give a **** about. And so now it's, there's even less reasons for me to look forward to the show every week. Mhm. I mean, I totally, I agree with that and I do think that this is one of the weaker seasons, but people are acting like it's bad and that it's boring. It's like, no, it's slow, but it's like, it's not snail-pace slow, it's just slower compared to the other ones. And I feel like there were other slower seasons, like season was kind of slow. It had",
            "start": 134.08
        },
        {
            "text": "boring. It's like, no, it's slow, but it's like, it's not snail-pace slow, it's just slower compared to the other ones. And I feel like there were other slower seasons, like season was kind of slow. It had moments of buildup and it had moment, I mean, it had a lot of things that happened, but so did this one. There was a lot of things that happened and I think that the, the fact is there's a lot , a lot of the characters we happen, ex, a lot of stuff. Like, let's, let's recap a little bit what happened in this season, right? Uh, um, they've starting from small, like this is in no ranked order, but they, they killed the, the, his daughter, Jaime's daughter, right? She, oh yeah, she got, which, wait, let's talk about Dorne. Let's talk about that place. Is an antidote, antidote for everything. You just, do you want to just need to hold it like this? No, let me just, let me just tell you, just make sure it's close. Um, they have an antidote for everything. Well, first of all, sexiest women on the planet in Dorne. We know this on quote of",
            "start": 174.52
        },
        {
            "text": "hold it like this. No, let me just, let me just tell you, just make sure it's close. Um, they have an antidote for everything. Well, first of all, sexiest women on the planet in Dorne. We know this on quote of the entire season was ,'You want that Good Wife, but you want that bad ****.'Yeah, that was, I would have been like, if I mean, I, I forget that character's name, the guy that his like, Jaime Lann ister's like right-hand guy, Bronn. Um, I just, what a fun character. He like, what a fun time he must have playing that character where he just gets to do those scenes like that one scene where he's just like,'All right, I'm sorry guys, I wasn't feeling that. Can we get one more take on her taking off like taking out her perfect breasts one more time?'That scene was crazy sexy and she had that short like boy haircut, which I don't know why, it just made a whole lot of emotions in my head that maybe it unlocked something that I didn't know was there. Hi Kevin. So I, I really liked the Bronn and Jaime team up, something",
            "start": 217.8
        },
        {
            "text": "which I don't know why, it just made a whole lot of emotions in my head that maybe it unlocked something that I didn't know was there. Hi Kevin . So I, I really liked the Bronn and Jaime team up, something that makes Game of Thrones special is when they take two characters that you didn't think would mesh together and just put them together like Hound and Arya. I think was the, that was awesome. Was the Season 4 that had a little bit more intricacy to it though, because was more of a fatherly and then of course she hated him, but she really didn't hate him'cause toward the end he actually was the only basic family father figure that she had left. Just left him to die. Well, she left him to die. Yeah. Well, he took care of her. That was like the only person she like said. I think Bronn and Jaime was like someone, something people didn't expect, especially'cause it wasn't in the books, but they're just like,'Let's make the show interesting .'And that is another point about this season that I think people are",
            "start": 260.52
        },
        {
            "text": "someone, something people didn't expect, especially'cause it wasn't in the books, but they're just like,'Let's make the show interesting.'And that is another point about this season that I think people are getting hung up on is,'Oh, it went off book and oh, **** this some ****.'Before we go there, let's, let's highlight some of the other big moments, right? Obviously, Stannis is done. Yeah, well, okay. Uh, I wouldn't say obviously, they didn't show him die. Well, okay, that's true, that's very true. He might still be probably dead, like most likely dead, but they did not show. Think Melisandre was like,'****, I **** up.'Saw that moment where she was like,'Uh,'and then goes back to Castle Black. Um, side note, Melisandre is, and this is something, this is my wife's words, it's not mine, she has the perfect body. Who? Melisandre. Oh, I totally agree with this. Oh my God, like every time she gets naked, I'm like, I find her incredibly sexy. Oh, she is so hot, so hot. Um, so back, back, I follow her on Twitter and she's like an indie artist, like",
            "start": 297.92
        },
        {
            "text": "agree with this. Oh my God, like every time she gets naked, I'm like, I find her incredibly sexy. Oh, she is so hot, so hot. Um, so back, back, I follow her on Twitter and she's like an indie artist, like singer, musician. Really? Yeah, I'm following right now. Okay, so going back to Stannis , I think Stannis is one of the most interesting things of the whole show because this season, at least, because we **** hate Stannis. And Stannis not only was like somebody that you disliked because he's kind of a douchebag, just, but he also was a boring character and like he was the plot. You're always like,'****, don't go to Stannis.'In the other seasons, you had an ounce in this season where like you were rooting for. So that's what I'm saying, like it's not even an ounce, it's like this whole season was Redemption story of you. Oh, he's a person, he's good. I'm actually kind of rooting for him. He's working with Jon Snow, he's working with people we like and being nice to his daughter. He's trying to get **** back Winterfell.",
            "start": 344.36
        },
        {
            "text": "you. Oh, he's a person, he's good. I'm actually kind of rooting for him. He's working with Jon Snow, he's working with people we like and being nice to his daughter . He's trying to get **** back Winterfell. He offered Jon Snow the name of Stark. Like all these good things make you care for this character and then in Classic Game of Thrones fashion, it's like, no, no, no, don't care for people. I mean, it's good that Jon didn't take that, that, uh, that offer because he probably would have wound up dead. Oh wait, oh wait, **** spoilers again. Here's my deal . It's like, you know, Game of Thrones is that sliding scale, right? Where you have your sort of list of people that you're rooting for. At the top was, um, Ned Stark, right? Th rew that the **** out the window after like, I don't know what episode, like eight. So sad about that. Uh, then you start going down to Robb. You're like,'Okay, Robb's my guy.'He's Gonzo. Basically, they, they've taken every character you love and by they, I mean, George R.R. Martin has taken",
            "start": 390.44
        },
        {
            "text": "sad about that. Uh, then you start going down to Robb. You're like,'Okay, Robb's my guy.'He's Gonzo. Basically, they, they've taken every character you love and by they, I mean, George R.R. Martin has taken every character you love and just **** destroyed them in a **** up humanized blender of, of tragedy and loss. And now we're finally ending that with, I mean, I even was rooting for Stannis at a certain point . I'm like,'Okay, well, I've gone all the way down my list to Stannis now and now I want Stannis to win because I **** hate that little, that dude that flays people's skin, the guy that made, uh, Ramsay.'Yeah, Ramsay. Well, Ramsay's the new Joffrey. Yeah, he is the new Joffrey. Yeah. Um, but now that Stannis is gone and seemingly Robb Stark's gone as well, we don't really know. Again, we didn't see either of them specifically die. Robb Stark? No, I'm sorry, not Robb. Um, Jon Snow. I mean, we saw Jon Snow die. Jon Snow is dead. Will Jon Snow come back? I think that's the other question. We'll see, we'll see. Um, and now the",
            "start": 430.76
        },
        {
            "text": "specifically die. Robb Stark? No, I'm sorry, not Robb. Um, Jon Snow. I mean, we saw Jon Snow die. Jon Snow is dead. Will Jon Snow come back? I think that's the other question. We'll see , we'll see. Um, and now the only ones that we really have to look forward to that we haven't seen all season is, uh, the kids, the younger, the brother confirmed that Jon Snow is not going to be in the, uh, what season? Me, I don't believe five. I don't believe any of confirmations they're saying right now in terms of casting and all that stuff. They're on some **** right now. They're being so sneaky-snake about ****. Not in it. He can confirm it. He said that Jon Snow will not be back. Yeah, that's what he said. Well, Jon with some different come back or whatever. There's so much **** that I'm not like, I'm just like, whatever, I'll see what happens. I'm just so sad that him and Khaleesi never met. That would have been a hot, hot. Well, that's another huge thing this season is we saw Khaleesi meet Tyrion. Yeah, which is something like awesome. This",
            "start": 471.08
        },
        {
            "text": "what happens. I'm just so sad that him and Khaleesi never met. That would have been a hot, hot. Well, that's another huge thing this season is we saw Khaleesi meet Tyrion. Yeah, which is something like awesome. This is a great duo. I love finally happened, you know? And it's like that's something, it's funny'cause I say finally happened, but it's not something I was waiting for to happen. It's not something I ever really expected to occur. Just as a side note, probably the biggest news of the whole thing is we got the guy with the beard that's having sex with Khaleesi that can't mar, marry her, but that like that, that's like the love affair, you know, the guy from Daario. Yeah, we got to see his butt a couple times. Yes, that was good, which was amazing. So it's very clear watching the show, my wife rating this season based on nudity, there's a lot of good nudity. We saw specifically then let's talk about the walk of shame that Cersei had to do, which must have been, and let's take it back. I'm, I'm not going to go perverse with this.",
            "start": 513.24
        },
        {
            "text": "there's a lot of good nudity. We saw specifically then let's talk about the walk of shame that Cersei had to do, which must have been, and let's take it back. I'm, I'm not going to go perverse with this one, but it's very, very easy to. And this is like breaking my brain not to do this, but what a crazy scene for her to have to film. I have so many to say about this scene. What, what an intense and like amazingly **** up scene that was. Like that to me, that was the best scene of the entire, uh, the entire show, like the entire season rather. All the stuff that she did and all she had to do was walk to the kingdom naked. No, she's going back Castle. She's still on trial though, so they're still going to try to come after her and get her. That was just her walk of shame until she goes on trial. Yeah, which I'm sure something's going to happen until her trial. Well, that's what's, that's the only they Frankenstein now. Yeah, which was terrific with his like purple skin like bulging out of the mask. That's all like",
            "start": 551.68
        },
        {
            "text": "sure something's going to happen until her trial. Well, that's what's, that's the only they Frankenstein now. Yeah, which was terrific with his like purple skin like bulging out of the mask. That's all like she had to do was just walk naked for all the horrible things she did. But that's, that's just to get out of the dungeon. Yeah, I still think they're going to, they're going to, they're still going to put her on trial. I'm trying to kill her probably. That's the goal. The thing was, he was like,'You have to do your penance, then you can go home, but we still have all these charges against you that we have to, we're going to come after you for again.'And didn't admit the incest with brother, did? No. And that's, and that's what they're going to, they're going to go after her for. I mean, it's pretty obvious. Everyone's got that weird cherry straw hair getting cast as the woman like,'Sh ame!'Yeah, I know. My God. And you call home and you're like,'Guys, I got cast. I'm the one that says shame. Here's awesome role. I get",
            "start": 593.84
        },
        {
            "text": "got that weird cherry straw hair getting cast as the woman like,'Shame!'Yeah, I know. My God. And you call home and you're like,'Guys, I got cast. I'm the one that says shame. Here's awesome role. I get to slap Lena Headey in the face a bunch of times and then I get to walk in, I guess, behind her as she's got this weird merkin on her bush.'That's as she's. Did you see that thing? Like that thing had to be fake, right? So she used a body double'cause she was pregnant. Really? Yeah, so that's a body double. Damn , she looked really good for being pregnant though. Who? That wasn't the question I asked, but it's okay. We'll skate around the merkin, the merkin issue. What the **** a merkin? A merkin's a, uh, it's a toupee for your vagina. Nick, ladies and gentlemen. What the hell? You just drop this as if anyone in this room should know that something like that. I don't know. You got to have a wig person. You got, you got to have a toupee person, I assume. Do wig people carry like for top and bottom? Assuming they can if you go to the right",
            "start": 626.92
        },
        {
            "text": "that something like that. I don't know. You got to have a wig person. You got, you got to have a toupee person, I assume. Do wig people carry like for top and bottom? Assuming they can if you go to the right person. I just don't know any, anyone that's got that amount of growth down there these days. Like most people get that lasered off with the exception of Kevin. Kevin, thank you for, thank you for looking at your own crotch while we're filming this, Kevin. Um, but no, taking it back up to a level that's not incredibly perverse, that scene was so amazing, right? Because it was the first time that you actually started to feel pity for Cersei. And then you were like, then she gets back into the castle and you're like,'Oh no, wait, she's going to rage kill everyone.'Yeah, she's got the Frankenstein monster and now I'm actually like, I'm rooting for two people now. My alignment has gone from rooting from for all the Starks'cause they're all dead and now one of them's blind sitting in the **** that weird castle.",
            "start": 673.44
        },
        {
            "text": "whatever the hell's going on with her. Um, the Many-Faced God made her blind for some dumb reason. Now she's the Daredevil. Um, now I'm rooting for, I'm rooting for Cersei because I want to see her kill Jonathan Pryce's character. I want to see her just wipe out all of those religious nuts. And then I'm also rooting for the White Walkers just to come in and **** clear everything out. I just want to just destroy everything. I don't know. What do you guys think of the scene where the white, with where Jon fights the White Walkers? **** awesome. My only really end of episode. Yeah, I thought it was awesome, but I started thinking, I'm like,'Wait, this does, this is breaking my brain because I could have sworn like when we've seen up until this point, we've seen all the White Walkers, they've been that blue-'",
            "start": 713.84
        },
        {
            "text": "but I started thinking, I'm like,'Wait, this does, this is breaking my brain because I could have sworn like when we've seen up until this point, we've seen all the White Walkers, they've been that blue-skinned sort of like ethereal, mysterious sort of thing.'And then in this scene, they're like, like 28 Days Later zombies. No, those are different things, right? Those are Others. There's the Others and then there's the White Walkers. Others are like zombie things. White Walkers are the blue dudes. Oh, really? So the very, no, I don't think so. Yeah, White Walkers are the zombies, then Others are the blue dudes. Oh, okay, so they're different. Yeah,'cause in the very first episode, we see the two, the people that are the, the Night's Watch. Yeah, and remember he sees the kids that are all like torn apart. He comes to them and they're like all displayed apart and like the horse is all screwed up and then he looks over and the kid's like right there. What the hell were those? Are those the Others? No, those are White Walkers .",
            "start": 752.2
        },
        {
            "text": "they're like all displayed apart and like the horse is all screwed up and then he looks over and the kid's like right there. What the hell were those? Are those the Others? No, those are White Walk ers. Those are White Walkers. Those'cause they had the eyes, yeah, the blue eyes. Yeah, so there's a difference between these two groups. The Others have like the weird wrinkly looking skin, it's white and they look like, I thought that was the King of the White Walkers. Yeah, or like at least a, are you sure they're controlled by the White? The, the Others control the White Walkers. They go like the thing they did at the end, all them stood up. Oh, okay. Well, we're going to have to get to the bottom of this, but I thought that scene was cool, but it was one of those, they're definitely different groups. I don't know who, who's what. It's really **** confusing. It's very confusing. But yeah, because also the guy that would like raised them was also the guy that put the baby with the blue eyes. Those, those are the Others.",
            "start": 798.04
        },
        {
            "text": "who's what. It's really **** confusing. It's very confusing. But yeah, because also the guy that would like raised them was also the guy that put the baby with the blue eyes. Those, those are the Others. Those are the Others, not the White Walkers. No, the White Walkers are the zombies. It's, it's not complicated, right? All right, let's, let's table this for a second. We're going to go back and fact-check this. Um, on it now. Kevin's on it right now. Uh, I thought that scene was cool, but, but again, for some reason that scene missed something for me and I don't know what it was. Me too. I watched it. I was like,'That scene should have been a little cooler than it was.'And I don't know why. I also felt the scene where, um, Khaleesi's Mount Drogon was should have been cooler. Like it just felt like, wait, sorry. I was like,'Wait, I remember the scene.'Sorry, those are after hours. No. Um, I just felt like the CGI weak as ****. I really disappointed. That's the problem. Yeah , it's HBO. They already spend 6 million an episode. It's like, but",
            "start": 831.12
        },
        {
            "text": "the scene. Sorry, those are after hours. No. Um, I just felt like the CGI weak as ****. I really disappointed. That's the problem. Yeah, it's HBO. They already spend 6 million an episode. It's like, but see, they, they've never nailed the dragons with people. That's the thing is anytime you ever see the dragon with people, I'm always thrown off where I'm like,'Oh ****, this is a TV show.'Whenever they're just flying and ****, they look great. I mean , it was a cool moment. Yeah, but it really took me out of it. No, you know, it wasn't the CG for me though that took me out of it. It was both of those moments should have been very, very powerful, but it, I think I'm just, I just have fatigue with the series at this point. Like I don't, I'm, I'm caring less and less about the, the safety of these characters. Like I don't really care if Khaleesi dies now because to me it's almost like I've seen her entire life at this point, right now. I know that's sacrilege for you. You can slap me later off camera, but I just, I'm it's so",
            "start": 876.84
        },
        {
            "text": "don't really care if Khaleesi dies now because to me it's almost like I've seen her entire life at this point, right now. I know that's sacrilege for you. You can slap me later off camera, but I just, I'm it's so convoluted and so complex and I'm just like, I just want to see some sort of resolution come to all these stories at this point. Like if she's going to lead, if she's going to be the Queen of Meereen, like be that. Just run your kingdom over there. Why do you give a **** about the Iron Throne anymore? Like why does that even matter? You've got this giant vast Mediterranean Kingdom with all these beautiful people and you want to go to this like this **** hole in King's Landing. She had to deal with the Sons of the Harpy. Yeah, but I mean she, that's what she got that dragon for. Get better using your dragon. Yeah, that's what I don't understand. Like why she doesn't just that I would chain that thing to the top of my castle so that if anyone came within a like a 3-foot radius of me, they would just get fried. Yeah .",
            "start": 919.04
        },
        {
            "text": "that's what I don't understand. Like why she doesn't just that I would chain that thing to the top of my castle so that if anyone came within a like a 3-foot radius of me, they would just get fried. Yeah, or just walk them with the chains and just be like, like a balloon, go. Yeah, Drogon, go and kill that person. Um, I, I like the end of her storyline though, or at least where we're left with her, where she's with all the, um, Dothraki people. That's like, this is the one of the first times in like a long time with her storyline that I'm like,'What are they doing with this?'Because it's been so frustrating to me where it's just like for seasons at a time, you're just like,'Okay, great, now we're just, we're stuck here, we're stuck in the city, we're stuck saving slaves.'Like all this stuff would just keep happening and happening and we can kind of just see where it's going. This is the first time I'm like,'We're back to the Dothraki.'What? Didn't expect that at all. Don't know where that's going, so that excites me . Where do",
            "start": 955.84
        },
        {
            "text": "you think that's going? Not a great place. They're going to have to save her from them'cause or they're going to like completely worship her. I don't think so'cause Drogo's gone and Drogo was the only thing, Drogo was the only person legitimizing her in their eyes. Remember like all the other, all the lieutenants of the Dothraki like did not like her, but they respected her because still the drag. Yeah, that was before though they knew. Yeah, I don't think that's going to matter so much'cause based, based on what that, the feeling of that scene, they were like,'Uh, we're not here to save you, we're here to basically ransom you.'What's that? They didn't see the dragons yet. I think she has one dragon left. The other two are chained up basement somewhere. A big difference than no dragons. Yeah, one dragon that's like, yeah, he's like a",
            "start": 999.08
        },
        {
            "text": "brat. He's like, yeah, he's like a teenager where he's like,'I guess I'll get up and clean my room. I guess I'll come save you and eat some people.'Yeah. Um, I don't know. I mean, my, my, my suspicion is that they're going to have to, um, what's his name? Uh, Tyrion and, um, Hot Hot Buns McHotton. Who are the guys that? Daario. Daario. They have to, uh, they're gonna have to go save Tyrion. Didn't go. Not Ty scale. That was a weird one. I have an update with the, uh, uh, White Walkers are the scary monster dudes, the blue dudes or the zombies? Yes. No, no, the blue dudes. Okay, so Others are the zombies. Wights. That's what they're called. They're just Wights. That's what they're called. All right, so there's no such thing as the Others. That's, that's from Lost. No, Others are definitely a thing. I think the Others are from Lost, Kevin ,'cause that",
            "start": 1037.4
        },
        {
            "text": "was the other group on the island. But thank you for, you know, both are convoluted at this point. For all I know, they're the same damn universe. I know. So just to clarify for everyone that couldn't hear Kevin, the White Walkers are the guys with the blue skin that, that touch people like make them white and they can resurrect the dead. The Wights. Is that what you're saying to me, Kevin? The Wights are the, are the zombies. No, I trust you. I see, I see on Wiki. Thank you for looking that up. I just want to go on record of saying Kevin is the one that told me to call them the Wights. Okay, well, who the **** are the Others? Whatever, we'll get to that later. So what other Wight, spelled W-I-G-H-T, by the way. I'm going to call them the Wights. My good Lord. Sounds some, somewhat racist. I don't know why. I see, I disagree with",
            "start": 1087.04
        },
        {
            "text": "you that I think the end of Season, of Episode 8, the, uh, look through his picture, the big ass like war with the Night King, that was **** baller. I like a lot. I thought it was really cool, but again, it's one of those things where like, I, I just got fatigued. Nothing has that impact like it had when like they cut Ned Stark's head off anymore. I get that that girl. Yeah, okay, so Sansa's whole storyline , I have a lot of issues with. Like I, I feel like character redemption arcs are a big thing in Game of Thrones. Like we saw it with Jaime where we went from **** hating that son of a **** to actually caring about him and now it's like we don't even remember that we hated him at some point. And it, it took like that one season scene in Season 4 after Joffrey died between him and Cersei to make us go ,'Oh yeah,'",
            "start": 1128.8
        },
        {
            "text": "him and now it's like we don't even remember that we hated him at some point. And it, it took like that one season scene in Season 4 after Joffrey died between him and Cersei to make us go,'Oh yeah, Jaime isn't a good dude.'Yeah, when he was like, like when he basically raped her. Yeah, exactly. And it's just like that's, that was like the, the first time that we weren't in love with him in a long time. And I feel like we saw that with Stannis where it's like they tried making us like a character that we hated. Mhm . And then Theon, we've hated that **** for seasons at this point, right? And then he got tortured and we started to feel bad for him because he was tortured, you know? But did you? I mean, that's the thing though, it's like a, it's whatever. But I mean, you at the end of the day, it's like, it's been, he's been tortured for so long . That was another one of those storylines that's like anytime I cut to him, it's like,'God damn it, do we need to see another torture scene? Do we need to see another thing?'",
            "start": 1173.92
        },
        {
            "text": "he's been tortured for so long. That was another one of those storylines that's like anytime I cut to him, it's like,'God damn it, do we need to see another torture scene? Do we need to see another thing like this?'And then going back to, to Sansa last season, like we, she's been such a like one of those characters you don't like for so long. And then at the end of Season 4, all of a sudden she like puts on a black dress and dyes her hair and she's this different character. And I thought that was a really weird character development because it just, where the hell did that come from? There wasn't enough of a transition. It just kind of happened. And then the first half of this season, she was, you know, freaking, she knew what was up and her and Littlefinger was scheming and stuff. Then all of a sudden she gets sent off to Winterfell, a bad situation. You think she's going like maybe not it, but at least kind like do something, figure out how to navigate this new character and then doesn't like start, start",
            "start": 1218.84
        },
        {
            "text": "gets sent off to Winterfell, a bad situation. You think she's going like maybe not it, but at least kind like do something, figure out how to navigate this new character and then doesn't like start, start trying to. And that's , and that's the thing for me is like one of the, one of the most powerful things about the series, and I said this before, I'll say again, is that you all the characters start, you, you , they live long enough to see themselves become sort of the villain, right? Like you all, there, there are the two types of characters. They're the innocent sort of, uh, uh, Stark-ish characters and then there's the Tywin character, which is the older like,'I've been through all this, I survived it and now I have to be this way because that's the only way you can survive. It's just being ruthless and a tyrant,'basically, right? And so your assumption is we're going to see Cersei, who is that character that starts with the innocence, eventually evolve into that Tywin Lannister character, right? Because she",
            "start": 1256.04
        },
        {
            "text": "has to. She has to do all of this horrible **** just to survive that she'll be so hardened and so ruthless by the time she reaches her mother's age that she will then be the tyrant or the, or at least the powerful like well-balanced person that can navigate these the sharky waters, right? So when she gets into the situation, you're like,'Okay, cool, she's going to do something that's gonna get her out of this like I'm a deer stuck in the headlights, uh, uh, sort of vibe.'And she doesn't. And also why the hell would she go there in the first place? I'd be like,'No, I'm not going anywhere near this. These people killed my parents.'Like why would you even put me here? Doesn't make any sense. But she's still this sort of like, um, this sort of victim constantly over and over and over again until the very, very end of",
            "start": 1297.92
        },
        {
            "text": "the series. Well, are you talking about Sansa? Yeah, yeah, yeah. So that's the thing is like she's been, been the victim and been like, you know, kind of not a pleasant character for so long. Then has this moment of,'All right, now she's this new character that we're supposed to like actually start respecting.'And then the, the scene where she gets raped, it's like this season, I obviously rape is bad. Like none of that is a question. That was a hard episode to watch. Rape being used as a, a plot point of character development, like you need to be smart about that. Like there needs to be a real reason and I didn't like how in that episode it was used not to further her character development. If anything, it like brought her back hella because she was no longer the strong character. It was also then used just to make",
            "start": 1336.8
        },
        {
            "text": "Ramsay more evil, which we didn't need because he's **** evil. We get it. That was unquestioned though, whether or not he would have been, he was going to be nice to her. I, that was in question to me. I thought maybe like he was going to actually be good to her because she is a name and he's not. Yeah, no, I didn't quite. Psychopath. **** crazy ****. Kept complimenting her. He was like,'Yeah, she's beautiful.'Yeah, he also complimented all the other girls before he hunted them . Yeah, that's true. But, but then my biggest issue is the fact that the whole Sansa thing, all of this development of Sansa that we finally got, got turned into Sansa's and Theon's redemption story. And like I didn't like that. I mean, no, yes and no. In a certain degree, she went through all of that and then eventually like started becoming more",
            "start": 1376.56
        },
        {
            "text": "bold, right? Like she got to a place where she, you know, was had the corkscrew and tried to get out and tried to save her or tried to put the candle in, in the, in the thing for Brienne, who's never in the right place, the right ****. Um,'Oh, I'll go kill Stannis instead.'But I guess that's why she's alive still. Yeah, probably. Um,'cause she does nothing and never accomplishes anything, unfortunately. Like literally, she hasn't accomplished anything, not one thing, anything except for not dying. That's all she's done. Killed Stannis. And the only thing she wanted really just for big deal . So God forbid she, she fulfill, she come through on that oath she took to Lady Stark to protect her two daughters. One of them was getting like severely abused up in this castle. The other one's **** blind in a monastery someplace in God",
            "start": 1424.6
        },
        {
            "text": "knows what land. What happened? Face Off, Face Off, Face Off. What a weird, that was dope as ****. But I'm like,'What you do?'That was to me the slow, that was the storyline. I was like,'H,'whenever we went to it, the Faceless Men thing was just like,'Man,'and it sounded so cool when it first. And then 10 episodes in , you're like,'God damn.'To me, Sansa, going back to Sansa, that all led to her going like,'This is my breaking point. Either I'm going to die right now or I'm going to, I'm, I'm going to live.'And she basically, and that's what you have, you have them literally jumping off of a cliff to survive, which I thought was like, that was a powerful moment for me where I'm like,'Oh, she's finally like taking her life into her own hands and doing what she needs to do.'And you don't know if they live or die. You look down. I",
            "start": 1471.6
        },
        {
            "text": "like that was a powerful moment for me where I'm like,'Oh, she's finally like taking her life into her own hands and doing what she needs to do.'And you don't know if they live or die. You look down. I mean, that's like a 5,000-foot drop to snow. I don't know how, what the plan was there. Like, I guess we'll just skate down and just make an ice like an ice cream cone on the way down. I don't know what's going on with that, but maybe her skirt went up was a parachute just like the Invincible, which I just watched yesterday. Um, so that was cool. Yeah, and then we get then, well, we get to Arya where you're like,'What?'Or am I saying that right? Arya. Arya. Yeah, where you're, uh, you're just like,'What the **** going on over here? What, what is she doing?'I was stoked though to see that Ser Meryn Trant, the man doesn't , oh no, oh yeah, that guy. That was an awesome freaking scene, right? God, what a, I feel like all of her, all of her storyline could have been condensed into three episodes max. Yeah, like all the",
            "start": 1514.56
        },
        {
            "text": "man doesn't. Oh no, oh yeah, that guy. That was an awesome freaking scene, right? God, what a, I feel like all of her, all of her storyline could have been condensed into three episodes max. Yeah, like all the things that happened with her and it would have been way more entertaining and snappy. But that is, I think, the overall problem that people have with this season is that, you know, they're running out of book space and they had to combine different things, which I'm happy they did because from what I, I haven't read the books, but from what I've read on Wikipedia about the books, I'm like,'Thank God they combined this ****. Thank God that they changed characters and like made this stuff happen,'because it's like there could have been 10,000 other new characters they introduced that I just wouldn't have given a **** about and it would have drawn it out over more seasons. It's like you keep saying that you feel like you just want resolution, whatever. It's like I feel like we are getting towards that.",
            "start": 1559.4
        },
        {
            "text": "given a **** about and it would have drawn it out over more seasons. It's like you keep saying that you feel like you just want resolution, whatever. It's like I feel like we are getting towards that. And like that's part of this is the fact that we are finally these characters are, we're being thinned out and now the new characters they're introducing, it's not so much characters as much as it's groups of people . Like we see Sons of the Harpy and we see the whole, um, the religious cults and stuff. And I like that those aren't, there's not really figures to those groups. Well, there is. I mean, you got the Jonathan Pryce character, right? He's going to be a main character probably going forward to some degree. But it's like, it's still, it's not so much about introducing every single character in these groups, it's just here's a whole new group of people that are causing issues, you know, person. I mean, I feel like at this point, I just, I'm at the same place I was with Lost right around Season 3 where I'm",
            "start": 1594.92
        },
        {
            "text": "like,'I still love this show, but I do want them to start figuring out how wrap this up.'Like it can't go on for another four seasons. It just can't. It can't. Like I'm not going to be interested beyond the sixth season. So like get me to some place where I need to be for this, the seventh season, to wrap this thing up. Just wrap it up. But I feel like that's the, the point and that's the goal. Like I, I don't feel like, I think the Lost thing isn't a fair analogy because that they didn't know where the **** they were going. This is like there, no, they did know where they were going, but then they got super successful and had to pad it out for three more seasons. Is the problem. It's not the same thing. You're right. They, they're, but the problem is they have to wait for the other books to come out and they don't.",
            "start": 1631.92
        },
        {
            "text": "that's the thing is they don't. They do because when those sections that aren't in the book happen, you start to feel like they're just padding. It doesn't have the same heart. I bet, I bet I could write down all like if you wrote all the scenes, I could probably circle the ones that aren't in the books. I bet you couldn't. Because bet I, no, because like I bet I could. That's just dude. Like again, I haven't read the books, you haven't read the books, so you can't really have this discussion. But from what I read about what's in the books on Wikipedia, it's like,'I'm happy that **** was not in this show.'They made this a show. They made this entertaining, not drawn out ****.'Cause the books are getting drawn out. The books are the thing that are just going off the **** at this point. They are hitting the same thing",
            "start": 1674.32
        },
        {
            "text": "that every HBO show does, which is that fifth season sort of like,'Okay, this is time.'Like Sopranos, same thing happened where you're like,'Huh, wow.'Like the fifth season of Sopranos was like a **** soap opera. You were like,'It's either the fifth or fourth where you're like, what's happening here? Why are all these characters suddenly turning into characters of themselves?'And then they went back to it and they finished it up. They need to drive toward an end. They need to not walk toward an end or like kind of meander. And you're, you're starting to see that a little bit where like you're like,'I don't know what we're going to do here because we're kind of stalling for time. We got to figure it out. They got to figure it out.'The only storyline that I feel like was stalling for time at all was the Dorne",
            "start": 1711.24
        },
        {
            "text": "stuff and even that I just feel like was just, I, the Dorne stuff for time. I feel like all of the stuff with a religious group is, is stalling for time. I don't need that. Like we don't need that at all. I don't know. I enjoy like the slowness of it. I like just watching the, watching the realm as a whole, right? Is just kind of nice and I like that there's all this stuff happening and I don't think that they need to rush to an end or I think they could even go on for a long time. Just get a lifetime and a lifetime of. Well, I mean, that's, that's sort of what the show's, that's sort of what the show's turning into, right? And if you want that, I just encourage everyone to go to watch Walking Dead. Like I said, we said on the podcast yesterday, that's what that show is about. That show is not about resolution. That",
            "start": 1744.88
        },
        {
            "text": "show is not about resolution. That show is not about finding a cure to the zombies. That show is about watching these characters just exist and stay alive in this world and how that, that existence and that, that, that constant strive for and that struggle for life has changed them fundamentally. And like that's a reflection of just humanity. That's a very, very powerful thing. At this point, I'm like,'All right, Cersei just wrote,'or not Cersei, uh, uh, Khaleesi just rode a dragon. Dope. Nope, dragon's down. Okay, well, I guess I'll wait till the next season to see what happens with her in the fry. I'm excited. All right, so we're going to wrap this up real quick without even getting into any debates or me screaming at Nick and saying,'Wait, what?'Rank the seasons by number off the top of your head real fast. Just the numbers, Nick. Oh, I mean, I, they to me,",
            "start": 1787.76
        },
        {
            "text": "that goes one, two, three, four, five. Really? Yeah, I mean, I, I love as far as like best to worst. Like I just, I, I, I've, I've had a consistent sort of love affair with this that's kind of been weaning as the years go on. That's Alexis. Um, I think the best season was, I think the Red Wedding season. What was that? Two, three? Yeah, so Season 3. I think 3, 1, and then 4, 5, and 2 was kind of. Yeah, see, I go, I go 4, 1, 3, 5. 4, 1, 3, 5. Huh? You thought last season was the best season? The fourth season? Fourth? Yeah, I do.'Cause I went in with no expectations for that season. That was the first time I was like after the Red Wedding, I'm like,'What are they going to do? Like there's no way they can get me back.'Instantly got me back with Joffrey's death. Like every episode after that, every single episode, I was like,",
            "start": 1824.36
        },
        {
            "text": "the Red Wedding, I'm like,'What are they going to do? Like there's no way they can get me back.'Instantly got me back with Joffrey's death. Like every episode after that, every single episode, I was like,'What's happening next week?'And then building up to the, the Oberyn stuff and all that. Yeah, I see. I think to me that, that, that season was like,'Okay, I'm going to watch this is the real season that cements the fact that I'm going to watch all these characters slowly die.'That's it. All the characters I love are just going to slowly be tortured to death. It was awesome. Ladies and gentlemen, let us know what you think of Season 5. Let us know your rankings in the comments. Until next time, I love you. I love you too. I like him and Alexis and Kevin.",
            "start": 1884.64
        }
    ]
}