{
    "id": 1330,
    "video_id": "tSg-hbJ5MKY",
    "show_name": "The GameOverGreggy Show",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Nick Scarpino",
        "Alex Aziz",
        "Colin Moriarty"
    ],
    "title": "Alex Aziz (Special Guest) - The GameOverGreggy Show Ep. 100",
    "description": "Special guest Patreon supporter Alex Aziz wants to know what we think about nostalgia, Tim Gettys brings up some of his latest favorite comic books, Greg Miller finally has fun being an adult, and Nick Scarpino defends the Watchmen movie. (Released 10.30.15)\n\nGet everything early here: http://www.patreon.com/kindafunny\n\nSubscribe! http://www.youtube.com/subscription_center?add_user=gameovergreggy\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here http://www.ORIGINPC.com.\n\n\nBuy our shirts! http://www.districtlines.com/gameovergreggy\n\nEach and every Friday, Greg Miller, Colin Moriarty, Nick Scarpino, and Tim Gettys get together to talk. Each podcaster brings a topic to the table, and then, they go. TV, space, books, movies -- anything goes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nNick - http://www.twitter.com/Nick_Scarpino\nTim - http://www.twitter.com/TimGettys",
    "published_at": 1446796800,
    "duration": 8272,
    "transcript_chunks": [
        {
            "text": "Today's episode was brought to you by Squarespace. Squarespace is the easiest way to create a beautiful website, blog, or online store for you and your ideas. Squarespace features an elegant interface, beautiful templates, and incredible 24/7 customer support. Start building your website today at squarespace.com. Enter the offer code kind of funny at checkout to get 10% off. Squarespace. Build it beautiful. I got heat. It reminds me of the days uh when my brother would just randomly show me his ball sack for no reason, which happened two weeks ago. Those days never left. What's up everybody? Welcome to the Game Over Greggy Show. I am one of your hosts, Greg Miller, alongside the man who's seen his brother's ball sack more than Bulbasaur seen Charizard, Nick Scarpina. Do they hang out in the same club? Bulbasaur. Maybe that's a question for Tim. They're in the same bowl. I heard Charizard's a full-blown racist and doesn't want to be around. Yeah. Over there. The pure one. Tim Gettys.",
            "start": 0.08
        },
        {
            "text": "the same club? Bulbasaur. Maybe that's a question for Tim. They're in the same bowl. I heard Charizard's a full-blown racist and doesn't want to be around. Yeah. Over there. The pure one. Tim Gettys. Hello. The pride of Long Island Colin Morardi. It's good to be here with you today. Come back to me when you're done with your introductions. I have something to say. Okay, good. And over here, a young gentleman named Alex Aziz. Hi. You went to patreon.com/kindfunn supported us at the level to come on this show. Thank you very much. We'll never be able to repay you. Okay. Except by having you on this show. I'm good with that. Tim, is this one going to be worth a dollar? No, this one's going to be goddamn We'll literally never be able to repay you. This one's going to be worth $100. No reason. All sales are final. Oh, they are? Yeah. Sorry about that. Yeah, you can't get out of it. I have two things to say before we get going. Nonsequators. Sure. The first thing is that last week on the",
            "start": 80.32
        },
        {
            "text": "All sales are final. Oh, they are? Yeah. Sorry about that. Yeah, you can't get out of it. I have two things to say before we get going. Nonsequators. Sure. The first thing is that last week on the podcast, yeah, I blamed Tim for bringing up Star Wars in the conversation. Got mad at him for it, but I brought it up. Now, the intention behind what I was saying at the time was that he had reiterated what we were talking about with Star Wars. And then I was saying, well, that's actually a bad example for you to bring up, but I had brought it up and it made it seem like I was yelling at Tim for something he didn't do. So, I want to apologize to Tim about that. I accept it. I saved that. I saved that all day. I save that all day for him. I wanted to apologize to him earlier, but I wanted everyone to know that. So, you just let it you let it fester for a week. Tim's walking around this brain. I took the hit. I knew I knew I was right. You did take the hit. You're right. I was like, you did",
            "start": 117.76
        },
        {
            "text": "to know that. So, you just let it you let it fester for a week. Tim's walking around this brain. I took the hit. I knew I knew I was right. You did take the hit. You're right. I was like, you did take. You're right. And I'm sorry. I didn't want to turn it into I'm extremely sorry. It was a brain fart on my part and I didn't I wasn't Elquin. I wanted everyone to know cuz I was reading the comments and I hear you. You're right. You're right. #you right. The second thing I want to say is that uh I uh was talking on the podcast last week about vampire strike. Yeah. Oh god, we haven't done a vampire strike in a long time. Uh old podcast beyond reference. Uh I was talking last week about someone in this industry telling me that uh this person wouldn't hire a person of a conservative slant. That person actually said to me that they wouldn't work for a person of a conservative slant. And for the sake of just clarity on that, even though did that person reach out and correct it? Okay. You you",
            "start": 158.56
        },
        {
            "text": "person actually said to me that they wouldn't work for a person of a conservative slant. And for the sake of just clarity on that, even though did that person reach out and correct it? Okay. You you just remembered it. Oh, I was listening to the show and I'm like and I'm like I don't think actually like I think I You didn't express it correctly. Right. Exactly. Like so I just want to make sure that you know the record's clear on that as well because it's important. Accuracy is important. Yeah. Still though little extreme. No. No. Very very extreme. Extremely outrageous. Extremely extreme someone. But I want to be accurate with what I was saying. Okay. Okay. That's it. I'm not going to say anything else. Sure. Great. Tell us Alex. Yeah. Tell us about yourself. Where you from? I'm from North Carolina. North Carolina. My favorite of the Carolinas. Yeah, it's the better one. North Carolina. Raise up. Take your shirt off. Spin it around your head like a hell. That guy is actually in jail",
            "start": 198.72
        },
        {
            "text": "Carolina. North Carolina. My favorite of the Carolinas. Yeah, it's the better one. North Carolina. Raise up. Take your shirt off. Spin it around your head like a hell. That guy is actually in jail now. Good. I can't 25 life for murder. I don't song wasn't that good. Pety Pablo. Oh, I remember. I used whenever whenever someone mentions North Carolina, I usually say that and most people don't get it. So, I'm glad you were right there with me. Yeah. Why we get along? That's why we're best friends. I was there for that. You live through Did you live through the college era? I was Nick. I don't know what the hell you're talking about right now. I was in elementary school. Some weird Midwest. Oh lord. How old are you? 23. Good. God damn it. Yes. Yes. I was in elementary school when that happened. It was non-stop. Yeah. Non quite the event. It was exciting. No one ever talks about North Carolina. Taking their shirts off. Well, it was it was one of those things. It was a rap song at the time.",
            "start": 232.88
        },
        {
            "text": "It was non-stop. Yeah. Non quite the event. It was exciting. No one ever talks about North Carolina. Taking their shirts off. Well, it was it was one of those things. It was a rap song at the time. Rap was in an interesting place with with a lot of things happening. It was one of the few songs that literally had no words except for that. Yeah. And kids could yell them and not get in trouble. Sure. So, we listen to it a lot. Got What was another PD Pablo classic? Freak leak. Was that him? I think he did. I'm trying to No, that's that's Jule. No, I'm No. No. I'm I'm the one I'm thinking of. Yeah. Pretty sure it's Freakalik. He had one He had one that was on one of the Now CDs. You remember those? Now, that's what I call music. Yeah. You don't have to remember them. They're still making Yeah, I'm aware. I'm think you're about to come up on now. That's my That's my gauge of age. I remember the infomercial, the first one when it was one and now I go one. I remember one. I definitely live",
            "start": 273.04
        },
        {
            "text": "I'm aware. I'm think you're about to come up on now. That's my That's my gauge of age. I remember the infomercial, the first one when it was one and now I go one. I remember one. I definitely live through one. I don't know if I remember it. See, again, infomercial on Nickelodeon. All I watched was Nickelodeon at the time. I remember all the Now all the way up until right now when I go on iTunes and see now 450 and Yeah. Yeah. The fact they're still doing them now doesn't make any sense. Just buy the songs you want. We're saying now too much. I do. No, they can deal with it. That's what I call music. I also to say sure sure too much. Yeah, I do. We all have I talked to someone about this on on our Neogaf thread because they point out these little parliamentes, right? And I'm like, you should try to talk for a living for 20 hours and and I'll listen to it and then we'll see I'll I'll pick out everything that you say over and over again. It's hard. It's difficult. Someone made a bingo.",
            "start": 314.72
        },
        {
            "text": "try to talk for a living for 20 hours and and I'll listen to it and then we'll see I'll I'll pick out everything that you say over and over again. It's hard. It's difficult. Someone made a bingo. We are not professional. A bingo page for us. You see that? I'm pretty professional. I'm not You keep it on your phone this entire [ __ ] time. I had text one thing to Kevin. I know. And he texted back like five minutes. I do want to have I do want to have a rule moving forward because the phone use is getting a little out of control. We're all guilty of it. So yeah. All right. So uh I know you are. I know many are. Greg Miller's not. No, you're probably maybe actually the worst of all of us. [ __ ] in a half of the table. Tom Hawkins. You're welcome to go through the last three episodes and compare. Tom Hawkins is not your slave. He is now. But I I was thinking about, you know, when some when some friends get I've been in groups of friends where we all put our cell phones in the middle of",
            "start": 356.56
        },
        {
            "text": "Tom Hawkins is not your slave. He is now. But I I was thinking about, you know, when some when some friends get I've been in groups of friends where we all put our cell phones in the middle of the table or just ignore them or whatever. We should have something to have a reach to the outside world like your iPad if we have a question. Otherwise, we should put all our phones. The only issue I don't have my phone on me right now. The issue comes down is the fact that of course Kevin is stupid and won't get on iMessage. So we I know that 9% of the messages Nick Scarpo gets is Kevin saying, \"Move closer to the mic.\" Then they start sending gifts and then they're talking about Yeah, I think Kevin's a massive distraction on the show and we all know it. He's a him not having him not having, you know, he's like a zeppelin. You just kind of stare at it for a while. You don't really know what it's up there for. You don't know what it's doing. It's kind of anti technology at this point, but it's",
            "start": 397.6
        },
        {
            "text": "he's like a zeppelin. You just kind of stare at it for a while. You don't really know what it's up there for. You don't know what it's doing. It's kind of anti technology at this point, but it's beautiful. Kevin, you have German roots, right? Proving Well, by He said it's probably Well, we were talking about this. This is not a secret. Yeah. Okay. Why would it be a secret? Some people might be ashamed of being in German. Wow. Kevin, are you ashamed of being in German? Oh, just as you brought in and Yeah. Yeah. No, I feel I see what you're saying. I see what you're saying. What are we even doing on the show? I don't know anymore. Greg's berating me for using my phone. So, I feel like he's phoneing me. What is this? I'm boneour. Bone. I went to a store I found last time I was here in San Francisco. Which one is it? Uh, I think it was called Cask. Uh, we know Casque. Yeah. Yeah. Told the guys it's their hundth episode. Give me something good. And thank you. It is the they came up they",
            "start": 430.72
        },
        {
            "text": "Francisco. Which one is it? Uh, I think it was called Cask. Uh, we know Casque. Yeah. Yeah. Told the guys it's their hundth episode. Give me something good. And thank you. It is the they came up they came up with that and uh I I had to give them a little direction. You know, I like Eagle Rare Makers and Woodford. So that that that's what they went on. Nice. Yeah. Thank you very much. So you like some weeded bourbons? Yeah. The the well makers is weeded. Uh Greg. Yeah. Eh Taylor. Good stuff. What does the H stand for? The H. The E. Oh, and his name Ernest Hemingway. A lot of people didn't know before he blew his brains out started a lucrative lucrative bourbon business. True story. Edmond Haynes. No. Like better. Yeah. If only we could all use our phones to check, but we can't. I'm staring at mine right now. New age. 100th episode. The thing is I might believe that about Ernest Hemingway. Yeah, that dude was nuts. Oh, he drank a lot, too. Yeah. I think if you just twist, bro, it'll",
            "start": 474.64
        },
        {
            "text": "at mine right now. New age. 100th episode. The thing is I might believe that about Ernest Hemingway. Yeah, that dude was nuts. Oh, he drank a lot, too. Yeah. I think if you just twist, bro, it'll come off. I don't want this. I'm going to have to take this off later anyways cuz it's going to bother me. So, understand. Who am I talking to? If you didn't know, ladies and gentlemen, this is the Game Over Greggy show. Each and every week, four, sometimes five best friends gather around this table. Each bring a random topic discussion for your amusement. If you like that, head over to patreon.com/kind of funny like Alex did. Throw us a few bucks and you get every episode early. You don't like that? No big deal. Wait until the next week, daybyday, topic by topic. YouTube.com/kindfunny. We post the show for your amusement before we put the entire thing up as one big MP3 and one big video. I will literally murder you if you did that. If you were to put your hand in my water, I It's so big. The",
            "start": 521.92
        },
        {
            "text": "show for your amusement before we put the entire thing up as one big MP3 and one big video. I will literally murder you if you did that. If you were to put your hand in my water, I It's so big. The opening to your Do you see how much I drank though? Like I need my arm in that thing. I'm really happy that you hit the the table at the right time. I think you're the first person, the first guest to hit it. I've watched the show about 99 times. Yeah, that's good. That was good. I like this kid. Yeah, cuz usually the kids that like they miss it like, \"Fuck.\" Yeah, I was preparing for they get caught up. They start listening. They think they're just here to listen to the show. We bring you and put you to work as you know. Yeah. Yeah. So, it's episode 100. Yes, it is. We're all feeling very good. Your your bourbon will make us feel better, which is 100 proof. Yeah. Good job. You're winning a lot of points with Colin over there. Give me act like you. No, I thought it was higher. I'm I'm",
            "start": 560.36
        },
        {
            "text": "good. Your your bourbon will make us feel better, which is 100 proof. Yeah. Good job. You're winning a lot of points with Colin over there. Give me act like you. No, I thought it was higher. I'm I'm fascinated by Colin right now. Everything Colin is the most fascinating human on this planet to me. He's got these lovely nuances. One of which is he is going to spend the next two hours scraping. Yeah. Do we eat the drink or use that? You can work it out through the show, you know, get the plastic off of it, you know, rubbing alcohol. Yeah. No, I'll do that later. 5 minutes. Have Kevin do it. Good. You get it back in a different bottle. Want to smell? Want to smell it? I'm good. No, you know you smell it when I drink it. You got to get that bouquet. Alex, what topic did you bring us today? So, hundth episode. Figured we all might be feeling a little nostalgic and so why don't we talk about nostalgia as an emotion? very interesting one. My favorite emotion can be very good, very bad at",
            "start": 598.84
        },
        {
            "text": "So, hundth episode. Figured we all might be feeling a little nostalgic and so why don't we talk about nostalgia as an emotion? very interesting one. My favorite emotion can be very good, very bad at other times, you know. Uh I I I thought it'd be fun to discuss some experiences. What makes you nostalgic and how you deal with it? Okay. Okay. I want you to start with the bad nostalgia. What's the bad nostalgia? The bad nostalgia. So, I just graduated from college. Sure. Having a lot of it recently when I realized there's parts of my life that are gone forever. And as much as I enjoyed them and I'm glad they're done, Nick smelled the bourbon. Sorry about that, Alex. Just go back to checking your phone. There's there's a little bit of little bit of hurt there realizing that you'll never be back to that point in your life. You know, and and when you are going through changes in life like graduating, I I recently moved to a new city. I moved to Austin from North Carolina. Definitely step",
            "start": 642.24
        },
        {
            "text": "back to that point in your life. You know, and and when you are going through changes in life like graduating, I I recently moved to a new city. I moved to Austin from North Carolina. Definitely step up. Good move. It is. It is. But I know no one there. Okay. You know, I I leap of faith. I'm meeting people there and that's all good. But I I left all my friends. Uh one of my best friends who I've known since we were in the first grade, you know. Yep. Little bit of remembering those kind of things. It it hurts a little bit, but it's also a good thing, you know. Sure. So, so those are the kind of feelings I'm talking about. So, you're like bittersweet. Very much so. Not bad. Not. Sometimes it's bad. Sometimes it's bad. Sometimes it is bad when when you realize there's some things like um interestingly enough listening to old episodes of podcast Beyond. It's like I remember exactly I was in the clock tower lounge at UNCCW pretending to do homework while really listening to Beyond. Yeah.",
            "start": 694.88
        },
        {
            "text": "enough listening to old episodes of podcast Beyond. It's like I remember exactly I was in the clock tower lounge at UNCCW pretending to do homework while really listening to Beyond. Yeah. And like oh man I wish I was that kid again. See? Okay. So well first off, cheers to 100 episodes. Cheers to your visit. Of course. There you go. You guys with your waters and your Starbucks cups. You disgust me. That's good. That is very good. Excellent. Okay. Saucy. So it's so even see I guess what's interesting for you is that you left college and then just blew it up immediately, right? So you're out of town. You're like totally away from everything, which I guess happens to a lot of people cuz like I'm nostalgic and miss college every so often. You know what I mean? But I'm an old [ __ ] man compared to you. You know what I mean? Like I when I but when I left Missouou I stayed in Colombia for a year and a half worked at the paper was still around local estions before I came out to IGN which is",
            "start": 741.12
        },
        {
            "text": "to you. You know what I mean? Like I when I but when I left Missouou I stayed in Colombia for a year and a half worked at the paper was still around local estions before I came out to IGN which is my dream job. So it was like I understand what you're saying. I see. But I don't I still feel like saying it brings up bad feelings. Well see here's the thing. College at the end of it I think all my friend group will agree with it. It overstated its welcome. Really? Yes. We we had our our senior year was uh started out great and then just spiral. It much like Do you all get jobs and girlfriends? That's usually what gets you. Yeah, it was it was it was a combination of thing there. There's some very personal stuff for other people. So I don't how many DUIs were in the group? None. Okay. Thank Thank God. My guess is it's more very close to my college which was a lot of my friends started quickly getting married which was weird. Did you ever have that? See? No. No. I had like my friends like a",
            "start": 787.92
        },
        {
            "text": "God. My guess is it's more very close to my college which was a lot of my friends started quickly getting married which was weird. Did you ever have that? See? No. No. I had like my friends like a year on it. I'm like, \"Oh, shit.\" There was a scare about this because one of our friends girlfriends was so insane and clearly it was a problem. Mhm. But it was looking like they were going to run away and get married. M so that classic that that that was the thing we all kind of had that one house we hung out in which was uh right behind school and I I lived in one of the apartments on campus and I was like walking distance so I halfway lived there because living on campus sucks and you know I was there for all of it and just watching the kind of spiral and constantly all of us saying you know like we need to leave we need to get out of here it's over it's it's gone bad like a abandoned ship. Jesus. Well, it did. You know, we we all we all had some bad nights and had to face some problems",
            "start": 829.36
        },
        {
            "text": "like we need to leave we need to get out of here it's over it's it's gone bad like a abandoned ship. Jesus. Well, it did. You know, we we all we all had some bad nights and had to face some problems about ourselves. You know, it was good for us, but was not pleasant. Yeah. We we had to take our medicine. And man, yours was heavy. My last year college was like a victory lap. It's like, a man, it's only I only got 300 more days of drinking like this and being stupid. Like, right when I graduated, I'll never have another alcoholic beverage. That was the problem, too. It was like um the the minute we all realized like maybe we shouldn't do this anymore was we we decided to do our usual get drunk, play rock band. That was our staple. We had a projector in the living room. Nice. So it was, you know, pretty epic. And then we played a couple songs. We kind of weren't feeling it. Someone says, \"Let's watch a movie. Let's watch Reququum for a Dream.\" Jesus. And at this point, I'm, you know, I",
            "start": 879.04
        },
        {
            "text": "know, pretty epic. And then we played a couple songs. We kind of weren't feeling it. Someone says, \"Let's watch a movie. Let's watch Reququum for a Dream.\" Jesus. And at this point, I'm, you know, I didn't have to be anywhere the next day. You know what I mean? setting in for the ride. I was like, \"Sure, why not?\" And then, you know, finished some beers, moved on to oldfashions. As as watching that movie, getting as drunk as they are, like their life is descending. It's just a very interesting experience of like looking at yourself while looking at them and you're just realizing, I am too drunk for this and then waking up the next day and being like, I got to slow down. Yeah. I got to change some [ __ ] Yeah. Yeah. This I cannot drink. And you know the the hangover lasted for three days so I I realized I can't drink like that anymore. I feel like that sticks with you though. I feel like that's kind of just the natural cycle of life, right? Where you experience something as new and",
            "start": 924.72
        },
        {
            "text": "so I I realized I can't drink like that anymore. I feel like that sticks with you though. I feel like that's kind of just the natural cycle of life, right? Where you experience something as new and then after four years of like burning it out as hard as humanly possible. You you wake up one day and you just have that had that epiphany. You're like, I'm becoming an adult. I don't necessarily need this experience. Which has been great. But the more and more you try to tra chase that high, so to speak, metaphorically speaking, the more and more you're like, I think I might be wasting my life a little bit. And I think maybe it's time to move on. But that's just life. But that does play. And I I hear you on the when you start letting nostalgia sort of lead your actions, that's when it can become dangerous, right? When you start thinking to yourself, \"Oh, those times were so great. Let's go back and relive them.\" That's when you run the risk of looking back and and and seeing those times",
            "start": 973.28
        },
        {
            "text": "dangerous, right? When you start thinking to yourself, \"Oh, those times were so great. Let's go back and relive them.\" That's when you run the risk of looking back and and and seeing those times for almost through a more clear lens where you're like, hm, these were just the normal shenanigans of college students and I'm beyond this. And cuz I see it all the time now. I live in the city in a in a fairly young area where a lot of college students out right when they graduate, they want to live because that's there's a lot of bars and a lot of partying happening. And I see that where I'm like, \"Oh, I remember those days.\" And now I'm seeing these two people that moved in next door to me throw parties. And it just seeing it from the outside in. We're like, remember we all used to party at like Spencer's house and we'd go crazy and like piss off the neighbors who just had a kid. I'm that neighbor now. And now I'm finally looking down going like that does not look fun. It looks You guys",
            "start": 1011.6
        },
        {
            "text": "like Spencer's house and we'd go crazy and like piss off the neighbors who just had a kid. I'm that neighbor now. And now I'm finally looking down going like that does not look fun. It looks You guys look they just look like they're just a hot mess. And not in the in the good term. I guess there's a good way to use that term, but not really. There's not really a good way. They just look like a hot mess. Accurate how you're using it. They look like they're on any number of substances and it and I'm just like, \"God, you guys got to get some sleep, man. You're going to be\" And then the next day they're always hung over and they do it again and I'm like, \"You guys are just tearing tearing your bodies apart with this stuff. It just does not look good.\" Then they're like, \"Did you see that guy next door just came back with more Taco Bell?\" Oh, no. Don't get me wrong, I have no leg to stand on. But, but that's the thing. I mean, I think you do. I would love to go back to those to those days",
            "start": 1046.56
        },
        {
            "text": "next door just came back with more Taco Bell?\" Oh, no. Don't get me wrong, I have no leg to stand on. But, but that's the thing. I mean, I think you do. I would love to go back to those to those days where I'm like especially the days for me I get nostalgic about the days when I first started IGN and met all you guys and we all not you Tim because you weren't born yet but um you know when I first when I first started there and the team was really small and everyone was kind of new and everyone was super energized about it and I moved from Southern California to Northern California everything was brand new and it was a huge chance that I took not knowing if my co-workers or anyone was going to be friendly similar to how what you're experiencing right now like you just don't know and then I met this awesome group of people that totally took me in and we had a great time together, but I can't there's no going back to that. Like, we're on to the next adventure now. And so, if I tried to",
            "start": 1081.36
        },
        {
            "text": "I met this awesome group of people that totally took me in and we had a great time together, but I can't there's no going back to that. Like, we're on to the next adventure now. And so, if I tried to recreate that, I would just be a 35-year-old man at the comic club just the comic club. Just creeping. Just creeping. You know what I mean? So, I mean, it's funny you say that because I not haven't seen much change. No, it's it's a change in the mindset, right? It's like, okay, the mindset. Sure. It's it's you go out the creep, the comic club, the you I'm always a creeper. That's all there. I'm always a creeper. You're still going to the comic club? No. No, but it's I haven't been in the comic club in seven years blocks away from where I live. So, it's So, he's not going, but he's also not not going, you know? I walk by every once in a while and every once in a while because it's the same bouncer that used to work there back in the day. He's a really nice guy. And every once he remembers",
            "start": 1115.44
        },
        {
            "text": "going, you know? I walk by every once in a while and every once in a while because it's the same bouncer that used to work there back in the day. He's a really nice guy. And every once he remembers me. So, every once in a while I I'll stop and talk to him for a second. He's like, \"You coming in?\" I'm like, \"No, no, I'm not coming in today.\" And it's different people, but the same cast of characters that are drunkenly walking up and going, \"I want to dance.\" And then he's like, it's a $10 cover. They're like, \"What? For this place? That's [ __ ] up.\" And then eventually they come back. It's a whole rigmar roll. But yeah, I don't know. I mean, the things that make me truly nostalgic are the things that from a way simpler and younger time in my in in in my life, which was my which was, you know, the year is probably 0 to 10, the '8s for me, the time when, you know, you're seeing so many different things happening culturally and you're becoming aware of those things. And those are those",
            "start": 1153.68
        },
        {
            "text": "know, the year is probably 0 to 10, the '8s for me, the time when, you know, you're seeing so many different things happening culturally and you're becoming aware of those things. And those are those are the things I look back and and and think of very very fondly. specifically given that Star Wars is coming back out and it's bringing up all like I I purposely have sort of I've had to come to terms with this thing that's happened in my brain where I'm like I I want to shut off from this because I don't know if I can be I'm a little scared of the nostalgic emotion that that he evokes a little bit like when you teared up watching the trailer and then I watch the trailer and I'm like h no it's still there that that all that defense that I've set up is just very much on the surface level everything below that is just is a kid hoping to god that this movie is as good as he remembers it or or hoping that it can evoke that feeling that emotion in me that I had the first time seeing like you",
            "start": 1187.04
        },
        {
            "text": "below that is just is a kid hoping to god that this movie is as good as he remembers it or or hoping that it can evoke that feeling that emotion in me that I had the first time seeing like you know the end of Jedi where you're like oh wow this is it and then you you're like this there's no more this is it I got to go back and watch all three of them again and again and again and then we got the Phantom Menace which thank god for that really kind of just really did did it for me you know what I mean you waited for it was building up metaclorans I got to get them all out to me Um, what am I nostalgic about? I'm nostalgic about everything. Everything. And it's it's I am a deeply deeply nostalgic person. This is something my people in my family talk about and what and why they my people in my family think I have such a deep connection to history because I just like old things and things that happened already and like being in places where old things happened to me or to other people or",
            "start": 1228.72
        },
        {
            "text": "my family think I have such a deep connection to history because I just like old things and things that happened already and like being in places where old things happened to me or to other people or wherever it is. So, it's could be a battlefield from the revolution or it could be like my grandfather's basement, but like I'm going to go down there and start tearing through old [ __ ] Like when my I'm nostalgic for places and times I didn't even experience. That's why I think the Wonder Years is so powerful. Like it may like you know you're really a sucker for nostalgia when you're nostalgic for [ __ ] you didn't even experience. It's [ __ ] that happened in the 70s 5 years before you were born. But like my nostalgia runs deep. I I it it's strange cuz it is me. So I guess it's not that strange cuz I'm a really strange person. But uh like I just lay around sometimes and just I have there's a a nostalgic switch that goes off in my head at night usually when I'm in bed and I just I well",
            "start": 1271.92
        },
        {
            "text": "cuz I'm a really strange person. But uh like I just lay around sometimes and just I have there's a a nostalgic switch that goes off in my head at night usually when I'm in bed and I just I well up a little bit in my in my my heart like my you know and I'm just like I miss these old times and I'm not even sure why I miss anything I'm talking about. Like I've had I have weird nostalgic things happening to me all the time. I just like interacting with things that have already happened or things that are old. A story I've told my friends before is when I was dating this girl in college for several years. I went to see her family in Connecticut and I went to her grandmother's house and she had this bathroom that no one ever used and I went in there and I could use the bathroom and I was going through all this old stuff and there was like all this old like shampoo and conditioner stuff from like the 80s and I was like this is so it was 2005 I remember it was a summer 2005 and a weird story.",
            "start": 1304.24
        },
        {
            "text": "all this old stuff and there was like all this old like shampoo and conditioner stuff from like the 80s and I was like this is so it was 2005 I remember it was a summer 2005 and a weird story. Yeah. And and I was like and I'm like this makes me nostalgic. This this white rain bottle that's half used Yeah. with 1987 on the back of it. I'm like, who used this? And where did this come from? And is it still good? And then I used it and it wasn't really good anymore. Like this is there's like just weird like I'm just like so literally anything can set me off. Like anything that's old can set me off. My grandfather and my grandmother died and we went through their house to on Long Island to sell it which was a mistake uh since the market was weak at the time and very strong now. Uh we uh we whatever what you're nostalgic for your bad real estate deals. Well, it's fine. cuz you know it's it's money but you know uh I remember just going through like I was there for days like t I left college",
            "start": 1338.16
        },
        {
            "text": "what you're nostalgic for your bad real estate deals. Well, it's fine. cuz you know it's it's money but you know uh I remember just going through like I was there for days like t I left college for like a week and was just there like going through tons and tons of [ __ ] old notes between my grandma and grandpa like just things like I remember there was a whole shoe box you know you know when you go to Catholic funerals you get those cards like there's a whole shoe box yeah prayer cards the whole shoe box full of them from the 50s and 60s and stuff I'm like this is just crazy nostalgic you know everything about it everything you know I think back about my childhood of course I mean that's the most nostalgic thing about watching Ninja Turtles when it was on when the episode was new. Yeah, I remember that. I was there, you know. I remember uh you know getting my first 311 album when it came out. I was there. It happened. You know, like I remember getting uh you know when when when",
            "start": 1378.52
        },
        {
            "text": "I remember that. I was there, you know. I remember uh you know getting my first 311 album when it came out. I was there. It happened. You know, like I remember getting uh you know when when when GameCube came out it it even what's crazy that I realized about nostalgia is that it never stops. Like now I look back at 2010 and I'm like man those were the days but they really weren't. To your point you know you didn't like your senior year. Junior and senior year at Nor Eastern were like the best days of my life. You know, I feel like I should jump in and say it wasn't that we didn't like it. It's just that [ __ ] hit the fan. No, I understand that. Yeah, things were unfortunate. I had some bad experiences when I was a senior, too. But I would kill to go back for one more day. You know what I mean? I would Oh, of course. You will never get those days back. Kids in college or high school going to college. Enjoy that [ __ ] time. That's all I'm saying. One kid on the Facebook group",
            "start": 1414.32
        },
        {
            "text": "what I mean? I would Oh, of course. You will never get those days back. Kids in college or high school going to college. Enjoy that [ __ ] time. That's all I'm saying. One kid on the Facebook group yesterday was talking about how he likes this girl and he's 19 and all this and and I'm like, dude, like you are not even getting started yet. you have no idea what's about to happen over the next year. So, just enjoy it. Soak it in because I I wrote I was like, I'm 31 now and I might as well be dead. And I got a bunch of thumbs up, of course, because it was it was funny. But it was I was I'm not even really being that facicious. I'm like, there comes a point in your time in time where nostalgia is always going to be better than what's ahead of you. It's like the grass is always greener kind of in 10 years, you're going to look back to when we all worked out of this bedroom. Yeah. Those were the days. And we working out of this bedroom. Oh, no. Like I like the false nostalgia. I remember",
            "start": 1452.8
        },
        {
            "text": "of in 10 years, you're going to look back to when we all worked out of this bedroom. Yeah. Those were the days. And we working out of this bedroom. Oh, no. Like I like the false nostalgia. I remember getting all sad leaving my college uh the house I shared with, you know, my best friends or whatever. And I remember leaving and shutting the door and getting teared up and being like, I'm never going to live with my best friends again. And here I am trapped in a [ __ ] godamn 20-year-old life until we get out of San Francisco. You know what I mean? For me, it's sights and it's it it sounds and it smells and it's that, you know what I mean? Like this trip, I just came back from Nashville and I got in a couple days early to go do Nashvilleian stuff that I wanted to do and didn't want to put on my friends or whatever. And so I finished uh dinner at this one point. I was going to go to the Bluebird, but I had time to kill. So I walked down to Vanderbilt's campus and was just walking around",
            "start": 1485.84
        },
        {
            "text": "my friends or whatever. And so I finished uh dinner at this one point. I was going to go to the Bluebird, but I had time to kill. So I walked down to Vanderbilt's campus and was just walking around and it's really huge, huge campus, really wooded and not a lot of light, so there's a lot of nature and like So we're going and I'm walking on this campus and I could just I stopped and just stood there and listened and I could hear crickets and bugs and I was just like I had forgotten that I I I I had forgotten this stuff existed. So, I didn't even know that I was missing it until I was there being nostalgic for it while I was in it of like, I'm going to go back to San Francisco and I'm not going to have that. And it was the same thing when we rent and rented an Airbnb when my friends from Missou got there, which is another huge trip of uh nostalgia being back with all your high school friends going to a football game or I'm college friends going to a college game. But I I you know, it was",
            "start": 1522.96
        },
        {
            "text": "got there, which is another huge trip of uh nostalgia being back with all your high school friends going to a football game or I'm college friends going to a college game. But I I you know, it was really hot in my room, so I left the window open in the morning. I It was raining. And not like the [ __ ] rain we get in San Francisco that's just like constant mist and garbage, but like a normal rain shower everybody else takes for granted and like hearing it hit trees and leaves and the grass and all the stuff. And like then there was a we went out we just sat on the porch that had like a ramshackled roof and we were barbecuing and drinking and stuff and it was hitting that and like the pitter patter of that and just like I haven't heard this in forever cuz I'm not in a building where my my my room is the roof. You know what I mean? like when you were growing up or whatever when it was a different story or in college or something to that effect and it was just like [ __ ] like these are",
            "start": 1558.32
        },
        {
            "text": "my room is the roof. You know what I mean? like when you were growing up or whatever when it was a different story or in college or something to that effect and it was just like [ __ ] like these are these are smells and sights and sounds and it took me back as far as like fifth grade outdoor ed you know what I mean like our first like real trip like you know all your kids all the kids got on like your entire class got on and went up to I don't even [ __ ] remember Wisconsin and it was like a wooded area and it was rainy the whole time and that sight that sound those like so cool. Yeah, I uh college is powerful in that way. I mean, I hadn't been back to Nor Eastern since we when we went to PAX East this year is when I went back and that was one of the most nostalgically powerful hour and a half I ever had before I met up with you guys when I just went early and walked around and everywhere I looked everywhere I looked on that campus there was a memory. Yep. you know, a bench where I",
            "start": 1593.44
        },
        {
            "text": "a half I ever had before I met up with you guys when I just went early and walked around and everywhere I looked everywhere I looked on that campus there was a memory. Yep. you know, a bench where I had a funny conversation with someone or, you know, a stairs into a freshman dorm where I broke a girl broke up with me or, you know, like all like and everywhere and I was sending pictures to my, you know, my, you know, Ramon and Chris, my my close group of friends and, uh, it was I, it was just so powerful and I think that I never really talked about it with you guys, but being at we went to Connor's, which was one of our old bars that we used to go to, and I was so I was so overwhelmed being there. I was like, I can't believe I'm back in this place, you know? I can't I walked out of this place and never came back. And it was nothing had changed at all. Nothing had changed at all. It was it was incredible. You know, that last trip I took to Missou where I was the keynote speaker at that",
            "start": 1628.24
        },
        {
            "text": "and never came back. And it was nothing had changed at all. Nothing had changed at all. It was it was incredible. You know, that last trip I took to Missou where I was the keynote speaker at that high school conference, right? Like going back there and going back there with some I've been back to Missou a lot and obviously just like you're saying, right? Like every time we're tailgating this spot, I think of these memories or if I'm in Shakespeare's or this that or the other, but to go back then and be like invited into classes to speak and still remember and still feel like I'm a kid in those classes, but have to come in with that authoritative thing that was crazy. And then the last trip I was there for, right, was the one where they had just announced that the original Shakespeare's that you know from 1976 that I went obviously was a part of or whatever for college when I it was my time is being demolished. They're building a high-rise. Shakespeare was supposed to be in the bottom",
            "start": 1664.56
        },
        {
            "text": "you know from 1976 that I went obviously was a part of or whatever for college when I it was my time is being demolished. They're building a high-rise. Shakespeare was supposed to be in the bottom floor. They're taking plank by plank. It'll look the same. Da da da. I knew that was the last time that was going to be the Shakespeare that I grew up with or my Missou experience. And I'll never forget I was at over at the Tiger Hotel there which was mind-blowing to stay in the Tiger Hotel because I'd always wanted to do that when I was there. And it was super nice. But I was staying there and I went to bed and I was I I was getting picked up at 5 for this ride to the airport and it was already midnight or whatever and I sat there and I I laid in bed for like 10 minutes and finally just got up, got dressed again, went down to the campus, stood on, you know, sat on the columns, took photos of myself on the columns, took photos of the quad and then went to Shakespeare and got like my final",
            "start": 1702.48
        },
        {
            "text": "got dressed again, went down to the campus, stood on, you know, sat on the columns, took photos of myself on the columns, took photos of the quad and then went to Shakespeare and got like my final beer at Shakespeare's, you know what I mean? Like like everybody's there is just like chilling out. I'm like having such a like experience with my cup full of beer, my plastic cup full of Boulevard wheat and was like, \"Oh my god, that's so funny.\" And and this was kind of what I was shooting for is it it it seemed like when we started talking, everyone was like, \"Oh, what do you mean bad?\" But I think we've really drilled down to the point of like this is where it is. It it starts out you remember things and they feel good, but it also it it hurts a little bit. You know, it's for me it's different cuz I feel like nostalgia completely drives my entire life. Like I feel like it's probably the most important motivation and in terms of emotions for me um specifically where I everything I do all",
            "start": 1733.52
        },
        {
            "text": "cuz I feel like nostalgia completely drives my entire life. Like I feel like it's probably the most important motivation and in terms of emotions for me um specifically where I everything I do all my interests like I haven't liked something new in like 15 years. Everything I like is just not true iterations are only like seven years old. No way. I remember seeing that in [ __ ] high school and we were like oh they're using Rhino's theme from [ __ ] ECW in this cuz we were getting laid left and right. Yes. Yes. Um, but yeah, no, things like that. Like Fast and Furious is actually a great example. Like I'm very nostalgic over that franchise specifically back with like Tokyo Drift. Like I remember the group of or even before that Too Fast Too Furious. Even before that, the first one like all those movies. Too Fast Too Furious. Yeah, exactly. But I mean I never will like the going to the theater with the group of people that I went with at that time. Like those are the same people that to",
            "start": 1771.28
        },
        {
            "text": "those movies. Too Fast Too Furious. Yeah, exactly. But I mean I never will like the going to the theater with the group of people that I went with at that time. Like those are the same people that to this day I'm like best friends with. And so it's funny cuz like I am different than you guys and that that stuff never left me. I just or I never left it. Like it's all still there for me. The things that I'm nostalgic about Kevin, I'm nostalgic about Kevin. Like there's not a a day that goes by where there's not something where that a conversation we have reminds me of conversations we've had, you know? Or like when we go to Gordo's burrito takaria to get burritos, like that is the place that I'm nostalgic over. So like the taste of that burrito, that is my childhood. That is all of that stuff. And a lot of it has to do with me not leaving San Francisco. But also recently I moved in with my best friend Curran and we grew up playing Smash Bros. and the last couple weeks maybe like one out",
            "start": 1817.92
        },
        {
            "text": "And a lot of it has to do with me not leaving San Francisco. But also recently I moved in with my best friend Curran and we grew up playing Smash Bros. and the last couple weeks maybe like one out of every three nights he'll just come over to my room be like yo couple matches and we just start playing and I'm just like it might as well be Smash 64 you know and even more than that stuff there's just like you know the movies that come out like the Transformers movies or the um now there's a new Power Ranger movie that's coming out or like all the things that would get me excited. Digimon is coming back as a sequel series to the originals that like I grew up with. It's like all that stuff is the things that make me excited and for no reason really. Disneyland. Disneyland's a perfect example. Why do I love Disneyland? The entire thing is this fabricated experience to make you believe the the most intense emotions possible of your memories of what you loved. You know, it's like, all right,",
            "start": 1856.72
        },
        {
            "text": "Why do I love Disneyland? The entire thing is this fabricated experience to make you believe the the most intense emotions possible of your memories of what you loved. You know, it's like, all right, let's take all those movies that you loved when you were a kid, play the music really loudly and have [ __ ] light shows and fireworks everywhere. It's like to me sound like you were saying sounds and smells and all that stuff. That is really what kind of defines the emotions is those memories and the places of being sure being somewhere, but I think it's crazy that we have like what Colin saw about, we have nostalgia for places we've never been, you know, like Disneyland's an example of like it brings you into these worlds that you never were in, but like you feel like you're you're part of it. you know, seeing the Star Wars trailers, hearing the music, it's like you feel like you're home. Yeah. But you still have a touchstone to when you initially viewed those things. And I think that's",
            "start": 1900.24
        },
        {
            "text": "you know, seeing the Star Wars trailers, hearing the music, it's like you feel like you're home. Yeah. But you still have a touchstone to when you initially viewed those things. And I think that's the importance of nostalgia. And that's why that emotion is so intense was because it kind of reminds you that your life on this planet has an end date, you know, and that every time you look back, you're like, I'm actually really far away from my childhood. And those are those were very very important years for me. And you sort of you relive them, but it's always bittersweet because you're like, I can't I'll never get that time back. And part of me actually is just a little disappointed that I didn't [ __ ] like just enjoy like to to Colin's point like enjoy it while it was happening because you're like this is just my life. I guess that's where I differ from you guys. That's what I'm saying is like I don't think it's so bitter. I feel like I'm it that stuff makes me happy and it's like I",
            "start": 1939.92
        },
        {
            "text": "like this is just my life. I guess that's where I differ from you guys. That's what I'm saying is like I don't think it's so bitter. I feel like I'm it that stuff makes me happy and it's like I feel like I'm I I get excited about things. I get really excited about things. Still get excited about things. There's plenty of things from my childhood that I still love. It's just when I think back on Harry Potter for instance, which was which not even my childhood that's like I mean I'm in my 20s at this point or maybe yeah grown ass man. But I look at that and I'm like that was just a moment in my life where something was very very important to me and it happened to be over a long period of time but it ended and so I didn't realize it at the time how important it was until it was done. You took it for granted. Yeah. took it for granted and you know now that and there's just no going back to that and I think that's the basis of nostalgia that it teaches you to really kind of appreciate what",
            "start": 1977.68
        },
        {
            "text": "it for granted. Yeah. took it for granted and you know now that and there's just no going back to that and I think that's the basis of nostalgia that it teaches you to really kind of appreciate what you have right now because you know 10 years from now you're look back at this room at the situation and go [ __ ] we yeah it was a really good time in our lives and that's and I I think it goes back to the point that some nostalgia is negative or I think even nostalgia could have always a negative or usually a negative connotation in the sense that it's at least for me where it's never 100% positive. It's always there is always a little bit of a negative kind of slant to it in the sense that man, it was better then than it is now. I wish I could do I wish but I mean that's that's not that I always look at something like that, but I think about the house I grew up in on Long Island that we don't own anymore as big, you know, colonial house with a beautiful ingground pool and stuff like",
            "start": 2013.52
        },
        {
            "text": "I always look at something like that, but I think about the house I grew up in on Long Island that we don't own anymore as big, you know, colonial house with a beautiful ingground pool and stuff like that and I'm like, man, I wish I just enjoyed it more when I had it. You don't realize what you have until it's not there anymore. And I think so it's it's it's positive memories and then it's it's sad or lukewarm memories or it's it's it's it it makes a little it makes me a little lethargic and [ __ ] sometimes when I think about it because I really do live in the past in my head. I do. The books I read are in the past. The music I read or music I listen to is often older and brings me back to a place you know I'm addicted to the sports that I grew up you know really enjoying and remember those days those glory days. I'm a huge Islanders fan. The Islanders won four Stanley Cups in a row before I was born. But I talk about them as if I was there but I wasn't you know and so there is",
            "start": 2049.76
        },
        {
            "text": "those days those glory days. I'm a huge Islanders fan. The Islanders won four Stanley Cups in a row before I was born. But I talk about them as if I was there but I wasn't you know and so there is something about nostalgia that I think is inherently not for everyone or not in every situation but there is inherently a negative connotation to it in the sense that it's like man those were the days but isn't today supposed to be the day that's why I always wonder it's like everyone's like no regrets I live with no regrets I have no regrets and I'm like how is that possible how is it possible I have [ __ ] every day I have a regret there I don't think there's a day I go through my life where I don't regret something and that also is a there's an element of nostalgia to that too if you felt like you were living perfectly dayto-day you would never think But the strange thing is you wouldn't give any of it up for the world. You know, even one of every single one of those memories that you",
            "start": 2084.88
        },
        {
            "text": "like you were living perfectly dayto-day you would never think But the strange thing is you wouldn't give any of it up for the world. You know, even one of every single one of those memories that you think you should have lived it more at the time or anything. It's only good because you did exactly what you did. Yeah. Yeah. That's what I That's the strange thing about it, you know. It's it's a very complicated emotion. Uh a friend of mine in typical college fashion told me this unsighted and it stuck with me whether it's true or not. He said the root of the word means the pain from a past wound. I think that's true. And it it it kind of is, you know, it's See, I think that's I mean, yeah, I I get it. I just I I when I think back and I talk about like, oh, I miss these bugs. I miss I miss these I miss I was a huge bug enthusiast. I was called bugs growing up cuz I was cute as a bug's ear. Were you really? Yeah. It wasn't until I went to school and had to write my name that I understood",
            "start": 2117.2
        },
        {
            "text": "I miss I was a huge bug enthusiast. I was called bugs growing up cuz I was cute as a bug's ear. Were you really? Yeah. It wasn't until I went to school and had to write my name that I understood Gregory was like, it's just like it's like peeling back an onion. You know what I mean? There's just so many layers to this [ __ ] up onion ever. Yeah, it's so beautiful. Bugs is the kid. Bugs is a kid. Yeah, I I don't know how I didn't know that. You did. You How did you not know that? We're 100 episodes into the show. That was mentioned at least 25 of those episodes. How many that you were called the bugs? I've never heard that. I've never heard that either. I've never heard that either. Where's the bugs? Say it's me. Not only have we done 100 episodes of this show, Greg and I did like 300 episodes of podcast beyond and I've lived together with him for 5 years. So, uh I feel like I should know that. Yeah. But I don't I'm writing this down. Yeah, please have to. I understand what we're",
            "start": 2160.72
        },
        {
            "text": "episodes of podcast beyond and I've lived together with him for 5 years. So, uh I feel like I should know that. Yeah. But I don't I'm writing this down. Yeah, please have to. I understand what we're saying. I think it's the longing for what was, but I don't I don't think of it I'm with Tim. I don't think of it in a negative way or like Yeah. Like like when I say like I I have no regrets or whatever. I mean like what we're talking it's the same conversation we're having now where it's like every choice has gotten me here. That's what I used to I always tell my friends, right? When they'll talk to me about stuff that I don't regret anything. So getting back in this Wait, I look it up on the iPad. Oh, okay. Okay. I was going to say I want I want to know cuz I I do remember the the root of nostalgia, the Latin root of it being I I something negative. I don't remember. I feel like I might have heard it at the same time as you guys talked about it on a show because something else I wanted",
            "start": 2197.68
        },
        {
            "text": "the Latin root of it being I I something negative. I don't remember. I feel like I might have heard it at the same time as you guys talked about it on a show because something else I wanted to bring up. You have ridiculously it's uncanny the timing the topics you guys talk about how they would happen in my life. It's funny that a lot of people say that stuff and that's cool. I mean I think that just shows that we just have conversations that everyone else has. So, it's like when we're having them, someone else is having it today. What's What's really interesting is that you wrote or you told me on Skype you wanted to do nostalgia as your topic and I was like, \"Hey.\" I was like, \"All right, cool.\" And then I was like, \"What's everybody's topic today?\" And Colin goes, \"I'd like to talk about nostalgia.\" So, you want to talk about you want to talk about uncanny. All right. So, the orig well the the the definition is a noun, a sentimental longing or wisful attraction or affection rather",
            "start": 2228.96
        },
        {
            "text": "nostalgia.\" So, you want to talk about you want to talk about uncanny. All right. So, the orig well the the the definition is a noun, a sentimental longing or wisful attraction or affection rather for the past, typically for a period or place with happy personal associations, something done or presented in order to evoke feelings, nostalgia. The origin is Greek nosto return home and Greek algos pain. Return home pain. Uh the German the German German for nostalgia is hemmo which is homesickness. Sounds like they should have just named gone home nostalgia then. And then when nostalgia entered English lexicon from the German in the late 18th century, it meant acute homesickness. So there is a negative connotation. It's become positive over time. Okay. Interesting. Just a very interesting emotion. It is. It is a fascinating emotion. I can I can relate. I because I did want to talk about it today which is so weird. Um, it really does dictate my life, but not always in a positive way. I'm",
            "start": 2267.76
        },
        {
            "text": "It is. It is a fascinating emotion. I can I can relate. I because I did want to talk about it today which is so weird. Um, it really does dictate my life, but not always in a positive way. I'm really in my mind. I mean, you guys know me very well. I'm I'm often in my mind. And I do think that my the power of nostalgia compelled me at a very early age to love history and to love old things. What? Yeah. No, you said that the way you said it, me and Tim really jumped the exorcist. The power the power of nostalgia. I got to uh so the house that I grew up in from the first 18 years of my life which is like 10 blocks that way. Um recently we saw was on sale for like $1.2 million just the top floor. We used to have the whole house. Yeah. Um and I was like me and my friend was like holy [ __ ] Like we need to Well, that was option one. We're like can we buy this? We can't buy this. Um if you support us on Patreon we just need another $100,000. really trying like we were looking into that but",
            "start": 2304.88
        },
        {
            "text": "we need to Well, that was option one. We're like can we buy this? We can't buy this. Um if you support us on Patreon we just need another $100,000. really trying like we were looking into that but then it was like oh there's an open house we should go check it out and it's crazy cuz I haven't been in that house in at this point almost 10 years and the outside they they repainted it was blue it was a beautiful blue now it's some like puke green it's like guys what are you doing u but I haven't seen the inside of it the inside of it like it was never that that great I mean the space was great but like the the rooms were kind of like shitty and stuff it was totally renovated and so it was like the weirdest thing where it's so familiar and so different. Like certain there was a room that was just gone because they bulldozed down the wall to make like the kitchen bigger, but then the kitchen was like gorgeous. And I'm like, \"This is [ __ ] nuts.\" And everything was new, but it still felt",
            "start": 2346.24
        },
        {
            "text": "just gone because they bulldozed down the wall to make like the kitchen bigger, but then the kitchen was like gorgeous. And I'm like, \"This is [ __ ] nuts.\" And everything was new, but it still felt so familiar. And the weirdest thing was that it felt so small. Huge house. Yep. [ __ ] giant house, but it felt small because you adult there. Yeah. And uh it was just that was nuts. But then the craziest thing is it was so renovated and so nice, but then I'd look down and there was still like little scratch marks on the the like near the ground and I was like, \"Oh my god, that's from the TV cart that we would bump into the wall that had my [ __ ] Super Nintendo on it on the [ __ ] CRT TV and it would just keep [ __ ] hitting the thing and there's marks there and it's like no one will ever know that shit.\" But I saw I took pictures of all of it. I'm just like and I showed what's crazy is like it was zoomed in and I showed a couple of my friends. They instantly knew. They're like, \"Oh",
            "start": 2388.16
        },
        {
            "text": "know that shit.\" But I saw I took pictures of all of it. I'm just like and I showed what's crazy is like it was zoomed in and I showed a couple of my friends. They instantly knew. They're like, \"Oh shit.\" I'm like a TV card. That's crazy. Well, that's the power of nostalgia because it I have the the opposite situation where that that that colonial house I grew up in I went back and visited my friend and um uh he knew the guy that lived there and we were at some sort of like block party and he's like you want to check out the house and I was like all right. So I like I walked in or whatever and they were like ripping down the wallpaper and and the carpets up and stuff like that and I'm like I don't want to be in here and I'm like I can't be in killing it. Um because you know to the to the weird to the weird point of well for what you're talking about the scratch marks when we moved out of that house we all went into the the attic and all wrote our names like but on the back of beams so",
            "start": 2428.72
        },
        {
            "text": "to the weird point of well for what you're talking about the scratch marks when we moved out of that house we all went into the the attic and all wrote our names like but on the back of beams so like you wouldn't even know they were there unless you were like in the corner then faced outward and I always wondered if like no one's ever seen those. Yeah. I think I hid a note in our old house in the closet. Same thing. Yeah. And I used to do that in every dorm room I lived in at Nor Eastern. I'd like the note say I'm still here. The ghosts will get you. In every dorm room in Nor Eastern I' I'd get my chair and write on the top of the door. So like where the door like the top of it I would write like my my initials and the date or whatever when I was there and I'm like no one will ever see this until these doors come down when they renovate this building in 25 years or whatever. But um you know there's just something powerful about the simplicity of nostalgia too. Those same guys that I",
            "start": 2463.36
        },
        {
            "text": "until these doors come down when they renovate this building in 25 years or whatever. But um you know there's just something powerful about the simplicity of nostalgia too. Those same guys that I was mentioning when I went to that person's house I went and visited them in college. They're brothers and they were good friends of mine when I was growing up. And I hadn't been in their house in years, many years. Like I moved to 97. This was 2006. So I hadn't been in their house in like 10 years. Um, and I walked around like everything was the same. That the I remember talking to his mom and she was like show me around like everything's the same. The stove's the same. The sink's the same. The fixtures are the same. And then like what did we do? Like we were a little older so we got [ __ ] up. And then we like played our favorite board game which is that game Solar Quest that I love. And then we went out drunkenly at like 2 in the morning and played whiffle ball then like we used to. And",
            "start": 2494.64
        },
        {
            "text": "And then we like played our favorite board game which is that game Solar Quest that I love. And then we went out drunkenly at like 2 in the morning and played whiffle ball then like we used to. And then like we woke up the next morning, went out into the into the street and played hockey for a little while. So like we're grown ass men and and it was so simple. My my dad came and like picked me up like he would you know back in the day cuz that you know I was home from college and he's like how was it and I'm like it was awesome we didn't do any like he's like what did you do expect I'm like we played whiffle ball and he's like really and I'm like yeah just like the old days and that whiz of the ball and that ball hitting that fence that same [ __ ] fence that was there when I was in the late 80s you know same one that see that [ __ ] insane yeah and I'm like that's and I'm like that it was one of the most simple yet powerful experiences I had ever had in my life. I will never forget",
            "start": 2526.96
        },
        {
            "text": "late 80s you know same one that see that [ __ ] insane yeah and I'm like that's and I'm like that it was one of the most simple yet powerful experiences I had ever had in my life. I will never forget that day. You talking about the the whiffle ball sound reminds me of like there's a from my old house there's a 7-Eleven that was two blocks away and that was like the walk like no matter how old I was me and my friends were walking up and down the thing or skateboarding or scootering or whatever and being on a skateboard or a scooter and going down the hill like the the sounds of the sidewalk the whatever it was so specific and it's only that to that two blocks and if when I hear it I'm like I know that it's that two blocks. Yeah. And that's really [ __ ] crazy that these dumb little things or like when you just looked at this house, it was totally renovated, but some of the doorork knobs were the same doorork knobs they used to be. Who the [ __ ] cares? Like no one should care about",
            "start": 2558.88
        },
        {
            "text": "or like when you just looked at this house, it was totally renovated, but some of the doorork knobs were the same doorork knobs they used to be. Who the [ __ ] cares? Like no one should care about that. That shouldn't be something that makes anyone go, \"Oh shit.\" But my friend looked at it and goes, \"Dude, it's the same doorork knobs.\" And like I got super excited and it's like why? And I looked at it. I'm like, \"Man, like I remember those doorork knobs.\" But it's like if you would ask me out [ __ ] doororknobs, I don't know. But everything you spent so much time there all meant so. Yeah. in 101 15 years we're not I we could but we're not going to remember those doors. But that's what I'm saying is maybe we will cuz I would remember the lock I broke right when I had cancer and got all mad and slammed the door and broke the lock. Yeah, I'm sure you will. You'll never let me live down any of my mistakes. No, never. Yeah, I've noticed. Be better. The avocados were mine. The avocados were",
            "start": 2597.2
        },
        {
            "text": "and slammed the door and broke the lock. Yeah, I'm sure you will. You'll never let me live down any of my mistakes. No, never. Yeah, I've noticed. Be better. The avocados were mine. The avocados were mine. Mhm. Yeah. Keep telling yourself that they were You don't You're [ __ ] counting your Georgina in the [ __ ] bedroom. We need to leave so you guys can work this out. No, we do this publicly. Don't worry. Okay, everyone knows he's wrong. Can I not be in the crossfire? No, you got it. You're the guest. You have to be the bubble. You got to roll through. We'll talk later. [ __ ] but I'm looking forward to being nostalgic about this later. Wobble. I hope you throw some more stickers. That did happen. Stickers can put on the things. Well, the avocados maybe. Maybe that's the avocado. It was just little little G's and little C's and you guys can put little stickers on your stuff and put them in different bowls. You're thinking about it now, aren't you? I wouldn't want that at all. I just",
            "start": 2631.44
        },
        {
            "text": "just little little G's and little C's and you guys can put little stickers on your stuff and put them in different bowls. You're thinking about it now, aren't you? I wouldn't want that at all. I just want Greg to remember that I bought two avocados and he ate them. This is one of those rare instances that I know everyone in the room, you you'll know by the end of the day, but everyone in the room knows when Colin is wrong, but he won't admit that he's wrong. He's wrong about the two avocados. We only bought two and we hadn't eaten them yet. We gone shopping two days before. Grandma Georgina did not eat any. Mhm. Mhm. The turkey was my mistake, and I apologize for that. But let's end it on this note. Be good. Let's end it on this note. Be better. But let's end it But let's end it on a Let's end it on a on a on a on a better note. None of you can ever say that you obsessed over a half empty bottle of White Rain shampoo from 1987 in your girlfriend's bathroom in 2005. In your",
            "start": 2668.4
        },
        {
            "text": "on a Let's end it on a on a on a on a better note. None of you can ever say that you obsessed over a half empty bottle of White Rain shampoo from 1987 in your girlfriend's bathroom in 2005. In your girlfriend's grandma's spare bedroom bathroom in 2005. So just know the power of nostalgia goes far deeper than you might even expect. The real conundrum of this whole topic has been that we've all said that when you look back 10 years, you're like, \"Oh, those were the days, you know, I wish I I did give it all up for one more day.\" Which means even now we need to we need to live that way because in 10 years we'll look back and listen we're all mad at Kevin about something doing something done. I got this guy not able to count out [ __ ] avocados and I want to kill him. I should stop wanting to feel those emotions but he brings them out in me. We should just let it go. But but that's the fun of it. But but that's the point too and that's the power of nostalgia to me is that I don't ever",
            "start": 2705.68
        },
        {
            "text": "to feel those emotions but he brings them out in me. We should just let it go. But but that's the fun of it. But but that's the point too and that's the power of nostalgia to me is that I don't ever I've never gone through my life in the moment and been like I'm not living right because I don't think that I've not gone an extended period of time not living right. Sure you're a little depressed sometimes. sure you should have gone to that party instead of staying home, whatever. But generally like it's all it's really all facade. That's the point that like that's the and I think that's why nostalgia is an inherently negative thing sometimes because it's just like everything was always better and it wasn't. And if we can go back to those days and live a week when you were a little what was it? Bubs. Bugs. Bugs. You might you might be like this sucks. Cute ear. What the [ __ ] does that mean? Let's not [ __ ] act like cute as a bug's ear makes so much down this path. I I have to jump in",
            "start": 2742.24
        },
        {
            "text": "it? Bubs. Bugs. Bugs. You might you might be like this sucks. Cute ear. What the [ __ ] does that mean? Let's not [ __ ] act like cute as a bug's ear makes so much down this path. I I have to jump in and defend him. That is a thing. I I've I've heard that one. No, just this is like Colin's [ __ ] with the [ __ ] Halloween Eve. Just because real or wrong doesn't mean Hey, but we're in different regions of the country, so that counts. Yeah. I've heard that one. Halloween thing. No, that that's just an excuse to go throw things at Okay. You know what? I'm not going to incriminate myself. Yeah. No, my my my mom and my aunt are watching. No, I didn't do it. You can prove it. Alex didn't do anything. Mom, don't worry about it. You'll never find the fireworks. Nice. That was a great topic. Thank you. You're a natural at this. Do you podcast a lot? No. Okay. You should. You should think about it. I know. Well, one of my friends is moving to Austin. We'll see what happens. There you go. Done.",
            "start": 2773.76
        },
        {
            "text": "you. You're a natural at this. Do you podcast a lot? No. Okay. You should. You should think about it. I know. Well, one of my friends is moving to Austin. We'll see what happens. There you go. Done. That's it. Also, there's these guys at Rooster. They always do podcast. You should go over there and ask if you can podcast them. Just knock on the door. They'll love that. I don't know. I've never really heard of them. Yeah. Yeah. Fair. Nobody. They're not that big. Of course, that topic was brought to you by Alex, but I do need to shove in a plug here as always. We'll say it's also brought to you by kind of funny.com/store. If you're listening to this on the Friday, the full episode goes live or the Monday or the Tuesday beforehand. It's t-shirt Tuesday, November 3rd. New brand new t-shirt up. Do we know what it is? Can you tell what it is? We have an inkling, but we're not allowed to. I'm not at liberty to say just yet. Good. Good. Well, there's a t-shirt Tuesday with a with a exclusive",
            "start": 2822.56
        },
        {
            "text": "Do we know what it is? Can you tell what it is? We have an inkling, but we're not allowed to. I'm not at liberty to say just yet. Good. Good. Well, there's a t-shirt Tuesday with a with a exclusive shirt then. If it's after Tuesday, just go to kind of funny.com/store, see what we have up. We have cups and stickers and just the PS I love you shirts shipped. I did. Yeah. And the garbage truck on fire. People are super stoked in them. The garbage truck on fire. We need that as a Twitch emote. Oh, that's easy. We can make that happen. Sure. I I need to be able to use that. Okay, that's a good that's a good point. Send it to me and I'll get it broken up. Uh I will. Also would like it as an emoji just in general. Yeah. Yeah. Emojis need to step the game up. They they did recently, but that's how I feel about many of my conversations with my friends. Yeah. Okay, Tim. Yes. What's your topic? My topic is comic books. We've talked about we talked about comics a lot on the Game Over Gregy show,",
            "start": 2857.12
        },
        {
            "text": "I feel about many of my conversations with my friends. Yeah. Okay, Tim. Yes. What's your topic? My topic is comic books. We've talked about we talked about comics a lot on the Game Over Gregy show, seeing as it's episode 100. I feel like, you know, we can bring some [ __ ] back and make some things happen. Um, what I want to talk about is what we're reading now and to kind of maybe pitch each other on some stuff specifically because I just finished one that I thought was excellent. Okay. That I want I want to at least talk to Colin about. I pitched him on a little bit, but I want to now that I've actually read it and can confirm it's amazing. I want to pitch him before we we embark on this. Can I can I just relay a little conversation Colin and all of us had about yesterday? Sure. Where he was like, and I quote, \"You [ __ ] need to be way what was the terminology? It's about movies.\" Yeah. He was like, \"You guys need to be a way more insistent on the movies that that I should see.\"",
            "start": 2892.24
        },
        {
            "text": "he was like, and I quote, \"You [ __ ] need to be way what was the terminology? It's about movies.\" Yeah. He was like, \"You guys need to be a way more insistent on the movies that that I should see.\" When you think I should see a movie, you guys need to insist on it. Yeah. Apparent. Yeah. Cuz you we we you watched uh Xmachina and then you also you also cited Gravity. Interstellar Interstellar. these another great film. People have told you these were good movies, but they didn't tell you enough these were Colin movies. You didn't say you need to watch this movie. I need I need people to identify things as Colin movies. There's nothing wrong with the right terminology because my fear Yeah. It's great. That's great. Okay. My fear with it is that I'm like Colin, you have to do this. And the second I use that term, you're like this. I don't have to do Exactly. No, that'll be exactly what happens. Oh, I have to do it. I'll never do it. Never do it. Middle Gear Solid 5. No. What else came",
            "start": 2931.6
        },
        {
            "text": "second I use that term, you're like this. I don't have to do Exactly. No, that'll be exactly what happens. Oh, I have to do it. I'll never do it. Never do it. Middle Gear Solid 5. No. What else came What movie do I need to see? What else came out on that day? Alvin and the Chipmunks 4. That's a better movie. That's a movie of the century. You guys are That's such [ __ ] cuz I'm really not a contrarian like that. I'm really not. I'm just teasing. And I don't Yeah, the Metal Gear thing was a reaction to our audience being mean to me, not you guys. They're just giving you trouble, little guy. It's okay. But insist on insist on it, you know? Yeah, Interstellar. It's a good movie, Colin. That that's that's fine. That's really interesting. I feel like we've had podcasts trying to get you to watch Interstellar. Like there's like 15inute diapers. I have to watch it. I'm like, why did anyone ever tell me to watch this? Because really no one ever did tell. The other problem is this though, like",
            "start": 2970.56
        },
        {
            "text": "Interstellar. Like there's like 15inute diapers. I have to watch it. I'm like, why did anyone ever tell me to watch this? Because really no one ever did tell. The other problem is this though, like when you when you say to someone that they have to do it, it sets that weird expectation and it's never as good as the person makes it out to. But if I came to you and said it was [ __ ] groundbreaking and amazing, like I'm setting it up wrong. You kind of just have to have you always have to kind of trick them into it. It's not even a trick. It's just like you got you got to be a little sneaky about just hey, I heard about this thing. I want to see what you have to say about it. I don't know if I like that's how I've gotten my friends to watch both awesome and just heinous YouTube videos. Yeah, that's how Tim gets me to watch. You bring them into Shrek is love. Shrek is life and say that's I don't really know how to feel about this and then they watch it. Let's re rewind a little bit.",
            "start": 3008.72
        },
        {
            "text": "Yeah, that's how Tim gets me to watch. You bring them into Shrek is love. Shrek is life and say that's I don't really know how to feel about this and then they watch it. Let's re rewind a little bit. Shrek is love. Shrek is life. Do not Google that at work. Oh my god. For the love of god. I will show it to you. I'm going to Google it right now. I will show it to you later. It is the It's the weirdest thing you can ever watch. It makes no sense. All right, we'll watch it later. Okay, I'm excited about it. It's Oh my god. I just want to say real quick about cuz we're talking about contrarianism, right? Sure. We really You're insinuating it. You damn fool. I gave you one literal reference that it's happened and it didn't mention contrarian. You crazy old fool. You literally But you two need contrarianism. Let's think about that. This is [ __ ] [ __ ] Just because you you can infer something doesn't mean you literally are talking. I wasn't even inferring it. I gave you one concrete",
            "start": 3041.6
        },
        {
            "text": "need contrarianism. Let's think about that. This is [ __ ] [ __ ] Just because you you can infer something doesn't mean you literally are talking. I wasn't even inferring it. I gave you one concrete example of when it happened when I saw Alvin and the Chipmunks. No, that was my example based on the Metal Gear Mad Max. But I'm saying that's not a contrarian issue. But I didn't say but you're in you're insinuating that it is. You understand? You and I have to go to couples counseling cuz it's really gotten to that point now. Just [ __ ] admit the avocados weren't my fault. I'm not I'm not so sure it's your fault. I think Grandma Georgina's fault. Yeah. Grandma Georgina did not eat those goddamn Yeah, I think she might have. She hasn't eaten an avocado in at least three years that I wasn't a part of. Grandma Georgina ate the avocado. You're never going to know if she doesn't leave her room and she's never going to admit it. She wouldn't admit it. No, she wouldn't admit it. Can we call",
            "start": 3083.44
        },
        {
            "text": "a part of. Grandma Georgina ate the avocado. You're never going to know if she doesn't leave her room and she's never going to admit it. She wouldn't admit it. No, she wouldn't admit it. Can we call her? Is like a phone a friend situation. But what I was going to say to the point about contrarianism is that a lot of people think I'm a contrarian, but I'm really I'm really not a contrarian. It's No, I know you're te, but a lot of people do think that I just take I'm like I think people are entitled to have different tastes. It's funny to call me a contrarian since I I run around defending Call of Duty every year. I don't think there's much contrarian about that. But I digress. Back to the comic book topic that I will have no input on. I do quickly have to point out the irony of you saying you're not a contrarian. I was going to, but I'm happy that you're here today. That's not that's non that's that's not that's nonsense, too, because that's like saying it's contrarian to say like,",
            "start": 3121.92
        },
        {
            "text": "you're not a contrarian. I was going to, but I'm happy that you're here today. That's not that's non that's that's not that's nonsense, too, because that's like saying it's contrarian to say like, \"Hey, Nick, you're a murderer. I'm not a murderer. You're [ __ ] contrarian. You're a murderer. Know about me. Nick's a murder murder some.\" I agree. I get I get I get that completely. Many of my friends think I'm I'm contrary when I'm just telling them I feel differently. So, what are we reading now? Like, Greg, what have you been reading? Sex Criminals. Uh, Crim or Paper Girls. You did you pick this one up yet? No, those are both ones that are on Oh, you haven't read Sex Criminals? Oh, you're going to love it. And then six years later, you'll make Nick read it. Yeah. He'll finally get They talk about Come a lot. Come. Yeah, Cumorld. Is this like a theme park? Kind of. You're better. Pretty much. Yeah. My iPhone. Um, are you familiar with sex criminals? No, not at all. Oh, you love it.",
            "start": 3158.96
        },
        {
            "text": "talk about Come a lot. Come. Yeah, Cumorld. Is this like a theme park? Kind of. You're better. Pretty much. Yeah. My iPhone. Um, are you familiar with sex criminals? No, not at all. Oh, you love it. You're familiar. I'll watch it. I mean, pitch it. Pitch it again. This is kind of like people is that it's mainly from the It starts from perspective of this one girl who discovered at a young age that when she orgasms, time stops and she can just do whatever she wants in that thing in real and it's like a magic power. She can do she can do whatever she wants. Like she tips over the microphone and then finishes the microphone will be over. You know, this is all really happening. No, this has to happen while she's orgasming or is there a So, she only has like a 10-second window or it's like the rules of it or whatever. Don't worry. It's like deferred or whatever, but as as hero from uh heroes. Okay. Right. Exactly. That's an easy way to think of it. Yeah. Okay. Cuz I'm trying to think like",
            "start": 3199.36
        },
        {
            "text": "rules of it or whatever. Don't worry. It's like deferred or whatever, but as as hero from uh heroes. Okay. Right. Exactly. That's an easy way to think of it. Yeah. Okay. Cuz I'm trying to think like there's not much I can get done in that 5 seconds where it's happening. I'm worried about You get like halfway out of going to go and is it going to be a sprinkler or a little like a broken sprinkler going into this? Is this gonna be a sprinkler or a broken sprinkler? You know what I mean? I get it. Yeah. That's why I told you not. On a one night stand or whatever, she she has sex with a guy and discovers that he can ex he exists in this space between spaces, too. She calls hers the quiet. He calls it come world. They've they've all they for their entire lives, they're in their 20s now, have thought they're the only people who have this ability. Now they suddenly meet that they can do it. So they go around and eventually they decide they're going to rob a bank together in the in the time",
            "start": 3241.32
        },
        {
            "text": "thought they're the only people who have this ability. Now they suddenly meet that they can do it. So they go around and eventually they decide they're going to rob a bank together in the in the time the down time. And it turns out there's like other people with this power and they are like the police and they're running around and they have all these adventures trying to fight these people. Oh, that sounds cool. Yeah. How many issues is it in? I think it's actually Yeah, I think it's 13. I remember reading something about it recently because I remember hearing about it and normally when I used to read comics, it was all superhero stuff. I I don't know why. Never really could get into the not not superhero stuff for more than the oneoffs. Mhm. And I was reading about it and I was I was actually pretty interested about it cuz it sounds extremely crass or going to be attempting to be not crass and just be stupid. Sure. No matter what. Yeah. From what I've heard, it actually sounds",
            "start": 3280.8
        },
        {
            "text": "actually pretty interested about it cuz it sounds extremely crass or going to be attempting to be not crass and just be stupid. Sure. No matter what. Yeah. From what I've heard, it actually sounds really good. But then I found out some dude decides to call something [ __ ] world. Yeah. Well, I mean it's just it's that's the dude. Exactly. And that's the joke. If you were if you were a pubescent boy and you discovered this, like what would you call? Call it [ __ ] apocalypse. 13. Issue 13's about to come out. Maybe. Holy [ __ ] why is no one moving? Am I finally going insane? Show Colin where the girl could It was like an 80s show. She could freeze time. Do you remember that? Was it time? Another world something. Out of this world. Was it Out of World? Another world was the college. Yeah, that was the sequel to a different show. Was it the one? Was it the one? No. Coffee. [ __ ] Oh, Different World. This one. What was it the same one where the she talked to the she talked to the cube?",
            "start": 3317.68
        },
        {
            "text": "that was the sequel to a different show. Was it the one? Was it the one? No. Coffee. [ __ ] Oh, Different World. This one. What was it the same one where the she talked to the she talked to the cube? Yeah. Yeah. Yeah. That's that's a different world or another world or one of these world ones. Right. Star show. I love that show so much. Yeah. Me too. I remember that show very well. It was very weird. Yeah. She'd have like conversations with the guy in the pyramid. Yeah. Right. It was her dad. Yeah. Her dad cuz her dad was an alien. Right. Exactly. Are you sure this isn't a Star Trek episode? It might have been a Star. No, it's not. I mean, it might be too, but I know exactly the show you're talking about. It's a very old nostalgic memory of me being really sad about it. I think Yeah. I also had a crush on the girl. She was blonde. I want to watch great. Yeah, reading that. Nail biter. Really in the nailbiter. Nail biter. I don't know what that nailbiter is the story of there's a town",
            "start": 3365.92
        },
        {
            "text": "had a crush on the girl. She was blonde. I want to watch great. Yeah, reading that. Nail biter. Really in the nailbiter. Nail biter. I don't know what that nailbiter is the story of there's a town in the Pacific Northwest called Buckaroo. I think it's Oregon, but don't quote me on that. Not that it matters. And it turns out that like something like 16 of the world's most deadly serial killers have all come from that town. And there's a guy on the ground trying to figure out why that's happening. He goes to he disappears. His friend has to come out and figure out why. And shenanigans and craziness ensue. Be honest with you, G. If you ever go on a hunt for why serial killers are serial killers and you disappear, yeah, you're done. Yeah, you're not I'm not going after. And I don't think anyone's really going to wonder why. Yeah, exactly. Yeah. Yeah. Yeah. You just join them. I'll just assume you join them. Yeah, sure. I'm They call him the buggeear. What is it? Bugsy. Bugs. They just",
            "start": 3397.12
        },
        {
            "text": "really going to wonder why. Yeah, exactly. Yeah. Yeah. Yeah. You just join them. I'll just assume you join them. Yeah, sure. I'm They call him the buggeear. What is it? Bugsy. Bugs. They just call me Bugs. Bugsy the Annihilator. Bugs growing up. No one's called me Bugs in. Have you read uh The Wicked in the Divine? I have not yet. That's another one that people keep recommending to me. I don't really know too much about it. Sounds like there's like pop singers and um it's at a point where pop singers are gods because people kind of like follow them like a religious cult like they do like Taylor Swift. Yeah. And but it reaches a point where they they do become like this like godlike sounds like a Rush album. Oh, they are just gods. Yeah. Well, they're gods. Are you have you been reading Saga? So, so Saga is so pretty much I haven't been reading comics for like maybe six months and then I was like, \"Fuck, I need to get back to this because I was way behind on stuff.\" Yeah. So, I went",
            "start": 3433.76
        },
        {
            "text": "Saga? So, so Saga is so pretty much I haven't been reading comics for like maybe six months and then I was like, \"Fuck, I need to get back to this because I was way behind on stuff.\" Yeah. So, I went back and I caught up on all the stuff that I normally read. So, Transformers, Ninja Turtles, um Invincible, Invincible, Spider-Man, SpiderGwen, Batgirl, Batman, and uh yeah, so those are ones I just I always just kind of read. And those are all kind of varying degrees of good or bad. Invincible I've been really upset with the last really 13 or so issues where I'm like stuff. Yeah. I'm like I don't care at all. And now this this new stuff they got going on. I'm like [ __ ] yes. Yeah. I like I like reboot question mark storyline a lot but it's one of three, right? Is like the book that just came out. So you're like okay. So in again all the question marks and all the like them putting that out of three that's for a reason. Yeah. Right. I don't know what that reason is. I I mean like I think",
            "start": 3474.56
        },
        {
            "text": "out. So you're like okay. So in again all the question marks and all the like them putting that out of three that's for a reason. Yeah. Right. I don't know what that reason is. I I mean like I think we I think it's pretty obvious how that's going to go. Spoilers I guess or whatever and you know whatever you I've talked to you about this, haven't I? You you don't even read Invincible, right? I I do. Oh, how far behind are you? Very uh three episodes or or three issues earlier? You'll be fine. I mean it's you know Mark shoots down that hole and then Oliver's like, \"Wait, no, don't.\" And then it gets So it's clearly the thing he walks up to like is basically that thing from uh the old Superman story that you know the star like guy that attached to you and gives you your wild your wildest dreams or whatever kind of thing. So, he's going to wake up from it, I'm sure. Yeah. Nothing else changed. I don't know. We'll see. I hope that's not the case. That will be very upsetting. I mean, the",
            "start": 3520.72
        },
        {
            "text": "or whatever kind of thing. So, he's going to wake up from it, I'm sure. Yeah. Nothing else changed. I don't know. We'll see. I hope that's not the case. That will be very upsetting. I mean, the best thing about Robert Kirkman is that he likes to [ __ ] with you and he knows that [ __ ] That's my thing. He swerves. He swerves. Yeah, because Yeah. The last the last bits have been been rough to get through. And uh but so I I caught up with all those and I was like, \"All right, I'm going to give Saga a shot because everyone's telling me that I need to.\" Kevin is the one naysayer. Kevin is just like, it's too dramatic. Who Who writes Saga? Uh, Brian Bond, Fiona, and something is going to be a weird com. It sounds like one of the ones my dad keeps telling me to read cuz my dad reads those kind of comics all the time. Those kind of comics like non superhero comics. It's a thing. It is. That's all he when we used to go to comics cuz they're the best ones going. Yeah. Well, Saga's like it's",
            "start": 3558.56
        },
        {
            "text": "of comics all the time. Those kind of comics like non superhero comics. It's a thing. It is. That's all he when we used to go to comics cuz they're the best ones going. Yeah. Well, Saga's like it's like a rough on Romeo and Juliet basically. The thing about Saga, if you guys don't know, it's Romeo and Juliet meets Star Wars meets Game of Thrones. Yeah. So, it's just it's the the epicness and character styles of Stars with the plot of Romeo and Juliet, but with the [ __ ] upness of Game of Thrones, which is like if that doesn't sell you on it, you're just not into those things. Space. It's [ __ ] awesome. I love it. I just I in like four days I caught up with all of it. I'm like, man, I wish there was more right now. Sure. Um it's really good. It's a little crass unnecessarily I think sometimes. Sure. Yeah. life is. But sometimes they say I don't I'm not a fan of saying [ __ ] just to say [ __ ] And I feel like sometimes they say [ __ ] just to say [ __ ] Yeah. Um it's fun to say. It",
            "start": 3596.96
        },
        {
            "text": "Sure. Yeah. life is. But sometimes they say I don't I'm not a fan of saying [ __ ] just to say [ __ ] And I feel like sometimes they say [ __ ] just to say [ __ ] Yeah. Um it's fun to say. It is fun to say. Have you had the experience yet where you're reading a comic book on a plane and you're like this is really Oh, that's a tit. Yeah. That was me with Saga. She's getting plowed from behind. I'm like Yeah. It's a lot of It's like Game of Thrones in a lot of ways. Excellent. You look at this first you're like great one of those. I was playing Persona on on the plane and uh the guy sitting next to me was extremely old and just you know it plane out of North Carolina the not not the major airports Wilmington's airport which is like tiny super country the dude just like looks over and the amount of just does not compute on his face when he sees Teddy get out of the nice he was just like what is wrong with this dude? Those generations are ruined. Um, so I I caught up on Saga and I was",
            "start": 3640.4
        },
        {
            "text": "amount of just does not compute on his face when he sees Teddy get out of the nice he was just like what is wrong with this dude? Those generations are ruined. Um, so I I caught up on Saga and I was like, \"Fuck, I want more.\" So then I was like, \"Oh, what else has this guy written because like this shit's [ __ ] good.\" And then I saw that he wrote this thing called The Private Eye. Private Eye was something someone recommended to me like months ago. Downloaded all of them. Um, it's like a really interesting. It's like a pay what you want model type thing, which is pretty unique for comics. And so you can get all of them free or you can pay whatever. And so I just downloaded all of them. And then I finally started reading it and in two days finished all of it. It's only 10 issues and it's a complete story which is my favorite. Like when things are ongoing it gets a little bit messy and stuff but like when you know there's an end and the the writer has a [ __ ] clear plan of where it's",
            "start": 3686.8
        },
        {
            "text": "a complete story which is my favorite. Like when things are ongoing it gets a little bit messy and stuff but like when you know there's an end and the the writer has a [ __ ] clear plan of where it's going. That's great. Otherwise it's like and then time travel and it's like [ __ ] god damn it. Don't do this. But so this is what I'm trying to pitch calling on. Private eye. So the plot of private eye is we are in the the near future. So it's like 20070 I think and in 20150 the cloud bursts. So everything that's in in the cloud is revealed to the world. So all of your search history, all of your your contacts, all of your um I think I've actually heard of this. Yeah. Yeah. I I told you about like last week, but now that I finished it, I'm like, I can actually recommend this. Um cuz the first couple issues I wasn't like super sold on, but then as it comes together, I'm like, [ __ ] this is great. Uh but so everyone's secrets are out there. So there is no more online uh anonymity. Gotcha.",
            "start": 3730.08
        },
        {
            "text": "couple issues I wasn't like super sold on, but then as it comes together, I'm like, [ __ ] this is great. Uh but so everyone's secrets are out there. So there is no more online uh anonymity. Gotcha. And I mean, just imagine how much that would [ __ ] people. And even YouTube commenters. Yeah, exactly. But even the people that are like feel like a I have nothing to hide. It's like they do have something to hide. whether it's text messages from their past or you know just all these different pictures they've taken or yeah um anything there's like so things they've bought like all this different stuff comes to play and what happens is they shut down the internet and everybody is required just by by sheer necessity to create alter egos and like secret identities in real life to kind of hide from stuff because no one wants their real identity be out there because then they're like you know going to be in trouble for some [ __ ] So people have like they wear everyone's wearing masks and",
            "start": 3781.44
        },
        {
            "text": "from stuff because no one wants their real identity be out there because then they're like you know going to be in trouble for some [ __ ] So people have like they wear everyone's wearing masks and everyone's doing stuff and they come up with multiple identities that like they don't even share with like their friends and stuff because like YouTube comment identity will be one thing and then their like work identity will be another and like they come up with these like real identities in real life and it is such a fascinating story. The police there's no more police. The press is the new police force. So, like there's journalists that are out trying to like get to the bottom of [ __ ] and like catching you for for stuff and and all that. And man, the end is [ __ ] amazing. How long is it? 10 issues. Oh, wow. Okay. Yeah. It's [ __ ] It's in and out. It's like it's really really really really good. And it's just such a fascinating storyline and they're not coming back to it. There's not",
            "start": 3828.96
        },
        {
            "text": "10 issues. Oh, wow. Okay. Yeah. It's [ __ ] It's in and out. It's like it's really really really really good. And it's just such a fascinating storyline and they're not coming back to it. There's not no sequels, no [ __ ] It's just [ __ ] it is what it is. And the story is great. The characters are good. There's um one of the main characters is the main character's grandpa who is a dude. He's essentially me. Uh like he's growing up with all this stuff, in love with using his phone, addicted to his phone, addicted to Facebook and all the social media and video games and being connected and all this stuff. And it's just it's a funny look at what the future's going to be where there's this uh old guy covered in tattoos, which is like all the the the people my age now that are covered in tattoos. Eventually they're going to be old people covered in tattoos and that's going to be weird looking, you know? And so this guy is that and all these the the people there's a mystery going on and",
            "start": 3868.4
        },
        {
            "text": "Eventually they're going to be old people covered in tattoos and that's going to be weird looking, you know? And so this guy is that and all these the the people there's a mystery going on and people like what? We don't even know how to use this [ __ ] And they're talking about iPads and stuff and he's the only like crazy guy that's like nostalgic about having iPads and nostalgic about his phone. like he won't stop having his phone even though it hasn't been connected forever, but he keeps looking at his old Facebook messages just because he wants to relive like his memories of what the internet used to be. And it's [ __ ] so good. That sounds awesome. Yeah, Timmy, you would die without the internet. I know. Literally, you wouldn't go a day. You just be like, \"This got to swallow this phone.\" Yeah. Then you [ __ ] it out. I think most you you really don't realize how useless everything you own is until it doesn't have a connection to something. Oh my god. I was on a drive up to uh up",
            "start": 3909.6
        },
        {
            "text": "Yeah. Then you [ __ ] it out. I think most you you really don't realize how useless everything you own is until it doesn't have a connection to something. Oh my god. I was on a drive up to uh up north a little bit with my wife last weekend. Um and we hit the inevitable dead zone as far as the connectivity to the phones were concerned. And I was like, \"Well, [ __ ] I haven't downloaded any music in the last two years. I've got Spotify. She's got Pandora. Between the two of us, we had nothing.\" Yeah. Nothing. And we were forced to talk to each other. Oh my god. And it was a fate worse than death. Terrible. Yeah, it was terrible. talk. I almost pulled one of those. All right, I'll be right back. And just left the car midway, just taking off the seat belt and just gone. Roll be right back statement before you dive out of the car. Be right back. Get a coffee. Have you ever seen someone try and pull those just out of habit and then realize they're in an enclosed space? No. No. You have",
            "start": 3948.24
        },
        {
            "text": "statement before you dive out of the car. Be right back. Get a coffee. Have you ever seen someone try and pull those just out of habit and then realize they're in an enclosed space? No. No. You have friends like this? You got some weirdass friends, Alex? Not not friends. This was people I knew my freshman year of college. Uh it was just the stock thing when when this guy was ready to go. He's like, \"All right, see you later.\" Doesn't matter where he he just kind of came out of his mouth, you know? It was one of those things he says a lot. And when he when that trigger went off in his brain, it was like, \"All right, see you later.\" Then he, \"Oh crap, I'm in a car. I'm trapped. Can't go. I can't do this anymore.\" The car was commit to it. We were in line for cookout and he just [ __ ] it. I mean, cookouts right next to campus where I went to school, and he just bounced out. All right, I'll see you guys later. No, he didn't. He didn't bounce out. He went to the walk up window, got food,",
            "start": 3996.8
        },
        {
            "text": "mean, cookouts right next to campus where I went to school, and he just bounced out. All right, I'll see you guys later. No, he didn't. He didn't bounce out. He went to the walk up window, got food, and then left. Yeah, I had a friend, Raymond, who smart every once in a while just decide he's done with whatever we were doing. He's like, \"Bye.\" And just leave. Like he he would always leave, though. It's like, \"All right, Raymond, see you later.\" Nobody loves you, Raymond. Oh, I like that. Going back to comics, I can't say this enough. The Star Wars comics are amazing. Nick, you need to read these things. I I they're on my list of to-dos. Yeah. Yeah. I got to catch up on Invincible and Saga first. Yeah. It's just hard because the comics a part of my brain that's like you're not getting the value you deserve out of these. Cuz more often than not, it's, you know, it's three bucks a book to finish that. I mean, I'm a slow reader, but I'm pretty sure I can finish that thing in like five",
            "start": 4040.0
        },
        {
            "text": "value you deserve out of these. Cuz more often than not, it's, you know, it's three bucks a book to finish that. I mean, I'm a slow reader, but I'm pretty sure I can finish that thing in like five minutes. That's that's not a big bang for your buck on that, right? So, comics are tough. Comics. I I catch myself all the time being like, \"Wait, slow down and look at the panels.\" Because if you're just reading, Yeah. you you breeze right through and you're done. It's disposable. It's out the window. Yeah. Comic books are one of those things still I don't get. I don't get not interested in them. You know, it's just it's not even I'm sure they're a great story. That story sounds awesome. That would be a great movie or a series. You know, I love the idea of the anonymity now being in person instead instead of online. I think it's a brilliant idea. The question of course is if everyone's information leaked, then everyone would be hurt. So why would it even matter? But that's they get into a",
            "start": 4080.72
        },
        {
            "text": "instead of online. I think it's a brilliant idea. The question of course is if everyone's information leaked, then everyone would be hurt. So why would it even matter? But that's they get into a whole bunch of [ __ ] It's [ __ ] so good. I recommend reading it just so we can talk about it. I'd like to check it out, but I'm gonna buy for sure. So look at the pictures. You can get it for free if you wanted to. But the uh Yeah, I just that's just one it's comics that just don't resonate with me. I don't get them. I don't understand them at all. So it's it's it's uh because to Nick's point, it's like I used to try to buy them and read the G.I. Joe comics in the late 80s, early 90s were really actually really popular. And um I used to get those and my brother would buy I look at my brother's X-Men and XFactor comics and stuff. I'm like, I just don't want to like these are cool characters. I guess I'm like I just don't why why, you know, like why? Like this format is a specific form. I just",
            "start": 4116.32
        },
        {
            "text": "and XFactor comics and stuff. I'm like, I just don't want to like these are cool characters. I guess I'm like I just don't why why, you know, like why? Like this format is a specific form. I just don't get it, you know? It's it's I'd rather just read about these characters, you know? And I actually have words and tell me what's going on, you know, and all these kind I don't I don't I don't understand. So even like when Jerry the last time I tried to really read a comic when Jericho went to which is a great one of our Greg and my favorite shows um went like went to comics to finish the story and I'm like I just I just read the synopsis. I'm like I'm not doing this. I remember I read like half the comic. I'm like, \"No, I don't think so.\" Uh, I think I'm with Colin on this one. As someone who has fallen in and out of love with comic books, I I used to love them. And I think the divide was when I discovered I can when I can read a comic book and that's it. I can't do something else at the",
            "start": 4152.24
        },
        {
            "text": "has fallen in and out of love with comic books, I I used to love them. And I think the divide was when I discovered I can when I can read a comic book and that's it. I can't do something else at the same time. The big the big thing for me that kind of changed was I listen to a lot of books as audio books, but I do it while I'm playing a game. M. So, it's I feel like I'm getting more than one thing done cuz see I'll play I'll play a game like the mindless parts of Metal Gear like these these side ops. I don't care. I'm you know. How dare you? I'm with I mean yeah when I was doing side ops I was listening to podcast. I made I made a [ __ ] art format of taking those tanks down like the heavy infantry and the tanks. But while I'm doing that I I was getting through a book as well or a TV show. Like I that's the weird thing. I'll do it with Netflix too podcast. I don't there are plenty of TV shows that it sounds weird I don't have to watch they're just there kind of on next to me like",
            "start": 4186.08
        },
        {
            "text": "show. Like I that's the weird thing. I'll do it with Netflix too podcast. I don't there are plenty of TV shows that it sounds weird I don't have to watch they're just there kind of on next to me like perfect example Malcolm in the Middle throw that on just go in the background play some Destiny same thing feel like I'm doing more than one thing at once whereas with a comic I have to sit there and do the thing and at least with a book when I want to read a book it's there's more it's more of a I'm sitting down to read this book I have a reason for doing it and it's going to take me a while and with the comic. It's like I'm in the bathroom. All right, cool. I'm done. I'm I'm not even I'm already done with comic book, but I'm not even done with going to the bathroom. Yeah. Yeah. It's hard. It's hard. That's the thing is like I mean like the reason I like comic books is that they force me to slow down. It is the one I have to focus. Like I I I can't tell you the number of times where I'm",
            "start": 4229.76
        },
        {
            "text": "hard. That's the thing is like I mean like the reason I like comic books is that they force me to slow down. It is the one I have to focus. Like I I I can't tell you the number of times where I'm like I can't wait for The Walking Dead tonight. That's going to be so great. It's I can't wait. It's the only thing I watch on TV that day or whatever. Sunday comes around. I turn it on and then Sharon 15 minutes and I'm looking at my phone like wait I was excited for this all day. I have to force myself to put it down and put it away. Whereas the comic books like you have to give it your undivided attention. So yeah, I can't imagine doing what you're doing whenever whether it's comics, music, movies, TV, internet, whatever. I just I am doing one thing. Like I can't watch like I can if I'm watching Malcolm in the Middle, it's cuz I want to watch Malcolm in the Middle. If I didn't want to watch Malcolm in the Middle, I wouldn't watch it. Like I need to like just kind of get into it with",
            "start": 4274.4
        },
        {
            "text": "watching Malcolm in the Middle, it's cuz I want to watch Malcolm in the Middle. If I didn't want to watch Malcolm in the Middle, I wouldn't watch it. Like I need to like just kind of get into it with especially with music. Drives me crazy when people are like, \"Oh yeah, you know, just I just have the music on and I'm doing other stuff.\" I'm like, \"No.\" like music is a thing you do. Interesting. I'm I'm one of the reasons I really like the show is because when you and Colin talk about music, I tend to agree with you guys a lot. I listen to a lot of music. Like a lot. That's one of the big things I do. And I never just listen to music. And it's it's it'd be interesting to see you try and deal with how how I do media. I I literally have headphones on, speakers on, and a computer. I will listen to Kevin. I will listen to music while listening to a book and playing a game. Yeah. No, it's like when it'll be on mobile like with games, even if the there's not like a thrilling soundtrack or",
            "start": 4306.8
        },
        {
            "text": "to Kevin. I will listen to music while listening to a book and playing a game. Yeah. No, it's like when it'll be on mobile like with games, even if the there's not like a thrilling soundtrack or like whatever, I feel like it's part of the experience. Like I feel like I'm missing out on What's only some types of games though? Like I can only do it with like Minecraft or like Heroes of the Storm or something where there's no a little bit of meat on the bones, you know? the whole thing about Minecraft when it came out cuz you know it was just something to do. You know what I mean? Yeah. No, no. Colin and I just talked about this on the most recent episode of PS I Love You or at least the morning episode of PS I Love You. You got a lot to catch up on now, brother. Uh but no, like yeah, like grinding in games, right? Like Kingdoms of Amler Reckoning and Skyrim and I'm sure when Fallout 4 gets here, those are games that I know I'm going to eventually get to where it's like, [ __ ] I just",
            "start": 4347.04
        },
        {
            "text": "grinding in games, right? Like Kingdoms of Amler Reckoning and Skyrim and I'm sure when Fallout 4 gets here, those are games that I know I'm going to eventually get to where it's like, [ __ ] I just need to knock out these quests or whatever. almost. I know. Every so often I forget that it's almost time and I remember it's almost time and I'm like, \"Nick, punch me in the head and put me in a [ __ ] com.\" Here, listen here. Here's the thing about comics is that it's it's like me like think about the different media forms and I appreciate pretty much all media forms because it's fine. Like I think comic books are beautifully drawn and you know some of them and you know interesting stories. It's just I think about DC and these characters for instance Batman. I really love Batman and I I appreciate Batman and that lore. I'm like this would be and we've talked about this past. know that they exist, but I'm like, just write books. You know what I mean? Why did why does everything have to",
            "start": 4387.52
        },
        {
            "text": "Batman and that lore. I'm like this would be and we've talked about this past. know that they exist, but I'm like, just write books. You know what I mean? Why did why does everything have to have pictures? Like, what is even the allure of this, you know? Like, it's it's it's it would be much more fun to have like a fully fleshed out story instead of seeing a panel with it's a big towering building and the next panel is Batman standing on the building. Then there's a panel like close up with Batman. It's like, you know, just an ellipsus or whatever. And I'm like, you could just explain this in a much more cheap in a much cheaper way. Frankly, that would be like much more exp like even you can even garner better visuals in your head based on what's going on based on the words usage as opposed to the like 500 words that might be in a comic book and that's probably really even a lot of words. So, but that's why it's a different art form, right? I but I just Yeah. No, I and I so I",
            "start": 4422.72
        },
        {
            "text": "as opposed to the like 500 words that might be in a comic book and that's probably really even a lot of words. So, but that's why it's a different art form, right? I but I just Yeah. No, I and I so I appreciate it for what it is, but I get frustrated the same way. I'm like, tell stories. Tell stories like with words. Use your words and tell me a story. If Batman was a book, if they were like, \"We're releasing two Batman novels a year and it's going to be this continuation. It's be all this fantastic.\" I'd totally be in. Sure. you know, I would absolutely be in. And I I I So, and I bet you the stories would be better. And I bet you the using a little bit of your imagination is fun. It's it's um it's like what's a recent example? The Hunger Games. I read the Hunger Games books, and I really like the first Hunger Games book. The second one is identical to the first book, which was like the most frustrating thing in the world. Then the the third book was, you know, whatever. Uh but but I",
            "start": 4455.84
        },
        {
            "text": "like the first Hunger Games book. The second one is identical to the first book, which was like the most frustrating thing in the world. Then the the third book was, you know, whatever. Uh but but I had I had this great image in my head of everything going on, the cornucopia and the arena and and the way all the characters looked and stuff. And I see the movie and I'm like, this is just isn't the way I saw it in my head. And I often wonder like what kind of awesome images could I conjure up if I just didn't have a touchstone at all? Like I didn't have a touchstone when Samantha or whatever her name is Collins, I think that's her name or no, yeah, Rebecca, I don't know, whatever. Uh Collins is her last name. When she released those books, I'm like, my image of those is just so much different than this the um than the movies and and it's disappointing and it almost ruins it for me, you know? I hear you, but I mean it's just that's the whole thing is like this is what we're talking about",
            "start": 4491.04
        },
        {
            "text": "than this the um than the movies and and it's disappointing and it almost ruins it for me, you know? I hear you, but I mean it's just that's the whole thing is like this is what we're talking about again on PS I Love You the other day, right? just the fact of like it's their story in this instance. You know what I mean? It is The Last of Us. This is how they want you to have this experience. And then granted, like you're saying, there's all those other things. The problem of course is like I just said a second ago too is just that like superhero books are tend to be so bad overall. Like I've been reading everything DC like everything in so many of these books. I'm like terrible, terrible. Skip. You talk about comic books. Yeah. Okay. Yeah. Yeah. And like there's standouts that are great, but like when I'm talking about who's doing the best work right now, the work I'm most into, it's Image over and over. Like every book I listed a second ago was Image, right? It's because and they're",
            "start": 4522.72
        },
        {
            "text": "but like when I'm talking about who's doing the best work right now, the work I'm most into, it's Image over and over. Like every book I listed a second ago was Image, right? It's because and they're not they're you know here's this weird detective thriller happening in Buckaroo and here's you know what I mean? Like they're not here's this thing and I'm not sure 100% where Paper Girls is going but like here are these girls who deliver newspapers in the 80s and something crazy is going on their first night this one girl's first night on the job. You know what I mean? Like that's way more interesting to me than 90% of DC and Marvel like some babysitter club [ __ ] Yo re real real quick. Smoke cigarettes. You'd like her. Oh, okay cool. There's a Monster Squad poster in a room too. But I wonder I wonder if it's not fair to and this is just an assumption. I mean I have looked at numbers and I have studied it because when we were talking about video or uh comic book movies and how prolific",
            "start": 4555.2
        },
        {
            "text": "I wonder if it's not fair to and this is just an assumption. I mean I have looked at numbers and I have studied it because when we were talking about video or uh comic book movies and how prolific they are yet comic book readership is like dwindling. So it's I wonder if there's almost something to be said about like why don't you try a different way you know like totally down try a different way of telling these stories. The different well see not even there like the comics need to kick in the ass. Like you said a second ago that if they did two novelizations right that they'd be better than that than the comics are putting out. They could tell probably in a novelization though Greg probably 30 comic books worth. You're missing my point though. You said that, right? And and Kevin shook his head like, \"No.\" And I'm with I'm actually with you that I wish what I what I always want them to do is blow up continuity and find writers and artists artists and writers, put them together and",
            "start": 4587.92
        },
        {
            "text": "his head like, \"No.\" And I'm with I'm actually with you that I wish what I what I always want them to do is blow up continuity and find writers and artists artists and writers, put them together and say, \"You have 12 issues to tell your book. We're going to put them out in a compilated thing.\" That's the future to me personally. what they do right now with Superman Earth 1 and Batman Earth 1 where all of a sudden I get a [ __ ] hard cover that's 136 pages and it's this beginning to end story and usually like the last panel teases what the next book's going to be about and you're like that's [ __ ] perfect. This nonsense right now with like 30 pages a month the dueling Superman books that are going on and trying to tell you the same thing while Justice League's telling you the same thing but he's still Justice Superman and it's just like this is what are you doing? You're just trying to put something out monthly. What's the what's the goal here? I miss that. And that's why Image is",
            "start": 4619.52
        },
        {
            "text": "but he's still Justice Superman and it's just like this is what are you doing? You're just trying to put something out monthly. What's the what's the goal here? I miss that. And that's why Image is great because they have a goal. Yeah. Yeah. I would like it even I'd like even the situation to be such that find find some I'm not saying there's aren't there aren't talented, right? I don't know anything about the comic book industry at all. So don't assume that I'm I'm speaking from a place of of knowledge because I'm not. But my assumption is that a lot of the writers in the comic book industry are talented but don't they don't write the way I would want something be written. And I would love to see I mean maybe it would be financially viable although I'm not so sure it wouldn't be if you were to say like find some good writers and write you know write write a Batman trilogy two three 400page books that's the story find people that are outside of the of that industry to even write these",
            "start": 4657.68
        },
        {
            "text": "to say like find some good writers and write you know write write a Batman trilogy two three 400page books that's the story find people that are outside of the of that industry to even write these things fill in a little bit fill in a little bit on on you know what needs to be said and like let them go and then you have no touchston to all this [ __ ] recconing and all this kind of stuff and just tell the story because I I you know it's been fun and interesting to me to comic book movies just explode and comic book culture explode and all these things explode, but comic book numbers are really seem to be low. You know, they don't they're not spiking. Exactly. So, it's it's it's so that tells me that it's not the it's not comics that matter to people. It's the stories. It's the characters and the stories. It's the Flash and it's, you know, Daredevil and it's Gotham. By the way, it's it's Shocker, of course. By the way, you I was talking to my dad the other day. Huh? Sorry. He's great",
            "start": 4690.32
        },
        {
            "text": "and the stories. It's the Flash and it's, you know, Daredevil and it's Gotham. By the way, it's it's Shocker, of course. By the way, you I was talking to my dad the other day. Huh? Sorry. He's great man. You know, I love my dad. 65y old retired fireman. Like, what are you watching? You got to check out this movie X-Men. And nobody told nobody told me to watch it. I'm telling you to watch it. And he was like, he's like, \"Oh, that's interesting.\" And he's like, \"Me like I'll have to tell him five more times.\" Like, uh, but he sees a lot of movies, so I actually assume that like he goes to movies all the time. So, I my assumption was already seen it. And I'm like, \"So, what are you watching these days?\" He's like, \"Well, I'm watching I'm watching Gotham.\" Yeah. And I'm like, \"Really?\" He's like, \"My dad loves Batman, too.\" And he's like, \"Yeah.\" And I'm like, \"You like it?\" He's like, \"Yeah.\" I was like, \"Huh?\" All right. You know, I'm like I didn't I'm like I totally didn't expect that.",
            "start": 4729.04
        },
        {
            "text": "\"My dad loves Batman, too.\" And he's like, \"Yeah.\" And I'm like, \"You like it?\" He's like, \"Yeah.\" I was like, \"Huh?\" All right. You know, I'm like I didn't I'm like I totally didn't expect that. You should watch for God's sakes watch House of Cards. He's like, \"All right, I'll talk to you next week.\" So, you know, that was basically the extent of the conversation, but I thought that was an interesting kind of queue over when you call him in a year. And what do you watch? He's like, \"I'm watching the Supergirl season 2.\" Supergirl. How How did people enjoy the show? It did monster ratings, but I'm sure it did, but that's the matter. Did people like it? I'm 30 minutes through the first h I'm halfway through the first show, so I haven't gone online to look at reactions, so I have no information to give you on that one. I'm interested to see if that uh if that catches on or not. Anyway, I I I I so I I feel like a lot of the people too are a little disenfranchised from the community",
            "start": 4766.48
        },
        {
            "text": "to give you on that one. I'm interested to see if that uh if that catches on or not. Anyway, I I I I so I I feel like a lot of the people too are a little disenfranchised from the community because, you know, like Comic- Con, we've talked about Comic- Con um and how many Comic Cons there are. I'm like, it's called Comic- Con, Comic Convention, but it's really not about comics. It's about the characters that are ancillary, the popular art center. Yeah. Exact. Exactly. So, I think we just have to figure out a new way forward like that. I think I think that there's probably much like the nerds at the center of games. I mean, even we are like those like what the purity of Mega Man for instance, like it's really important to me. I'm sure there are a lot of nerds out there. There's like a purity to Batman comic books and the cells and the and and the art and stuff like that. And I'm like, I think you just have to figure out a new way forward to get people. It's one of those It's one of",
            "start": 4798.32
        },
        {
            "text": "to Batman comic books and the cells and the and and the art and stuff like that. And I'm like, I think you just have to figure out a new way forward to get people. It's one of those It's one of those It's all about the financials of figuring out how it exists. You know, if comics don't get any bigger, great. Maybe they go and make books then for people who want the books and then you still have the art form over there. Oh, I'd be in, dude. If if they if they did it where it wasn't a one-off, but like if they told a continuity over years that was like a novelization, I'd love that. And that's and so because it's just talking it's different audiences finding different audience. they found is so much success with the movies because there is a bunch of people who don't want to read comics and like I'm telling you man like reading a comic book takes more effort than you think because it isn't reading the words it is looking at the faces and looking in the background and seeing how this",
            "start": 4832.96
        },
        {
            "text": "and like I'm telling you man like reading a comic book takes more effort than you think because it isn't reading the words it is looking at the faces and looking in the background and seeing how this person reacts or doesn't react or what they're doing with their hand. I mean, like how many times you see something like that was a weird plot twist and then you'll reread it or somebody tells you, \"No, no, go back to this page. You missed this part where it's you like, holy [ __ ] I did.\" Like it's kind of if like I've read them wrong before. I still do every so often when I'm in a hurry or whatever, but it's about like going back and rereading them. And I also want to point something out. Um I used to think I would love to read a novel about Batman. And I've read a lot of Batman books over the years. More and more I'm thinking I wouldn't. He as a character is interesting in the format of a comic book. If you give me too much of him, like even a short novel, I think you'd reveal that",
            "start": 4861.2
        },
        {
            "text": "the years. More and more I'm thinking I wouldn't. He as a character is interesting in the format of a comic book. If you give me too much of him, like even a short novel, I think you'd reveal that there's not as much going on to him as a character in that format as there is in a comic. It it's very much you you have to use the medium itself. With with books, you know, when you write something, you have to follow the rules. Don't write about it if it's not important. Whereas if you do that for a superhero kind of thing, that would be really boring. Oh, no. If you only give me if you only give me the absolute essentials of what happens in a Batman book. There's no in there's no environment to it. The same way when you read a comic, you see all the things that make him him. You know, it it's kind of like playing Arkham Asylum the first. It's the cool thing about that game is you felt like Batman. You were hiding. and you were doing the whole thing. It was the environment it created and",
            "start": 4897.44
        },
        {
            "text": "kind of like playing Arkham Asylum the first. It's the cool thing about that game is you felt like Batman. You were hiding. and you were doing the whole thing. It was the environment it created and it could only happen because you're stuck in Arkham. Same way with a comic book. You're you you're seeing it happen. So, they show you. They don't necessarily tell you and then it's on you to see it. But if you have a whole book, I think it depends on I see your point, but I think it depends on the the author, right? I think that's that's that's the job of the the person writing the book is to compel you um to keep turning each page. Uh I see both sides. I see the side of of uh Colin's argument as well, but I come at it more from a visual medium, right, where I love film more than anything else. And one of the one of the parts of the process of a lot of films is the storyboard process where someone sits with the director oftentimes will sit with an artist and say, what is your sort of",
            "start": 4952.64
        },
        {
            "text": "else. And one of the one of the parts of the process of a lot of films is the storyboard process where someone sits with the director oftentimes will sit with an artist and say, what is your sort of vision for how these frames are going to look or this environment or all these things and I think that I bring that level to it. It's when I read, my brain fills in the blanks. It starts, it looks at it like it is a storyboard and I see I physically start, if it's a good book and a good enough story, I physically start seeing the action unfold in my head from from uh pain to pain. Um, and I don't know, I think it's a good you get a really good graphic novel, not necessarily a superhero book, but a good graphic novel, and it really is a unique and very very stunning art form if done well. But that's the same for everything. If novel if a if a novel is beautifully written then it it sucks you in just like anything else. And I do have to point out I just thought of something that does kind of",
            "start": 4990.72
        },
        {
            "text": "the same for everything. If novel if a if a novel is beautifully written then it it sucks you in just like anything else. And I do have to point out I just thought of something that does kind of ruin what I said. Oh, is it this Batman the ultimate evil? The hardcover book I'm recommending to you and Colin again. It is the best book I've ever written. Uh one of my favorite authors, Neil Gim. No, it's not true. Don't worry. It's I'm recommending the book now. It was released in 1995, so I was 12. So, but I remember at the time thinking it was awesome. when Batman goes after a child's sex ring like he like kids are being [ __ ] abused into I'm interested in the story. Okay. I I can't speak to it anymore, but I remember back then thinking it was a great book. Sorry. Go ahead. Yeah. But one of my favorite authors, Neil Gon, you know, Sandman, awesome. American Gods is very similar in the the essence of what it is. American Gods is one of the best books I've ever read. And I've read a lot",
            "start": 5028.8
        },
        {
            "text": "my favorite authors, Neil Gon, you know, Sandman, awesome. American Gods is very similar in the the essence of what it is. American Gods is one of the best books I've ever read. And I've read a lot of books. And I gotta say that he he totally nailed everything that was cool about Sandman as a comic, but in a novel form. You know, he he maintained that air of like you don't understand how all of it works until it all kind of comes together and then you're like, \"Oh, yeah. It totally makes sense.\" But I don't know. I just I do worry about some comic book characters that you show what's good about them only in a comic and if you try and take them out of that I think it would be nothing but making them weaker. Kind of like Fight Club the book against the movie you know. Sure you read the book. You take Batman and we kind of know Batman right? We kind of know that Batman's story. We know a lot of what drives him and where his stories usually go. But I mean that's the same with everything",
            "start": 5069.6
        },
        {
            "text": "You take Batman and we kind of know Batman right? We kind of know that Batman's story. We know a lot of what drives him and where his stories usually go. But I mean that's the same with everything right? You look at you look at a story like Arrow, which is for all intents and purposes. Like I I just started watching that show, which is why I'm really into I keep bugging Greg every time. I'm like, \"Hey, this I just watched this awesome episode, Greg. It's like it's three years old, Nick. The story you saw it I saw it three years ago.\" But I mean, that's basically a retelling of a Batman like story. But they just, you know, you put a different twist on it. They always say there there are no unique stories left, right? Just unique storytellers. No. And that's the whole thing is Yeah. It's it's whose take on it. The one like the next Superman book I'm super excited for, right, is American Alien, which is Max Landis' book. He's doing of course Rar Chronicle and wrestling isn't wrestling or",
            "start": 5116.24
        },
        {
            "text": "whose take on it. The one like the next Superman book I'm super excited for, right, is American Alien, which is Max Landis' book. He's doing of course Rar Chronicle and wrestling isn't wrestling or wrestling. Yeah, wrestling isn't wrestling on YouTube with Khloe and everybody else. Like I can't [ __ ] wait for that. It's just a Clark Kent book about him growing up, right? I'm like, \"Yeah, [ __ ] yeah. Let's do it.\" Was your favorite Arrow episode the one where he's in the parking lot with his head down and his hood up and it's clearly him, but no one knows that it's actually him because he has paint on his face. What's funny is that I was watching I watch a few episodes with Greg. I'm like, \"This is the most absurd [ __ ] I've ever seen.\" When you s when you watch one episode per week, it doesn't it does I I bet it doesn't sink in as much as when you watch them in one night and he's back in town and I just saw him at his house now. I got to talk to this arrow fella. It's always him",
            "start": 5146.48
        },
        {
            "text": "it doesn't it does I I bet it doesn't sink in as much as when you watch them in one night and he's back in town and I just saw him at his house now. I got to talk to this arrow fella. It's always him like Listen, I don't know who you are, but you better stay away from my daughter that's always hanging out with I told my friends I don't care what you do. Put on a hood, change your voice. I'm going to know it's you. Yeah, I know, right? Like just the way like just the way you walk I will immediately that's why I mean give and it's a [ __ ] terrible movie but the Green Lantern movie has that amazing interaction when he lands and he's trying to play it off and she's like how he's like how did how did you know? She's like you think by putting something over your cheekbones I wouldn't know who you are. This was a great topic Tim and it was brought to you by none other than Loot Crate. Okay. Tim, would you classify yourself as a geek, gamer, or pop culture nerd? I would crate. Then Loot",
            "start": 5178.16
        },
        {
            "text": "who you are. This was a great topic Tim and it was brought to you by none other than Loot Crate. Okay. Tim, would you classify yourself as a geek, gamer, or pop culture nerd? I would crate. Then Loot Crate is the subscription box for you. Every month there is a different theme which are all inspired by classic movie and video games releases as well as pulling from pop culture franchises. This month they're bringing you a fight for the ages. Suit up, choose your allies, and enter the arena for combat. They put combat in all big letters. So you know they're serious about this one. It's [ __ ] getting down there. Ready to stand their ground this month with exclusive items from Blizzard. Fallout 4. God, we can't stop thinking about. Hold my hand. I need help. Capcom sponsor worthy loot from the Hunger Games. Oh, you like that? As well, it's like in at the end of Superman 2 when Superman crushes Zod's hand and then kills three people and everybody's like, \"Oh, no big deal.\" Hunger Games as",
            "start": 5220.24
        },
        {
            "text": "Hunger Games. Oh, you like that? As well, it's like in at the end of Superman 2 when Superman crushes Zod's hand and then kills three people and everybody's like, \"Oh, no big deal.\" Hunger Games as well as a few more items that will help their winners emerge victorious. Whether you're risking your life in battle or taking no prisoners in the wasteland, our loot will be at your side to help things be interesting. Basically, Loot Crate is a friend who knows you and loves you and surprises you with awesome presents every month. Did we mention they shipped to over 13 different countries, too? You have until the 19th at 9:00 p.m. Pacific to subscribe and receive that month's crate. And when that cut off happens, Jack, that's it. It's over. So, go to lootcrape.com/kindfunny and enter the code kind of funny to save $3 on your new subscription today. I don't think that Jack was I add Jack every time and Jack tweets at me and thanks me every time. So, I like it quite a bit. Jackie Trenton. No,",
            "start": 5259.36
        },
        {
            "text": "of funny to save $3 on your new subscription today. I don't think that Jack was I add Jack every time and Jack tweets at me and thanks me every time. So, I like it quite a bit. Jackie Trenton. No, I wish his His Twitter account's been quite a long time. Greg, before we get to the next topic, did it ever bother you that they felt the need to have Gene Hackman's character, Lex Luthther, be like, he switched it. He was great, but it was happening out here. No, he explains it for like my dad in the audience. My dad's like, \"Oh, that's every time I see that, I'm like, we we got it, man. Thanks for he had to be there. I had to drive it home.\" You know what? You're a real pain in the neck. Falls to her death. That was unfortunate. Just my topic. Yeah. Now it's heady, so stick with me. Okay. I said, \"What is real adulthood like?\" Now, this we've talked about adults. When do we knew we were adults and da da da. This one comes from a different track. Couple weeks ago, I wake up feeling great.",
            "start": 5299.2
        },
        {
            "text": "\"What is real adulthood like?\" Now, this we've talked about adults. When do we knew we were adults and da da da. This one comes from a different track. Couple weeks ago, I wake up feeling great. Have a cup of coffee, sit down with my Rachel Ray magazine, spread them out, look through them for the recipes for the week, take my photos, assemble. And Rachel Ray every day is the best magazine I've owned since he jam weird. It's the best subscription. You first off, you said don't try to play it tough in front of your internet friends. The other day you were talking about how you you like how much I cook and you you like you think that's cool. I do think it's cool. Thank you. [ __ ] her. It's odd that you choose Rachel Ray magazine and spreading her out across and spread it out like you're used to be evangel evangelical about Dr. Barbecue of course. I ain't I ain't [ __ ] on Dr. Barbecue. Dr. Barbecue Dr. Barbecue Barbecue book out there. Best book I've ever read. That's a good book. There",
            "start": 5342.0
        },
        {
            "text": "to be evangel evangelical about Dr. Barbecue of course. I ain't I ain't [ __ ] on Dr. Barbecue. Dr. Barbecue Dr. Barbecue Barbecue book out there. Best book I've ever read. That's a good book. There was an animal farm and and Batman. Yeah. I do it. I'm like I have the whole thing assembled. Christine went and did something and I'm like, you know what? While you go do that, I'm I'm going to go to the produce market, get some good produce on the way over there. I'm going to go to Starbucks. I'm going to get I'm going to get myself a pumpkin spice latte, then go to that, do that. I'm going to tell you about pumpkins. They're great. I don't care what you say. And they were my avocados. And then then she was going to come back and then we were going to go to the real store and stuff and store and I'm checking out at the real store, the grocery store. I bought some nice meats for these Rachel Ray dishes I had that were fantastic. I'll have you, you know, good meat case at the real store.",
            "start": 5380.48
        },
        {
            "text": "and I'm checking out at the real store, the grocery store. I bought some nice meats for these Rachel Ray dishes I had that were fantastic. I'll have you, you know, good meat case at the real store. Yeah, Andronicles knows what's up. They got this. Those are my dudes back there. I know, right? They're all so nice. Oh, I love them. Um, you know what? [ __ ] it. We're not We're going to make you food today from And No, we're going out. Uh, I'm checking out though and I realized that it's like now I don't know 4 5 on Sunday or whatever. I've spent my whole day doing these chores or whatever. or watch the bears, I guess, in the morning when I must have been doing something else. I've done all these different things and I realized I wasn't grumpy or mad. And I realized how rare this was cuz normally when I'm at the grocery store, I am [ __ ] furious to be at the grocery store. This is taking me away from playing a video game or whatever the [ __ ] it is I want to do for 45 minutes. But I",
            "start": 5425.04
        },
        {
            "text": "when I'm at the grocery store, I am [ __ ] furious to be at the grocery store. This is taking me away from playing a video game or whatever the [ __ ] it is I want to do for 45 minutes. But I realized this had been a weekend that fell in where there was no game that had its hooks in me. I'm I'm of course waiting for that which won't be named. And so I was like, \"Oh, this must be this is what it's like to be a real adult. This is what it's like for normal human beings who aren't mad when they turn on their system and have to update something or like cuz I still act like a [ __ ] child when I'm like I turn to Christie, I'm like, \"You want to go?\" And I like cooking. I enjoy cooking quite a bit. It's very fun. But I'll turn to I'm like Sunday. I'm like, \"Do you want to go to the grocery store?\" And she's like, \"Yeah.\" And I'm like, \"Fine, let's go. I'll get the Rachel Ray magazine.\" Going to I don't understand what's so bad about going to the grocery store. I hate these chores that take",
            "start": 5464.24
        },
        {
            "text": "And she's like, \"Yeah.\" And I'm like, \"Fine, let's go. I'll get the Rachel Ray magazine.\" Going to I don't understand what's so bad about going to the grocery store. I hate these chores that take me away from doing the fun stuff I want to do. We work ourselves too hard. That's all. We've talked about that a million times, right? So, it's like we talk about games all day, so all I want to do is play games, but then the end of the day comes and it's we got to edit this video or we're running over here to do this or we're setting something. You know what I mean? It's like by the end of the day, I'm like, \"Fuck, I want to watch Supergirl.\" Well, I'll fit in the first half in while I eat breakfast in the morning before I run off to get ready for, you know what I mean? Like, so by the time it actually gets to now, it's the weekend. I always feel like it's the weekend. [ __ ] everything. [ __ ] everyone. All I want to do is sit here in my boxers and play this thing, but there was no game.",
            "start": 5500.64
        },
        {
            "text": "actually gets to now, it's the weekend. I always feel like it's the weekend. [ __ ] everything. [ __ ] everyone. All I want to do is sit here in my boxers and play this thing, but there was no game. And I was like, this must be what it's like to be a real adult. Freedom. And then I went to Nashville last weekend and went with a bunch of my friends from Missouri who all still they're married and they live in they live in places they own and they have jobs they like, but then just stop at 5:00 and they go home. I'm like, \"Oh, you're real adults, too.\" And they were all talking about kids. And I'm like, \"Am I not a real adult?\" And I know we always make the jokes about being man babies and stuff, but are we [ __ ] up? Like, are we going to look back one day? I don't I don't think I will, but I worry now. Their babies are our video games. They enjoy that [ __ ] They love that [ __ ] They have their dogs. They go to dog parks. Maybe, maybe not, though. I still think that I still think that",
            "start": 5530.0
        },
        {
            "text": "I worry now. Their babies are our video games. They enjoy that [ __ ] They love that [ __ ] They have their dogs. They go to dog parks. Maybe, maybe not, though. I still think that I still think that people angry about that. Guys specifically, I don't I don't really pretend to have any insight into the female brain at all. I don't even know if I want it to be perfectly honest because it's terrifying to me. But I feel like every guy has that thing they'd rather be doing. But I think to your question or to answer your question, adulthood is that you have to prioritize What was that? A sex reference? No. Okay. Oh, no. I just mean like I like to go home and I just like to watch I like to watch Netflix. I like to watch Arrow on Netflix, right? But when I go home, you don't like watch to watch Netflix. You like to look at what's on Netflix and not watch anything. Well, I like to blade through Netflix and add things copious amounts of things to my instant, which my wife has now figured out",
            "start": 5563.12
        },
        {
            "text": "Netflix. You like to look at what's on Netflix and not watch anything. Well, I like to blade through Netflix and add things copious amounts of things to my instant, which my wife has now figured out how to take things off of my instant queue. Now it's a battle. Now it's a war and I'm losing. She's got more time on her hands. She's closer to the house. Um, I know. I realized I could do it online, too, but it's not the same experience. It's not the same. It's not the same experience. the same experience. We were about to say, \"Oh, Nick, did you know that you could do it for me?\" That's what Nick was doing on his phone every time he's using the phone on this show. Monster Squad, right? Not far from it. No, but I feel like when you're when you're a kid, you just get to like that's your world. Your world is all the fun things and then you got to go to school for a little bit, but you don't really have to pay attention to anything. You don't have a lot going on. When you're an adult, you",
            "start": 5601.2
        },
        {
            "text": "Your world is all the fun things and then you got to go to school for a little bit, but you don't really have to pay attention to anything. You don't have a lot going on. When you're an adult, you have to balance your time. And that is what adulthood means to me. It means when I go home, I'm going to walk through the door and I'm going to be like, \"Cool. Now I can just watch TV.\" No. It's time to pay your taxes. No. Also, you said you'd go to the grocery store with me. No. And these are not things that I necessarily like or dislike. It's just you've got When you were a kid, I think it was like everything was a little more compartmentalized. And when you're an adult, you have to deal with all of it at once, right? And then you get to like midnight, you're like, \"Fuck, I'm too tired.\" And sometimes I come in here super tired and I'm like, sometimes I fight it. I'm like, \"Fuck it. I'm staying up till 3 o'clock in the morning. I'm watching every movie as many arrows as I want to watch",
            "start": 5637.2
        },
        {
            "text": "sometimes I come in here super tired and I'm like, sometimes I fight it. I'm like, \"Fuck it. I'm staying up till 3 o'clock in the morning. I'm watching every movie as many arrows as I want to watch tonight, right? And then the next day I come in and I'm prickly and you guys are like, \"Why is Nick pissed off?\" And I leave him alone or whatever. Um or Greg's prickly and I'm prickly and then we start yelling at each other and then we're fine. Everyone's prickly after that. Um we're rarely prickly on the same day. Yeah, it's true. Everybody's usually prickly on their own. Yeah. Um but yeah, I mean that's that's what it is to me is like I do the same thing. Like I I actually enjoy going to the store. I like spending time with my wife and doing those things. But in the back of my mind, I'm like, would I rather be at Trader Joe's right now or watching TV or watching a movie? I'd rather be watching a movie. It just sucks. You got to balance it out. I think yes. But you have to find that all.",
            "start": 5670.16
        },
        {
            "text": "would I rather be at Trader Joe's right now or watching TV or watching a movie? I'd rather be watching a movie. It just sucks. You got to balance it out. I think yes. But you have to find that all. No. Period. I mean, but you're not quite an adult yet. To be fair, you and Kevin are still manchildren. Well, I mean, here's the thing. I get the errands done usually by use of Kevin, but um yeah, it's like I I don't like this going to grocery stores. Good lord, please. No. Amazon, God bless you. That's the thing. Make everything good for me. Before I got sick, I was getting my groceries delivered from Safeway. And it was a [ __ ] golden age to be alive. Like nine bucks and I just order online, everything shows up like dynamite. And then when I got I got sick. I came to a little case of cancer. And Christine's like, we're eating organic. We're working to a nice grocery store. And I was like, I just not Safeway's fault. Never play with Safeway. But then and then I got better and now it's",
            "start": 5700.64
        },
        {
            "text": "And Christine's like, we're eating organic. We're working to a nice grocery store. And I was like, I just not Safeway's fault. Never play with Safeway. But then and then I got better and now it's just like, well, I do like the nicer store better. But it's the nicer store. You were right about Andronicos. Eating organic is meaningless. It doesn't mean to do anything, but it makes you but it makes you but it makes you feel better. You've been there the fle those moments when you first get cancer and it's just everything's fault. It's everything. We're to throw away this. My cancer was not as serious as your cancer. Sure. But you had it. I did have cancer. The uh Oh, you want more? Yeah. Um if you don't mind, Alex, it's yours. You brought it as a gift. No, thank you. Uh here's what I want to tell you about what you're talking about. I got something to say to you. That's all you're going to get. That's fine. It's not We don't have much show left. Only another two hours. we what is",
            "start": 5741.76
        },
        {
            "text": "want to tell you about what you're talking about. I got something to say to you. That's all you're going to get. That's fine. It's not We don't have much show left. Only another two hours. we what is adulthood like? Is adulthood good, bad, whatever. I can tell you with with certainty that what we're living is adulthood, per se, but not really adulthood. Now, I'm gonna I'm gonna say something about people with kids and all this kind of stuff. I always kid around, so I'm just going to kid around again and say anyone who tells you that they have kids and a family and they like it. Yeah, I'm sure you do. Uh now, uh now I wish I hope to God anyone that's listening to this podcast, please pause it, go watch the video version of that just to see Colin's face when he says that. Yeah, sure. Sure. Anyway, everyone's like, well, I always I always bust my my friends who have my friends who are married or have kids, whatever. I always bust their balls like I'm like, \"What? So, how's it going?\" I'm",
            "start": 5776.64
        },
        {
            "text": "everyone's like, well, I always I always bust my my friends who have my friends who are married or have kids, whatever. I always bust their balls like I'm like, \"What? So, how's it going?\" I'm like, \"Oh, it's such a blessing and stuff.\" And I'm and I'm like, \"Oh, it must have been awesome not being being a slave to this [ __ ] infant.\" Yeah. Meanwhile, I'm getting up whatever I want. I'm doing whatever I want. Disdain from here. Just Oh, we got to cut off all the expenditures for things we like and start putting them in a college fund so this [ __ ] one day drug addict can go to rehab. We ain't going to college. The great lie forced on humanity out of evolutionary need is the fact that you should have kids and enjoy it. Uh, I'm only kidding. I'm probably going to have kids one day and it's going to be just as miserable experience as everyone else. Although, I will not fake it. I'm just Someone's going to be like, \"What's it like to be?\" Lord knows Colin Mori. Someone's going to be",
            "start": 5818.64
        },
        {
            "text": "it's going to be just as miserable experience as everyone else. Although, I will not fake it. I'm just Someone's going to be like, \"What's it like to be?\" Lord knows Colin Mori. Someone's going to be [ __ ] honest about this [ __ ] Someone's going to be like, \"What is it like having kids?\" And I'll be like, \"It's as awful as you think it is.\" Yeah. Um, but jokes aside, I think that we live in a very insulated We live in a very insulated industry. I I've talked to Cheryl about me and my girlfriend about this where um she our connection to the people we grew up with on the island, a lot of them are married or divorced now. Uh they have kids and stuff and and and she often is the one that says we we you live in a fantasy world specifically and it's not only you. It's not like she's not pointing at screen. She's like, \"All of you.\" Yeah. Like everyone, you know, is in the same world where you all pretend that you're normal. But in fact, none of you are normal. None of you are doing normal",
            "start": 5852.88
        },
        {
            "text": "at screen. She's like, \"All of you.\" Yeah. Like everyone, you know, is in the same world where you all pretend that you're normal. But in fact, none of you are normal. None of you are doing normal things. And you're so insulated in your own bubble that you don't realize that it's not normal to to, you know, live with your friends at 31 years old and own a business talking about video games. None of you are married. None of you have kids. None of you want to get married or have kids. None. Well, Nick wants to get married or Nick is married. Even that, you know, you talk about no regrets, you know, that's neither here nor there. So, I actually think that, you know, being serious now, not telling jokes, but being serious is that people really do derive pleasure out of having kids and having a family and stuff like that. And by 30, 31, 32, 33, the the die is cast for a lot of people. And so, there's a lot of there's a lot of freedom, but it's also just unrealistic. Like when I tell you,",
            "start": 5889.28
        },
        {
            "text": "a family and stuff like that. And by 30, 31, 32, 33, the the die is cast for a lot of people. And so, there's a lot of there's a lot of freedom, but it's also just unrealistic. Like when I tell you, and I'm not kidding around with you, like when I'm like, \"Greg and I might live together for five or 10 more years.\" I'm dead [ __ ] serious. Like I could see a future where in two years Greg and I don't live together. And I can see a future where in 10 years Greg and I indeed still live together. Mhm. When we're in our early 40s and that to us is normal because then we look around San Francisco and it's like everyone it's expensive. No one lives by themselves unless they have like, you know, a rent control department or blah blah blah. So I think that our gauge of adulthood is just is way a skew. And so our do we have valid complaints about adulthood that everyone would have? Yeah. paying bills sucks. Being responsible for X, Y, and Z sucks, paying your rent, paying, you know, paying your",
            "start": 5937.28
        },
        {
            "text": "And so our do we have valid complaints about adulthood that everyone would have? Yeah. paying bills sucks. Being responsible for X, Y, and Z sucks, paying your rent, paying, you know, paying your taxes, it's all awful. It's all sucks. It's all just everyone robbing you basically. Um, and uh, you know, but at the same time, like, we don't have the real rigomearroll of of of adulthood, which is about that's where I agree. Like, I bust people's balls about their kids and stuff like that. Of course, they love their kids and they have a good time being parents, whatever, but I couldn't imagine living in a situation where I can't just wake up whenever I want. Like, Cheryl is the one who bust my balls all the time. She's she says like she's like it really is all about what you want. And I'm like but I'm not a selfish person. She's like I'm not saying that. I'm saying that your whole life is what you want. Like you don't have anyone to answer to. Yeah. There's no restrictions. She's like you",
            "start": 5969.36
        },
        {
            "text": "but I'm not a selfish person. She's like I'm not saying that. I'm saying that your whole life is what you want. Like you don't have anyone to answer to. Yeah. There's no restrictions. She's like you own your own business. You are your own boss and you have no kids. She's like I moved out so you don't have to deal with me, you know, except for on weekends or whatever. She's like she's like which is enough. And uh and she's like so she's like it really is she's like you just wake up when you want. You go to bed when you want. You do what you want. You eat what you want. You watch what you want. You listen to what you want. You want to go out to a restaurant one day with your friend. You do that. You want to go to a movie. You do that even though your friends aren't telling you insistently enough on what movies you should see. So you're not going to the movies quite enough to tell you we should come get you next time. Remember when I tried to go to a movie with you? I know. But the",
            "start": 6006.72
        },
        {
            "text": "enough on what movies you should see. So you're not going to the movies quite enough to tell you we should come get you next time. Remember when I tried to go to a movie with you? I know. But the problem is you're [ __ ] mad. We got the wild card which is my wife. We got the wild card which is my wife. She's like this. I think we should go to a movie today. And I'm like, well, and then there's no there's just nothing you can say. What can you say? I promise. I told her, \"Good. Go see it again. Go see it again.\" And then what happened? Everyone Tim's girlfriend came to town and torpedoed that. And then what happened? Kevin is his [ __ ] [ __ ] He had to go there, too. The Olive Garden, no less. I can't believe you guys went to the Olive Garden. Do you guys not realize that it's the [ __ ] unlimited pasta time? It only lasts for a month. I've only been there four times. Tim, I'm doing it wrong. Oh my god. Hey, we should go tonight to the Olive Garden. [ __ ] Christ. Hell yes. We're not",
            "start": 6043.36
        },
        {
            "text": "unlimited pasta time? It only lasts for a month. I've only been there four times. Tim, I'm doing it wrong. Oh my god. Hey, we should go tonight to the Olive Garden. [ __ ] Christ. Hell yes. We're not going We're not going to the Olive Garden tonight. Was not expecting. You know what? We're going to Hey, you came all the way to San Francisco. So, I'll say that like So, I'll say that like being married, having kids, even though marriage, you know, ends more often than not in divorce. Looking forward to that time. Yeah, I'm sure that you do. I read it. How much of the business is she going to take? Oh, she only gets my percentages of it. That's it. Half of your percentage. gets half of whatever I own. She gets it all. She gets everything. That's going to be fun. She shows up one day in a power suit. We're like, \"Ah, no. It happens.\" Uh, so I I just think that the the whole, you know, people really do enjoy having, you know, again, jokes aside, people enjoy having their families and",
            "start": 6084.64
        },
        {
            "text": "a power suit. We're like, \"Ah, no. It happens.\" Uh, so I I just think that the the whole, you know, people really do enjoy having, you know, again, jokes aside, people enjoy having their families and having their kids and marrying, settling down, buying a house, having a job and a career, having a 9 to5, cutting it off, then working in the yard, painting the [ __ ] house, doing, you know, I mean, like, these are normal everyday things. And I shook my head before when you were asking like, \"Will we regret it?\" But yeah, we might. I don't think I'm going to because just like but this like I was weird to be in the grocery store and not be like I need to get home and get some trophies. I was just like wait a second. Is this what everybody back in the middle of the country feels like? No, they don't care about trophies. The the Well, that's what I meant. No, they don't know the relief. And I'm not and I'm not and I'm not judging you at all. I'm telling you that I'm right there with you. Uh",
            "start": 6122.4
        },
        {
            "text": "don't care about trophies. The the Well, that's what I meant. No, they don't know the relief. And I'm not and I'm not and I'm not judging you at all. I'm telling you that I'm right there with you. Uh but it's the conundrum. It's the conundrum of the of the industry we're in and how we all grow up together and we've all kind of and I'm not saying us at this table. I'm not saying us as the old IGN crew, which, you know, Tim, you know, was a little late to, but was still, you know, very much part of that crew of that same mentality of we're all in this together, and this is all normal. Trust me, this is all totally perfectly normal what we're doing together. We hang out all the time together. We go to bars together, we see each other constantly. None of us are in committed relationships. And this is totally normal. And when you just go anywhere else, go to a wedding in another state, go see your family, go, and you're like, \"No, this is not normal at all.\" And so, do I think that I I'll",
            "start": 6154.88
        },
        {
            "text": "this is totally normal. And when you just go anywhere else, go to a wedding in another state, go see your family, go, and you're like, \"No, this is not normal at all.\" And so, do I think that I I'll have a regret? Yeah, maybe. What are you going to regret? Because anytime I hang out with any of my friends that aren't the people you just described, the conversation usually goes, \"Oh man, I haven't seen you for so long. How you doing?\" \"Oh man, everything's [ __ ] awesome. Let me tell you about this cool thing I did and this cool thing I did. Next week I'm doing that cool thing. How are you?\" No. It goes, \"I'm good. Have you seen this show on television or these 15 other ones?\" And I'm like, \"No, I didn't even want to watch Walking Dead. Then I have one Touchstone to go with.\" But you're you're ignoring the obvious. which is that you're not always going to be 25. We're not always going to be in our early 30s. We're eventually going to be 50. And you damn well believe that I'm not going",
            "start": 6189.76
        },
        {
            "text": "ignoring the obvious. which is that you're not always going to be 25. We're not always going to be in our early 30s. We're eventually going to be 50. And you damn well believe that I'm not going to be talking about video games for a living when I'm 50 years old. You know, I but I but I can't be because who's going to because who's going to relate to the 50-year-old? Many people like But that's the thing. I I listen to Kevin Smith. The man's like well into his 40s at this point, right? Like Kevin Smith made like seven movies that are like classics. Yeah, but he's influential and he's a tastemaker and I still care about what he has to say. I'll still care about what you have to say about games later. I mean, because you also have the wealth of knowledge from the beginning of video games to bring along with you. So, you and I'm not trying to disparage the art of talking about games. What I'm saying is is that is is it a viable path forward for us to assume that in 20 years we're going to",
            "start": 6227.68
        },
        {
            "text": "along with you. So, you and I'm not trying to disparage the art of talking about games. What I'm saying is is that is is it a viable path forward for us to assume that in 20 years we're going to be doing this, you know, and I don't I don't I can't imagine me doing this in 20 years, you know. So, it's it's I think it'll change and evolve. I think all of us like we always talk about it if this all goes right kind of funny builds into something in an empire and we bring in new people and they're doing their shows and does and they start taking over the here's the contemporary view on games or this or that and then we have paid off and yeah it is us just doing what we want when we want and if that is all behind the scenes or if it is doing a show like this see I have a bunker mentality and I don't mean that in a psychological way. I literally want to live in my bunker. So literally so how so how can I get to that bunker as soon as possible? by then you question. Yeah, you're missing out",
            "start": 6260.48
        },
        {
            "text": "don't mean that in a psychological way. I literally want to live in my bunker. So literally so how so how can I get to that bunker as soon as possible? by then you question. Yeah, you're missing out by then and we're all gonna have VR and we'll just be able you'll be all [ __ ] podcasting that way and be there. Yeah, I want like just like virtuosity. If they can already do it with around the horn, we could do it like that. You can be in your bunker down there. Have a little chalkboard behind you. Sure. I'm making a Woody page reference. I understand that. Thank you. Uh the uh Yeah. So, I'm not disparaging talking about games at 50. You can talk about games when you're 80. What I'm saying is is that is that like a viable path forward? In other words, are is everything going to evolve forward with us? I ask a lot of these questions. Um, which is why I've talked about, you know, the whole Tonight Show reference or the Tonight Show analogy that I always use, which I think is like a super",
            "start": 6294.16
        },
        {
            "text": "with us? I ask a lot of these questions. Um, which is why I've talked about, you know, the whole Tonight Show reference or the Tonight Show analogy that I always use, which I think is like a super important reference, um, in the sense that, you know, it it shouldn't be about us in the future and and won't be and, uh, at least not about me. I don't know about you guys. I mean, it's not going to be about me. It'll be about Tim. I mean, it's going to be about us. It's about everyone but you. Here's my thing. I don't believe this for one second. Until you are actually not on it, I won't believe it because you seeing is believing. You're good at it. Very true. You passion. There's no reason to do that. It is my passion and I am good at and I appreciate that. What I'm saying is that is it realistic? That's that's the question about our life is realistic. That's exactly the point is that nothing that we are doing is realistic. So we don't have we don't hear proper normal reality is is my",
            "start": 6326.56
        },
        {
            "text": "That's that's the question about our life is realistic. That's exactly the point is that nothing that we are doing is realistic. So we don't have we don't hear proper normal reality is is my best friend who's a [ __ ] finance accountant or whatever. I don't even the hell he's in finance. He's in accounting. It keeps changing and it means nothing to me. But then Yeah. So when he's 50 and is he going to be doing that [ __ ] Yeah. Well, yeah, because he's in sucks for him. I'm so sorry. No, some people like it. He might be a CFO or he might be if he likes it. Liking your babies and [ __ ] You don't really like your babies and you really don't like your accounting job. Well, that's the the thing with you, Colin. I know we're kind of a little off topic, but the the idea of you doing it at your when you're 50 first show, he didn't know we get off topic. No, I know. I know. But the the idea of you doing this like what we're doing or some iteration or some evolution of what we're doing when",
            "start": 6363.44
        },
        {
            "text": "when you're 50 first show, he didn't know we get off topic. No, I know. I know. But the the idea of you doing this like what we're doing or some iteration or some evolution of what we're doing when you're 50 might seem ridiculous, but that's because no one we know is doing that. But it doesn't mean that when you get to that, it won't be awesome. Like you might be that person that everyone's like, you know, like you watch uh what is that show you Mike or any of those shows like those guys are still talking about sports. Sure. And they're not young anymore. That's a great and that's a great point. you know, and the reason, but again, the reason why they're so important and and seen as experts because been doing it for so long and they've been around sports for so long, they have that mature outlook. And granted, they're still, you know, every time I tune in one of those shows, they're busting each other's balls just like we do. So, and I really are the Cornheiser and Will Bond of video",
            "start": 6407.68
        },
        {
            "text": "outlook. And granted, they're still, you know, every time I tune in one of those shows, they're busting each other's balls just like we do. So, and I really are the Cornheiser and Will Bond of video games. Yep. You really are. I'm Mike Wilbon. Oh, yeah. Just making sure. Yeah. Oh, yeah. You know, uh, yeah. So, no, it's just I see your point, though. I mean, I feel like Well, it will evolve and hopefully it'll evolve to a point where Kevin can run the company and I can walk around rock one of my underwear in the back of every shot and it'll be hilarious. Like there's old man Nick again. We haven't seen him in a week. The other the other he's wearing the tree trunk boxers. The other thing that I mean this has nothing to do with adulthood, but maybe it does in a sense is that the cuz maybe it's about not letting go of some of your dreams, but the road doesn't end here for me either, you know? So, it's it's like it will end with me in terms of like I always want to own a piece of this",
            "start": 6441.36
        },
        {
            "text": "it's about not letting go of some of your dreams, but the road doesn't end here for me either, you know? So, it's it's like it will end with me in terms of like I always want to own a piece of this business and always be a part of it and stuff like that, but I want to do other things. I want I want to be able to leverage my hard work now to do cooler things or not cooler because I don't think it's going to be much cooler than owning your own business with your friends, but I want to write a book. I want to I want to like, you know, chill. I want I really do like when I say I want to retire like as early as possible. [ __ ] it. I'm dead [ __ ] serious, you know? And people are like, \"What do you want to do?\" Like people always tweet me. It's like it's a common question. What do you want to do when you retire? And I'm like nothing. That's the point. Nothing. Yeah. Everyone's I want to travel the world and work on my, you know, get my handicap down and all these kinds of things, you",
            "start": 6474.64
        },
        {
            "text": "to do when you retire? And I'm like nothing. That's the point. Nothing. Yeah. Everyone's I want to travel the world and work on my, you know, get my handicap down and all these kinds of things, you know, in golf. And I'm like, we'll see what happens, you know, like on a day-to-day basis. Maybe I'll maybe I'll get up and watch daytime TV one day. Maybe I'll just not get up at all one day and just see how much how much Price is, right? Do you think you're going to watch? Oh my god. And that's what I was saying. I've said it before. My uncle's like my uncle my uncle Mike is like my my [ __ ] he's like he's like my le he's a legend. He's like my hero because he just retired and he's he's in his 50s and and I asked him that same question. I'm like, \"What are you going to do? You going to play a little golf? You going to travel?\" He's like, \"I'm not doing anything.\" And he was dead [ __ ] serious. He's like, \"I'm not doing anything.\" And I'm like, \"Oh, man. God damn it. You're a legend.\" I",
            "start": 6504.88
        },
        {
            "text": "a little golf? You going to travel?\" He's like, \"I'm not doing anything.\" And he was dead [ __ ] serious. He's like, \"I'm not doing anything.\" And I'm like, \"Oh, man. God damn it. You're a legend.\" I didn't think that was an option. Yeah. I'm like, \"You're a legendary.\" He's like, like, I mean, he's got he just built a house, got all the money he needs. He's just hanging out, you know, and I'm like, \"Fucking a, dude. That's the life.\" Because he worked really hard, you know, and uh so I want to work really hard and and build something. But I don't know. I think you can do it all. I think I think you can use this springboard. I think that's the whole point of this, right? because we're it's small now, but we'll use it as a springboard to grow and and do all the things we want to do. And I have two points here. [ __ ] what's normal. Seriously. You know what I'm saying? Like just because everyone else does or whatever lives their life, however, I've seen so many of my friends and just",
            "start": 6537.84
        },
        {
            "text": "I have two points here. [ __ ] what's normal. Seriously. You know what I'm saying? Like just because everyone else does or whatever lives their life, however, I've seen so many of my friends and just people I know do the exact opposite of normal. A perfect example, one of my friends, finance major, decided to not take a job because he wanted to finish writing a script he has. Now he's funded it and he's writing it, making it, got a movie coming out. Good for him. That's that's something that people who want to do that don't get to do, you know? Yeah. And had he gone with the normal thing of like, no, I'm, you know, take this job at a bank, go with it. Like, he'd be [ __ ] miserable. Yeah. He'd be really good at spreadsheets though, you know, Excel. Like, nobody's I mean, it's just stuff like that. It's like everyone tells you what's normal or what to do. [ __ ] that. Do what you want to do. I mean, take care of yourself and all, but like at the end of the day, if you're not happy with",
            "start": 6572.88
        },
        {
            "text": "that. It's like everyone tells you what's normal or what to do. [ __ ] that. Do what you want to do. I mean, take care of yourself and all, but like at the end of the day, if you're not happy with what you're doing, it's just you're [ __ ] up. That's that's the only thing I can say there. And about kind of funny itself, the reason I felt comfortable dropping the money to come see you guys is because I really do think this is going to last. I it it does remind me a lot of the beginnings of something big. Mhm. You know, I I go back one summer I I went back and listened to all of Rooert's podcast and just seeing how they had no idea but the vague idea, you know what I mean? Or other similar things. And I I I really do think it's going to last because there's just something about it that that it's very rare to see people as engaged as the community here is. And that that has to count for something. Yeah. No, I mean, you're a huge part of it. the fact that you'll come out and take a chance",
            "start": 6619.2
        },
        {
            "text": "it's very rare to see people as engaged as the community here is. And that that has to count for something. Yeah. No, I mean, you're a huge part of it. the fact that you'll come out and take a chance on those. Those are my two points. No, they were great. They were really good points. I'm taking no further questions. To your point of Oh, you want to dismiss Kevin? Go for it. No. See, this was something I wasn't expecting. Every time you guys you do whatever to Kevin, I see a little part of him dies. No. No. He's been dead for for a long time. I I just We killed him. It's It's like It's like that thing when you're playing a video game and you're just like, \"Oh, it's just one of the peasants in Skyrim. I'll just hit him.\" I can't bring myself to do it. Like, thank you. I would feel bad about, you know, shoes filthy. God damn it. No, I I also did not realize you guys aren't [ __ ] around about how distracting he is. Oh, I know. Look at him. He's playing he from Oddworld. And then the",
            "start": 6669.12
        },
        {
            "text": "you know, shoes filthy. God damn it. No, I I also did not realize you guys aren't [ __ ] around about how distracting he is. Oh, I know. Look at him. He's playing he from Oddworld. And then the best. The best is when he there was a there was a moment of terror in his eyes today where he thought his his leg was stuck underneath the computer and on top of that where I saw him shift out and he couldn't move it and like he was trapped in a bear trap. Gotcha, Kevin. All right, great topic, Greg. That topic was brought to you by none other than patreon.com/kindfun. I wanted to give a shout out. Uh, we put up the exclusive episode for October, right, the day this post we're recording this. So, there's an exclusive episode up if you're a patron. All you have or if you're not, you can go get them. You get all the exclusive episodes we've ever put up. This one though was uh me interviewing my dad. That was very special. So, thank you all for being I think that is one of the coolest things we've",
            "start": 6711.36
        },
        {
            "text": "You get all the exclusive episodes we've ever put up. This one though was uh me interviewing my dad. That was very special. So, thank you all for being I think that is one of the coolest things we've ever done. Yeah, that was a really cool, but is it worth the dollar? Oh, I can goddamn guarantee this one's worth the dollar. He tells other stories and he throws me under the bus quite a bit. So, I highly recommend it. He I was like because I thought he'd defend me like dad they think I'm weird and they want to come make a documentary. He's like yeah I can see it. I'm like god damn it dad like he was like that makes sense. It's valuable footage. I was going in the documentary. Yes. It's your turn to take us home. What's your topic? My topic is I was going to interrupt. Yeah. But I thought you just I was going to let you go. I didn't want to be an unnatural interrupt. Just interrupt. It's interrupting. What the [ __ ] is wrong with us? You opened his mouth. You opened your mouth.",
            "start": 6760.4
        },
        {
            "text": "you just I was going to let you go. I didn't want to be an unnatural interrupt. Just interrupt. It's interrupting. What the [ __ ] is wrong with us? You opened his mouth. You opened your mouth. Interrupt me. I did. And I'm sorry that I'm interrupting you now. Your topic is You don't get it. You don't get to do You don't get to pick it. You don't get to pick it. Your topic comes from the community at patreon.com/kindfunny. Christopher Ball submitted a topic. He said, \"Hey, best friends. So, I would like your I would like your help.\" My topic was going to be real dirty, by the way. Kind of [ __ ] that changes a man. Marriage. Marriage. Christopher Ball. Everybody. Hey, best friends. So, I would like to help you guys revisit topics that you said quote we can revisit on another topic cuz we do that a lot. We do. Since I am still catching up on all the Game Over Greggy show, I believe I am on episode 73. I'm hoping that y'all haven't said these yet. He gave us a list to choose from. The",
            "start": 6795.76
        },
        {
            "text": "do that a lot. We do. Since I am still catching up on all the Game Over Greggy show, I believe I am on episode 73. I'm hoping that y'all haven't said these yet. He gave us a list to choose from. The one I've chosen is Nick defend Watchmen. Apparently, somewhere between episode 1 and 73, Watchmen came up and I think it was the trailer episode. But we're talking about best trailers ever. We're talking about Zack Snider and we're talking about watch the muse trailer. The trailer has me I mean I liked watching man. That was one of those I have this weird thing where I you know I don't really read that much. I don't really open books that much. So as far as I get as the graphic novel and the Watchman of course is is a very famous and popular graphic novel by Alan Moore I say. Um but I had not heard of it. I had seen the posters. I had seen the smiley face with the blood and I was like that's cool whatever. Wasn't until I started IGN someone's like oh they're making this a movie. I was like",
            "start": 6839.44
        },
        {
            "text": "of it. I had seen the posters. I had seen the smiley face with the blood and I was like that's cool whatever. Wasn't until I started IGN someone's like oh they're making this a movie. I was like that looks like a dope movie. And they're like, \"Well, you know, it's, you know, it's based on a book.\" And I'm like, \"I didn't know that.\" No, I don't [ __ ] Why the [ __ ] would I know that? But so I went back and obviously read the book. I'm like, \"I'm going to read the graphic novel before it comes out.\" And I watched the movie and I was like, \"This is a really cool interpret like almost a frame by frame interpretation of what I read minus, of course, a couple things that you kind of should I thought should be changed. Uh, namely the ending was a little bit weird and it kind of made more sense, I think, in the in the movie.\" and they cut out some of the the newspaper stuff and all that stuff which I which I thought honestly I mean if we're being honest dragged like crazy when you read the",
            "start": 6878.96
        },
        {
            "text": "I think, in the in the movie.\" and they cut out some of the the newspaper stuff and all that stuff which I which I thought honestly I mean if we're being honest dragged like crazy when you read the book. So I watched it I was like this is really really cool and I think everyone went back and watched the Watchmen or everyone that saw the Watchmen was like that didn't know the original source material probably was like this is a really shitty superhero movie because they're just getting their ass kicked the entire time and they're kind of like the guy's kind of fat now and I don't understand what's going on in that but that's not what it's about. It's really is. It's sort of a it's using those old tropes of superheroes to sort of have more of a deeper meaning as far as what what what's happening in, you know, in society. I thought it was a good film. See, I'm with this is the this is the thing about it is that I'm with you. I've always liked Watchmen. I went and saw Watchmen, enjoyed",
            "start": 6910.64
        },
        {
            "text": "in, you know, in society. I thought it was a good film. See, I'm with this is the this is the thing about it is that I'm with you. I've always liked Watchmen. I went and saw Watchmen, enjoyed it, and left. I of course am a huge comic nerd. I've I've read Watchmen, but I I you know, I'm I'm coming of age in the 80s or whatever. I don't read Watchmen till late. probably I want to say college somewhere and then I read what is the date of publish let's look it up I feel like it was 808 is what you're saying I was I think it was before me okay yeah like I did I did a weird one that thing like watchman also holds a special place mark because I think because of that I was like oh there's also these awesome like graphic novels from back in the day that I should read and I went back and read one called the dark knight returned and I'm like that was worth it published in ' 86 and 87 collected in ' 87 so I get to it late and it's already it's a classic. It's one of the best things ever written",
            "start": 6943.44
        },
        {
            "text": "called the dark knight returned and I'm like that was worth it published in ' 86 and 87 collected in ' 87 so I get to it late and it's already it's a classic. It's one of the best things ever written da da da and I read it and I enjoy it but I don't have it's what we were talking about earlier in this episode where people have built it up to such a state that by the time you get to you're like I'm reading a classic like it was good it was fun I enjoyed it but it wasn't like I didn't feel changed when I left it. You know what I mean? So I never had the attachment to Watchmen that so many people did. Went and saw the movie thought it was great. And then I don't I think it's the opposite actually. You're talking about people coming in going that was a boring superhero movie. For me, it seems like everybody who loved Watchmen hates the movie. That seems that seems to be the reaction I get. I think there's so there's three different camps because I think there's the people that knew",
            "start": 6985.2
        },
        {
            "text": "seems like everybody who loved Watchmen hates the movie. That seems that seems to be the reaction I get. I think there's so there's three different camps because I think there's the people that knew nothing about the book or the movie and that's what he's talking about. Like my friends were like, \"This is a shitty superhero movie.\" Okay? You know, whereas for me, I knew about the book, but I didn't uh read it until after I saw the movie. And I'm right there with you guys. I loved the movie and I thought the I liked the changes that they made. But then there is the third camp, which is the loudest camp, which is, \"Oh, [ __ ] the movie. You changed the [ __ ] The book's better. How could you do this? Whatever. So, I think those are the real three things. Yeah. Yeah. I don't know too many people that didn't like either of them. Either the book or the movie, you know? Yeah. I don't I mean, I don't think I've ever It's It's also sacrilege to talk [ __ ] about the the book, the graphic",
            "start": 7019.44
        },
        {
            "text": "people that didn't like either of them. Either the book or the movie, you know? Yeah. I don't I mean, I don't think I've ever It's It's also sacrilege to talk [ __ ] about the the book, the graphic novel. Like, it's one of those it's it's a it's such a classic at this point that people instantly like it whether or not they've read it, right? They talk about it as as though it were like uh sacred. I I liked it. You know, it wasn't I thought it was a cool story. I like seeing it unfold and I also was very very interested to see what Zack Snder was going to do following up 300 which I think this was the follow-up film to it and I think he also got a lot of [ __ ] for that too because everyone's like oh he's so good at visuals but he can't tell a story is [ __ ] telling a great story here you just don't like the story and see like here's I'm looking I want you know I put in Watchman sucks and came up with a whole bunch of [ __ ] reviews right and here's one that's pulled from uh Noah",
            "start": 7054.64
        },
        {
            "text": "you just don't like the story and see like here's I'm looking I want you know I put in Watchman sucks and came up with a whole bunch of [ __ ] reviews right and here's one that's pulled from uh Noah Berlatsky he says one of the most telling characters is Rorchack in the comic he's repulsive and ludicrous a tiny man with lifts in his shoes. He suffers from major sexual problems and his disguise is a street person whose placard reads, \"The end is nigh.\" The backstory makes him both more likable and less admirable. The moment in the comic, when he threatens his land lady is uncomfortable. But the next panel where he spares her because of her child who reminds him of himself as a boy is extremely poignant. Snder all loses some of this. We glimpse Rochack and his civies wandering around with his sign, but it never coheres. Viewers never viewers new to the story might not even realize this nutty doomstit this nutty doomsayer is the vigilante's alter ego. All we're left with is another",
            "start": 7090.16
        },
        {
            "text": "his sign, but it never coheres. Viewers never viewers new to the story might not even realize this nutty doomstit this nutty doomsayer is the vigilante's alter ego. All we're left with is another coolish [ __ ] dark hero kicking ass in glossy martial arts sequences doing the dirty work of justice. Like maybe and like I you'd have to tell me on your first viewing how much of it you put together for me. I guess maybe that's the cheat is that I came in knowing the real story, the backstory, everything about it, knowing the characters, not being like these are I love them. They're [ __ ] perfect. You know what I mean? Like I understood all that. I I thought it was communicated. I mean, to be fair, like watching it, I didn't get everything watching it the first time, but I remember wanting to watch it again because I instantly knew I was like, I didn't catch everything in that. Like, I do think that there was a lot of subtleties and stuff. And I think that the soundtrack that the movie had",
            "start": 7129.52
        },
        {
            "text": "it again because I instantly knew I was like, I didn't catch everything in that. Like, I do think that there was a lot of subtleties and stuff. And I think that the soundtrack that the movie had was [ __ ] exquisite and it really added to it. It enhanced the whole experience overall. And it's like one another one of the moments that a lot of people hate on is the sex scene. Hallelujah's playing and like it's just like I liked that. It felt right. It felt like he nailed the tone of the comic in movie form, which there's no songs in the [ __ ] comic book. Like adding that stuff is going to change things, but I think that they changed things in line with what the story was. Sure. Um, but yeah, I mean, at the same time, a movie is only so long to make sacrifices. Yeah. Whereas this graphic novel is, you know, there's a lot more information. There's a lot more opportunities. And what Colin was talking about on the last couple topics, it's like it kind of leaves a lot more up to you. Nick",
            "start": 7170.32
        },
        {
            "text": "is, you know, there's a lot more information. There's a lot more opportunities. And what Colin was talking about on the last couple topics, it's like it kind of leaves a lot more up to you. Nick was talking about the storyboard thing where you kind of fill in the blanks. Guess what? All the subtleties and stuff you're talking about filled in aren't these crazy things you see in your head. It's what the movie was. Yeah. You know. Yeah. Yeah. I mean that and that's the thing. It's the same when they it's it's always the same when they take great books and how many how many times have you heard someone say, \"Well, the book is always better than the movie.\" Right. Exactly. which is going to be. Of course, it's going to be because you have an infinite amount of pages with which to write this story and to develop these characters and to go anywhere you want to go with it. But guess what? No one would sit in a theater if they knew the movie was going to be six hours long or seven hours long.",
            "start": 7211.92
        },
        {
            "text": "and to develop these characters and to go anywhere you want to go with it. But guess what? No one would sit in a theater if they knew the movie was going to be six hours long or seven hours long. They would have to break it up. It would have to be a trilogy and then it's a whole rig roll and they're not going to do that with The Watchmen, right? Um so you have two and a half hours really to capture people's attention and tell the story. And so you have to as the as the screenwriter or as the director, you have to really pick or as the editor because maybe they shot all that stuff and the editor was like, \"Dude, we can't this is like a three and a half hour movie. Maybe we got to like chop this part out where he's just sitting there begging on the street for [ __ ] 25 minutes because it develops his character.\" Um, which by the way, I felt that's that's a complete [ __ ] The character, how many [ __ ] shots do you have to see of him? We saw him as a bum and then we see his face at the",
            "start": 7246.8
        },
        {
            "text": "his character.\" Um, which by the way, I felt that's that's a complete [ __ ] The character, how many [ __ ] shots do you have to see of him? We saw him as a bum and then we see his face at the end. We see him in jail. We see all these things. We knew it was him. It's ridiculous. Sorry. No, that's dismissed. Noah's dismissed. No way. You're dismissed. Well, hold Let me try it. Yeah. Right. Um, did I nail it? Nailed it. Crush it. Crush it. It's as good as my Detective Lance impression. What's your Oh, that was a good impression, though. Why does he have a New York accent? Tell me this queen kid over here. Comes back the same time Arrow does. Have you noticed that he sits a little too close to everyone in Arrow? It's always He's always He's here. Yeah. Still can't tell here. Well, I just mean I just mean in general. He goes he always sits down next to Laurel and he's like Laurel and he's way too Ernst way too earned in everything doesn't matter. No, the way he says Laurel though he's",
            "start": 7279.52
        },
        {
            "text": "mean I just mean in general. He goes he always sits down next to Laurel and he's like Laurel and he's way too Ernst way too earned in everything doesn't matter. No, the way he says Laurel though he's like it's like [ __ ] watching it's like Columbbo out of Columbbo and put it in and that's and that's him. Um yeah I mean I thought it was good. But Alex, we What do you think? What do you think? What is your take on watching movie? Man, did you love the comic? No. Well, there you go. Okay. I I I So it was adequate. It was an adequate reproduction. Kevin's doing the lean in thing. You got to lean in. I I don't really have I mean, Watchmen didn't hate it, didn't love it. Yeah, it was one of those things. It was very forgettable. I I don't know. That's That's the only thing I can really say about it. It wasn't any fault of its own, but at the time I remember there was just a lot of stuff I was more interested in. And I I I feel like I might have been taking a a Vietnam War literature class",
            "start": 7321.36
        },
        {
            "text": "it. It wasn't any fault of its own, but at the time I remember there was just a lot of stuff I was more interested in. And I I I feel like I might have been taking a a Vietnam War literature class at the same time. So, it was one of those just like this [ __ ] again. Like I read so much stuff about that in so many random ways pertained to Vietnam that I was just for for a couple months I was just done numbed out. M I I exactly I it got to a point where like I was playing I was playing I I remember like later on I was playing Black Ops 1 and I got to a point I was like I can't do this can't do this too much straight to multiplayer and I I'm I never do that for Call of Duty. I used to beat him on veteran. No one ever does that for Call of Duty. Skip the single player campaign and go straight to multiplayer. I used to always do the the single player on veteran and then start in because I felt like it made me better at the multiplayer. Yeah, sure. You know. Yeah. And and up to Black Ops,",
            "start": 7363.04
        },
        {
            "text": "to multiplayer. I used to always do the the single player on veteran and then start in because I felt like it made me better at the multiplayer. Yeah, sure. You know. Yeah. And and up to Black Ops, they had some interesting stories in there. Modern Warfare one was pretty interesting. And I don't know. I just I think that was a large part of my reaction to Watchmen was just this [ __ ] again. Well, I feel like it's also one of those things where you look back and I don't I wasn't reading comics in ' 86. I don't think I was reading anything in ' 86. Um, so it's one of those things where we've seen now the sort of the turn from comics being about superheroes like Superman or Batman or, you know, the classic superheroes to let's peel that back a little bit and let's tell a really dark, [ __ ] up story and really dive into the psyche of this guy that's like living on the streets or, you know, his alter ego is a bum, but he's also a vicious, vicious, vicious v vigilante. Um that might have",
            "start": 7412.08
        },
        {
            "text": "up story and really dive into the psyche of this guy that's like living on the streets or, you know, his alter ego is a bum, but he's also a vicious, vicious, vicious v vigilante. Um that might have been I don't know and maybe people can correct me uh but that might have been one of the first of its kind to really tell a story like that and have be brutal and [ __ ] up and main characters die and like yeah it it definitely hit like a resonance with people where you were saying that it led you to Dark Knight which me too like it was it was around that time period where I realized like oh comic books aren't just this monthly thing where there's just like a bunch of [ __ ] and ongoing stories where there's continuity nothing makes sense like the essentially to me comic books in my mind before I started reading them because I didn't get into comics until maybe like six years ago. Before then, I just thought it was just, you know, images and words versions of the animated '90s shows, you",
            "start": 7453.44
        },
        {
            "text": "I started reading them because I didn't get into comics until maybe like six years ago. Before then, I just thought it was just, you know, images and words versions of the animated '90s shows, you know, I was just like, \"All right, it's just more.\" Sure. Um, but then once I I found out about Watchmen and then Dark Knight Returns, I was like, \"Oh, shit.\" Like, there are stories being told that are really awesome and, you know, there's they're dark and there's thought put into them and they really they make you think. And I think Watchmen is one of those things where watching it like I the whole time I was like, \"Fuck, I don't know what's going on. That's good. I should be thinking about this.\" You can't just like, you know, glaze over like you guys were talking about Superman and like how it explains to you exactly what's happening. Watch doesn't do that. Switch places. I I see. I don't know why. Now you're Jeff Goldman as Jean Hackman. That'd be amazing. Uh but Watchmen doesn't hold",
            "start": 7492.0
        },
        {
            "text": "it explains to you exactly what's happening. Watch doesn't do that. Switch places. I I see. I don't know why. Now you're Jeff Goldman as Jean Hackman. That'd be amazing. Uh but Watchmen doesn't hold your hand in that way entirely. I mean, it's a movie, so that you know there it has to have a plot that makes sense, but there's a lot of subtleties. There's a lot of metaphors. There's a lot of things that are once you get it, once you're watching it with that frame, you're like, \"Oh, this is great. This makes sense.\" If you're just watching it, you're like, \"That's a bad superhero movie.\" But that's the thing, and you know, I think it's also harder for like it the older it gets, I think, the harder and harder it's going to be to put in context like when it came out as as an original story and then the movie, right? By the time the movie had been made, we had seen other things like that. And so it's very difficult and it's always really really hard and I don't I don't want to go down that",
            "start": 7532.0
        },
        {
            "text": "then the movie, right? By the time the movie had been made, we had seen other things like that. And so it's very difficult and it's always really really hard and I don't I don't want to go down that rabbit hole of saying like no it was great because it was great for its time but because I think the watchman does still hold up. I think I think you could read it now and be like that's actually a really cool story but at the same time I don't know like when that movie came out if people were I don't know if it was as shocking as it was supposed to be right and maybe people just didn't resonate with it. I think that was remembering it now. I think part of my issue was the pacing and the fact that everyone seemed to tell me it was going to be shocking. It just wasn't. Once they give you once you're told something's going to be something, you go in thinking in Yeah. And and it was just I remember I remember there were parts of it where I was watching the movie and I was like really that",
            "start": 7572.8
        },
        {
            "text": "you're told something's going to be something, you go in thinking in Yeah. And and it was just I remember I remember there were parts of it where I was watching the movie and I was like really that that's when you want to do that. Oh, okay. I mean it just again it was mostly because everyone told me, you know, yeah, this is going to be great. Blah blah blah, you know, whatever. And I remember a lot of it just like missed beats to me. I was like I feel like there's you went from A to C. You know what I mean? There there there's I know why you had to but I would say it back the A, you know, I would I would say in this for that analogy though that A and that B and C were on the same, you know, side of the different sides of the same fence, right? They're not necessarily linear thing. I I would think that they they go in a direction purposely opposite of where you think they should go. Not necessarily a pacing reason, but like the whole story is about how these characters were living one",
            "start": 7609.52
        },
        {
            "text": "think that they they go in a direction purposely opposite of where you think they should go. Not necessarily a pacing reason, but like the whole story is about how these characters were living one life and then realizing that life was completely like different or contrary to the to what it should have been and then revisiting that like even even it's a bold choice to take your main character and I can't remember if he was this way in the movie. I think he was and make him overweight for 90% of he was you know he has this yeah old man who was like this super fit guy when he was like doing it back in the day and now he's kind of old and fat and slower and re in reliving those glory days doesn't really work for him in the way it's even if it's even supposed to right in traditional stories he's supposed to get fit and go out there and kick ass and that's just not the story if that's what you're looking for you're not going to like this movie yeah and I think those were some of the things",
            "start": 7653.44
        },
        {
            "text": "supposed to get fit and go out there and kick ass and that's just not the story if that's what you're looking for you're not going to like this movie yeah and I think those were some of the things it did right but a a bit of it was they I remember the one like real thing I left that movie with was they asked me to care at the wrong points. They I near the beginning, you know, there's the whole open I I guess it's spoilers for the first five minutes of the movie. Yeah, we're don't worry about it. You can spoil watch the the comedian it's thrown out a window and everyone, you know, I I understand you're not supposed to know that a comedian does. Yeah, that whole thing it was just like and they're slowly explaining it and all but it's like I I just don't give a [ __ ] The dude gets thrown out of a window. It's like you're asking me to eventually care and I'm like that's the thing. That's why it's so good because you at first you're like that's weird. I didn't know that guy and then you",
            "start": 7690.96
        },
        {
            "text": "of a window. It's like you're asking me to eventually care and I'm like that's the thing. That's why it's so good because you at first you're like that's weird. I didn't know that guy and then you get to know him in the comic books at least. I can't remember how the movie played out. You start to get to know him. You're like this guy's not a likable guy. That's still the And then they somehow Alan Mo somehow makes you care about that which is just really weird. It's good storytelling I thought. But you're right. Maybe the movie did have I mean the movie I'm always shocked by just the amount of hate that movie gets. You know what I But I think it's a Snyder thing overall. I think it is a I think people like really kind of hate on him. People love hate over the top levels. But I mean even at the time it felt like people hated him and you didn't even know. Yeah. But well but even then though I think that was kind of the it was around the time when everyone just started hating him and",
            "start": 7732.64
        },
        {
            "text": "at the time it felt like people hated him and you didn't even know. Yeah. But well but even then though I think that was kind of the it was around the time when everyone just started hating him and like that was the point where 300 and 300 is awesome and it's a similar trailer very visually like inspired. The other thing there is like oh my god 300 is the coolest thing and then it became cool to not like 300 and then you see this. I think that's what it was. I love 300. 300 was hilarious. I never liked 300. I never watched 300. I can completely understand why you wouldn't. I can No, I I really can. My wife because because too stylish. I watched Sin City uh Dame to kill for which I surprisingly liked. I liked a lot more than I thought I was going to like cuz it got [ __ ] on. Um and I thought it was actually pretty good. I'm like, I don't people's problems with this. But it's that style. People just can't get into it. It's like that purposely really really cartoony style. I I love 300.",
            "start": 7768.8
        },
        {
            "text": "it was actually pretty good. I'm like, I don't people's problems with this. But it's that style. People just can't get into it. It's like that purposely really really cartoony style. I I love 300. I even liked the the second one, Rise of an Empire. That story could have been told in such a cool way and it wasn't in my opinion. It was such a waste. I I remember watching you should go back and read the graphic novel. It's awesome with Mark Ryan. I remember at IG he and I went and watched it and I was just like what a waste. I think you might be missing out on what it turned out to be because if you watch it as a comedy, you'll be very entertained. If you that and Troy if you watch them as Troy I did see as well. If you watch them as comedies at one point in Troy, take it. It's yours. Take it. Brad nuts. He Brad Pitt just looks at a whole army and yells, \"Is there no one else?\" And I just lose it every time. It's hilarious. He stood in front of a ton of people and did that and and",
            "start": 7805.44
        },
        {
            "text": "Take it. Brad nuts. He Brad Pitt just looks at a whole army and yells, \"Is there no one else?\" And I just lose it every time. It's hilarious. He stood in front of a ton of people and did that and and everyone expected like you're gonna be in the theater like Achilles and I'm just like I'm just like what the [ __ ] Brad Pitt doing? He's looking dope in that [ __ ] cool [ __ ] The same thing in 300 girls. They bring out Xerxes on that giant. Every time I see that dude, I just start laughing. Well, that that purposely was supposed to be kind of a weird vlog. He was supposed to be kind of an androgynous sort of weird looking ethereal character. I like 300. I got into it. I can see why you wouldn't I can see why you wouldn't like Watchmen either, but just go in now. I would say I'm going to give it another watch. Go in with your expectations set to it not being a superhero movie and you might like it a little bit more. And and for the love of God, stop giving Zack Snider so much [ __ ]",
            "start": 7839.76
        },
        {
            "text": "give it another watch. Go in with your expectations set to it not being a superhero movie and you might like it a little bit more. And and for the love of God, stop giving Zack Snider so much [ __ ] He's a good He's a good filmmaker. I'm with you on that one. Everyone just for some [ __ ] reason he became like when he hit Yeah. He hit the market with 300 and it's exactly what you're talking about. The [ __ ] trailer came out and everyone was like, \"This is going to be the coolest movie ever made.\" And then people saw it and they were like, \"Wow, that's really stylized. I didn't like it, but instead of\" and I loved it. I loved 300. I still think it was a great film just because I like that that it was different and they were trying something new. But then everyone turned that hate into like mega hate. Like Zack Snder was supposed to be the second coming of Christ and he let everyone down. And that that stigma unfortunately has followed the guy. It's only the loud people that I was",
            "start": 7887.28
        },
        {
            "text": "like mega hate. Like Zack Snder was supposed to be the second coming of Christ and he let everyone down. And that that stigma unfortunately has followed the guy. It's only the loud people that I was going to say cuz his movies keep making money. Keep making DC and Warner Brothers keeps giving him movies. So it's like I'm sure he's like Go ahead. I suck. You're right. [ __ ] Batmobile. See you in hell. I'm I'm I'm crying in my own private Starbucks. You know what I mean? Whoa. It'd be dope if you had that. Yeah. All right. Good topic. Nick Christopher Ball. Well, thanks. You did a good job defending it. It was so good. Yeah. The topic got sponsored. Is it sponsored? It is. Who do you think sponsored it? Hell yeah. Squarespace. Squarespace. Our friends at Squarespace. You You built our website with Squarespace. I did. It looks very good. It's not bad. It's not bad. I like a lot. I like I like Squarespace. I swear by mine. I mean, look, if you don't feel like going out there and and and",
            "start": 7920.32
        },
        {
            "text": "with Squarespace. I did. It looks very good. It's not bad. It's not bad. I like a lot. I like I like Squarespace. I swear by mine. I mean, look, if you don't feel like going out there and and and learning uh HTML or any other sort of coding programming or any other sort of web language, use Squarespace. It's easier. I don't know what the hell I'm talking about, but guess what? I made a website. Squarespace provides simple, powerful, and beautiful tools to make websites that look professionally designed regardless of skill level. No coding required. See, not only does Squarespace provide you with intuitive and easy to use tools to create your website, Michael heads on the other side. People are laughing at me. Who's laughing at you? These two over there. Eggnook. I'm laughing with egg and uke. Egganuk. What? Who are they? I don't know. I was about to give you so much credit for not interrupting this. And then yeah, interrupted. Squarespace also has state-of-the-art technology powering",
            "start": 7958.72
        },
        {
            "text": "uke. Egganuk. What? Who are they? I don't know. I was about to give you so much credit for not interrupting this. And then yeah, interrupted. Squarespace also has state-of-the-art technology powering your site to ensure security and stability. And you know you can trust in Squarespace for your website needs. When millions Oh, is this the Is this the What is this? This is the Viper. Why is he so tired today? That's just Partillo. You're just being a You're just being weird. Uh when millions of people in respected brands around the world trust him, too. Seriously, you can't beat the ease and simplicity of Squarespace. Squares Squarespace gives you 24/7 online support, a beautiful website. So, what are you waiting for? Start a trial with no credit card required and start building your website today. When you decide to sign up for Squarespace, make sure you use the offer code kind of funny to get 10% off your first purchase and to show your support for us. Kind of funny. You know who also",
            "start": 7994.72
        },
        {
            "text": "today. When you decide to sign up for Squarespace, make sure you use the offer code kind of funny to get 10% off your first purchase and to show your support for us. Kind of funny. You know who also went to Squarespace? No. My friend Scott. He made a website for his movie. What up, Scott? What's his movie called? Nico. The movie is called Nico. Short film. Nico Cousin. Nico. Yeah, it's uh nikothemov.com. It It looks really good. Very excited for it. Lot a lot of people I know worked on it. I think it's going to turn out really well. All right, take it home, Colin. Build it, beautiful. Ladies and gentlemen, this has been the Game Over Greggy Show. If you didn't know, each and every week, four, sometimes five best friends gather on this table. Each bring a random topic of discussion for your amusement. If you head over what No, if you like that, head over to patreon.com/kindfunny just like our friend Alex did to support us. You get each and every episode early. And if you don't have any",
            "start": 8035.36
        },
        {
            "text": "amusement. If you head over what No, if you like that, head over to patreon.com/kindfunny just like our friend Alex did to support us. You get each and every episode early. And if you don't have any bucks to toss this, it's no big deal. Head over to youtube.com/kindfunn where we post the show topic by topic day by day until we give the entire thing away as a giant video and giant MP3. Did you have fun? Yes, I did. Are you hot? It's hot in this room. See how we're talking about how hot it is. Okay. Maybe it's just because you Austin [ __ ] I I don't know, man. Look at even Kevin. My dad's from Egypt though, so maybe naturally adapted to maybe. What did you show him the episode about being when we were like what we wanted to be buried in our tombs? No episode. Oh, that's probably the best. No, no, actually he probably watched him. I I remember this is going to make you guys feel old. I'm sorry. It's okay. Focus on Kevin. Kevin just scratched his armpit for the better part of five",
            "start": 8080.96
        },
        {
            "text": "best. No, no, actually he probably watched him. I I remember this is going to make you guys feel old. I'm sorry. It's okay. Focus on Kevin. Kevin just scratched his armpit for the better part of five minutes. I just want you. Did that make you feel old? No, it just would kind of he's a distraction. Pros and cons with him. My dad one time came in when I was in like middle school. Started talking about you should read this article on IGN by this guy Greg Miller. I really like his writing. Your dad did not come in. Yes, he did. Why is your dad reading IGN? Because my dad is a nerd. Oh, that's awesome. Much like myself. Shout out to Mr. Aziz. Yeah. Well, he's probably not watching. You should show him this part, not the other horrible parts we did. Yeah. Okay. Okay. Then he'll go watch the other horrible parts though and then I'll be in trouble. Today's episode also gave us right before we came in to record it. Not right before, but today Colin was saying that he's starting to like",
            "start": 8119.04
        },
        {
            "text": "the other horrible parts though and then I'll be in trouble. Today's episode also gave us right before we came in to record it. Not right before, but today Colin was saying that he's starting to like Portill more and more. And I think it now makes sense because Portillo is getting older. So Colin's starting to feel nostalgic for him just like he feels nostalgic for old places. Well, I've lived with Portillo for, you know, half his life. I know. It's crazy, right? And uh I've always liked Portillo. I just bust his balls, but he and I have our moment. I busted him the worst. But I'm I'm being more open about my, you know, my adoration of Portillo. Yeah. He's the stupidest [ __ ] on the planet. Sure. By far. But uh that's part of his charm. That's part of I don't know. He just looked at me like I belong to him now. You do. Now I can see through time. I like putting back as that fox kind of look. Like he looks like he's running really fast. Until next time, ladies and gentlemen, it's Ben.",
            "start": 8157.52
        },
        {
            "text": "I belong to him now. You do. Now I can see through time. I like putting back as that fox kind of look. Like he looks like he's running really fast. Until next time, ladies and gentlemen, it's Ben. Our pleasure to serve you. Want to give a quick shout out, though. Oh, that's fine. Go ahead. No. So, sorry. Everyone, check out Sean Twisters on Twitch. Oh, we know him. Sean Pitts. Yeah. Yeah. He's a good guy. Fun time. Yeah. If you're one of the best friends or even if you're not and just found this video, should come hang out with us sometime. You should. Are you in his chat a lot? Yes, I am. Do you have your own Twitch channel? I do, but I do not stream. Oh, okay. I'm the conductor for the rest of the community who might know me. Yeah, that's me. I've seen you in our chat. Yeah, I'm there sometimes. All right. It was that was mine. Yeah, we read your thing today. Do I ridicule you when you type things in the chat? No. Oh, no. I say intelligent. We'll change that. Until next time. It's",
            "start": 8194.0
        },
        {
            "text": "sometimes. All right. It was that was mine. Yeah, we read your thing today. Do I ridicule you when you type things in the chat? No. Oh, no. I say intelligent. We'll change that. Until next time. It's been our pleasure to serve you. Kevin, see if you like louder than that. Kevin, see if you see how I sound like this. Put the headphones on. It's tearing up my heart when I'm with you. It's a different song. And when we are apart, I feel it too. Cuz no matter what he",
            "start": 8231.92
        }
    ]
}