{
    "id": 1343,
    "video_id": "wg0y9myqIC4",
    "show_name": "Gamescast",
    "hosts": [
        "Greg Miller",
        "Tim Gettys",
        "Colin Moriarty"
    ],
    "title": "New Game Reviews and Impressions - Kinda Funny Gamescast Ep. 44",
    "description": "We give you our thoughts on Halo 5, Triforce Heroes, Yokai Watch and more, Activision buys King for a ridiculous amount of money, We discuss the current status of Kojima and Konami, and In today's landscape, what would make us preorder a game? (Released on Patreon on 11.06.15)\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1447380285,
    "duration": 5832,
    "transcript_chunks": [
        {
            "text": "Today's episode was brought to you by Squarespace. Squarespace is the easiest way to create a beautiful website, blog, or online store for you and your ideas. Squarespace features an elegant interface, beautiful templates, and incredible 24-7 customer support. Try Squarespace at squarespace.com and enter code KINDOFUNNYGAMES at checkout to get 10% off. Squarespace. Build it beautiful. What's up guys? Welcome to the first ever episode 44 of the KINDOFUNNYGAMES cast. As always, I'm Tim Gettys, joined by the coolest dudes in video games, Colin Moriarty and Greg Miller. Hi. Hello. Oh man, today's gonna be a good one. Is it? Yeah. There's a lot of research put into this one. More so than normal, I would say. You go to Wikipedia? By that I meant there's a lot of copy and pasting of articles that I'm gonna have to read at some point. But there was a lot. There was a lot of facts and details that I didn't want to just kind of be like saying words and not really know what I'm talking about.",
            "start": 0.0
        },
        {
            "text": "I'm gonna have to read at some point. But there was a lot. There was a lot of facts and details that I didn't want to just kind of be like saying words and not really know what I'm talking about. Instead I'm gonna say someone else's words and they definitely knew what they were talking about. Gotcha. So I'll sound a lot smarter. Gotcha. Smart. You know what I should do? I should just go back and just read all of Colin's articles just aloud. Then I'm just like, yeah. Like old ones from IGN? Why the hell would anybody want to know about what's happened on the fucking... Here's what I've heard about the NGP. No, nobody cares. No one knows what it is. No one knows what it could be. New game portable? Next generation portable? New game portable. Wow, you're really disgrace. You're an universe. This is a show where every week we talk about video games and why we love video games and what's going on in video games and all that stuff. If you like it, you can go over to patreon.com slash kind",
            "start": 46.56
        },
        {
            "text": "This is a show where every week we talk about video games and why we love video games and what's going on in video games and all that stuff. If you like it, you can go over to patreon.com slash kind of funny games. Throw a few dollars our way and that can get you the show early every week and get you exclusive episodes every month. That's pretty damn cool. I said this last week and I'll say it again. The episode I did with Colin one on one where I interview him about his gaming history. One of my favorite things we've done so far. So you should definitely check that out. If you don't want to give us money, that's cool. Youtube.com slash kind of funny games. Every week you'll get the show topic by topic on the youtubes until the last day. You'll get the full video or you go to itunes.com slash kind of funny. Get it in audio forms. You can listen to it and let it just dance with your inner inner ear workings and that'll be a fun thing to do. And then maybe they hear Greg talk about the",
            "start": 85.04
        },
        {
            "text": "kind of funny. Get it in audio forms. You can listen to it and let it just dance with your inner inner ear workings and that'll be a fun thing to do. And then maybe they hear Greg talk about the new game portable and it'll be good. Yeah, I prefer to just go back and read Colin's articles because that's actually correct. Yes. Okay. So what do you guys call it? I don't know what you call it. It's the next generation portable. That's what I said the second time, but I think new game portable is more what it's called because it's then it's a combination of Batman, which debuted new game plus. You probably guys don't remember that when Batman didn't debut new game plus. Yeah, he did. Batman invented, Batman himself invented new game plus. Lucius Fox invented it. What's the earliest game you remember? New game plus. I was about to say my first, the first one I ever encountered, it was Final Fantasy 10 2. I know it was before that, but that was the first time I came across Chrono Trigger was",
            "start": 119.3
        },
        {
            "text": "New game plus. I was about to say my first, the first one I ever encountered, it was Final Fantasy 10 2. I know it was before that, but that was the first time I came across Chrono Trigger was the first game I remember. I mean my mind that I remember having something called new game plus. Yeah, but I don't mean, I mean, Zelda had, you know, well second question. I remember, I mean, I think in Chrono Trigger it is called new game plus and I wonder if that's where could be wrong about that, but I think so. I remember correct. We're the first people to call it new game plus. Yeah. One that's interesting. A little piece of what is the ones after that? What's in between Final Fantasy 10 2 and Chrono Trigger that have used new game plus and called it that. Yeah. Huh? In between. So like in between 94 and 2003. Yeah. Um, shit. I don't know. Yeah. I don't know. Let us know in the comments. What was the first game that you had a new game plus in? It's an interesting question. Yeah. Just an",
            "start": 158.74
        },
        {
            "text": "94 and 2003. Yeah. Um, shit. I don't know. Yeah. I don't know. Let us know in the comments. What was the first game that you had a new game plus in? It's an interesting question. Yeah. Just an interesting piece of trivia. It can't be Chrono Trigger. Chrono Trigger couldn't have made it up, but that's, that's definitely like the earliest one I remember. I mean it could have. Yeah. The term, I'm not saying the idea of playing the game again, because like you said, the Legend of Zelda, the original one had, is a good example. Yeah. Legend of Zelda really is a new game plus. Actually, it's really not. It's like a different game. Plus a new game. Yeah. Anyway, I don't know what we're talking about. What's been playing? Lots of stuff. Can't talk about a lot of it. Yeah. So yeah, end of the topic. What do you been talking about that you can talk about? Halo. Played Halo with Christine and man, I'll tell you what, Tim, I know it's just, it's not going to shock anybody on the internet. I just",
            "start": 199.26
        },
        {
            "text": "What do you been talking about that you can talk about? Halo. Played Halo with Christine and man, I'll tell you what, Tim, I know it's just, it's not going to shock anybody on the internet. I just don't get Halo. Really? I've played every Halo co-op and I've never had a great time. Really? Yep. I play them. They're fun enough. It's okay. I'm doing something together, but it's just like, ah, and like this one, the story sounded cool and I still think the story is cool. I'm like, Christine says we're six chapters in. She's like, we have to finish it. We're almost half, we're halfway through. And I'm like, that doesn't sound right. But she says it is. She's looked at her cheapos, I guess. It's just, it's just goes, it just does its thing. I think it's a good thing though. It's fun. Is it? I think it's fun. Is it? Yeah. I'm a couple of missions in. The problem I'm having is my Xbox is like flipping out. Right? Yeah. Your controller keeps disconnecting. Yeah. Every couple of minutes my",
            "start": 241.06
        },
        {
            "text": "I think it's fun. Is it? Yeah. I'm a couple of missions in. The problem I'm having is my Xbox is like flipping out. Right? Yeah. Your controller keeps disconnecting. Yeah. Every couple of minutes my controller will disconnect and it's the worst, but that didn't stop me from forcing myself to try to play. Are you playing with other people? I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm",
            "start": 276.06
        },
        {
            "text": "playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm",
            "start": 288.06
        },
        {
            "text": "playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm",
            "start": 289.06
        },
        {
            "text": "playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm",
            "start": 290.06
        },
        {
            "text": "playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm",
            "start": 291.06
        },
        {
            "text": "playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I'm playing with people. I like that there's not the same old Cortana, same old thing. Sure. But it is kind of weird that there's the teams you're with, but there's not really a back story. Unless you've read the books and know the stuff. My friends that I'm sitting in the same room with, they know. They're like, oh, this is cool, this is cool. But it's like, I don't know that. The game kind of assumes that I know more than I do. I think that's a problem. Otherwise, it's",
            "start": 445.06
        },
        {
            "text": "room with, they know. They're like, oh, this is cool, this is cool. But it's like, I don't know that. The game kind of assumes that I know more than I do. I think that's a problem. Otherwise, it's just four people on my team. And the other thing is, at least in the single player, the AI of my teammates wasn't always great. I'd tell them to do things and then they wouldn't. But I think that's a case by case basis. But I'm having fun with the game and I think it's good. And I think that the sales have anything to say about it. People are super into it. We were seeing today that it broke the record. What's the record? No one really knows what the copies are, but we know that it broke the record that they won't say. Yeah, it's so annoying. They grossed $400 million between the game and the copies. They insinuate that it also counts consoles. The bundles, yeah. Just say how many copies of the fucking game sold. Why does everyone do this? It's so annoying. You dress it up. Activision does",
            "start": 481.06
        },
        {
            "text": "They insinuate that it also counts consoles. The bundles, yeah. Just say how many copies of the fucking game sold. Why does everyone do this? It's so annoying. You dress it up. Activision does the same shit with Destiny as Jason Schreier pointed on a Kotaku. Every time they've never said how many copies of the game sold. Yeah. I don't know. I watched Greg play Halo 5 quite a bit. I was a fan of Halo 1 and Halo 2, but I wasn't a fan of their story. I like the gameplay of those games. They were really unique and special at the time, especially, I think. There just wasn't many games. There just weren't many competent console shooters in the early 2000s. There just weren't. Not like we have today. That's why I played those games. The story never really appealed to me. Halo to me always, and the reason I'm not engaged in it anymore, just from an outsider's point of view, is that it looks like a very sterile sci-fi universe in a way. It just doesn't vibe with me. I watched Greg play for",
            "start": 522.06
        },
        {
            "text": "the reason I'm not engaged in it anymore, just from an outsider's point of view, is that it looks like a very sterile sci-fi universe in a way. It just doesn't vibe with me. I watched Greg play for maybe an hour just so I can get a little taste of it. I don't get it from an aesthetic point of view, even. I don't get it. I don't get what necessarily the... I understand why people like it. I understand people like the gameplay. The multiplayer has a lot of nostalgic feelings. I'm like, Greg, I played those games at the time back in the day. I get that in a sense, but they never made me want to go back and play more. It's the same way I feel about Killzone. Until Shadow Fall came out, I really didn't like Killzone. I played all those Killzone games on PS3, or two of them on PS3. Obviously, the PS2 one was supposed to be the Halo killer. Back in the day, clearly it wasn't. I had a similar, yet different problem with those games, which was this is so gray, black and brown, and fucking",
            "start": 563.06
        },
        {
            "text": "the PS2 one was supposed to be the Halo killer. Back in the day, clearly it wasn't. I had a similar, yet different problem with those games, which was this is so gray, black and brown, and fucking boring. I kind of grudgingly went through those games so I can at least talk about them on Podcast Beyond back in the day. With Halo, I see a sci-fi universe, and I'm just like, this is just not that interesting to me. It's not like gritty, dirty, dark sci-fi like Battlestar Galactica or Mass Effect even. The worlds don't feel lived in. Everything feels like it's a set piece, and it's just this thing that I'm running through to shoot things. That's just my perspective from an outside. I did not play the game, other than trying to use a vehicle really quick, because I was laughing at Greg not being able to do it, and then I realized the controls were really bad. Well, it's Halo. Take my opinions with a grain of salt. I'm sure the game plays fantastically. See, I don't even think it does like",
            "start": 608.06
        },
        {
            "text": "able to do it, and then I realized the controls were really bad. Well, it's Halo. Take my opinions with a grain of salt. I'm sure the game plays fantastically. See, I don't even think it does like and that's in like it's just I'm totally get to come at it as the guy who's just not Mr Halo right. I play him once every time they come out and I'm done with them right, but like I was playing it in the whole time. I'm playing. I'm like man. I should just go play destiny like I'd much rather play destiny. Destiny. I like the guns better like I like that. I have my own guns. I like the world's better. I like the story better. I like the controls better. I alfredo when I learned Titanfall and he taught me like I was like I want to be good at Titanfall because I like Titanfall. Teach me your ways. Alfredo Diaz. He sat me down and you know built me from the ground up. He's like here's bumper jumper. That's the one to use them and I'm like great. Thank you. The bumper jumper in here has no iron",
            "start": 647.06
        },
        {
            "text": "Alfredo Diaz. He sat me down and you know built me from the ground up. He's like here's bumper jumper. That's the one to use them and I'm like great. Thank you. The bumper jumper in here has no iron sights on the triggers. So if I want to use bumper jumper, I still have to click in the stick to go early. No, it's clicking the stick. I believe to go iron sights and whatever. It's like this is terrible or no, it isn't sticks. It's off a button or something or whatever. It's weird to get to iron sights and bumper jumper. So then I have to go back and not use bumper jumpers and then it's just it doesn't feel right. Like none of the control schemes. I like yeah, I don't know. I guess it's one of those things. I grew up with the Halo. That is my dual stick first person shooter. Everything else is based on how that feels to me. So I play all these other games and my biggest complaint is it doesn't feel like Halo. And in terms of the look and stuff, I love the look. I love the way that the",
            "start": 679.06
        },
        {
            "text": "is based on how that feels to me. So I play all these other games and my biggest complaint is it doesn't feel like Halo. And in terms of the look and stuff, I love the look. I love the way that the enemies look compared to your characters. And in terms of the story, I don't think anyone's claiming that the story is this like it's not Last of Us. You know, it's not I don't think people are playing it for the story in the same way that they say that about other games. For me, it's just I don't like it. It seems like people play it for the story. I like this. I like the story. I'm into it. I'm into the characters and the different like races of the characters and the classes and all this stuff. Like the war going on between the elites and the jackals and all this stuff. It's all just the little details that as you play through the games, you kind of pick up on and like the different looks between them all and all that. But I think it's just more of it's a dumb action movie. You know,",
            "start": 714.06
        },
        {
            "text": "little details that as you play through the games, you kind of pick up on and like the different looks between them all and all that. But I think it's just more of it's a dumb action movie. You know, it's like it's like Fast and Furious, like the plot of it. It's not like a revolutionary story. I still love the story. You know what I mean? It's more it's fun. I like it. It's just action movie spectacle. And Halo to me has always kind of been that. And in terms of the levels not feeling lived in, just kind of being like environments for things to happen. I like that. I like that it's very linear. It's designed like there's this course. That course is obviously to ride a warthog through. You know, there's this jump that is the point, you know, playing through when you play Super Metroid and there's the escape scene in the beginning. It's like that is designed that way. You know, all the things that you face and stuff that ship. Why would it be designed that way? It's designed that way",
            "start": 750.06
        },
        {
            "text": "there's the escape scene in the beginning. It's like that is designed that way. You know, all the things that you face and stuff that ship. Why would it be designed that way? It's designed that way just to make the escape fun. And like in Halo, there's constantly those moments. It's constantly just you need to get from here to here really fast in the warthog. And then there's like all the things along the way that are make that fun. And I've already seen that a couple of times in the limited time I put in Halo five. Well, with this game in particular, I'm interested to see when games get really hyped up. It takes people a while to gain distance from them in order to like kind of critique them in different ways. Not necessarily. So it's not to say that the initial critique is wrong, because I think the last is one of those games that I really I really loved and thought was a masterpiece. But, you know, a lot of people didn't. And they have valid critiques about the game that I think",
            "start": 782.06
        },
        {
            "text": "I think the last is one of those games that I really I really loved and thought was a masterpiece. But, you know, a lot of people didn't. And they have valid critiques about the game that I think are more and more valid. The more the more time we are distant from the last of us and the more we see different things. And so I'm interested to see, you know, there are three games come to mind that I think are going to differ in people's minds as we gain more distance from them. And one has already by shock and it's a great example of this. People were up that game's ass. And then it took a little while and then people started to see, like, I don't know about this game. Like there's this this is a great game, great story. It's fun. But there's this, this and this wrong with it. And it took people a little bit of distance to figure that out. I think Metal Gear Solid five is going to be another one of those games. I've not played it, but I see more and more significant criticism of that game",
            "start": 820.06
        },
        {
            "text": "a little bit of distance to figure that out. I think Metal Gear Solid five is going to be another one of those games. I've not played it, but I see more and more significant criticism of that game every day that from people that I trust and that people that have just gained distance and thought about it for a while. And so I'm interested to see with Halo, which I think is another one of those games, like what people think about in a year. Is it going to be one of those games like the original Bioshock that I think actually even gets better with age and people have more and more positive things to say about it? Or is it going to be more like Uncharted three, where people liked it, then they didn't then they did, then they really don't. And like and like people. So I'm interested to see what people want to know. It's definitely not going to be like a Bioshock. It's another Halo. That's the thing. Isn't it going to be Halo four, Halo three? And when was the last time anybody thought",
            "start": 854.06
        },
        {
            "text": "what people want to know. It's definitely not going to be like a Bioshock. It's another Halo. That's the thing. Isn't it going to be Halo four, Halo three? And when was the last time anybody thought about or talked about any of those games? There's Halo. Halo two is the only Halo anybody ever talked about. The thing that I acknowledge with Halo and just with with some of these Xbox exclusives, not Gears or anything that I actually care about, but like Halo, some people took issue with the fact that I said I don't care about Halo last week and I didn't have anything to say. Like, I don't know what they want me to say or you want me to pretend that I like it so we have a conversation about it. It's just not one of those things that that grabs me. So I have to look around the landscape and find the people, whether it's Ryan McCaffrey, whether it's Mitch Dyer, like people that I know, know it and see what they think about it. Same thing with Assassin's Creed. Like, I'm so jaded by",
            "start": 895.06
        },
        {
            "text": "and find the people, whether it's Ryan McCaffrey, whether it's Mitch Dyer, like people that I know, know it and see what they think about it. Same thing with Assassin's Creed. Like, I'm so jaded by Assassin's Creed that I just can't even trust my own judgment in a way on it. I need to go to the people that I trust that I know know this stuff like they would come to me for the things that I know so really well. So I'm just interested to see how it all pans out, because I think what I'm seeing in my own little social media bubble anecdotally about Halo five is that people are disappointed in it. But there's a lot of people that like it. People seem to be disappointed in the campaign. People seem to be disappointed in the campaign's length, which apparently is really short. I was reading something, I think Angry Joe or something, I think there was a NeoGaf thread about how he beat the game in four hours, which is, if that's true, completely inexcusable to make a campaign four hours long.",
            "start": 922.06
        },
        {
            "text": "I think Angry Joe or something, I think there was a NeoGaf thread about how he beat the game in four hours, which is, if that's true, completely inexcusable to make a campaign four hours long. It's the same fucking problem we have with the Order 1886. I mean, the Order 1886 didn't have anything else. People buy, so it's way worse with the Order 1886 being five or six hours when there's nothing else to do in the game. That number doesn't sound wrong, right? Because Christine and I played it for one night and she says we're halfway through. I'm like, really? That's just bizarre. Yeah, but that number does, it sounds a little, that's on the fast side. I would say six hours. Yeah, I mean five to six hours even I think is too short for a campaign. I don't need games, we've talked about this in the past with The Witcher, whatever, where I think games can, like there's a definition of a game being too long and too dense. And actually someone, Kesey McDonald, our friend put up a piece today",
            "start": 964.06
        },
        {
            "text": "the past with The Witcher, whatever, where I think games can, like there's a definition of a game being too long and too dense. And actually someone, Kesey McDonald, our friend put up a piece today on Kotaku I think where she was like, I played The Witcher 3 for six months and I've gotten nowhere in it. I mean, this is my exact complaint about the game. So there's something to be said about games that are too big and too long, I think The Witcher 3, too big. Did you read her article? No. I saw the headline too. I was flagged for later. I was interested, I'm interested to see if she's going to have a positive spin on it or a negative spin. Yeah, we'll see. I mean, it depends on the density of the game and like what, you know, this goes back to a conversation I was having with some of our friends on NeoGaf and our thread about PSI Love You where I was talking about on PSI Love You how retail games, I think will become cheaper once publishers are comfortable competing with each other on",
            "start": 995.06
        },
        {
            "text": "on NeoGaf and our thread about PSI Love You where I was talking about on PSI Love You how retail games, I think will become cheaper once publishers are comfortable competing with each other on a digital marketplace. What happens when Ubisoft is like, all of our games are $50. And then EA is going to stay at $60 or whatever. The reason I bring that up is because is it possible that a game like Witcher might be even worth more because it is so big. So it's a conversation for a different time, kind of an ancillary kind of conversation. Is it worth $100? You know, but with Halo, I just I'm interested. I have to trust other people because I'm not going to play it. I'm not interested in really playing it, but I'm very interested as a student of the industry what it is and how it does, because my prediction about it, even though we were talking to Aaron when he was on the show and just kind of and for me, my feeling was like, I just don't see the hype about it. Now, the numbers indicate that",
            "start": 1025.06
        },
        {
            "text": "prediction about it, even though we were talking to Aaron when he was on the show and just kind of and for me, my feeling was like, I just don't see the hype about it. Now, the numbers indicate that I was wrong. So I want to see how people really feel about it with a little bit of distance. And that's what I'm super anxious about. It's the same thing with Bioshock Infinite. It took time before I really got down to like hearing some good criticism about it. I think Halo 5 is going to for good or for bad. I'm not saying it's going to be all bad. I'm sure people can look back at Halo 5 in two years and be like, that was great. But it also seems like they're going to continue to churn these games out. Yeah. So I'm delving about Halo is like to me a six hour Halo campaign. That sounds perfect. I don't need more than that. And also the games designed around replayability and going back legendary and the skulls and all that stuff. So it's like I think a very polished six hour experience",
            "start": 1066.06
        },
        {
            "text": "I don't need more than that. And also the games designed around replayability and going back legendary and the skulls and all that stuff. So it's like I think a very polished six hour experience would be better than an eight or 10 hour experience that have the little things missing. The problem is a lot of people are saying that this isn't perfect. You know, but what game really is. That's the other thing that these games. This is why 343 is an impossible situation. They're impossible situation for two reasons. One is that they're not the people that that gamers really want to make Halo. I mean, that's that's that's the first thing. Like, that's not their series. And and I know they've been working on it for a while, but I think they're always going to be fighting against it. It's like it's like the way people felt about Treyarch forever until they didn't with Call of Duty. Now everyone loves Treyarch, but everyone remembers when Modern Warfare came out. WB Montreal. Batman. Anytime",
            "start": 1105.06
        },
        {
            "text": "like the way people felt about Treyarch forever until they didn't with Call of Duty. Now everyone loves Treyarch, but everyone remembers when Modern Warfare came out. WB Montreal. Batman. Anytime somebody steps into a franchise somebody's already done stuff with is no matter what, it's never going to be as good as the people who made it. But I mean, I think this one is different because there is a lot of key people like the key people that worked on Halo are. Sure. I'm not saying I'm not saying the reality on the ground is true. I'm saying that they're going to always fight against this this impression that this isn't there. So I think that they're always fighting against that trend. And I also think that when you have a central IP, Uncharted is going to suffer from the same thing and Zelda is going to suffer from this. On Nintendo side, too, there are such significant expectations placed on these on these games that they almost can't be met ever. And and what I've been finding with",
            "start": 1144.06
        },
        {
            "text": "is going to suffer from this. On Nintendo side, too, there are such significant expectations placed on these on these games that they almost can't be met ever. And and what I've been finding with all of the games that I've been playing this year up till, you know, I would say Mad Max, even in a sense, like so up until the September region is that there are people think I'm jaded and I'm a little too hard on games. But I'm just finding that my mind is clear enough to see that a lot of these games are just not hitting the mark in some ways, that there's something off about a lot of different games. And I think that that's just the nature of them. They're never going to please everyone. They can be fun, but we can still criticize them. And I think that a game like Halo five has this crushing weight under it. Yeah. Especially when, you know, we're critiquing the campaign and stuff. But I think that for a lot of people, specifically the ones that actually played it, Halo four is like their",
            "start": 1177.06
        },
        {
            "text": "weight under it. Yeah. Especially when, you know, we're critiquing the campaign and stuff. But I think that for a lot of people, specifically the ones that actually played it, Halo four is like their favorite campaign. Like you look back, like everyone is different. I thought everyone on Halo two the best. But yes, the thing did they? Because the campaign that I like story like Halo two is multiplayer, but the Halo two campaign story made no sense. They added that I forgot what the character's name was, but like the weird Master Chief, not Master Chief was like the fucking thing with the tentacles and stuff. Cortana. What the fuck? Where's this even coming from? The profit storyline just was weird and not well fleshed out enough. They had the arbiter, which at the time nobody fucking liked. And then it just ended. And one of the most upsetting cliffhangers, not a great cliffhanger, upsetting. Like it was like, oh, that's the end of the game. What the hell? And so I don't know, man. I",
            "start": 1218.06
        },
        {
            "text": "And then it just ended. And one of the most upsetting cliffhangers, not a great cliffhanger, upsetting. Like it was like, oh, that's the end of the game. What the hell? And so I don't know, man. I think that these these games might even have a better campaign than those. Halo one had a great campaign, but had some really bad levels. Like the library was like a chore to get through. And especially when you're going replaying it on legendary, whether it's co-op or single player and doing all that, like these games, I think the more modern, the more designed around different things. Modern sensibilities. Yeah. And so it's like it's different. But you're right. I mean, people are they're never going to compare it campaign to campaign. It's campaign versus memories of campaign. And that will always come out on top. Nostalgia plays a factor. I, I, I, like I said, I think last week or the week before some point like I, Halo's people love Halo. I if I was Microsoft, though, I would be",
            "start": 1257.06
        },
        {
            "text": "will always come out on top. Nostalgia plays a factor. I, I, I, like I said, I think last week or the week before some point like I, Halo's people love Halo. I if I was Microsoft, though, I would be focusing on on trying to elevate something else into that into that place. So when he's going to have that problem after Uncharted, it's like, what are they going to do after after uncharted in terms of what's the marquee? Probably Gran Turismo. But it's something like Gran Turismo. But that's not even really what they need. Maybe something like Horizon River. I'm interested to see what kind of feedback they get on this game, what kind of metrics and heat mapping they find when people are playing the game in terms of like what they're doing, what they're not doing or whatever. Because I just and I'm interested also how the console sold. I'll be really interested to see the MPDs for for October and November to see what shifted hardware and stuff like that. The thing that Halo five has to",
            "start": 1293.06
        },
        {
            "text": "and I'm interested also how the console sold. I'll be really interested to see the MPDs for for October and November to see what shifted hardware and stuff like that. The thing that Halo five has to deal with, which is the same thing a lot of other shooters have to deal with, is this idea of a ubiquitous platform, this idea of ubiquity in games. Halo five has to be something very special to keep people away from Call of Duty and to keep people away from Battlefront this fall. And this is only a problem on Xbox one. This isn't a problem on PlayStation four or PC. But there's a lot of competition. There's always been a lot of competition for all these games. But I feel like the triple A tier. One hundred million dollar plus shooter is like going to be a very competitive space this fall. And I'll be interested to see like how on Xbox one, how Halo stacks up against Battlefront and Call of Duty, because people seem to be really excited about this black ops three because now they love",
            "start": 1330.06
        },
        {
            "text": "And I'll be interested to see like how on Xbox one, how Halo stacks up against Battlefront and Call of Duty, because people seem to be really excited about this black ops three because now they love Treyarch apparently. I'll never forget. I'll never forget. 2008, 2009, how everyone hated Treyarch. And I was like, I think I like Treyarch and it's all about infinity. I just stopped paying attention to that chatter in that community. And then suddenly when I was predicting that black ops three was going to fall off, a lot of people think I'm wrong because it's a Treyarch game and it's going to do great. I'm like, really? They hated Treyarch. They proved themselves. So it shows the show goes to show how I really don't pay attention to that community very much. Even though I play Call of Duty every year. So this isn't a game, but another thing that in the video game world that happened this week was the Metroid, the Skycalls short film. Oh, the Just Control Bots film. Yeah. So Just Control",
            "start": 1372.06
        },
        {
            "text": "year. So this isn't a game, but another thing that in the video game world that happened this week was the Metroid, the Skycalls short film. Oh, the Just Control Bots film. Yeah. So Just Control Bots in it. It's made by Rainfall Films, which are the same dudes that made the Zelda video for IGN back in the day. April Fool's Day, the one that like started it all. Exactly. Yeah. They made that. And they also last year made the Wonder Woman short. Nice. I'm not sure if I'm right that, you know, got like five million views, six million views. I'm not sure. So this video came out kind of out of nowhere. And what's really cool about it to me is that at IGN, like we had talked to the guy that made the Sam many times about one of the April Fool's videos being a Metroid short film. And we've always kind of had an idea of like, how would you do that? That requires such a big budget and this and that because it's different than Zelda. You know, Zelda's like, all right, let's go out to a fucking",
            "start": 1406.06
        },
        {
            "text": "kind of had an idea of like, how would you do that? That requires such a big budget and this and that because it's different than Zelda. You know, Zelda's like, all right, let's go out to a fucking green grass field. Good. Metroid. What are you going to do? Even the student loans, pretty big investment. And to see him actually make this short. It's awesome. It's awesome to see the growth of technology and how things have happened that he reached a point where he can make this happen. And he did it. And it's really cool. You guys should definitely check it out. It's called Metroid. The sky calls if you haven't already seen it. Do you guys watch it at all? Yeah. So it's it's really cool. And I like it because, you know, fan films are a dime a dozen these days. And like, especially with YouTube and like muzzle flare tutorials and all this shit, like anybody can make these things. This is the first one I've seen in a long time that I was like, oh, shit, this actually kind of impresses me.",
            "start": 1444.06
        },
        {
            "text": "and like muzzle flare tutorials and all this shit, like anybody can make these things. This is the first one I've seen in a long time that I was like, oh, shit, this actually kind of impresses me. Yeah. Any level like this looks cool. It has a really nice alien feel to it. They had a lot of film grain and it was very claustrophobic. It's creepy. It's very artistic. When they go in and get just his eyes in the Samus suit like Iron Man. That's really, really cool. It's cool. And they did a really good job with it. The music was like on point. It was like very it was Metroid when it needed to be. And it wasn't exactly Metroid at other times, which is good. They really kind of got a lot of the key Metroid stuff in the got the morph ball. They got the grappling beam and all that stuff. And it's it was cool. It was very nice. There's the Chozo, like the plot of the short made sense. It was contained. It has a it feels good. You watch it and when finishes, you're like, oh, that was worth",
            "start": 1480.06
        },
        {
            "text": "it's it was cool. It was very nice. There's the Chozo, like the plot of the short made sense. It was contained. It has a it feels good. You watch it and when finishes, you're like, oh, that was worth watching. Now, is it perfect? Absolutely not. You know, like what is anything perfect? No, you know, but even more than that, I feel like people are being a little harsh on it just because it's like, oh, this isn't right. This isn't right. But it's like this is the best Metroid fan film I think like I've ever seen. Best piece of Metroid content in years. Well, that's that's also true, you know, and it's it's really awesome. My biggest critique of it is the fact that like Samus isn't that scared. You know, like she seemed a little bit like what's going on the whole time where usually she's a little I would assume she's a little bit more of a bad ass. Usually she talks like this and then I saw the baby Metroid and I didn't know what to do and that's that Metro the other end. You're this.",
            "start": 1522.06
        },
        {
            "text": "little I would assume she's a little bit more of a bad ass. Usually she talks like this and then I saw the baby Metroid and I didn't know what to do and that's that Metro the other end. You're this. That's not the memory, but I really like it. I definitely think you should check it out, if only to have your own criticisms of it and you know, see what you have to say. Links in the description. Yeah, yeah, I'll do that for sure. That's where Kevin takes a note usually and then make sure you did it. Good job Kevin. Shout out to Sam. I'm really happy you finally got to make this project happen. Other games I've been playing, I've been playing a lot of games a little bit at a time, so I put a couple hours into a couple games, learned that a couple games weren't for me and learned that a couple are for me. Let's go. Let's start with the Guitar Hero live. We've talked about this before. I've done that. But we played a bit more over the last couple of weeks and we haven't really talked about",
            "start": 1559.06
        },
        {
            "text": "are for me. Let's go. Let's start with the Guitar Hero live. We've talked about this before. I've done that. But we played a bit more over the last couple of weeks and we haven't really talked about it. What are your thoughts? I haven't played it more since the weekend I spent with it. I brought it home. It came in on a Friday. I played it the Saturday and the Sunday of that weekend. Did a lot of the Guitar Hero TV stuff, which is I thought not that they undersold it, but they didn't. They made such a big deal about you're playing in front of the live audience, right? That I wasn't paying attention. And then they're like, oh, there's a guitar, GTTV. I'm like, all right, whatever the hell that is. I don't, you know what I mean? Whatever. And then to jump in and play it, I was like, oh, this is actually kind of awesome. And I saw people in the some of the reviews were harsh on it. Like, oh, it's a micro transaction game. And it's like for me, it wasn't, you know, for a weekend of play",
            "start": 1596.06
        },
        {
            "text": "is actually kind of awesome. And I saw people in the some of the reviews were harsh on it. Like, oh, it's a micro transaction game. And it's like for me, it wasn't, you know, for a weekend of play where I jumped in, you start earning credits, like nobody's business. And then you go and pick the songs you want and then you level up and then you get more credits. And I never spent any money to go play the songs I wanted to. They were just there, you know what I mean? But the idea of jumping in and there's just like an alt rock station that you jump in and you're in the middle of a song and you start playing or whatever. And then the next song comes up and you're going to, you know, like that, you jump out, go to the next station, stuff like that. I thought it was a cool idea. It's different, right? The big thing about this guitar hero and why I played it longer than I played rock band was the fact that this is different. This isn't, oh, I'm just playing a rock band again. Okay. That's,",
            "start": 1634.06
        },
        {
            "text": "right? The big thing about this guitar hero and why I played it longer than I played rock band was the fact that this is different. This isn't, oh, I'm just playing a rock band again. Okay. That's, that's all right. This is, I got, I'm relearning how to play, you know, it's the six buttons, you know, total three on top of the three. And I'm trying to figure out how to do that stuff. I'm doing this, the, the guitar hero TV stuff. I am playing the live shows, trying to elevate the band there and seeing what that looks like. There's a lot going on that made it feel, Hey, this is something new to learn. And that's exciting. That's interesting. My review of the game in one word is satisfying. Like I feel like the game is very satisfying. It's what I was looking for from the revival of music games where, yeah, it is relearning and recapturing that magic that I had so many years ago of, I don't know what I'm doing. Oh shit. Now I know how to do it. Oh shit. Let's make this better. Let's keep",
            "start": 1661.06
        },
        {
            "text": "where, yeah, it is relearning and recapturing that magic that I had so many years ago of, I don't know what I'm doing. Oh shit. Now I know how to do it. Oh shit. Let's make this better. Let's keep doing this. And like I was telling Colin last week on the Patrion exclusive episode, like it gives me a sense of music discovery that I haven't had in music games for years. Right. Like I'm hearing songs that I've never heard before that I'm like, I like this, who is this artist? I want to know about this. And that's great. And it's also got, has a whole bunch of music that I actually like the set list is good, especially when you add guitar hero TV like that. There's so much more to the set list than what's on the box. And it's weird. And what you're saying is right. Like they didn't do a good job of explaining what guitar hero TV is. Right. Cause you don't own those songs. They're not included on the track list. So when I first got on calling Greg live, I read the track list of Colin and",
            "start": 1694.06
        },
        {
            "text": "job of explaining what guitar hero TV is. Right. Cause you don't own those songs. They're not included on the track list. So when I first got on calling Greg live, I read the track list of Colin and he's like, that's marginally better than what rock bands was. Right. And I was like, yeah, I agree. And then I played some of those. And then you jump into the guitar hero TV and it's like, Oh, here's lit and here's this and here's all these things that weren't on the box that I liked. But then it was the same thing of like, I'm just going through, I'm like, I don't know any of these songs, but I'd stop and listen and be like, Oh, this is in, this is alternative. This is pop. This is like something I would like, and maybe I know a little bit of it, but since I'm not trying to sing it or anything else, I'm just trying to play. Yeah. Why not? And I'll watch the video in the background and have fun with it. Like it was a great distraction game. You know what I mean? The weekend it hit was",
            "start": 1733.06
        },
        {
            "text": "else, I'm just trying to play. Yeah. Why not? And I'll watch the video in the background and have fun with it. Like it was a great distraction game. You know what I mean? The weekend it hit was perfect because we were in between getting whatever the next big thing was that I was super excited for. So it was like, I have time to kill. And I played it one night. And then the next night I finished walking down, I was like, you know what? I could go for more, more songs. And I jumped on and did it again. Now that said games I've wanted have shown up since then. And I haven't played much of it at all. Right. They're just there. And it's like, well, do I hold onto this guitar? Am I ever getting back to it or what does it matter? I've had four real experiences with the game. Three of them have been absolutely awesome. I've had so much fun playing and one of the times I could not get the guitar to sync at all. And I spent maybe an hour and a half really trying to like keep sinking, keep",
            "start": 1761.06
        },
        {
            "text": "been absolutely awesome. I've had so much fun playing and one of the times I could not get the guitar to sync at all. And I spent maybe an hour and a half really trying to like keep sinking, keep playing. And I realized like it's not right. And that ruins it. Absolutely ruins it. That is something that I've seen everyone that's played the new guitar or rock band has dealt with. Yep. No. And that's the thing is like, I think we talked about it just tangentially at the table, right? When we got rock band that first day, right? We set it up and it's totally fucked. And we're all done. And you were like, I wish we just plugged in where it was just done again. And this is the same thing where, yeah, like I played for a while and then it's like what you're saying of like, I finished a song that I can do that better. I finally at the end there got the feeling for going up and down and, you know, going from black to white or whatever. I can do that. I can do that and go back and replay it.",
            "start": 1791.06
        },
        {
            "text": "I can do that better. I finally at the end there got the feeling for going up and down and, you know, going from black to white or whatever. I can do that. I can do that and go back and replay it. But then you get good enough to where it's like, well, this isn't perfect. And then you start tinkering and then it's 30 minutes of like, that's almost there, but not there. Wait, I got to wait for the ball to hit the cowbell. But when you're not again, moving this thing around and trying to fucking get it perfect and it never is perfect. Right. None of my experiences did I feel like, yep, nailed it. I was always playing maybe like a microsecond off. And then it gets in your head where you're like, I fucked that up, but did I fuck it up or is the game fucked up? And can I make it better? You know what I mean? Like that. It's like, yeah, it's like such a fucking headache to have to worry about. And I never had the problem back with Guitar Hero 2 on the PS2. Like I was just like, I just need",
            "start": 1828.06
        },
        {
            "text": "what I mean? Like that. It's like, yeah, it's like such a fucking headache to have to worry about. And I never had the problem back with Guitar Hero 2 on the PS2. Like I was just like, I just need to play it. They're giving me the song. And if I get it wrong, it's my fault. Other things, Mario Maker. Oh my God. I'm addicted to that game. Yeah, I can't stop playing. I keep going back to it. And like we did a Let's Play yesterday. That's going to, it's already live. So check that out. We did the Nintendo World Championships levels. The reason I'm talking about this now is Nintendo today is doing the update for Mario Maker, which adds checkpoints and the power up thing where if you're small Mario and you hit the power up, you get a mushroom. If you're big, you get the fire flower. Nice. That's fucking awesome. But even more than that, they're adding the, what are they called? Event mode and official maker's tab. So official maker's tab is going to be Nintendo constantly updating Nintendo",
            "start": 1861.06
        },
        {
            "text": "fucking awesome. But even more than that, they're adding the, what are they called? Event mode and official maker's tab. So official maker's tab is going to be Nintendo constantly updating Nintendo made levels, which I'm like, that's awesome. That's fucking great. And event mode is like Nintendo World Championship style things where they already did it at PAX before where they like, they made, there was like a lot of the contest to have levels or whatever. And then they put them out there for everyone to play. There's a more focused idea behind it. I'm like, thank you for making this game that I love so much. Even better. Yeah. Like man, Mario maker, the more I play it, the more I'm like, I just, I mean entirely in love with that's great. So I'm very stoked about that. Others on the Nintendo front. Yo-kai watch. Oh yeah. The 3ds games played for about an hour. It's not for me, but I can understand who it's for. This is for the people. What is this game? So it's to boil it down. It's",
            "start": 1902.06
        },
        {
            "text": "front. Yo-kai watch. Oh yeah. The 3ds games played for about an hour. It's not for me, but I can understand who it's for. This is for the people. What is this game? So it's to boil it down. It's the new Pokemon. Okay. No, it's like, it's a huge thing in Japan. Like very, very, very big. And all the kids love it. And it's the new digital monster like Digimon. They call it. Yeah. They're Digimon. That's everything. They're ghosts, ghost creature things like it's so far weird paranormal stuff going on. And then like there's one kid that sees them like you go to the trap. Do I have a proton pack? No, no, no, no, no, no proton pack. This kid goes and there's one of those, like, you know, like capsule machines where you put a quarter in like things come out like you get that. And like there's ghosts in that thing. Which are huge in Japan. Those machines. Yeah. And it's very similar to Pokemon in a lot of ways. And the it's, it's an RPG and there's like the battle systems and stuff. I don't",
            "start": 1942.06
        },
        {
            "text": "in that thing. Which are huge in Japan. Those machines. Yeah. And it's very similar to Pokemon in a lot of ways. And the it's, it's an RPG and there's like the battle systems and stuff. I don't really like the battle system. It's a, it's a little bit more like there's a lot of tapping involved and it feels like in Pokemon, you're the Pokemon trainer fighting with the Pokemon, but you still kind of feel like you're in control of the Pokemon. Whereas this one, I don't know how to put it into words. You let these ghosts out and they're just doing whatever the fuck they want. It just feels a little bit more like you're managing ghosts as opposed to using the ghosts. Even though with Pokemon, you're the Pokemon trainer. There's a different feeling. Like I, they're your slaves in Pokemon. These are sentient beings, dead grandfathers, children who were involved in bus crashes, and now you have their spirits and you have to make them fight. I do want to give a shout out to my favorite one.",
            "start": 1979.06
        },
        {
            "text": "are sentient beings, dead grandfathers, children who were involved in bus crashes, and now you have their spirits and you have to make them fight. I do want to give a shout out to my favorite one. His name is Cheeksqueak and he looks like a butt. And if he blows on you, he makes you fart. Cheeksqueak sounds like my boy. So I'm really into that, but it's things like that that make me realize like this is not for me. Like Pokemon, I will always love Pokemon because I loved Pokemon. And I've grown with that. And so there's just that with me. I don't know that I could get into this game now because it is, it's a kid game. Like it straight up is a kid game. Whereas Pokemon, I feel like I would argue it's like, oh, but adults can like it too. But it's like, maybe I'm wrong about that. Pokemon's a kid's game too. It's just that I've called it and I've called Pokemon this before and it's not an insult to it, but it is baby's first role playing game. And that is what Pokemon is. So it's it's",
            "start": 2029.06
        },
        {
            "text": "a kid's game too. It's just that I've called it and I've called Pokemon this before and it's not an insult to it, but it is baby's first role playing game. And that is what Pokemon is. So it's it's it's a great entryway and gateway drug for younger kids to get into statistical based games. But I agree with you. Pokemon can be enjoyed by adults. It is enjoyed by millions of adults around the world, including us. Me until more recently, I guess. But it's a children's game. So I wonder, I wonder, like I was, I was when we were at IGN, I was talking a lot about watching Yokai Watch on, on, on the charts in Japan and being like, this is going to be really big here. And it surprised me that it took so long to come here, but I'm interested to see how it resonates with Western audiences. I haven't, I know the review embargo was today as we're recording this, but I've not read any of them. So I don't know how it's doing, but that game fucking murdered in Japan. I mean, like it's, it's hard to,",
            "start": 2073.06
        },
        {
            "text": "I know the review embargo was today as we're recording this, but I've not read any of them. So I don't know how it's doing, but that game fucking murdered in Japan. I mean, like it's, it's hard to, it's hard to overestimate or overstate rather just how well that game did in Japan. Yeah. It killed the long time. Going back to the squeak, going back to what I was saying about the, the kids game thing, whereas I feel Pokemon is a kid's game that can be enjoyed by adults and stuff. Like it always kind of had a, yeah, it's just fun. The storyline's cool. And there's all that with this one. It does feel pretty dark for a kid's game. Like all the ghosts and all that stuff. Yeah. Like it does feel a little bit more advanced for kids, but it's not enough to make it like an adult thing. It's young adult. Well, right. Even though it's weird. Well, that's what always, that is what always struck me about literature to just always young adult literature the last 20 years or so is like, Oh, this is",
            "start": 2110.06
        },
        {
            "text": "adult. Well, right. Even though it's weird. Well, that's what always, that is what always struck me about literature to just always young adult literature the last 20 years or so is like, Oh, this is pretty fucking dark. You know, like, like especially the hunger games, which is super fucking dark or even something like Lewis Lowry's The Giver or whatever. I'm like, this is a really dark theme for young adult. I mean, even Twilight. Yeah. Twilight. Well, Twilight's, you know, a timeless vampire story. Fifty Shades of Grey. Yeah. Not, not made for children. Not sure it's young adult, but yeah. Oh, it is. Yeah. Anyway, I'll be watching this game with intensity. Yo-kai watching it. Yeah. I'll be Yo-kai watching it because it's, 3DS is really slowing down a lot in the West in terms of sales. And I'm wondering, it's a 52 million, I think, worldwide now, something like that, which is great. But I wonder if it's going to get one or two more pushes before they inevitably pull the plug on it,",
            "start": 2154.06
        },
        {
            "text": "And I'm wondering, it's a 52 million, I think, worldwide now, something like that, which is great. But I wonder if it's going to get one or two more pushes before they inevitably pull the plug on it, which I think the NX is going to be. X is going to give it to you. You know, if NX is a hybrid, then, you know, 3DS's days are numbered. So I'll be interested to see, like, what are the games that can give it that one last push? And I wonder if this is going to be, if this hits the way it hit in Japan, it's anywhere near where it hit in Japan. It's going to be a huge hit here, too, because it sold millions and millions of copies. I mean, a demonstrable amount of the Japanese population has that game. There are 20. What is it? Something like 20 percent of the Japanese population has a 3DS. So, I mean, that's an incredible for that to be for that to be the case here. 3DS would need to sell what we need to in just the United States have pushed like 67 million units. So that's an incredible",
            "start": 2192.06
        },
        {
            "text": "I mean, that's an incredible for that to be for that to be the case here. 3DS would need to sell what we need to in just the United States have pushed like 67 million units. So that's an incredible amount of people that own a 3DS. And so, you know, here it's less so. And I'm interested to see, like, what games can possibly proliferate this unit even further, because I think the 3DS is looking quite aged at this point. Speaking of 3DS, the last game that I put some time into was Triforce Heroes. How is it? I enjoyed a lot. I loved Four Swords Adventures back in the day, or Four Sword Adventures, back when it first came out on GBA with the Link to the Past as like the thing that was impossible to play with your friends because it required way too much shit. Then I bought the GameCube version that was even more impossible to play because you need to way too much shit to play with your friends. But I made it happen and I loved the shit out of it. It was really fun. One of the first games",
            "start": 2235.06
        },
        {
            "text": "that was even more impossible to play because you need to way too much shit to play with your friends. But I made it happen and I loved the shit out of it. It was really fun. One of the first games that I ever played, definitely the first Nintendo game, there was kind of that co-op competitive multiplayer that now is everywhere in every game they ever make. But where you're working together, but it's also funny things happen when you work against each other and you are trying to see who can get more rupees or whatever. Who gets the crown. Yes. So this one's been cool because I can just play it single player, which is something that you couldn't do on the GBA one. And on GameCube you could, but it wasn't whatever. This one, I played single player. I tried playing online a bit. It was lagging out and stuff. It's not even worth it. I'm not even going to try. Then I played through a good amount of the game. And it's fun. I like it. The game changes based on if you're single player or",
            "start": 2277.06
        },
        {
            "text": "out and stuff. It's not even worth it. I'm not even going to try. Then I played through a good amount of the game. And it's fun. I like it. The game changes based on if you're single player or playing with other people. So like they change some of the puzzles and shit so that they're possible with one person. You kind of switch off between the different links. It's cool. And I definitely think that, I mean, it's not Zelda. This is not a Zelda game. But once you kind of turn that off in your head and be like, this is a multiplayer Zelda game. Is it good on that sense? Yes, it definitely is. It's fun. It's great. I don't think it's like a 10 out of 10. It's fun. It's a cool little diversion. It's a 3DS game. I love the hack and slash Zelda's. Like Link to the Past where you're like kind of just walking around like slashing shit. We're getting more of that. It's really cool. I can imagine playing with two other people being really good. So yeah. Okay. I'll allow it. Good. So next topic.",
            "start": 2313.06
        },
        {
            "text": "just walking around like slashing shit. We're getting more of that. It's really cool. I can imagine playing with two other people being really good. So yeah. Okay. I'll allow it. Good. So next topic. Oh dude, one more for Colin. What have you been playing? I mean, the only game that we can talk about that I've been playing is Oregon Trail on Vita. I was pretty harsh on it when I first started playing it because the controllers are really fucking terrible. But I figured out a way to the shooting control specifically in the game for people that don't know Oregon Trail is an Oregon or so Oregon Trail. Like your heart. Oregon Trail is a game, but it's based on Oregon Trail. Oh, we are. And it's about like riding in a station wagon across the country with survivors of a zombie apocalypse. And it's it's really fucking weird. But in it, but in a good way. The major problem I have with it is the shooting mechanics are just fucking whacked out. I don't understand how. What does that mean? I",
            "start": 2356.06
        },
        {
            "text": "it's it's really fucking weird. But in it, but in a good way. The major problem I have with it is the shooting mechanics are just fucking whacked out. I don't understand how. What does that mean? I don't understand how they botched it so badly that you shoot on the you aim on the sticks, but it's not you're not pointing in the direction you're shooting. It's like you're pulling back and it's like all it's just people play. I mean, it's bad. It's just bad, really bad. But I but someone pointed out to me you can use the screen to point. But even then, you have to pull back and go in the opposite direction and shoot things. And this is this is during sequences. Think about an Oregon Trail like the original one, how you would go and hunt animals on this one. You have to like go and find things in a very similar screen. But zombies are coming at you. You have to shoot them as like you're grabbing all the shit. So that really was my behind the guy and I'm pulling back. Right. So so if if",
            "start": 2407.06
        },
        {
            "text": "in a very similar screen. But zombies are coming at you. You have to shoot them as like you're grabbing all the shit. So that really was my behind the guy and I'm pulling back. Right. So so if if yeah, if I'm shooting in front of me, I have to pull back. OK, so like a slingshot. Yeah, exactly. So it's a little weird in that sense. And it's a little off putting because it's just it's just not intuitive at all. But other than that, I think it's an interesting game. You can you can trade with people and you have to kind of keep an eye on your car and keep an eye on the healthier people and feed yourself and have ammo and gas. So it's very similar kind of thing to Oregon Trail. And I've been playing on Vita, so I recommend people maybe take a look at it. It might not be for everyone, but that's been the only game I've been spending any amount of time with that I can talk about right now. Cool. What do you guys plan? Let us know in the comments below. It'll be a grand old time. The second",
            "start": 2442.06
        },
        {
            "text": "been the only game I've been spending any amount of time with that I can talk about right now. Cool. What do you guys plan? Let us know in the comments below. It'll be a grand old time. The second topic of the day Activision made a big purchase. Fortune.com reports King Digital Entertainment, the company behind popular Facebook games such as Candy Crush, seems to have decided that being a publicly traded entity isn't all it's cracked up to be. King announced late Monday that it's being acquired by Activision Blizzard, the makers of popular console and PC games such as Call of Duty for five point nine billion motherfucking dollars. King's stock price has been under pressure in part because investors are concerned that it could be a one hit wonder or that its games might fade in popularity over time. No. King is close to 500 million monthly active users, but that number has been declining and so have the company's revenues and profits. Candy Crush was first released in 2012 and quickly",
            "start": 2480.06
        },
        {
            "text": "over time. No. King is close to 500 million monthly active users, but that number has been declining and so have the company's revenues and profits. Candy Crush was first released in 2012 and quickly became one of the most popular Facebook games ever. Investors concerns were most likely well placed since other Facebook and social games have lost their luster in the past. Zynga was once the most dominant game maker on Facebook thanks to titles like Farmville, but its popularity and its share price faded after the social network changed its algorithm and wasn't promoting the game as much. With the buyout, Activision is able to address one of its chief areas of weakness, mobile. Activision's stock price hits an all time high reported today, closing up 7.5% after the King deal was made. Investors were most likely responding positively to landmark news that Activision is dropping 5.9 billion to acquire mobile publisher blah blah blah, but it also doesn't hurt that Activision has a stellar",
            "start": 2512.06
        },
        {
            "text": "were most likely responding positively to landmark news that Activision is dropping 5.9 billion to acquire mobile publisher blah blah blah, but it also doesn't hurt that Activision has a stellar third quarter that out pays to analysts expectations. So just for reference, EA bought PopCap back in 2011 for 650 million dollars. Yeah, they got a steal because PopCap's making more than one game. So this this deal struck me as incredibly strange. Now there's there's an important there's an important note to be had had here and I have not looked into it too deeply, but apparently there are significant tax benefits to this deal. And I don't know the exact nature of that. I'm not looking at maybe we can revisit it because I've just not had time to research it. But people have tweeted at me that there is a incredible tax benefit to this purchase that that benefits Activision. So there's that. Here are some numbers that I was looking at and I thought was a little that was a little strange to me.",
            "start": 2561.06
        },
        {
            "text": "is a incredible tax benefit to this purchase that that benefits Activision. So there's that. Here are some numbers that I was looking at and I thought was a little that was a little strange to me. And I would be very scared if I like buying King for this much money is is seems completely suicidal to me. And we'll get to why I don't know how suicidal it really is considering who's running Activision. They're not stupid people. Last year, 2014 net income of so net profit, I really should say, of King after all expenses paid was about 550 million dollars around there, maybe a little less. They their gross revenue is something like five times ahead of that. So probably somewhere in the land of two and a half billion dollars. So Activision paid 12 times the amount of the profit made last year to acquire the company and its IP. And why that's weird to me is, is, A, the things that they talked about. Zynga is a great example of something that looked like it was going to be dominant and",
            "start": 2601.06
        },
        {
            "text": "year to acquire the company and its IP. And why that's weird to me is, is, A, the things that they talked about. Zynga is a great example of something that looked like it was going to be dominant and fucking fell off the face of the planet. And that was I mean, it was so obvious that was going to happen. Like these things are just when you when you depend on casual gamers, that is exactly what you're going to get is a casual market. And so I look at this deal and I look at it and I just don't. Why? Like, why? Why would you spend this much money on this company? The numbers that they didn't call out here. And I'm going to call out these numbers and I call them out on the on Colin and Greg live. Microsoft bought Mojang, which came with it, Minecraft for two and a half billion dollars, which is a fucking steal now compared to what these things are going on. Disney bought Star Wars for four billion dollars. Yeah. Star Wars, I hate to tell you, will make billions and billions and billions",
            "start": 2644.06
        },
        {
            "text": "is a fucking steal now compared to what these things are going on. Disney bought Star Wars for four billion dollars. Yeah. Star Wars, I hate to tell you, will make billions and billions and billions of dollars over the next 10 years. That was a fucking shrewd buy. I was probably worth twice as much. And that's what blows my mind the most is the fact that like, how can this be worth more than Star Wars? It's not. That's I mean, that's that's what I'm saying. It's like so five point nine billion dollars for King publicly traded. People are going to fucking make out as bandits. Stockholders of King are probably fucking shit in their pants right now about how much money they're about to make. But the you know, as long as the big thing is that the deal is not will not go through till the spring. Ireland and Kings and Irish company. They need to you know, they need to go through all the rigmarole over there. This just doesn't make any sense to me. They make they make a bunch of games, but",
            "start": 2688.06
        },
        {
            "text": "Ireland and Kings and Irish company. They need to you know, they need to go through all the rigmarole over there. This just doesn't make any sense to me. They make they make a bunch of games, but they all are derivatives of either Candy Crush Saga or they have different like match three puzzlers. Like they just they make these very gimmicky free games and then they have whales that support these games. They're 500 million user. First of all, I don't believe that for a fucking second. That's one in 12 people in the world are playing King games. I just don't I just I just don't know about that. So I don't know what that sounds so crazy to me, though. I mean, just in the way that like everyone has access to something that those things are on. But what I'm wondering is how is that number counted? Is that counted as like individual downloads of games? So if a person has five King games, are they counted five times or they counted once? I'm just seeing that five times. I'm seeing that",
            "start": 2726.06
        },
        {
            "text": "counted? Is that counted as like individual downloads of games? So if a person has five King games, are they counted five times or they counted once? I'm just seeing that five times. I'm seeing that number. I'm just like, that doesn't sound like that just doesn't even sound possible. Like just that doesn't sound possible. I could be wrong. I'm not saying they're necessarily like anyone's lying. I'm just saying like, what does that number mean? It's we always be skeptical about these numbers from these companies. I'm always skeptical about the numbers of these companies really is because there's always some fucking trickery being being portrayed. But it's it doesn't matter how how wide the user base. It's about the people that buy. And there probably are a few million people that spend money now. Your whales. Your whales. This cannot possibly last for them because the next big thing is going to come up and take their place, just like the next big thing. Displays Zynga. And I the only",
            "start": 2763.06
        },
        {
            "text": "now. Your whales. Your whales. This cannot possibly last for them because the next big thing is going to come up and take their place, just like the next big thing. Displays Zynga. And I the only thing I can think of, Bobby Kotick Activision is shrewd and he's smart. He's smarter than anyone in this room. And he's probably smarter than most people listening to this podcast. Right. I mean, it's just the fact that dude's dude's business. He's not only a business, but in the fucking business, he's an incredibly successful businessman. Bobby Kotick is no dummy. So the one the one X factor to this whole situation is like, what do you know? Because it was the same question I asked when Microsoft bought Mojang, which I thought was for a lot of money. And they got away with murder with that one pretty much. And with PopCap is like, I'm sure they're looking at it being like I'm sure the guys that own PopCap are like, fuck, you know, we could probably sold for a lot more. Yeah, because PopCap",
            "start": 2795.06
        },
        {
            "text": "pretty much. And with PopCap is like, I'm sure they're looking at it being like I'm sure the guys that own PopCap are like, fuck, you know, we could probably sold for a lot more. Yeah, because PopCap to me is like real. I'm not saying people at King aren't necessarily talented. I'm just saying the people at PopCap are. Peggle. Peggle and Plants vs. Zombies are already more diverse than anything that King's made. Yeah. And more unique than anything King's made. So I look at this and I'm like, there's got to be something to this because I don't understand how Activision is going to just drop six billion dollars in cash. I mean, that's that's the craziest thing. It's just what the fuck do they know? So I think that there's more to the story. We might not ever know what more to the story is. So I think part of it is this possible tax ramification that I have to look into that might be very beneficial to them to be able to write a bunch of shit off. Maybe they save billions of dollars",
            "start": 2835.06
        },
        {
            "text": "is. So I think part of it is this possible tax ramification that I have to look into that might be very beneficial to them to be able to write a bunch of shit off. Maybe they save billions of dollars doing it. So it's just like six and one half dozen the other, in which case, OK, maybe they only paid real money, two and a half billion dollars for the company. And so it makes more sense. But also. What are you investing in with King? Like, what are you investing in? They have fourteen hundred employees. So are you investing in their marketing? Are you investing in because you're not investing in their development? The thing there is I don't think that it's you know, am I saying it's worth it to me? No, but I'm like you said, I'm sure I'm missing a lot. But it's the infrastructure. It's the infrastructure of marketing and getting mobile games out to people and casual games out to people. That's something that Activision doesn't really have right now in that way. No, they're not a mobile",
            "start": 2874.06
        },
        {
            "text": "infrastructure of marketing and getting mobile games out to people and casual games out to people. That's something that Activision doesn't really have right now in that way. No, they're not a mobile games company. But now they are. Yeah, I know. And I mean, but that's that's the thing is like now it's it's another pillar. And with things like Hearthstone, which are huge and core gamers love that shit, you know. So it's like, all right, let's combine that with this, you know, combine the call of duties with the Hearthstone, with the is that I say Hearthstone. Yeah. With our son, with the Candy Crush. What does that become? You know, I don't need so much about Candy Crush being this thing for Activision. It's more about combining the elements that make all of them work together. Just being this thing. But how does it how does it work? Like in my mind, I'm like, how does this work? If everything stays the same with King, we talked about this on Colin and Greg Live. If everything remains",
            "start": 2907.06
        },
        {
            "text": "this thing. But how does it how does it work? Like in my mind, I'm like, how does this work? If everything stays the same with King, we talked about this on Colin and Greg Live. If everything remains the same with King and they keep they stay that the structure remains the same, the games make the same amount of money and the status quo is kept, which is obviously not going to happen. They're going to need new games or they're going to disappear off the fucking face of the planet. But let's assume that that's the case. It will take Activision 12 years to make their money back. Now, that's a good investment in a vacuum. But in games, the market's so much more dynamic and fluid than this. Twelve years ago, we could not have possibly predicted where we are now. And in 12 years, the market's going to look very different again. And what will the relevance of what King does be in 12 years? I don't know. King obviously has made an asinine amount of money. And there's no diet there. They're",
            "start": 2945.06
        },
        {
            "text": "going to look very different again. And what will the relevance of what King does be in 12 years? I don't know. King obviously has made an asinine amount of money. And there's no diet there. They're bigger than anyone that makes that almost anyone that publishes or makes, you know, core triple-A games like by a mile. So they can they're going to laugh all the way to the bank. And this might be a very shrewd move on Activision's part. I just don't understand that. King seems from an outsider's perspective, I don't like mobile gaming, so I'm always speaking from an outsider's perspective. It seems like King preys on the things that work to get people to spend money or the whales to spend money. And they just kind of regurgitate some ideas to keep those games current. So in my mind, Activision is not paying for that. Activision under their umbrella has game developers way more talented than them. So I think you're right that it's it's got to be for this marketing or this reach. But like,",
            "start": 2977.06
        },
        {
            "text": "is not paying for that. Activision under their umbrella has game developers way more talented than them. So I think you're right that it's it's got to be for this marketing or this reach. But like, why can Activision just find that reach themselves? This is what I'm saying. There's a difference there. It's a big hand, but this is different reach. And that's the thing is like when we make a video that we want to go viral, quote unquote, it's like, yeah, we have our built in thing. We have the our Twitter followings and this and that. But it's like that doesn't stop me from wanting to reach out to IGN and GameSpot and College Humor and Rooster Teeth. Hey, can you promote this too? And with King, this is one of those things, Candy Crush. I mean, I see it any time I play any mobile game. The ad comes up and it's like, you want an extra life for in Pagle? Then you need to watch this 10 second ad for this thing. Now, Activision owns that they can put whatever ads they want in front of that.",
            "start": 3019.06
        },
        {
            "text": "comes up and it's like, you want an extra life for in Pagle? Then you need to watch this 10 second ad for this thing. Now, Activision owns that they can put whatever ads they want in front of that. They're going to make money from the ads. But more importantly than that, they can promote whatever they want. So now, Hearthstone is now being seen by every single person casually playing Candy Crush. Like, oh, I want to try something new. What's this thing that I keep seeing over and over? You know, it's positive cans, clash of clans. So many millions of people play that game. Why? Just because there's commercials for it. And every fucking game has ads for that because they bought ads and everything. So it's like now if Activision controls that, they control so much, like they can make anything they want popular. Tony Hawk, Tony Hawk Pro Skater 5. You know, popular. If they put ads for that everywhere, that game would sell so much more just based on people know about it. Oh, this is",
            "start": 3056.06
        },
        {
            "text": "they want popular. Tony Hawk, Tony Hawk Pro Skater 5. You know, popular. If they put ads for that everywhere, that game would sell so much more just based on people know about it. Oh, this is happening. You know, Call of Duty. You know, it's going to sell more. I don't know. It's it's I don't know. I don't I'm really interested how this plays out and what their intent is. We will find out should the deal go through and it's going to go through. We'll see it. E3, what Activision does with them immediately, because. There's got to be some sort of. Plan that's not latent in their mind, the plan that is immediately going to go into action. Activision is dumping a shit ton of money on this. This a lot of people's reputations are going to are now going to ride on this on this particular deal. This is not a trivial amount of money. This market cap of six billion dollars is bigger than almost a vast majority of companies in the world could ever even approach being worth. Yeah. Nonetheless,",
            "start": 3092.06
        },
        {
            "text": "This is not a trivial amount of money. This market cap of six billion dollars is bigger than almost a vast majority of companies in the world could ever even approach being worth. Yeah. Nonetheless, nonetheless, being acquired for that much money. This is not a trivial amount of money. You know, this is not six hundred million dollars. I mean, this is one of the biggest things in our industry ever. You know, when you think about the sales, like the only things that come to mind are what you named like Star Wars being one of those things. And with Oculus and Facebook. Yeah, exactly. And all those deals were so much. It's Star Wars for two thirds the amount of money. I just don't. I'm just like, what? Like this to me reminds me of when Yahoo bought game geocities for five billion dollars. That was the beginning of the end of the fucking dot com era in the late 90s, early 2000s was like where deals like that. And I'm looking at this now and I'm like, huh? I wonder if we're getting so out",
            "start": 3138.06
        },
        {
            "text": "was the beginning of the end of the fucking dot com era in the late 90s, early 2000s was like where deals like that. And I'm looking at this now and I'm like, huh? I wonder if we're getting so out of control with the valuations now that this sparks the beginning of the end of the boom and the bubble that we're in now in terms of tech and in terms of gaming. Because I'm like this valuation cannot possibly be rooted in any sort of reality. But there's all of these mysteries that we don't know about that can certainly make it more more likely to be viable on a fucking ledger, which is what they're looking at. And so they can write this off and save a shit ton of money doing that or whatever the implications are that people tweeting me again. I do not know. I have not read about it. I don't know, man. This this was when I saw this is a fucking head scratcher. This interrupted my whole night when this was announced because I was like, I couldn't stop because the whole night was ruined",
            "start": 3178.06
        },
        {
            "text": "know, man. This this was when I saw this is a fucking head scratcher. This interrupted my whole night when this was announced because I was like, I couldn't stop because the whole night was ruined because I could stop thinking about it. I'm like, what? Like, that's I could see King going for a couple of billion, maybe. You know, I know. I mean, it sounds outrageous. It sounds crazy. But then to stop and think now of just like what is Activision? Activision is fucking Call of Duty, Blizzard and Candy Crush. That's power, man. That's power for now. To me, I think Activision again, not a dumb company. I just think Call of Duty has reached its limit. I think that will destiny then, you know, destiny is huge. Yeah, destiny is the next. Certainly I would even say destiny is way more important in the future than Call of Duty. I think Call of Duty is on the wane. I think destiny is on the waxing right now, you know, like so I don't know, man. Well, like from a business perspective, I'm not a",
            "start": 3210.06
        },
        {
            "text": "the future than Call of Duty. I think Call of Duty is on the wane. I think destiny is on the waxing right now, you know, like so I don't know, man. Well, like from a business perspective, I'm not a business and none of us are. But we do understand basic economics and I have a lot of just basic questions about this, about this deal. And I hope that they talk more about it. I think that they're probably not going to say a goddamn word about it until the deal goes through. So we're going to be waiting for a long time. And I wonder. Why they even now, like, I guess they have to announce it's a publicly traded company, but the deal has to go through all this, all this shit still in Ireland. So I don't know. There's there's a lot of questions to be asked, but I'm certainly not the only person that's like highly skeptical of this. And like I said, I wrote a little something about just on my Facebook page where I'm like, this has all the makings of like a genius move or Activision is going to",
            "start": 3252.06
        },
        {
            "text": "like highly skeptical of this. And like I said, I wrote a little something about just on my Facebook page where I'm like, this has all the makings of like a genius move or Activision is going to eat shit. You know, like like one of those two things is very likely to happen. Yeah. And I'm and I'm interested to see I have no problem with Activision at all. I hope that they succeed wildly. I think they put out good games, but for the most part. But yeah, something is fucking puzzling about this, man. And it's like I'm racking my brain like day after day thinking about it. Like, well, like why? Why? You know, reading about reading financials, reading King's financials and just going through them. And I'm like, OK, lots of revenue, really high profits. But based on this very fickle thing, just like Zinga was based on this very fickle thing, you know, for a little while and Zinga looked like they're going to take over the world. And if you ask me in 2010 what they're going to take over the",
            "start": 3285.06
        },
        {
            "text": "like Zinga was based on this very fickle thing, you know, for a little while and Zinga looked like they're going to take over the world. And if you ask me in 2010 what they're going to take over the world, I think it sucks. You know, but everyone said we were wrong and we were right. So I look at I just King doesn't make games that are are the king makes games that are addictive and easy to understand. They don't make games that are worth anything. But I mean, I think I think the thing there, though, is going back to it. It's the marketing and it's the fact that ads in front of those places are worth a lot of money, a shit ton of money. So even if the whales aren't there, the ad money is there. We'll see. I mean, we'll certainly see to your point about them attracting like cross pollinating audiences and stuff. I just don't know that there's any evidence that that works at all. I think these are two. I mean, definitely is like when Flappy Bird came out, everything that was ad targeted",
            "start": 3325.06
        },
        {
            "text": "audiences and stuff. I just don't know that there's any evidence that that works at all. I think these are two. I mean, definitely is like when Flappy Bird came out, everything that was ad targeted on Flappy Bird went like ridiculous. That's not the point I make. The thing is that people that the people that play Flappy Bird play fucking Call of Duty. I mean, that's that's kind of the thing. Like if so, someone to your point that you're making earlier about the cross pollination of IP, it's like, OK, so they show a Call of Duty ad before you play Candy Crush. Are the people that play Candy Crush when I play Call of Duty? They want to play Call of Duty match three, because I mean, that's that's the thing, though. But I mean, that could be it. You know, that's still the brand of Call of Duty or even with Hearthstone, you know, like it's maybe not the jump to Call of Duty, but it's at least brand awareness. And it's definitely similar games or like getting them up that step, you know, go",
            "start": 3362.06
        },
        {
            "text": "or even with Hearthstone, you know, like it's maybe not the jump to Call of Duty, but it's at least brand awareness. And it's definitely similar games or like getting them up that step, you know, go from super casual to kind of casual to, you know, generic to hardcore. Like, I think that there is a door that people you just got to leave it in the hallway. Sure. That's worth six point five billion dollars. I can't see how. But no, I think that the. That if that's if that's part of the gamble, I think that's a big gamble. I hope that that wasn't part of the calculus because I don't think that's going to work out for them. But if the gamble is just reach, if the gamble is just milking the shit out of King for as much as it's worth and reduce like if Activision's ploy is like you made five hundred. We don't I don't know enough about King's financials, know how they're spending their money. They probably live. They probably live very high over there and they make a lot of money so they can",
            "start": 3398.06
        },
        {
            "text": "We don't I don't know enough about King's financials, know how they're spending their money. They probably live. They probably live very high over there and they make a lot of money so they can do whatever the fuck they want. And if Activision's ploy is like, we're just taking the games and we're and, you know, God forbid, because I don't want anyone to lose their job. It's like you guys are done. Like we're taking your games and we're taking all the infrastructure and a very core staff of people that understand these games work in your marketing team. And out of the fourteen hundred people, a thousand of you are gone and we're shutting down buildings and all this kind of thing. That maybe the thing is like we will extract as much money out of these guys while we can. And maybe we can get that five hundred million dollars to a billion dollars a year and we can just ride it for a few years and see what we are. That could also be part of the calculus. So I don't know. There's a lot of",
            "start": 3445.06
        },
        {
            "text": "that five hundred million dollars to a billion dollars a year and we can just ride it for a few years and see what we are. That could also be part of the calculus. So I don't know. There's a lot of answers that, you know, questions that need to be answered about this. Certainly one of the most fascinating business deals I remember ever happening in the gaming industry. Like that's for sure. They're ready to stand their ground this month with exclusive items from Blizzard, Fallout 4, Capcom, sponsor where they loop from the Hunger Games, as well as a few more that will help their winners emerge victorious. Whether you're risking your life in battle or taking no prisoners in the wasteland, our loot will be at your side to help keep things interesting. Basically, Loot Crate is like your homie that gives you nice things every month and that's a great thing. Did we mention they shipped over thirteen different countries too? You have until the 19th at 9 p.m. Pacific to subscribe and receive",
            "start": 3472.06
        },
        {
            "text": "that gives you nice things every month and that's a great thing. Did we mention they shipped over thirteen different countries too? You have until the 19th at 9 p.m. Pacific to subscribe and receive that month's crate. And when the cutoff happens, that's it. It's over, Jack. So go to lootcrate.com slash KF Games and enter code KF Games to save three dollars on your new subscription today. I thought you were going to tease me. I thought you were going to do it. You told us to check. I looked at you and you did the look. I'm like, I got it. I got it. I got it. Jack needs to hear about it. X gon' give it to you. Tim gon' give it to you too. Third topic of the day. It's this whole Konami deal. Let's get right into this. Kotaku says, Seeing how Konami took Kojima's name off the Phantom Paints box art, dissolved his studio, and canned Silent Hills, it's hard to see him staying on for any of the stuff. Especially considering the rumors about Konami's work environment. Recently, Kojima said",
            "start": 3528.06
        },
        {
            "text": "box art, dissolved his studio, and canned Silent Hills, it's hard to see him staying on for any of the stuff. Especially considering the rumors about Konami's work environment. Recently, Kojima said what seemed to be his goodbye to the series. Then, Konami confirmed the Konami LA studio has been closed and said, When we start development, a large-scale investment will become necessary, in reference to the next Metal Gear game. While the paper reports that Konami is merely examining plans for another Metal Gear, Konami previously stated it would continue making more games in the stealth series. So guys, what does all this mean for the industry? Konami's getting out of triple-a games. Totally. This is it. Yeah, we talked about it. That was the thing. It seemed that that was the rumor forever, right? With the rift between him and Kojima, the fight over all this stuff, so on and so forth. They released Metal Gear online four weeks ago. Topps, I don't even remember. It was October, right?",
            "start": 3561.06
        },
        {
            "text": "right? With the rift between him and Kojima, the fight over all this stuff, so on and so forth. They released Metal Gear online four weeks ago. Topps, I don't even remember. It was October, right? Second week, October. And now they're already closing down the studio that made that part. That were the guys who were working on that game. They're gone now. They say that in their press release, of course, that now it's just moving to Japan. People are still working on this game. They'll still support it. It's still coming to PC next year or whatever. It's like, okay, we'll see how supported it really is and what that means. But yeah, I think it's all platitudes in the way of Konami acting like they're still going to do it, but I don't think they are. This also jumps back to the sales that came out for how Metal Gear Solid sold, right? Five million units. It's like that month. That's good. It's not great. It's not the juggernaut numbers. And I'm sure the people at Konami who are saying,",
            "start": 3596.06
        },
        {
            "text": "out for how Metal Gear Solid sold, right? Five million units. It's like that month. That's good. It's not great. It's not the juggernaut numbers. And I'm sure the people at Konami who are saying, let's get out of the console business. We make more money at Pachinko. We make more money on these things. They're now pointing at this and saying, see, we were right. It took them how long to make this game, how many millions of dollars, and this is what it returns immediately. Let's change our focus. Let's get out of here and let's go this way. And that's the thing. They're saying that they need, what is the exact wording here? For the next scale thing to happen, they're going to need a large investment. Well, they're going to. I mean, they're definitely going to. They cost a lot of money making it like Metal Gear. The rumor about Metal Gear's development was about 80 million, which is not out of control for a triple A game. I mean, triple A games go way higher than that. This brought up an",
            "start": 3635.06
        },
        {
            "text": "it like Metal Gear. The rumor about Metal Gear's development was about 80 million, which is not out of control for a triple A game. I mean, triple A games go way higher than that. This brought up an interesting question, another conversation I was having with some folks on NeoGaf, based on a conversation we were having on PSI Love You with anecdotal evidence about the way a game makes money. And people were talking about, well, Sony or Konami grossed whatever, 180 million dollars. So they're already profitable. I'm like, that's not how it works. The money a game grosses is irrelevant. It's completely fucking irrelevant. That means that generally means unless there's caveats that the gross register retail, we sold X amount of copies at sixty dollars and we grossed X amount of money. That's irrelevant because it doesn't it doesn't take into account anyone's cut. It doesn't take into account taxes. It doesn't take into account all of this shit. By the time the money falls to Konami, how",
            "start": 3671.06
        },
        {
            "text": "irrelevant because it doesn't it doesn't take into account anyone's cut. It doesn't take into account taxes. It doesn't take into account all of this shit. By the time the money falls to Konami, how much money do they have? And Konami is not interested, by the way, in breaking even. They're interested in making money. So if if they invested 80 million dollars five years ago, then, hey, they're going to be more like 100 million dollars to bring even today because of inflation. And then they want to make money on top of that. They need to make it so they can have capital investment to put into the next game. I think Greg's right in the sense and we've talked about this, that. Five million, I don't have any baseline of what my expectation was with Metal Gear to sell, other than I thought I was going to do better than five million in a month. Now, those numbers to me seem soft based on the incredible, you know, pull of the game. This game has great gravity to a lot of hardcore gamers, and",
            "start": 3714.06
        },
        {
            "text": "going to do better than five million in a month. Now, those numbers to me seem soft based on the incredible, you know, pull of the game. This game has great gravity to a lot of hardcore gamers, and those sales don't seem that impressive to me. I think I mean, most as we were talking to our friends, you know, in the industry about it, people would murder for five million sold. So I'm not trying to say that that's not like an impressive thing. That's a that's a great success for a vast majority of games. But for Metal Gear, I expected a little bit more. And I wonder across four skews. Exactly. And so I wonder if so, a like I don't know if it's profitable. I really don't because the 80 million dollar rumored cost. And I'm not sure if Konami ever said that. I mean, I've read that before. But let's assume it's 80 million dollars. That is the money that it needed to develop the game. What about marketing? How much did that cost? And then how much did the studio like the publishing apparatus",
            "start": 3750.06
        },
        {
            "text": "assume it's 80 million dollars. That is the money that it needed to develop the game. What about marketing? How much did that cost? And then how much did the studio like the publishing apparatus have to pay to just, you know, like how much does H.R. cost you over five years? How much does does, you know, having just an HQ dealing with first parties to test the games? How much focus testing cost you? How much even just like I don't like the time that it takes to promote the game, the time for marketing, even aside from the cost. You know, when it's like E3 and stuff, there needs to be so much planning and so much stuff that goes into the presentations and the trailers and this and that. In addition to the to like, you know, traditional marketing of ads, commercials and exactly. There's just a lot of things up in the air about what this game costs to make. It was in development for a very long time. And so, yeah, they say that they're interested in doing the next Metal Gear game. And",
            "start": 3784.06
        },
        {
            "text": "a lot of things up in the air about what this game costs to make. It was in development for a very long time. And so, yeah, they say that they're interested in doing the next Metal Gear game. And I'm sure that they are interested in that. I'm not sure that they're going to pull out of triple A development completely, but, you know, maybe not yet. I'm sure that seems to be the desire with some of them is to minimize, you know, to mitigate risk, to make the most amount of money. And you don't mitigate risk when you have triple A games because they take huge investments and you don't get that money back for years. So and you just don't know how it's going to work out. Plus, if I were Konami, I'd be very, very scared of moving forward Metal Gear without Kojima. Not because they can't make a great game or an even better game without Kojima, because they can if they find the right people. It's like, what does what do your what do the consumers think about that? Are people going to be there",
            "start": 3823.06
        },
        {
            "text": "game or an even better game without Kojima, because they can if they find the right people. It's like, what does what do your what do the consumers think about that? Are people going to be there for Metal Gear Solid 6 when you shit all over the guy? It seems like the guy that is responsible for the series to begin with and had a very bad, tenuous relationship. And let's just say that it was all Kojima's fault. That's not going to matter to anyone. That's not how it played in the press. Everyone thinks Konami is the evil person that did this and forced out the guy they love. Exactly. Like for all we know, Konami could like we might find out when the story started to be told that Kojima was a was a rampant fucking egomaniac and a prima donna. And who knows? I'm not saying that that's true or that's false. I'm just saying we don't know the whole story. There might be justification. Exactly. Yet it's always going to play out against Konami's favor. So they might be looking at it being",
            "start": 3853.06
        },
        {
            "text": "or that's false. I'm just saying we don't know the whole story. There might be justification. Exactly. Yet it's always going to play out against Konami's favor. So they might be looking at it being like, we just need to not do this from all of us anymore. So there's a lot of questions about that I have about about this particular situation. And it's not surprising that the L.A. studio was shut down. What's surprising to me is that they've not been very good about communicating any of this stuff. I mean, saying Kojima was on vacation when when the guy who broke the story is like tweeting out pictures of him at his fucking going away party is classic. Yeah. So the thing and that's the whole thing is like Konami's been tone deaf on this front the entire way. And so I wonder how much they worry about what the audience thinks of them or whatever. You know what I mean? They haven't stopped to try to clear this up. They haven't made it clear what's happening. They you know, they're only",
            "start": 3886.06
        },
        {
            "text": "worry about what the audience thinks of them or whatever. You know what I mean? They haven't stopped to try to clear this up. They haven't made it clear what's happening. They you know, they're only putting out this statement about L.A. now. But as far as we know, Kojima is still on vacation. I mean, there still hasn't been confirmation. He's probably technically on vacation because they're probably paying him. Exactly. Exactly. Exactly. So it's just all it's all it's all battle a battle of, you know, weird words and what they exactly what they mean. I don't know. I find it so bizarre if you would ask me when I mean, when we were talking about Metal Gear and reviewing and doing all that stuff, how this would play out, I would have said that like like it was pretty I think the rumors always been December is when Kojima's numbers up right that he can actually be gone and free or whatever. I would have said we would hear in December that he was leaving and then the L.A. studio would have",
            "start": 3922.06
        },
        {
            "text": "been December is when Kojima's numbers up right that he can actually be gone and free or whatever. I would have said we would hear in December that he was leaving and then the L.A. studio would have been closed early 2016. I think it's crazy that it's closed this close to Metal Gear Online. Yeah. Well, especially to online, like to the game releasing. I think it's even close that game releasing like Metal Gear, the Phantom Pain. That was all done at Kojima's Japan studio. So I understand there's nothing there. But for online, this thing you just put out and now it's like there's no future for that game. I don't care what you're saying. If it's there, talk about it being like, no, we're bringing staff on to the Japan team and they're working on it. And it's like, no, I don't I don't believe that they are. I don't believe there will be support for that game from here on out. And I don't believe it was a game that was like it. It hasn't turned heads. Right. Like we played it here and did",
            "start": 3947.06
        },
        {
            "text": "that they are. I don't believe there will be support for that game from here on out. And I don't believe it was a game that was like it. It hasn't turned heads. Right. Like we played it here and did whatever. And I haven't heard anyone talk about it since then. And there's a hardcore following for sure. I'm not saying that, but I'm saying you're the fucking Metal Gear five dude. Right. Yeah. It didn't hook you in the way that has you playing every day. Yeah. Yeah. So what do you with all of this then with with Kojima on vacation and with him putting out the video that you were in where he kind of was like, you know, that really that video felt like a wrap up for sure. That was the goodbye to the series. And what do you guys see it now with it's official that the L.A. studios shut down. Kojima was on vacation. When do we hear about this stuff? Do you think it's still December? I think December. Yeah. They put it out because you figure that makes sense on a lot of levels first. I think",
            "start": 3984.06
        },
        {
            "text": "was on vacation. When do we hear about this stuff? Do you think it's still December? I think December. Yeah. They put it out because you figure that makes sense on a lot of levels first. I think it's contractual. It would be the reason I've heard of why that's like the thing that's been kicked around the room or forever. But on top of that, it's just like people are away from the computers. The new cycle is very quiet. You know what I mean? Like people are I. G. N. and game spots are taking vacations. Kind of funny is taking a vacation. Right. So it's like it'll be a press release and they'll be up. But will there be videos to react to an outrage to have and all this different stuff? And then the real question is, when does he talk about it? That's what fucking fascinates me to no end. Right. Like if if it's true that it's December that everything ends for him, like then what happens next? You know what I mean? Yes. He comes out and announces an exclusive crash bandicoot. Holy shit.",
            "start": 4022.06
        },
        {
            "text": "Like if if it's true that it's December that everything ends for him, like then what happens next? You know what I mean? Yes. He comes out and announces an exclusive crash bandicoot. Holy shit. Right. Jesus. Yeah. There's there's so the hanging the hanging shads is it were for this for this remaining for the what remains for the story are going to be fascinating in the sense that the story about Kojima is going to be told. It's not gonna be told by him. It's going to be told by you have to assume he's probably be contractually obligated not to talk for a long time. Yeah. You have to assume that it's going to be told by proxies and anonymous sources. These stories are probably going to start coming out early next year. And this is a story that must be told. And whoever really gets to the bottom of the story is going to have a lot of respect for me because this is going to be a tough one to chase. And like I said about the last guardian and Timiko and all that kind of stuff, this is a",
            "start": 4063.06
        },
        {
            "text": "bottom of the story is going to have a lot of respect for me because this is going to be a tough one to chase. And like I said about the last guardian and Timiko and all that kind of stuff, this is a story that's probably better known in a Japanese press. And because there's a language barrier, we don't we're not going to get the scoop right away. Just like I assume that, you know, the shit with the Oita and all that kind of stuff at Sony is was well known in Japanese press like off the record for a long time, just like we know about shit off the record about a bunch of things, too. So it's it's it's going to be fascinating what we figure out about that. But it's also going to be there's two other things that are going to be really interesting. What is Kojima going to do and where is he going to land? And I am I am dead set on there being a fucking major bidding war. And I do not think he's going to go independent. I think he's going to end up with a publisher because they can fund",
            "start": 4093.54
        },
        {
            "text": "going to land? And I am I am dead set on there being a fucking major bidding war. And I do not think he's going to go independent. I think he's going to end up with a publisher because they can fund his games. And then Konami is in a lot of trouble because any of the remaining talent there that's loyal to him, he's going to poach them all. So so I'm interested to see like what happens with that and like what the bloodbath might be at some of these studios, especially Kojima's studio in Japan. If he's just like, we're take we're all going. Yeah. And and then if Metal Gear costs 80 million dollars and Sony and Activision, all these guys are like, we'll give you one hundred million dollars in four years and just go to do it. And that's what I think that I think that is going to happen. I love that because I love the Kojima is one of the only people where I don't care what project he's working on. Him being involved makes me excited about it. Silent Hills is a perfect example. Don't care",
            "start": 4123.58
        },
        {
            "text": "that because I love the Kojima is one of the only people where I don't care what project he's working on. Him being involved makes me excited about it. Silent Hills is a perfect example. Don't care about that series at all. Him being attached to that. I'm instantly like, I'm playing that. Yeah, that sounds great. Add him to any series that I don't really have an attachment to. If he made the next Titanfall, I'd be interested in that. He makes the next Call of Duty. I would care. Fallout, you know, whatever it was, I would play Fallout, you know, like I would want to know what that was. So he got some influence from open world games. Here's the thing about this with Kojima is we talk about the deficit of trust that Konami is going to have without him and the deficit of. You know, like authority almost over their games without him, a man, and this is why I think that the publishers are going are probably already and are going to continue to fall over themselves to get him is the surplus",
            "start": 4165.58
        },
        {
            "text": "almost over their games without him, a man, and this is why I think that the publishers are going are probably already and are going to continue to fall over themselves to get him is the surplus of fucking not like just the stuff you can't pay for to get along with the game. How much will increase the perception of a brand to have Kojima on board? How much does it increase the perception of a brand of Sony goes to Kojima and says, we want that horror game. So here's one hundred million dollars. Go get Kojima. I'll start writing for years. You know, like what is that? Like that's what I think that he might want to be independent in a way. But when he gets that money, when he gets that push, I want these opportunities and when the publishers are like getting Kojima on board for us is going to make us look very, very good. Just like Konami looks very, very bad, regardless, as I said, of what the reality behind the scenes is, it's going to look really good for them. I can't wait to see",
            "start": 4208.18
        },
        {
            "text": "to make us look very, very good. Just like Konami looks very, very bad, regardless, as I said, of what the reality behind the scenes is, it's going to look really good for them. I can't wait to see how it all pans out, man. And I was going to be sitting back waiting because it's going to come for him. You want to be enjoying your vacation? No, well, I would be excited probably being paid and just hanging out. But I'm sure that is, you know, it's it's what we said a million times with like when Amy Hennig left Naughty Dog, I can't imagine the offers that she got, you know. So it's it's. It's worth considering, you know, that he. That he's going to end up in one of these big, big, big places, and I would not I still say that it's I still say Sony in my mind is like one of those places where I'm like, this is so obvious for them, like it's too obvious. Cerny was over there. Oh, you want to go annex? I mean, I'll be a big thing, too, if Nintendo wanted to throw. Annex launches with",
            "start": 4243.66
        },
        {
            "text": "where I'm like, this is so obvious for them, like it's too obvious. Cerny was over there. Oh, you want to go annex? I mean, I'll be a big thing, too, if Nintendo wanted to throw. Annex launches with Kojima's new game. Well, that would be possible. Bota Kai 3. Bakaai. Bota Kai. And I think there was there a 2? I think that's what we're skipping. The original black that was interesting. Interesting. That's obviously. Brought to you by DraftKings. Football season marches on, and while your season long fantasy team might be going nowhere fast, every week is the new shot for glory at DraftKings dot com. DraftKings is the destination for one week fantasy football where you can relive the fantasy draft and play for huge prizes each and every week. Challenge your friends in a custom league or join an existing one to play for your share of the billion dollars in prizes up for grabs this year. This isn't fantasy as usual. This is DraftKings. Welcome to the big time. Heard DraftKings dot com.",
            "start": 4278.9
        },
        {
            "text": "an existing one to play for your share of the billion dollars in prizes up for grabs this year. This isn't fantasy as usual. This is DraftKings. Welcome to the big time. Heard DraftKings dot com. Now use promo code kind of funny and play for free with your first deposit in Sunday's million dollar fantasy football contest. First place takes home one hundred grand and a lifetime of bragging rights. You are kind of funny for free now. Yes. Wait, what kind of funny? Kind of funny. Now. Now only through the screen at DraftKings dot com. That's DraftKings dot com. The final topic of the day, as always, brought to you by the beautiful people that are yourselves over at Kind of Funny dot com slash forums. Go to the Gamecast topic or Gamecast thread subforum. Go to the thread. Fill out the stuff. You can also go to Kind of Funny dot com slash games cast topic. That's an easier way to do it. I should have just said that from the beginning. But the first question comes from our boy Alex Cross,",
            "start": 4322.14
        },
        {
            "text": "You can also go to Kind of Funny dot com slash games cast topic. That's an easier way to do it. I should have just said that from the beginning. But the first question comes from our boy Alex Cross, who we yesterday did a Google hangout with. Right. Excellent. Support us over at Patreon dot com slash Kind of Funny games. And he had a question for us that I'm like, I like that a lot. What would get you to preorder a game? You know, we live in this world where back in the day, preorders to me at least felt a little bit more natural as part of what I did. Yeah, there was limited supply. Yeah. So I wanted to make sure I got F-Zero GX on the GameCube. You know, I wanted to make sure Devil May Cry 2. So upset about that, but I wanted it. Right. All those things were just more of like, I know I'm going to buy this game, so I might as well. Do you preorder games often? I did now, though. Never. Really? I mean, well, that's the thing. Yeah. Never. Like, do you guys? Yeah. Really? No, I mean,",
            "start": 4372.46
        },
        {
            "text": "going to buy this game, so I might as well. Do you preorder games often? I did now, though. Never. Really? I mean, well, that's the thing. Yeah. Never. Like, do you guys? Yeah. Really? No, I mean, but I mean, I don't think preorder means what it used to mean. Preorder to me used to mean, oh, man, I want perfect dark on day one. So I'm going to go do it. And hey, I got a fanny pack out of the deal. That was whatever. Cool. I got that. You'd go there because I had those those days where I'd show up at EB and Electronics Boutique. Still, I'd go into EB and try to get the game. They'd be like, oh, we only got two and we're out. And then you get a target and they didn't have it. And you'd be screwed. Right. So that's why I started preordering. Now I digitally preorder everything if I'm going to buy it. Right. I'm like, oh, I want that. If we're not going to get it through a review thing or whatever, when it comes down to that point, I'm like, well, I want that. I want to make sure I have",
            "start": 4409.9
        },
        {
            "text": "to buy it. Right. I'm like, oh, I want that. If we're not going to get it through a review thing or whatever, when it comes down to that point, I'm like, well, I want that. I want to make sure I have that to go as soon as possible. And that for me, it comes down to brand loyalty more than anything. Right. Like, I know. Like, here's a great example. Right. Fallout 4. Fallout 4 is announced finally. Hurray. I'm going to buy Fallout 4 for sure. I'm probably going to love Fallout 4 for sure. Awesome. But then they say we're putting out the limited edition with the Pip Boy. And I'm like, I love Bethesda. I love the Fallout brand and I'm a big enough fan that I know I want that and put my stupid phone in it. So at the during the conference, right, I preordered it to make sure I had it because I knew that would be a limited run of that thing. Right. But like that, what motivated me to get Fallout 4 right then and there on the day was the fact that it was limited edition special edition for a",
            "start": 4445.26
        },
        {
            "text": "knew that would be a limited run of that thing. Right. But like that, what motivated me to get Fallout 4 right then and there on the day was the fact that it was limited edition special edition for a franchise. I already know I love it in a developer. I like, you know what I mean? That's what motivated me to do it in that point. If I hadn't done it and now here we were and we're coming up on Tuesday, 901 PM. You know what I mean? Pacific time out here, I guess Monday, 901 Pacific time. I'd still be like, all right, cool. If I hadn't gotten the game through Hooker Crook by now, I would have I'd preorder it and do it just so I'm ready to go. It's preloaded. For me, preordering is preloading, so it's ready to go. Right. I did it with Batman Arkham Knight. Batman Arkham Knight was coming up and I'm like, I already know that I love Rocksteady. I already know that I love Batman. And I went and bought the premium edition so that at 901 PM I was ready to go. When I was in the ready, you know",
            "start": 4479.3
        },
        {
            "text": "I'm like, I already know that I love Rocksteady. I already know that I love Batman. And I went and bought the premium edition so that at 901 PM I was ready to go. When I was in the ready, you know what I mean? Like I had no doubts about it. I'm not preordering every game I'm interested in. Right. Like there's enough games that come out and I'm like, well, I'd see how that one turns out before I throw money at it. But when it's Rocksteady, when it's Bethesda, when it's whoever, I know that I want it and I'm at a fever pitch of excitement and I want to play it right away. Yeah. For me, a long time ago, it was like more of a Pip-Boy type situation where it's like, where there's something that I want that I couldn't get otherwise. So with Zelda with Wind Waker, if you preordered, you got that the Ocarina of Time and Majora's Mask, whatever. And I'm like, well, shit, I need that. You know what I mean? Other random things like Soul Calibur 2, you got the soundtrack CD. I'm really into video",
            "start": 4516.1
        },
        {
            "text": "the Ocarina of Time and Majora's Mask, whatever. And I'm like, well, shit, I need that. You know what I mean? Other random things like Soul Calibur 2, you got the soundtrack CD. I'm really into video game soundtracks. That entices me. Yeah. Had Mario Galaxy come with the soundtrack, I would have wanted to preorder for sure. You know? So there's certain things like that. If it's a fucking fanny pack or whatever, that was always just kind of like... That shit I never really wanted, right? I remember when I, Maximo, Ghost of Glory. I was like, totally like, I read the previews. Exactly. I love the previews and all this stuff. And that was the first game I ever ordered off of GameStop.com and had it delivered. And it came and I opened up and had a pair of boxers in there. I was like, oh, cool. That's not what motivated me, right? It was the ease and convenience of having it delivered to my dorm and not having to try to get a ride out to the mall to go get it. And I guess that's the other",
            "start": 4548.38
        },
        {
            "text": "That's not what motivated me, right? It was the ease and convenience of having it delivered to my dorm and not having to try to get a ride out to the mall to go get it. And I guess that's the other thing is like with Amazon, especially with Prime, it's just kind of like, all right, if you preorder it, you'll get it the first day. And see, this is what I'm talking about is that preorder to me no longer means preorder to get something. I preorder that Doctor Who level pack, right? I played Lego Dimensions. I fell in love with Lego Dimensions. The Doctor Who part of the Lego Dimensions campaign, I was like, this is really fun. And the level packs have been great. Fuck yeah. And I just clicked the button and forgot about it because I didn't want to today have to go out or yesterday go out and try and find it. Right. It just shows up like, oh, great, perfect. And with Amazon now, which is their new thing where I'm not too sure of the details of this, but it's essentially... It's as fast as",
            "start": 4591.58
        },
        {
            "text": "try and find it. Right. It just shows up like, oh, great, perfect. And with Amazon now, which is their new thing where I'm not too sure of the details of this, but it's essentially... It's as fast as humanly possible to get the thing from you ordering it to it coming to you. And a big push for them is wherever Amazon now is available for Black Ops 3's launch, they'll get it to you for midnight, like for that midnight launch. It's like we're just getting closer and closer to things like that where there is no even reason to ever leave your house. Right. And that's the thing, right? Like midnight launches used to be a thing. They still are a thing, right? Yeah. But now when there's a game I want that bad for what I'm already saying, right? 901, 901, 901. I just digitally get it, right? Or if it's if it's like something I need physically, which is like the Lego thing, then just get it to me. That's my biggest problem. The digital thing where I like the physical copies so much. But that",
            "start": 4620.26
        },
        {
            "text": "if it's if it's like something I need physically, which is like the Lego thing, then just get it to me. That's my biggest problem. The digital thing where I like the physical copies so much. But that creates problems because I wanted it 901, but I can't get it then. I need to wait until midnight. It's like when I got you a code for Metal Gear Solid 5 and you bought Metal Gear Solid 5. So you had the box. Yeah, I really wanted it. It's worth it. No, I'm here. Yeah, I'm with you. But yeah, I don't think preorder means what it means. Yeah, no, for sure. But is there anything that can make you preorder a game? I used to preorder a lot of games because, I mean, back in the day, PS1, PS2 era, I would say, GameCube and all that kind of stuff is because it was just a way for me to pay the game off ahead of time. It was like me. It's like why I clean the house on Saturday so I don't have to do anything for football on Sunday. It's because everything's done and then I'm ready to go. So that was",
            "start": 4660.62
        },
        {
            "text": "ahead of time. It was like me. It's like why I clean the house on Saturday so I don't have to do anything for football on Sunday. It's because everything's done and then I'm ready to go. So that was the only reason I used to do it. I didn't want like anything out of it. The last games I remember like really going and preordering were like Resident Evil Zero and like the Resident Evil rereleases like GameCube. I don't know why I remember that so well. And I was in 2003, I think. So I didn't I didn't do much preordering after that. People have to remember that back, especially in the cartridge era, there really were a finite amount of games. It wasn't clear that games would be republished ever because of the allocation of chips were expensive and the allocation of cartridges were it was hard. The example I use is Rings of Power was Naughty Dog's Genesis game. It was an RPG and that game had, I think, one round of publishing of like one hundred or one hundred twenty thousand cartridges.",
            "start": 4685.94
        },
        {
            "text": "The example I use is Rings of Power was Naughty Dog's Genesis game. It was an RPG and that game had, I think, one round of publishing of like one hundred or one hundred twenty thousand cartridges. And the game was successful. But as far as I understand, EA couldn't let them publish more copies of the game because the allocation of chips and cartridges were spent on Madden. And so they couldn't they're like, we have no cartridges. Right. And so so in other words, there was an imperative to preorder back in the day if you really want something because it was not clear because there was no digital alternative and there was no back in the day. I mean, they did it a little bit on NES and on SNES, but not not to the degree they did it on PS1 and PS2, like the classics kind of series where they discount it. That really became a thing more. I mean, that was became a really common thing with with PS1 games, especially with the green, the green spine PS1 games and then the red spine PS2 games.",
            "start": 4730.54
        },
        {
            "text": "discount it. That really became a thing more. I mean, that was became a really common thing with with PS1 games, especially with the green, the green spine PS1 games and then the red spine PS2 games. But now there's an infinite amount of games. So there's no real reason to preorder anything unless you want one of the preorder bonuses, DLC or whatever physical good it is. Because if there if if Metal Gear Solid 5 is going to sell twenty million copies, let's say, I mean, it's not going to. Let's say it did and they only published one million, ten million of them. Well, there's an infinite amount of them you can download. So what would have me preorder is a discount. And I think that's the other thing. So like Gamers Club unlocked from Best Buy, I don't have to know where you are with this. It's a fucking great deal. You pay X amount of money a year for it and like there's discounts on it all the time that make it like dirt cheap. You get it for like twenty, thirty dollars for a year",
            "start": 4763.98
        },
        {
            "text": "It's a fucking great deal. You pay X amount of money a year for it and like there's discounts on it all the time that make it like dirt cheap. You get it for like twenty, thirty dollars for a year and you get so many things that entices you to preorder because it's like preorder is you have five dollars off. And it's like if you buy games like every month, that shit adds up so quickly. I think that's an enticing reason to preorder. Yeah. Should you have to pay to preorder, but. Darth Kovacs says, hi, guys, love your content. The topic is what's the game you spent the most time in? I think the the highest I've ever seen it, my in-game clock was one hundred and ten hours, which isn't that much. Yeah. In Final Fantasy 10, because I wanted all the legendary weapons and all the blitzball bullshit. And I wanted everything I wanted. I platinumed that game for all intents and purposes. And I would it was my routine every day I'd play and I played the game over a year and I would just play",
            "start": 4808.26
        },
        {
            "text": "And I wanted everything I wanted. I platinumed that game for all intents and purposes. And I would it was my routine every day I'd play and I played the game over a year and I would just play like half hour here, half hour here, half hour here until that all happened. But I definitely think the game that I spent the most time in is Smash Bros. Specifically, I would probably give it to Brawl like the most time dedicated to. Yeah, Brawl, Melee and then this Wii U one. But if you count Smash Bros is just one thing as a franchise, definitely hundreds and hundreds of hours. Sure. I mean, for me, it's hard because like so many games don't put clocks on them. Right. But I guess I can't think of. I mean, I got you talking about I was talking about Metal Gear Solid 2, right, that I platinumed that I did everything. I had the memory card. I heard that story. But the in terms of sheer numbers, it's DC Universe online, right? Like I'm six hundred hours into that game. Last time they did a poll of",
            "start": 4852.26
        },
        {
            "text": "I did everything. I had the memory card. I heard that story. But the in terms of sheer numbers, it's DC Universe online, right? Like I'm six hundred hours into that game. Last time they did a poll of my numbers, which is like sounds like a lot. Right. But then you got Simon at the end of the hall who put like what she put in a couple like thousand something or other hours into Guild Wars 2. Like, I mean, like that's just crazy. That's just how MMOs are, though. Right. I'm sure people now with Destiny are in that same loop of like that's the thing like Alfredo. I can't even imagine how many hours he's put into his competitive shooting stuff. Yeah. Yeah. Halo as a franchise. Holy shit. They even Counter Strike the people who play Counter Strike. My God. Because they've been playing that for years. Yeah. Yeah. Scary. Yeah, I don't know, it's impossible for me to say I've never spent a thousand hours with anything. Probably games, probably games that I've I've I've I wrote guides for back",
            "start": 4888.88
        },
        {
            "text": "years. Yeah. Yeah. Scary. Yeah, I don't know, it's impossible for me to say I've never spent a thousand hours with anything. Probably games, probably games that I've I've I've I wrote guides for back in the day. I would say like Grand Theft Auto 4 is probably when I spent a lot of time with Fallout 3. I spent about three months with. So, you know, nine to five, basically. So, I mean, that's a lot of time. But typically, you know, a game that I'll play for fun. I mean, I'm going to lose I'm going to lose 50 hours. I'm going to be like, I'm done. I can't do this anymore. That's just the way I am now. I used to be much more patient with and I wanted to spend more time with games back in the day because I felt like I was getting more bang for my buck. But it's just I'm an adult and I, you know, now and you have a little bit more disposable income and you don't have to you're not married to these fucking. The minute something doesn't have a decision. Yeah, exactly. So it's it's, you know,",
            "start": 4925.98
        },
        {
            "text": "now and you have a little bit more disposable income and you don't have to you're not married to these fucking. The minute something doesn't have a decision. Yeah, exactly. So it's it's, you know, I kind of pride myself more on not spending a lot of time with a lot of these games anymore because it's it means that there's a more variety of games to play and there's other things to do. You know, I could never spend a thousand hours with the game. I just can't imagine a game even existing that would be so good in my mind that I would spend a thousand hours with it or not worth 200 hours. So it's I don't know. That's just me. Amnesiac says, hi, guys. Just wondering what your thoughts are on emulation in video game piracy. Pirating a game that is still purchasable from the publisher on PSN or the Virtual Console, for instance, is wrong because you are not giving money to the people who created a game. But what about used games or games that aren't easy to find anymore? Take Little Samson",
            "start": 4963.82
        },
        {
            "text": "the Virtual Console, for instance, is wrong because you are not giving money to the people who created a game. But what about used games or games that aren't easy to find anymore? Take Little Samson on the NES, for example. That game fetches absurd amounts of money on the Web, costs about eight hundred dollars and has extremely little to no chance of ever being re-released in any form. So is it really that bad if you can if you pirate it? Also, the creators aren't getting any of your money when you buy a used game either. What's your take on emulation in piracy and when is it justifiable? I think I might be looser than you are, guys, without hearing your answers. Like to me, I think piracy is just part of the world and a part of how things work nowadays in the modern world. And they have been for the past 10 years. And while it is a bad thing, I think that the positives of it overcome the negatives in the sense that the people that are buying it, majority of them aren't going to buy",
            "start": 5000.02
        },
        {
            "text": "been for the past 10 years. And while it is a bad thing, I think that the positives of it overcome the negatives in the sense that the people that are buying it, majority of them aren't going to buy it no matter what. But I do think that you are getting more people to buy it based on trying it out, seeing if they like it and then getting into it. It's whether it's games, movies, music, anything. People are going to if they're trying to steal it, they're going to steal it. There's no way to police that. So I think that it's just something you just kind of kind of got to deal with. Like I, I think that when it comes to emulation, should I love it? It's a way for me to play games that I love. It's a way for me to play games that I didn't know about that people have talked about before that I just want to try and see if I like it. If they do release it on PSN or virtual console and all that. Yeah, I'll want to buy it. But at the same time, a lot of times emulation is better than their",
            "start": 5036.78
        },
        {
            "text": "I just want to try and see if I like it. If they do release it on PSN or virtual console and all that. Yeah, I'll want to buy it. But at the same time, a lot of times emulation is better than their emulation. All that is is emulation. So it's a question of money and where that money's going and all of that. And I don't know, I'll put my money where I need to put my money. But I think that if it's available and if you find a way to make it all work so that you can emulate games and stuff, that's on you. That's not the general populace. And that's not going to really make a big dent in anything. Same shit with, with us in videos. There's so many ways to scheme things to get all our shit free, even the stuff that we don't put out there free. It's a trust game and it's one of those things where we put out good products. People are going to want to pay for it. And if they see it for free, they're going to want it. Yeah, I don't think you're off base. I mean, like, you know what we talk",
            "start": 5073.06
        },
        {
            "text": "where we put out good products. People are going to want to pay for it. And if they see it for free, they're going to want it. Yeah, I don't think you're off base. I mean, like, you know what we talk about supporting developers by new instead of use. That's in the moment. You know what I mean? That's that's I'm talking about in the moment I'm talking about right now. You go out to buy Fallout 4, buy it new. So you get that. So the numbers are out. Don't wait for somebody to trade it in. You know, I mean, that's what I'm talking about in that moment. We're talking about an NES game and stuff like that. It's muddled. He's making the point right now. The money's not going to developers anymore. If it's going for eight hundred dollars or whatever on eBay, that's going to one person. And also, I would argue most people are trying to collect that, not get it to play it. You know what I mean? Not to have that. They want to round out. You're telling me people don't want to play Little Samson?",
            "start": 5115.9
        },
        {
            "text": "I would argue most people are trying to collect that, not get it to play it. You know what I mean? Not to have that. They want to round out. You're telling me people don't want to play Little Samson? No, they want to play. That's why they're emulating it. I'm talking about they don't want to play that one cartridge. They're spending eight hundred dollars trying to round out a collection. Right. So when we get down to that point, I have no it's one of those things where it's like, what's happening with video game history? Who's looking after all this? Where is all this going? You know what I mean? There's somebody cataloging everything so people can see where you've come. And when you talk about that, then that's when emulation pops up and isn't a bad thing. You know what I mean? Piracy. Piracy is bad in so many ways. You know what I mean? But I don't think in this sense it is. Because where can you easily go to get those games and figure that out? Is Little Samson all on the virtual",
            "start": 5148.46
        },
        {
            "text": "Piracy is bad in so many ways. You know what I mean? But I don't think in this sense it is. Because where can you easily go to get those games and figure that out? Is Little Samson all on the virtual console? No. Exactly. Right. Exactly. That's what I'm saying. Who even writes that game anymore? Big Samson. I'm of you know, I feel that my appetite for for piracy or emulation really varies depending on what we're talking about in the games we're talking about. We have to start from an intellectually honest place with it. Right. If you're emulating or you're pirating something, you're stealing it. And it doesn't matter if it's old or new, you're stealing it. And what you're doing is wrong and illegal in the main. Right. And that's just where we have to start with the conversation. So I start from that place because I think that if a game is currently available and easy to find and reasonable to find, then it's probably wrong to pirate it. So that even might go back to your PS2 or your",
            "start": 5179.82
        },
        {
            "text": "from that place because I think that if a game is currently available and easy to find and reasonable to find, then it's probably wrong to pirate it. So that even might go back to your PS2 or your PS1. I mean, depending on the game you're talking about. But I think at some point, just being again intellectually honest, is it really financially destructive for you to to emulate on Nestle, Batman from Sunsoft, which has no prayer of ever seeing the light of day again, probably not. What you're doing is illegal, but is it as illegal or unsavory as murder going on, going on a torrent and downloading Ex Machina, which just came out in the theater and is still very easy and cheap to find if you want to watch it as a movie. Right. So we have to I think we have to kind of look at these things in different kinds of ways. I don't think that it's necessarily wrong. It might actually be positive in some ways for people to be able to emulate any games, because a lot of younger people or people",
            "start": 5220.42
        },
        {
            "text": "in different kinds of ways. I don't think that it's necessarily wrong. It might actually be positive in some ways for people to be able to emulate any games, because a lot of younger people or people that don't have the means to acquire these games will never have an opportunity to play what I think is the greatest catalog of games ever. So I think we just have to start from an intellectually honest place, call it what it is, but then discuss what our appetite is for it, depending on where we are and what we're talking about. I don't think all things are necessarily created equal. And I think when a game is completely out of print and impossible to find and all that kind of stuff, then. Who like is what you're doing as a as illegal? Yeah. Are you necessarily hurting anyone? Probably not. Do I endorse you doing this necessarily? No. I mean, I again, like I think it's fine. You do what you want. It's up to you. But I just think that we have to just be you know, it's the same thing I",
            "start": 5264.54
        },
        {
            "text": "Do I endorse you doing this necessarily? No. I mean, I again, like I think it's fine. You do what you want. It's up to you. But I just think that we have to just be you know, it's the same thing I always talk about with ad blocking. I use an ad blocker now because I have read too much about these malware ads, fucking people's computers up. And I'm like, all right, that's on you guys now. Like that's not on me anymore. Like if this is really what's happening with ads and they're fucking things up, then show me your ads when I know they're safe. Until then, I'm not playing this game where my computer might get fucked up or whatever. So in other words, the impetus is on them to fix the problem. And some might argue in this in this regard that the impetus is on the license holders to proliferate these games if they don't want things to be pirated. But it's not always that easy. So, yeah. So it's a very muddled gray area and that's all it is. It's not good or bad. It's just muddled,",
            "start": 5305.06
        },
        {
            "text": "these games if they don't want things to be pirated. But it's not always that easy. So, yeah. So it's a very muddled gray area and that's all it is. It's not good or bad. It's just muddled, muddled and fucked up. And your opinion on it and your approach is going to be different. Exactly. And the funny thing about this is like, is it bad and is it wrong and is it stealing and is it whatever? Some of those things have answers and some of them don't. It is stealing. But guess what? Posting a picture you found on Google Images on your Twitter is stealing as well. So is that wrong? Are they equally wrong? That's what I'm saying. It's just the digital era has really, really confused the situation and made things difficult. And there's just hundreds of I mean, really, really get down to it. By the time we're older, there are going to be hundreds of thousands of games and of all stripes and all types and all indeed a triple A and all these kinds of things. And to Greg's point, who's keeping",
            "start": 5337.3
        },
        {
            "text": "the time we're older, there are going to be hundreds of thousands of games and of all stripes and all types and all indeed a triple A and all these kinds of things. And to Greg's point, who's keeping an eye on this stuff? That's important, too, from an historical point of view. But it's funny to see like some of these emulators not be able to deal with certain things. I remember there was an SNES, I think, SNES X or whatever. I don't remember what it was called. X-9. Something like that couldn't do Mode 7 or something like that. It would like and then there are games today that are totally intentionally broken for people that pirate them, which I think is totally funny and fine to do. And I love hearing that. That was funny. Yeah, the devs who put stuff in to trip people up. Yeah, like that. Like games just cannot be passed if you pirated them. And I think that that's fine, too. So there's ways for them to combat them. I do agree with your assessment anecdotally that there is no",
            "start": 5385.94
        },
        {
            "text": "that. Like games just cannot be passed if you pirated them. And I think that that's fine, too. So there's ways for them to combat them. I do agree with your assessment anecdotally that there is no evidence that a person who pirates a game is necessarily intending on buying it. But there might be the rare person that pirates it with no intention of buying it and then does buy it. So I mean, is there is there is there a benefit to it? There might be a benefit to it. I don't know. I mean, I was always the argument with Napster and shit like that back in the day, too. And I don't think that was true. The music industry is fucking dying compared to the way it was 15 years ago. So it does it does move both ways. It is a super complicated issue. And I my only thing is that I encourage people to play the games as they were intended to be played, if and when at all possible. So if you if you can get an NES, especially a top loading NES and acquire those cartridges, you should do that, because",
            "start": 5418.74
        },
        {
            "text": "play the games as they were intended to be played, if and when at all possible. So if you if you can get an NES, especially a top loading NES and acquire those cartridges, you should do that, because that is the way the game is played. And with with so few moving parts, no moving parts in an NES or an SNES, those those those consoles will last a lot longer than PS4 will. To why, you know, to which is why people are confused about, you know, are concerned about, well, how will I play these digital games? I'm like, well, that'll be figured out later. That's the other thing that bothers me is that everyone, you know, there's some people that act like it's like this, some sort of noble pirating is like some sort of noble thing you do to like sustain history. And I'm like, come on. That's why I'm saying let's just be honest about the intent of it and go from there. You know, final question. Final question of the day comes from Geeklet. What's the last game or console that you waited in a",
            "start": 5453.9
        },
        {
            "text": "I'm saying let's just be honest about the intent of it and go from there. You know, final question. Final question of the day comes from Geeklet. What's the last game or console that you waited in a midnight line for? None. We. Last console for me was we. That was question. Yeah, no game or console. Oh, I'm sorry. I thought he said game console. I see. I see what you're talking about. Game for me was brawl. Even though I had it already. Yeah, because I have the Japanese one, but then it was a tournament game spot stop. You gotta go. I was like, I have to do this. I can kick some ass because I had been playing for three months and those motherfuckers hadn't. See, I was such a big preorder. I don't. I can't think of a game line I stood in, right? Because I was always like, I'm not going to stay up till midnight. I'll wake up in the morning or go after class or do whatever it is. I mean, I got the Wii U, but it wasn't I mean, the Wii U was wasn't a midnight release. It was a 8 a.m.",
            "start": 5489.38
        },
        {
            "text": "to stay up till midnight. I'll wake up in the morning or go after class or do whatever it is. I mean, I got the Wii U, but it wasn't I mean, the Wii U was wasn't a midnight release. It was a 8 a.m. release. So I went at like four in the morning and waited for that. Totally worth it to come home and play New Super Mario. Wasn't it? I mean, speaking of preorders, I mean, preordering hardware was such a no brainer. Yeah, right. And that's why I didn't need to be there at midnight. I go to the next thing. I never waited in line once for anything like that. Like nothing. PS2 is not a single thing I can think of. Only consoles I can think of where I waited in line. Games wise, I can't think anything. Wow. There were so many games during that generation that I did. See, games were always like when I was into a game and I would tell the story of WrestleMania 2000, right? Like when I was fucking in on WrestleMania 2000, I knew that someone in the area would break street day. And that's why I'd",
            "start": 5533.74
        },
        {
            "text": "I was into a game and I would tell the story of WrestleMania 2000, right? Like when I was fucking in on WrestleMania 2000, I knew that someone in the area would break street day. And that's why I'd come home from school and call down a list of stores asking about it. And inevitably I'd get like, I remember WrestleMania 2000 was the Walmart. I was like, yeah, do you have WrestleMania 2000? Like, yeah. And I was like, what? Thank you. What? Wait, what do you have it? And like, yeah, on N64 I'm like, yeah, will you hold it? Like, no. I'm like, all right. And run out to the Taurus in there. Tear out, dry like fucking freaking out. Because that was the thing of like, I have to get it now before any manager shows up and realizes this is three days early. Yeah, that can't happen anymore. I was at so many midnight releases. Halo 2, Grand Theft Auto, Vice City, Grand Theft Auto, San Andreas. There's just so many games during that generation. Any game that had a real midnight release thing,",
            "start": 5571.18
        },
        {
            "text": "at so many midnight releases. Halo 2, Grand Theft Auto, Vice City, Grand Theft Auto, San Andreas. There's just so many games during that generation. Any game that had a real midnight release thing, because back then it wasn't everything. See, that's what I feel like. I feel like when I like when you're talking about Grand Theft Auto and stuff like that, I remember getting those on release day and stuff. But I and I'm talking about in Columbia, like I don't think the Columbia Mall did midnight launches for that stuff. They definitely did here. Like for my Wii, right? I went to the Columbia Mall at like three or four in the morning or whatever, where all the mall walkers are going and then just sat next to another guy and then eventually other people showed up and they opened the store at 10 or whatever. And we walked in, we ordered our Wiis and then left. And then I came back at midnight or whatever and walked in. I was like, here's my paperwork. My God, things got so like things were",
            "start": 5609.26
        },
        {
            "text": "or whatever. And we walked in, we ordered our Wiis and then left. And then I came back at midnight or whatever and walked in. I was like, here's my paperwork. My God, things got so like things were different here. There's so many people. Yeah. And it's like they didn't figure out that whole system until like the Wii U. Where it's like, oh, you can come back later and you'll be fine with the Wii. Oh my God. Me and Kevin, we ran that goddamn target block for like, we were there from 6 p.m. until 8 a.m. the next day. And that was the longest I've ever waited for something. Not happy about that. One of my friends decided like he needed to sleep and he could only sleep in his boxers, decides to sleep in his boxers in public. It's like it was the whole thing. Why is yeah, he asked the people next to us to borrow their sleeping bag and they got naked in it. In his boxers. Yeah. Slept in a little sleeping bag. And we got pizza. It was a whole. It was the only time I ever waited on like would",
            "start": 5643.5
        },
        {
            "text": "to us to borrow their sleeping bag and they got naked in it. In his boxers. Yeah. Slept in a little sleeping bag. And we got pizza. It was a whole. It was the only time I ever waited on like would wait on the line overnight for something. I guess it came to mind is when I was in college, I would go to Fenway Park and when the Yankees were in town, I would go to, you know, the Yankees would play in three or four game series at a time and they'd be in town typically three times a year. I would wait in line overnight. Ramon and I did it once together. And but you can buy two the night before or the morning of every game, they'll distribute like 200 standing room tickets at ten dollars apiece for any game. They did. I don't know if they still do that. And so I would go to one of the games myself and then I would buy tickets for the other ones and sell them to scalpers who would then sell them to other people and just make like like I would just make a ton of money. And because the Yankees",
            "start": 5682.86
        },
        {
            "text": "and then I would buy tickets for the other ones and sell them to scalpers who would then sell them to other people and just make like like I would just make a ton of money. And because the Yankees and Red Sox were like that was such a I mean, it's still a heat arrival rate. But that time in 2003, 2004, 2005 was it was fucking hitting its peak. So so that was the only time I ever did it was for like, you know, money. Yeah. I would sleep on like on the sidewalk next to like people and just wait and buy the tickets and then just there was like scalpers and they'd be like, all right, I'll give you forty dollars ticket. And then they would turn around and sell them for one hundred dollars and take it. And I just did that because I was like, all right, I don't want to get arrested or anything like that. So and then I would go to one of the games myself and just hang out. So, how fun. Yeah. That topic brought to you by Squarespace. Squarespace is how we make kind of funny dot com. And I'm in",
            "start": 5722.54
        },
        {
            "text": "that. So and then I would go to one of the games myself and just hang out. So, how fun. Yeah. That topic brought to you by Squarespace. Squarespace is how we make kind of funny dot com. And I'm in love with how it looks and how simple it was to make sites look professionally designed regardless of skill level. No coding required. Intuitive and easy to use tools with state of the art technology powering your site to ensure security and stability. Trusted by millions of people and some of the most respected brands in the world, including us. Starts at eight dollars a month and you get a free domain if you sign up for a year. Start your free trial site today with no credit card required at Squarespace dot com. Maybe if you get on it right now, you can get a website with your name without an underscore or a dot net. That'll be that'll be a great time. Fuck Unix, Scarpino. You piece of garbage. When you decide to sign up for Squarespace, make sure to use the offer code KINDAFUNNYGAMES to",
            "start": 5755.02
        },
        {
            "text": "underscore or a dot net. That'll be that'll be a great time. Fuck Unix, Scarpino. You piece of garbage. When you decide to sign up for Squarespace, make sure to use the offer code KINDAFUNNYGAMES to get 10 percent off of your first purchase. Colin, take us home. Build it, beautiful. Squarespace. Thank you guys so much. This has been the first ever episode 44 of the KINDAFUNNYGAMES cast. If you have topics for us, KINDAFUNNY forums. No, wait, hold on. KINDAFUNNY dot com slash games cast topic. You do that shit. It'll be good and everything will be fun. Thank you guys for joining us. Thank you. Thank you. Until next time. I love you, Cisco. Bye. You love Cisco. I love Cisco.",
            "start": 5787.26
        }
    ]
}