{
    "id": 3111,
    "video_id": "01AAPnpcpjk",
    "show_name": "Kinda Funny Games Daily",
    "hosts": [
        "Greg Miller",
        "Tim Gettys"
    ],
    "title": "Last of Us Part II, Spider-Man at PlayStation's Paris Games Week - Kinda Funny Games Daily 10.30.17",
    "description": "Tim and Greg recap all the news out of Paris!\n\n00:01:45 - Housekeeping\nExtra Life is Saturday, kindafunny.com/extralife\nCWG up\nWe are SO excited to announce Lights Off, our @Facebook Watch series! Let's play scary games...with the lights off. \nhttps://www.facebook.com/LightsOffShow/ \nThe Roper Report   -\n00:02:45 - Paris Games Week\n00:10:00 - PRESHOW\nGUACAMELEE 2! - PS4 - Soonish\n2018 gam3 - “world debut - john woo like --The HONG KONG MASSACRE\nTHE GARDENS BETWEEN - LATE 2018 - time pals - puzzle games - one button\nLOCO ROCO 2 REMASTERED - 12/9/17\nSIMS 4 (november 17) -\nTENNIS WORLD TOUR - SPRING 2018\nDisruptive games - 2018 - PSVR - MEGALITH\nTribetoy (dev) - 2018 PSVR - BOW TO BLOOD\nULTRAWINGS VPR - psvr - fly dem planes\nSurvios (dev) - SPRINT VECTOR\nMOSS - February confirmed\nSTAR CHILD - ooooook\nRE7 - Chris Redfield DLC - Free - NOT A HERO - 12.12.17\n Pixel Junk VR - DEAD HUNGRY - 10/31\n Gattai game) - STIFLED - PSVR - 10/31\nLEAGUE OF WAR: VR ARENA - 11/7\n FINAL FANTASY XV - 11/21\nFFXV IGNIS TRAILER - 12.13\n (hello there) INVECTOR - psvr - amplitude like \nOURE - available now (oh-ray)\n(mossmouth) SPELUNKY 2 - PS4\n00:11:18 - CONFERENCE BEGINS\nGhost of tsushima (Sucker Punch)\n(pixelopus) CONCRETE GENIE - 2018\n(playlink) - London Studio - real people - ERICA\nPSVR: ACECOMBAT 7, RE7, REC ROOM, MOSS, APEX CONSTRUCT, BOW TO BLOOD, LEAGE OF WAR: VR ARENA, STIFLED, SPRINT VECTOR, SMASH TRANSFERECEM HIT PLUNDER, STAR CHILD, ULTRA WINGS, DEAD HUNGYR, TRANSAFERNCE, EDEN TOMORROW, FFXV (MONSTER OF TH EDEEP), \nLondon - PSVR - BLOOD AND TRUTH - fps bond\nUNIQUE PS BENEFITS: Far Cry 5 (2.27/18)\nDestiny 2 - 12/5 - Curse of Osiris\nMONSTER HUNTER WORLD - ALLOY IS IN! - 12/9 ps+ BETA, ps EXCLSUIVE\nCOD WWII - 11/3 - The resistance 1/30 on PS4 first\nDetroit SPRING\nOnrush (summer 2018)\nTHE LAST OF US PART II\n00:25:00 - Nintendo financials\n00:30:30 - The official list of upcoming games\n Reader mail   -\n00:32:27 - No release dates!\n00:37:00 - What does Sucker Punch’s new game mean for Infamous\n00:40:12 - Should I restart Horizonor grind through it\n00:40:50 - Why no Vita!\n00:42:20 - Was The Last of Us announced to early?\n00:44:50 - Will Sony bring anything substantial to PSX?\n00:47:25 - Will Insomniac's Spider-man be too heavy with playable cutscenes\n00:49:28 - Why are so many games getting so violent?\n00:51:40 - Squad Up - Anderson Miller - billyrmiller14\n00:53:35 - You‘re Wrong\nTomorrow’s host: Andrea\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller and Tim Gettys talk about the biggest stories in Video Games.\n\nBackground Wall Art by Orioto - https://www.facebook.com/OriotoPosters/",
    "published_at": 1509396206,
    "duration": 3574,
    "transcript_chunks": [
        {
            "text": "what's up everybody welcome to Kinda Funny Games Daily for Monday, October 30th, 2017. I'm one of your hosts, Greg Miller, alongside the pure one at Tim Gettys. Let's him host more pure than ever. No BS, it's a good look though. It's not a good look. Okay, I look for the people watching. They don't know I did it for Halloween. I was Greg Miller. You still will be tomorrow too, as well. Don't worry about that for those listening or watching later, maybe on youtube.com slash kinda funny games or podcast services around the globe. We are rolling into this show as our post show for the PlayStation press conference out of Paris Games Week, hence why I'm in a t-shirt, no collar, no nothing happening here, just up up down down though. Big fan Xavier Woods. Ah, if you didn't know, of course, this is Kinda Funny Games, the Le each and every day on a variety weekday on a variety of platforms. We run you through the nerdy video game news you need to know about before jumping into your comments giving you some",
            "start": 0.0
        },
        {
            "text": "games the Le each and every day on a variety weekday on a variety of platforms. We run you through the nerdy video game news you need to know about before jumping into your comments giving you some perspective on the news, taking your bad PSN names and a whole bunch other stuff over at kinda funny comm /k f GD. If you like it, you have to be part of the show there. You can watch this recorded live on twitch.tv slash kinda funny games, but if you're not watching live, no big deal. You can catch it later on youtube.com slash kinda funny games or podcast services around the globe as the shows a bit different today happening very live being put together as we go really needs your help live viewers go to kinda funny comm /k f GD putting your questions comments concerns about what you saw at the Paris Games Week press conference. We can check it out there have you be part of the show everyone will have fun you need to do that on the other parts too for tomorrow show everybody else listen to",
            "start": 49.98
        },
        {
            "text": "paris Games Week press conference. We can check it out there have you be part of the show everyone will have fun you need to do that on the other parts too for tomorrow show everybody else listen to later watching later all that stuff also remember we need to be kept honest go to kinda funny comm slash you're wrong tell us what we screw up as we screw it up live viewers that way we can set the record straight for everyone watching later on YouTube and listening a podcast services in terms of housekeeping remember extra life is this Saturday that's right  4 hours of gaming for the big beautiful kids you can donate now go to kinda funny comm slash extra life you can also sign up though to be part of the kind of funny extra life team we're trying to raise $100 000 for charity please go check it out there's new cooking with Greggy up as well both on YouTube and patreon.com slash kinda funny and don't forget and Ranae the busiest lady in the business who will be here tomorrow on the show",
            "start": 89.34
        },
        {
            "text": "it out there's new cooking with Greggy up as well both on YouTube and patreon.com slash kinda funny and don't forget and Ranae the busiest lady in the business who will be here tomorrow on the show with Tim just launched a new show over on Facebook called Lights Off. You can check it off by going you can check it out by going to facebook.com slash lights off show it's her in the What's Good Game girls but for now let's begin the show with what is and forever will be the Roper Report terrible time for some news that was just god-awful I tripped I tripped as I was doing it God that was their worst one you've ever done no yes no embarrassment two items on the robe or two items yeah two items yeah nice barely a baker's dozen but it's a baker's dozen where the PlayStation News Tim we just finished the PlayStation press conference from Paris Games Week we're yet how you feeling mixed emotions yeah they hyped us up being III part to III Part two they said in some ways they definitely",
            "start": 127.41
        },
        {
            "text": "finished the PlayStation press conference from Paris Games Week we're yet how you feeling mixed emotions yeah they hyped us up being III part to III Part two they said in some ways they definitely delivered yeah Sucker Punch's game finally mean Ghosts of Tsushima seeing Last of Us Part Two cool things like that I'm like I get it I get where they're they're going there was a lot of really cool games that they showed those Erica's mom tells that Erica title everything without me yeah yeah so there was there was a lot of new stuff there was a lot of things we didn't see that you could say oh that's the second half of E3 but then they also kind of fell into the trap of just showing us all the things we've already seen before yeah Xbox recently did this at Gamescom I want to say it was where their conference was essentially three three again yeah this felt like that all new stuff whereas the the Microsoft they had a lot of like the exact same trailer yeah yeah this there was a lot of new",
            "start": 171.79
        },
        {
            "text": "their conference was essentially three three again yeah this felt like that all new stuff whereas the the Microsoft they had a lot of like the exact same trailer yeah yeah this there was a lot of new stuff for Spider-Man and God of War and you're right Troy's hitting you're hitting the nail on the head it was just the fact that yeah like what we talked about leading into this was the fact that if this is gonna be a three part two what that means to me at least and what you said as well was the fact that you would talk about we talk about III put expand on the information yeah here's a date for God of War here's a date for Spider-Man here's a better date for Detroit or something than that but we didn't get any of that right like the closest thing we get is like we you were like okay cool is that what we are we got a window for Detroit this time around or whatever right whereas spring yes which spring  8 that is good because Detroit was the one that we're like where does that fall all",
            "start": 213.61
        },
        {
            "text": "is that what we are we got a window for Detroit this time around or whatever right whereas spring yes which spring  8 that is good because Detroit was the one that we're like where does that fall all the rest of my cool first half but Detroit was the one that if I remember correctly was not included in that conversation you remember E3 and they showed a whole bunch of trailers that said  018 at the end of them Detroit didn't Shawn Layden said that if we showed a trailer that said  018 we mean it's gonna be out in the first half of  018 then at E3 David Cage said his game was  018 but this is trailer didn't say  018 no one understood what that meant yeah now we know spring  018 which is good enough by me I felt that game looked awesome I can't wait for it oh man what a great showing for that game I'm good they can stop chilling I like them to stop showing things because yeah it's I also love that we've seen so many different scenarios that all look very interesting yeah that game I",
            "start": 255.01
        },
        {
            "text": "that game I'm good they can stop chilling I like them to stop showing things because yeah it's I also love that we've seen so many different scenarios that all look very interesting yeah that game I think trailer demo is very well oh yeah because you can just kind of show like the options of what's going on it shows the scope of it obviously looks amazing spring  018 I think it's a good time for that game as well the pre-show overall adopted this what besides not getting release dates yeah I thought that this was a excellent press conference she cuz all of those games look great and I thought they'd it was very well paced and sure it's not year of dreams holy **** high moment high moment high moment but there was definitely some like oh crap things specifically Sucker Punch but I also liked it during the pre-show they got a lot of the VR out of the way and their commitment to VR is very impressive to me yeah I thought they would have given up a while ago and this is really showing",
            "start": 293.95
        },
        {
            "text": "liked it during the pre-show they got a lot of the VR out of the way and their commitment to VR is very impressive to me yeah I thought they would have given up a while ago and this is really showing like no we got everything ranging from the shitty like we we're trash yeah all the way up to like oh no we're actually gonna do quote-unquote triple-a experiences if you miss any of us you're watching us like for VR games they had megalith about a blood this is just an appreciator wings sprint vector was on there Moss again Starchild the Resident Evil Chris Redfield DLC dead hungry and stifles which are both out tomorrow Tuesday October 31st and scariest kind of games League of War VR arena Final Fantasy 15 VR mode in there in vector which I thought actually that was probably like the best-looking VR game they show that got me the most excited with the perception of that London thing later on but we'll talk about in a second in vector in the pre-show was the amplitude like one that looked",
            "start": 337.42
        },
        {
            "text": "VR game they show that got me the most excited with the perception of that London thing later on but we'll talk about in a second in vector in the pre-show was the amplitude like one that looked really good complaining it looked like a mix between amplitude thumper and race the Sun yeah and I'm that's sign me up I'm totally totally down for all that then you have have London London had a couple of psvr games in there no I'm sorry they had the London studio showed the Erica trailer which is a play link real people it's like actors up there on screen and you're making Mrs. G yeah in a lot of ways I that looked very very cool to me it reminds me a lot of what we've been seen recently with Until Dawn hidden agenda if this looked like the live-action version of hidden agenda up there that sounds like a cool way to have a movie plans go down for that but then London also had the PlayStation VR game Blood and Truth which looks like a first-person James Bond slap slash taken yeah I'm",
            "start": 380.86
        },
        {
            "text": "sounds like a cool way to have a movie plans go down for that but then London also had the PlayStation VR game Blood and Truth which looks like a first-person James Bond slap slash taken yeah I'm interested I have a feeling it's not gonna be very good I said it seemed like there was a lot of movement and that doesn't translate well to VR I don't think that we've figured that out yet so yours I don't think it was free movement I think it's gonna be that thing where you run into an area right I don't know if you how much you're choosing where to go I mean I think you're gonna get sick then there was a lot of moving around that I might but like what I thought it would looked interesting right was they were in the slowing down time like Max Payne shooting and I assume that's the way to get around it where this is a bit too much we see them super hot right we're sure it's moving but then you stop and it stops so you have that moment of like alright hole and get my bearings do this yeah",
            "start": 421.83
        },
        {
            "text": "around it where this is a bit too much we see them super hot right we're sure it's moving but then you stop and it stops so you have that moment of like alright hole and get my bearings do this yeah Resident Evil 7 I was running around doing stuff shooting stuff that's true not action length that we saw there yeah you're right for me the reason I think blood and shoots one to watch is the fact that it looked like at a glance obviously just a trailer it looked like a triple-a hey we're giving you a PlayStation VR get away yeah and it's like that's what we all say we want on VR right we see these things in alright we saw ultra wings right and it was like oh that looks like a Wii game you know what I mean but like Maus is doing something different with VR that's a super interesting this one looked to be different as well this one looked to be that more grown-up shooter you'd want out of yes person VR game and we got the the first look I want to say at the not a hero DLC for resi 7 oh sure",
            "start": 457.41
        },
        {
            "text": "to be different as well this one looked to be that more grown-up shooter you'd want out of yes person VR game and we got the the first look I want to say at the not a hero DLC for Resi 7 oh sure yeah and that looks okay so yeah no I'm actually not really that excited for it yeah it looks like it's a bit more of a action style Resident Evil game you're playing is as Chris and like that's all cool but there's something about seeing it on my own I'm not that interested it looked like it looked like a shooting gallery yes when I really I'm okay what I loved about ya what I like loved about resin evil seven right was the fact that it was hiding in this and that creep out factor it wasn't an action game yeah I think that it's good that they're doing this and it's different because it is speaking to a different audience of Resident Evil fans but not really for me okay Ural I didn't I have that numpy for you what other games off this list were for you Guacamelee to know but that that's a big",
            "start": 495.33
        },
        {
            "text": "to a different audience of Resident Evil fans but not really for me okay Ural I didn't I have that numpy for you what other games off this list were for you Guacamelee to know but that that's a big one okay yeah that's cool I'm happy they announced that their love drink box every knows that super excited to see them back super excited you this is only for PlayStation 4 is what they announced no Vita and obviously not gonna talk only other platforms but Wacom le - for real I really like the one thing I saw there was a  018 game this is again pre-show stuff was the John Woo like hotline Miami look I'm calling Massacre yeah that looked awesome a very interesting looking yeah I think it might not be that fun to play like just at least based on what was going on here it's obviously a dual stick shooter but how the cursor was laid out I was like man that is that is I'm sure that's so early that's not there you I you know I'm not gonna get hung up on the cursor I thought that graphics of it",
            "start": 538.25
        },
        {
            "text": "shooter but how the cursor was laid out I was like man that is that is I'm sure that's so early that's not there you I you know I'm not gonna get hung up on the cursor I thought that graphics of it looks great because it looked like it does have that like dark gritty John Woo action movie feel to it yeah and also it kind of reminded me of Shadow Complex sure I guess usually I'm sold beyond that we saw in the summer through pre-show games the gardens between coming in late  018 this is the time pals you know I didn't look great to me either but it's a one button exploring puzzle game whatever local Roco - remastered coming out December 9th  017 what's exciting about this is that I heard as little buzz about local Roco remastered 1 as I did about Patapon remastered 1 so if they're given this **** game a remaster unless Patapon remaster - what are you saying **** get that whatever local roca came out what three or four months before Patapon I feel like so like that gives a good",
            "start": 578.72
        },
        {
            "text": "this **** game a remaster unless Patapon remaster - what are you saying **** get that whatever local roca came out what three or four months before Patapon I feel like so like that gives a good window for me and maybe E3 maybe we'll hear something about a Patapon - they show it seems for expansion content tennis world tours coming spring  018 then we're into the VR stuff I talked about - do they showed a phantom this was even close to the first look at not a hero let me know if I'm wrong kind of funny calm / you're wrong but isn't this like the most substantial like trailer gameplay like scene I know we've seen images and screenshots and synopsis of it but I didn't know that we saw actual gameplay I saw some stuff for Final Fantasy Ignis saw Oh ray it's available now terrible name for that game terrible terrible then they shall send a Spelunky to for PlayStation 4 yeah people freaked out about that and then the real conference began and then that's and it kicked off with Ghosts of",
            "start": 623.3
        },
        {
            "text": "that game terrible terrible then they shall send a Spelunky to for PlayStation 4 yeah people freaked out about that and then the real conference began and then that's and it kicked off with Ghosts of Tsushima what did you think because when we saw it it was is this Onimusha holy yeah it had a very feudal Japan this could be only Musa vibe to it yeah and I was extremely excited obviously as a god further into it it became clear it was a naughty move **** I was like alright cool we would have seen some demon **** by now we shouldn't some orbs flying around or something so without that there was a moment where he called him samurai and I thought it was a seven no scales people lose my **** but we saw him earlier I'm like that's not Simon okay I'm interested I feel like it's a type of game watching it like once I realized it wasn't on him Usha I was like okay I'm not hyped about this - rod up like so shoot a blade or something like that that's what the chat was like okay it could be",
            "start": 668.4
        },
        {
            "text": "watching it like once I realized it wasn't on him Usha I was like okay I'm not hyped about this - rod up like so shoot a blade or something like that that's what the chat was like okay it could be something like that in which case I really don't care it ends in Sucker Punch that makes me go oh okay yeah this is this is big this isn't just like churning out samurai and that was mine watching the trailer I was like this trailer looks awesome in the vo from it sounded awesome right of like when he saw what you were training you and that's what was I doing I was learning I was studying you your traditions all I was like that sounds really **** cool the game the graphics of what they're showing looked really cool right and they're like the different outfits and clean the blade but my fear was if it was gonna pop up and be Bushido Blade - I was gonna be like I'm not familiar that series and that sounds super Japanese yeah of like and that's a cat's a style of action samurai game that",
            "start": 713.22
        },
        {
            "text": "was if it was gonna pop up and be Bushido Blade - I was gonna be like I'm not familiar that series and that sounds super Japanese yeah of like and that's a cat's a style of action samurai game that doesn't connect with me right like Dynasty Warriors I don't enjoy either mm-hmm when it ended with the Sucker Punch logo obviously I'm a huge soccer much fanboy that meant I was all-in and what it did I think meant for me was the fact that now it's going to be this westernized version of that right where it'll be the kind of combat I like there'll be the kind of storytelling I like it'll be the upgrade systems I enjoy so I'm totally yeah that's true it's definitely a game that I'm interested in seeing where it goes yeah I'm not hyped for it based on that it looks fine but it's like I feel like it sits I call that genre of game was once so prevalent and now it's not and I think it's cool it's alright cool here is a like you're saying more western version of it but I don't know like is there",
            "start": 751.8
        },
        {
            "text": "it sits I call that genre of game was once so prevalent and now it's not and I think it's cool it's alright cool here is a like you're saying more western version of it but I don't know like is there a place for that type of game see you're saying that type of game I don't know if it the with them doing it I don't think it's gonna be the type of game you're thinking is I don't think it's gonna be like action in terms of like rack up kills do this thing only Musha kind of gameplay I think it's going to be action-adventure like an Uncharted I think it's gonna be where people are always like they want the Assassin's Creed to **** go to Japan that's what I'm taking from it it's gonna be a third-person action-adventure kind of thing with role-playing elements in it I think it's gonna be more story narrative based you know think of the infamous world but you're a samurai alright now with the climbing probably yeah I don't know we'll see right now I'm like okay not like yeah okay I'll give",
            "start": 791.82
        },
        {
            "text": "story narrative based you know think of the infamous world but you're a samurai alright now with the climbing probably yeah I don't know we'll see right now I'm like okay not like yeah okay I'll give you oh my god I'm more excited Sucker Punch is finally **** putting on again yeah next up was pixel opus their game Concrete Genie which is cool Greg Delsin Rowe mashup yeah it's well I love it because it looks like a quirky PlayStation 3 game in terms not the graphics the graphics are great you're running around with basically a magic paintbrush it looked like on your back painting these really intricate things you're designing as you go creating creatures on the walls they interact to help you solve puzzles but then there's some bully kids that are bullying you up it looks like a cartoon eyes Delsin Rowe doing all this stuff but it looked like a weird PlayStation game that seems like it'd be fun to do which I don't think they do enough of anymore then yeah just showed Erica we got a",
            "start": 830.13
        },
        {
            "text": "eyes Delsin Rowe doing all this stuff but it looked like a weird PlayStation game that seems like it'd be fun to do which I don't think they do enough of anymore then yeah just showed Erica we got a PlayStation Viewer sizzle reel Erica yeah I am so excited for this again live edition one we brought in studio coming through there whoa you making me care about this type of game I'm shocked about that was not psvr though right no play link that was playing like that's a cleanly touch yeah that looks **** awesome yeah 100% if you're listening at home or you just watching you didn't see the trailer are yeah it's the trailer you're going through you know you're navigating the different choices up there there's a little bit interaction of like wiping a tear off or cheek and stuff like that but you seem to be living Erica's story and making choices for her as there's a little bit of crazy maybe demon ii kind of things happen anyone ever like don't open the seal don't see what happens there",
            "start": 875.67
        },
        {
            "text": "you seem to be living Erica's story and making choices for her as there's a little bit of crazy maybe demon ii kind of things happen anyone ever like don't open the seal don't see what happens there PlayStation VR like I said over there then they ran through the unique benefits you'll be seeing on some of their partner games they showed Far Cry 5 and coop of course Far Cry 5 coming out in February show destiny to a trailer for curse of Osiris the first expansion for destiny - coming December 5th that looks cool I'm you know in the destiny - I'm looking forward to playing that monster hundred world got a trailer it was like whatever but then at the end the a Louie was in it a Louie's a playable character in the playstation 4 version of Monster Hunter World awesome plus on December 9th PlayStation Plus gets a beta and I guess this is a PlayStation exclusive beta the show Call of Duty World War   obviously November 3rd the resistance however is the first DLC and it's coming on I think I",
            "start": 909.42
        },
        {
            "text": "Plus gets a beta and I guess this is a PlayStation exclusive beta the show Call of Duty World War   obviously November 3rd the resistance however is the first DLC and it's coming on I think I think I got this date right but again kind of funny complex you're on January 30th on PlayStation 4 first also I I'm that's like a sleeper hit for me of like man I'm still looking forward to that I really want that story of all of Duty World War   we'll see what happens then they showed that Detroit thing which was just **** phenomenal yeah you kidding me that was in there to it oh yeah they should but it wasn't like there was like literally no news about that yeah oh yeah we're partners just like here's the trailer for Battlefront was like now yeah anyways Detroit that popped out the joy oh god that looks so great this one was Cara the robot you know well from the originally the sexpot but now in this game this game world getting brought new new house she had had her mind wiped you know trying",
            "start": 950.16
        },
        {
            "text": "looks so great this one was Cara the robot you know well from the originally the sexpot but now in this game this game world getting brought new new house she had had her mind wiped you know trying to connect to this kid and clearly the dad's piece of **** and so like how are you gonna save it and they showed all the different outcomes the cells are out of that trailer I can't wait for that game it's pretty or spring  018 which we can say no it looks beautiful yeah one of the other partner games or whatever was on rush but oh yeah this racing single masters yeah look pretty good yeah cuz I know it's like those type of racing games they're a little generic and same Z but I was like alright that one looks nothing that's do anything different but it looks like it's have a level of quality that I think we haven't seen for a while for that type of game at least in the PlayStation ecosystem I got another look at got a war still no date we thought I thought for I thought that one was the",
            "start": 992.46
        },
        {
            "text": "that I think we haven't seen for a while for that type of game at least in the PlayStation ecosystem. I got another look at God of War, still no date. We thought I thought for I thought that one was the shoe shoe. When we when we saw Spider-Man, a great trailer focusing on Peter. Peter talking MJ saw a May for the first time. See Peter and Miles working together when he brings them together. South the Kingpin saw a whole bunch of characters in a good trailer in terms of here's a taste of that world. Yet again, what I really appreciate about Spider-Man from Insomniac, right how they're promoting it is they're like Mr. Negative, here's Mr. Negative blowing this up. It's an Osborn mayor rally, he blows up some stuff and it's like we already know that's not the main villain. He's a villain in this world in this game. Yeah, so my name is Spider-Man obviously that looks great. One of my most hyped games for next year for sure. That trailer got me hyped. I'm liking it. I'm a little worried with how much Mr.",
            "start": 1029.33
        },
        {
            "text": "in this game. Yeah, so my name is Spider-Man obviously that looks great. One of my most hyped games for next year for sure. That trailer got me hyped. I'm liking it. I'm a little worried with how much Mr. Negative we're seeing now cuz we're seeing him in a lot of different place. It wasn't just the mayor little whatever the **** was going on. Yeah, rally. Yeah, yeah, so I hope that we're getting a lot of bad guys. It's like I hope that there's a lot more than that because Mr. Negative wall cooled isn't doing something that's different. I I I want I'm looking for something a bit more traditional at least when it comes to the villains at least for boss fights or appearances and we'll see way too early. But the one thing that I was kind of about is the character models don't really look that great for in the cutscenes when not Mastan stuff gameplay looks totally fine. Yeah, more than fine, it looks great. But like seeing Mary Jane like she looked really plain. Yeah, and I was kind of like Peter mm-hmm I'll",
            "start": 1069.78
        },
        {
            "text": "the cutscenes when not Mastan stuff gameplay looks totally fine. Yeah, more than fine, it looks great. But like seeing Mary Jane like she looked really plain. Yeah, and I was kind of like Peter mm-hmm I'll give it to you. Yeah, there's something I thought to it didn't look a hundred percent right not that it's wrong but it's like something different to be fair. I think that out of the context of it being next to Detroit and Erica and Last of Us and all these things are like holy **** the character models look amazing. Yeah, maybe it won't be that distracting but I think it's what for me or that I had a similar reaction to it where I was like this doesn't look right why not? I think it's gonna be that I think it is the juxtaposition of shoving him in there and when we get into this world you know I mean just slowly get into it. I think hopefully it'll turn around and not to mention the game apparently sales time 2018 is all we know. Um anyway so that was their God of War was there another look yeah",
            "start": 1110.7
        },
        {
            "text": "just slowly get into it. I think hopefully it'll turn around and not to mention the game apparently sales time 2018 is all we know. Um anyway so that was their God of War was there another look yeah he played this time the kid getting involved talking talking a lot. You don't like that? No, talking a lot more than uh I've been led to believe yeah from talking to Koi it's just at E3 maybe it is just the scene but like they've been really going out of the way it's being like this isn't just a you know you have here your partner this has to be there you have to protect and you know worry about like they're the kids part of the gameplay and to make things better. I mean we saw it even to this where it's like oh look up look behind you and it's like that's cool but then there was a lot of extra like what you'd expect from that type of thing of just like see you later as he kills someone it's like I don't that I'm need that McGann yeah I do like that because I think that's the thing is like my",
            "start": 1151.38
        },
        {
            "text": "what you'd expect from that type of thing of just like see you later as he kills someone it's like I don't that I'm need that McGann yeah I do like that because I think that's the thing is like my problem with Kratos always has been the right there's no range of emotions so if the kid's gonna be there to give me levity and I tell me a story of like how he's all scared of the Soul Eater he's like mom mom made him out to be scary or whatever it's like that's really cool not enough for me to like fully judge but I I was a little bit like ah this is going further than I'd like in that direction because we've seen games like that before sure and I hate aren't you know I'm just very excited for all those things it's not it's not gonna stop me from playing the game but sure I I was excited that they were doing something different and this is giving me little hints that maybe they're not I I think the relationship will evolve over time I think well I mean maybe that's early in the game before",
            "start": 1192.6
        },
        {
            "text": "were doing something different and this is giving me little hints that maybe they're not I I think the relationship will evolve over time I think well I mean maybe that's early in the game before we like **** snap at him and make him hate us because that's exactly I don't want dad to die but he's also a dick that's always the problem with them mmm and then yeah Last of Us Part II closing it out there in a crazy **** brutal disgusting trailer that didn't feature Ellie didn't feature Joel very if they showed it who that that's surprising yeah right yeah yeah it wasn't Days Gone. Days Gone it's not even mentioned which is telling I don't know where's that game I might another one that I thought was a for sure gonna get a release date or at least a when well I think here's the thing right is that you have to pick your battles like the problem I had with that trailer at the end there right was the fact of it popped up and for a while I'm looking at the chat I'm debating publicly",
            "start": 1233.82
        },
        {
            "text": "right is that you have to pick your battles like the problem I had with that trailer at the end there right was the fact of it popped up and for a while I'm looking at the chat I'm debating publicly to what it is or whatever and it's like are we is this Days Gone is this Last of Us and that's a problem for PlayStation 100% and so you have to if you're gonna show one of them I don't think you show the other one and so you know outside of an announcement thing or some like that but maybe they showed here and then maybe at PSX they come out no like hey here's Days Gone here's the trailer here's a demo here or you know here's a date yeah yeah yeah we'll see I mean it looks awesome not much to say it's like holy crap Last of Us we know what's gonna be good all right my feelings and motions on it I think that it's great that they're not showing Ellie I think introduces two new characters and say hey this is gonna be different yeah that's important uh it was very brutal with ya it's good",
            "start": 1278.73
        },
        {
            "text": "on it I think that it's great that they're not showing Ellie I think introduces two new characters and say hey this is gonna be different yeah that's important uh it was very brutal with ya it's good because it shows that game's not afraid and it's going in however I don't know that we needed something that brutal like that was that was a lot for a promotional thing sure but whatever that also is differentiating it from something like Days Gone. Yeah, a lot of people to chat shouting out that they think it's Ellie's mom being put up because she did pull out the knife and put it to her belly and talk about something inside her being whatever so maybe she's pregnant with Ellie at that point. Oh Sophia flashback in Ellie story or whatever which is interesting I was wondering what the tie-in cuz when they pull out the one girl they say Clipper wings and I was like oh like a Firefly but then she was also talking about like she was using code words for people in summons or something like that",
            "start": 1321.09
        },
        {
            "text": "when they pull out the one girl they say Clipper wings and I was like oh like a Firefly but then she was also talking about like she was using code words for people in summons or something like that or ever I don't for some reason I took notes on that and then they are gone so I don't know but I have words I wrote down or ever interesting I thought make sense yeah that definitely makes sense to go back and show that one right and come back to it that way overall a good conference the problem is I think we should overhyped I think all the games look great I'm super excited for him I can't wait for him but it was just interesting I think to go hard here like this I feel like we're still coming in to Black Friday we're still coming in everyone want you know by PlayStation horizon I even talked about they showed I don't know if someone else got sleep they showed a horizon of course and for some of the frozen wild stuff are there which obviously looks like more horizon I'm all about but I",
            "start": 1363.73
        },
        {
            "text": "about they showed I don't know if someone else got sleep they showed a horizon of course and for some of the frozen wild stuff are there which obviously looks like more horizon I'm all about but I feel like this would have played better and messaging after the fact that PSX I feel like that would that's where I would have done this not but I don't know what the **** do I know up isness you got to take care of your partners no dreams began out a big point to make the dream is dead tree was dead dreams I dreamed a dream and now it's gone forever good lord I do want to give a shout out to the presentation overall of the entire thing cos man I going into I was like dude the video all looks awesome yeah they did such a good job with it and again I think the pacing of this presentation was fantastic so he's been killing it the last couple years with all this and I think that this is even more of an evolution of that like just thinking about this like what's E3 gonna look like next year",
            "start": 1402.97
        },
        {
            "text": "fantastic so he's been killing it the last couple years with all this and I think that this is even more of an evolution of that like just thinking about this like what's E3 gonna look like next year exciting stuff yeah of course yeah really so yeah go back and watch it or of course if you missed it you're listening later watch later we're putting up our reactions live reactions to the stream on youtube.com/kindafunnygames you can watch along with us get it all there but stand out what's your favorite thing you saw oh it real quick Jacob Bluffer from the chat says breaking news from Wario 64 the YouTube description of the Shadow of the Colossus trailer confirms February 6 2015 in the Shadow of the Classes was there - I don't know what the **** yes and that's surprising - that looked great and again I can't believe that games real like I can't believe they're remaking Shadow of the Colossus that's awesome and I don't look fantastic and it looks a lot further along than I would expect so",
            "start": 1442.51
        },
        {
            "text": "again I can't believe that games real like I can't believe they're remaking Shadow of the Colossus that's awesome and I don't look fantastic and it looks a lot further along than I would expect so meanwhile though we shouldn't be looking a chat button anyways and we don't do it but it's different show days different I mean falses they just announced to switch Rocket League really the hot cheese I need a clock Rocket League switch release date yeah let me see if I get that for you sure here we go yeah November 14th your release date for Rocket League on Switch is right around the corner wait yeah that's a good no let me drop that back in a new date so I don't forget so right I guess I did it here but again who knows anyone yeah no no I don't know how to do show when it's actually live for more breaking news and I don't have time to gather everything up but Rocket League switch November 14th get hyped um speaking of switch Craig way second item on the Roper Report are the Nintendo",
            "start": 1480.74
        },
        {
            "text": "for more breaking news and I don't have time to gather everything up but Rocket League switch November 14th get hyped um speaking of switch Craig way second item on the Roper Report are the Nintendo financials this is from ign.com worldwide sales of the Nintendo Switch version of The Legend of Zelda Breath of the Wild have reached 4.7 million units according to sales data from Nintendo this figure was reached as of September 30th 2017 it's worth empathizing and emphasizing that this is just the switch version of the game and doesn't account for sales of the Wii U version for a look at the top-selling Nintendo Switch titles check out this list below Zelda 4.70 70 million units Mario Kart 8 deluxe 4.4 million units Splatoon 3.6 1 million units 1 switch 1 point 3 7 to 8 units in arms 1 point 3 5 million units these figures include units bundled with hardware as well as downloadable versions you can read the additional salesmen over here it's financial thing more content for The",
            "start": 1532.49
        },
        {
            "text": "1 point 3 5 million units these figures include units bundled with hardware as well as downloadable versions you can read the additional salesmen over here it's financial thing more content for The Legend of Zelda is coming this year with the second DLC pack the Champions Ballad slated to launch in 2017 you call that when we were talking earlier in the pre-show pre-show about that stuff that excuse me that that's been reconfirmed by Reggie correct mm-hmm yeah that Breath of the Wild DLC pack will be coming sometime in 2017 by the end of the year you got imagine that that is well all we have left is November in December my gut would tell me December however the legend is all to breath the wild champions amiibo pack o comes out November 1 I want to say ok that sounds kind of perfect yeah but don't think we do is that a game you need to get hype about though you think we need to know about that ahead of time or is that just something you can put out and well the thing is going off",
            "start": 1580.79
        },
        {
            "text": "but don't think we do is that a game you need to get hype about though you think we need to know about that ahead of time or is that just something you can put out and well the thing is going off these numbers 4.7 million people have the game right so cool yeah they're there and it's like I think yeah they need to know about it but I also we're not gonna get like a direct for it I wouldn't imagine I think I'll have like a press release announcement hey it's out today the switch has a great thing going on with you turn it on there's all the news and yeah does a good job of communicating what you need to know so you can stay out of the way of Mario right now yes continue hundred percent rock shot over social media and you can get away from it because it's phenomenal it is fun nominal do for Media Molecule lay it on me oh god when the Twitter Congrats to all the worldwide studios team showing at Paris Games Week those amazing trailers are getting us extra excited to share news soon",
            "start": 1629.77
        },
        {
            "text": "for Media Molecule lay it on me oh god when the Twitter Congrats to all the worldwide studios team showing at Paris Games Week those amazing trailers are getting us extra excited to share news soon hashtag Dreams PS4 Sam s finale response how long though it's been ages now Media Molecule says this year heart okay so maybe PSX for them maybe the beta was supposed to be in this summer no one ever **** ever popped up us talking about that we love you medium Alec I'm just worried about you over there I need to get car in the room with you figure out what's going on over there save the day can't wait for **** goddamn Detroit can't wait him to troit sadly I have to keep waiting for Detroit Tim yes but if I want to know what was coming out today where would I go about a Nintendo thing I don't know you wanted to keep reading the chat and keep ignoring the chat off you're done you're dead to me thank you what's the important news there though I wanted to know you did well a ruck shot kind",
            "start": 1668.95
        },
        {
            "text": "know you wanted to keep reading the chat and keep ignoring the chat off you're done you're dead to me thank you what's the important news there though I wanted to know you did well a ruck shot Kinda Funny Games Daily but you're used to were hanging up the the Nintendo financials coming out switch only selling a little over two million in America something about that seems off to me but it was the old figure is that a dance yeah couple days ago they put out and that's what they said okay and it's like ooh that's not as much of a runaway success as I would have thought it well that's cuz they got in their way that stores now they can now there's anyway yeah I get it and you know we'll see you like especially with the holidays coming up and those those numbers are tied to it coming out in March and all that stuff but like that's making excuses like talking about the switch everyone's acting like it is the biggest thing ever and it is in relation to other things but two million America",
            "start": 1715.0
        },
        {
            "text": "March and all that stuff but like that's making excuses like talking about the switch everyone's acting like it is the biggest thing ever and it is in relation to other things but two million America not what I'd expect I would have expected it to at least be around for hmm I think I think would have kept them in stores it would have yeah I think they **** got in the way of themselves on that one but I think now you'll have a holiday season where they don't I think the fact that now that's available you can go get it the fact that they're in target it's gonna last one week by the way if you want to attend a switch your time is now really yeah we think it's being closer closer to Christmas your time like honestly once we get into second week in November these things are gonna be gone mmm-hmm this history has shown that even like with 3D asses that you can't get them during the holiday season gotcha they just yeah I was the Vives gone I was sure I wanted to get a gen Demario bundle or",
            "start": 1759.32
        },
        {
            "text": "this history has shown that even like with 3D asses that you can't get them during the holiday season gotcha they just yeah I was the Vives gone I was sure I wanted to get a gen Demario bundle or whatever so I could have the red joy con she could have Mario in the game or the system and so yeah I kept doing the Game Stop thing where you're like putting your zip code and I'm like try to have him hold it it's sores and it took me like it was like the third game stop I put in there that actually had one hell yeah I mean but yeah interesting who knows who knows who knows anyways where do I go for games oh you can go to the just take a shot mom-and-pop digital drop shops and uh snuffleupagus write Games Daily show host hey go nailed it out today King Oddball on switch Long's Dimension on PC wanderlust on PC new dates as I said Rocket League is coming to switch now on November 14th shout out the class is apparently coming out the 6th of February 2018 Destiny - I'm going back now through the",
            "start": 1801.74
        },
        {
            "text": "on PC new dates as I said Rocket League is coming to switch now on November 14th shout out the class is apparently coming out the 6th of February 2018 Destiny - I'm going back now through the nose Destiny - December 5th cursed Osiris but I guess from like you know we don't look at a chat usually when we do the show because it supposed to be a polish podcast but today is a special exception so I guess I don't have to worry about you and your car right now driving to pick up your laundry you already knew all this from the beginning its the twitch people who come in and out they got a recap information for it's a polished video polish podcast so I don't have to do it I just saw over here - by the way place they should be our Star Child what a terrible trailer that was for that game some kind of narrative VR experience game thing they're gonna put out there but then like the trailer was just like her making a phantom hand and touching stuff no no not gonna have that I don't have any deals",
            "start": 1846.92
        },
        {
            "text": "of narrative VR experience game thing they're gonna put out there but then like the trailer was just like her making a phantom hand and touching stuff no no not gonna have that I don't have any deals for the day for you but instead I do have reader mail remember we're doing a reader mail live now which is weird you go one just is one time because again show ended we went live we're recording right now 10:0 in the morning usually the show gets recorded what Kevin noon noon 30 sorry we're a different kind of show today so I'm jumping in to the chat here to see what we got down or not the chat I should say but kind of funny comm /k f GD be part of the chef you're listening later of course you can do it people worry about that dreams of course as you do more or the crying you don't know what you don't apologize it's a hot show we're coming in hot today that's what people want to we're gonna start with Edison Kane the theme of this show was no release dates has the string of game delays",
            "start": 1888.45
        },
        {
            "text": "you don't apologize it's a hot show we're coming in hot today that's what people want to we're gonna start with Edison Kane the theme of this show was no release dates has the string of game delays made Sony back away from hard dates until the closest possible moment 100% yeah and I think it's a it's a wise strategy I mean it's easy for us to be very critical of this conference for not giving us those release dates who does that really affect no one right it's just we're looking at as people that want news that that are looking to these conferences to tell us something new about games to the general public this conference was a success they're gonna be able to not watch it they just go on YouTube in pick and choose the trailers that they're gonna watch and got a war and Spider-Man and Detroit are gonna get them excited so I think that in that it's doing its job and I think that yeah what is bad press delays sure sure sure it sucks because I want to be able to look forward and",
            "start": 1934.41
        },
        {
            "text": "and Detroit are gonna get them excited so I think that in that it's doing its job and I think that yeah what is bad press delays sure sure sure it sucks because I want to be able to look forward and understand what we have to talk about coming up but that's all right it's still there it's it's it's weird I still wonder maybe the the wild card this entire conversation is PSX in the way that is this a one-two punch now do we get to PSX and stuff gets started now and put out release dates there you say something else there game Awards is that what you're looking for you looking for that bump where you have an ultimate cut of Spider-Man God of War trailer that goes out and actually ends with the date there no I feel because I I thought I feel like Paris is a weird placement for a conference period in the way that traditionally you're still hyping your holiday releases for 2017 we shouldn't be you wouldn't have them looking at 2018 and that's what I love so much about PSX in the past is",
            "start": 1980.08
        },
        {
            "text": "period in the way that traditionally you're still hyping your holiday releases for 2017 we shouldn't be you wouldn't have them looking at 2018 and that's what I love so much about PSX in the past is hey we're past Black Friday people have bought the games are gonna buy let's talk about what's coming to get you hyped for next year and that's what I liked about it and I don't know how that fits into it anymore yeah it's interesting Game Awards maybe one we're not gonna see multiple but you have to to just kind of think about it like if the games are coming out let's say if there's any coming out in January or February yeah that date has to be announced sometime in early December so that does place it at PSX and Game Awards yeah so you'd imagine if one of those has a release date that's that early they would be game awards or PSX it's one of those two with the now I think it would be eyes - well **** did I was straight this did it was Days Gone one of the ones that he threw the head",
            "start": 2032.67
        },
        {
            "text": "early they would be game awards or PSX it's one of those two with the now I think it would be eyes - well **** did I was straight this did it was Days Gone one of the ones that he threw the head 0:18 in the trailer I don't remember I think Days Gone was one that didn't okay okay yeah right so - easy Game Stop is putting in the first half of 2018 not that that's like yeah Bible truth or anything the interesting I mean here's that that would be your ace in the hole still right all right cool we ended with last first part to hear a zombie post-apocalyptic yadda yadda in a world now let it die down for a few weeks come out at PSX and be like hey Days Gone is coming and it is coming February or whatever it is coming in though in that window that was so successful horizon and it's been so successful for me that's to me honestly that seems like the right place four days gone is put it out when horizon came out and give it that same type of push yeah that is it's only real chance at",
            "start": 2082.6
        },
        {
            "text": "so successful for me that's to me honestly that seems like the right place four Days Gone is put it out when Horizon came out and give it that same type of push yeah that is it's only real chance at success otherwise it's gonna get drowned yeah yeah exactly there's gonna be so many other bigger things coming up right also from kindafunny.com/kfgd the place you can go to be part of the show Alex B says on the topic of lack of a release dates am I crazy to believe that Sony is waiting for Red Dead Redemption release date in order to put three triple-A exclusive titles and the best position to succeed I don't think you're crazy I don't think that's likely yeah like I have you've got to imagine that Sony knows its partners and knows where they're going and they can only kind of make their roadmap to the best of their abilities sure and I think that they're already competing with their self and so many ways like we were just talking about that I think they can only worry about that",
            "start": 2132.85
        },
        {
            "text": "roadmap to the best of their abilities sure and I think that they're already competing with their self and so many ways like we were just talking about that I think they can only worry about that stuff and they know that Red Dead is gonna be great I don't think there's gonna worry about Red Dead competing with their products you'd like to think so you'd like to think they have inside information too obviously because they have to in terms of like one stuff is coming I'm gonna keep going through this now here gonna do this while I talk to you ah Angelo or e Emma writes in to kind of funny calm /kfgd just like you can and says one more question guess what this is your first question don't **** worry what does Sucker Punch this new game mean for the future if Infamous do you think it's officially dead or held back for now thanks for all you do Angela a lot of people are freaking out dead in the chat like we've had a lot of Infamous games and I'm speaking as somebody who loves Infamous",
            "start": 2180.31
        },
        {
            "text": "dead or held back for now thanks for all you do Angela a lot of people are freaking out dead in the chat like we've had a lot of Infamous games and I'm speaking as somebody who loves Infamous don't get me wrong it's the fact that what include if you include the vampire game we have four Infamous games that are like on their own that were great and awesome and all you know all told fantastic but a significant chunk of time for Sucker Punch from PlayStation 3 to PlayStation 4 working on this series I'm sure they want to stretch their legs and do something different that feels something different I think that's what it means Infamous is not dead I would imagine the next time Infamous comes around it would be a reboot in on the PlayStation 5 or something that effect where it is just like we're going back it's Cole MacGrath or not maybe not even reboot maybe it just is a it coals back or something maybe it won't be cool if it isn't dead everybody loves **** superheroes Sucker Punch loves",
            "start": 2222.83
        },
        {
            "text": "we're going back it's Cole MacGrath or not maybe not even reboot maybe it just is a it coals back or something maybe it won't be cool if it isn't dead everybody loves **** superheroes Sucker Punch loves making those superhero games I'm sure you'll get another giftmas down the lane line I just think it's about time to start something in this ghost game I think it looks awesome Italy sure see the storytelling lessons they've had the gameplay lessons they've had and they combine that into a new IP and part of that I'm pretty sad that like if somebody had it in here hold on let me see where I can find it again  somebody's question was what was your thing they're asking what your favorite game wasn't wise Detroit was your favorite announcement out of there there's a lot of awesome stuff there do this is all my list really in terms of like well it was okay even before they put soccer punch on the screen I was like man this trailer looks cool I hope it's gonna be gameplay I like I know I",
            "start": 2265.73
        },
        {
            "text": "do this is all my list really in terms of like well it was okay even before they put soccer punch on the screen I was like man this trailer looks cool I hope it's gonna be gameplay I like I know I like Sucker Punch gameplay I like I holds narrative they were telling they're just like I studied you like I think that's so cool to have a villain who's going up against somebody who's like a warrior right but he studied traditions this villages that sounds **** awesome yeah top of my list but it's on my list I think for me Erica would be the top of my list yes because didn't that's brand new to me and I was like oh this looks really awesome it does look very similar to Detroit that every time I see Wow's the hell out of me I'm like **** this is gonna be so awesome yeah Spider-Man it just looks so great yeah I'm just like there's gonna be such a fun game to play so Spider-Man out of everything I've seen this one I want to play the most yeah Erica's the one that I'd be like Oh from this",
            "start": 2305.53
        },
        {
            "text": "so great yeah I'm just like there's gonna be such a fun game to play so Spider-Man out of everything I've seen this one I want to play the most yeah Erica's the one that I'd be like Oh from this presentation like that I'd give that my o like you for me it was Detroit I mean in terms of like the game that like won that from all the stuff we saw today the stuff that I was like holy **** yeah I can't wait to play that Detroit and that's why it was to that we had had the blue balls for a couple trailers there where they and it like any but real date no real big **** no one is Detroit as like if Detroit's coming out in February holy **** I mean the story of Detroit from everything we've seen from all the different scenarios it's like especially coming off with Blade Runner right now and Adam I yeah it seems like they're about to nail that similar kind of androids have feelings too androids are people getting on it's gonna be good no that's always such an interesting one and like -",
            "start": 2347.23
        },
        {
            "text": "Adam I yeah it seems like they're about to nail that similar kind of androids have feelings too androids are people getting on it's gonna be good no that's always such an interesting one and like - what's interesting is watching it and how it as usually with any Quantic Dream the threads they're tying together where it is like car comes back reset right and then starts waking up and having to break her own protocols and then all these other AIs is doing the same thing and leading a rebellion like can't **** wait John writes it kinda funny calm /ke fgd and says I've yet to finish Horizon Zero Dawn and when jumping back into it I was completely lost with the DLC coming out should I look into restarting it or just grind through the main story mission to get to the end and be ready for a new content I like when you say grind I mean do whatever is gonna be enjoyable for you I thought Horizon's story was awesome I'm the gameplay was great I can't wait for first wild mm-hmm I would say you",
            "start": 2383.92
        },
        {
            "text": "content I like when you say grind I mean do whatever is gonna be enjoyable for you I thought Horizon's story was awesome I'm the gameplay was great I can't wait for first wild mm-hmm I would say you guys you got to do what you want to do but I seems like a lot to go back and restart it yeah I wouldn't restart it I mean well you're talking about grinding through the story like it it's doable it's easy to to find just the linear story path and play it more like an in charge that's what I did and I enjoyed it a lot so I would recommend doing that teni writes in it kinda funny comm /k f GD and says y know Vita because honey sit down we have to talk about the Vita it's over and it's hard for me to say - I'm not a fan of saying it I know there's still plenty of Indies and Japanese companies supporting the Vita PlayStation is not one of them PlayStation is not someone supporting the Vita don't worry you have a great library of PlayStation Vita games there's still great stuff coming to the",
            "start": 2424.93
        },
        {
            "text": "the Vita PlayStation is not one of them PlayStation is not someone supporting the Vita don't worry you have a great library of PlayStation Vita games there's still great stuff coming to the PlayStation Vita but I was more impressed that they put PlayStation VR in the **** sizzle reel yeah and it was PlayStation 4 PlayStation 4 Pro and the VR headset I was like alright and they actually had a bunch of VR games in there like yeah that we're seeing the baby steps - all right here's London's game blood and whatever it was and it's gonna be a real quote-unquote game from what it looks like yeah no I was very impressed with what in truth the pacing of the presentation from the pre-show through the normal show of how much time they gave to PSP are how much time they gave to indie games how much time they gave to third-party how much time they gave to exclusives like our first party it I was like wow it is the most balanced conference I think we've ever gotten interesting uh what I like",
            "start": 2471.89
        },
        {
            "text": "much time they gave to third-party how much time they gave to exclusives like our first party it I was like wow it is the most balanced conference I think we've ever gotten interesting uh what I like that how they really made use of the pre-show the pre-show was really well done shout out to Sid and crew over there that was a really good one James writes in says sup guys that Last Of Us Part Two teaser was insane I didn't expect it to be Last Of Us because of the lack of Joel and Ellie I found myself surprised and a bit concerned that scene seemed like something I would have liked to have experienced in the game and to be surprised by seemingly important character seemingly important characters do you guys think this game was announced too early we're gonna seen like that every now and then for the next few years I'd rather than just go dark so we won't get teased to death until it eventually releases in  0 1 I hope you boys enjoys the enjoyed the hype that was pretty dope James I",
            "start": 2512.45
        },
        {
            "text": "then for the next few years I'd rather than just go dark so we won't get teased to death until it eventually releases in  0 1 I hope you boys enjoys the enjoyed the hype that was pretty dope James I think Naughty Dog is really good at understanding what moments not to spoil yeah and I think that when we saw Uncharted Lost Legacy for the first time it was a good example of what we saw then premiere and what we ended up playing the game very similar but different enough having her have the like cloak on yeah changed it right I haven't feeling that scene will play out differently in the final game how much differently probably about us differently as Lost Legacy which is not that much but they know what they're showing and I think that this was a targeted thing to show this game is brutal this game doesn't necessarily need Joel or Ellie to be the Last Of Us and it expands the world when you think about the 90 dog games to Uncharted like sense Last Of Us Uncharted 4 and Lost Legacy both",
            "start": 2562.12
        },
        {
            "text": "game doesn't necessarily need Joel or Ellie to be the Last Of Us and it expands the world when you think about the 90 dog games to Uncharted like sense Last Of Us Uncharted 4 and Lost Legacy both them featuring those wide linear segments where you go to Madagascar in 4 yeah whatever that chapter was I think was chapter 4 in Lost Legacy where you're in the open world that's not really an open world you got to imagine Last Of Us is gonna adopt that philosophy in some way I think there's gonna be a lot going on in Last Of Us and I think that there'll be it'll still be that linear storytelling but I think that this is just a scene in a more wide open place area where you go and there was a lot of things like that ya know I don't knows what they're doing in terms of the story they don't want to ruin anything clutch for you too big but I mean this is the problem with press conferences or gaming in general is like with all due respect to everybody shows anything about a game I'd always",
            "start": 2608.5
        },
        {
            "text": "to ruin anything clutch for you too big but I mean this is the problem with press conferences or gaming in general is like with all due respect to everybody shows anything about a game I'd always rather play that then see it I mean can you imagine how awesome it would be to play that scene and like are they really gonna hit this R on the arm holy **** they're really hitting this girl me I like play all that stuff and not know what was coming to play Spider-Man and not know that miles is it is it to play like there's so many things if we could all go on blackout that'd be great but the problem is we can't and they need to hype their games and they need to market their stuff but I think you'll be alright here's the million dollar question Benji cases with that trailer recap of a show do you think Sony will bring anything substantial to PSX I mean it's complicated again the thing with this conference is as much of its trailer recaps like their new trailer recaps there was a lot of new",
            "start": 2657.26
        },
        {
            "text": "think Sony will bring anything substantial to PSX I mean it's complicated again the thing with this conference is as much of its trailer recaps like their new trailer recaps there was a lot of new stuff here there was big game announcements like this wasn't a bad conference by any means so I don't know what more they could show like having all the having shocker punt Sucker Punch's new IP is like that that's a big gun yeah you know showing last of it's like oh my god like what are they missing Dreams Final Fantasy remake deaths Randy I think it's not even is what I think the question here of what PSX is this year is just the fact that this conference was great it's what I think people are down on it because of hype we do the same with every time we don't like a conference it's usually because we've overhyped it for ourselves and I mean we as a community of people who like video games the fact that this is what they get put out in this giant stage of made such a big deal about just",
            "start": 2697.67
        },
        {
            "text": "because we've overhyped it for ourselves and I mean we as a community of people who like video games the fact that this is what they get put out in this giant stage of made such a big deal about just makes you wonder what's coming to PSX and like what is PSX going to be and is it going to be like you know is this the year that PSX truly becomes just the PlayStation community event and if it does that what does that do to the people there and the people watching right because that's the thing all the time or you where to talk about this there's the people go to something that people buy a season pass the people who are in bedded in the game or a community that will go out and pay their money and right you want to keep them happy the most but what does it say if like the general public surrounding PSX isn't paying as much attention because they don't have anything like this it is something stretched too thin to make other announcements should they have kept some of this for PSX I mean",
            "start": 2750.65
        },
        {
            "text": "PSX isn't paying as much attention because they don't have anything like this it is something stretched too thin to make other announcements should they have kept some of this for PSX I mean you'd think that the easy answer right now is that PSX would bring all the release dates but I think the fact that we didn't see that here says we're not gonna get that well then I'll just be happy to the PlayStation Store I was like that store they have a PSX no yeah but I don't know it's gonna be interesting I'm very it's a very and I'd like people I saw I saw puts people in a subreddit or one of our art forms talking about the fact that like oh man it's just weird a minute now standing for PSX really outside of like the early bird tickets and the Friday thing it's like that's not that weird PSX always comes together super latest it feels like I don't know cuz last year do we even have tickets yet wasn't that that weird thing but last year was a one year or they like ran up like a month before",
            "start": 2791.74
        },
        {
            "text": "comes together super latest it feels like I don't know cuz last year do we even have tickets yet wasn't that that weird thing but last year was a one year or they like ran up like a month before like Joey Bats writes into Kana Funny calm /k f GD and says after watching the new Spider-Man trailer I'm starting to feel more concerned about the amount of playable cutscenes I'm seeing at first I scoffed at the criticism of it seemed like a cutie of QTE after QTE but I really had haven't seen enough gameplay yet to get me truly hyped do you think the core gameplay mechanics are still being tweaked and this is why we haven't what why one why we haven't one seen actual gameplay and two still don't have a solid release date thanks Joey PS did it seem like a moment did it seem like for a moment or two MJ was playable in a section briefly did to me yeah yeah when she was like are walking around the crates whatever yep it was like that that'd be cool um I think the QTE thing it's just that stuff",
            "start": 2834.43
        },
        {
            "text": "two MJ was playable in a section briefly did to me yeah yeah when she was like are walking around the crates whatever yep it was like that that'd be cool um I think the QTE thing it's just that stuff those are the moments the the big selling moments so that's why they're in trailers right yeah I do think this game's gonna be very heavy with those but I think that's gonna be part of the gameplay you got to imagine there's gonna be a lot of open your swinging around just normal style content you'd expect from this environment game I'm not going to fight yeah I'm not worried about the the balance you just need to kind of temper your expectations if you don't think there's gonna be a lot of them but it's also one of those things where how you how do you make those big set-piece moments fun to play unless like that not to mention in a sense the rail trailer like right how many times you should we saw him jumping around punching and kicking stuff you and me when we went and saw the",
            "start": 2878.05
        },
        {
            "text": "fun to play unless like that not to mention in a sense the rail trailer like right how many times you should we saw him jumping around punching and kicking stuff you and me when we went and saw the behind-closed-doors demo right of Spider-Man I'm like how there was difference how they're using your gadgets how you're doing this oh my god this is fun this is gonna be fun I'm not worried about it I don't I don't think I don't know how heavy cuties we'll be they're gonna be there of course but that's also how you want to play at those moments to feel like Spider-Man have really cool **** happen I think yep IMO looking for a good question or two to round out the show here we go every mad about you know the same stuff over and over again singing a song while I look through this there you go Oh Kevin's class snapping he's havin join a song yeah um Thomas says why do so many games now find it necessarily to be shockingly brutal or vulgar doesn't actually help their game I know people talk",
            "start": 2918.7
        },
        {
            "text": "Oh Kevin's class snapping he's havin join a song yeah um Thomas says why do so many games now find it necessarily to be shockingly brutal or vulgar doesn't actually help their game I know people talk about it but does it drive people to the game or just to YouTube to watch it I don't think that he said why are so many games finding it necessary I don't think so many games are I just think the games are doing them in the old Greg Miller analogy of games being silly putty and everybody grabbing and stretching out in different ways we're just finding more and more people who want to do that and in the Last Of Us world it is a brutal world you want to show that to you I mean that being as narrative based it is in the narrative being us **** up and quote-unquote real as it is that makes sense I think that we did see obviously with like normal combat going back in the day there was a lot of that where it's like gore and **** and vulgarity for the sake of it yeah God of War is another",
            "start": 2961.0
        },
        {
            "text": "I think that we did see obviously with like normal combat going back in the day there was a lot of that where it's like gore and **** and vulgarity for the sake of it yeah God of War is another example of that I think two generations ago even leading into last gen but this God award does look different right it doesn't look like it's leaning on the I'm gonna rip your **** face open yeah yeah head back and you have your neck separate Jesus still there a little bit but it's not like the the main selling point of it yeah so I think that while God of War is kind of like toned back the cartoony ish over-the-topness Last Of Us is all right cool we're gonna flush out the world like I was saying earlier it's like yeah it is a lot to show and like that was uncomfortable to watch but that you're supposed to feel that way and I don't think that it was gratuitous like I think that it's yeah this boat it'll shoot out it wasn't like it was just like like that's the world there yeah yeah ****",
            "start": 3004.68
        },
        {
            "text": "supposed to feel that way and I don't think that it was gratuitous like I think that it's yeah this boat it'll shoot out it wasn't like it was just like like that's the world there yeah yeah **** up but yeah otherwise it's like was there any other trailers that were like oh that's true shockingly brutal yeah I mean Detroit in a way but it's like that's not so much brutal as much as it's **** up yeah it's **** up it's playing with your emotions and stuff and I think that's the point of it I think it's just as games continue to expand that's why it's going to become they want to get people into it I like the cursing in the drawings no well yeah of course I like anything Detroit does don't worry about that except the real Detroit I was the first time I ever went to Detroit you know people talk about bad things about to trim' like it can't be that bad landed and in the car to the airport we passed just a car on fire on the highway like just abandoned in the middle of fire I was like",
            "start": 3049.02
        },
        {
            "text": "talk about bad things about to trim' like it can't be that bad landed and in the car to the airport we passed just a car on fire on the highway like just abandoned in the middle of fire I was like no this is this it we are in Robocop time to squat up this is where one of you goes to kind of funny calm /k f GD give me your name your username your platform of choice and tell me why you need help in a video game I read it here the best friends come find you everybody has a good time today Anderson Miller needs help he's on PlayStation 4 and in real life his PSN name is Billy Miller knows Billy R Miller 14 he says hey Greg and Tim I have a special kind of squad up I am a senior undergraduate student at Vanderbilt University and the events coordinator for the club Vanderbilt Gaming this Saturday November 4th we will be having our signature event Vandy underscore land 8 where we host multiple tournaments including Super Smash Brothers League of Legends Overwatch FIFA Hearthstone and Mario",
            "start": 3087.76
        },
        {
            "text": "November 4th we will be having our signature event Vandy underscore land 8 where we host multiple tournaments including Super Smash Brothers League of Legends Overwatch FIFA Hearthstone and Mario Kart the event will run from 1:00 p.m. to 1 a.m. with food and drinks provided throughout the event and a raffle for the biggest prize being a Super Mario Odyssey Nintendo switch bundle we are also partnering with the local Extra Life chapter here in Nashville for our event and the latter half of the their event to raise money for the Monroe Carl Children's Hospital I want to invite you in any and all the best friends in the area to attend our event and help raise money for a good cause people can check out our Facebook page Vanderbilt Gaming for more information if anybody is down to play some Destiny   on PS4 my user name is Bill our Miller 14 thank you guys for all you do and have a great week oh we will we will remember extra life is this weekend we'd love if you join team extra life team",
            "start": 3137.65
        },
        {
            "text": "on PS4 my user name is Bill our Miller 14 thank you guys for all you do and have a great week oh we will we will remember extra life is this weekend we'd love if you join team extra life team kind of funny over at kindafunny.com/extralife or just watch live as we broadcast all day long and all night long on twitch.tv such kind of funny games donate our join our team or go to the Monroe Carlisle Children's Hospital support Vanderbilt gaming on Facebook get in there extra life shenanigans its chairman - what did we get wrong on a very run-and-gun show here I also saw that with our wonderful mods hadn't had a chance to clear the thing either so use all that so yeah rename it stuff yep thank you mods for all you do by the way I never ever thank you enough for doing that on the forums Mick with the mouth says Resident Evil 7 is not a hero's first substantial trailer with gameplay footage was released about a month ago on September  1st totally missed that thank you remember if",
            "start": 3184.51
        },
        {
            "text": "Mick with the Mouth says Resident Evil 7 is not a hero's first substantial trailer with gameplay footage was released about a month ago on September 1st totally missed that thank you remember if we're wrong when we're live go to kindafunny.com/you're wrong tell us what the facts are May and will correct them here Ghost of Tsushima is an open-world game oh according to PlayStation's Twitter account oh dear yes Middle Spidey says Erika for the most part is live action that's why I looks yeah you know put the head back Kratos put the head back go to the second page okay doo doo doo doo doo doo doo doo doo doo doo doo people give me **** about saying the dream is dead truth hurts sometimes yes dream is gonna be fast me a parent let's come to PSX that's another place they can do some of it dreams and Days Gone I guess gonna be a star as a PSX okay you take an offense with this one now Lucid Dream says according to Nintendo sales figures released",
            "start": 3226.85
        },
        {
            "text": "another place they can do some of it dreams and Days Gone I guess gonna be a star as a PSX okay you take an offense with this one now Lucid Dream says according to Nintendo sales figures released today the Switch was sold 7.6 million live today 3.11 million in the U.S. back could have sworn I mean I looked up their financials and I saw the two million but again that's what I say oh I see your son let me read what I got here now I'm gonna recant I was gonna read from CNN all right okay and I don't know if I'm gonna get to the fact we're looking for or not um the Japanese video game maker ramped up of things haven't been this good for a Nintendo in a long time the Japanese video game maker ramped up its sales and profit forecasts on Monday as consumers raced to buy its latest console the Switch Nintendo said it now expects operate operating profit for the current fiscal year of 1.06 billion dollars nearly double the 57 million a particular go that would be the best",
            "start": 3287.27
        },
        {
            "text": "console the Switch Nintendo said it now expects operate operating profit for the current fiscal year of 1.06 billion dollars nearly double the 57 million a particular go that would be the best performance since 2010 when smash hit devices like the Wii and DS were still selling well when the Switch went on sale in March the company said it could couldn't ship enough devices to meet the huge demand those problems seem to be easing Nintendo now expects to sell fourteen million of the console for the year ending March 2018 up from the previous forecast of 10 million and it's not just the hardware boost in the bottom line Super Mario Odyssey but on the time with a how great that is I don't know if they have the breakdown exactly you're looking for but this is what I was talking about as I knew these numbers got updated today I thought interesting let's see the Verge has got me more information let's do the verdict I mean those numbers are definitely more in line with what I would",
            "start": 3340.41
        },
        {
            "text": "these numbers got updated today I thought interesting let's see the Verge has got me more information let's do the verdict I mean those numbers are definitely more in line with what I would expect yeah you're just worried about the American number there right yes combined with the .7 man yeah sixteen point sixteen point seven four million units in total comparison company expenses now I see what they're saying here coming out yeah I don't know I don't have a breakdown for America on any of these things I'll stop ahead continuing with it Ryan T's says Greg and the list of releases for today you forgot Oure or whatever the one they announced today $0 right now a PlayStation Store also Dead Hungry and Stifled are out tomorrow I said that was like those got said alright those got said alright those got said interfer tomorrow those guys said Capitalist Pig says there are five Infamous games if you're going to count Infamous Festival of Blood Infamous First Light would be the",
            "start": 3383.85
        },
        {
            "text": "said alright those got said interfer tomorrow those guys said Capitalist Pig says there are five Infamous games if you're going to count Infamous Festival of Blood Infamous First Light would be the laughs you got me with that one good call good call fetches story how could I forget I love the fetch that's it all right ladies and gentlemen this has been your running gun Kinda Funny Games Daily for Monday October 30th 2017 tomorrow Tim Geddes an injury Renee will host this show I am gonna be going to Giant Bomb doing the Bombcast yeah so I'm looking forward to that a Halloween Bomb Casio about that I remember this is Kinda Funny Games Daily each and every week Dan a variety of platforms we run you through the nerdy video game news you need to know about before give me perspective jumping into your questions and having a good time you need to be part of the show by going to kindafunny.com/kfgd leave your questions comments concerns bad PSN names and everything else we'll read",
            "start": 3439.17
        },
        {
            "text": "into your questions and having a good time you need to be part of the show by going to kindafunny.com/kfgd leave your questions comments concerns bad PSN names and everything else we'll read them off of there for the show you can get the show as we record it live on twitch.tv/kindafunnygames or you can get it later on youtube.com such kind of funny games or podcast services around the globe no matter where you consume the show thank you very much we love making it for you now before I do the lights in the handshake and all that stuff is our morning show coming up there had been debate about this I don't know how to do it it's it's up to every doubt there I hear Nick out there and clinking around yes it up if you're watching live on twitch.tv/kindafunnygames there might be a Kinda Funny Morning Show when I come back to read subs and tips I will tell you the plan was we weren't going to I wasn't sure what the plan was I thought it was all I very there's all",
            "start": 3480.99
        },
        {
            "text": "might be a Kinda Funny Morning Show when I come back to read subs and tips I will tell you the plan was we weren't going to I wasn't sure what the plan was I thought it was all I very there's all nebulous is what I remember being left as doesn't matter if you watching later thanks for sticking it out until next time it's been our pleasure to serve you",
            "start": 3519.87
        }
    ]
}