{
    "id": 3087,
    "video_id": "ibFPtanhJVE",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller",
        "Geneviève St-Onge"
    ],
    "title": "Kickass Ribs from the Oven - Cooking With Greggy",
    "description": "Get your Team Fat apron by supporting us the month of October 2017 on http://www.patreon.com/kindafunny at the fan mail tier!\n\nSubscribe! http://www.youtube.com/kindafunny?sub...\n\nSupport us and get EVERY episode of Cooking with Greggy one week early: http://www.patreon.com/kindafunny\n\nGet your Cooking with Greggy shirt here: http://www.kindafunny.com/store\n\nINGREDIENTS OF RIBS\nBaby Back Ribs\nBBQ Sauce\nRub Rub (Can be just salt and pepper if you like)\n\nSTEP BY STEP INSTRUCTIONS (RIBS)\n1) When you buy the ribs, ask the butcher to remove the membrane. If you don’t have a butcher, remove the membrane when you get home. This is the white film/skin on the back of the ribs. Just slide your knife under there and then pull with your fingers. This too weird for you? Fuck it. Just makes the ribs more tender. You’ll survive if you don’t do it.\n2) Preheat the oven to 325 degrees. \n3) Line a glass pan with aluminum foil.\n4) Season the ribs with you rub.\n5) Place the ribs in the pan and add some water to it. About a fourth of an inch.\n6) Cover the pan with aluminum foil, and put them in the oven for an hour.\n7) After that hour, pull the pan out, take off the top, increase the temperature to 375, and cook for 15 more minutes.\n8) Pull the pan out, slather on some sauce, and broil on high until the sauce is bubblin’ good (five minutes tops).\n9) Cut’em up, add more sauce, and serve\n \nINGREDIENTS FOR COLESLAW\nHalf a Red cabbage\nHalf a Green cabbage\n3 Carrots\nWhite wine vinegar\nVegetable Oil\nOnion salt\nCelery salt\nGarlic powder\n½ a lemon’s juice\nSugar\nSalt and Pepper\n1 tbsp grilled or black sesame seeds\n\nSTEP BY STEP INSTRUCTIONS (COLESLAW)\n1) Remove outer leaves of red & green cabbages, rinse\n2) Slice cabbage thinly and take apart with fingers\n3) Wash and shred the carrots\n4) Mix everything in large serving bowl, set aside. \n5) In a mason jar or other container with a lid, add 1 tablespoon vinegar for 3 tablespoons oil (increase quantities if larger portion is being served). Toss in lemon juice and seasonings, sugar. Shake well.\n5) Pour dressing on salad only when about to serve, mix well. Top with sesame seeds. \n\nINGREDIENTS FOR MAC AND CHEESE\n4 cups elbow macaroni (or short pasta of your choice, ideally curved) \n5 tbsp unsalted butter\n4 cups milk\n2 tbsp all purpose flour\n½ cup accent cheese (the strong/pungent one, like aged gouda or sharp cheddar) \n1/2 cup grated gruyere, plus ½ cup in big chunks\n1 cup grated fontina\n½ tsp grated nutmeg\n½ cup panko crumbs\n\nSTEP BY STEP INSTRUCTIONS (MAC AND CHEESE)\n1) Get a solid 3-cheese foundation. One pungent (aged gouda or sharp cheddar), one mild (gruyere), one that melts really well (fontina). Grate it all. Drain and toss with 2 tbsp butter. Set aside.\n2) Preheat the oven to 350 degrees F.\n3) Cook pasta in a large pot of salted, boiling water (about 5-7 minutes)\n4) Make a roux: In a large pot over medium heat add 2 tablespoons butter and the flour. Cook, stirring, for about 2 to 3 minutes; don't let the roux color. \n5) Pour milk onto the roux, whisking constantly to avoid lumps. Cook, stirring often, for about 5 minutes until the sauce is thick.\n6) Add grated nutmeg to the sauce and stir.\n7) Remove from the heat and add the aged gouda, 1/2 the grated gruyere and 1/2 the fontina; stir until melted and smooth. Taste and adjust seasoning with salt and pepper.\n8) Pour mix over the pasta, add the chunks of gruyere, and mix until well blended. Put into the prepared baking dish. \n9) Sprinkle the remaining gruyere and fontina cheeses evenly over the top, add a little bit of panko for coloring. \n10) Bake until the top is golden and crusty, about 25 to 30 minutes.\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1508774527,
    "duration": 938,
    "transcript_chunks": [
        {
            "text": "What's up everybody on today's menu oven baked ribs, homemade coleslaw, and homemade mac and cheese. I'm the side girl today. You're my side chick every day. It's me, Greg Miller, and of course, uh, the reason these ribs are here is because they're very important in San Francisco, and I assume like many other places, you can't barbecue. We don't have a balcony, we don't have a point go that it's hard to barbecue in San Francisco. So as a meat lovin' and barbecue lovin' man myself, I had to figure out one day how to do it. I figured out a way to do ribs here inside that are awesome, it taste great, and are super super super simple, but look great when they're done. So we're starting there cuz the ribs take a while. We're gonna have to actually preheat the oven 3 5. I remember this time. Yeah, well he be surprising this show and then we have a I have took a half slab ribs. Of course, depends on how many people you're cooking for, what you want to do. Well what I use then is this dry rib or a rub here. This is of",
            "start": 1.18
        },
        {
            "text": "this show and then we have a I have took a half slab ribs. Of course, depends on how many people you're cooking for, what you want to do. Well what I use then is this dry rib or a rub here. This is of course from Memphis itself. This is given to me by one Eric Castro, star of Follow the Leader, world-famous bartender at all time. Now it's one of those interesting things for you in terms of how much you want to use and it's gonna be how much barbecue sauce you like. I like to get a really good coating on there because Jen hung it on my ribs really really really good and I was surprised because they don't take that much effort either. No, yeah, that's what I love about them is that they are so simple. The only thing is the time commitment cuz it'll be at 3 5 an hour, then we're gonna crank it up to 375 for another 15 minutes and then I've been doing this new thing where I put the barbecue sauce on there and then broil them just a little bit but it's one of those you can it's a set it and forget it",
            "start": 64.21
        },
        {
            "text": "for another 15 minutes and then I've been doing this new thing where I put the barbecue sauce on there and then broil them just a little bit but it's one of those you can it's a set it and forget it kind of meal except don't forget because you're burning Houston. So what I have over here is just a regular glass baking dish and whatever you got you I line it you line it with tinfoil because that's what the recipe says you put the slab of ribs in there then to keep making that moisture hot you come over here to the sink make sure I think what the recipe calls for is like 1/4 of an inch of water all the way around and I'll come show you I don't I you you know I don't don't panic about it don't measure it don't do anything like that just get a good amount of water in there and the base to keep it reduced to keep them is going big only it's hard if I rotate it towards Nick it's gonna look like more water but trust me there's not that much water in there just a good base of water you see it",
            "start": 105.07
        },
        {
            "text": "it reduced to keep them is going big only it's hard if I rotate it towards Nick it's gonna look like more water but trust me there's not that much water in there just a good base of water you see it Nick I'll rotate it back toward you see you squishington splashing hey there you go cool just push it toward me Jen Nick's got my attitude today and tell him I'm not gonna talk to him the rest of the show Jen tell us no Jen tell Greg it's never a choice because I'm behind the camera and yes to talk to the camera Jen I think I heard the buzzing of supplies all right and you let Nick know that I don't need to worry about what he might be descending to doing over there you tell Greg he's been dead to me for years and this year is no different Jen time we're moving up so you've done this congratulations the waters in there the ribs are in there the ribs have been seasoned everybody's happy you have the tinfoil thing 9 foil top just a quick you come over here get it on your knife so tight",
            "start": 145.99
        },
        {
            "text": "the waters in there the ribs are in there the ribs have been seasoned everybody's happy you have the tinfoil thing 9 foil top just a quick you come over here get it on your knife so tight exactly that's why these babies gonna be nice and juicy all right so the ribs are in there for an hour that's great let's just start on the mac and cheese thank you for showing up I don't Eileen in a boxed mac and cheese burger and I don't make it all fancy like you do Mike and Jesus is like the best comfort food when you make it right agree like you have all the options possible it just depends what kind of cheese you like yeah I usually do two or three cheese's jingle crazy or like keep it simple I would recommend speaking to your cheese lady or whoever's working at the counter thank you she's like the cheese ladies are really nice yeah what's your cheese lady's name Estelle Estelle Louis we are she is amazing she knows more about cheese and anyone knows about anything oh wow okay shout out to our",
            "start": 188.01
        },
        {
            "text": "cheese ladies are really nice yeah what's your cheese lady's name Estelle Estelle Louis we are she is amazing she knows more about cheese and anyone knows about anything oh wow okay shout out to our cheese ladies we have two great ones and Dronicus yeah I don't know their names there's the cheese ladies so I'm gonna get in on this a cheddar white here Black Creek cheddar white five years so what you want to do is get like start cheese and then here I got fontina which is way more mild and taste you start grating yeah and then I got this beamster classic baster 18 months of age it's Gouda so it's also kind of we're gonna keep it pile of cheese or a side dish like if you were gonna eat only that like the bowl the portions as a side dish that should be pretty much as much cheese a cheese day so like what's that maybe two cups shut up I'm hot it's hot in here and now I'm gonna get started on the cheese sauce I'm gonna use a whole stick of butter Miller in the house also I'm gonna turn the",
            "start": 231.18
        },
        {
            "text": "so like what's that maybe two cups shut up I'm hot it's hot in here and now I'm gonna get started on the cheese sauce I'm gonna use a whole stick of butter Miller in the house also I'm gonna turn the heat on also important that's also smart okay well how would he do you run this awesome medium medium as a medium heat right there yeah so this stick is gonna melt what you want to make is a roux it's ro UX so I'm gonna throw that in there and then you got a I'm gonna use all the way I have a little bit who cares I'm gonna show it to you in a sec there you go see no I'm showing you me yeah I see I'm sorry I think it's sticking to the sides and like it's getting a little dry so you just let it go for a minute these butter and flour yeah that's called a roux I don't know if you guys have a word for it in English when America a roux is like a kangaroo like the mama true right you know yeah all right so you're gonna use that B's it's gonna like thicken up like crazy here I'm using two cups of",
            "start": 279.34
        },
        {
            "text": "for it in English when America a roux is like a kangaroo like the mama true right you know yeah all right so you're gonna use that B's it's gonna like thicken up like crazy here I'm using two cups of whole milk I'm just gonna pour that in there slowly and like you just stir it around there you go okay so you're gonna let the milk and the roux come to a boil you don't want to let go too long because milk in a saucepan gonna go pretty crazy so it's gonna overflow it okay you don't want to get to that point you want to get to bubbly wine not a crazy boiling high point all right so now the milk and the roux have thickened up together what you're gonna do is just drop the cheese in the mix without making too much of a mess it's all in the mix and so it's gonna melt into the sauce and become a really thick and cheesy sauce second I'm gonna do a little bit of grated nutmeg right up she's hurt myself because I'm really bad that's creating stuff usually and you want to do a little bit of",
            "start": 336.91
        },
        {
            "text": "a really thick and cheesy sauce second I'm gonna do a little bit of grated nutmeg right up she's hurt myself because I'm really bad that's creating stuff usually and you want to do a little bit of cayenne too much you have a nice BAM all right Rachael Ray well I don't know I wasn't saying you do understand that's what you were seeing like how thick this is getting your cheese so you want like a very smooth consistency not chunks of cheese so we're gonna let it go just a little bit more all right so using a lateral little just gonna pour it right in yeah yeah doctor and then Gregg is gonna grab the wooden spoon Gregg has the wooden spoon and mix everything around you got it make sure they're all coated and like there is enough and then make sure I think I'm just gonna gonna do it he's doing there why not there's good nailed it all right and you're just gonna mix it around make sure that it's fully coated and it's gooey nailed it was a little bit I know oh my apologies so now",
            "start": 402.53
        },
        {
            "text": "he's doing there why not there's good nailed it all right and you're just gonna mix it around make sure that it's fully coated and it's gooey nailed it was a little bit I know oh my apologies so now I'm gonna do thing where I'm gonna use the leftover pepper jack cheese you left them the fridge right from the almond episode yep and I'm gonna mix it up with some panko oh and now we were just gonna sprinkle the panko mix and the cheese mix on top so it's gonna form a really nice crust in the oven nice so you're gonna get some color and some crunch it's like cooking is a lot about textures and colors to me that's just flavor how long is this gonna go in for 30 minutes okay okay your ribs are in the oven mac and cheese in the oven last time for you to show me how to make this coleslaw that you make that I love yeah so the idea behind it is to cut the richness from the other two with a little bit of crisp and like fresh ingredients for the salad so what I use is cabbage two types of color",
            "start": 472.04
        },
        {
            "text": "make that I love yeah so the idea behind it is to cut the richness from the other two with a little bit of crisp and like fresh ingredients for the salad so what I use is cabbage two types of color and then carrot just add so you got a green in there you got a purple in there and you got two carrots all right so I'm gonna take care of the cabbage and you shred the carrots so you wash the cabbage already I've peeled off the top layer and you've peel the carrots already yeah and now I'm gonna grate them in here yeah okay and so what you want to do texture wise this salad is have something that's really thinly sliced like as much as you can it should be enough red because we're not gonna make a lot of it so it's just gonna be for two people all right cool so I'm gonna throw that in there and you're gonna mix it up yeah and one of the things you said you liked about my Cole size that it's not like cream it's not the cream it's not that it's not like KFC coleslaw that you get where it's",
            "start": 540.94
        },
        {
            "text": "you're gonna mix it up yeah and one of the things you said you liked about my Cole size that it's not like cream it's not the cream it's not that it's not like KFC coleslaw that you get where it's got like the mayonnaise in it you're like a lighter sauce a vinegary sauce cool so half a lemon I mean yeah I'm doing the vinaigrette right into the salad because we're gonna eat it right away but if you're preparing it ahead of time don't do that cuz like nobody wants a soggy coleslaw and that's what's gonna happen Nikki like a soggy coleslaw no thank you so like what I recommend doing is doing the vinaigrette and we completely separate jar all right so half a lemon wait isn't there olive oil what kind of olive oil Vita the best one and then about like a tablespoon okay I'm gonna do a little bit of onion powder look at this new ass celery salt yeah that's how you know it's fresh let's talk you know we just bought it okay so a lot of celery salt eating any better yeah like half a teaspoon of",
            "start": 592.47
        },
        {
            "text": "of onion powder look at this new ass celery salt yeah that's how you know it's fresh let's talk you know we just bought it okay so a lot of celery salt eating any better yeah like half a teaspoon of celery salt I like just a dash of vinegar because I already put lemon juice in there that's why white wine vinegar yes thank you so that's a tablespoon we're gonna do a half of it because I don't want it to be too sweet there you go then some fresh cracked pepper and then that's like super personal but I love black sesame seeds super personal so you don't have to do it I like to do it because it adds another color and the Miller texture also it looks like bugs so if there's like a bug in it nobody would know they would just think it's that oh my god just bug this it's okay okay it's been an hour Alexa's going off time to get any air now we're gonna pull out the ribs and we're gonna take off their top you know same Jen haha we're also pulling out your mac and cheese right cuz you want it",
            "start": 646.46
        },
        {
            "text": "hour Alexa's going off time to get any air now we're gonna pull out the ribs and we're gonna take off their top you know same Jen haha we're also pulling out your mac and cheese right cuz you want it basically it's hot enough we ribs have another 15 minutes to go but we still gotta give it a good layer of like rolling on the top so for the ribs right now bring the temperature up from 3 5 to 375 then take this off you got the ribs right there you got your mac and cheese right there yeah so ribs are going back in now 15 more minutes mac and cheese is just gonna wait on the side cuz it's pretty much done all right the final 15 minutes for the ribs are done gonna pull them out saw some put them back into broil we're also gonna broil you're maximizing yeah so good job mobile oh thank you baby there we go turn that from baked to broil that's and look at those guys right there Nick you see in this yeah seeing that you see how you you see the ribs you see you smell them how they smell right",
            "start": 703.82
        },
        {
            "text": "there we go turn that from baked to broil that's and look at those guys right there Nick you see in this yeah seeing that you see how you you see the ribs you see you smell them how they smell right and then you got the seasoning on there and everything else all right so there you go that's a good sauce coverage for that and like I said at the end you know when we pull it pull it out for the final thing because I was gonna bro these yep five minutes maybe tops you do it every wants it a little bit hard you want to put more than you do what everything now for me if you will can you put them side to side yeah my choosing yeah cool thank you up top popped up cuz you want that nice brown crust again we're going to brown town again we go to Brighton all aboard the brown town train Nick Scarpino alright the ribs are done broiling they're bubbling they're looking caramelized oh look at that look at that look at like I see you see it all bubbling up there from the broiler smells good yeah you",
            "start": 761.5
        },
        {
            "text": "alright the ribs are done broiling they're bubbling they're looking caramelized oh look at that look at that look at like I see you see it all bubbling up there from the broiler smells good yeah you can smell like the sugar and the sauce oh that looks so tender look at that Nick kidding me Nick you kidding me right now the juice tasty free here okay Oh hear that crunch yah here Nick you hear it hard not to don't don't please don't jackoff the mac and cheese okay it's America I forget all the time she's in America she knew she was oh wait look how gooey this is like that's what you want you want them all to be coated and like oozing with cheese sauce oh it's Susan she saw something huh that was fun it was easy and it's delicious ladies and gentlemen that is ribs with Genevieve St-Onge's mac and cheese and coleslaw thank you so much for joining me Jen I'm still happy to be your same girl you're not I said you aren't you just might you're my partner you have to say the side girl you",
            "start": 815.89
        },
        {
            "text": "mac and cheese and coleslaw thank you so much for joining me Jen I'm still happy to be your same girl you're not I said you aren't you just might you're my partner you have to say the side girl you don't even sound weird when you say it like that it's gonna get me in trouble one with room I'm your what you think Oh Nick does not like Nick's making C's it doesn't it makes my work wife until next time it's been our pleasure to serve you I'm more like your bottom Oh God just eat the ribs",
            "start": 888.86
        }
    ]
}