{
    "id": 3106,
    "video_id": "Lv9nSptfsvQ",
    "show_name": "Kinda Funny Morning Show",
    "hosts": [
        "Greg Miller",
        "Nick Scarpino",
        "Kevin Coello"
    ],
    "title": "iPhone X Pre-Order Horror Stories! - The Kinda Funny Morning Show 10.27.17",
    "description": "Subscribe! http://www.youtube.com/kindafunny?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunny\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nTim - http://www.twitter.com/TimGettys\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Tim Gettys, and Nick Scarpino talk about the biggest stories in nerd culture.",
    "published_at": 1509142943,
    "duration": 3993,
    "transcript_chunks": [
        {
            "text": "I'm gonna throw one more story up there real quick. What's up, everybody? Welcome to the Kind of Funny Morning Show for Friday, October 27, 2017. Congratulations if you're hearing this voice, seeing this video message, you made it to the greatest day of pop culture ever. Mm-hmm. Super Mario Odyssey, Wolfenstein Two, Assassin's Creed Origins, Stranger Things Two, Jigsaw, something we're gonna take that one off the back there and we'll fill it so we can throw on the iPhone X. iPhone. Oh yeah, very good. You have a lot of Miller alongside the producer slash seducer, Nick Scarpino. I imagine that this week, oh, you have so much to do this weekend. What the hell are you gonna do? You got a, you've got too much to do. We got a great Halloween party, great another party tomorrow. Excited about that. Gonna have some Twitch IRL from if I can get that ever to work again. We're gonna get, we're gonna get sloshed on. I'm gonna try to set up a photo booth with the iPad that'll tweet directly to the Kind of Funny Vids",
            "start": 5.17
        },
        {
            "text": "Twitch IRL from if I can get that ever to work again. We're gonna get, we're gonna get sloshed on. I'm gonna try to set up a photo booth with the iPad that'll tweet directly to the Kind of Funny Vids account. What he says about that is, I'm gonna try to set it up. What he really means is Kevdog gonna have to set it up. I mean, I need to, what I need you to do is find a picture frame the size of an iPad that we put into that in the fly. It's the normal iPad. Someone here, it's not yours, John. iPad, bro. No, that's not iPad. For all I know, you do. I look like one of the richest kings. I don't know. I got pork rind dust all over my, yeah, there's a lot of pork rinds. We have a shoe that into your microphone. Let people hear that. Oh, I got that crunch. He's all over it. Think about the pork rinds like they're on it like a lower carb diet. Got that crunch and a little treat. Go for pork rinds. Yeah, are they known that for you? Well, I mean, they let me down that I'm not stupid. I know they're bad for you. Do they fall",
            "start": 62.01
        },
        {
            "text": "like a lower carb diet. Got that crunch and a little treat. Go for pork rinds. Yeah, are they known that for you? Well, I mean, they let me down that I'm not stupid. I know they're bad for you. Do they fall into your no carb? They call it. Yes, they have zero carbs because they're made of pork. They're fry. It's just fried pork. Okay, so it's all protein, but it's fried and probably the worst oil a human Lillie national. Okay, it's not good for you. What canola? That's generally vegetables than reality and I just they tend to not have a good fat or a fatty acid profile. But okay, okay, but better better ones for you a coconut oil good. Sure. Avocado oil great. Coconut oil. I don't like that it can be used for anything. It's in the bedroom, it's in the, it's in the kitchen. It was a go out of the bedroom. Why don't you know? Why don't you know? Come on now. Don't act like you're square. You know what you know what you're using. I don't know. Jesus, people are cooking with it. They're **** with it and then they're putting it in",
            "start": 106.38
        },
        {
            "text": "don't you know? Come on now. Don't act like you're square. You know what you know what you're using. I don't know. Jesus, people are cooking with it. They're **** with it and then they're putting it in their coffee. There's got to be a stop to what coconut oil be really. There's a lot of fraudulent stuff going on coconut oil. Explain. So Sophie who runs whose PR this already sounds wrong. I already saw a little math person. She's all about the coconut stuff, right? Sure. Once you start putting out some art sharing some articles that were like, well, **** the sort of thing and it was by I forgot Jason Tribe those are reputable website. Yeah, Jason Schreyer from Kotaku and they were talking about how coconut oil had some bad health problems. I don't exactly know. Okay, maybe I'm lying right now. Okay, but I'm pretty sure I'm not. Oh, I'm sure they're as I mean, a lot of people continue to study it, but there's a lot a lot of people like to derive different things from the coconut oil like I believe I'm not",
            "start": 151.42
        },
        {
            "text": "pretty sure I'm not. Oh, I'm sure they're as I mean, a lot of people continue to study it, but there's a lot a lot of people like to derive different things from the coconut oil like I believe I'm not mistaken that's where you get MCT oil from and they're basically it's you you're you're taking those the the different fat profiles in that and breaking them down because they do different things basically and there are groups out there like I used to take a product called brain octane which is basically like brain the most yeah it was fat that's I don't don't know it's it's designed because your body your brain needs fat if your brain like like will regenerate itself based like a plan much and so you apart it's just steroids yeah but anyway parity you can cook with that stuff too because all this is a really really like good like they took all the unhealthy stuff out of it and it's just it's just the most boiled-down like healthier stuff okay that's being good for promoting brain activity I",
            "start": 201.64
        },
        {
            "text": "is a really really like good like they took all the unhealthy stuff out of it and it's just it's just the most boiled-down like healthier stuff okay that's being good for promoting brain activity. I never noticed anything but a game of the squeegees. Everything gives you the squeegees then diarrhea. It gives me the diary though sometimes when you move a little bit of water. Oh, you know, let's squeegee them something cleans up. Yeah, but you know the sound it makes it squeezy and then there's always a little run of water that knows not what you do it certainly may see a nice mild disease like Stark my balls as I'm literally slathering myself in coconut oil as we speak that's the other problem you can eat it you can **** with it you put it your coffee you can rub it on you to actually like keep your skin moist coconut oil is doing too much eventually cooked that we're gonna run to him like a moment where all the coconuts are gone kind of like with bees you know I was with you till the baby",
            "start": 250.17
        },
        {
            "text": "your skin moist coconut oil is doing too much eventually cooked that we're gonna run to him like a moment where all the coconuts are gone kind of like with bees you know I was with you till the baby beast. Oh yeah, I counted them the other day. Sure you have on Thanks. What is it? What's that shirt? Wish I could have one of those shirts. Oh, it's party mode. It's party about the new Kind of Funny shirt available at kind of funny.com/store. You can go there right now and get your party mode shirt. It's bright. Hey, what's up? You can get it cooler story there it is party mode show. Yeah, yeah, yeah, look at three new shirts and new socks. Oh yeah, I warmed your wedding. We do. Yeah, we're gonna get a photo. We were to turn behind ya. Was it just us - there's someone else wearing a wedding? I've probably just done no Tim did no I didn't know he said yeah no he lied no no Greg broke my heart oh no where's Greg cool Greg polo Sox on what loud this is for people you eating the **** chippie chippie news",
            "start": 293.19
        },
        {
            "text": "done no Tim did no I didn't know he said yeah no he lied no no Greg broke my heart oh no where's Greg cool Greg polo Sox on what loud this is for people you eating the **** chippie chippie news wave I drill out my Julie a lot of my hair not a chip right let's not god I want to start this ya know first off I've had my fill second off I would never eat all right you know what I mean just be honest II just be on I would have been if I can avoid it was someone else's hands I would what it is he Andy I changed my mind can't have a coffee would you mind making me a coffee no I was that Nick Nick was making coffees yeah what do you mean oh let me try this hazelnut that is tiny office apart really good let me separate I don't see Captain Crunch says I know I just use coconut oil that's not my door from squeaking Apparel there's a lot of uses for coconut oil has gone too far it's a creamy paste you taking your rub on your dick I had a I had a spyware in fact like problem with my laptop yeah",
            "start": 349.5
        },
        {
            "text": "from squeaking Apparel there's a lot of uses for coconut oil has gone too far it's a creamy paste you taking your rub on your dick I had a I had a spyware in fact like problem with my laptop yeah on the laptop fix it well inside the micro boards langage afford they say they take they say they take a squirt bottle into the vents of your computer yeah yeah I gotta take apart my PS4 this weekend - yeah lot it's it sounds like a jet engine it needs to get her to get the crud out dude my only sound like that during NBA K cut see it's a Wolfenstein when I playing Wolfenstein oh it's just in its eye I know I've moved it and I've seen the dust in it the cracks and there's some a kid I'd already complained recently on one of the shows about my PS4 sounding loud and a best friend wrote and he's like I took off the bottom plate and it was just caked and dust to get out now it runs like a dream so I gotta get in there do that this is my watch one I've got the etching game over reggae on it got",
            "start": 412.39
        },
        {
            "text": "I took off the bottom plate and it was just caked and dust to get out now it runs like a dream so I gotta get in there do that this is my watch one I've got the etching game over reggae on it got to do that you know I mean all right good show everybody yeah if you're tuning in Monday thanks for coming to hang out I want to warn you right now we're all in great moods we're all in great and usually when we're all in great moods one of us has to be the dad from Telega Nights that gets thrown out of the Applebee's so we'll see you which one of us that's gonna be today you know what I mean everything's goin a little too good I mean yeah like **** hooked up you know cuz you know how to do this easy mocap for like a big creature in a video game any circus stuff yeah different favorite dude any circus is taking over the world and I gotta be honest here you know I gotta be honest with you I don't like it I don't like it no I don't like it because I keep seeing and I'm like I used to play",
            "start": 464.11
        },
        {
            "text": "any circus is taking over the world and I gotta be honest here you know I gotta be honest with you I don't like it I don't like it no I don't like it because I keep seeing and I'm like I used to play he's too **** good you know now he's directing a movie like he's directing he can you just direct the movie now because he's that good like like when Peter Jackson was like hey I gotta fill these teams you gotta get this movie done Quinn circus like oh yeah you know I'll do it gentlemen this is the Kind of Funny Morning Show each and every weekday and a variety of platforms we what it's hard when did we get brutal oops when we had the mystery Oreo unboxing yeah is it a fruit loop or is it a fruity pebble we asked the one on the cool Greg who was out at the bank or something to bring back both cereals wait how was the bank I was doing he's doing stuff for us he said you asked him to go withdraw like ten thousand dollars or something - yeah okay I said he and I are going to **** in",
            "start": 509.85
        },
        {
            "text": "both cereals wait how was the bank I was doing he's doing stuff for us he said you asked him to go withdraw like ten thousand dollars or something - yeah okay I said he and I are going to **** in Porto Rico Jeff would Salvador think oh we should donate some guys would strike me as the kind of like you know where is Barney Puerto Rico I'm a little tired today because I was up late not last night I was gonna say Vegas but it's like Vegas isn't funny enough and then my brain panicked and I was at word I was good at cope or a Costa Rica Puerto Rico and one of those did you see that a Tesla's like **** turning on Children's Hospital's yeah they're **** yeah kill it man good thanks baby he's one of those guys like out there man great I'm gonna put this all over reference outside a variety of platforms which TV slash wanna use this we go live you can watch a later on youtube.com slash kind of funny or listen on podcast services around the globe no matter where you get this show it's",
            "start": 566.73
        },
        {
            "text": "of platforms which TV slash wanna use this we go live you can watch a later on youtube.com slash kind of funny or listen on podcast services around the globe no matter where you get this show it's just us hanging out being besties talking about entertainment stories thank you for coming by being a part of the chat means a lot if you follow means a lot if you subscribe if you Twitch Prime be of Amazon Prime with of your free subscription if you have money you can give us that too you go to patreon.com/scishow that funny patreon.com started funny games we give away video games every day it's a fun time now do you think the Elon Musk is like Rex from Invincible where like everyone else thinks he's a great guy but maybe he's killed all the bad people yeah and the good people that stand in his way Musk seems awesome yeah but it is that thing of like is he - awesome but then I see like a Lex Luthor is he like a Hank Scorpio yeah phone to get him in here the first robot that was accepted as",
            "start": 617.07
        },
        {
            "text": "way Musk seems awesome yeah but it is that thing of like is he - awesome but then I see like a Lex Luthor is he like a Hank Scorpio yeah phone to get him in here the first robot that was accepted as a citizen was Robin Williams Bicentennial talking to reporters and the reporter was like well we're just worried that something might go down with artificial intelligence right and she the robot responded you've been listening to too much Elon Musk if you treat us well we will be good servants of the like what a **** spy but there's no robot as an accepted as a citizen you've been talking to us I don't think this is a good way I don't think what Johnny just yo google it and we do stupid good Saudi Arabia bestows citizenship on a robot named Sofia yeah they just did that so they could have sex with it she must be honest cuz that be stigmatizes it what are their sex with non-citizens well if it's a safe it's a very pertinent to my current marital situation yeah this here so what Saudi",
            "start": 657.63
        },
        {
            "text": "sex with it she must be honest cuz that be stigmatizes it what are their sex with non-citizens well if it's a safe it's a very pertinent to my current marital situation yeah this here so what Saudi Arabia just made a nonhuman woman a citizen taking it making it the first country to grant a robot the right to citizenship at least as far as we know why this is I'm by the way I'm reading TechCrunch why why did so isn't immediately evident but the irony of a nation infamous for deny basic rights to its female citizens and viewing a robotic Audrey Hepburn look alike with rights is not lost on us the robot known as Sophia appeared on stage within a booyah a head covering and cloak normally required of women of the Saudi government quote I am very honored and proud of this unique distinction the robot said on stage this is historical to be the first robot in the world we recognized with a citizenship what the **** yeah man this is dumb you weren't there dude yeah I wasn't there neither",
            "start": 718.38
        },
        {
            "text": "the robot said on stage this is historical to be the first robot in the world we recognized with a citizenship what the **** yeah man this is dumb you weren't there dude yeah I wasn't there neither were you you don't **** know did somebody tell the robot to say that or the robot yeah they had to say that another robot Donatella dude no no I didn't you can't that's ass a I that's not how that works for his part Elon Musk isn't fooled by Sophia's delicate features fully expecting her to go total AI murderous on our creators ha here we go we were worried about those **** robots up in Boston I could walk like metal gears now we're worried about us and **** cannons Sophia over here overthrowing the Saudi government making people not have to wear a cloak summery yellow musk is like shiny take people from New York to London in like 30 minutes good with these awesome with the same technologies been testing right now it's like there get shoot up into the atmosphere and then land on the",
            "start": 769.08
        },
        {
            "text": "take people from New York to London in like 30 minutes good with these awesome with the same technologies been testing right now it's like there get shoot up into the atmosphere and then land on the barge like so you'd go to a certain net barge or whatever shoot up and land on a barge 30 minutes it's **** awesome so cool yeah you kind of be in space tube con yeah with over the radio try lista - there's one guy who's always like yeah well good talk about just do it you keep talking about want to change the world and you know when you're gonna do it already it's funny he's really good this show you know what I mean he's talking to me he's engaging I'm sorry you couldn't you brought you bring your **** other hosts over here so you can to toss them you don't show me any love I'm just saying he brought in something interesting to talk about with this robot I'll bring up a robot you don't I mean I'm trying to pick anything is what you wanna dick dick dick it's like one each week were",
            "start": 820.98
        },
        {
            "text": "he brought in something interesting to talk about with this robot I'll bring up a robot you don't I mean I'm trying to pick anything is what you wanna dick dick dick it's like one each week were you up late last night ordering an iPhone so where we come talk about it with us in the morning show or talk about iPhones okay yeah we just showed Kind of Funny comments I store go by him tell him you look sexy if you want you touch yourself way look at this photo reporter Mortimer the woods is still up we're still talking about this for some reason we weren't invited to be in it mmm we sip Gibbs it'd be Kim over there didn't **** throw us a bone Morgan's in it I my rival but no baby in the woods has happened that's great to them you an animated show that's up go watch that that's a little Orion has a certain Elliott Morgan that's different more tears mean it's bizarre oh there you go he's fake news too and then the Extra Life sure still for sale don't forget kind of money calm / extra",
            "start": 859.24
        },
        {
            "text": "Orion has a certain Elliott Morgan that's different more tears mean it's bizarre oh there you go he's fake news too and then the Extra Life sure still for sale don't forget kind of money calm / extra life extra life is right around the corner a week from tomorrow we'll be live 24 hours playing games for the big beautiful kids join the team don't need some money welcome on my screen I'm just like two inches lower than Greg when we cut to that go can you cut back to the picture picture like all cool Greg straining to throw that all right do you see how I'm at the bottom and you're just sitting a little bit higher than me it's just you know it's a weird thing with head of tide comes in the time goes up yeah exactly you know it's what you would know that in the chat then we can just call attention to things it's very dangerous it kind of funny okay because of the one hand Kevin could easily fix this on the other hand I fully know that on Monday for your members I'm gonna be even lower on",
            "start": 911.77
        },
        {
            "text": "to things it's very dangerous it kind of funny okay because of the one hand Kevin could easily fix this on the other hand I fully know that on Monday for your members I'm gonna be even lower on the **** screen like I like you're my dad and you're you're taking in my first haircut now I want to talk about Zach phone business we yeah we have stuff to say about it but you said something interesting about Monday Monday what I thought was that Kind of Funny Games Daily Oh Monday is a very interesting day Paris Games Week will be upon us PlayStation is doing their conference PlayStation is calling it the second half of E3 they're going bigots apparently so we're gonna stream the entire thing along with the PlayStation pre-show along with a pre-shift of ourselves so it's 7:45 in the morning on Monday seems reasonable we're going live to get ready for the eight o'clock stream more place we'll watch along with you the PlayStation Blog guys likes it and stuff they're gonna announce seven",
            "start": 965.77
        },
        {
            "text": "on Monday seems reasonable we're going live to get ready for the eight o'clock stream more place we'll watch along with you the PlayStation Blog guys likes it and stuff they're gonna announce seven games there I believe it is and then they're gonna roll in after an hour of that to the big PlayStation conference we're gonna watch along with you all things there when the conference ends which it you're what we're thinking maybe ten maybe ten thirty yeah we're gonna immediately do Kind of Funny Games Daily as the post-show to that yeah so I'll need you to be going to kind of funny.com/kfgd giving you me or questions about the conference you just watch so we can pull from that and then more of your show we're trying to figure that it will I have been will just be delayed will you know we'll figure it out yeah if there's no streaming day happens yeah there's huge news I could see us potentially just not doing the morning show that day if you guys want to keep going on Kind of Funny",
            "start": 1008.55
        },
        {
            "text": "we'll figure it out yeah if there's no streaming day happens yeah there's huge news I could see us potentially just not doing the morning show that day if you guys want to keep going on Kind of Funny Games Daily and talking about that sure I could have Andy come stand over here off camera with us with us coffee and throw some color commentary I know what I'd like to point out is I'm gonna read the chats being the chat everybody's excited about this there they're very excited but not a lot of you are drinking too much coffee because Kumail H says I took half a day of an anticipation of you guys doing this and then GPL 1070 MTV says woo I've been working already so I will be watching Monday and then Amy gills goes PSA clots go back an hour on Saturday in Europe they got everybody my god **** we're gonna be streaming stuff and having fun Mrs. eyes it's fry it's Stranger Things - coffee - mom guys everyone relax pump the brakes get some candy in you oops yeah no it's because the milk is",
            "start": 1049.47
        },
        {
            "text": "we're gonna be streaming stuff and having fun Mrs. eyes it's fry it's Stranger Things - coffee - mom guys everyone relax pump the brakes get some candy in you oops yeah no it's because the milk is that you're drinking is probably gone yeah we lives are not great did it go that milks been there for two weeks for literally a decade a running joke though okay we're gonna happens and there's like that that guy never works here he's been dead for 10 years or thugs meant therefore to assume on the cameras I'll tell you I would do it I mean you'd have a great little visual when you need to do it for yourself it's like when Andy the producer and editor from party mode does that like I mention a chief Gundam expert and chief gun an expert CTE when you guys a little punch in effect on party mode I love it I love it which is here I like it we should oh it's up to you they should all match oh **** $85 oh yeah good good oh my god really yeah we on host well it was the old when you dock his pay",
            "start": 1095.07
        },
        {
            "text": "love it I love it which is here I like it we should oh it's up to you they should all match oh **** $85 oh yeah good good oh my god really yeah we on host well it was the old when you dock his pay the difference between this share and that check we need standing oh yeah story isn't a new story all cool Greg don't click on it we're gonna talk about iPhone business so last night - everyone got me all riled up I've needed a new phone as you guys know and have made fun of me for for the last time I have a 5s and even Joey who by the way ranks the lowest on my monster list and gives me **** about how small my phone is right what what do you know trust that you think you're more of a monster than Kevin life is about balance Joey okay he's so not a monster he's not a monster there's monster tendencies in Joey and I say this as chief loves me there's no monster tendencies wish you could what cochi coach chief the monster ship you a me yeah that's interesting cuz we are what I like to",
            "start": 1181.17
        },
        {
            "text": "tendencies in Joey and I say this as chief loves me there's no monster tendencies wish you could what cochi coach chief the monster ship you a me yeah that's interesting cuz we are what I like to think of us is like we'd be the perfect monster if we went back to back and got fuse that's a couple ensure it's true you're morally you have a show you're very physically scary very loud Kevin's more by the psychological like is he gonna **** with me today what I love about this back to back monster business though is that you could both be eating and **** into each other just **** on each other no hey Kevin I gotta **** okay and then we both squat for a second we do pit out and then we'd walk away you think Kevin the eunuch Kevin **** comes out in one space that thing is like prison poop yeah that's it yeah yeah that's example the call you go it it's out boom hmm see Matt bola says remember the days when everyone it kind of funny would give Android users **** for their bigger",
            "start": 1247.22
        },
        {
            "text": "Poop, yeah, that's it. Yeah, yeah, that's example the call you go it it's out boom. Hmm. See Matt Bola says remember the days when everyone at Kinda Funny would give Android users **** for their bigger phones. I don't remember that. I do. I do remember I had the giant Nexus 6 phone and it would be like who you'd like pick up a book and put it against the space and see. I remember waiting on I remember when Nicola Holland would do that to you. I don't think everyone Kinda Funny hello. Oh yeah, yeah, seems like Paul three out of five people weren't doing Paul. You need a knife. Okay, Google text about it is there. Let's get back to the story of how awful it is to buy a goddamn. So is this one this Apple this is what was amazing about it was it was a terrible experience last night terrible. There was nothing redeemable about this experience and buying this **** phone nothing pleasurable about it especially in the price point but the only saving grace is that Kevin who gives us and Andy but Kevin mostly",
            "start": 1305.12
        },
        {
            "text": "redeemable about this experience and buying this **** phone nothing pleasurable about it especially in the price point but the only saving grace is that Kevin who gives us and Andy but Kevin mostly who gives us so much **** about being an Android user still got caught up in this **** because Paula wanted an iPhone and that makes it even worse because you don't even get to use the **** thing you have to watch Paula use it while you're stuck on your Android. No, I mean I love my phone and I I have the Pixel one great phone not thinking about upgrading yeah I'll upgrade next year oh my god cuz there's no reason haven't want a phone for just so we're all here so everyone all of us got one ready oh no no no you didn't get one right Paulie got one Paula did not get one you but all of us try to write you Paul try to get one you got one yeah I got one eventually Jim got one yeah I'm in the queue Tim goes download the app get it all ready to go I did it two hours ahead of time download",
            "start": 1359.24
        },
        {
            "text": "try to write you Paul try to get one you got one yeah I got one eventually Jim got one yeah I'm in the queue Tim goes download the app get it all ready to go I did it two hours ahead of time download the app everyone enough **** app opens up yeah we're working on great ya know what that working on something great is Apple taking my **** time and money that's what you're working on and not give me my goddamn father I was so good in it dude I got to a point last night where I was so frustrated cuz I kept loading it up and eventually would work and then I queued up and then an error would happen and I understand that there's a lot of people trying to get this phone right now it's my fault for trying to get the phone pre-ordered I've never tried to order a pre-order before normally my really your fault well my normal Jam is if I don't want to be stressed don't put myself in a stressful situation right sure wait four months walk into it like the last one I bought I walked in four",
            "start": 1401.57
        },
        {
            "text": "really your fault well my normal Jam is if I don't want to be stressed don't put myself in a stressful situation right sure wait four months walk into it like the last one I bought I walked in four months after it came out and I was like do you have the 3 think the the one that I want and they're like yeah cool and the person is there could answer questions for me now that was great last night my wife wakes up one third in the morning what is going on out here and I'm like a highwayman well I wasn't screaming but I was simultaneously doing that and again this is my problem that burning a DVD which was a chef which which was a process that took way longer than it should I'm sorry like not your fault it was my fault for trying to prove menu yeah **** e I did yeah I had to I had to make a hilarious but I was also using technology from like the 1980s because no one has seen a **** DVD right since in 0 years so I'm like a little frustrated I'm like I'm about to give up I'm like you",
            "start": 1438.14
        },
        {
            "text": "a hilarious but I was also using technology from like the 1980s because no one has seen a **** DVD right since in 0 years so I'm like a little frustrated I'm like I'm about to give up I'm like you know I'm just gonna give up **** I'll check back in like 20 or 30 minutes fired up South Park beat South Park now yeah as I'm sort of like still navigating this **** **** that is this oddness app that I'm supposed to be using to get this phone which is suppose to be the easiest thing to do first it says hey you're good you got it you're gonna get this phone delivered sometime in December the first week in December I was like great then there's an error kicks me out again I can't get it through Apple by the way Apple wants my social security number of my annual income and a **** blood test cuz they're loaning me money for this phone which I was like what is this **** wine ain't just paying full from citizen one obvious I don't know monthly basis for the record I did the same",
            "start": 1481.19
        },
        {
            "text": "test cuz they're loaning me money for this phone which I was like what is this **** wine ain't just paying full from citizen one obvious I don't know monthly basis for the record I did the same thing where I was like wallet every gave me **** last year when I just bought the phone straight up why why what do you wanna do for every year I'm already **** doing usually yeah cuz I want to go I'm good I want to force myself to get on a new phone that was year or two oh this is a loan yeah this isn't just getting put in my bill it was terrible yeah and it was like citizen something thing I'm like fighting about Apple like yeah exactly at the dollars they can't load me 1500 bucks right now cuz what are they come and get sue and it's easier to like let them get oh this **** weird shell company then who the **** knows what it is but I'm giving you my Social Security not for my annual income like what the **** is that so I'm like I don't like I said three million dollars here's the",
            "start": 1521.21
        },
        {
            "text": "then who the **** knows what it is but I'm giving you my Social Security not for my annual income like what the **** is that so I'm like I don't like I said three million dollars here's the MU alone perhaps hey everyone how's it working fine so that alone you guys know I'm very like paranoid and anal retentive yeah so like I don't like anything about this I don't like not being able to ask people what this is I don't know what's going on with the trading of this phone because apparently I'm owed five dollars for and you know I want that money so I bounced back out I was like I'll just do this for the through Verizon because I can always just walk into Verizon so there won't be a line I can talk to whatever highly-trained individual works at the Verizon store about this did a thing for eyes and get it and now I'm I you know fifteen hundred bucks 400 bucks later spread out for two years I gotta wait until this mid-december to get my phone yeah it's not even gonna be shipped to me",
            "start": 1569.39
        },
        {
            "text": "eyes and get it and now I'm I you know fifteen hundred bucks 400 bucks later spread out for two years I gotta wait until this mid-december to get my phone yeah it's not even gonna be shipped to me until mid-december now you logged on at 1:10 and you're calling him to remember thirty to pick the **** PO table right no you gotta show I was though I was the thing where I was playing Super Mario Odyssey what a fantastic **** piece de resistance can't wait to play more of it tonight I was playing Mario I see got tuckered out so about 11:05 took a nap put the alarm for 11:55 woke up open the app cos it's where every was saying to go use the app and I opened my computer as well and had it go but I wasn't like constantly refresh yeah and then yeah like 1:05 1 07 on the phone was like great I went through did it and then it was like I'd gone in earlier and they had my credit card information had all that stuff was like no problem and then it was like I picked the plan and it was like oh",
            "start": 1605.15
        },
        {
            "text": "I went through did it and then it was like I'd gone in earlier and they had my credit card information had all that stuff was like no problem and then it was like I picked the plan and it was like oh well now I'm gonna put on my **** I went got the car in it and so yeah then I went through it was like I cool you'll get it November 14th wasn't awesome okay like for me the motivation here is I've said this before right like this is the last year phone I'm done on number seven this is a seven yeah seven plus I love it it's great it's I do not need a new iPhone however when Jen moved to the States and gave up her phone she took my old phone which sucks and for her going around his city she doesn't know the GPS doesn't work like it doesn't place you use it for cars risk trying to figure out from like 15 miles away and look smaller when she goes driving when she goes like to Napa or whatever sounds like okay cool then I'll buy the new one you can have the old one because I want the camera",
            "start": 1650.93
        },
        {
            "text": "like 15 miles away and look smaller when she goes driving when she goes like to Napa or whatever sounds like okay cool then I'll buy the new one you can have the old one because I want the camera cuz I take so many photos and so I wasn't super like okay whatever 14 is fine with me no big deal will be fun but it was like oh **** I was here and then I looked in like wit a hat Gary got it right away like Jeff Kiwi did it I think right away said Shuman got it right away I was like what did I do wrong I don't understand what like what second how many seconds it took that I got I are you want AT&T Verizon AT&T C I think maybe the Verizon phones may have been a little harder to get I don't know we're going faster maybe I don't know that could be a thing and I'd be making it up it also just might be the luck of the old man I'm an old man I bring this **** upon myself I should have just done what I'd normally do which is like oh yeah she gonna go have fun today walk in and get a ****",
            "start": 1693.74
        },
        {
            "text": "might be the luck of the old man I'm an old man I bring this **** upon myself I should have just done what I'd normally do which is like oh yeah she gonna go have fun today walk in and get a **** iPhone or just suck it up again iPhone 8 yeah but you're always off on the cycle I know I do but I water you one of the cool kids but now this is what this is what you GM is gonna go on November 3rd and bring it back and I'm gonna play with his but this is really cool the my can I get mine all that it's old hack I'm like I'm already **** not already to touch this you know touch tips so the first time I touched Kevin I was like this is super exciting and I touched him every day it doesn't matter doesn't matter I asked him not to know you know all honestly I don't mind waiting till December it's not gonna matter what if I had usual a bad customer service experience it wasn't it wasn't ideal especially for a phone like I had a point at last night where I'm like I'm trying really hard to",
            "start": 1727.88
        },
        {
            "text": "it's not gonna matter what if I had usual a bad customer service experience it wasn't it wasn't ideal especially for a phone like I had a point at last night where I'm like I'm trying really hard to give someone $1400 and they are not making it easy it is a $1400 phone I bought a Mac laptop my first Mac laptop that I bought for my wife is $1300 yeah and this is a phone and it isn't in it you know it's like it's insulting well let's do a lot I was gonna say like this has my literally most used device yeah I don't mind paying for quality and I'm totally fine with that and I get I get that there's inflation and I get that by the way and a lot of people will bring this up and it's a very valid point both are expensive they've always just subsidized that you've seen it right so that foam and you've always played 900 bucks 800 bucks when it came out so now it's up I mean I'm getting 256 gigs I'll get the whole thing yeah you know I keep my phone for 17 years or so it's totally fine it's",
            "start": 1768.23
        },
        {
            "text": "you've always played 900 bucks 800 bucks when it came out so now it's up I mean I'm getting 256 gigs I'll get the whole thing yeah you know I keep my phone for 17 years or so it's totally fine it's just I just you know from Apple I always want that that that premier like premium experience right I don't want to have to go through these thing it's like Apple used to be a company where you'd walk in they were like you know it sucks checkout lines you know what's even better we gonna check you out right here you don't have to wait right all of those things used to be so indicative for me for Apple I didn't either I still don't like it but alright so I I it's more efficient yeah it is a better customer experience I don't like change that's my thing sure I like I like to know where I'm at in the queue I like said you know that I can stand in line yeah you know you do a lot of a good line rules I don't like that anyone at any point can just check me out it's very confusing for me but having",
            "start": 1813.23
        },
        {
            "text": "queue I like said you know that I can stand in line yeah you know you do a lot of a good line rules I don't like that anyone at any point can just check me out it's very confusing for me but having said that it's a it's a much better yeah use your experience like it's better person he's like get the **** out you're not the wait line I've just always bringing up issues so it's always like oh I actually can't help you see I I don't want to go to the store I don't know wait line I don't talk to anybody it's just another **** iPhone I want to download the brain of this one put it into that one and there we go we're off to a racist Evans tweets about having trouble with all that stuff man I had some major PTSD hasn't talked about what happened I don't know I don't even fully god-awful like yeah it took me back to no but like it took me back to customers getting mad that they didn't have the information that they needed well yeah it's not their fault I mean I just wanted to buy the",
            "start": 1852.87
        },
        {
            "text": "like yeah it took me back to no but like it took me back to customers getting mad that they didn't have the information that they needed well yeah it's not their fault I mean I just wanted to buy the phone I wanted to be a Verizon I could have activated afterwards but no they want to activate it for you before it comes in when it's ready - so what happened why still don't to say what happened she was Paula is still on her family plan with her family okay the other family know they know I know okay but she's still on her like parents she's just been on that for her entire life so like I told her hey come over to our family plan with me and Tim she likes Verizon I like sprint so last night i open everything up have everything set just like you put in the credit card the day before ready to go and then there's that little window that's like oh you to verify your rising lock right here's the that was the point where I started losing my **** the number the zip code and I love storm",
            "start": 1889.92
        },
        {
            "text": "to go and then there's that little window that's like oh you to verify your rising lock right here's the that was the point where I started losing my **** the number the zip code and I love storm allowed no they last for ever so association with Verizon has no hold on this is one of the story cuz it was midnight Paula's mom asleep so I was like mom nothing we can do about this this system will try again tomorrow morning hopefully there's still going on I call her we get the last four put it what you call their midnight no this morning my apologies put in the last four and that it goes to the next screen the next screen is hey we need the pen for Verizon the dad knows that and he's somewhere flying from London to here so she still hasn't gone in try six no six nine I did look I did actually did you retry the last four yes okay did you turn it on turn it off we will the chatter saying we're exaggerating about the price we are not exonerol yeah no it's you know it's forcing it out you",
            "start": 1941.1
        },
        {
            "text": "did you retry the last four yes okay did you turn it on turn it off we will the chatter saying we're exaggerating about the price we are not exonerol yeah no it's you know it's forcing it out you say it let people's like it's only eleven hundred fifty dollars right in the States we have this thing called tax and tax on a thousand dollar item is one hundred and eighty dollars plus a thirty dollar upgrade fee plus the Apple care which is two hundred dollars because you know I'm **** paranoid I can't you got it's two hundred all add that up and I think the total price was one thousand three hundred and eighty five dollars or something like that yeah what I was straining them I'm ready to give this company that I hate yeah all this money I know that mercy for you they were like no Kevin must have just spent like I water **** you kill someone because he hates apples so much alright sometimes I'm like I'm gonna get I'm gonna get your Mac just put an extra I mean it's also at the window",
            "start": 1992.26
        },
        {
            "text": "have just spent like I water **** you kill someone because he hates apples so much alright sometimes I'm like I'm gonna get I'm gonna get your Mac just put an extra I mean it's also at the window I'll throw it I have it yeah so yeah if you're thinking about buying a new iPhone just make sure just make sure you all your information get all your information to make sure you're gonna ready to spend three hundred hours more than you think you're gonna spend unless you get in the smaller version but it's don't do that yeah how big is your phone right now 3 gigs okay it's too small it's so small the thing is I I got the 256 at first I was like that's that's annoying there should be like a midway between the 64 in the 256 but then I thought to myself you know what the most annoying thing is when I'm trying to take a video of something funny that you guys are doing and you're out of space you should delete some **** I'm like you know what are we past that I like your iPhone voice is",
            "start": 2034.62
        },
        {
            "text": "is when I'm trying to take a video of something funny that you guys are doing and you're out of space you should delete some **** I'm like you know what are we past that I like your iPhone voice is butterscotch we're past it I want 256 gigs I want to never worry about it I never ever ever ever ever good question is do I go back and look at all those videos I've taken to myself and I Center my wife no I don't **** care that's the weirdest thing about it my videos look like for the phone that the phone is this time capsule now right of like when it took over is my when I got my first iPhone you go all the way back to 2000 or whatever it is like all my photos are there like I don't delete it yes I want to worry about this do I need these vines of Ryan Clements getting hit in the head with it to coaster no but I have and that's what's important there you go top story you put this on there Nick yes I did sir I'm sorry someone was saying the chat there's big Kotaku news I think Greg's",
            "start": 2079.11
        },
        {
            "text": "it to coaster no but I have and that's what's important there you go top story you put this on there Nick yes I did sir I'm sorry someone was saying the chat there's big Kotaku news I think Greg's probably going to talk about it I heard yeah Jason I was promoting that in our day if you want to look that up I'll read this first story so we'll talk about whatever that news is on Games Daily and love the culture of service rolls ambitious Star Wars theme yeah I should be very cool very cool a top story right now for us is over an idea and Justice League tracking to open less than Batman V Superman or Suicide Squad but ahead of Wonder Woman so that's interesting Alex Gilead ah've says it appears Justice League might be a might open behind Batman V Superman and Suicide Squad core to The Hollywood Reporter the upcoming DC superhero ensemble film is tracking to open in the 110 to 1 0 million range domestically that puts it behind be be vs is 106 million u.s. open and Suicide Squad 133 I",
            "start": 2118.87
        },
        {
            "text": "Reporter the upcoming DC superhero ensemble film is tracking to open in the 110 to 1 0 million range domestically that puts it behind be be vs is 106 million u.s. open and Suicide Squad 133 I can't believe that **** look still Justice League was tracking to open ahead of Wonder Woman which grossed one hundred and 3.3 million in its first weekend at the u.s. box office earlier this year that said box office observers note that and Warner Brothers has yet to make its final marketing push for Justice League which might still have an effect on its opening box office total meanwhile authority rock will open in theaters two weeks before Justice League on November 3rd Marvel Studios latest is expecting to make between 90 million and 100 million over the November third to fifth weekend Justice League opens in theaters November 17th I don't there's a huge surprise here is a great headline yeah I don't think it's surprising I think the most interesting thing about this article is the fact",
            "start": 2160.0
        },
        {
            "text": "League opens in theaters November 17th I don't there's a huge surprise here is a great headline yeah I don't think it's surprising I think the most interesting thing about this article is the fact that it's so tracking open ahead of under woman yeah whereas wondering what was this big success that doesn't surprise me though because Wonder Woman's in it I'm sorry one of them is in the movie it is you same thing no Wonder Woman big hit gets everyone jazzed Wonder Woman's in another movie all those fans go oh watch again in the movie that kind of that kind of checks out to me right I I was going off of the thing that I think after the public majority hanging over from Batman V Superman Suicide Squad people were a big gun shy I wonder sure and their trip that first opening weekend and everything comes out like holy **** this is really good magazine you go yeah I think it's one of those things where even though it's you know the push the line went like this exactly so it's gonna see if",
            "start": 2201.31
        },
        {
            "text": "comes out like holy **** this is really good magazine you go yeah I think it's one of those things where even though it's you know the push the line went like this exactly so it's gonna see if you know what Justice League's tracking above Wonder Woman how it goes and when Wonder Woman passes what Justice League's doing and it's not and and by the way I don't think that this is necessarily off as far as like what Marvel does as well right you do the one-off movies and then you come together as the Avengers the Avengers are gonna make more money sure is not gonna make as much money as the Avengers it just doesn't necessarily I think historically if I'm not mistaken and people can look this up I think that's the way he generally is with the exception of I think Spider-Man Homecoming probably might be a talking through my ass right now that sounds right right the bigger I love the Avengers me it will look into it Cavs looking into it I don't think this is necessarily bad news I think",
            "start": 2245.18
        },
        {
            "text": "might be a talking through my ass right now that sounds right right the bigger I love the Avengers me it will look into it Cavs looking into it I don't think this is necessarily bad news I think this is just news we'll see how it goes I mean I think it's I think it's a I think there's not reason for concern but I do think it's a big problem that even if up until you used to read this article you could ask me Greg Miller DC fanboy number one when does Justice League come out in November it's in November I know yeah I don't know the date and I'm always surprised they want to go to stores and it's alright we went to Target for the I don't go to stores ever but like when I'll catch something on TV and they're promoting it in my house all right that's a **** movie right that's so like yeah I'm like every time they drop a trailer I'm like so kind of looks weird don't show me a whole movie but it still looks weird about Superman I don't know you think that's because there's just way too",
            "start": 2280.01
        },
        {
            "text": "I'm like every time they drop a trailer I'm like so kind of looks weird don't show me a whole movie but it still looks weird about Superman I don't know you think that's because there's just way too many awesome things happening between like november to january it has just become this three month colossal everything that nerd **** people like nerds love yeah is is here every week there's something cool happening Thor's next week you got Mario Odyssey we got straight things are gonna look for we got all these amazing things happening it there is gonna be some loss of the mix I think that's part of it but I also think it's the part of it that with all due respect like public opinion is down on Justice League Wonder Woman was the movie wherever he's like oh **** that was the first good DC movie that's **** awesome and then just as he comes around it's like all right here's **** Ben Affleck and like for us his nerds were like how long is he gonna be Batman I heard he hates doing",
            "start": 2324.98
        },
        {
            "text": "DC movie that's **** awesome and then just as he comes around it's like all right here's **** Ben Affleck and like for us his nerds were like how long is he gonna be Batman I heard he hates doing this this movie's been passed off between Snyder and Joslyn what does that meet and then it's like again even just walk like the poster the Alex Ross poster is hot right it's cool but you look at that in like I'm an average movie guard I'm like I know Batman and I know Wonder Woman that's not Greg that's not the great kid from the TV show all right I don't who the **** cyborg is Jason Momoa was on Game of Thrones right like you don't set these up it started they set it up great Batman V Superman remember they clicked on it and there was little videos for each one over and they already had the logos up made up for that's got something say okay but yeah okay so I mean that how it whatever it is to make announcing they're really uh it's starting to feel a little bit like a party everyone",
            "start": 2364.94
        },
        {
            "text": "the logos up made up for that's got something say okay but yeah okay so I mean that how it whatever it is to make announcing they're really uh it's starting to feel a little bit like a party everyone like like when you get invited to a party and no one wants to go and you start talking like I don't know if I want to go to this party I don't know wasn't party either you know like that's kind of how this feels to me and I think we they got to prove this party is worth coming to the hope I have as you know someone who loves DC so much he's the fact that the fact that I'm not off the charts excited for this movie and I don't really know what's gonna happen you don't I mean like I've done my best to stay away from trailers I started put up TV spots and I'm in avoiding or whatever my hope is like go there and like everybody else like they did the opposite of Batman V Superman and we get there in the little parts we've seen are so just small parts of that movie and then you know it is what",
            "start": 2404.42
        },
        {
            "text": "go there and like everybody else like they did the opposite of Batman V Superman and we get there in the little parts we've seen are so just small parts of that movie and then you know it is what down an hour it's 11 minutes or something we talked about the other day on the show like we come in we get it and it's just this like type movie that you didn't see coming it's fun it's exciting it's interesting they introduced Superman earlier they do you know I mean like it's like really good and then we even were like holy **** everybody's got to see this because it's like the complete opposite of Thor Ragnarok right we're Thor Ragnarok I'm so incredibly **** sold and jazzed about and ready to go in there and have a great time I know what I'm getting yeah whereas Justice League you don't know what you're getting are you getting more of the Batman V Superman thing is it more comedy I like what I see all the time with the flash I'm excited to see Jim Gordon like I'm excited but it's also",
            "start": 2454.91
        },
        {
            "text": "what you're getting are you getting more of the Batman V Superman thing is it more comedy I like what I see all the time with the flash I'm excited to see Jim Gordon like I'm excited but it's also like yeah is it in the DC fan like yes I'm excited I can't wait to see these people on screen Batman V Superman whether you love it or hate it it was an awesome **** moment I see one room with Batman and Superman on screen that first time you know and it's like to see all these guys that I never thought I'd see in a movie let alone a big blockbuster thing great it's just the whole thing of as a fan and as I would say everybody else watching this even if you're not a fan of DC but like you know comic book movies there's such a cloud over this movie there's such a cloud over DC Cinematic Universe in general of cool is this is gonna be more about maybe Superman Zack Snyder that everybody hates is this coin is it even worth getting invested in this if they're just gonna move go do solo movies",
            "start": 2492.46
        },
        {
            "text": "in general of cool is this is gonna be more about maybe Superman Zack Snyder that everybody hates is this coin is it even worth getting invested in this if they're just gonna move go do solo movies that don't have anything and not have crossovers but they're talking about a Justice League 2 script but they're making a Deathstroke movie but there might be this Shazam what the **** is going on like you know I mean yeah there's so much baggage with this movie that you have to go in there and be pow blown away be like I didn't see any of this coming I'm so excited this is awesome I hope so I hope so I think I'm excited to see it is there is a level of excitement for me of like what's it gonna be what's it gonna be and I am I've backed off my hardcore fan this when it comes to Batman I just want to go have a good time okay that's what these movies are to me yeah yeah I know Thor is not gonna be the best movie ever made it's not gonna be Spider-Man Home Coming right it's not gonna be a",
            "start": 2534.64
        },
        {
            "text": "want to go have a good time okay that's what these movies are to me yeah yeah I know Thor is not gonna be the best movie ever made it's not gonna be Spider-Man Home Coming right it's not gonna be a very very very well made I don't think it's going to be on the level of Iron Man right which I hold in very high regard speaking of I was so disappointed last night to get home look through every go wide group cool Greg get home last night look through everybody's social media post and see that while I was in the bathroom yesterday Spider-Man and Slimer came by the ship did you it's vile armored Spider-Man really off unhinged just really has become unhinged lately Slimers style bit mad but Spider-Man just he's taking a break let's put it that way be silver 87 in the chat says the words probably gonna be on the same level as the departed mmm-hmm I doubt it no no no I think it's gonna be out of a much better level friendzone Hughes says Green Lantern comes to help the group as one of the",
            "start": 2573.07
        },
        {
            "text": "gonna be on the same level as the departed mmm-hmm I doubt it no no no I think it's gonna be out of a much better level friendzone Hughes says Green Lantern comes to help the group as one of the biggest plot twist ever exactly big **** exactly that's what I'm talking about they mention lanterns in the trailer but again I've learned don't get excited the trailers from DC when it's it sounds like it's Steppenwolf talking and he's like no Kryptonians no lanterns yeah they're like he's like laying out why her it's like problem for the taking what be dark so I think it's done what amazes me is this I'm sorry to keep beating the night we've got the story dude we did just 40 minutes when we started talking about the news that's true I just watched New Frontier Justice League New Frontier and I don't really cook recipes not a not a perfect movie but so enjoyable right now granted I know the animated movies go they assume that if you're watching this you know a lot about what's going on",
            "start": 2627.5
        },
        {
            "text": "I don't really cook recipes not a not a perfect movie but so enjoyable right now granted I know the animated movies go they assume that if you're watching this you know a lot about what's going on right so you don't necessarily like the Barry Allen story where he is like I don't know if I'm big enough to be adjusted to Justice League or hang out with these guys right we get that that's been something that's been set up before right yeah Green Lantern what's the first Green Line Hal Jordan yeah how'd oranges get in the ring it kind of comes out of nowhere but you're like I've been there before we get that right but the movie overall is a fairly well made movie that's what breaks my heart like just just call those guys up what are they doing yeah hey you know that script you wrote sprang into a movie yeah just I think that real quick yeah yeah let's go let's go make this movie DC's got so much good **** they can make any movies just keeps not speaking of great **** you can put into",
            "start": 2672.89
        },
        {
            "text": "a movie yeah just I think that real quick yeah yeah let's go let's go make this movie DC's got so much good **** they can make any movies just keeps not speaking of great **** you can put into movies let's go to the next story Vin Diesel reveals director Justin Lin co-star Jordana quill Greg this is Brewster oh no sorry wait how does this not go know where it is one wall it's not even up there let's see yeah can you just go back to the documents okay I'll read the story while you pull that up Jordana Brewster back for fast nine and ten quote we've heard your concerns about the saga and we're in and where it needs to arrive in its final chapter this is my heaven Campbell over at IGN Vin Diesel's teased a future road map for fast and furious 9 and 10 strongly hinting director Justin Lin and co-star Jordana Brewster will be back from both films speaking on Facebook yesterday Diesel showed on video that he's working with Lynn and Brewster on a secret project after a really direct err",
            "start": 2710.99
        },
        {
            "text": "and co-star Jordana Brewster will be back from both films speaking on Facebook yesterday Diesel showed on video that he's working with Lynn and Brewster on a secret project after a really direct err on screen diesel said you want to not intend to be incredible we've heard your concerns about the saga we're alive that's okay EDW reports that Lin who directed the third through sixth installments of the series is in advanced talks to helm the next fans fast and furious film IGN has reached out to Universal for a comment and will update the story should the studio responds earlier this month the audio yeah I'm gonna skip down to as for booster she did she didn't appear as Mia in faith of the Furious she's the sister of diesel diesel character Tom in the franchise but also the wife of Brian O'Conner who played who was played by the late Paul Walker diesel heavily implies Brewster's return though quote you're about to see Brewster and the up-and-coming chapters of the path that's universe",
            "start": 2755.87
        },
        {
            "text": "who played who was played by the late Paul Walker diesel heavily implies Brewster's return though quote you're about to see Brewster and the up-and-coming chapters of the path that's universe he said not so much to implication as enjoy say that's statement of hair is a fact so I'm just confirming that Greg I know you are like many people out there a very fast move air whether fast and furious fan a fair added effect you like if you like them you know nothing weather weather yeah what's up what's a better term for it an avid fan you're not like hardcore like I say I enjoy fastened for Yogi's does it does it just get you super excited that Jordana Brewster is coming back a shirt yeah I had a crush on her and fast fingers one you know what I mean come on now you remember that thing where she she looks at in Brian's company at the party and she runs up and takes off her shirt and we get the shot of her from behind she's it was I was I was a kid and I was like oh yeah I guess by the way",
            "start": 2802.86
        },
        {
            "text": "she looks at in Brian's company at the party and she runs up and takes off her shirt and we get the shot of her from behind she's it was I was I was a kid and I was like oh yeah I guess by the way was a very high smoking drugs yeah always smoke well I mean the bigger question is what is going on with the rocks feud with you people Vin Diesel Tyrese that's what I want to know I think the ROI is the behind the music all in fast the furious I have it on good authority yeah and by good authority me I'm completely making this up got it that everyone is just jealous of the rock because here is amazing he's amazing everybody loves him and people **** haters a hatin yeah he's my good authority I mean I would agree with that into an extent yeah because I think it is the rock came into this not this film franchise that I don't think was dying I'm not trying to over just you know I mean Indian already there's no well they'd already come back and think but like rock came in and really did this",
            "start": 2846.03
        },
        {
            "text": "film franchise that I don't think was dying I'm not trying to over just you know I mean Indian already there's no well they'd already come back and think but like rock came in and really did this Apple here is this thing here is this action movie and like really got everybody super stoked and they are definitely riding his wave of popularity the fact that everything the rock touches turns to gold it does and so I'm sure that is a hard pill to swallow for Vin Diesel who's been around forever and is the guy who's really he's like always the dude who's like on the fast and furious champing you're sure sure and then yeah Tyrese is just man that like Hobbs thing is coming like that's the lane the other thing is like come on man the rocks the Rocky item should go man I'm telling you right now if I was anyone on that crew that not the rock anyone other than the rock I would just show up when they want me to show up man I would be the I mean Dwayne's best friend it would be like hey man do",
            "start": 2891.87
        },
        {
            "text": "if I was anyone on that crew that not the rock anyone other than the rock I would just show up when they want me to show up man I would be the I mean Dwayne's best friend it would be like hey man do you want me to rub some oil on your **** triceps yeah because liver looking a little nah I just show up on the skyscraper set what do you need what are you ok we need we got for it I love did you see him singing welcome to the jungle the other day yes man his Instagram is **** phenomenal that's how you do Instagram next story what is this this is fun it's not so much a story just a quick clip let's watch it this is a contra live-action movie teaser live-action contractor yeah thank you all right  growing up growing up my brother and I would play Contra a video game teaser they gave you that never became anything just like this will never be anything probably not but it still gets me excited Contra my brother Knights play Contra like once a day we would just go through and beat",
            "start": 2934.09
        },
        {
            "text": "you that never became anything just like this will never be anything probably not but it still gets me excited Contra my brother Knights play Contra like once a day we would just go through and beat it just to meet just to feel right I throw a shoe and protest you almost killed Kevin you almost killed Chi didn't almost kill Kevin and all I got nowhere Coast kill next story got close but not like how you use it yeah you know we don't have to go into the story this is just Halloween costumes that I thought were fun top you want you want to go through the list of top men's and women's Halloween costume sure no wonder roaming through the top top costume for men this year is penny wise from hit top costume for women Wonder Woman for men follow closely penny my support closely by stormtroopers from last Jedi star-lord good **** luck Star Wars star-lord guys Batman Justice League baby from baby driver how the help how do you become baby from baby during **** weirdos no one's gonna get",
            "start": 2992.76
        },
        {
            "text": "from last Jedi star-lord good **** luck Star Wars star-lord guys Batman Justice League baby from baby driver how the help how do you become baby from baby during **** weirdos no one's gonna get that Luke Skywalker of course Wolverine Iron Man Jack Sparrow still really in Kylo Ren for women it is Wonder Woman Belle Leia Annabelle Rey from Star Wars Lorraine from atomic blonde that's an interesting one these have got to be spies do you think so yeah yeah maybe I don't know I don't know man how much I'm sorry no that's fine we've got better we've got a Wonder Woman I saw speaking of friend of the show Meg Turney on her Instagram yesterday put up a shot of her in she just got some one woman armor and put it on and I was like damn that's a good-looking costume that's fun everyone go check that out hey last door I just like to do this check out what's going on this weekend in movies what's opening this week out we got jigsaw we got suburbicon which I believe is that have you seen the",
            "start": 3032.18
        },
        {
            "text": "that out hey last door I just like to do this check out what's going on this weekend in movies what's opening this week out we got Jigsaw we got Suburbicon which I believe is that have you seen the trailer I swear just **** it look it's not well it's Matt Damon and I like this **** psychopath in summer and suburb America some suburbs he just an office dude mafia comes he owes the money they kill his wife they coming back and like **** with his life but like he's had enough yeah yeah I don't know it looks weird can I see it I like their top of the box office Tyler Perry's boo to a Modena Hollywood or Halle 1.7 million dollars Geo storm coming in twice as popular twice as good as Tyler Perry's booty Knopfler jig beside full effect the Doppler way Annie what we thought more people Doppler Doppler Gosselaar dogs is an awesome one elbow dogs Doppler game where the Doppler game time to read some tips and subs and bits and cheers Andy's here party mode on Wednesday new shirt up right",
            "start": 3084.88
        },
        {
            "text": "Doppler Gosselaar dogs is an awesome one elbow dogs Doppler game where the Doppler game time to read some tips and subs and bits and cheers Andy's here party mode on Wednesday new shirt up right now kinda funny now cops know Barney motor part about mr. sexy Andy is sexy Lois this is my sexy suffer a mr. yes-man 300 gave a cheer and says guys after I finish writing my first novel I'm gonna write a sci-fi horror script called attack of the Greg Miller's it's gonna be about a day on earth where everyone named Greg Miller turns into a zombie and kills everyone it's up to Tim Geddes Jen Miller Nick Scarpino Andy Cortez and Joey Noel to stop them PS Kevin is the first person designed to begin the script yeah Kevin can't be killed though rebel nice games gave a tip and says wedding tax just got married to my girlfriend of seven years and I'm as happy as Greg appears on Twitter with Jen appears pro tip when a girl buys you a Lego mental montien Falcon just because put a ring on it good I",
            "start": 3138.15
        },
        {
            "text": "got married to my girlfriend of seven years and I'm as happy as Greg appears on Twitter with Jen appears pro tip when a girl buys you a Lego mental montien Falcon just because put a ring on it good I scare crow's nest gave us cheers but it's below the threshold rumblepack 9  gave us a tip and said anniversary tax 11 years getting married next year all our groomsmen are wearing our RT / let's play shirts under their jackets and you know I'll be wrapping kinda funny oh love you guys that's awesome oh we need to see those photos when that happens who those are the ends of tips for right now we'll do more obviously at the end of this at the end of psi right now though it's time for PS I love this bestfriend xoxo this is where one of you lovely people goes to kinda funny comm slash best friend you can nominate someone in the community that's doing something awesome so we can read here no doubt about Joey this is from yesterday god damn it Joey but you know we have to you know we have to",
            "start": 3190.59
        },
        {
            "text": "you can nominate someone in the community that's doing something awesome so we can read here no doubt about Joey this is from yesterday god damn it Joey but you know we have to you know we have to do the PS I love you yeah I can do that well they'd okay so now to know that they Jenny is good now it's okay it's okay it's not great oh good okay I would say yeah well Joey does that orders lunch Wow let's go let's just talk to people know who the giveaway the giveaway that's wrong - that's one - yeah Joey not a great time for you jellies that we're doing are we're doing our annual meeting today that's all afternoon about what we can think better and Joey is man gonna be on the Tim ladies knowing about things that can be done by now do you think that's the problem it was your you said it not me you know like we do we are a little bit dry on on jokes no pun intended  no I told her I told her mom that I would stop propagating this mom ray sounds like you've got to stop and guys stop",
            "start": 3238.42
        },
        {
            "text": "me you know like we do we are a little bit dry on on jokes no pun intended  no I told her I told her mom that I would stop propagating this mom ray sounds like you've got to stop and guys stop making this joke Joey's a fine young lady she does not have a substance abuse problem and she said further so I was making fun of substance abusers makes you a horrible human being and I said mrs. Tommy I can't hear you through all the Jim Beam that's and my sister maybe is that what I was implying that was what I wasn't blind man that joke just went downhill well what are you doing you doing something I'm pretty much fully over yeah that's fun gotta make sure I eat today you don't even look at Joey's on it right now Michael 496 says are we just skipping right over Nick's cocaine addiction yeah that's gone that job what kind of mission that's just like a fun time this is fun Mighty Mouse 56 does be nice to Joey she's working hard she love Joey she knows thing is there's this thing we do",
            "start": 3300.01
        },
        {
            "text": "that's gone that job what kind of mission that's just like a fun time this is fun Mighty Mouse 56 does be nice to Joey she's working hard she love Joey she knows thing is there's this thing we do in this office where we encourage each other and we boost each other up and we're really nice to each other but every once in a while we when you're working your hardest that's when we come at you yes training you know it keeps you it makes you strong they've done right no can to physically you know 4px I was best friend xoxo Joey is on it and she has put in the following Joey Hinkle is shouting out Celeste build her back build yeah build her back she's had some rough times no she's had some rough time the past year and could use some recognition for being awesome as hell Celeste thank you for being awesome in this kinda funny are you best friends you're all amazing but today Celeste is your day to be the most amazing meanwhile the giveaway is gonna be song bring her on PlayStation 4 remember",
            "start": 3354.82
        },
        {
            "text": "awesome in this kinda funny are you best friends you're all amazing but today Celeste is your day to be the most amazing meanwhile the giveaway is gonna be song bring her on PlayStation 4 remember if you want to win the game we giveaway each and every day here at which that team you such kinda funny games it's simple being the chat like so many of you are right now or if you're watching later on youtube.com slash kinda funny please subscribe or listening on a podcast service please subscribe and rate you can with three other ways or amplify your chances number one subscribe to us on Twitch you don't have to be here if you're a subscriber plus you get the Logan extra name the cool emotes private chat time with us you'd get to listen the show ad for you get to play multiplayer games with me that's right Halloween's Tuesday there's new costumes at 5:13 for **** I'd like to stream it this is usually blows up on our face but we're gonna try again who **** cares you know I mean you",
            "start": 3399.26
        },
        {
            "text": "me that's right Halloween's Tuesday there's new costumes at 5:13 for **** I'd like to stream it this is usually blows up on our face but we're gonna try again who **** cares you know I mean you miss 100% of the shots you take when it comes to that game also extra life of course Saturday a week from Saturday November 4th we'll be streaming multiplayer games their subs we pulled up to do to play the games with us there too I'm excited because here's the thing yeah I've given myself one cheat day a week and I might say to yourself Nick even eating **** all week it's true I would never say it but on extra life are we getting pizza of course you kidding me again talk about your course you kidding me finally getting this quesadilla that has the chicken nuggets in it no people were asking for us to do the taco that's made it of an egg have you seen I might do that we might do that yes but the shell is a fried egg I mean yeah are you can also support us over on patreon.com slash kinda",
            "start": 3438.3
        },
        {
            "text": "us to do the taco that's made it of an egg have you seen I might do that we might do that yes but the shell is a fried egg I mean yeah are you can also support us over on patreon.com slash kinda funny or patreon.com slash kinda funny games at the $  level your inner to get you every giveaway we ever giveaway on the show and we'll be doing a lot of those out extra life as well so probably get over there plus you get the early episodes bonus stuff all sorts of cool **** like I said so long where your PlayStation 4 it's going to kinda funny patreon supporter Frank Navarre set navarre set congratulations now time for the patent Maury already three and three three from the regular trip three from sub-lieutenant og zeiger says you getting a round table for extra life hell yeah okay didn't we get round people last time we didn't know we never got round him yeah we got Domino's we got Pizza Hut and man they did not well not great yeah the round table remember was the one where Tim was",
            "start": 3478.65
        },
        {
            "text": "We get Round Table. Last time we didn't know we never got Round Table. Yeah, we got Domino's, we got Pizza Hut, and man they did not well not great. Yeah, the Round Table remember was the one where Tim was like get the pan version of it. We got the pan version of Round Table. It was awesome. Yeah, maybe we should do I know we're the first the inaugural Kevin Greg eat a pizza and only we did and we that was we had regular was good too but that pan pizza was life-changing. Okay, speaking of more food beats over 87 says hey Greg since you were talking about Joe Beef butcher blend and cooking with Greggy have you eaten there and what did you eat who I went Ben to Joe Beef in Montreal twice it is amazing if you were ever in Montreal you got to go to this place it's run by David McMillan lovely man and it's really cool rustic awesome food and it's like you go in there and it's like it's it's not fancy but it's it's gonna cost you a pretty penny you're no you're not getting out of that for a peek you know",
            "start": 3523.0
        },
        {
            "text": "cool rustic awesome food and it's like you go in there and it's like it's it's not fancy but it's it's gonna cost you a pretty penny you're no you're not getting out of that for a peek you know I like that and it goes on a long time but it's like you go in there and it's didn't it's like you know candle lit awesome **** on the walls it's not like it's not pretentious sure and like their menus just on a chalkboard and so you go there and what if I Jenna I love that place we eat like pigs when we go there they have this lobster spaghetti oh my god they got foie gras up there oh my god boisterous you kidding me bone marrow yes that I had a steak it was delicious too I love Joe Beef and it sucks that my stupid wife can't **** go back to Canada because I won't go back to you to Joe Beef but she had a **** move here and be in love with me you and Mary you ass you told her to do those things you care for the pad of the safe harbor liners travel what are travel travel eventually and",
            "start": 3567.57
        },
        {
            "text": "but she had a **** move here and be in love with me you and Mary you ass you told her to do those things you care for the pad of the safe harbor liners travel what are travel travel eventually and cool your jets cool but I want the foie gras doggies in Fargo Kevin can make some foie gras free right now Mr. a Monsieur Benjamin in Hayes Valley they got good for me I kind of OD'd on pate I was in I was in Copenhagen so the frog was not I got to stay away from it cuz everything's pate there okay I got a lot of Pat's that sure is like artisan places that you go and they just cut you a slice of pate it's gross it's good no but I heard you know casually co-op says Nick firing the kid fan I've never actually listened to Firing the Kid I loved when Brian Connor Brennan shop are on Rogen so I probably should I just started listening to Your Mom's House yesterday that's a **** weird-ass podcast than the super-fun the indie boy says when is the Greg Miller Industry episode of God going live",
            "start": 3609.07
        },
        {
            "text": "should I just started listening to Your Mom's House yesterday that's a **** weird-ass podcast than the super-fun the indie boy says when is the Greg Miller Industry episode of God going live had to go to bed when you streamed it two to three weeks we haven't laid out a real schedule of what's going live when what's the GOG that's up right now let's wait no Elise is the GOG that's up right now at patreon.com slash Kinda Funny yeah but we're so far ahead of the game that we need to actually sit down and schedule it all out NH drumline 17s Nick Greg and Nick what would it take for you to switch away from using Apple devices something Apple screws up or something the competition does just curious as I love Apple devices and all the money I've invested in iTunes all my apps will probably keep me with them forever that's thing for me is like at this point it is just I'm in the ecosystem I'm in the iOS ecosystem I've I've once I get the phone I've had mostly pleasurable experience",
            "start": 3657.73
        },
        {
            "text": "keep me with them forever that's thing for me is like at this point it is just I'm in the ecosystem I'm in the iOS ecosystem I've I've once I get the phone I've had mostly pleasurable experience with it cuz it just works I like the design of them I do like being a little walking on Apple Store and talk to people whenever I want so that there is that but it's also one of those things like I don't know what I'm not missing because I never I never interact with Android phones period that's the big thing I'm attitudes like what would it take I have no idea I don't I don't I can't even tell you what it would take to get me to go to Android device I'm sure they're great I'm sure they're great I want it to work I want it to be easy this is why I like even though I use a PC I like Mac's better because I just know my I've said it before my biggest pet peeve is technology that doesn't work and so I don't want a compatibility issue I didn't want to jump through hoops I don't this thing just turn",
            "start": 3703.72
        },
        {
            "text": "I just know my I've said it before my biggest pet peeve is technology that doesn't work and so I don't want a compatibility issue I didn't want to jump through hoops I don't this thing just turn it on and go in that my PC and I went I thought what PC gaming right doesn't do that and the fact the phone does in my lab head does I'm all set you know the way it goes that's just trade Howard is a liability it's also the thing - to this point of you don't talk about like the your skill charts right of where you invest your points my nerdy points of caring about share invested in comics and video games right like the tech part of it I don't really care lady it's got a better care it's got this great I mean cool you don't even like well I don't want to sit down and do the Tim Geddes thing of comparing contrasting doing this I'm gonna order this and test it out but maybe send it back but see I've done the Tim Geddes thing of Tim's already done that work I'll just ask him that's what I've",
            "start": 3738.64
        },
        {
            "text": "comparing contrasting doing this I'm gonna order this and test it out but maybe send it back but see I've done the Tim Geddes thing of Tim's already done that work I'll just ask him that's what I've learned from Tim Geddes speaking too much not speaking much good non-sequitur comic wise caught up on Invincible last night good ending any well so far crazy what's going to sub only wordy on subway heavy you don't worry about it what is the name of the sous-vide machine that Kevin uses ask Captain Crunch Java no but knowing her culinary okay all right I have the Bluetooth which I regret yeah cuz you could scare Paul with it you could just scared of everything yeah she was good I mean she's terrified well she lives with Kev Kevin and if I live with Kevin I'd have I'd have a **** colon I just would I would be so anxious all the time that if you'd but Nick Oh Jimmy that's a sitcom right there living with Kevin yeah comin I don't know you both get divorced or I'm not wishing this honey and",
            "start": 3778.7
        },
        {
            "text": "would I would be so anxious all the time that if you'd but Nick Oh Jimmy that's a sitcom right there living with Kevin yeah comin I don't know you both get divorced or I'm not wishing this honey and goes just just spirals down every seasons like that was a comment it's a drama this is thriller that's a horror movie that'd be great let me super fun people would love that right people don't like consistency cinephile says Nicky should watch Broadchurch I think my wife watched that Zapped Turk says Greg when Janica the new Taylor Swift music video was cool his anime robot in the **** but you made me do she's in like the Ghost in the Shell some images from that spider kid says how do they track how well movies do I I mean there's box office returns they track that but my question is how do they project how well they're gonna do that's all that's something I've always wondered and never had I never taken the time to look into so I just talk **** about it cuz I talk **** about things",
            "start": 3837.32
        },
        {
            "text": "they project how well they're gonna do that's all that's something I've always wondered and never had I never taken the time to look into so I just talk **** about it cuz I talk **** about things I don't understand but that is something I need to look into at some point all right ladies gentlemen this has been the Kinda Funny Morning Show we do it each and every weekday here on twitch.tv slash Kinda Funny Games you can listen on youtube.com slash Kinda Funny later or podcast services around the globe no matter where you get the show thank you so much for enjoying it remember Monday we'll be back but it's going to be a bit weird 7:45 we'll go live for the pre pre show for the PlayStation Paris Games Week then we'll chill out through the PlayStation pre-show then we'll do the actual conference we'll be live-streaming reacting to all of that afterwards our post show will be Kinda Funny Games Daily then we'll see what we do at the morning show in terms of if it should happen",
            "start": 3886.71
        },
        {
            "text": "conference we'll be live-streaming reacting to all of that afterwards our post show will be Kinda Funny Games Daily then we'll see what we do at the morning show in terms of if it should happen where it's gonna happen we've been streaming forever and chilling out with you already oh I remember Kinda Funny Games Dailies next Nick's gonna read subs and tips while you're ready for that show it's a Halloween party tomorrow look for tweets and stuff from that may be an IRL stream if I can make it work if not Instagram yeah it's gonna be good weekend I had a lot of fun making this show with you today do you think that Taylor Swift just has a blast yeah I like to think she does but she's probably stressed out like she works really hard I know but like this is far this is **** cool oh we should make a video Joseph's gone okay I mean he seems like he says Carl body and be like yo tell him told Joseph that we're ready for him all right Julie says until next time it's been a pleasure",
            "start": 3927.6
        },
        {
            "text": "we should make a video Joseph's gone okay I mean he seems like he says Carl body and be like yo tell him told Joseph that we're ready for him all right Julie says until next time it's been a pleasure to serve you you",
            "start": 3967.05
        }
    ]
}