{
    "id": 3112,
    "video_id": "XWW1eCBg5BE",
    "show_name": "Cooking With Greggy",
    "hosts": [
        "Greg Miller",
        "Geneviève St-Onge"
    ],
    "title": "Make these Mussels, Fries - Cooking With Greggy",
    "description": "Get your Team Fat apron by supporting us on patreon.com/kindafunny at the fan mail tier during the month of October!\n\nSubscribe! http://www.youtube.com/kindafunny?sub...\n\nSupport us and get EVERY episode of Cooking with Greggy one week early: http://www.patreon.com/kindafunny\n\nGet your Cooking with Greggy shirt here: http://www.kindafunny.com/store\n\n***Full Recipe***\n\nServes 2 people\n\nMUSSELS INGREDIENTS:\n- 2 pounds of mussels (one per person, scrubbed & debearded (foot removed))\n- 1/2 stick of butter\n- 2 small shallots (or both pieces of a medium one), finely chopped\n- 4-5 cloves of garlic, thinly sliced \n- 1/2 cup of dry white wine (Sauvignon Blanc, Pinot Grigio)\n- 1/4 cup of heavy cream \n- 2 sprigs of fresh thyme\n- Kosher salt & freshly ground pepper\n- Loaf of crusted white bread\n- 1/2 stick of butter for browning bread\n\nMUSSELS STEP-BY-STEP INSTRUCTIONS: \nMelt half a stick of butter in large pan on medium heat, then cook garlic and shallots until softened but not browned (a couple minutes, stirring frequently). Deglaze with white wine, add sprigs of thyme and bring to a boil. Add mussels, cover pan with lid. Steam for 4-5 minutes or until mussels start opening up, gradually transferring them to shallow serving bowls as they open. After 8-10 minutes, discard any that have not opened. \n\nOnce all mussels have been taken out of the pan, add cream and stir, bringing sauce to a simmer. Season with salt & pepper, and ladle mix onto mussels in serving bowls. Serve with buttered, charred slices of crusted bread, fries on the side. \n\nFRIES INGREDIENTS\n- Canola oil for frying (enough to submerge fries in a deep pan) \n- 2 yukon gold potatoes, cut in long sticks\n- Kosher salt\n- Pepper\n- Rosemary or other herbs if you're feeling crazy.\n\nFRIES STEP-BY-STEP INSTRUCTIONS\n1) Dice dem taters into sticks. Y;know, the size of fries you'd wanna eat.\n2) Toss the finished sticks into a bowl of cold water to destarch them. Dump out the cloudy water, put more cold water in. Repeat until the water in the bowl is no longer cloudy.\n3) Over in your cast iron skillet, dump in a good layer of canola oil. You want to submerge the fries, but you don't need to overdo it. Heat over medium high.\n4) While the oil is heating up, pull the fries out of the water and put'em on a clean towel. Pat them dry.\n5) OK, the oil's hot? Great. Put the fries in carefully. Don't overcrowd. You'd going to do this in batches.\n6) Once the fries change texture (they'll go from glossy to matte), pull them out and put them on a paper towel.\n7) Put in the next batch. Do it again.\n8) OK, start tossing in the partially fried fries. Let'em go until they're the brown and crispy fries you like. \n9) Pull'em out, toss'em back on a paper towel, and salt, pepper, and herb those bad boys.\n10) Serve!\n\nFollow us on Twitter!\nGreg - http://www.twitter.com/GameOverGreggy\nNick - http://www.twitter.com/Nick_Scarpino\nKinda Funny - http://www.twitter.com/KindaFunnyVids",
    "published_at": 1509379204,
    "duration": 958,
    "transcript_chunks": [
        {
            "text": "what's up everybody on today's menu what is it Jen this is you your tell you this is Geneviève St-Onge is my wife special episode actually Cooking with Jen now I'm Cooking with Greggy what are you cooking today so I decided to make one recipe that I made for you uh-huh but I thought was a fun take on hey we're having dinner like I want it to be romantic so and since you've been doing a bunch of meat yeah I decided to make something that's a little bit more on the seafood side so so super French so it's mussels essentially in French it's moules marinières yet I don't know the equivalent in English mussels and fries that's what it is when I went to get the mussels this morning I wanted a butcher shop there guy had him talking to me he's like he said that something that was very nice to hear he's like I'm gonna go through and pick just the closed ones what why is that why is it important because when they're open sometimes they can be dead and you're only gonna get sick once on",
            "start": 1.16
        },
        {
            "text": "to hear he's like I'm gonna go through and pick just the closed ones what why is that why is it important because when they're open sometimes they can be dead and you're only gonna get sick once on mussels because it's really awful so like that happened to me and now I'm super paranoid about it so no one's getting sick oh cool so you've already cleaned these what's gone about these guys so I'm gonna show you what you're looking for us it's really when you you're just unpacking your mussels always buy them the day of because they're alive and they're gonna die and it's gonna suck and you're gonna ruin your meal and your life so once you get them if you're lucky like Greg this morning they're all pretty much clean like there is no gunk on them if there is you can just brush it off but what you're looking for and you can help me out here so mussels come with this little mussel beard yeah that's the name and that's how they're actually attaching themselves to rocks or surfaces whatever so",
            "start": 63.92
        },
        {
            "text": "you're looking for and you can help me out here so mussels come with this little mussel beard yeah that's the name and that's how they're actually attaching themselves to rocks or surfaces whatever so what you want to do because that's like it's edible but it's not enjoyable has a texture you just pull it out you just get it and you just you remove it and then that's it cuz like it's kind of gunky you don't want that and so this one is good like it's closed if it's a little open we what you can do you just hit it and it's kind of freaky cuz they're gonna close yeah this guy might be dead because I pulled him out already you pull that ones in the ones I didn't want so yeah so one of the things you you're looking for that you want to get rid of and not cook you get the ones that are broken they might wreck sure yeah this one is cracked so there are you had might have another better one that says see like this one has a hole in it so they might have opened in between the store and your",
            "start": 108.05
        },
        {
            "text": "they might wreck sure yeah this one is cracked so there are you had might have another better one that says see like this one has a hole in it so they might have opened in between the store and your house or not they may have been opened for a while and like that's horrible for bacteria and stuff so you don't want to eat that okay so what's next I'm gonna do a white wine base sauce and I'm gonna need you to finish chopping up some stuff okay so come with how much garlic and how much shallot I know I'm doing I like it very garlicky so you do like four or five cloves of garlic and shallots I'm just doing like two well you know they come in like one bulb I do the both sides own about they're like a softer version of onions okay sometimes you can put leeks to like that's very very good but today I'm keeping it simple gosh I did the the shallots really really small because that's the texture I like or like I want to go for the garlic is like very very just like sliced please cut me that",
            "start": 158.6
        },
        {
            "text": "today I'm keeping it simple gosh I did the the shallots really really small because that's the texture I like or like I want to go for the garlic is like very very just like sliced please cut me that will be is such a good story how many of you gets to my camera I go to jail you're doing a great job thank you alright so now I'm just gonna start prepping the sauce so what you're gonna do is like whole stick of butter should probably yeah it's very French it's like it's gonna be white wine and then cream and and butter you won't you do that I'm gonna get the oil okay so I'm gonna take canola oil here get a good base here and yeah cast iron because I want these guys submerged yeah so I'm using a lot bit what's your like go-to kind of distance from the edge to the the oil I always that's what makes me nervous I just want us to be able to submerge the potato that's all I ever looked okay I'm gonna crank this up on that medium-high I think I could have done just half a stick of butter cuz I",
            "start": 212.29
        },
        {
            "text": "makes me nervous I just want us to be able to submerge the potato that's all I ever looked okay I'm gonna crank this up on that medium-high I think I could have done just half a stick of butter cuz I usually make it for two people all right that's what you're doing today well we have one point remember though you're faking it for them Oh totally making two portions everybody there will be a lot of sauce that's gonna be good well this starts to warm I'm gonna pat dry the fries I'm just using a kitchen towel toss it open it up and put the potatoes in there and Pat them dry I'll keep them covered try to keep that Brown this away cuz I don't wanna go to brown town right now no that's not good round town Nick you ever been to brown have you ever had brown potatoes what were you was there another there's no way you can interpret all right now that my butter is fully melted I'm gonna throw the shallots and the garlic in, merge and yeah doesn't matter which order what you want to",
            "start": 268.32
        },
        {
            "text": "another there's no way you can interpret all right now that my butter is fully melted I'm gonna throw the shallots and the garlic in, merge and yeah doesn't matter which order what you want to get is like sorry we want to get is really just to soften them up a little bit so don't brown them cuz you're gonna keep on cooking them and that could be just like they're gonna burn at the end of the day so you just want a soft bubbling so that's gonna go for about two three minutes until it's all soft that's pretty much it oh yeah oh yeah oh yeah all right now what I'm gonna do for the mussels so I'm just gonna throw bunches of thyme in there like you don't really care to like rip them out from the stem cuz it's really just for like perfuming so you just leave them in there it's all good what you want to do is get a dry wine I did something Sauvignon Blanc today because it's got like it's not gonna be sweet you don't want to make like sweet mussels so very loose for like half a cup just to bring",
            "start": 318.92
        },
        {
            "text": "you want to do is get a dry wine I did something Sauvignon Blanc today because it's got like it's not gonna be sweet you don't want to make like sweet mussels so very loose for like half a cup just to bring some winey flavor in there good yeah they're getting to be where I want because I just want them to change their whiteness and it's hard to understand it without looking I'll show when I got a good example I'll show it to you yeah it's like a greasy white isn't what I always describe a greasy one yeah like cuz this the guys there look at him see how like he's like a matte mmm yeah I'm trying to show it but it's hard to doing it yeah but like see how he's easier and then he's got like this very greasy clear white versus the white of this yeah does that make sense thing yeah yeah exactly it's like Dr. Nick Riviera you you know exactly Dr. Nick well Bart throws the the chicken sandwich on the wall and the bird flies into it that's what we're looking for here and then when they do that",
            "start": 378.6
        },
        {
            "text": "it's like Dr. Nick Riviera you you know exactly Dr. Nick well Bart throws the the chicken sandwich on the wall and the bird flies into it that's what we're looking for here and then when they do that as they open I pull them out so back to the muscles you got like nice bubbling going on I don't know if you can see that Nick okay so that's when you want to put the muscles in essentially what it's gonna do is it's gonna steam them I would just drop them in there but I'm afraid I'm gonna like splash it all over myself and I don't have a cool Team Fat apron seems like you do have one right there but you didn't want to wear cuz it's green it's the apron, you know as it matter doesn't matter so anyway you just drop it down there everything try to level everything off so that they're all sort of in contact with the the broth you made and then you just cover it up let it steam and it's gonna take only a couple minutes and you're gonna start noticing the muscles are gonna open up so now you",
            "start": 432.45
        },
        {
            "text": "of in contact with the the broth you made and then you just cover it up let it steam and it's gonna take only a couple minutes and you're gonna start noticing the muscles are gonna open up so now you can see a bunch of them have opened up and that's what you want you want I'm gonna try to show you one in particular mmm I'm gonna use the other one so what you want to see is like this pink orange collar on the muscle I don't if you can see it on camera like this so that's a color you're looking for and as they open up you're just gonna drop them in the bowl because you want them all to open but you don't want to overcook the ones that are already open and I just bring myself you're good yeah no I just put my finger on the the lid no a big deal I've done worse so while you were doing that Jen I took the wave one why well it's a wave to fries that weren't there for the first time came out wave one that had already been fried for a little bit went back in now they stayed there until",
            "start": 479.25
        },
        {
            "text": "Jen I took the wave one why well it's a wave to fries that weren't there for the first time came out wave one that had already been fried for a little bit went back in now they stayed there until they're golden brown we like if you don't like them golden brown **** you who even are you yeah don't even bother eat these fries you don't deserve them cuz they're like when I touch them I can already feel it crispy there yeah that's how you know you're doing the right all right so back to the muscles what I'm gonna do now see they're all out I'm just gonna eat them warm so we're gonna bring the heat down a little bit and I'm gonna stir in this is super optional but some heavy cream just to make it a little bit more bad for you you know cuz it's French and the thing is you don't want it to curdle and I've been struggling and the internet might be able to help me on that but I've been struggling with American cream so much compared to Canadian cream like there's heavy whipping cream in",
            "start": 540.5
        },
        {
            "text": "curdle and I've been struggling and the internet might be able to help me on that but I've been struggling with American cream so much compared to Canadian cream like there's heavy whipping cream in Canada we have whipping cream heavy cream light cooking cream and like regular **** coffee cream you know it always happens that she sends me in the store and says heavy cream and I can only find heavy whipping cream and she tries to say no and I just say that's all there is yeah it doesn't seem like a thing alright so the sauce is done these look great what I'm gonna do and I'm probably gonna make a mess I'm just gonna pour everything back on there yeah so like it gets all soaking or there you go you want all that soft shallot and garlic and then BAM we thought it would be interesting to just do an episode on how I make bread unfortunately last night when I mixed up my whole thing I got a little drunk it's no wonder when you got here it wasn't just that like the bread making guy no no I",
            "start": 586.43
        },
        {
            "text": "do an episode on how I make bread unfortunately last night when I mixed up my whole thing I got a little drunk it's no wonder when you got here it wasn't just that like the bread making guy no no I never said that how can you get drunk making bread I'm just making sure every understands that you were you were coming in to do this but yeah I'm drinking all day with Geneviève it was Paola's bridal shower we had the mimosas all day and then things escalated really quickly anyway so I got here and then I started doing my mix and you may see that on Patreon soon yeah we're gonna put up on Patreon but I'm pretty satisfied without it turned out considering how drunk I was last night so what we're gonna use is bread today in two different like things but right now I'm gonna use it with the mussels because I like to do the recipe where you can have some support so you're just soaking up all the sauce so I'm gonna cut it and then we're gonna just grill it really quickly so it gets that nice charred",
            "start": 644.09
        },
        {
            "text": "I like to do the recipe where you can have some support so you're just soaking up all the sauce so I'm gonna cut it and then we're gonna just grill it really quickly so it gets that nice charred like sight of it it's very crunchy which is a good thing successful bread making everybody my old crew in Montreal everybody right now who's watching this episode from my old work they're super sad because I used to bring bread all the time at the office probably contributed to making them really fat yeah there you go so not only did they miss you but you just insulted on my point okay it's like good fat look at all these little air pockets that's like that's what you want to get this is gonna be good hey Team Fat hey guess what what yeah yeah kindafunny.com/store maybe hopefully if now patreon.com/kindafunny now is this not a recommended using your fingers well yeah for sure but I just met have been exaggerated amount of butter yeah did you really have to use the whole stick no we're being",
            "start": 690.32
        },
        {
            "text": "Kinda Funny now is this not a recommended using your fingers well yeah for sure but I just met have been exaggerated amount of butter yeah did you really have to use the whole stick no we're being dramatic here okay so make sure so I'm just gonna put it in there let it absorb some of the sea of butter and let it go a hot minute like you really want it to char this one is not a hundred percent touching the surface so it's not gonna work as well but we'll see well tell who never bothered me any more tea purely for an aesthetic standpoint presentation let's talk about this why do you cook you cook to impress people this is gonna be impressive you take a really depressing article like Shrek please call a scorns fraud conviction huh and then you flip it to the best-looking side so like a nod is not really interesting to see sure and you just roll it in a cone and it's okay besides perfect wrong again turkeys fine who cares yeah and then you just can make a little opening you're",
            "start": 755.05
        },
        {
            "text": "a nod is not really interesting to see sure and you just roll it in a cone and it's okay besides perfect wrong again turkeys fine who cares yeah and then you just can make a little opening you're making a bouquet fries exactly you put it in there then you flip it over because then nobody huh turn it to them there you go you just wants you to have that little thing going on seems nice then you fill it up with fries let me do that I got it so I'm just gonna pile up the bread and over here it doesn't really matter it's a very rustic recipe rustic that's hot we're gonna drop that off here and then that's pretty much as good as it gets in terms of presentation because it's very it's a messy presentation that's the point yeah this is a blue-collar meal right here from freshly sailor sailor is used to make this technically so it's a sailor's meal so there you have it it's my mussel recipe that gets you all the hot boys there we go got him he's got what got me where am i right now huh ****",
            "start": 828.4
        },
        {
            "text": "used to make this technically so it's a sailor's meal so there you have it it's my mussel recipe that gets you all the hot boys there we go got him he's got what got me where am i right now huh **** you if you're not so yeah do the thing like oh yeah you know what do you think of this meal make it at home send us your photos on Instagram with the hashtag Cooking with Greggy you're now Cooking with Jen let us know in the comments what you do differently let us know your favorite recipes and know until next time it's been a pleasure sir",
            "start": 894.97
        }
    ]
}