{
    "id": 1182,
    "video_id": "hVV9FYcpbI0",
    "show_name": "Gameplay",
    "hosts": [
        "Colin Moriarty"
    ],
    "title": "Mega Man 3 Entire Game Full Playthrough - Kinda Funny Plays",
    "description": "Colin Moriarty beats Mega Man 3 on the Mega Man Legacy Collection. Come back tomorrow for Mega Man 4!\n\nSubscribe! https://www.youtube.com/user/kindafunnygames?sub_confirmation=1\n\nThis video was edited on an ORIGIN PC EVO15-S Laptop. Get your PC here: http://www.ORIGINPC.com\n\nEach and every day, Tim Gettys, Greg Miller, and Colin Moriarty get together to talk videogames. \n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\n\nMusic by Rakohus!: http://www.youtube.com/user/rakohus",
    "published_at": 1441825201,
    "duration": 3894,
    "transcript_chunks": [
        {
            "text": "Welcome back to our Mega Man let's plays today I'm going to play Mega Man 3. This is not only my favorite Mega Man game, this is my favorite game of all time. I love this game; it's my favorite game of all time. I don't think it'll ever be beaten, uh, at least on the game of all time list. I'm going to beat it right now for you. Uh, Mega Man 3 is an excellent, excellent game. Uh, I was absolutely obsessed with this game when I was a kid. This is Mega Man 2 is really the game that got me into Mega Man; Mega Man three was the game that made me obsessed with it. Um, as you'll see here, it adds a key mechanic: the slide. The slide stays in Mega Man throughout the rest of the NES series and then seven and eight, and then disappears actually in nine and 10, which is based more on Mega Man 2. Um, so here we're going to start with uh Magnet Man, who is my favorite robot master of all time, and a good place to start in the game. I used to dress up as him as a kid, actually believe it or not; I got to find a picture.",
            "start": 1.68
        },
        {
            "text": "going to start with uh Mega Man, who is my favorite robot master of all time and a good place to start in the game I used to dress up as him as a kid actually believe it or not I got to find a pic there's got to be pictures I had this Fisher Price magnet that came with this like my first science set and it was just gigantic magnet I used to rubber band it on my head and uh run around like an idiot I would still do it if I knew where that magnet was so Mega Man 3, like two doesn't have a really firm order you can jump in in multiple places you can jump in with Magnet Man you can jump in conceivably with like Hard Man or Top Man you can jump in with Snake Man which is a pretty popular way to play I start with Magnet Man we'll move on to Hard Man after that the funny thing is is that eventually you're going to have to fight that was Dum basically you're going to have have to uh fight two of the Robot Masters at least with your arm Cannon which is unusual with most Mega Man games you",
            "start": 44.88
        },
        {
            "text": "you're going to have to fight that was Dr. Wily basically you're going to have to uh fight two of the Robot Masters at least with your Arm Cannon which is unusual with most Mega Man games you jump in and then you can cycle them but there's no cycle in this game disappearing blocks of course the bane of everyone's existence that's that one up all right so we're going I'm sorry I go quiet sometimes it's just you know me concentrating even though I've beaten Mega Man 3 literally I beat Mega Man 3 probably 100 times um so I know the game pretty well but you know there are people better out than me obviously out there so we're all ready to face Magnet Man just got to deal with his last Guardian here the music's rocking too in Magnamite stage all right so here we go Magnamite fights in some of a cycle predictable cycle he'll shoot magnet missiles jump across the screen like this you can slide out of the way of them uh every once in a while he'll try to suck you in like this",
            "start": 87.2
        },
        {
            "text": "in some of a cycle predictable cycle he'll shoot magnet missiles jump across the the screen like this you can slide out of the way of them uh every once in a while he'll try to suck you in like this and if you don't press anything he'll actually bring it towards him CU you are metal and he has a magnet why it doesn't work on him I don't know kind the answer to that question he's probably made out of a special alloy so you just got to be patient if you uh later on if you have like spark uh shock which is Spark Man's weapon you can actually use it on them and it does a lot of damage we'll do that later in W Castle but for now we have to just deal with the Arm Cannon and that's the end of Magnet Man and so we can move on here uh it's worth noting that in the intro which we we saw just a little bit of like the the state the select screen before you get to the Robot Masters there's a great song there you should go look it up and and check it out Mega Man 3 was rushed to market um by many",
            "start": 149.92
        },
        {
            "text": "\"A bit like the state select screen before you get to the Robot Masters, there's a great song there - you should go look it up and check it out. Mega Man 3 was rushed to market, um, by many accounts, and uh, it's actually Fun's least favorite Mega Man game, um, and you can tell that there were supposed to be a cut scene there and they never did it because the song is like two minutes long for no reason, um, and of course Mega Man 2's intro is like iconic, so I'm sure they wanted to do something cool and they probably just ran out of time. So, there's a little bit of info for you nonetheless, even though Inap likes Mega Man 3 the least, it's actually becoming more popular to think this is the uh best Mega Man game. I think it's certainly the most solid. So here these bees drop little pal, little pieces of I don't know Hive or whatever that drop five more bees and you can actually just because the RAM and the NES is so limited you can actually just scroll them off the screen so things that\"",
            "start": 196.52
        },
        {
            "text": "pieces of I don't know Hive or whatever that drop five more bees and you can actually just because the RAM and the NES is so limited you can actually just scroll them off the screen so things that are the bane of your existence like why enemies come back you can also use it to your advantage to get rid of them this enemy here is a play on Sniper Joe it's called Hammer Joe he'll throw hammers instead of uh annoying you with other stuff and so we'll actually get rid of Rush here you start with the Rush Coil here by the way this game also introduces Rush um for the first time in Mega Man 2 obviously Mega Man one you had the Magnet Beam and Mega Man 2 you had items one two and three and now they actually gave him a personality basically so Rush is the dog and you'll be in this particular game Rush Jet Rush Coil which you start with and then Rush Marine which is used very sparingly that's an underwater Rush module those monkeys you might recognize from Woodman stage of Mega Man 2 we don't",
            "start": 235.84
        },
        {
            "text": "Rush jet Rush coil, which you start with, and then Rush Marine, which is used very sparingly - that's an underwater Rush module. Those monkeys you might recognize from Dr. Wily's stage of Mega Man 2; we don't really have to fight this guy, but I do want to just get energy so since I didn't get hit before, and this guy, you can kind of like play some games with if you want - like try to get them to go that way and then just outrun them. So these are kind of plays on some enemies you meet in Mega Man 1; the guys in Guts Man's stage who throw axes at you now they're piloting these devices. Grab an E-Tank here and here, and you're going to deal with these that spread out of the ground, and also the bees which you can shoot off just make things a little easier for you. Here we'll fight Proto Man again like we did in Dr. Wily's stage; he's known - I'm actually spoiling it for you - he's known as Break Man at this point in the game because you don't know that he's, spoiler alert, 25 years old, old spoiler alert, he's Mega Man.",
            "start": 278.68
        },
        {
            "text": "Mega Man stage he's known I'm actually spoiling it for you he's known as Proto Man at this point in the game because you don't know that he's spoiler alert Proto Man is Mega Man's brother created by Dr. Light and Dr. Wily together in Mega Man 5 you'll find that he turns on Mega Man or does he all right so we're at Hard Man stage we'll go to the Magnet Missile now if you're speedrunning Mega Man 3 there's actually tricks you use on Hard Man and you get actually get hit by him intentionally to make the fight go quicker but I'm not going to play like that cuz I try to play a little more elegantly so there you would actually get hit intentionally because it'll allow you to move and then otherwise you just stand in the air and then you just kill him like that Hard Man's dead so from that we get the Hard Knuckle which is a somewhat useful weapon uh especially in Dr. Wily's Castle when you need to break some barriers it'll be useful on Top Man who we're going to go to next um although you",
            "start": 337.6
        },
        {
            "text": "We get the Hard Knuckle, which is a somewhat useful weapon. Uh, especially in Wily's Castle when you need to break some barriers; it'll be useful on Top Man, who we're going to go to next. Um, although you can easily fight Top Man with the Arm Cannon if you want to, and that used to be when I was a kid - I used to actually start with Top Man and then go to Top Man's stage, which is called Shadow Man, etc. All right, so we'll go to Top Man next. Bizarre Robot: I have no idea what Wa...I don't know what he was like; what he was doing. His stage is a greenhouse, which I think is kind of cool, but they probably could have done more with this particular character. Definitely one of my least favorite robots in any Mega Man game. The Rock and Roll music on the stage though - the Rockman soundtrack is so underrated in Mega Man 3; it's so much better than Mega Man 2's, and people are like just on Mega Man 2's dick, and I'm sorry if...I'm playing on PlayStation 4 by the way. I'm playing on Legacy Collection if you haven't figured that out yet. I'm playing on...",
            "start": 387.4
        },
        {
            "text": "2's and people are like just on Mega Man 3's dick and I'm sorry if the I'm playing on the Mega Man Legacy Collection, by the way I'm playing on PlayStation 4 - if you haven't figured that out yet. I know the buttons are a little loud there's nothing I can really do about it unfortunately some a lot of slow down here. If you play your cards right, depending on if that's what you want, you see there you can get the extra life we don't really need it. Jeez, here man I **** that whole screen up as I was talking about how I don't need the extra life. This cat will create incredible slowdown - use it to your advantage. Another one of these cats this time the yarn goes off the screen because there's no barrier there so the slowdown is not as severe here. You just got to be careful with your jumps up now this is cool, I can't always nail this but this part you can actually play this part really elegantly because it seems like you can't get through this part without getting hit.",
            "start": 437.12
        },
        {
            "text": "your jumps up now this is cool I cant always nail this but this part you can actually play this part really elegantly because it seems like you cant get through this part without getting hit you can ah I messed it up again I almost want to go back and show you guys but I just want to keep cruising so you can time your jumps there to dodge it but every time Ive tried on the Mega Man Legacy Collection I think its just the PS4 controller and the way I play on this as opposed to like the NES controller the Wii uh controller is I just dont have the uh the nimbleness of finger here all right so Top Man is uh totally predictable he has a pattern he doesnt break it and then you can just hammer in here and thats it he just goes back and forth shoots his tops in the air you can slide onto them he'll come across jump over him hit him and you can just nail him with the arm Cannon if you want to be a G or there cuz his weapon so Top Man's weapon is the first really unusual weapon in the game um",
            "start": 517.68
        },
        {
            "text": "come across jump over him hit him and you can just nail him with the Arm Cannon if you want to be a G or there cuz his weapon is so top man's weapon is the first really unusual weapon in the game um because it's not a projectile it's actually your body um the Top Spin it's called and uh you press jump and press the B button with it equipped and you spin um and use your body as the as the uh the weapon basically so we'll use that on Shadow Man, Shadow Man otherwise is the hardest one of the hardest Robot Masters in any Mega Man game to fight but with the with the Top Spin he's much more manageable but you have to sacrifice your own body in order to hit him so here will be Proto Man again so those devices up on the ceiling well uh make it dark you can destroy them if you want if you have the right weapons you can actually use like Magnum missiles on them I think um but there's really no need not here anyway and those little grenade guys will come at you and explode so you want",
            "start": 562.64
        },
        {
            "text": "Have the right weapons you can actually use like Magnum missiles on them, I think. Um, but there's really no need not here anyway and those little grenade guys will come at you and explode so you want to keep your distance when you kill them. And here you want to just get down here quickly so you can deal with that guy before he's all over you. Those guys are a pain in the ass, all right. So here you're going to want to play it kind of patient. You need to draw these like parachute guys out. You can do that by jumping at them and then backing off. It's similar to how you deal with the crabs at the end of Bubble Man stage on Mega Man 2 - definitely the same design philosophy between this again, right here. You want to fire immediately and try to get under that guy if you can. Don't forget you can slide. These dragon flies will come in behind you and flank you. You can get through the wall so then I'll show you guys Top Spin for the first time. We're only going to see it one other time in the game, um. You can",
            "start": 640.12
        },
        {
            "text": "Dragon flies will come in behind you and flank you. You can get through the wall, so then I'll show you guys Top Spin for the first time; we're only going to see it one other time in the game. Um, you can use another enemy's attack additionally, no need. So Shadow Man is a boss, Bard. Um, so you want to get up close to him and press and you'll see you're just damaging him by pressing the button and spinning into him, and then he's dead. Fighting Shadow Man with the Arm Cannon is very difficult; um, you'll need an E-Tank for it, maybe two. All right, so we have the Shadow Blade which lets us go to Spark Man's stage, um, and fight Spark Man who's really one of the more unique Robot Masters I think in the game. He doesn't even have like real arms or hands; he has like these conductors. Which I think his design is fantastic. We also have Rush Marine, which is useless; we'll use maybe in Gemini Man's stage if we're feeling like it. Let's go to Spark Man; it's a fantastic design, I love that design so much.",
            "start": 706.84
        },
        {
            "text": "It's fantastic. We also have Rush Marine, which is useless. We'll use maybe in Gemini Man stage if we're feeling like it. Let's go to Dr. Wily's Castle - Spark Man stage. It's a fantastic design I love that design so much. Very active stage, a lot of cool backgrounds and flashing lights here. So these things you kind of have to be patient with. I kind of brute force my way through these things at times and just deal with the damage that you make. But here I'm like what's the point? We'll need it for later. You would expect these big enemies to take more than one hit, but they don't get rid of them or they'll attack another Hammer Joe, and you can see his eye appears and that's when he's vulnerable so it's not actually when he throws it, it's actually right before. So these platforms you got to be kind of careful on. And this part here is where I usually brute force my way through if I have to. But I won't have to actually. I will here and then just kind of let Rush's course probably get hit again. Man, I'm...",
            "start": 746.8
        },
        {
            "text": "and these this this part here is where I usually BR force my way through if I have to but I won't have to actually I will here and then just kind of let Run's course probably get hit again man I'm getting killed here all right probably should have just played it the way I usually do here we won't usually need it but this time I do cuz I **** up so we'll get use the rush coil to get up here um and get the energy since we'll need that for later when we actually do with Spark Man and keep cruising all right I love this drop here it's super dramatic reminds me of the end of Mega Man 2 here there's a lot of like incredible amounts of slowdown against speed Runners kind of use like try to deal with these blocks to make it not slow down so much uh because there's just so much you could tell that the game was rushed too because there's just a lot of moments like that they didn't weren't able to optimize you can get like a really long slide going here here you're going to want to",
            "start": 806.04
        },
        {
            "text": "tell that the game was rushed too because there's just a lot of moments like that they didn't optimize you can get like a really long slide going here, here you're going to want to draw enemies out um and you can actually use um the magnet missile on those guys so here I'll show you to get rid of these guys and you kind of want to just draw them out cu they're going to knock you out they're all strategically placed of course in the most obnoxious places and then you can draw that last one out and then you can just ignore that last one switch over to the Shadow Blade which is a pretty cool looking weapon as you can see there and uh we'll Spark Man out with it and that's the end of Spark Man so now here's where we have a decision to make because the spark shot, the spark shock is useful against Mega Man we already killed him so now we're going to have to fight another enemy with our arm Cannon and that enemy is going to be Snake Man which as I said",
            "start": 860.28
        },
        {
            "text": "the spark shock is useful against Mega Man we already killed him so now we're going to have to fight another enemy with a with our arm Cannon and that enemy is going to be Snake Man which as I said earlier is a place where you can very easily start the game if you want uh you certainly don't have to um so we'll go to Snake Man another great design who knows no one understands what W's actually doing except for W with your bullets and his bullets you can actually cause a lot of slow down here too not that it's necessarily beneficial now this particular area is the only part of any of the Mega Man games I can think of that has two major or like big Health pellets right right next to each other I never understood why that was like you don't need them okay here there's a lot of slow down here as well you just like there's an incredible amount of slow down there's just so much going on on this screen okay another Hammer Joe I love the slide and the",
            "start": 924.96
        },
        {
            "text": "There's a lot of slowdown here as well. You just like there's an incredible amount of slowdown. There's just so much going on on this screen, okay? Another Hammer Joe. I love the slide and the jump; it's such an elegant move. We'll go up here and mess around with these question mark tanks, just see what's in them. Usually nothing of interest. We're climbing. I always like to think about what these places actually are that they're in, like what this would look like in a 3D-like space. So weird. That's why I want them to remake some of these games in 3D at some point; they wouldn't necessarily be good, but they would certainly be an interesting vision. So here's a pretty crazy jump you can make; it's not that bad. It's like Metal Man's jump at the end of the stage and then we're going to climb up into the sky and do a Snake Man up here. We just got to get through this final area, which is a little",
            "start": 1015.2
        },
        {
            "text": "you remember watching that let's play or being familiar with that game and then we're going to climb up into the sky and defeat Snake Man up here, we just got to get through this final area which is a little tricky, it has a bit of an Airman vibe in this part of the stage, so these bullets are basically shrouded in clouds and when you shoot them they'll come at you, so you've got to like shoot them in strategic places or just jump over them and ignore them. Yep, now we're in the uh air here all right and we're the Snake Man, so now we're going to just fight Snake Man straight up, depending on his pattern at this point, you know we should be fine, might use a Knuckle Shot I don't think we really need to, there we go it's perfect it's exactly what we want him to do, he hasn't launched any of his snakes yet, there we go, Snake Man's dead, no idea what his whole thing was, Kevin would make a really good Snake Man in the movie, he would but I like",
            "start": 1078.88
        },
        {
            "text": "snakes yet there we go his own snakes cause crazy slow down that's it Mega Man's dead no idea what his whole thing was Kevin would make a really good Snake Man in the movie he would but I like Snake Man's design and the next enemy we're going to go to is Gemini Man and I think that's like one of the most clever enemies it's two robots um it's really one robot but you'll see it makes a projection of itself and I think that's a really just a clever idea for uh for a robot certainly one of the co designs so an interesting stage here we'll meet Proto Man again in just a minute but we won't fight him this time which is interesting and it doesn't matter that we fought him all those other times he'll never fight him on Gemini Man stage you'll just run into him and this is when he'll kind of reveal himself that maybe he's trying to help you there awesome music again just an amazing soundtrack in this game so here's Proto Man but he's going to help you out so here are these like",
            "start": 1151.4
        },
        {
            "text": "kind of reveal himself that maybe he's trying to help you there awesome music again just an amazing soundtrack in this game so here's Proto Man but he's going to help you out so here are these like weird egg things that let these little sperm cells out like of a better there's another question mark thing up there I'm not going to really mess with it we don't have to bother so the idea you can sit there like when I was a kid and I didn't really care about you know just like shoot them all cuz I thought it was fun but there's really no reason to and you can even use them to your advantage if you want to use uh the Rush Coil here for instance you can just jump up there and not have to deal with the whole uh issue of having to get them all and all that stuff extra life and I think the Sprites that that Penguin is shooting I'm not positive I think those are the Penguin Sprites from the original Mega Man that you see on like uh I think Ice Man stage so a little throwback there there",
            "start": 1217.52
        },
        {
            "text": "that that penguin is shooting I'm not positive I think those are the Penguin Sprites from the original Mega Man that you see on like uh I think Ice Man stage so a little throwback there there are quite a few Throwbacks of the original this game we got damaged a little more than I would have liked so we'll use the Rush Coil here to just jump up and grab this and then we can we have options down here we can use the Rush Marine um actually I'll just go back to the Rush Coil cuz we'll need it again but I'm going to try to stay on the blocks at top cuz we can actually get some things up here the problem are these fish that appear and they shoot these missiles up and the missiles have these explosion radius plus the oh damn plus the fireflies that come back and forth so we'll jump down here and get the E Tank and then we'll use uh Rush Coil to get back up okay and then we'll let this firefly come and go like that let him fly over us quite precarious here let's go over that and so we're",
            "start": 1322.28
        },
        {
            "text": "the E tank and then we'll use uh Rush Coil to get back up okay and then we'll let this Firefly come and go like that let him fly over us quite precarious here let's go over that and so we're pretty much on Gemini Man stage trick here with this enemy obviously it's a shooter through the wall so have to deal with him in person and then we'll switch to uh Search Snakes to fight Gemini Man you'll see what I mean Gemini Man is true to his name Gemini obviously too Twins so he appears as one and then he'll split into two and it's pretty cool but we can get one of them to disappear like that by attacking him and then he's dead and that is Gemini Man he gives us a Gemini Laser not a very practical weapon you're only going to use against Needle Man in one other time in one of the stages all right all we have left to deal with is Needleman and his needle dick so let's go at him bizarre uh totally bizarre I don't know what the hell he is he's a thing cool enemies though here these",
            "start": 1367.6
        },
        {
            "text": "all right, all we have left to deal with is Dr. Wily and his Death Egg so let's go at him - bizarre, uh totally bizarre, I don't know what the hell he is, he's a thing, cool enemies though, here these these like porcupines are pretty cool, like Armadillo enemies you can kill them quick before they roll up into a wall and make a hell for you, this probably happens to this guy, yep see so much slowdown I like the stage, the music's cool it's it's wide open but you can also see like a cityscape in the background which I think is pretty cool gives you a little like it gives you a feeling that you're fighting somewhere it's like not just like a fantasy game but that there's like a place that you're like trying to attack, they taking part you know in dealing with in some respect jeez Jesus Christ jeez I'm not playing this very well, Kevin all right uh Mets Mets yeah Hard Hat is what is like their you know the kind of vernacular yep in this game so we can use there we go um and then you know we",
            "start": 1455.92
        },
        {
            "text": "I'm not playing this very well, Kevin. Alright, uh, Mets, Mets, yeah, hard hats is what is like their you know the kind of vernacular, yep, in this game so we can use there we go, um, and then you know we probably won't need this many E-tanks but just in case might as well grab you can carry up to nine in this game. There's only four to be carried in Mega Man 2; none in Mega Man one, so you can see the games are getting a little easier although I think this game's way harder than Mega Man two, personally. And so we are here all right, so now you got to be careful when you're using Gemini laser, I'm going to show you why right now it bounces off walls as you can see here, so if you don't hit your enemy it's just going to bounce and you can't shoot another one, um, so you got to be very careful. Magnet Man will always jump in the beginning; you can shoot and it'll bounce off the back wall and you definitely are guaranteed that hit, and otherwise you kind of want to play it safe like I didn't just I just",
            "start": 1518.52
        },
        {
            "text": "will always jump in the beginning you can shoot and it'll bounce off the back wall and you definitely are guaranteed that hit and otherwise you kind of want to play it safe like I didn't just I just played it really dumb there it'll eventually go away um and I'm not playing this one very very well we'll use that E-Tank if we need to yeah we'll use it it's unfortunate you just want to basically stand on top of him to make sure the laser doesn't miss as I just showed you that wasn't very elegant way to shoot it but kill him but nonetheless here we are Dr. Wily's done now Mega Man 3's close is kept secret at the time although everyone knows this now I think is that all of Mega Man 2's bosses are also in the game and and now we're going to fight them all um and I loved this one I remember I I'll never forget when this happened we didn't know this was going to happen and it's so cool these this robot um thing called Dr. Wilyman uh that uh is created by uh Dr. Wily encapsulates all",
            "start": 1600.4
        },
        {
            "text": "I remember, I'll never forget when this happened. We didn't know this was going to happen and it's so cool these this robot um thing called Dr. Wily encapsulates all of the eight robots that he created in Mega Man 2. Um, so you're going to go to the four of the stages you've already been to; they're different now, they're harder to deal with. Um, and you're going to fight them, and you don't know who you're going to fight here. I told you use the Gemini laser one more time in the game there it was - these wheels spin so you got to be kind of careful on them here and get a little hairy so you just got to keep moving all right so to tour our for us boss here, and as you're going to see as it comes down, it's going to be Metal Man. So, the thing about all these bosses is that they're all susceptible to multiple weapons but uh magnet missiles works best on Metal Man. You'll remember of course in Mega Man 2 that he's actually weakest to his own.",
            "start": 1652.28
        },
        {
            "text": "about all these bosses is that they're all susceptible to multiple weapons but uh magnet missiles works best on Metal Man. You'll remember of course in Mega Man 2 that he's actually weakest to his own weapon, which is not the case here. This drop is going to be a little precarious, a little bit reminiscent of the Wyvern fight in Mega Man 2. And in case you're curious why I'm stopping to kill the magnets is because you can't - you can't hit them until they come together, so they're just impervious as you can see. There's a little bit slow down again and then so this time we're going to fight Quick Man. Uh, and of course, the weapon that I use on him is the Gemini laser. On him, if you want, he's susceptible to other uh weapons as well but um it does the most damage. I'm just going to use it here again. You're going to want to kind of really stay close to him make sure it doesn't bounce and that's it so Quick Man's done and then we move on. You can do these in any order um",
            "start": 1745.64
        },
        {
            "text": "going to use it here again you're going to want to kind of really stay close to him make sure it doesn't bounce and that's it so quick band's done and then we move on you can do these in any order um I'm just kind of doing them in this order go to Needleman Stage next I think Needleman Stage changes the most out of all the four stages when you go back to it it's now nighttime and I think it's it's cool again you can see the city in the background it's pretty pretty cool just for you know some storytelling the needle puzzles get a little crazier though here you can actually stand really close to them so it's useful sometimes I'm messing this one up so here we'll just use Rush actually maybe I can show you how close if I can just land this jump you can stand that close to now here should you have the patience you can get like an extra life and some other things tank above that we'll get in a minute so the Rush Jet in Mega Man 3 is like totally controllable you can just sit on it and do",
            "start": 1836.72
        },
        {
            "text": "have the patience you can get like an extra life and some other things tank above that we'll get in a minute so the Rush Jet in Mega Man 3 is like totally controllable, you can just sit on it and do whatever you want with it, it doesn't just move forward so it makes it super useful. So this is Air Man again, we're going to fight him with a barrage of peashooters and another weapon, just like we do in Mega Man 2, and you can actually slide under some of his tornadoes which is not possible in the other game. But this time we'll use Spark Shock on him when he gets a little closer; he's actually in pretty good shape to kill me so I'm actually using Tank I'm playing Super well today, Colin, but it's the nature of the beast that does him in. The reason I don't use Spark Shock when he's shooting tornadoes generally is because they're just bigger, um, so it's easier to deflect. Here we're going to have to use the Rush Jet pretty much exclusively, but let's draw",
            "start": 1908.04
        },
        {
            "text": "He's shooting tornadoes generally, to me, it's just because they're bigger, um, so it's easier to uh deflect. Here we're going to have to use the Rush Jet uh pretty much exclusively. But let's draw some enemies first and you can generally stay uh towards the top of the screen if you want it'll draw them out quicker. And you're going to want to grab these things now. If you feel like you're going to die at some point, you might not want to grab all of those because they will not replenish. Man, oh man, having a good day here on Needle Man stage - it's 'cause I called a Needles stage, I think I don't know. You like that? Jeez, crazy! Slow down right now, man. I'm really like... in the bed right now. Kevin, I'll tell you what. Alright, I'm going to have to use another E Tank maybe we'll see. Maybe one of these guys will give up the ghost here for me otherwise I have to go back and do it again. I was going to farm but you know what? Whatever. So here's Jeez, and then we can actually just sit here all",
            "start": 1978.4
        },
        {
            "text": "guys will give up the ghost here for me otherwise I have to go back and do it again I was going to farm but you know what whatever so here's Jeez and then we can actually just sit here all day and just let him spit those things out if we wanted to maybe I'll do that use another tank uhoh it's Blanka up in my face God they always drop Shuriken when you don't need them come on hook your boy up man these guys aren't giving me **** oh this isn't working out too well **** it I'm going to have to do it all over again I don't want to I don't want to waste E tanks you know what I mean it was going to happen eventually this is the unfortunate part though is I don't even know if I have the Rush Jet capability of getting back to where I need to be actually there's a so there's a way to cheat with Rush yet too I guess this is actually a useful exercise um if you just constantly jump while on the Rush Jet it won't use any energy for very little so that's one way around the problem",
            "start": 2046.52
        },
        {
            "text": "cheat with Rush yet too I guess this is actually a useful exercise um if you just constantly jump while on the Rush Cheat it won't use any energy for very little so that's one way around the problem you SC uh you would have to kill yourself and start again Jesus Christ I don't have good mojo on the stage right now I know I call him an they like it that's for sure when you're right you're right him so we can okay here we'll just use the Jet again sorry that we had to play through all that again I don't want to bore you guys out there okay these sons of **** all right so we're at Crash Man uh here and lose hard Knuckles on him the reason I like I like this there's a there's a little throwback like a little homage to Crash Bandicoot on the stage just in the backgrounds which were like black star backgrounds just like when you fight him in Man too which I think was intentional um so you want to try to get as close to Jeez get as close to him as possible because the Hard Knuckle is his",
            "start": 2184.36
        },
        {
            "text": "star backgrounds just like when you fight him in Mega Man 3, which I think was intentional. Um, so you want to try to get as close to Gemini Man as possible because the Hard Knuckle is his weakness and they'll just fly right over him. There we go, and so he's finished. Um, so we'll go to a Gemini Man next. Did think that he was getting double the game? I felt like that, yeah. I mean this was the start of the trend of Mega Man games being twice as long as these are, but then Mega Man 9 and 10. Kevin's asking by the way off-screen if this is like if I thought I was getting twice a game, and the answer was yes. I mean this was a really long game for Mega Man. Um, I still think this is probably the longest one when you really think about it, maybe not they're all pretty so after this they add a second castle, like, and you'll you know usually just go right to Wily's Castle but like now there's in four five and six there's like, guess a castle before that it's like the guy you thought was the bad guy",
            "start": 2305.88
        },
        {
            "text": "castle like and you'll you know usually just go right to Wily's Castle but like now there's in four five and six there's like guess a castle before that it's like the guy you thought was the bad guy not to spoil the other Mega Man games but you've had your chance and not that they're really story driven anyway because they're not although there's so much potential with the story that's that's what's so disappointing there's so incredible potential with Mega Man story and they just don't do anything to make it like a little more serious and stuff they wanted to they don't you have to do it you were scared yeah that it looks like it so sad here if you're slick you can uh get this one go back let him come down and then use this as a platform and if you want to get rid of these guys you can do that too well that's that one so you can just go over the top lots of slow down here so uh here we're going to fight Dr. Wily's robot, Flash Man, uh we use Shadow Blade on him again, Flash Man if you don't",
            "start": 2360.84
        },
        {
            "text": "you can do that too well that's that one so you can just go over the top lots of slow down here so uh here we're going to fight a Flash Man uh we use Shadow Blade on him again Flash Man if you don't aren't familiar with Mega Man 2 stops time it's a pain in the ass and we just made it he'll like just stay directly on top of you oops there we go so these guys popping out here um um are the guys that climb up the ladder like those ladder enemies so here we use the Rush Marine CU why not you got it you don't have to actually you can use the Rush Jet I guess I just I'm going to go back down and see if I can farm these guys for a minute nice exact what I need Perfect all right so we continue on so you can see these guys climbing the ladder and those are those characters you might recognize first from Snake Man stage and when we revisited um Spark Man stage and then we're underwater so this kind of gives away who we're going to fight here which is um Bubble Man and I",
            "start": 2425.2
        },
        {
            "text": "recognize first from Snake Man stage and when we revisited um Spark Mand stage and then we're underwater so this kind of gives away who we're going to fight here which is um Bubble Man and I realized I was supposed to use I don't know why I was using sh I think I think I was using actually need to use Needles on um Flash Man so we're not going to be left with too much to fight bubble man with I'm kind of **** this play through up a little bit uh but we if we can just make every hit count **** Blaster Arm Cannon dueling which was given its name by a famous FAQ I believe that in the 90s that kind of thought people to do it all right we have one more go to Shadow Man Stage so again like the others um a harder version of the stage we already went to especially at one point this probably one of the hardest points in the game period on the stage remember of course that the spikes will kill you in one hit Mega Man convention so here these platforms disappear and here you",
            "start": 2540.44
        },
        {
            "text": "this probably one of the hardest points in the game period on the stage remember of course that the spikes will kill you in one hit Mega Man convention so here these platforms disappear and here you just you know like **** it you can get crazy with if you want but there's really no reason to and so here we're going to fight uh Wood Man his weakness is the Needle Cannon as you can see there um what man weak it would make more sense I guess it punctures him in some way but you would think it would be Shadow Blade actually that would be his weak oh man time these men playing like **** today Kevin yeah there for all the world to see though it'll be all right we're cruising anyway I actually find these stages like question like actually harder than Wily's Castle all right finally Heat Man which which is uh who is weak to uh the Shadow Blade we should be able to do it our little zip off lighter he's a great scientist he's so good dress up you should you should dress up as him",
            "start": 2628.12
        },
        {
            "text": "Mega Man 3 Entire Game Full Playthrough - Kinda Funny Plays\nman which which is uh who is weak to uh the Shadow Blade we should be able to do it our little Ziploc lighter he's a great scientist he's so good dress up you should you should dress up as him **** damn it buttons on a PS4 controller a little sticky compared to an NES controller yeah I just feel like I'm not pivoting very well could there be lag I don't think there's a l I'm not going to blame it on that okay so now we Showdown with Break Man and this isn't really a fight that's designed none of these fights are really designed to kill you D just do the same over and over just story based so Dr. Light was working on together Wily appears like a boss best music in all the Mega Man games this one right here yep and all of them but Mega Man one so those barriers can be destroyed with Hard Knuckles we're not going to use them now but we will use them here for I so here we can replenish our health",
            "start": 2785.48
        },
        {
            "text": "yep and all of them but Mega Man 3 so those barriers can be destroyed with Hard Knuckles we're not going to use them now but we will use them here for I so here we can replenish our you know again you know as a reminder in case you have been watching the other let's plays um you got to be mindful and cognizant of your health or your weapon energy rather in Wild it's cast because it does not replenish in between stages the turtles are easy kill with the Shadow Blade one hit they get faster the tornadoes that are coming out don't damage you but they'll push you into the enemy and that's the end of that I want to live there that particular one that yeah I like this one they're all they're all different yeah so we can replenish our Shadow Blade don't really have to trifle with anything else right now I snub my nose at extra lives and I need him how does get around his castle that's a good question Kevin is asking how does Wily get around his castle and the answer",
            "start": 2911.16
        },
        {
            "text": "anything else right now I snub my nose at extra lives and I need him how does Mega Man get around his castle that's a good question Greg's asking how does Wily get around his castle and the answer is I have no idea the answer really is I'm not even sure he's ever there I feel like this is something to be built just to **** with Mega Man like the guy just walks into the top who knows man who knows what I don't know what Wily's whole story is in terms of his uh his wants his desires you know he does but I mean like why what's the point him and Dr. Light were Partners yeah and they created great things that's true that's a point but how many times are you going to how many times are you going to go through this game you're not going to win you know what I mean I don't understand what's going on with Dr. Light like why would he believe him he's a good man he won't let Mega Man kill him either I would have killed Wily a long time ago Mega Man wants to kill him I don't know so this is",
            "start": 3054.32
        },
        {
            "text": "with light like why would he believe him he's a good man he won't let Mega Man kill him either I would have killed Wily a long time ago Mega Man wants to kill him I don't know so this is the Rock Monster for Mega Man 1 another Mega Man one throwback um a lot easier to deal with because you have the slide a lot harder to deal with because you can't cheat like you could in the other one you got to use a hard Knuckle attack you can maybe get two off damn twice there kind of damn it you like this enemy he's the main stay in the Mega Man series done so much easier in this one because you can actually see where after he's on the screen you can actually see where he is unlike in Mega Man one music changes up here here we can use the Shadow Blade to just get rid of this guy without an issue actually use Rush Coil get up also an awesome soundtrack here an awesome music another E tank very plentiful with the E tanks here dink d d d this screen's kind of these screens are kind of cool",
            "start": 3111.76
        },
        {
            "text": "get up also an awesome soundtrack here an awesome music another E tank very plentiful with the E tanks here dink d d d this screen's kind of these screens are kind of cool not quite as tricky as they look and again if you want to go up there and mess with those I don't really think we need to no we're fine all right so this is a clone machine another throwback to Mega Man 1 now there's a a trick here the top one that spawns is always the real Mega Man at first and his weak is the Top Spin and you can kill him one hit he'll always spawn that way and I'm not sure if that was programmed as an Easter egg or if that's just the way this enemy was programmed but Top Spin is his weakness kill him once he's always start to the top so you can just go right up there and get rid of him and here we can start to kind of replenish anything we lost that we need we don't really need a rush yet but in just in case and we'll go back and use the rest of this on top which we will",
            "start": 3206.92
        },
        {
            "text": "rid of him and here we can start to kind of replenish anything we lost that we need we don't really need a rush yet but in just in case and we'll go back and use the rest of this on top which we will need I don't know why I'm using um these enemies who are Throwbacks to Guts Man are destroying me right now Mega Man's robot Master, who's those robots yeah they're they're made of like junk so I don't think they're supposed to look normal if that makes any sense and so as the Mega Man tradition dictates we will fight all the Robot Masters again starting with Needle Man one wasn't jump into it there we go um sets Needle Man down Magnet Man now we can use uh we could use Spark Shock on him and we will but we don't necessarily have to it does way more damage as you can see I just hit him once one more hit and he'll be done Gemini Man break out the snakes that wasn't a very clean win but we won nonetheless move on to uh Hard Man use the magnet Miss put him away we'll move on to Top Man",
            "start": 3308.0
        },
        {
            "text": "once one more hit and he'll be done Mega Man break out the Snake Man that wasn't a very clean win but we won nonetheless move on to Hard Man use the Missle Man put him away we'll move on to Top Man next put him away he was frozen for a minute I was scared Shadow Man we'll break out the Top Spin and Spark Man use the Shadow Blade and then finally all that's left is Snake Man and this time we have uh the Needle Cannon to use on him which will make him quicker F all right move out of here here you want to be somewhat judicious with the things you're using um so filling in Spark will work filling in Shadow we use later will work and last little bit Top which we also need we don't really need to use but will I just like being that way so here we go the face off with Mega Man begins first part can be easily beaten with the Spark Shock now uh we'll use my little trick here is is I just like use Rush and just Hammer him a lot of slow down here because I'm creating a lot of bullets and he's",
            "start": 3409.72
        },
        {
            "text": "can be easily beaten with the Spark Shock now, uh, we'll use my little trick here. Is it is I just like to use Rush and just hammer him a lot. Slow down here because I'm creating a lot of bullets and he's shooting bullets, and that's why he's flickering by the way, cuz again can't handle it, and then he's defeated but is he? Of course he's not. It's not over yet, begging for mercy as he usually does, but it's not him so we really don't need anything else here. Um, so we'll just go right in. We'll start with our Shadow Blade equipped. So this is Gamma, um, who is the peacekeeping robot Light built with uh Wy so he half dead now and then Wy appears and you can use the Top Spin on him. We have to wait for the fist to appear and then and that's it Mega Man 3 is over. So now we'll enjoy the ending together. Well I'll let you enjoy the ending, we'll cut me out of this so you can enjoy but uh note that the ending gives you context for Mega Man one for the very first time which I really love uh the ending is just",
            "start": 3589.4
        },
        {
            "text": "let you enjoy the ending we'll cut me out of this so you can enjoy but uh note that the ending gives you context for Mega Man one for the very first time which I really love uh the ending is just is pretty cool this is Break-Man appearing or Proto Man saves Mega Man leaves Wily to die that's it so I hope you enjoyed Mega Man 3 we'll let you watch the ending in peace and uh we'll see you for Mega Man 4 remember we're doing let's plays for 1 two 3 four five and six so you can find them all here on Kinda Funny Games youtube.com/ kind of funny games thank you for joining me till next time e",
            "start": 3671.92
        }
    ]
}