{
    "id": 2212,
    "video_id": "JB0p7OQXurw",
    "show_name": "Reactions",
    "hosts": [],
    "title": "Kinda Funny Talks Over The Game Awards 2016 (Live Reactions!)",
    "description": "The Game Awards with Kinda Funny\n\nSubscribe! http://www.youtube.com/kindafunnygames?sub_confirmation=1\n\nSupport us and get the shows early here! http://www.patreon.com/kindafunnygames\n\nCheck out our store! http://www.kindafunny.com/store\n\nFollow us on Twitter!\nTim - http://www.twitter.com/TimGettys\nGreg - http://www.twitter.com/GameOverGreggy\nColin - http://www.twitter.com/NoTaxation\nKinda Funny - http://www.twitter.com/KindaFunnyVids\n\nEvery day Greg Miller, Colin Moriarty, and Tim Gettys talk about the biggest stories in Video Games.",
    "published_at": 1480659564,
    "duration": 9627,
    "transcript_chunks": [
        {
            "text": "What's up everybody, welcome to Twitch.tv slash KindaFunnyGames. I'm one of your hosts, Greg Miller, alongside the pure one, Tim Gettys. Tim Gettys. What the fuck was that? I've hosted with you many a year. Alongside Tim Gettys? I'm gonna try something new. And that's what you came up with? Don't deviate from what Tim hosts then. Jesus Christ. Over here at the Pride of Long Island, Colin Moriarty. How are you Colin? I'm fine. I'm a little stressed out. But I'm alright. I'm good. Are you excited about this? I'm excited about it. Don't know that that would be the word that I would use. Ladies and gentlemen, it's one of my favorite nights of the year. The Game Awards is here. Game Awards 2016. We will be watching along with you in 15 minutes, or not even 12 minutes now when the show goes live. We will all chill out, watch what's going on, react with you. We'll be quiet when we should be quiet. We'll be loud when we should be loud. Right now it's the pre-show. We're hanging out. After",
            "start": 0.0
        },
        {
            "text": "live. We will all chill out, watch what's going on, react with you. We'll be quiet when we should be quiet. We'll be loud when we should be loud. Right now it's the pre-show. We're hanging out. After we watch the entire thing with you, we'll pop back over. Oh fuck. See what's happening. What? We just missed a trailer for The Legend of Zelda. Was it the real trailer or was it... I mean there's still... There's two trailers. Okay. I mean don't worry. I'm sure they're gonna show you that again. I don't think they are. Well you don't think... I think the real trailer, quote unquote for The Game Awards, will just pop over and do that thing. I think it's two trailers. Why would they do two trailers? That seems like dumb Nintendo stuff. That's what they're doing. That's what they're doing. You see that Switch logo? I did see the Switch logo. Did it give you the chills? Yeah. No, it didn't give me the chills. I'm excited for the Switch. Not yet. Sure. Not yet. You got contradicting information here.",
            "start": 57.68
        },
        {
            "text": "logo? I did see the Switch logo. Did it give you the chills? Yeah. No, it didn't give me the chills. I'm excited for the Switch. Not yet. Sure. Not yet. You got contradicting information here. I don't know what... I told you 30 times it's just a fun show tonight. Have some fun. What the fuck? All right. Turn up the TV. Nick! Jack Attack is on TV. And the Pokémon Company, I'd like to thank all of the amazing trainers around the world who have joined us. I know, the guy holding the trophy. We're grateful that we've been given the opportunity to inspire so many people to get off the couch and head outside to explore the world around them and learn more about the communities along the way. We get to listen to the TV? We have a lot more planned for the game in days and years ahead. And we really hope you'll continue with us on this adventure. Thank you. You got mine from my desk. Thank you. Now I just gotta find one for you, Pokémon. Right here. All right. Thank you to all you guys.\n\nNote: No changes were made as the text appears to be a clean and accurate representation of the spoken words in the video.",
            "start": 95.04
        },
        {
            "text": "really hope you'll continue with us on this adventure. Thank you. You got mine from my desk. Thank you. Now I just gotta find one for you, Pokémon. Right here. All right. Thank you to all you guys. Amazing game. I mean, there's two pairs. I'll just wear them both, I guess. Pokémon Go. Ours are nicer though. Two awards already tonight. All right. Well, we've got a lot more coming up. How are you calling? Free show. I also want to mention that we've got amazing game award sales happening across all the games. For those of you that are watching, I will give you a little insight. I'm going to tease you a little bit as Greg goes and sucks my pee pee. Been editing. So we announced Colin was right with the little logo. Then Kevin posted a picture and ruined the surprise. Then I let it loose on Colin and Greg Live the next day. But basically what's going to happen is next week at an undetermined time, we know what the time is, but you're not going to know. You'll see the first episode of",
            "start": 145.44
        },
        {
            "text": "and Greg Miller live the next day. But basically what's going to happen is next week at an undetermined time, we know what the time is, but you're not going to know. You'll see the first episode of the show. How's that? We can hear you. Thank you. All right. So this is new from Rocket League, they said? I don't like this. Why are they doing this? I don't know. Thank you. All right. So this is new from Rocket League, they said? I don't like this. Why are they doing this? And also in the pre-show. Doing it in the real show. Spacely. Starbase Arc. New free arena. I thought it was Halo. It looked like a Halo. Hollywood Principle I've never heard of, but I definitely like his beat so far too. Do you like him? I do. This is space dubstep. Dubspace. So eight minutes of the real show. All the awards, all the world premieres. World premiere. Remember we will react. Yeah, I hope that robot lady's back. Look at Greg Miller. Look at him. He's so cute. He's one of the guys in this industry who doesn't age.",
            "start": 191.36
        },
        {
            "text": "all the world premieres. World premiere. Remember we will react. Yeah, I hope that robot lady's back. Look at Jeff. Look at him. He's so cute. He's one of the guys in this industry who doesn't age. Who's talking? This is of course Jeff Keighley. Now Randy Pitchford up. Take off the things Colin. Borderlands 3. Battleborn 2. We're publishing games. And I want to announce our first published title. This is Sebastian from People Can Fly. Hello Sebastian. I owe you guys a killer Gears of War judgment. What are you cooking up with Randy? So I'm here to announce Bulletstorm: Full Clip. This is an over the top first person shooter. Skill shot, combos. One of a kind stylish gameplay. 4,000 people. Hey what's up 4,000 people? That's kinda funny. Colin was wearing two headsets a while ago. That's funny. PlayStation 4 on April 7th. April 7th, 2017. 4K on the PlayStation Pro too. So it's beautiful. It's beautiful. He came all the way from Poland to tell us this. This is great news. And I think we",
            "start": 279.48
        },
        {
            "text": "PlayStation 4 on April 7th. April 7th, 2017. 4K on the PlayStation Pro too. So it's beautiful. It's beautiful. He came all the way from Poland to tell us this. This is great news. And I think we have a little something more to tell people before we take a look at it Randy. Because there is a little twist to this, right? Well yeah, there's a little twist. First of all, I know there's a lot of folks at home looking forward to your sales in line with the Game Awards. You can preorder it as of right now. If you go to the digital dashboards on your favorite platform, you can preorder it. Guys, you can preorder the video game. There's no reason to do it. But go ahead and preorder it anyway. Give Randy a pitch for some money before you know anything about it. You can play the whole game where you swap the main character with Duke Nukem. With full voice over replays and with John St. John, you can become Duke Nukem in Bulletstorm. It's insane. So this is not Bulletstorm 1 re-release, right?",
            "start": 370.48
        },
        {
            "text": "\"Swap the main character with Duke Nukem. With full voice over replays and with John St. John, you can become Duke Nukem in Bulletstorm. It's insane. So this is not Bulletstorm 1 re-release, right? This is a new bullet. No, I think it is. The same. The same game. It leaked like months ago. Here is the first look at Bulletstorm. Bulletstorm. Check it out. World premiere. Oh, there she is. There we go. World premiere. That's a good jam, Colin. I know you don't like music. What a big deal. They try to kick Bulletstorm. You pull people in, you kick them. You cut your hand and you drift. What was the connection? Couldn't ClippyB have a connection to this? Epic was the deal? I think it was some people that worked at Epic. I think that's the case. Gotcha. I could be wrong. I was thinking the same thing actually. I was thinking, what was his connection? I knew he had something. Yay. What are you doing? Again, it was a teaser. You know what it was? It was just Link sitting there. His hair blown\"",
            "start": 409.48
        },
        {
            "text": "Thing actually, I was thinking what was his connection? I knew he had something. Yay. What are you doing? Again, it was a teaser. You know what it was? It was just Link sitting there. His hair blown in the wind. Don't worry about it. Still trying to make Duke Nukem happen. I fucking hate Duke Nukem. Still trying to make Duke Nukem happen. I mean Duke Nukem happened and it happened 20 years ago. So now we can walk away from it. Well, I want to announce a couple of our other award winners as well. We've got tons of awards in the show, but we do want to recognize everyone in the right way. I want to announce that the best fighting game is won by Street Fighter V. Congratulations to the team at Capcom and Ono-san. We were all wrong. The prediction was I didn't even give one. Tim said Pokémon. Colin said Killer Instinct. Best VR games. We all said Batman. And you just saw it and you'll see more in the main show. We're happy to announce that the most anticipated game that was voted on by",
            "start": 480.48
        },
        {
            "text": "Colin said Killer Instinct. Best VR games. We all said Batman. And you just saw it and you'll see more in the main show. We're happy to announce that the most anticipated game that was voted on by the fans on social media and on Twitter was The Legend of Zelda: Breath of the Wild. Congratulations to Nintendo. And Reggie will be on stage a little bit later to share. It's kind of the problem with the show. It's supposed to be an award show, but they're like let's premiere a bunch of things and then we'll just talk about the people who won for five seconds. Have you seen any award show? Yeah, they have a little song and dance for everyone. A person comes up and they talk over a microphone and they have a thing. Oh, Tim was right. Tim got his first right one there on the Zelda. Good job, Tim Gettys. You currently lead the prediction game with one. We've also got some incredible music in the show. The Run the Jewels will be here. They'll be performing two tracks just announced. RTJ3, their new album",
            "start": 548.48
        },
        {
            "text": "Tam. You currently lead the prediction game with one. We've also got some incredible music in the show. The Run the Jewels will be here. They'll be performing two tracks just announced. RTJ3, their new album coming out free in January. They'll be here and they had an amazing time with Gears of War this year. And then everyone in the rehearsal has been talking about this. The music of Doom live, the soundtrack of Doom. They are going to rock this place. Mick Gordon came all the way from Australia and he will be here performing a medley of songs from Doom. We'll have some great surprises in the show as well. So stay tuned for that. In terms of the games that you're going to see tonight, a lot of people are wondering what are we going to announce, what are we going to show. Let me tell you what you can expect in the main show. We are going to be showing a lot of extended gameplay clips from games. You'll see things that are going to run three, four minutes in length. Really in-depth look at some",
            "start": 592.48
        },
        {
            "text": "Expect in the main show. We are going to be showing a lot of extended gameplay clips from games. You'll see things that are going to run three, four minutes in length. Really an in-depth look at some games. We do have some new game announcements. You'll see some amazing games in 4K resolution. If you happen to be watching on YouTube, we're the first time we're going to show you live there. And of course all the platforms you'll be able to experience everything in 1080p. Mass Effect: Andromeda, you're going to see the first gameplay from that. Stay tuned for that. We've got other games. We're going to have a new look at Halo Wars 2. We're going to have a new look at Prey. We're going to have some amazing stuff. Tim, what are you most excited for in this? The Legend of Zelda looks fucking dope. You'll see the first look at that. That's coming out later in December. Surprises. Surprises. Surprises. Our industry icon this year will be the one and only Hideo Kojima. He's here this year. We only have one",
            "start": 637.48
        },
        {
            "text": "The first look at that. That's coming out later in December. Surprises. Surprises. Surprises. Our industry icon this year will be the one and only Hideo Kojima. He's here this year. We only have one beer left. We are so excited to pay tribute to Mr. Kojima. And he's joining us here. This is a well thought out operation all around. Here's the thing about this. Which one? He's here. Kojima's here. There he is. There's Mark Cerny too. Their technology searches led them to The Game Awards. As everyone mentioned, you can not only just watch the show, you can interact with us. Use the hashtag #TheGameAwards to talk about the show. If you're watching on any of the gaming platforms, we've got some amazing offers and discounts on games throughout the show. The way we put this together is that we work with all the game companies. They help bring this all to life. And they give you special offers on some of the best games of the year. So we'll recognize those games. We'll look forward to what's",
            "start": 679.48
        },
        {
            "text": "with all the game companies. They help bring this all to life. And they give you special offers on some of the best games of the year. So we'll recognize those games. We'll look forward to what's happening in the future. When you go for wings, bring back beer. Live right here from the Microsoft Theater. Thank you so much for watching the show. We're getting ready for gaming's biggest night. A two hour experience live from the theater. We're going to kick off with a pretty amazing moment that I'm really excited about. And we also have lots of awards in the show. You'll see best performance. Of course you'll see game of the year. You'll see best game direction. You'll see best sports racing game. We'll recognize the best esports player. So it's all coming up. A full two hour experience live across all these platforms. The Game Awards 2016 is about to begin. Thank you so much. I hope we get a date, but when you're going down you're hitting the mat. No. But I promised on Twitter. Greg",
            "start": 729.48
        },
        {
            "text": "across all these platforms. The Game Awards 2016 is about to begin. Thank you so much. I hope we get a date, but when you're going down you're hitting the mat. No. But I promised on Twitter. Greg's getting knocked out of Mass Effect dates. Not announced today. Bring it. Uh oh. I'm excited about what we don't know about. And what we do know about the dynamics as well. Oh. And we rose there, you know. The Game Awards height. The game is a hype but deep normal. And you're right. We do need to think bigger. Act bigger. On top of the hype trailer. It's the lower one. You took these because you wanted to see if there was more out there. And everyone. No matter where you're from or what you believe in. Because that's an Overwatch hype trailer. You're going to be the best.",
            "start": 768.48
        },
        {
            "text": "Going to be the best. You're going to be the best. You're going to be the best. You're going to be the best. You're going to be the best. You're going to be the best. Because that's Overwatch's fucked up universe, man. Everyone's Harmony. So how does it say that? I don't know. I don't fucking know. That's how toxic it is. I'm here to relieve you of your crown. And that's why today they're more important than ever. You saved me. Tonight we unite to celebrate one thing we all can agree on. Games have changed us for the better. Well, amen to your optimism. Lots of charges. So let's use our voices and rise above the noise. We built a new prosperity. Show how the power of play She's dead shortly after that. Big time dead. And inspires us. About what is still possible to achieve. Let's get this kite up in the air. We gotta beat that wall. You can help. Or you can get out of my way. Hello, can I play against more heroes? If Warthog is alive, say Spider-Man gameplay please. That would be",
            "start": 828.48
        },
        {
            "text": "this is up in the air. We gotta beat that wall. You can help. Or you can get out of my way. Hello, can I play against more heroes? If Warthog is alive, say Spider-Man gameplay please. That would be an interesting work around. Because they said they want to be at PSX, right? Did they say Game Awards? I can't remember. Then Insomniac tweet. Is that it? Tonight, it's the biggest night of the year. And it's time to celebrate the games you love. Live from Los Angeles, California. This is The Game Awards. That's video blocks we roll. And now, please welcome Jeff Keighley. Look at that edge though. That's fucking dope. Fucking cool. I love Jeff. It's a bad rap. A lot of people want to make fun of him on the internet. Good dude. I also love dancing. Alright, let's do this. Welcome to The Game Awards 2016. Tonight we are streaming live, literally around the world, even in China. On pretty much every device and platform out there. To celebrate video games. The best form of entertainment out",
            "start": 916.48
        },
        {
            "text": "The Game Awards 2016. Tonight we are streaming live, literally around the world, even in China. On pretty much every device and platform out there. To celebrate video games. The best form of entertainment out there. That's not all. We're going to celebrate the best games of the year. But we're also going to give you a sneak peek at where gaming is headed in 2017 and beyond. And I figure that might be something you guys are into. Disappointing to be speaking. Alright, well thank you so much for joining us. You know, The Game Awards is a massive undertaking. Talk about Atari! This year, it was particularly challenging to pull everyone together to make tonight happen. But, whenever I was in doubt, what kept me going was a belief that we had to be back on the same stage as last year. To give one man a moment he was robbed of. Of course, I am talking about Hideo Kojima, the creator of Metal Gear Solid and tonight's industry icon. God damn it. They have a Kevin too. It's going to get loud Hideo!",
            "start": 972.48
        },
        {
            "text": "A moment he was robbed of. Of course, I am talking about Hideo Kojima, the creator of Metal Gear Solid and tonight's industry icon. God damn it. They have a Kevin too. It's going to get loud Hideo! I love the bromance between them. He is here and we're so happy. So I couldn't start the show without getting this over. We often talk about great games on our stage. But for a minute, I want to talk about a great man behind those games. Last year Hideo Kojima's world was turned upside down when he left Konami after the completion of Metal Gear Solid 5. We all have tough times to go through, but the true test of one's character comes in how we react to those moments we don't control. When judgments are made or when decisions are rendered upon us by others that we sometimes can't comprehend. I think what happened to Hideo Kojima last year was a tragedy. But he never complained. He just sat in an isolated room for months, looked inside himself and focused on his art. He hoped that his love of",
            "start": 1020.48
        },
        {
            "text": "what happened to Hideo Kojima last year was a tragedy. But he never complained. He just sat in an isolated room for months, looked inside himself and focused on his art. He hoped that his love of entertaining us would carry him through the darkest days of his career. And we thank him for all that he went through. I wasn't in a POW camp. We appreciate it. When I've questioned things in my own life over the past few years, I've drawn strength from seeing firsthand how Hideo dealt with this inflection point of his life. He is one of the most principled, loyal, and ethical men I have ever met. And I'm just so honored to call you a friend above everything else, Hideo. Now, this trophy right here, I've got to tell you about this, for most of the past year, I've tried very unsuccessfully to give Hideo the award he rightfully won last year from Metal Gear Solid 5. I keep talking to him and his producer Ken Levine, and it's like, I can't get this to him. I first offered to ship it to him, but I",
            "start": 1081.48
        },
        {
            "text": "give Hideo Kojima the award he rightfully won last year from Metal Gear Solid V. I keep talking to him and his producer Ken, and it's like, I can't get this to him. I first offered to ship it to him, but I couldn't get the address of his new studio. Then I said I'd drive this myself out to Las Vegas to personally hand to him when I saw him in February, and he politely declined that. And I soon found out why. He is such a principled person that eventually word came back to me that Hideo just said, Jeff, I can't have that blood on my hands. He had to move on, and today, Hideo is rebuilding his life and his studio with our support. Pete Hines on Twitter talking to me. I've known Jeff Gerstmann for almost two decades. Never seen him fired enough to punch someone, but he totally could right now. Hideo knows that a strong man doesn't need to read his future, he makes his own. Hideo, tonight it is finally time to give you one of these. You're one of the most deserving men to have one. You've always been",
            "start": 1132.48
        },
        {
            "text": "that a strong man doesn't need to read his future, he makes his own. Hideo Kojima, tonight it is finally time to give you one of these. You're one of the most deserving men to have one. You've always been there for me, and you have never disappointed me. Ladies and gentlemen, please welcome our industry icon, Mr. Hideo Kojima. Andrew Goldfarb on Twitter. Does anyone know if Kojima's at The Game Awards this year? I hope he even takes off the mask and gets to get the Bandai Namco based award. Thank you. Thank you very much. Thank you. Last year, I thought I lost everything, but I didn't lose anything. Thanks to all of you. I thank you all for your support. I love you, Geoff Keighley, and The Game Awards. I love games. I love this world. I really love you all from my heart. Thank you. It's that same argument though, right? It's not even arguing. It's probably always been that good. You'd think, right? People always want translators because they're afraid of... Yeah, they're embarrassed. That's why when you talk",
            "start": 1190.48
        },
        {
            "text": "Right? It's not even arguing. It's probably always been that good. You'd think, right? People always want translators because they're afraid of... Yeah, they're embarrassed. That's why when you talk to some Japanese fans, they understand what you're saying, but they often won't talk to you. Please enjoy. Did you say, does that mean for the homies? I think you said for the holidays. But if it was for the homies, that would be dope. I hope it's just the same trailer, but Norm Reedus is in a fucking Santa hat. Give me a goddamn Santa hat. Easy Street starts playing. Paul W.S. Anderson? Oh, Jesus. Guillermo del Toro. I was reading you already made the Undertaker joke. Yeah. Okay. My Undertaker. Shout out to this guy wearing a suit and clearly the end times. The United States pin on his shirt is interesting, right? Mm hmm. Socks are going to suck for days. He's not going to live for days. Yeah. All right. That's Norman Reedus's kid. Invisible baby. Call. God. They just winked at me. Is that Mads Mikkelsen",
            "start": 1285.48
        },
        {
            "text": "Right? Mm hmm. Socks are going to suck for days. He's not going to live for days. Yeah. All right. That's Norman Reedus's kid. Invisible baby. Call. God. They just winked at me. Is that Mads Mikkelsen? I think it is. He looks like a James Bond. He's like, \"fuck everybody off me.\" God, like to see him stop me. The baby's winking like the other baby. It looks great, although I'll just calm down. Yeah, I was very cool. Although I still think they're showing way too much of it way too soon. Overexposing the game and overexposing Kojima. And I'm worried about it because it cannot possibly be out until forever. Twenty nineteen at the earliest. So I don't understand why they're doing this. But it's cool. Oh, my God. Death Stranding, Hideo Kojima. Absolutely incredible. I got to tell you what you just saw there is 4K resolution running in real time on a PlayStation 4 Pro. That is what Kojima was working on. Fucking trailer. This weekend at the PlayStation Experience in Anaheim, we were doing",
            "start": 1403.48
        },
        {
            "text": "just saw there is 4K resolution running in real time on a PlayStation 4 Pro. That is what Kojima was working on. Fucking trailer. This weekend at the PlayStation Experience in Anaheim, we were doing a panel talking much more about that and new engine he's working with. It's going to be very, very exciting. All right. We got much more Game Awards still ahead. Many more world premieres and get to the awards. By the way, we've also got some great deals and some of tonight's nominees. Check out the Game Award sale going on right now on PlayStation Store. The no lines are always open and they're right there on your PS4 console. PlayStation Store. You won't believe what's in store there. Now, right now, Rebecca Ford from Digital Extremes is here to talk about Warframe. I know it's hard to follow Mr. Kojima, but you kind of took the words out of my mouth. I don't know if anything I can say will even come close to being as amazing. I got this baby. It wakes too. You guys are talking about",
            "start": 1602.48
        },
        {
            "text": "Mr. Hideo Kojima, but you kind of took the words out of my mouth. I don't know if anything I can say will even come close to being as amazing. I got this baby. It wakes up too. You guys are talking about Warframe because one of the things, you know, games come out every year and there's new things. Warframe has been an incredible success story. It launched back in 2013. And you guys just keep building. And we wanted to bring you out to tell us a little bit more about what is the latest on Warframe. To be honest, if we want to hear the latest, I could talk for the rest of the show. But really, you know, we made this game and I'm standing here because our community believed in us and they got us to this point. And it's been three years. Let her talk about Warframe. She seems like a nice lady. Yeah, but not Warframe. People like Warframe. PlayStation 4 people like it. You're right. The chat does not like Warframe. Like, frame somebody said that. I think when we were still at IGN",
            "start": 1646.48
        },
        {
            "text": "Lady. Yeah, but not Warframe. People like Warframe. PlayStation 4 people like it. You're right. The chat does not like Warframe. Like, frame somebody said that. I think when we were still at IGN, someone from the studio came and talked to us about it when it was percolating or whatever. And apparently it's wildly successful. Exactly. Like, most free-to-play games who like it love it. Yeah, most free-to-play games obviously on console don't do well with the exception of a few. And this particular game actually makes a lot of money. So it does have a hardcore audience. Sure. Lots going on. There's going to be a link and there's going to be a trailer so you can actually learn a bit more about that. Well, yeah. Tell us what are we going to see here. So I can describe Warframe as this crazy, ninja play free action co-op free-to-play game. But the visuals and the actual trailer we have to show you is going to do a hell of a good job showing you what Warframe is. Here it is. Alright, here's",
            "start": 1680.48
        },
        {
            "text": "play free action co-op free to play game. But the visuals and the actual trailer we have to show you is going to do a hell of a good job showing you what Warframe is. Here it is. Alright, here's Warframe. Much more Game Awards still to come. It's like Ninja. It's like swords and guns, I think. Eric Sapp liked Warframe a lot. Here we go. How fucking badass would it be right now though if Guillermo del Toro walked through this one? And it turned out this was also a death strike. Like the fucking- Guillermo del Toro cinematic universe in games. Got Genji. Whoa. Hey Kev. Ignacio Rojas, your friend, was saying kill the sub bars. Do we want to do that? We got all this stuff running up here and all that stuff down there. I think we should keep it for the mainstream. Cool. Sorry Ignacio. Fuck you. This cat bird dog better help him. Boom. Breaks his rib cage, smashes him smithereens. Nice. Shoot out of his head. I think I'll jump in tomorrow. Oh yeah? Hey we played this Greg. We did. Split",
            "start": 1746.48
        },
        {
            "text": "you. This cat bird dog better help him. Boom. Breaks his rib cage, smashes him smithereens. Nice. Shoot out of his head. I think I'll jump in tomorrow. Oh yeah? Hey we played this Greg. We did. Split screen during a stream. God it sucked. Stupid ass servers on Nightcrawler. Gears of War 4. Now $20 off. Man. She changes her look so often it's impossible to see at a glance to be like oh it's out. Okay. Who is she? G4. G4 for a while. Now she does stuff with Pereira. I think she's doing some acting stuff too. That's cool. Nice. I'd like to wear that ring when I knock you out later when they don't announce the mass spectate. You're gonna do it though. It's gonna be one of those things where you hit me and like your arm stops and all the momentum just shoves your arm back through your exploding stairs. Right in the jugular and Tim goes down. And Nick goes down. Nick runs into save him and impales himself as well. Thank you. See we're listening to you chat. But not Ignacio Rojas. No one is",
            "start": 1821.48
        },
        {
            "text": "Stairs. Right in the jugular and Tim goes down. And Nick goes down. Nick runs into save him and impales himself as well. Thank you. See we're listening to you chat. But not Ignacio Rojas. No one is listening to him. Tim what's your read on this movie? No? That's my read. Are you kidding me? You see Prince of Persia? No I didn't. I saw the trailers and was like no stay away. But these trailers don't look bad. I saw Prince of Persia. No. Jeff just adjusted his name. He's all set. He's a businessman. Alright. Welcome back to The Game Awards. Now it's time for our first performance and these next dudes are playable characters in Gears of War 4. Joining the ranks of rappers who appear in games like Method Man, Eminem and my boy Patrice \"Pat\" Verbeke (also known as Pat the Rapper) the rapper. There's some serious heat there. Here to perform is Run the Jewels. Remember when we got the Run the Jewels stuff for Gears of War and I had no idea what it was.",
            "start": 1909.48
        },
        {
            "text": "to perform Talk to Me are killing my MP. I think he's teasing Paraplegic (or possibly Parapolar, but more likely Paraplegic) Africa. This is Run the Jewels. Remember when we got the Run the Jewels stuff for Gears of War and I had no idea what it was. I don't. I still really don't. We got a package that had a bunch of Run the Jewels and Gears of War stickers and shit like that. Well, the jewels were legit. No idea what this is. They're legit? They're beyond legit. Is that the guy from the Barenaked Ladies? Is that the guy from Barenaked Ladies? It is. What guy from Barenaked Ladies does that look like? You're not the type one who's no longer in it. That doesn't look like him at all. But you're not aging him up, Colin. Age him up. It's been years since we saw him. They kicked him out of the band. He did too much cocaine. I know. He ended up here. Run the Jewels. I'm in D&D now like they call crap. I move to a world of conspiracy. Oh there ain't no rules I'm doing these. Spreads swords to the airport. No. Not a joint in the passport. Pull",
            "start": 1981.48
        },
        {
            "text": "Run the jewels. I'm in D&D now like they call crap. I move to a world of conspiracy. Oh there ain't no rules I'm doing these. Spreads swords to the airport. No. Not a joint in the passport. Pull cash in the table what he asked for. My vibe let the devil talk a miracle. God damn it. America. No. Let it burn to America. My man I'm on Pitbull Terrier. Are they muting themselves? Were they muting themselves in the curse words? Michael Michael Psycho. Fuck that. Come on it's the internet. This is why The Game Awards left fucking Spike TV. Spike TV. They do die. No I'm throwing the kibosh on that. There's no lettuce in case it is. That sounds like a terrible idea. That's right. No it's like a motherfucker. Don't like that at all. They're not censoring. Oh they aren't censoring. How do you say they aren't censoring? They're not censoring. These guys are doing it. I've heard of them. They're going for a bit. Seek killers aren't doing their job at all. Yeah they're not cursing. They're not.",
            "start": 2021.48
        },
        {
            "text": "they aren't censoring? They're not censoring. These guys are doing it. I've heard of them. They're going for a bit. Sekiro's killers aren't doing their job at all. Yeah they're not cursing. They're not. They're not bleeping it. Shut up Kevin. Fuck. Double punch double punch double punch. Double punch double punch. DJ Khaled motherfuckers. They are like super lit. Let's go. One. Alright. Hey. Hey. Hey. Picture this I'm a bag of dicks. Put me to your lip. I am sick. I will punch a baby bear in his shit. Give me lip. I don't mind hearing you. But I heard it now. Stop. I heard it. No definitely. There's a lot of this stuff. Last year churches did really well. They played one song and I was like oh these guys are good. Was it one song? I remember churches going all along. I was fucking high as a kite. I don't know. I won my award. Sean Blakely gave me the injection. Yeah. That'd be great. We're just talking over and it's all about us. Yeah. We're like ah what do you think of this going on?",
            "start": 2088.48
        },
        {
            "text": "Don't know, I won my award. Sean Hayes gave me the injection. Yeah. That'd be great. We're just talking over and it's all about us. Yeah. We're like ah what do you think of this going on? Blah blah blah blah. We all got jokes. Teenage Mutant Ninja Turtles 2. Is it really? No. Sorry my apologies. There you go. It's crazy though. Doing this. I mean it is the award. It's not like it's grand. Oh why are they not that big yet? Yeah I mean yeah they're like. They're the top of all the ground. How fucking dope would it be right now if Guillermo del Toro walked by in the background there? The other good news about this Guillermo del Toro thing is that me and every other fat person finally has a character in the cosplay as it events. Get me a fucking mason jar. Get me an aborted fetus. I put it inside it. I get a suit on. I walk around. Oh my God. I'm going to eat. I'm going to die. Nobody scream. Nobody get choked. Thank y'all. RTJ3 January 13th. Uncharted? And now here's the cast of",
            "start": 2195.48
        },
        {
            "text": "it inside it. I get a suit on. I walk around. Oh my God. I'm going to eat. I'm going to die. Nobody scream. Nobody get choked. Thank y'all. RTJ3 January 13th. Uncharted? And now here's the cast of Uncharted 4 A Thief's End. All nominated tonight for best performance. Please welcome Emily Rose, Troy Baker and Nolan North. Thank you. You're on order. We know all these people. Bring back Jericho. Emily Rose? She worked of course for Naughty Dog, not Jennings and Raw. Nolan's going to say something funny here in a second. Yeah. Yeah, he's ancient. Who is that? Troy Baker. Troy Baker. Okay. That's great. This year, five games created utterly unique worlds, both realistic and fantastic. Here are the nominees for best art direction. Best art direction. Kind of disappointing Troy didn't mention it. He's on the other side. Attackers income trapezius. Just heads up. Bike. Yeah. I'm going to go for the bike.",
            "start": 2273.48
        },
        {
            "text": "direction. Attackers income trapezius. Just heads up. Bike. Yeah. I'm going to go for the bike. I'm going to go for the bike. I'm going to go for the bike. I'm going to go for the bike. I'm going to go for the bike. I'm going to go for the bike. I'm going to go for the bike. Luckily it's Gordon. Stephenson's a better owner. Look for the bike ever. Direction so yeah, I predicted Firewatch, but wanted Inside Tim predicted Inside Colin predicted Inside both wanted Inside and we voted for Inside. I voted for Inside, but we all voted collectively Yeah, we voted for five No, we nominated five and then we voted for the winner you're right you are right and The Game Award goes to You Stay together yeah Yeah, give me the air game of the game My naughty dogs, I'm like Demon's Souls Thank you Kevin we all said Inside when they're at it If you haven't played Inside it's fantastic you have to play Inside really good game Thank you friends you make a development team in Copenhagen very happy Making",
            "start": 2403.48
        },
        {
            "text": "all said inside when they're at it If you haven't played Inside, it's fantastic, you have to play Inside, really good game Thank you friends, you make a development team in Copenhagen very happy Making Inside has been a wonderful experience and your reception has been warm and thoughtful Kevin, now that I have to give you a minority report and say that's bad, no Saudi Arabian, Australia So now it's back to the workshop. I think the team is already brewing on something yes, and you should join us Copenhagen is wonderful and played at his hiring So I thought he's going into the political realm for a second. You should join us everything's fucked here World come here Here we go There we go It was scientifically inaccurate am I right Kevin? Oh That's not a world for me That's not a world Well, I mean it would have been if it didn't leak it would have been an announcement. It is a world from your announcement Coming up I'm gonna be coming in O'Brien presents the award for best action game and",
            "start": 2489.2
        },
        {
            "text": "mean it would have been if it didn't leak it would have been an announcement. It is a world from your announcement Coming up I'm gonna be coming in O'Brien presents the award for best action game and later Go Danny or Boogie or Jack Mass Effect: Andromeda live from Los Angeles. This is The Game Awards, the biggest night in gaming. I Didn't see people campaigning when I mean people I mean like how are I sound like Jack or Boogie or even probably Angry Joe could have been like hey Vote for me, please. Do you follow Jack? Yeah. Okay. I saw him today Thank everyone for voting if they voted for him, but I never saw him be like, hey, please but I didn't watch his videos Maybe his videos are saying No What was it just saying vote for me or don't move Yeah, I was just him saying vote for me, but we're gonna create Boogie way. Okay, I like Boogie Ah Just based on this artist it's gonna be some mobile thing Oh I'm gonna be the base Having a great time so far especially these fans right here who",
            "start": 2616.88
        },
        {
            "text": "gonna create Boogie Woogie. Okay, I like Boogie Woogie Ah Just based on this artist it's gonna be some mobile thing Oh I'm gonna be the base Having a great time so far especially these fans right here who are rescued by no other than Shix Hydrobot yes, I love this one. I think the guy the guy next to the hydro bot is one of our fans Hydrobot On top of all that chick actually teamed up with Mortal Kombat co-creator John Tobias to bring us a monumental battle That shows us just how unstoppable hydrobot truly is check it out Okay, the loop strips gonna win always vote for the loop no We just saw the hydrobot Afterbought can't lose You're saying hi hydrobot gets you wet lube got stole like no other razor Hydrobots That was sick I mean it with all due respect, right? Because we have ads and whatnot, but like the marketing people at Shik do they really think That this is like a cool idea or they want people to make fun of it because then they're talking about the product or awful I think like",
            "start": 2668.92
        },
        {
            "text": "but like the marketing people at Ubisoft do they really think That this is like a cool idea or they want people to make fun of it because then they're talking about the product or awful I think like they must know I was interested in that kind of shit I'd love to see how they got with the ideas they have in the board though to get to Hydro Thunder Let's make a Hydro Thunder. Well, it's not like that guy was big Doesn't like they're in Their friends with the Jesus categories and also be sure to know I can't not see it now tonight on Xbox the new open-world action game From Ubisoft available tomorrow on Xbox one. All right right now We've got the Clueless Gamer himself back again to present best action game. Take it away Conan O'Brien We all said Doom across the board with a little Game Awards Let's face it when you think young and cutting-edge you think Conan O'Brien Oh Really for for for yeah get that horse over here now Any hoots they've asked me because I'm so",
            "start": 2774.58
        },
        {
            "text": "with a little Game Awards Let's face it when you think young and cutting-edge you think Conan O'Brien Oh Really for for for yeah get that horse over here now Any hoots they've asked me because I'm so cool to announce the nominees for best action game and here they are Best action game It's not even an answer Because intro we didn't have anything Like I said about to that choice That shooter this is best action game We all said Doom I want Overwatch and Call of Duty Oh That'll believe it in there Winner is do there you go great game Don't even have to go to or watch these you gotta just watch the Games Awards cast or knocking them out of the park Kevin please Turn on your mic. I want you to be part of this you make funny quips over there And if you're not, you know, nobody hears you nobody hears you. Yeah, they can't hear me So I have no idea what I've been saying really we've been really funny What you're doing right now, I guess that makes a lot of sense All",
            "start": 2825.5
        },
        {
            "text": "nobody hears you nobody hears you. Yeah, they can't hear me So I have no idea what I've been saying really we've been really funny What you're doing right now, I guess that makes a lot of sense. All right This has been an incredible ride honestly Doom is a game that everybody knows to be relentless and that's because the team that made it Has been relentless for the last three years So to the team at id Software back in Dallas and Frankfurt, this is yours I couldn't we couldn't be prouder or part of a better team to our awesome team at Bethesda Across the entire organization. We again we couldn't be part of a better team Robert Ernst, thank you so much for believing in us Todd Howard and Pete Hines, thank you for your guidance throughout and to the fans out there Everybody on Reddit on Doomworld posting on YouTube playing the game on Twitch You're a big part of this. So thank you so much. We really appreciate it. Thank you And now she's an immensely popular YouTuber and he's",
            "start": 2918.08
        },
        {
            "text": "doom world posting on YouTube playing the game on Twitch You're a big part of this. So thank you so much. We really appreciate it. Thank you And now she's an immensely popular YouTuber and he's the host of Game Theory, please welcome I just seen and Matt that I It's a good job, it's a great jacket I'm a seem all times the earliest video games were strictly about entertainment, but they were soon followed by educational games Today's developers are blurring the lines between the two forms to explore new subjects and create socially conscious Progressive works of art that can inspire and transform the world around us the nominees for the Games for Impact award convey powerful stories from the past Illuminate said impact was I predict a dragon and even imagine possibilities for tomorrow whether hopeful or not Here I just didn't play any of these games. I hear you. I understand Games for Impact Basically he thinks we should move forward with the radiation but could be another",
            "start": 2975.86
        },
        {
            "text": "whether hopeful or not Here I just didn't play any of these games. I hear you. I understand Games for Impact. Basically, he thinks we should move forward with the radiation but could be another miracle Ostrich a good Twitter everyone saw that fucking Shaving Robot to write. I didn't just have a string Hydro hydro bot has his own Snapchat At that money check A Little behind the scenes this thing is so heavy by the way, it's incredible bicep curls anyway, The Game Awards goes to That Dragon Cancer And they've done everything else you Know what I just said POKÉ Tournament for fighting game Everything else though. Yeah, every other. Yeah, damn Tim you on fire. There's no way you thought poke Oh, no, you also said Batman: Arkham VR Keeping you honest, alright He's gonna take selfie only I can I bet he's gonna get away something from his son That Dragon Cancer exists Because my wife Amy my children Caleb Isaac Elijah and Zoe my business partner Josh our team John Brock Ryan Mike and Chris Our",
            "start": 3030.82
        },
        {
            "text": "he's gonna get away something from his son That Dragon: Cancer exists Because my wife Amy, my children Caleb, Isaac, Elijah, and Zoe, my business partner Josh, our team John, Brock, Ryan, Mike, and Chris. Our friends who are at ooh, yeah Kelly and Julie, Bob and Jared are over 3,000 Kickstarter backers Indie fund and this entire industry believed it should exist Often in video games we get to choose how we're seen Our Avatars and our tweets and the work that we do are all meant to portray the story that we want to tell the world About why our lives matter But sometimes the story is written on to us or it's it's told Because Of us or in spite of us and it reveals we were all meant to our weaknesses our failures our hopes and our fears Was that all right you let us tell the story of my son Joel? And In the end it was not the story that we wanted to tell But you chose to love us through our grief By being willing to stop and to listen and to not turn away To let my son's Joel's life change you",
            "start": 3127.42
        },
        {
            "text": "In the end, it was not the story that we wanted to tell. But you chose to love us through our grief. By being willing to stop and to listen and to not turn away. To let my son's Joel's life change you because you chose to see him and to experience how we loved him. And I have hope that when we are all willing to see each other, not for just who we want to be but who we are and who we were meant to be. This act of love and this act of grace can change the world. Thank you. You can really tell, can tell meaningful stories; amazing moment, that right there is why we do the show folks. Wow, all right well. You know one of the great things about this show is that we can share moments like that with folks all around the world. And this year we're so excited to be airing The Game Awards live in China for the first time in partnership with Tencent China, the biggest market out there for games, and we're so excited about partnering with Tencent and trying to take it over promoting online on qq.com. And we chat about",
            "start": 3235.82
        },
        {
            "text": "Time in partnership with Tencent China, the biggest market out there for games, and we're so excited about partnering with Tencent and trying to take it over, promoting online on qq.com. And we chat about their favorite game, and the winner for that award is a game that you're very familiar with here in North America, League of Legends. So congratulations to Riot for the fans' choice for Ten Second China. All right, we'll be back on the board game awards right after the worst game of the year. What are you afraid of, Keely? We asked you last year. Do You return Oh China? You kidding me? The gameplay was amazing. All swarmed attack it was so fast-paced looks amazing. So whatever says something that's what the place before but it's gonna sit on shelves all around the country and look really nice. Pre-order today for bonus content. We have heard a lot about this young man, Alex Hunter. I never expected anything like this. You get up to 40% off FIFA 17 powered by Frostbite and featuring an all-new story mode.",
            "start": 3307.5
        },
        {
            "text": "today for bonus content We have heard a lot about this young man Alex Hunter I Never expected anything like this You Get up to 40% off FIFA 17 powered by frostbite and featuring an all-new story mode Make your mark today and visit EA Sports.com slash FIFA I'm backstage right now. All the winners are coming through here with Find out who you the fans picked as your favorite trending gamer Presented by Intel is an angry Joe jacksepticeye. I don't know as long as it's not Brandon Jones. I'm happy on with the show I voted for Well, I know All right, we are back here and now it's time to announce a brand new game and a brand new studio I'm here with Jesse to tell us about your new studio new project You guys came to me Very early on in this year and said a goal for the team was to announce the game here on stage at The Game Awards And you guys have been great partners in putting this together for us. So tell us about your studio Just you have an amazing background having worked at Bioware",
            "start": 3398.98
        },
        {
            "text": "Game Awards here on stage at The Game Awards and you guys have been great partners in putting this together for us. So tell us about your studio, just you have an amazing background having worked at BioWare, Riot, but tell us about the new studio Phoenix. Thanks Jeff. So we started about two and a half years ago. Now, we're about 40 folks up in Canada. It's nice to be down here. And so yeah, we're making a free-to-play PC game. It's a game called Dauntless, and you know, we wanted to come and kind of give a first little taste of the experience. We're trying to try to give everybody... All right. So new studio brand new game Dauntless. You guys have been working tirelessly on this. This trailer and we're so excited to have The Game Awards be the first place that people will take a look at this brand. Let's have it here. No, absolutely. Take a look here at a brand new world premiere of a new game you haven't heard about but you'll probably be hearing about a lot in 2017, Dauntless. Check it out.",
            "start": 3486.98
        },
        {
            "text": "Let's have it here. No, absolutely. Take a look here at a brand new world premiere a new game You haven't heard about but you'll probably be hearing about a lot in 2017 Dauntless. Check it out. Thanks, Jesse \"Doggface\" (Note: I corrected the name to match the known persona of professional skateboarder and social media personality, Doggface) You I Like the art style up I gotta see the game I Feel like a ball No, you are the cat one player you can play the cat single play I know what I'm saying it's single player you're the cat very dog narrative Okay Now Please welcome the chief competition officer from Electronic Arts Peter Moore It's always such fun Yeah, everything he does Nobody plays a crowd like Peter Moore does here more touched my leg that one time that was really a highlight of my 15 year career Independent online Personalities have established themselves as a new lens through which the industry can view our relationship with our fans outspoken unchained passionate these gamers stream right into our houses and remind us of what it's like to play with our friends Here are the nominees for",
            "start": 3526.86
        },
        {
            "text": "can view our relationship with our fans outspoken unchained passionate these gamers stream right into our houses and remind us of what it's like to play with our friends Here are the nominees for trending gamer Trending gamer presented by Intel I Hit him so hard you went out of existence and daylight Oh my god, there's an alligator So those other guys don't do a lot of on-camera stuff just do let's please we're therapy Oh It's Boogie Is it yeah because Boogie has to share The Game Awards goes to Boogie. Yeah, 29 Holy shit That was my nominee I Like that I like me some Boogie look way though great Danny of course to fuck yeah good of course the Boogies the dude Been doing this all time We were all wrong And having a great time with each other There is nobody we're all wrong country in I predict the Danny you pretty Jack Shock good for you Boogie man That's huge I've seen you in front of his Jack is a fucking Congratulations yeah you have millions of fans around the world say a few",
            "start": 3681.68
        },
        {
            "text": "the Danny DeVito pretty great good for you boogie man. That's huge. I've seen you in front of his Jack is a fucking Congratulations, yeah, you have millions of fans around the world say a few words Thank you, sir And and and thank you Geoff for this show and thank you everybody man that at home and voted for me Thanks for my wife who's changed my life and given me something to fight for A lot of you were before you were born and if you look at me like physically There's not a lot I can do in this world But the game creators like yours have have created worlds that I can explore Worlds that I can accomplish worlds that I can be a hero in and I think it's so important for nights like tonight To celebrate the people who create those games that have given us a distraction from the world We live in today that have given me a distraction and the darkest points of my life. Thank you guys. Thank you I mean the people that make these games at the end of the day, you're the hero, right? Like",
            "start": 3791.68
        },
        {
            "text": "Live in today that have given me a distraction and the darkest points of my life. Thank you guys. Thank you, I mean, the people that make these games at the end of the day, you're the hero, right? Like thank you for everything you guys do, and I hope you guys have a wonderful night. Thank you for letting me be part of it. Thank you. What a great moment; so good to have Boogie here. Congratulations, CliffyB! To him. What an amazing moment. All right. Well, now I'm here with a good friend of mine, I've known for 20 plus years, Cliff Bleszinski from Epic Games (not Mazda productions), CliffyB, what's up guys? So, Cliff, we're here to talk about the new game LawBreakers and I know you've got a little news tonight and some new stuff to share about the game. So, tell us what's new on LawBreakers? Well, so we're showing tonight is a new 60-second trailer, and in this trailer, there's a new map known as Vertigo; it's a zero-gravity modification training facility, as well as a new role known as the Gunslinger. When we",
            "start": 3847.54
        },
        {
            "text": "is a new 60-second trailer and in this trailer. There's a new map known as Vertigo. It's a task gravity modification training facility, as well as a new role known as the Gunslinger. When we did our alpha, people really wanted a character that was very aim based, very skill based for a lot of those core shooters. Dual wielding weapons called Alpha and the Omega, you can fire each one individually using Mouse 1 or Mouse 2 to reload one at a time, fire one in front of you while blind firing one behind you, propel yourself through low gravity, tactical knife whole nine yards, as well as a new way that you can kind of surf around gravity in the map. Alright, well, it sounds like you guys have a lot still to come and I know Beta is coming right people can you have the alpha now you'll beta Yeah, we have the alpha got a lot of feedback. We're looking at the beta in 2017 as well as a release in 2017 Okay and So honestly like when you see this trailer pay attention to these gravity spheres",
            "start": 3897.2
        },
        {
            "text": "we have the alpha got a lot of feedback. We're looking at the beta in 2017 as well as a release in 2017 Okay and So honestly like when you see this trailer pay attention to these gravity spheres because what it allows you to do is a gravity assisted launch Kind of like in the movie Interstellar where they use the moon zip around the map and figure eights and get to the enemy base faster Than ever. All right here is a brand new exclusive look at LawBreakers from the folks at Boss Key for the beta. All right. Thanks Cliff Also getting better looking every time Make to the left I'm gonna listen I Take it back that's the Both Storm the Both Storm influence that Those spheres are kind of sick though. Yeah Yes Oh Everyone the rap rock band got with the rapper to make rap rap rock I thought it was so weird. I was like you already wrapped some other band you do It's crazy how those songs really fit together though Most of them is though in the out not so much In the end. I really liked a",
            "start": 3934.8
        },
        {
            "text": "it was so weird I was like you already wrapped some other band you do It's crazy how those songs really fit together though Most of them is though in the out not so much In the end I really liked a lot of those Well not a lot I mean there's only really two I guess but the Like what Linkin Park was able to do with like their music reanimation was amazing I like it more than the one with the guy from Fall Out Boy for Push me away or whatever Was that Oh yeah track seven innovative single-player and fast fluid and fun Multiplayer there's never been a better time to experience this holiday's highest rated shooter get Titanfall 2 For up to 40% off right now Wow No Hydra bots Feel bad for these but ever forget Yes Oh yes masterpiece their town studio Yeah really fuck that one For Just the low low cost of fifty nine thousand nine hundred ninety nine dollars You can bring home the spirit of Winter Vale into your end Order now murlocs are standing by not available in the blessed lands",
            "start": 4045.7
        },
        {
            "text": "The low cost of $59,999 goal You can bring home the spirit of Winter Veil into your home Order now Murlocs are standing by not available in the Blasted Lands or Grizzly Hills Welcome back to the Assassin's Creed \"Red Room\" brought to you by AMD Radeon and Alienware Everyone here has been diving into the Spanish Inquisition when they put on these Rift headsets and get lost in the Assassin's Creed VR Experience and we're excited to have with us now Tim Gettys, the director of Deadpool now you just got to check out the experience What did you think? It's pretty exciting. Why are you yelling? You're very excited about this project I don't think I can match that volume. It was great. It's very interesting. Yeah Obviously, you know, you're a big creative in this industry. Do you see yourself working on VR anywhere in the future? Oh, yeah, I'd love to work in VR. My studio's just Experimenting right now, but I think it's a great",
            "start": 4108.82
        },
        {
            "text": "you're a big creative in this industry. Do you see yourself working on VR anywhere in the future? Oh, yeah, I'd love to work in VR. My studio's just experimenting right now, but I think it's a great new storytelling medium. I really do. I don't think we know the tools yet I mean, I couldn't tell you how I'm gonna tell a story in it, but I think for storytelling, it's really interesting for just experiencing different stories in a way and by that I mean like you could be in a story while it's happening around you without actually being told the story and I think it's a whole different way to think about stories in general. All right. Well, I'm excited to see what you come up with. Okay, for those of you who want to experience it for yourself, it's now available to download worldwide for free from the Oculus video store back to you Jeff. I did sure. All Right now there are 26 categories awarded this year, 18 jury voted six chosen by the fans plus our industry icon award and we can't do every",
            "start": 4161.3
        },
        {
            "text": "The oculus video store back to you Jeff. I did sure Alright now there are 26 categories awarded this year. 18 jury voted six chosen by the fans plus our industry icon award. And we can't do every category on stage with full presentation. We talked about some games in the pre-show if you miss that Pokémon Go one Best mobile handheld and this family game Street Fighter V one best Fighting game and also Res Infinite one best VR, and we also want to take a moment to recognize some of the other winners and congratulate them tonight. So we'll go through some of those columns right on family I'm sure the winner is The Witcher 3: Wild Hunt - Blood and Wine and CD Projekt RED, a big winner last year at The Game Awards history best strategy game and for Axis Civilization VI. Congratulations to that team incredible game. And the best sports team voted on by fans this was a very tight competition back and forth between SK Telecom T1 (SK Gaming) and Cloud9 and ultimately the fans picked Cloud9. Alright, well now I'm",
            "start": 4200.34
        },
        {
            "text": "incredible game And the best sports team voted on by fans this was a very tight competition back and forth between SK Gaming and Cloud 9 and Ultimately the fans picked Cloud 9 All right, well now I'm very excited for this next performance I think you guys are just the point of the award show They're just gonna blaze. I'm also happy to announce this year I just feel like they're not really giving anyone design that goes to Any awards I have I watch the Oscars every year But there's I don't think it's to this extent. It's even worse. There's like hundreds that they don't do on the show Well, they stop but they do a lot of them It's an hour we've seen two different things announced on the stage Music from that winning soundtrack of Doom. Here is Mick with Sasha and Matt Performing Doom live about to rock the house. Check this out To feast on the blood of the wicked and those that tasted the bite of his sword named him The Doom Slayer at present time with our predictions Colin and I are",
            "start": 4256.98
        },
        {
            "text": "about to rock the house. Check this out To feast on the blood of the wicked and those that tasted the bite of his sword named him The Doom Slayer at present time with our predictions Colin and I are tied with five ten six Wow playing the H string. All right We're going hard H. We got to get those that little register nice Oh, yeah, fuck yeah this guy see this on top of these motherfuckers are stoked to be here I love that. They're rocking the lowest end of the register so hard that they don't even need a face But they're like you should Music Do sound like what's fucking killer if you like that Music Music Synth always fit really well with Gente Gnarly-ass metal. I don't know Not the gen existed five years ago Music Music Yeah Kevin what do you think this devil music? Music Kevin dance Music I like that the kit that the drum is playing is not as like a jazz can almost like not a pretentious ass metal kit with 17 fucking bass drums on it that no one you can hear Here and eight thousand",
            "start": 4311.36
        },
        {
            "text": "I like that the kit that the drum is playing is not as like a jazz can almost like not a pretentious ass metal kit with 17 fucking bass drums on it that no one you can hear Here and eight thousand times four times only People think he's rocking what two four times a bass drum ride cymbal crash hi-hat snare Very basic. It's all you need Still fucking rock Of course Music Playing that Music I love good drums. I miss my kit Music Someone's got a rock Please welcome Ted Price I love how I met Ted Price 15,000 times at every time and he looks me like he's never met me Kevin you met him in an elevator remember to be here to present the award for best performance This category has six nominees because there was actually a tie in the voting We all say no one with six actors nominated only three games are representative And it's not a coincidence that all three of these games were also nominated for best narrative Here are the nominees for best performance Best performance We were meant for",
            "start": 4502.8
        },
        {
            "text": "games are representative And it's not a coincidence that all three of these games were also nominated for best narrative Here are the nominees for best performance Best performance We were meant for this Nathan we were destined for something great Music Out your west facing window, are you seeing what I'm seeing fireworks go down there and set up straight All that spilled blood you know what it breeds Loyalty If you're done lying to me then you should stop lying to yourself Hey, I came out here for a breath of fresh air and some adventure, what do you got? I made a promise that I was done with this life And the Game Awards go to Nolan North Troy of course getting up to hog a spotlight wasn't there a woman in the crowd last year That what was that the show that was wooing at every like they you're talking about that was a game of war so I wasn't doing either it was a The Bethesda Conference Goddamn Nolan's a good-looking man. Oh well take your pictures now. It's probably the last",
            "start": 4580.42
        },
        {
            "text": "they you're talking about that was a game of war so I wasn't doing either it was at the Bethesda Softworks E3 conference Goddamn Nolan's a good-looking man. Oh well take your pictures now. It's probably the last treasure Nathan Drake will ever find He's been practicing that There's there's so many people to thank I'm gonna start with my wife because she'll kill me if I don't My wife and my kids they're here, and she's the actually the one who badgered me into voiceover in the first place It's a true story. I'm not proud of it I Have to I have to thank everyone at Naughty Dog Amazing company that I've had the honor Yeah Had the honor to work with them for over a decade Getting old But you know to Evan and Josh Schreier Our director on I try to for Neil Druckmann and Bruce Straley and all the people who make this happen This is the culmination of ten years of my life the best years of my life made me a better actor better person and I'd be remiss if I didn't mention the creator and the person who cast me Amy Hennig who",
            "start": 4664.66
        },
        {
            "text": "The culmination of ten years of my life, the best years of my life, made me a better actor, better person, and I'd be remiss if I didn't mention the creator and the person who cast me Amy Hennig, who put me. Who put me in the role. But I'm gonna go out on a limb and I want to thank a group of people at Naughty Dog; it's them as a whole. I'm hearing a lot of talk lately about how performance matters, oh shit, and it does. The performance of every designer, every programmer, every artist, every hard-working, talented person at that office—not only Naughty Dog but all the developers that I've worked with—but Naughty Dog in particular because they've been with them for so long that performance is so important; they are so talented. They are so hard-working, and their performance matters more than mine, damn. That's important to understand in this day and age with all the talk going back and forth. Because without their performance, my performance would not only not matter; it wouldn't exist. I'm so proud to.",
            "start": 4732.9
        },
        {
            "text": "That's important to understand in this day and age with all the talk going back and forth Because without their performance my performance would not only not matter it wouldn't exist I'm so proud to do this. I'm so proud to be up here. Thank you so much for this I will Continue on if they will continue to keep making bringing the things I do to life. I'll be there for them. Thank you How's that baller What a great guy no one north congratulations, right? Yes, how did it best go exactly not go to do you know the bridge Another big world premiere moment here first of all Dishonored 2 had a big year nominated tonight for Best Action-Adventure Game rap But I know that's not enough for you guys because next year you've got another project Pray right right correct Prey is to ship in spring 2017, okay? It's a game where you play the role of Morgan Yu and you are the subject of an experiment that went wrong So you find yourself In a very special space station that is infested with aliens and you have",
            "start": 4801.02
        },
        {
            "text": "a game where you play as Morgan, you and you are the subject of an experiment that went wrong So you find yourself? In a very special space station that is infested with aliens and you have to survive hopefully escape using Your all the things that you can find on board the station, and you also find your newfound abilities Alright, well we have sort of an extended look at some really cool gameplay Which you're excited that we're excited to have and I heard a rumor that you guys may also be on a upcoming Video game magazine cover for the second time this year so Arcane is on fire should we take a look at it absolutely All right here is an exclusive new look at Prey from Arkane. Thank you Here I am Morgan Yu, here is 2035. I'm aboard the Talos I research facility The People that come after us will be smarter stronger immortal But they'll know they exist because of the things we did I Told you're gonna get tired of Star Wars This is cool I'll take you You Game Informer me",
            "start": 4866.66
        },
        {
            "text": "come after us will be smarter stronger immortal But they'll know they exist because of the things we did I Told you're gonna get tired of Star Wars This is cool I'll take you You I Game Informer me Hmm big get for gaming for that yeah Alive performance of Black Beetles and Michael Phelps presents the award for Best eSports player Was gonna say it met Bob Oh Awards 2016 Seven thousand five hundred viewers hey, it's Kinda Funny. Thanks for swinging on through watching this with us Reading them for mature I Was at my office with Geoff (corrected from \"Jeff\") Cadre of Professionally bad video game employees that I have so going into the King's Fall raid. I was pretty confident I think it's somewhere probably in day three. I tried this over and over again, and I can feel us getting worse Yeah, I know feel free to kill the ogre you're getting madder and madder and every mistake is amplified by days and days and days Of frustration and suddenly people forget their left from the right you have that moment where you",
            "start": 4961.34
        },
        {
            "text": "the ogre you're getting madder and madder and every mistake is amplified by days and days and days of frustration and suddenly people forget their left from the right you have that moment where you realize you're just gonna you're gonna snap We had a new employee who he got he wasn't the worst, but he was lowest on the totem pole So I kicked him out just go I threw money at the problem That day I booked a ticket for this destiny savant who lives in Vancouver, Canada. Hey What do you uh? What do you got going on tomorrow picked him up at the airport the next morning drove him to the office and Said nobody's leaving this room until we beat the stupid thing I Miss Jeff doing live-action stuff you may have heard Jeff mentioned this earlier But it's worth repeating tonight's game awards is the first ever award. Oh, I'm cast in VR. Thanks to next vr We know her because I love vr. I had to try it myself. Let's do it oh Whoa oh this is so real Ted Price Oh my god. I feel like I got the best",
            "start": 5125.1
        },
        {
            "text": "first ever award. Oh, I'm cast in VR. Thanks to next gen VR We know her because I love VR. I had to try it myself. Let's do it oh Whoa oh this is so real Ted Price Oh my god. I feel like I got the best seat in the house Whoa Cliff was in ski Too real all right enough of me. I will see you more words, please You want some of those squares we get some those squares This song All right welcome back to The Game Awards now here to present is the winningest Olympian of all time He competed in five separate Olympics and won 28 total medals more than anyone else in history If that doesn't ring a bell, maybe you'll recognize him from the Call of Duty: Infinite Warfare trailer Please welcome the one and only Michael Phelps Oh They're playing your fighting game of the year everyone is on these links about a few butterflies sucks and it's broken It's a real honor for me to be here in front of the world's best game creators and players the advancement of eSports over the past few years With the level of",
            "start": 5175.36
        },
        {
            "text": "a few butterflies sucks and it's broken It's a real honor for me to be here in front of the world's best game creators and players the advancement of eSports over the past few years With the level of gameplay and skills from the players has been an incredible thing to see and I'm pretty sure I've crossed paths With a few of you guys online playing Call of Duty There's absolutely no question to me the level of skill training and devotion it requires to become a professional gamer tonight I'm here to pay tribute to five fellow athletes who have demonstrated incredible performance in 2016 here your nominees the you asked there stop diminishing what you do Best eSports player presented by OMEN by HP It takes a great amount of skill for Sarabande sport Like being good at Sudoku makes you a fucking asset at the main sense I gotta say I don't hit that bomb with Phelps. Oh my god, whoo You know, I'm waiting till it's legal here in California officially But Michael Phelps walking right now and he's like",
            "start": 5253.06
        },
        {
            "text": "at the main event I gotta say I don't hit that bomb with Phelps. Oh my god, whoo You know, I'm waiting till it's legal here in California officially But Michael Phelps walking right now and he's like \"who wants to smoke all these dank\" you know Cuz you got to do it we shut down the street Tim. Are you smoking weed with Mike Phelps if it happens? No, damn Thank you. I was gonna say I'll give you the few experiences you're gonna get to in your life that are fucking crazy Somebody with a million gold medals walks in here all the reefer in the world Cheech Marin's game award goes to Oh All righty sports player the hey Where is it you like to send from her? Oh That is mom, I don't speak a good English. Oh You speak good English What I mean this formation was fun Brazil a Portuguese Portuguese Dark you See those all what's against me? I like other people got the mom. All right, people were ahead of me on the mom. Yeah We weren't alone It'd be great if she doesn't speak English either She's",
            "start": 5313.14
        },
        {
            "text": "Dark Souls you See those all what's against me? I like other people got the mom. All right, people were ahead of me on the mom. Yeah We weren't alone It'd be great if she doesn't speak English either She's just like I like Thank you exactly God, I hope that's the translation So first of all thing thanks to all my friends especially Brazilian fans and also thanks for my team without them I wouldn't be here for sure and I had to leave lots of things behind to be here. So I'm really happy to be here. Thank you so much Can I check out I feel really bad for Brazilian gamers Brazil Vince. Yeah, there's other there's other bad about that. I Was seeing something PS VR over $1,000 American there Because of the import share the award for best sports slash racing game and that's quite a slash because we all said NBA games like Detailed sports simulations go up against quirky fun games like Mario Kart and Rocket League It's one of your great category. I love it. So Here are the nominees Best sports or",
            "start": 5408.98
        },
        {
            "text": "said NBA games like Detailed sports simulations go up against quirky fun games like Mario Kart and Rocket League It's one of your great categories. I love it. So Here are the nominees Best sports or racing game So Plaintiff the golden check he said way Good girl Johnny, Bobby, good girl Good girl Alright, let's see and the award goes to Oh, close to my heart, Forza Horizon 3 Oh, we were on Everyone in the comments in that video was calling us out Like wow, no it's Forza Oh, in the video when we posted it? Yeah, when we did our predictions Until they put the T in Forza, I'm not gonna give it any respect It's misspelled There he goes Wow, give it up for Vince Zampella, what an incredible masterpiece he made the game He comes by sometimes I like him when he talks to me You don't like him when he's not talking to you? I have a huge honor to accept this on behalf of the teams at Turn 10 and Playground Games That made Forza Horizon 3 I want to thank all of our fans around the world That",
            "start": 5470.66
        },
        {
            "text": "when he's not talking to you? I have a huge honor to accept this on behalf of the teams at Turn 10 and Playground Games That made Forza Horizon 3 I want to thank all of our fans around the world That played this game, that provided us feedback It's because of you that this title has been a huge success And is now the best selling racing franchise of this generation Most importantly, I'd like to thank all the men and women that worked on this game I enjoyed it and I know you did too Congratulations, this one's for you Ben Nathan on Twitter says If Michael Phelps walks into the Kinda Funny vids Kingston would be the second weirdest thing there Oh here we go The Reg It's all good What if he just revealed a Switch right now Yes Yes Look Thanks everyone Thirty years ago The Legend of Zelda launched For the Famicom Look I was just looking at this email because I got a $10 Prime credit In 2003 this year, we devoted our entire booth to The Legend of Zelda Breath of the Wild And attendees",
            "start": 5582.74
        },
        {
            "text": "launched For The Famicom Look I was just looking at this email because I got a $10 Prime credit In 2003 this year, we devoted our entire booth to The Legend of Zelda: Breath of the Wild And attendees got to experience a huge and groundbreaking experience One that clearly breaks with previous conventions for Zelda Earlier tonight, we debuted a new trailer showing more of the natural beauty and the danger in this vast world of Hyrule As well as new friends and new foes that Link will encounter in this new adventure Well there's some that look like Zelda I'm assuming There's even more that we want to share with you tonight So let's take a look It looks, these graphics are insane, this looks like a real person There's the game, we're gonna take some photos for Remember to imply a new Fallout This is the place where the US team of Nintendo Switch will be far from shining the game Definitely, plus at this time Click here to get the original have a located in ION unmuffled passed down",
            "start": 5642.54
        },
        {
            "text": "This is the place where the Nintendo Switch team will be far from shining the game Definitely, plus at this time Click here to get the original have a located in Ion unmuffled. passed down in this region. Yeah. And as minstrels are wont to do, he's gonna sing to us. Fire up the accordion. Where the dragon's mouth meets the serpent's jaws. Shrine sleeps in the forest of normal cost. Okay, we got this. That's the serpent's head right there. Good spotting, Nate. Seems to be pointing this way, so I'm gonna head over here. It's a nice sunny patch. Oh. Don't let him do that thing. He did that thing. In general, I think two-handed weapons like claymores and axes are great. You're fighting these dudes. Oh. Oh, man. Oh, no. Come on, get yourself together. You probably need a snack on something. Yeah, it's handy to have snacks. So I'm gonna, here, I'll eat some hearty fried greens. Yeah, right there at the serpent's head. I bet we go into that cave. This game needs HDR. Oh, yeah.",
            "start": 5755.1
        },
        {
            "text": "Yeah, it's handy to have snacks. So I'm gonna, here, I'll eat some hearty fried greens. Yeah, right there at the serpent's head. I bet we go into that cave. This game needs HDR. Oh, yeah. Let's look on. Oh. It's like a what? It's super overblown. All right. It's the style, man. What's the Pro Takedown? Until you get the Switch. I'm classically trained for this. Take a smarter route here. I think charging headlong into a bunch of guys with electric arrows is not the way to go. I'm gonna try to, let's explore our stealth option. You're running out of arrows. Never. So you know you were down to two arrows. You just talking shit. Oh, there you go. Nice. I'm committing. Yeah, we have this giant dude right there. Okay. Into the mouth of the beast you go. Yeah, I got it. This guy seems really big. Yeah. Oh. So the other thing about that was the Ful's is they've got chameleon-like powers. He was lashing his tongue out. Wow, nice flurry rush. Yeah. I feel like some new bird's falling. He's",
            "start": 5833.0
        },
        {
            "text": "big. Yeah. Oh. So the other thing about that was the Ful's are they've got chameleon-like powers. He was lashing his tongue out. Wow, nice flurry rush. Yeah. I feel like some new bird's falling. He's going for the weapon though. Give me that. Your sword just broke. No problem, no problem. Throw that, throw that. There you go. Boom. And he's done. I mean, he looks angry, right? Well, you've got, he does. Look at his evil eyes. So here. I'm gonna start this guy off with a little barrage. Oh, that's it. Try your, your. Just walking in my little trap, buddy. Nope, he's too smart. Is he avoiding that? Yeah, he is. You. What the? You. You're dealing with. Here, eat that one. Nope. All right, fine, fine. You're gonna have to face him. Oh boy. He's gonna double swing. He did not stay down for long. He's gonna do now. Dang. Oh. Both. Oh. Please don't get back up. Grab his weapon. Oh, you're. Is it wrong to hit him in the back? I don't think it is. Was he playing on Switch or were you? I was",
            "start": 5895.34
        },
        {
            "text": "He's gonna do now. Dang. Oh. Both. Oh. Please don't get back up. Grab his weapon. Oh, you're. Is it wrong to hit him in the back? I don't think it is. Was he playing on Switch or were you? I was playing my best sword. They're cowards. There we go, I think this, you can see it. What are you afraid of, Bill? We need to save a few surprises. It's right there. It is right there. There's something awesome right there. It's glowing. In the heart of the dragon's mouth. But I think we're gonna end our shrine quest here. I hope everyone is looking forward to The Legend of Zelda: Breath of the Wild. It'll be releasing in 2017 on both Wii U and the all-new Nintendo Switch. Hope you're looking forward to it. I sure am. Thank you. Bye. Thank you. Pretty cool. It looks awesome. Personally would've preferred just a trailer. They should've switched. I've seen enough of the game. Yeah, the gameplay should've been in the pre-show. At the upcoming film, Assassin's Creed. And later, Rooster Teeth are here",
            "start": 5953.92
        },
        {
            "text": "just a trailer. They should've switched. I've seen enough of the game. Yeah, the gameplay should've been in the pre-show. At the upcoming film, Assassin's Creed. And later, Rooster Teeth are here to present the award for best action adventure game. Technically, they should be Rooster Teeth. And a blazing performance by Ray Wise. This is The Game Awards. The hype is real. Here we go. Ah, gadget stand. The city of opportunity. I think it's Bernie and Ashley. Welcome to the big time, pal. Please welcome the host of The Know and some guy. I think it's Andy Cortez. Andy from Rooster Teeth and Bernie. This comes on his booty and his hair all cockamamie. Something cool, isn't it? Here we go. Yes! Now give him a chance, Hydro. Don't go to your super right away. You gotta build up the meter first. Ah man, he's just getting cheap. This is what I was always talking about with Injustice. I didn't understand the interactive environment. Imagine they're gonna go the same way every time. Schick",
            "start": 6006.36
        },
        {
            "text": "Ah man, he's just getting cheap. This is what I was always talking about with Injustice. I didn't understand the interactive environment. Imagine they're gonna go the same way every time. Schick Hydro. Designed like no other razor. Thank you, Geoff. Who is this guy? He's the fucking boss man. Is he? I don't know who the hell he is, but I thought. I thought Geoff Keighley was boss. All right, well, we're gonna continue with much more of The Game Awards, lots more awards to come. And you know, I think it's important to have a night like this to celebrate gaming. And tonight wouldn't be possible without the support of the entire gaming industry, including Rockstar Games who backed me from the very beginning when I decided to build an independent award show thanks to Rockstar. And thanks to all the publishers who helped me put this show together. This is all for you guys, all the great work you guys do throughout the year. Oh my God. Now we've also got a live thread going on Reddit. You can check",
            "start": 6095.24
        },
        {
            "text": "who helped me put this show together. This is all for you guys, all the great work you guys do throughout the year. Oh my God. Now we've also got a live thread going on Reddit. You can check that out. I did an AMA earlier today for that, so check that out. And right now we're gonna get to another world premiere. This studio at the first Game Awards, speaking of The Game Awards back in 2014, they won best independent game, Yacht Club Games. Now we're very happy to reveal to you for the first time the next game or the next piece of the Shovel Knight story. Check it out, this spring, Return of the Body and establish the order of no quarter in the prequel to Shovel Knight. Check it out. What? What? World premiere. God, it's interesting. A lot cooler than Plague Knight. I couldn't play the Plague Knight, just like I was saying. Yeah, it was jumping really weird. Yeah, it was bizarre. Like I just, I hope that they give this a full roster of trophies. I've actually specifically asked them",
            "start": 6146.64
        },
        {
            "text": "Knight, just like I was saying. Yeah, it was jumping really weird. Yeah, it was bizarre. Like I just, I hope that they give this a full roster of trophies. I've actually specifically asked them to do that. I just emailed with them today about, about trophies. Cause I think the Plague Knight one only had like one or two trophies out of it. I think it was like a silver. Yes. Spectre's my favorite. Now, please welcome the system architect of the PS4. Mark Cerny. And creator of Knack. Here's Mark Cerny. And the creator of Knack? That's what they want to credit him as, all right. Told you more things get hyped. Director Alfred Hitchcock famously said, to make a great film, you need three things. The script, the script, and the script. Like great movies, you need three things. Like great films, the nominees for best narrative focused on story and characters. Best narrative, I said Oxenfree, Tim and Colm said Inside. Inside's gotta win. Best narrative. The Knack hype is real, man. The chat's",
            "start": 6219.94
        },
        {
            "text": "The nominees for Best Narrative focused on story and characters. Best Narrative, I said Oxenfree, Tim and Colin said Inside. Inside's gotta win. Best Narrative. The Knack hype is real, man. The chat's blowing up. You know what, never lose his signal. The sequel's in development. According to some, some, uh, LinkedIn shit. As an employee of the Forest Service, that is treason. Oh no! See, this island's pretty cool, right? Watch as I take it all away from him. Here we go! And the award for Best Narrative goes to Uncharted 4, a big fan. Wow, not a huge surprise. That's what I wanted. The Inside guy. What I predicted it would win, please. Just fuck it. The guy that sounded like he was gonna take over. See him tearing up his little notebook. Fuck it in the air. Josh and V. Kinda Funny hat in the crowd. Shout out to whoever watches this and sees that. How's that gonna happen? Gotta see Josh and Neil got dressed up for the occasion. This was a hard one. Narrative, like everyone on the team",
            "start": 6277.58
        },
        {
            "text": "Crowd, shout out to whoever watches this and sees that. How's that gonna happen? Gotta see Josh and Neil got dressed up for the occasion. This was a hard one. Narrative, like everyone on the team, every single person at Naughty Dog works in the narrative. So on behalf of everyone at Naughty Dog, my directing partner, Bruce Straley, our bosses, Evan Wells and Christophe Balestra, an amazing cast led by Nolan North, Emily Rose, Richard McGonagle, and Troy Baker. We all worked for the same goal of telling the final chapter of Nathan Drake's story and honoring these amazing cast of characters. And I guess finally I wanna thank Amy Hennig who without her work, these characters wouldn't even exist. Classy move. And also a special thanks to all of the family and friends. No thank you, I'm good. Everyone who works at Naughty Dog who were very supportive and very patient as we worked to finish this. I'll get some after the show. So thank you very much to all of them as well. Thank you. Next musical performance,\n\nNote: I corrected the following errors:\n\n* \"Kristoff\" to \"Christophe Balestra\", correcting the name of Naughty Dog's co-president.\n* \"Evan and Kristoff\" to \"Evan Wells and Christophe Balestra\", correcting the names of Naughty Dog's co-presidents.\n* \"Noah North\" to \"Nolan North\", correcting the name of the voice actor who plays Nathan Drake.\n* \"Richard McGonigal\" to \"Richard McGonagle\", correcting the name of the voice actor.\n* \"Amy Henning\" to \"Amy Hennig\", correcting the name of the game designer.",
            "start": 6362.58
        },
        {
            "text": "at Naughty Dog who were very supportive and very patient as we worked to finish this. I'll get some after the show. So thank you very much to all of them as well. Thank you. Next musical performance, huh? It's video game inspired rap. Look at them getting away. Cerny was supposed to walk him off stage, you didn't. Welcome back to The Red Room brought to you by AMB, Razer and Alienware. The Assassin's Creed movie comes out December 21st but you lucky people get an exclusive sneak peek right now. I'll get food down the road. Let's take off, love. Let's take off. Let's take off. Let's take off. Let's take off. The shit they're showing for Assassin's Creed doesn't look horrible, but I just can't believe. Can the Uncharted franchise go out on top or will a newcomer take the prize? The whole premiere is for the most anticipated games of 2017. Don't go anywhere. This is The Game Awards. Introducing the new Xbox One S. The only console with high dynamic range. Sorry brother. Over a hundred",
            "start": 6425.26
        },
        {
            "text": "The Game Awards is for the most anticipated games of 2017. Don't go anywhere. This is The Game Awards. Introducing the new Xbox One S. The only consoles with high dynamic range. Sorry, brother. Over a hundred exclusives. That must have gone a while. And 4K Ultra HD video gameplay. This is the new Xbox One S. Xbox One S starting at $299. What do I sell? I sell glorious pandemonium. Instant immortality. Colin, you remember how good the Uncharted commercial was? The what commercial? Uncharted commercial. Uncharted. Was it for Uncharted? For Uncharted, okay. Oh, right, right, the PlayStation. Yeah, yeah, yeah. It was a PlayStation one. I've kind of just tuned out. What else is new? It's boring. I mean, that's my personal opinion. It's just boring. It shows boring games being talked about. No gameplay of any consequence. I'm jaded because I was there last year obviously. But I do feel like it's the weaker show this year so far. Always open right there in the PS4 console. PlayStation Store. What do",
            "start": 6538.78
        },
        {
            "text": "of any consequence. I'm jaded because I was there last year obviously. But I do feel like it's the weaker show this year so far. Always open right there in the PS4 console. PlayStation Store. What do you think chat? Let me know. You won't believe what's in store. Now back for more world premieres. Please welcome the studio head from 343 Industries, Dan Ayoub. They don't have that guy. He was just wasted somewhere. Hydro man got him. Hey everyone, thanks for watching tonight. Everyone at 343 is so excited to be just a couple of months away from welcoming back old friends and making some wicked new enemies in Halo Wars 2. This February, Halo Wars 2 will let you build and command the biggest Halo armies ever with fast and fun new ways to play. But if you don't want to wait until the end of February, to start playing Halo Wars, we're happy to announce that everyone who buys the digital Halo Wars 2 Ultimate Edition will get special preview access to the new definitive edition of Halo Wars 1",
            "start": 6611.66
        },
        {
            "text": "to start playing Halo Wars, we're happy to announce that everyone who buys the digital Halo Wars 2 Ultimate Edition will get special preview access to the new definitive edition of Halo Wars 1 remastered, especially for Windows 10 and Xbox One. The definitive edition brings the classic Halo Wars gameplay back looking better than ever and will open up the world of Halo strategy gaming to PC players everywhere. The definitive edition will begin rolling out on December 20th. Thank you, I appreciate it. And you're gonna need that extra time to hone your skills for Halo Wars 2. No, thank you. As you get ready to face the biggest new threat in the Halo galaxy, the mysterious and deadly Brute Commander Atriox. Now we've seen the damage that Atriox can do, but until now we've never really known him. That's about to change. Enjoy. The world premiere. The world premiere. Look at those teachers. What happened down there? There's another one that's right there. Isabelle. Five months ago,",
            "start": 6687.54
        },
        {
            "text": "him. That's about to change. Enjoy. The world premiere. The world premiere. Look at those teachers. What happened down there? There's another one that's right there. Isabelle. Five months ago, the portal from the Ark of Earth shut down without warning. Oh really? I'm Fredo's little brother. Almost went pro. He? In Halo Wars? Yeah. Brute. He's a pro athlete. Thank you. Mm-hmm. Thank you. His name is Atriox. Before you go, are esports players athletes? During the war, the Covenant used his clan as expendable muscle. I love this head. Told them dying in battle would speed their holy journey. And none ever returned until he did. And so battle by battle, war by war. Shout out to Adam Neely who says on Twitter, you're really good at eating wings. Like damn, I'm sorry for not believing when I heard the rumors. Eventually both were impossible to conceal. And they tried to banish him. In everything we know about the Covenant's thousand year history, Atriox was the first to defy the Covenant.\n\nNote: No changes were made as the text appears to be a clean and accurate representation of the spoken content, with no obvious phonetic or spelling errors that could be corrected based on the provided metadata.",
            "start": 6731.34
        },
        {
            "text": "the rumors. Eventually both were impossible to conceal. And they tried to banish him. In everything we know about the Covenant's thousand year history, Atriox was the first to defy the Covenant. And survive. Tim Gettys says. So they just tuned in on stream. Can't wait. No we can't. The Covenant had two targets in those years. Sure, E! Hollywood News is a better put together stream by the people watching that. But Atriox, they never came close. We don't stop him now. We leave the galaxy at the mercy of a monster. He killed everyone I was supposed to protect. At this rate it will be over soon. Colin, did you play Halo Wars? Was that a thing for you? That is what you're up against, James Cutter. We need to run. As far and as fast as we can. This is really hard. He's made amazing game cinematics for years. And this year he directed the hit film Deadpool. Please welcome Tim Miller. This is boring, stand up. Why are you yelling? Basically. Let's get the kids something. Thank you. You hold this",
            "start": 6803.94
        },
        {
            "text": "for years. And this year he directed the hit film Deadpool. Please welcome Tim Gettys. This is boring, stand up. Why are you yelling? Basically. Let's get the kids something. Thank you. You hold this like this. I'm here to present the award for the Best Game Direction. Creating a great game is truly a team sport. To put together a successful project like this, to put together a successful project like those nominated tonight, takes a dedicated and talented team. Because that's more interesting than anything that's going on on this stream right now. Okay. That's the highlight of everyone's night. This award recognizes studios that have worked especially hard. Bite my mozzarella dick. To push the boundaries of game design. How's the quesadilla? Here are the nominees. I mean, it's what I need. Hold up your box too. We've never called out the fact that Titanfall 2's marketing budget went to Buffalo Wild Wings. Turn it around. See how it does that? Fire in the hole. You can't really see",
            "start": 6882.98
        },
        {
            "text": "Hold up your box too. We've never called out the fact that Titanfall 2's marketing budget went to Buffalo Wild Wings. Turn it around. See how it does that? Fire in the hole. You can't really see it. Hold on. Wait, wait. Do it one more time. Do it one more time. Do it one more time. There you go. You can see it there. Took a long time for him to get out of this game. What did we say for this one? Oh crap. Game direction? Wait, no. I think it was just development. You can shut your face now. I said Naughty Dog. You said Blizzard. Colin said Naughty Dog. And the game award goes to Blizzard for Overwatch. God damn it Tim. It's true. Listen to this song. There's no direction. I'm so fucking happy. There's no direction to this game. Hey, here's a bunch of fucking people. Shoot each other and walk this guy, the refrigerator around. That's that game. Fucking idiot. Sarcophagus. Nice. I'm Jeff, one of the guys from the Overwatch team. Yep. Yep. On behalf of everybody on the Overwatch team",
            "start": 6929.98
        },
        {
            "text": "walk this guy, the refrigerator around. That's that game. Fucking idiot. Sarcophagus. Nice. I'm Jeff Kaplan, one of the developers from the Overwatch team. Yep. Yep. On behalf of everybody on the Overwatch team, it's an extremely big honor to be recognized by everyone who spoke up for this award. We thank you very much. The entire team was so passionate about creating a game about heroes. And we started off, we were a really small team. And we had this idea of larger than life people, people we wanted to aspire to be someday. And early on, that was people like Tracer and Winston and Zarya and these characters that were bright and hopeful. But as we got it on in the beta, the open beta, and then launch, the real heroes turned out to be our community, our amazing players. And Widowmaker. Our Reddit is one of the most amazing Reddits there is. We love our Twitch audience. Keep them out for Harambe, always. That's right. We love our Facebook. What? Twitter. You guys are amazing to us. Each one of you",
            "start": 7003.98
        },
        {
            "text": "of the most amazing Reddit users there is. We love our Twitch audience. Keep them out for Harambe, always. That's right. We love our Facebook. What? Twitter. You guys are amazing to us. Each one of you, the pro Genji's, the support mains, the people not watching because they're placing in season three right now. I like this guy. I'm not watching him, I'm eating my Doritos. And we thank you on behalf of everyone at Blizzard. Thank you so much. Congratulations to Blizzard. Very well deserved. The best game direction. All right. Well, for the last two years, AMD has been working closely with the team at DICE to help develop the most immersive Battlefield 1 experience ever for PC. They developed a range of features, including asynchronous shaders and free sync and optimization for DX 12 that help Battlefield play best on AMD. To mark this partnership, a few weeks back, we announced an amazing giveaway with our friends at AMD Radeon and EA DICE, giving fans the game awards around the",
            "start": 7072.98
        },
        {
            "text": "that help Battlefield play best on AMD. To mark this partnership, a few weeks back, we announced an amazing giveaway with our friends at AMD Radeon and EA DICE, giving fans the Game Awards around the world. Blizzard got a speech when he gave thanks and he said, \"You gotta keep it out for Harambee.\" Well, here it is in the flesh, and it's a little bigger than I expected. But this tank, there's a twist. It comes complete with a Radeon PC inside, which is made by world-famous PC modder Bill Owen. Get them fried pickles. Not this time. Winners also receive a collector's edition, which includes a copy of the game for your chance to win this right here. There's a real PC in here. I can see the fans. I can see the graphics card. You can head on over to The Game Awards.com right now. Tim, go try to win that for us. I don't fucking want that. We've got much more of The Game Awards still to come. Of course, we think about us, we can paint it. More world premieres in the first gameplay Mass",
            "start": 7129.98
        },
        {
            "text": "try to win that for us. I don't fucking want that. We got much more of The Game Awards still to come. Of course, we think about us, we can paint it. More world premieres in that first gameplay Mass Effect: Andromeda minutes away. I spray painted my Game Boy Pocket once and it didn't work out well. Did it work anymore? Or was it all sticky? It worked. I had glitter on my hands. It looked like it every time I played it. I was so excited when this record came out. The game, I'm not so interested in it right now. The double record, Smashing Pumpkins' double record, Mellon Collie and the Infinite Sadness, 1995. Fucking awesome. So many great tracks. Can we just appreciate that \"The Collision Course\" was featured tonight? That was one of the top three things that happened on this stream. See, Tim, I'm experiencing somewhat of a conundrum right now because I understand. I hear and listen to people out there and they say, Colin, you're too negative, right? You're too snarky or you're too, you know",
            "start": 7170.98
        },
        {
            "text": "Colin Moriarty, you're too negative, right? You're too snarky or you're too, you know, optimistic. Colin's the one that came out the womb complaining about how it was too warm in there. You understand? Now, but it's moments like these when you need Colin Moriarty because this is bad and someone's got to call it and say, this is boring. But then what do you want though? I don't want this at all. I don't think we need to watch it. I don't see, I don't understand that argument. Cause there's so many people in the chat like this fucking sucks. It's like, well, what do you expect? I do think it's a step down from what previous years. Really? I think I thought previous years were paced better and had more stuff happening that I enjoyed. Maybe that's it. I don't know. Cause I was watching last year about as exciting as this is. That's the problem is last year I don't have a good",
            "start": 7240.98
        },
        {
            "text": "better and had more stuff happening that I enjoyed. Maybe that's it. I don't know. Cause I was watching last year about as exciting as this is. That's the problem is last year I don't have a good perspective on it because obviously it was exciting for me. Like what I want is like, I feel like these kinds of shows with all, I like Geoff Keighley and I know he's a great guy. It's not an insult to him. I know he works really hard on this stuff. We work really hard on all of our videos and half the people that watch them hate him sometimes. That's just the way it goes. But the, the, the fact is, is that I feel like this particular thing is trying to rationalize what we do in video games and also make it like an adult thing in a very 20th century way. We don't need this kind of shit. Like this doesn't do anything for video games. And I, and I, I feel like we, there's a, there's a contrast between what we're seeing on the screen and then the tenor and tone of the show that doesn't resonate",
            "start": 7286.98
        },
        {
            "text": "doesn't do anything for video games. And I, and I, I feel like we, there's a, there's a contrast between what we're seeing on the screen and then the tenor and tone of the show that doesn't resonate with each other because they're fucking video games. And I feel like we need to, that needs to be said, like we don't need award shows like this. Just like we don't need scores on reviews. I like, I like award shows and I think that I thought they were on a good path. This was the first, this is the one where it feels like it's really, this year's really beating us over the head with the marketing and the ads and the no offense to Geoff Keighley, his Geoff Keighley's backstage segments and the Hydroxycut guy and all this stuff. You know what I mean? Like I remember this is the third Game Awards technically. The rest were the VGAs. And I remember watching being live for the first Game Awards with PSX in Vegas and be like, Oh, this is cool. This is something different. This is starting to feel like",
            "start": 7324.98
        },
        {
            "text": "The Game Awards with Kinda Funny\n \nThe rest were the VGAs. And I remember watching it live for the first Game Awards with PSX in Vegas and being like, Oh, this is cool. This is something different. This is starting to feel like something we own. Last year. Again, I'm biased. I was there. I thought it was a fine show, but I mean, like I can't talk to you about it now. And this one feels just off for some reason. This year is what I feel. That's interesting. I mean, I think the problem is people are talking about it as if it's the Grammys or the Oscars, but it's the VMAs on MTV. And I don't think it's like not trying to be that, you know, like it's just a bunch of things presented by AMD. And like, here's a bunch of trailers and like here's some music performances, like, and then, okay, cool. There's awards too. But like this is what a, you know, modern award show looks like. And I think that that's what they're aiming for. But hey, we have another event to get some exclusive reveals. Cool. But also like what were the",
            "start": 7360.98
        },
        {
            "text": "is what a, you know, modern award show looks like. And I think that that's what they're aiming for. But Hey, we have another event to get some exclusive reveals. Cool. But also like what were the reveals of any real like consequence except for the obviously the League of Legends things like it looks like Death Stranding again. I think I'm really am very concerned with the overexposure of this game. I think people are really crazy. They think this is a 2018 game. I just don't think that's possible. And the Guardians of the Galaxy obviously leaked. That's probably the most consequential thing we've seen tonight so far. So far. Yeah. And then, you know, Dauntless was whatever, you know, I thought Hideo Kojima's award was very heartfelt, even though, as I said, Geoff Keighley talking about Kojima, like his plane crash in 1951 in Korea. And then they held him for 10 years before releasing him. Other than that, I thought it was a very heartfelt kind of moment. So cool moment. Yeah, it was a very cool",
            "start": 7400.98
        },
        {
            "text": "his plane crash in 1951 in Korea. And then they held him for 10 years before releasing him. Other than that, I thought it was a very heartfelt kind of moment. So cool moment. Yeah, it was a very cool moment. So I'm not trying to be sarcastic or put things down. It's just like it's an advertised. It's a waste of time. This is like what what is the value of any of this? And that's I really feel that way. I feel like Greg Miller's speech last year inspired everybody's speeches. This year is much better. Yeah. And I think that everybody's speech so far in this one has been really great. And I think that that's that's good because then, OK, fine. We had a bunch of Dauntless and shit no one cares about this year, which means that maybe next year, the next year, the next year, we can get more shit like Death Stranding or the Telltale stuff. Get out your seats and freeze right now. Let's go. I think you're hitting I think you're hitting a good",
            "start": 7435.98
        },
        {
            "text": "The next year, we can get more shit like Death Stranding or the Telltale stuff. Get out your seats and freeze right now. Let's go. I think you're hitting a good point is the fact that the speech has been good. I want more of it. I do want more time. Like, I don't want this to take my hands off. No offense to whoever this is. I don't care. I mean, that's the thing is like I there needs to be a balance struck between the GDC awards are the awards for video game industry. Right. What? This is awesome. These guys. This is Game Over Greggy's music. Oh, no. The Video Game Awards are the game. The awards of GDC are what you'd expect from a video game award show where it is award, award, award, award. Here we are. Here we are. Thank you. We're independent gamers. That's great. It's great. It's not super exciting. People are too new to it for this. I don't I feel like when the Spike TV awards were getting off track was when it was here's Norman Reedus",
            "start": 7479.98
        },
        {
            "text": "That's great. It's great. It's not super exciting. People are too new to it for this. I don't, I feel like when the Spike TV awards were getting off track was when it was here's Geoff Keighley to introduce the fucking Uncharted 4. I'm like, what the fuck is like stumbling over names doesn't know what she's near. I just feel I don't know. I guess this one feels like it swung back a little bit too far towards being the VGA rather than the game awards. I thought I don't think game awards are finding their voice and getting when they need to be. But this one feels a little bit where it's like I'm seeing more. I feel it's off brand than on brand. Yeah, I think I think I can see the step back in terms of the going more towards the stuff. But I think that it's a sidestep and then are trying to go back minus the allies of the game. I think that's a little bit of a sidestep.",
            "start": 7526.98
        },
        {
            "text": "the allies of the game. I think that's a little bit of a The Game Awards 2016, and it's a big deal for the allies of the game.",
            "start": 7561.26
        },
        {
            "text": "a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a",
            "start": 7565.84
        },
        {
            "text": "bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a I think that's a little bit of a The vision is. Yeah, what how these things shake out. The point is that this show could have been ten minutes long. I mean, I'm not like it's just You're gonna be basing the award so far. You know, let's play let's pay, you know, homage to video games with this. I'm a big fan of hip hop, by the way. So I'm not making fun of the genre or having music. But I don't know. I just I just I don't understand the tenor of the show at all. I think I think this needs to change dramatically. And I think your last year's most powerful performance I thought was Steph Curry when she came on did the quiet. I'd like to see more",
            "start": 7612.84
        },
        {
            "text": "at all. I think I think this needs to change dramatically. And I think your last year's most powerful performance I thought was Stephanie Houston when she came on did the quiet. I'd like to see more shit like that. But I mean, granted now they say that they did do right. But I run the jewels is in the game. It's not like they're out of the blue. It's like I'm not going to. I was paying for the race. Stremond. I think so. You say the name. They just let my brother and his friends on stage. I love it. We're part of the rooster. Bernie. Nominated for best action adventure game, allow the host of Kinda Funny Live one and the host of Kinda Funny Live two. Both of the Game Awards hundred to a genetically engineered mercenary or from a futuristic nomad to a gifted assassin to whatever the hell Ratchet and Clank are. Seriously, I think one of the we all said I'm sure for this one. Ladies and gentlemen, your nominees for best action adventure game are. Best action adventure game. Massive",
            "start": 7656.84
        },
        {
            "text": "Ratchet and Clank are. Seriously, I think one of the games we all said I'm sure for this one. Ladies and gentlemen, your nominees for Best Action Adventure Game are. Best Action Adventure Game. Massive Ego goes last. Like there's some sort of thing. So you're going to look at it to see. Now, you're not losing your soul. One of the old \"butt queens.\" You want the left or the right? Because I'm 13 years old. I'm Ambie. What's that? What's the real punch? A real punch? College. How about you? Junior. I did knock Ramone out one day in college. That was that was real. Between the fridge and the oven? Yeah. The counter. And my other roommates laughed. That was real funny. They were the real men, right? They were the Jackdawg. I haven't gotten the shit beat out of me since high school. And the Game Award goes to. Here we go. Uncharted 4. Dishonored 2. Motherfucker. See again, I love it. Stoked as fuck. That motherfucker jumped up like hell yeah. Well, this is going to make the games obviously tanking",
            "start": 7713.84
        },
        {
            "text": "goes to. Here we go. Uncharted 4. Dishonored 2. Motherfucker. See again, I love it. Stoked as fuck. That motherfucker jumped up like hell yeah. Well, this is going to make the games obviously tanking and sales. And I think this is going to make them. But everyone knows it's a critical value. I'm looking forward to playing it. Overbreak. Overbreak. Yeah, it's definitely like high on the list. What I was thinking was. Actually, stop dates. What I played Dishonored 1 as well. I don't know if there's any time. I feel like I should. I can tell you right now. I feel like that's a closer move to play this equal. Well, then you're not going to play either of it. That's why you're out to get out of him. Now that I put it on the list, now I need a way out. So how do I get out of this? You're supposed to dance. Yeah. Go for it. Yeah, okay. So, Arkane has been around for 17 years. Believe it or not. So this is like the result of 17 years of creating the best team that we could, and we're damn.\n\nCorrected errors:\n\n- \"Arkchain\" → \"Arkane\" (correcting the name of the game developer)\n- No other significant changes were made to maintain the original meaning and tone of the text.",
            "start": 7792.84
        },
        {
            "text": "to dance. Yeah. Go for it. Yeah, okay. So, Ark: Survival Evolved has been around for 17 years. Believe it or not. So this is like the result of 17 years of creating the best team that we could, and we're damn. We're almost done. It's almost done here. It's an honor. It's amazing music and sound game of the year. Hideo Kojima, who is the creator, people are saying that the seats are empty. Is that true? Yeah, people just left hard. They never always. I commented early on in the thing that there was a whole one on multiplayer. I haven't seen multiplayer yet. Let me know if I miss that. The chat. This game was extremely hard to make. It's been a lot of hard work for everybody. So thank you for the team. Internet comments are so weird. Spouses. Someone in the chat says, that guy looks like he smells. Again, thank you everyone. Now that we've gotten away from it, one of the most aggressive comments I've seen, which I usually want to call out, but it just is like, I hadn't heard it. Somebody, there was",
            "start": 7832.84
        },
        {
            "text": "thank you everyone. Now that we've gotten away from it, one of the most aggressive comments I've seen, which I usually want to call out, but it just is like, I hadn't heard it. Somebody, there was a woman on the screen, and somebody said basically, I would suck a fart out of her. Yeah. And I was like, fuck, I've never heard that. You never heard of her? Well, this is like when Kevin had never heard. Who has a tongue punch, a fart box, or whatever. That's way more complicated. That's like calculus compared to pre-algebra. So good though. By the way, tell us about your reaction. My favorite is, she looks like she could suck a golf ball to her garden hose. Yeah. I've always enjoyed that. My dad's friend once said that when I was in college and we were together. My dad's not like a dirty dude. Like, you know, like he doesn't. And we'll see a little bit of that. He looked at me like, with a nervous laughter after that one. I'm like, I'm going to remember that forever. I'm sorry. I've had",
            "start": 7880.84
        },
        {
            "text": "Like, you know, like he doesn't. And we'll see a little bit of that. He looked at me like, with a nervous laughter after that one. I'm like, I'm going to remember that forever. I'm sorry. I've had quite a few years to where Javi is out trying to find his family and kind of deal with the Walking Dead universe, which is never easy to deal with. Yes. Well, you guys have done an incredible job with the series for many years. And I know it's coming out later in December, right? Yeah. At the end of December, December 20th. Okay. And we'll get to episode one then? Yeah. So there was just one issue, which was the season premiere was a little bit too big to fit into one episode. So we're actually releasing two episodes. The premiere is a two part, two episode premiere called \"The Ties That Bind\". Both episodes. I'm just pretending to hear what they're saying. Okay. \"The Ties That Bind\", December 20th. It's interesting. Episode one is going to be two parts, but at least on the same day. I don't know how",
            "start": 7926.84
        },
        {
            "text": "episodes. I'm just pretending to hear what they're saying. Okay. The Last of Us: Remastered, December 20th. It's interesting. Episode one is going to be two parts, but at least on the same day. I don't know how that understands. I don't know how it makes sense to me. World premiere. Here we go. Don't be shut up. First thing that matters. David, it's David. Hey, hey, David. I had to leave my car. It's traffic. Just backed up for miles. He's dead. No. H-95 says Greg looks like he could suck a golf ball. Greg looks like he gets like a golf ball through a guard nose. I could suck a golf ball through a straw. Where were you? I tried. I tried. I'm so sorry. She is not home yet. He's gone, Mijo. He's gone. All Hector's taking care of it. What are the plans for the future? David made arrangements with the father before he passed. You thirsty, baby? You want some juice? Grandpa's cup was empty. You don't have to fill his cup up anymore, baby. Grandpa is sleeping. No, Yaya. People's awake. Oh, my God. Baga!",
            "start": 7967.84
        },
        {
            "text": "before he passed. You thirsty, baby? You want some juice? Grandpa's cup was empty. You don't have to fill his cup up anymore, baby. Grandpa is sleeping. No, Yaya. People are awake. Oh, my God. Baga! equipment Baga! Baga! He's awake and he's just power bombed the Undertaker through a table. Get the medics out here. I'm not kidding. Baga! Rafael, how is this possible? How is this possible? He's just confused? He's just confused? What is this? Oh, my God. He's just confused? He's confused. What did he say? Oh, my God. Oh, my God. He's just confused. He's confused. I did whatever I had to do to protect the balls. Sometimes it's not enough. Some people looked out for me too. What happened to them? Same thing that happens to everyone. I'm not gonna get my girl mail still getting work. Episode 1 December. The Game Awards aren't done yet. Coming right up, the first ever live gameplay of Mass Effect: Andromeda. And we unveil the winner of Game of the Year. Streaming live all over the planet.",
            "start": 8028.84
        },
        {
            "text": "December. The Game Awards aren't done yet. Coming right up, the first-ever live gameplay of Mass Effect: Andromeda. And we unveil the winner of Game of the Year. Streaming live all over the planet. This is The Game Awards 2016. I think most live events are like that. I forget, are you a fan of Taylor Swift? No, I haven't played it. Oh right, she's a hard drive driver. It took her a real long time to get to episode 1. I haven't gotten to episode 2 yet. You tweeted the other day about how much gas when Batman's parents died. Which is a non-Sakura thing I understand. I should play them. There are some of the Telltale games that just don't grab me. I thought this was interesting. Oh, we didn't do Connor Greg Miller. Did anyone talk about this one? The Walking Dead's third season will let you import your saves. This comes from Eurogamer.net. Update, you can also create custom data to reflect your earlier choices. One of the nominees is Titanfall 2. If you haven't played it yet, here's",
            "start": 8150.2
        },
        {
            "text": "you import your saves. This comes from Eurogamer.net. Update, you can also create custom data to reflect your earlier choices. One of the nominees is Titanfall 2. If you haven't played it yet, here's your chance. Starting tomorrow through Sunday, December 4th, Titanfall 2 has a free multiplayer trial on Xbox One, PS4, and Origin for PC. You can play all the multiplayer maps and modes with all the weapons. Treat yourself to the gift of free with Titanfall 2. Now, on with the show. More power to remember trying though. Peter Moore says nobody's left on the battlefield. Bye Battlefront. BlazingHigh420 says, hey Colin, why don't you just turn around big boy and show me that huge fucking dumper. Alright. I like when you objectify me. Here we go, Mass Effect. Aaron. Hi everyone. It's great to be here to celebrate our industry. I heard he's a full blown racist. He was the first big shot I ever really met in the industry. Nice to meet you. I think I told you a story. I shared a cab with him",
            "start": 8220.08
        },
        {
            "text": "Be here to celebrate our industry. I heard he's a full-blown racist. He was the first big shot I ever really met in the industry. Nice to meet you. I think I told you a story. I shared a cab with him and we had an interesting conversation. We wanted to be here on behalf of the Mass Effect: Andromeda team. Our journey to Andromeda has taken us down a long path. A very long path. What's the fucking date? And making games is very, very hard. And this team has been doing everything they can to bring you a whole new adventure. So, thank you for your patience and sometimes thank you for your lack of patience. It's amazing for us as developers to see how excited you are for more Mass Effect. So tonight, at long last, here's your first look at Mass Effect: Andromeda. Let's do it. Mass Effect: Andromeda is the next generation of action RPG. Yeah. No way this is home. Brand new epic sci-fi adventure set in a vast explorable galaxy. You are the Pathfinder. Part explorer, part soldier, part guide.",
            "start": 8278.08
        },
        {
            "text": "The next generation of action RPG. Yeah. No way this is home. Brand new epic sci-fi adventure set in a vast explorable galaxy. You are the Pathfinder. Part explorer, part soldier, part guide. And it's your mission to find a new home for humanity. But in Andromeda, resources are scarce. Worlds are hazardous or outright uninhabitable. Every planet has its own story. On this one, boring outlaw factions fight over every available scrap. You can make new allies or enemies. The choice is yours. Not too shabby for folk who got kicked off the station with nothing to show for it. All I see is the trail of bodies they left behind. Wow, awkward eyes there. Mass Effect: Andromeda, tell me about this new galaxy. All new aliens. You look like the last one. I know they're from the same galaxy. Interestingly, this galaxy has the same exact aliens as the last galaxy. Nearly? She was involved in multiple altercations with other officers. The Krogan? It looks way more lively. Like these commercial areas? Oh yeah",
            "start": 8329.08
        },
        {
            "text": "Has the same exact aliens as the last Galaxy. Nearly? She was involved in multiple altercations with other officers. The Hadi-head? It looks way more lively. Like these commercial areas? Oh yeah, you look just like that. These worlds are big, so for the sake of time, we're going to speed up our adventure. There are many paths to follow on this planet, and you'll need everything in your disposal to survive. I'd throw a nice throwback to the original NASA. Whether it's the six-wheel-drive Nomad, which protects you from hazards and enemies, or the scanning and analysis tools to help you interpret everything you discover. Yeah, way more open and seen geographically topographically diverse. The tracks make it look like an ambush. Fits the Rokar profile. It's a start. And Garin blood. Matches your Rokar theory, Reyes. Keep scanning. We need hard evidence. In a dangerous alien galaxy desperate for resources, conflict is inevitable. But you'll have access to futuristic weapons, gear, and",
            "start": 8391.08
        },
        {
            "text": "your Rokar theory, Reyes. Keep scanning. We need hard evidence. In a dangerous alien galaxy desperate for resources, conflict is inevitable. But you'll have access to futuristic weapons, gear, and powers to help you in your fight for a new home. You like mass effecting? No. You don't play it? Mm-hmm. But you can fuck in this game, you know? I heard. What do they do in real life? Gameplay looks pretty. Yeah. The cuts are good. Though you start out with the ship and the Nomad, almost everything else you need, you'll have to find, steal, or craft yourself. Unless you pre-order. And that's critical. These worlds have many dangers, from environmental hazards to hostile wildlife. Does this make you guys wired? Oh yeah. I'm looking around at some of these animals and stuff, but they're clearly still as many as you can. No Man's Sky! No Man's Sky! Doesn't that know what? I haven't done that in a long time. Oh shit. She did. Also interesting, they're using the Fem Chef version",
            "start": 8460.08
        },
        {
            "text": "clearly still as many as you can. No Man's Sky! No Man's Sky! Doesn't that know what? I haven't done that in a long time. Oh shit. She did. Also interesting, they're using the Female Chef version of the character, when everybody's like, I can't believe he ate him, he's like a false female. Dead. Nice. Nice. Kevin, that thing that got shot at you. Got him! Good shot, Jensen! I got him. Give me the fucking date! The galaxy awaits. I'm ready. They're not gonna give you shit. They're not gonna give you shit. How far will you go? Spring 2017. They're still sticking by it, huh? Yeah, but they're gonna do that normal shit of like, how long is spring? Well apparently when ZenoBoi said Cosmic Star Hero, when it was gonna come out in the summer of 2016, that meant 2017 sometimes. Our industry and the diverse and unique games nominated for Game of the Year reflect the breadth of genres and the ingenuity of the creative teams. Game of the Year, I said Inside, you guys said Overwatch. Not that I think",
            "start": 8554.08
        },
        {
            "text": "and unique games nominated for Game of the Year reflect the breadth of genres and the ingenuity of the creative teams. Game of the Year, I said Inside, you guys said Overwatch. Not that I think that. Predictions. Inside is the game. Predictions. So currently, before Game of the Year, I have 7? Correct. Colin has 7? Correct. Tim has 9? Correct. So we can't win? No, we can't win. Hip-cha! Here it is. The Game of the Year at the Game Awards 2016 is... Overwatch. There you go. Tim and Colin get it right. Colin ends with 8, Tim with 10, you with 7. Nice. Tim, I hope you accept your trophy for getting the predictions of the Game Awards correct. Oh my god. It's very heavy. It is very heavy. Oh my god, I never saw this. Oh, my name on it? Your name's on it. Yeah. We'll peel it off and put yours on there for... Thank you, thank you. Thank you. Thank you, everyone who voted for our game. Overwatch has been created by an incredibly talented and passionate team, and I'm so happy to see that this",
            "start": 8621.08
        },
        {
            "text": "there for... Thank you, thank you. Thank you. Thank you, everyone who voted for our game. Overwatch has been created by an incredibly talented and passionate team, and I'm so happy to see that this reward... The Game Awards is fucking off the rails in general. Chemistry is a bit of a mess. Puke, puke, puke. Honey Boo Boo says, \"dorks\". Genietikit says, \"#NotMyGameOfTheYear\". Don't blame me, I voted for Inside. And we're not done yet, we got a lot further to go. So on behalf of the Overwatch development team and everyone at Blizzard that helped make this game happen, thank you so much. Congratulations to Overwatch. We also want to acknowledge our Xbox Live winner tonight who is competing online. Congratulations to Akira \"Ronin\". I don't know what that means. You know, since I was a teenager, games have been my life's passion and we are so excited to have the entire industry here every year to celebrate our love of games. Thank you so much to everyone watching all around the world. Thank you to everyone",
            "start": 8720.08
        },
        {
            "text": "my life's passion and we are so excited to have the entire industry here every year to celebrate our love of games. Thank you so much to everyone watching all around the world. Thank you to everyone in the game industry for the great games you make. Have a great holiday season, great new year. We'll see you in 2017. Good night. We'll be low to early. With what? That's right. Oh yeah, that was cool. It's been so long though, I forgot. Yeah. So congratulations Tim Gettys. Yay. You won the predictions and started on your very show, the Gamescast. Alright, so here's a little piece of news. I tweet out the fact that BioWare and EA refused to announce a date for Mass Effect: Andromeda. Has me worried, something has to be wrong. Aaron Flynn, one of these days I'll buy you a beer, dot dot dot. And that's saying what's wrong. That's the head of BioWare, of course. Tell him to come over right now. Right now. That was fun. That was fun. I like hanging out with you guys. I like these things. Yeah, these are",
            "start": 8809.08
        },
        {
            "text": "what's wrong. That's the head of BioWare, of course. Tell him to come over right now. Right now. That was fun. That was fun. I like hanging out with you guys. I like these things. Yeah, these are fun. Hanging out with you of course too. This has been fun. It's all part of it. End of show. It says up there real quick. I guess closing thoughts. I don't think we need to do a post show. No, no, that's what I'm saying. So closing thoughts. Yeah, yeah, yeah. It was what it was. Yeah. Guillermo del Toro. Okay, cool. Congratulations to Boogie. Yes. Guillermo. Absolutely. Guillermo. Guillermo del Toro. Am I doing that right, Kevin? Kevin, can I get a minority report on the pronunciation of Guillermo? Guillermo. You're all an alien. You all are an alien. Guillermo. But how can we all be an alien? Yup, that's right. I like our background right now. Shout out to Kev. Good job, Kev. He does cool things. He does do cool things. Kevin. Death Stranding, cool. Yeah. Very cool. Walking Dead, I'm",
            "start": 8863.08
        },
        {
            "text": "Yup, that's right. I like our background right now. Shout out to Kevin. Good job, Kevin. He does cool things. Death Stranding, cool. Yeah. Very cool. Walking Dead, I'm excited for. Guardians of the Galaxy, I'm excited for. I didn't think there was a world for me. Yeah, well. Even Batman did more. They had like flipping pages for me to look at. Are you gonna cry? I can't believe we're no longer the trending gamer. Yeah, what else was there? I mean, I think the Guardians of the Galaxy thing was an announcement. It just sucks that everyone already knew it. Like, that would have been cool otherwise. What else we got? There was some of those. Oh, the Zelda stuff. The Legend of Zelda trailer is fucking awesome. The Zelda gameplay. It's like we didn't need that. It looks fun. That's the thing is it was a whole new area. Like we haven't seen that stuff. So it's like it's cool to see something different because we've only had the same 30 hours of footage of the same place for a while. So that's cool. But",
            "start": 8911.08
        },
        {
            "text": "new area. Like we haven't seen that stuff. So it's like it's cool to see something different because we've only had the same 30 hours of footage of the same place for a while. So that's cool. But I thought both the Zelda and Mass Effect sections were like that's old school. Sure. Yeah. Cool. We don't really need to. Brannox brings up best parts, entire Kojima sequence, that Dragon's Dogma acceptance speech, the Doom performance. Nolan North nor the speech agreed. And then worst parts, other musical performances. I mean, honestly, I thought the speeches were great. I really, I thought every speech was awesome. Yeah. I don't know if you see it, but it's on point. OK, good. No, no. I thought Nolan North speech was great. It is interesting that there's so many high profile voice actors that don't say anything about the performance matters, about the strike. Nolan taking that moment to address it was pretty cool. I thought. Yeah. Let's give a shout out to the developers and go back.",
            "start": 8958.08
        },
        {
            "text": "that don't say anything about the performance matters, about the strike. Nolan taking that moment to address it was pretty cool. I thought. Yeah. Let's give a shout out to the developers and go back. Absolutely. Yeah. But I think that this this is good that they they were able to do that stuff. And I said it earlier, but I do think that your speech last year, like made people realize, like, this isn't just a time to thank people. This is a time to say something. No, it's definitely wasn't a time to thank people. It was just it was it was in the order that things went wrong for him. I'm upset. I don't get it because I didn't. I think Colin Moriarty was really upset about that. Oh, yeah. It wasn't a time to thank people. Yeah. You weren't thinking this year. Listen, I just wanted to start. And I worked really hard on the game. Yeah, you did. Just start off. Thanks, Colin. No, I think that the Nolan North thing was that was one of the only the few consequential moments of the",
            "start": 8996.08
        },
        {
            "text": "And I worked really hard on the game. Yeah, you did. Just start off. Thanks, Colin. No, I think that the Nolan North thing was that was one of the only the few consequential moments of the entire show and says it all. I think about how, you know, it's not so honky dory with a lot of voice actors, I think that they know how tone deaf this is and that the strike is clearly not working. So we know game developers personally, lots of them. And you hear a lot of harrowing stories about their lives because I know people that have gotten divorced over working on a game too much. And you hear kids' birthdays being missed, kids growing up while their parents work crunch, working eighty, ninety, one hundred hours a week on these games. I mean, listen to Amy Hennig's speech that she gave just not too long ago about her time on Uncharted. The real MVPs and the real heroes of the industry are the people that make the games, not the people that stand in booths or in mocap suits for a few weeks for a game.",
            "start": 9034.08
        },
        {
            "text": "about her time on Uncharted. The real MVPs and the real heroes of the industry are the people that make the games, not the people that stand in booths or in mocap suits for a few weeks for a game. That I'm not discounting those people. I know and love those people. I'm personal friends with Troy Baker. I'm friends with a lot of these people. Acquaintances. Acquaintances. Well, we throw the word friend around. I'm fucking around. I mean, we're all basically acquaintances. Agreed. Yes. So I really feel like that it was an important and salient thing for him to come out as the most notable voice actor that has ever been in games and may ever may very well ever be. You know, depending on how diverse it gets in the future and come out and say this is bullshit because that's basically what he said. The people that make these games really do sacrifice a great deal and get paid not very well compared to the people that go into those those VA booths. And it's not like movies. They're not the",
            "start": 9080.08
        },
        {
            "text": "said. The people that make these games really do sacrifice a great deal and get paid not very well compared to the people that go into those voice actor booths. And it's not like movies. They're not the reasons that people come in and play these games. I don't know one fucking person that's in that Mass Effect game. I'm sure I know them, but I have a lot of cash. And that doesn't matter. They're not going to promote it as Mass Effect, starring whoever. And so I think that, you know, voice actors do have their own experiences that I think are tough. They should be treated better. And but people that are like, well, the voice actors are doing this for everyone. I'm like, bullshit. No, they're not. And second of all, if you unionize all game development, watch all your games get developed in Eastern Europe and South America, because that's exactly what's going to happen. And I'm not saying there's anything wrong with that. But if I owned if I was a publisher and suddenly American studios were",
            "start": 9121.08
        },
        {
            "text": "Europe and South America, because that's exactly what's going to happen. And I'm not saying there's anything wrong with that. But if I own if I was a publisher and suddenly American studios were unionizing, we're not making games in America anymore. So, you know, and that could be easily done. Look at all the great games that are coming out of Ukraine and Poland and Brazil and all these places. So I think that that was a really great moment. And I want to give Hideo Kojima I haven't seen him in a while, but I want to give him a lot of credit for what I thought was a really, really great moment on the show. And my only concern, other than we talked too much about the show itself and how how maybe it shouldn't exist or it wasn't very good or whatever. But I want to specifically talk about Death Stranding, because I just feel like they're really getting dangerously close to overexposing this game. And I'm not going to say that it looks awesome. It looks fantastic. And I have no doubt Hideo Kojima is",
            "start": 9156.08
        },
        {
            "text": "because I just feel like they're really getting dangerously close to overexposing this game. And I'm not going to say that it looks awesome. It looks fantastic. And I have no doubt Kojima is going to deliver something really, really thought provoking and really interesting. But you got to go away and make the game now. I don't want to see this. But I mean, you've been saying that from for every conference they've been showing up at and they continue to show up at every conference. I mean, let's not fool ourselves. I bet they're at PSX. I bet Hideo Kojima comes out with an extended thing like here's the rest of Metal Gear Solid's scene. And that is the weird thing of like at what point do you fucking take the cork and put it in the bottle and you stop pouring this out? Because remember when they started showing all this stuff and then they were like, yeah, we're still deciding what engine to use. And it's like what? And like Jeff said during this thing that during PSX, he is the panel",
            "start": 9193.08
        },
        {
            "text": "they started showing all this stuff and then they were like, yeah, we're still deciding what engine to use. And it's like what? And like Jeff said during this thing that during PSX, he is the panel with Hideo Kojima. It's him talking about the engine they're using and what they're doing. It's like, I agree. Go make the game. But I don't think we're done seeing little bits and pieces of this. I'm on the other end of this with you. And we've spoken this many times, but I think that not every game, but I think the game, the industry needs games like Hideo Kojima's games or like Final Fantasy VII is to Kingdom Hearts or whatever. And like those are kind of on the other end of the spectrum of like, all right, it's a little bit of a joke of how long they take to do. But I feel like for every Fallout 4, we need things that are like these are things to look forward to. And these are a big tentpole events that will eventually happen. And as long as we're not seeing too much gameplay over and over and over",
            "start": 9232.08
        },
        {
            "text": "things that are like these are things to look forward to. And these are a big tentpole events that will eventually happen. And as long as we're not seeing too much gameplay over and over and over, which is something we saw with Final Fantasy Versus XIII, where the amount of demos we got was ridiculous. Like Kojima games to me mean something. And they mean a lot of ridiculous 15 minute trailers over the course of four years before you get to play a game. And I'm cool if that keeps happening. Like it's I'm about the hype when it comes to the stuff. And that's what these types of shows are about. So I like seeing them. I like that type of stuff. And I'm happy that we got way more than I thought we were going to for this game. I thought it was going to be maybe like I predicted even for PSX. I thought it was going to be I said, I hope that it's a little more than concept art. Well, I don't necessarily disagree that it's good that we didn't see gameplay. I don't think we've seen gameplay because",
            "start": 9265.08
        },
        {
            "text": "it was going to be I said, I hope that it's a little more than concept art. Well, I don't necessarily disagree that it's good that we didn't see gameplay. I don't think we've seen gameplay because I don't think the fucking game really exists. And that's one of the things that I'm really concerned about. Sony just signed this game when you're looking at it through the context of how long it takes to make a game. And like you were saying, Hideo Kojima and Mark Cerny traveling around the world looking in search of new technology is one of my favorite things that happened this year. Was, you know, they found their engine and I have no doubt that the game is going to be compelling, but they Sony PR specifically, because they're really responsible for this. Kojima is not allowed to go out and just do whatever he wants. And it seems like the Japan side PR needs to learn that a lot of games get burned by overexposure and saturation. And if they keep going down this road because people, some people in",
            "start": 9303.08
        },
        {
            "text": "he wants. And it seems like the Japanese side PR needs to learn that a lot of games get burned by overexposure and saturation. And if they keep going down this road, because people in the chat are saying, well, they didn't show that much of the game. I'm like, you're crazy. You're fucking crazy. Like this game for what little it is. And since it's been announced everywhere. And I'm like, you've got to be careful with this. You hate yourself. This game isn't coming out in twenty eighteen. And you know, how long are we going to see it? And then it's going to be weird when it goes away for a couple of years and then comes back. And I think that it looks radically different. And we don't know what it looks like because anything. But I mean, I think just based on what you expect this game to look like, I don't think it looks like what it's going to look like when it gets there. So I do really think that there is a concern for me because I think this game needs to be great. And I",
            "start": 9337.08
        },
        {
            "text": "to look like, I don't think it looks like what it's going to look like when it gets there. So I do really think that there is a concern for me because I think this game needs to be great. And I think that the greatest thing to do is for them to have signed Kojima, made a big deal about it and just disappeared. And then in two years, go to E3 and have this amazing thing. Like people are asking, clamoring, getting excited, you know, because, yeah, we have a lot of questions, a lot of curiosity. But I don't necessarily think that hype is good for these games. And in fact, there's so much evidence that hype is terrible for games. There's actually an overwhelming amount of examples that hype is terrible for games. Look at No Man's Sky. No Man's Sky. So other than that, you know, I give Jeff Keighley a lot of credit for doing this. It's like a Herculean effort to get this off the ground or whatever. But and it's another",
            "start": 9368.08
        },
        {
            "text": "Man's Sky. No Man's Sky. So other than that, you know, I give Jeff Keighly a lot of credit for doing this. It's like a Herculean effort to get this off the ground or whatever. But and it's another company we'll do in a games cast next week. We should have a conversation about how do we celebrate games and and how do we celebrate the game industry? And I think that this is a very we're supposed to be a forward looking and very futuristic and very 21st century form of entertainment. This is a very 20th century thing that just happened tonight. And I just don't think we need it. It's the same. We got to think about different ways of doing the same. Same for the games. I agree. But what do we think? Mass Effect. I thought I thought. Yeah, I thought it looks like Mass Effect. Yeah. Yeah. That was the one thing where, like, yeah, the cut scene or them talking to each other looked weird. Yeah. It wasn't even just that one time. There was like multiple. Sure. When you're running through",
            "start": 9401.08
        },
        {
            "text": "was the one thing where, like, yeah, the cut scene or them talking to each other looked weird. Yeah. It wasn't even just that one time. There was like multiple. Sure. When you're running through the thing and like talking to the other. Similarly to what I was saying on Gamescast about Final Fantasy XV. But it's like just it's it's weird when everything looks so good and then the animations of the face look off. Yeah. This is a game that's been in development for a long time and you can see that. And I don't know if I can read into what Aaron Hirsch (assuming this is a mistake, as there is no notable figure by this name related to The Game Awards) said to me. I don't know if that's you know, like I hope to see him soon. But it sounds like things that were going awry. And maybe they've and maybe they've righted the ship and maybe they're just not competent enough to announce a date. But the fact of the matter is spring is a very finite end of Q1 beginning of Q2 kind of area. And they won't put a date on it says to me that, you know, there's a lot of concern internally that they're not",
            "start": 9440.08
        },
        {
            "text": "fact of the matter is spring is a very finite end of Q1 beginning of Q2 kind of area. And they won't put a date on it says to me that, you know, there's a lot of concern internally that they're not going to nail it. And I also think that the game appears, you know, I'm a huge Mass Effect fan. I fucking love Mass Effect. And it looks exactly what I like, what I want. But it does look like a game that is like uncanny valley kind of weird shit going on. I'm like, we've kind of progressed past this. You guys have been working on this game almost too long. And it makes me wonder, like, should you just just get this one out as well? Yeah, I'm like, and just and just and just move on. But I think I can't wait. I mean, I'm day one, day second one when I get that game preorder. No, no, no, no, no, no. You're day one. You might as well just preorder. No, no, no, no. I'll probably be that, you know, negative. I know we'll get a negative 15 or something technically. But I think it looks great and",
            "start": 9477.08
        },
        {
            "text": "No, you're day one. You might as well just preorder. No, no, no, no. I'll probably be that, you know, negative. I know we'll get a negative 15 or something technically. But I think it looks great and I'm excited about it. And I hope that they are able to you know, it's an important one to get right because it's got to harness the energy to get another trilogy out, which I think is what their intention is. And so I think they realize that they probably got the first one in the last trilogy wrong. I disagree. I think it was a great game. But I'm in the minority on that. And so I think that they're being very thoughtful and probably very deliberate with what they're trying to do here. So they don't have to rebuild the game for the second one like they did with The Last of Us 2. And then maybe we'll get the second one in 18 to 24 months or something like that. Yeah. Yeah. Get it out quicker. All right. Well, ladies and gentlemen, thank you so much for joining us here on Twitch.tv slash",
            "start": 9512.08
        },
        {
            "text": "we'll get the second one in 18 to 24 months or something like that. Yeah. Yeah. Get it out quicker. All right. Well, ladies and gentlemen, thank you so much for joining us here on Twitch.tv slash Kinda Funny Games for this, the watch along of The Game Awards 2016. Of course, we'll be back tomorrow morning at 11 a.m. with Colin and Greg live. So make sure you click the follow button. See no one we go live. Subscribe if you want to. No big deal if you don't. We got a whole bunch of YouTube channels. You can get that was Kinda Funny dot com. And until next time, no, Kevin sucks. And it's been our pleasure to serve you. Kevin, you don't suck. I love you a lot. Big fan, Kevin. You. You.",
            "start": 9545.08
        }
    ]
}