{
    "id": 234,
    "video_id": "2NZAGAVnRQo",
    "show_name": "Oreo Oration",
    "hosts": [
        "Greg Miller"
    ],
    "title": "NASCAR Oreo Cookie Review - Oreo Oration",
    "description": "Vroom. Vroom. Oreos.\n\nSUBSCRIBE / LIKE / SHARE / BUY A SHIRT: http://www.districtlines.com/gameovergreggy\n\nWhile you were living your life, Nabisco went crazy and made an army of Oreo cookies. Every Wednesday and Friday, Greg Miller tears open a new package and reviews a new version of Milk's Favorite Cookie. \n\nSubscribe so you don't miss a review: http://www.youtube.com/user/gameovergreggy?sub_confirmation=1\n\nLet us know what Oreo we should review next in the comments.\n\nFollow Greg on Twitter: http://www.twitter.com/gameovergreggy\n\nLike Greg on Facebook: http://facebook.com/gameovergreggy\n\nCheck out the Oreo Oration FAQ: http://www.youtube.com/watch?v=aO6zw2LeJ3c&list=PLOlEpGVXWUVseSo6bQHB1ad2cN_qV3aXs&index=1\n\nOur theme is \"Game-A-Tron\" off of Daemon Hatfield's album Colorbeam. Buy it on iTunes: https://itunes.apple.com/us/album/colorbeam/id426986325\n\nThanks to Nick and Tim for filming.\n\nMega-Thanks to Matt Gravish for making the Oreo Oration logo and intro.",
    "published_at": 1393596570,
    "duration": 375,
    "transcript_chunks": [
        {
            "text": "What's up everybody Welcome to Oreo Oration I'm Greg Miller, and while you're outside tearing down your Christmas lights, come on, it's already March - what are you freaking doing? The fine people at Nabisco were making endless variations of milk's favorite cookie. So every Wednesday and Friday, I tear open a new package and give you a tasty review without any calories. If you like that, like this video, subscribe to us here on YouTube, and please share it with your friends - it means a lot. Today we're reviewing Vroom Vroom Double Stuf NASCAR Oreos. Wow, honestly, I don't know why I'm doing it; I'll tell you that right now. I mean, well in general, why do you do this? Why do you do a show about Oreos that no one really watches? No one pays you for, but that's beside the point. Right now, I don't know NASCAR - it's a Double Stuf Oreo; how different can it be? But this falls into very similar packaging and very similar look uh as we are in the first look uh to that of the Halloween Oreos, you remember",
            "start": 0.59
        },
        {
            "text": "NASCAR it's a Double Stuffed Oreo, how different can it be, but this falls into very similar packaging and very similar look uh as we are in the first look uh to that of the Halloween Oreos you remember those guys? You remember the Halloween ones they have the special designs and stuff. Same with the football right. Anyways we got NASCAR Double Stuffed Oreo we got uh Tony Stewart here I lived in Missouri so I know a little bit about NASCAR and I don't know that guy if he was Carl Edwards I would have known that shows you how much I'm able to know about anyways uh they got they got the four they got four fun designs same Great Taste we remember this before though was it really the same great T let's jump in and see what we got here the first look patented First Look of course Whoa We got some they look like they hit some crazy turns on the NASCAR track right I don't I didn't have any NASCAR puns saved up I'm sorry uh not a terrible first look they're looking good take a smell my nose literally",
            "start": 45.64
        },
        {
            "text": "look like they hit some crazy turns on the NASCAR track right I don't I didn't have any NASCAR puns saved up I'm sorry uh not a terrible first look they're looking good take a smell my nose literally touched one of those so I'll try to get that out of there so no one takes that home so we'll get that one out of there and that one too they were both in the area of what was happening but smell good they smell like Double Stuf Oreos like we talked about let's see if we can figure out all the crazy designs they got here first off a 39 we never did I never did this one with the Halloween Oreos I felt bad about it after the fact so we got 39 is one we got a car they're getting clever with uh what designs are putting on these Oreos and now we got a 14 all right I think I think they might have been a bit liberal with we're making we're having fun designs on our cookies if they're just the same they're just numbers if we're just alternating numbers oh here's a fun one all right Oreo with",
            "start": 82.52
        },
        {
            "text": "a bit liberal with we're making we're having fun designs on our cookies if they're just the same they're just numbers if we're just alternating numbers oh here's a fun one all right Oreo with the checkered flag I like that lot all right so far fun designs they are not very fun designs they are just 1419 no 14 that's not right 1439 a car I like this one the best they should have all just been this Oreo and Checkered Flag that's what I um next part of anything of course for the Oration The Taste let's see how this one tastes here's we've talked about this before the designs we all know that a normal Oreo looks like this right and it's got the raised ridges it's got this it's got little designs here but when you take an Oreo then and start taking out massive chunks of where the designs are where the three-dimensional shape should be I do think it throws off the wafer taste it doesn't give you the same taste this is a double stuffed Oreo it should be oh it's a double stuffed Oreo I love",
            "start": 125.76
        },
        {
            "text": "where the three-dimensional shape should be I do think it throws off the wafer taste it doesn't give you the same taste this is a double stuffed Oreo it should be oh it's a Double Stuffed Oreo I love the but something's different about them they just feel less than if that makes sense they're not you know you don't eat it in immed like oh my God yes you know in a NASCAR Oreo I'm eating Tony Stewart's number I guess and then the other guy does he say who he is on the back here a hold on I can win a trip oh he signed it above it Ryan Newman, Tony Stewart, and Ryman Ryan Newman sorry Ryan Newman you're not as famous as Tony Stewart or Carl Edwards Carl Edwards should have been in the Box um again let's see if milk brings it together oh the picture is getting heavier I'm getting weaker I don't know what's happening ah jeez Louise one two three okay the milk's making the cookie more pronounced I'm a big fan of that you're getting more of that chocolatey taste before it was you know the the",
            "start": 191.36
        },
        {
            "text": "know what's happening ah jeez Louise one two three okay the milk's making the cookie more pronounced I'm a big fan of that you're getting more of that chocolatey taste before it was you know the the wafer part of the cookie it was getting lost it was just the cream the influx of cream washing over your tongue taking everything away robbing you of that chocolatey taste milk helps bring it back out that's a big thing let's see how the twist got to do our best two out of three from the package closed again so here we go this is number one that's a great twist that's a good twist number two a great twist all right so you don't have to worry about them they twist great they twist like double stuffs now you got your quadruple stuff you got a great life um final score I'm G to give him a flat eight I mean they're still good right especially for people who want the double stuffed cream the cream is there if you if you ever feel like you want more cream than you want cookie that's where you",
            "start": 238.92
        },
        {
            "text": "Eight, I mean they're still good right, especially for people who want the Double Stuffed cream. The cream is there if you if you ever feel like you want more cream than you want cookie, that's where you want to go. Cuz again, I think you're losing a lot with these crazy designs. There's so much Blank Space there, you're losing the space, the the you know it's getting thrown off what you're expecting out of an Oreo still. It's a Double Stuffed Oreo, you're not going to go wrong probably if you know what you're getting. That's the way the cookie crumbles for NASCAR Double Stuff Oreos, but what do you think? If you live in a Southern state, you probably live on these NASCAR cookies and what other NASCAR Mountain Dew, NASCAR bread, NASCAR milk they sell. Give me a video response in the comments below. Review the cookie for yourself, let me know if I was wrong then. What else do I tell you to do here? It's the outro that I'm rough on. Like the video, subscribe to my channel, share it with your friends.",
            "start": 297.36
        },
        {
            "text": "below review the Oreo cookie for yourself, let me know if I was wrong; then what else do I tell you to do here? It's the outro that I'm rough on. Like the video: subscribe to my channel, share it with your friends so everyone can come see the cookies. Uh, let me know what cookies I'm missing in the comments below. Just tell me, \"you're missing this cookie.\" I live in [state or country], or this is how you get it. Great, that's all I want. And then check back every Wednesday and Friday for a brand new review. Until then, keep on dunking.",
            "start": 336.52
        }
    ]
}